{
    "status": true,
    "data": {
        "start": 3701,
        "end": 3848,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 3701,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ حَدَّثَنَا رَبَاحٌ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أُمِّهِأَنَّ أُمَّ مُبَشِّرٍ دَخَلَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَجَعِهِ الَّذِي قُبِضَ فِيهِ فَقَالَتْ بِأَبِي وَأُمِّي يَا رَسُولَ اللَّهِ مَا تَتَّهِمُ بِنَفْسِكَ فَإِنِّي لَا أَتَّهِمُ إِلَّا الطَّعَامَ الَّذِي أَكَلَ مَعَكَ بِخَيْبَرَ وَكَانَ ابْنُهَا مَاتَ قَبْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَأَنَا لَا أَتَّهِمُ غَيْرَهُ هَذَا أَوَانُ قَطْعِ أَبْهَرِي",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Khalid] Telah menceritakan kepada kami [Rabah] Telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Abdur Rahman bin 'Abdullah bin Ka'ab bin Malik] dari [ibunya] bahwa Ummu Mubasysyir bertamu ke kediaman Rasulullah Shallalahu 'alaihi wa sallam saat beliau sakit keras yang menyebabkan beliau wafaT, ia berkata: Engkau lebih aku muliakan dari pada ayah dan ibuku wahai Rasulullah, apa yang Tuan sangkakan pada diri Tuan, aku menyangka makanan yang aku makan bersama Tuan di Khaibar -putranya meninggal sebelum Nabi Shallallahu 'Alaihi Wasalam wafat- Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Aku tidak menyangka lainnya, ini adalah saat terputusnya tulang punggungku.\""
            },
            {
                "number": 3702,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ ثُمَامَةَ قَالَخَرَجْنَا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ إِلَى أَرْضِ الرُّومِ وَكَانَ عَامِلًا لِمُعَاوِيَةَ عَلَى الدَّرْبِ فَأُصِيبَ ابْنُ عَمٍّ لَنَا فَصَلَّى عَلَيْهِ فَضَالَةُ وَقَامَ عَلَى حُفْرَتِهِ حَتَّى وَارَاهُ فَلَمَّا سَوَّيْنَا عَلَيْهِ حُفْرَتَهُ قَالَ أَخِفُّوا عَنْهُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا بِتَسْوِيَةِ الْقُبُورِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] Telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Tsumamah] berkata: Kami pergi bersama [Fadlalah bin 'Ubaid] ke kawasan Romawi, ia adalah bawahan Mu'awiyah untuk tugas peperangan dan saudara sepupu kami terbunuh, Fadlalalah mensholatinya lalu ia berdiri diatas liang hingga ia menutupinya dengan tanah. Saat tanah kami ratakan, ia berkata: Ratakan karena Rasulullah Shallalahu 'alaihi wa sallam dulu memerintahkan kami untuk meratakan kubur.  "
            },
            {
                "number": 3703,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ يَزِيدَ بْنِ حَبِيبٍ عَنْ أَبِي مَرْزُوقٍ عَنْ فَضَالَةَ الْأَنْصَارِيِّ سَمِعْتُهُ يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْهِمْ فِي يَوْمٍ كَانَ يَصُومُهُ فَدَعَا بِإِنَاءٍ فِيهِ مَاءٌ فَشَرِبَ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّ هَذَا الْيَوْمَ كُنْتَ تَصُومُهُ قَالَ أَجَلْ وَلَكِنْ قِئْتُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] Telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yazid bin Hubaib] dari [Abu Marzuq] dari [Fadlalah bin 'Ubaid] aku mendengarnya bercerita bahwa Rasulullah Shallalahu 'alaihi wa sallam pergi mendatangi mereka saat beliau puasa lalu beliau meminta bejana berisi air kemudian minum, kami berkata: Wahai Rasulullah, bukankah Tuan puasa? Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Benar, tapi aku muntah.\""
            },
            {
                "number": 3704,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ حَدَّثَنَا حَيْوَةُ قَالَ أَخْبَرَنِي أَبُو هَانِئٍ حُمَيْدُ بْنُ هَانِئٍ عَنْ عَمْرِو بْنِ مَالِكٍ الْجَنْبِيِّ حَدَّثَنِي أَنَّهُ سَمِعَ فَضَالَةَ بْنَ عُبَيْدٍ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُسَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَدْعُو فِي الصَّلَاةِ وَلَمْ يَذْكُرْ اللَّهَ عَزَّ وَجَلَّ وَلَمْ يُصَلِّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَجِلَ هَذَا ثُمَّ دَعَاهُ فَقَالَ لَهُ وَلِغَيْرِهِ إِذَا صَلَّى أَحَدُكُمْ فَلْيَبْدَأْ بِتَحْمِيدِ رَبِّهِ وَالثَّنَاءِ عَلَيْهِ ثُمَّ لِيُصَلِّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ لِيَدْعُ بَعْدُ بِمَا شَاءَ",
                "id": "Telah menceritakan kepada kami [Abu 'Abdur Rahman Al Muqri`] Telah menceritakan kepada kami [Haiwah] berkata: Telah mengkhabarkan kepadaku [Abu Hani` Humaid bin Hani`] dari ['Amru bin Malik Al Janbi] telah menceritakan kepadaku, ia mendengar [Fadlalah Al Anshari, sahabat Rasulullah Shallalahu 'alaihi wa sallam] berkata: Rasulullah Shallalahu 'alaihi wa sallam mendengar seseorang berdoa sementara itu ia tidak menyebut Allah 'azza wajalla dan tidak membaca shalawat untuk Nabi Shallallahu 'Alaihi Wasalam, lalu Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Ia terburu-buru.\" Beliau lalu mendoakannya, setelah itu beliau bersabda kepadanya dan yang lain: \"Bila salah seorang dari kalian berdoa, hendaklah dimulai dengan memuja dan memuji Allah kemudian hendaklah membaca shalawat untuk Nabi Shallallahu 'Alaihi Wasalam, setelah itu silahkan berdoa sekehendaknya.\""
            },
            {
                "number": 3705,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ حَدَّثَنَا حَيْوَةُ قَالَ أَخْبَرَنِي أَبُو هَانِئٍ عَنْ عَمْرِو بْنِ مَالِكٍ حَدَّثَهُ أَنَّهُ سَمِعَ فَضَالَةَ بْنَ عُبَيْدٍ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى بِالنَّاسِ خَرَّ رِجَالٌ مِنْ قَامَتِهِمْ فِي الصَّلَاةِ لِمَا بِهِمْ مِنْ الْخَصَاصَةِ وَهُمْ مِنْ أَصْحَابِ الصُّفَّةِ حَتَّى يَقُولَ الْأَعْرَابُ إِنَّ هَؤُلَاءِ مَجَانِينُ فَإِذَا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ انْصَرَفَ إِلَيْهِمْ فَقَالَ لَهُمْ لَوْ تَعْلَمُونَ مَا لَكُمْ عِنْدَ اللَّهِ عَزَّ وَجَلَّ لَأَحْبَبْتُمْ لَوْ أَنَّكُمْ تَزْدَادُونَ حَاجَةً وَفَاقَةً قَالَ فَضَالَةُ وَأَنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ",
                "id": "Telah menceritakan kepada kami [Abu 'Abdur Rahman Al Muqri'] Telah menceritakan kepada kami [Haiwah] berkata: Telah mengkhabarkan kepadaku [Abu Hani`] dari ['Amru bin Malik] telah menceritakan kepadanya bahwa ia mendengar [Fadlalah bin 'Ubaid] berkata: saat Rasulullah Shallalahu 'alaihi wa sallam mengimami sholat, beberapa orang jatuh saat berdiri karena mereka kesusahan dan mereka adalah para penghuni emperan masjid hingga orang-orang badui berkata: Mereka adalah orang-orang gila. Saat Rasulullah Shallalahu 'alaihi wa sallam usai sholat, beliau menoleh ke arah mereka lalu bersabda kepada mereka: \"Andai kalian tahu bagianmu di sisi Allah 'azza wajalla pastilah kalian menyukai bila seandainya kalian lebih miskin dan melarat.\" Berkata Fadlalah bin 'Ubaid: Saat itu aku bersama Rasulullah Shallalahu 'alaihi wa sallam."
            },
            {
                "number": 3706,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ حَدَّثَنَا حَيْوَةُ وَابْنُ لَهِيعَةَ قَالَا أَنْبَأَنَا أَبُو هَانِئٍ عَنْ عَلِيِّ بْنِ رَبَاحٍ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِلَادَةٍ فِيهَا ذَهَبٌ وَخَرَزٌ تُبَاعُ وَهِيَ مِنْ الْغَنَائِمِ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالذَّهَبِ الَّذِي فِي الْقِلَادَةِ فَنُزِعَ وَحْدَهُ ثُمَّ قَالَ الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ",
                "id": "Telah menceritakan kepada kami [Abu 'Abdur Rahman] Telah menceritakan kepada kami [Haiwah] dan [Ibnu Lahi'ah] keduanya berkata: Telah memberitakan kepada kami [Abu Hani`] dari ['Ali bin Rabah] dari [Fadlalah bin 'Ubaid] berkata: Kalung yang ada emas dan merjannya dijual dan dibawa kehadapan Rasulullah Shallalahu 'alaihi wa sallam, kalung itu berasal dari harta rampasan perang kemudian Rasulullah Shallalahu 'alaihi wa sallam memerintahkan memerintahkan mencabut emas yang ada dikalung itu, beliau mencabutnya sendiri kemudian bersabda: \"Emas dengan emas, ukuran berat yang sama.\""
            },
            {
                "number": 3707,
                "arab": "حَدَّثَنَا إِبْرَهِيمُ بْنُ إِسْحَاقَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ حَيْوَةَ بْنِ شُرَيْحٍ قَالَ أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ أَنَّ عَمْرَو بْنَ مَالِكٍ الْجَنْبِيَّ أَخْبَرَهُ أَنَّهُ سَمِعَ فَضَالَةَ يُحَدِّثُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ عَلَى مَرْتَبَةٍ مِنْ هَذِهِ الْمَرَاتِبِ بُعِثَ عَلَيْهَاقَالَ حَيْوَةُ يَقُولُ رِبَاطٌ حَجٌّ أَوْ نَحْوُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Ishaq] Telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Haiwah bin Syuraih] berkata: Telah mengkhabarkan kepadaku [Abu Hani` Al Khaulani] bahwa ['Amru bin Malik Al Janbi] memberitahunya, ia mendengar [Fadlalah bin 'Ubaid] bercerita dari Rasulullah Shallalahu 'alaihi wa sallam, beliau beresabda: \"Barangsiapa meninggal dunia diatas salah satu tugas ini maka ia akan dibangkitkan diatasnya.\" Berkata [Haiwah]: Beliau bersabda: \"Menjaga perbatasan, \" \"Haji\" atau sejenisnya."
            },
            {
                "number": 3708,
                "arab": "و حَدَّثَنَاه الطَّالَقَانِيُّ فِي هَذَا الْإِسْنَادِ عَنِ ابْنِ الْمُبَارَكِ قَالَيُسَلِّمُ الْفَارِسُ عَلَى الْمَاشِي وَالْمَاشِي عَلَى الْقَائِمِ وَالْقَلِيلُ عَلَى الْكَثِيرِحَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ حَدَّثَنَا حَيْوَةُ قَالَ أَخْبَرَنِي أَبُو هَانِئٍ أَنَّ أَبَا عَلِيٍّ عَمْرَو بْنَ مَالِكٍ الْجَنْبِيَّ مِثْلَهُ",
                "id": "(Masih dari [Fadhalah bin 'Ubaid]). Dan telah menceritakan kepada kami [Ath Thalaqani] dalam sanad ini dari [Ibnu Al Mubarak] berkata: Orang yang berkuda mengucap salam kepada orang yang berjalan, orang yang berjalan mengucap salam kepada orang yang berdiri, orang yang sedikit mengucap salam kepada orang yang banyak. Telah menceritakan kepada kami [Abu 'Abdur Rahman] Telah menceritakan kepada kami [Haiwah] berkata: Telah mengkhabarkan kepadaku [Abu Hani'] bahwa [Abu 'Ali 'Amru bin Malik Al Jambi] menceritakan seperti hadits di atas."
            },
            {
                "number": 3709,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ حَدَّثَنَا حَيْوَةُ قَالَ أَخْبَرَنِي أَبُو هَانِئٍ أَنَّ أَبَا عَلِيٍّ أَخْبَرَهُ أَنَّهُ سَمِعَ فَضَالَةَ بْنَ عُبَيْدٍ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ طُوبَى لِمَنْ هُدِيَ إِلَى الْإِسْلَامِ وَكَانَ عَيْشُهُ كَفَافًا وَقَنَعَ",
                "id": "Telah menceritakan kepada kami [Abu 'Abdur Rahman] Telah menceritakan kepada kami [Haiwah] berkata: Telah mengkhabarkan kepadaku [Abu Hani`] bahwa [Abu 'Ali] memberitahunya, ia mendengar [Fadlalah bin 'Ubaid] mendengar Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Beruntunglah orang yang ditunjukkan menuju Islam dan hidupnya serba cukup namun ia menerima.\""
            },
            {
                "number": 3710,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ حَدَّثَنَا حَيْوَةُ وَابْنُ لَهِيعَةَ قَالَا أَنْبَأَنَا أَبُو هَانِئٍ أَنَّ أَبَا عَلِيٍّ الْجَنْبِيَّ حَدَّثَهُ أَنَّهُ سَمِعَ فَضَالَةَ بْنَ عُبَيْدٍ يُحَدِّثُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ مَاتَ عَلَى مَرْتَبَةٍ مِنْ هَذِهِ الْمَرَاتِبِ بُعِثَ عَلَيْهَا يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu 'Abdur Rahman] Telah menceritakan kepada kami [Haiwah] dan [Ibnu Lahi'ah] keduanya berkata: Telah memberitakan kepada kami [Abu Hani`] bahwa [Abu 'Ali Al Janbi] bercerita kepadanya, ia mendengar [Fadlalah bin 'Ubaid] bercerita dari Rasulullah Shallalahu 'alaihi wa sallam, beliau bersabda: \"Barangsiapa meninggal dunia diatas salah satu tugas ini maka ia akan dibangkitkan diatasnya pada hari kiamat.\""
            },
            {
                "number": 3711,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ قَالَ سَمِعْتُ حَجَّاجًا يَذْكُرُ عَنْ مَكْحُولٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَيْرِيزٍ قَالَقُلْتُ لِفَضَالَةَ بْنِ عُبَيْدٍ أَرَأَيْتَ تَعْلِيقَ يَدِ السَّارِقِ فِي الْعُنُقِ أَمِنَ السُّنَّةِ قَالَ نَعَمْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِسَارِقٍ فَأَمَرَ بِهِ فَقُطِعَتْ يَدُهُ ثُمَّ أَمَرَ بِهَا فَعُلِّقَتْ فِي عُنُقِهِقَالَ حَجَّاجٌ وَكَانَ فَضَالَةُ مِمَّنْ بَايَعَ تَحْتَ الشَّجَرَةِ قَالَ أَبُو عَبْد الرَّحْمَنِ عَبْد اللَّهِ بْن أَحْمَد قُلْتُ لِيَحْيَى بْنِ مَعِينٍ سَمِعْتَ مِنْ عُمَرَ بْنِ عَلِيٍّ الْمُقَدَّمِيِّ شَيْئًا قَالَ أَيُّ شَيْءٍ كَانَ عِنْدَهُ قُلْتُ حَدِيثُ فَضَالَةَ بْنِ عُبَيْدٍ فِي تَعْلِيقِ الْيَدِ فَقَالَ لَا حَدَّثَنَا بِهِ عَفَّانُ عَنْهُ",
                "id": "Telah menceritakan kepada kami ['Umar bin 'Ali Al Muqaddami] berkata: Aku mendengar [Hajjaj] bercerita dari [Makhlul] dari ['Abdur Rahman bin Muhairiz] berkata: Aku berkata kepada [Fadlalah bin 'Ubaid]: Bagaimana menurutmu, apakah mengalungkan tangan dileher seorang pencuri itu termasuk sunnah? Ia menjawab: Ya, dulu aku pernah melihat seorang pencuri dibawa ke hadapan Rasulullah Shallalahu 'alaihi wa sallam lalu Rasulullah Shallalahu 'alaihi wa sallam memerintahkan agar tangannya diputus, setelah itu beliau memerintahkan agar tangannya dikalungkan di lehernya. Berkata Hajjaj: Fadlalah bin 'Ubaid termasuk salah seorang yang berbaiat Ridlwan dibawah pohon. Berkata Abu 'Abdur Rahman 'Abdullah bin Ahmad: Aku berkata kepada Yahya bin Ma'in: Aku mendengar sesuatu dari 'Umar bin 'Ali Al Muqaddami: Apa yang ia miliki? Aku Berkata: Hadits Fadlalah bin 'Ubaid Al Anshari tentang mengalungkan tangan. Ia: Tidak, 'Affan telah menceritakan kepada kami darinya Fadlalah bin 'Ubaid."
            },
            {
                "number": 3712,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا سُفْيَانُ بْنُ حُسَيْنٍ عَنْ هِشَامِ بْنِ يُوسُفَ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَاسْتَأْذَنْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أَدْخُلُ كُلِّي أَوْ بَعْضِي قَالَ ادْخُلْ كُلُّكَ فَدَخَلْتُ عَلَيْهِ وَهُوَ يَتَوَضَّأُ وُضُوءًا مَكِيثًا فَقَالَ لِي يَا عَوْفُ بْنَ مَالِكٍ أَعْدِدْ سِتًّا قَبْلَ السَّاعَةِ مَوْتُ نَبِيِّكُمْ خُذْ إِحْدَى ثُمَّ فَتْحُ بَيْتِ الْمَقْدِسِ ثُمَّ مَوْتٌ يَأْخُذُكُمْ تُقْعَصُونَ فِيهِ كَمَا تُقْعَصُ الْغَنَمُ ثُمَّ تَظْهَرُ الْفِتَنُ وَيَكْثُرُ الْمَالُ حَتَّى يُعْطَى الرَّجُلُ الْوَاحِدُ مِائَةَ دِينَارٍ فَيَسْخَطَهَا ثُمَّ يَأْتِيكُمْ بَنُو الْأَصْفَرِ تَحْتَ ثَمَانِينَ غَايَةً تَحْتَ كُلِّ غَايَةٍ اثْنَا عَشَرَ أَلْفًا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata: Telah memberitakan kepada kami [Sufyan bin Husain] dari [Hisyam bin Yusuf] dari ['Auf bin Malik] berkata: Aku meminta izin kepada Nabi Shallallahu 'Alaihi Wasalam, aku berkata: Aku masuk sebagaian saja atau seluruhnya. Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Masuklah secara keseluruhan.\" Aku masuk saat beliau tengah berwudlu pelan-pelan lalu bersabda kepadaku: \"Hai 'Auf bin Malik, hitunglah enam hal sebelum (terjadinya) kiamat; wafatnya nabi kalian, ambillah salah satunya, penaklukkan Baitul Maqdis, kematian yang menggeleparkan kalian layaknya kambing tergelepar, munculnya fitnah, banyaknya harta hingga seseorang memberi seratus dinar lalu dimarahi kemudian Bani Ashfar mendatangi kalian dibawah delapan puluh bendera, setiap benderanya ada duabelas ribu bendera.\""
            },
            {
                "number": 3713,
                "arab": "حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ قَالَدَخَلَ عَوْفُ بْنُ مَالِكٍ هُوَ وَذُو الْكَلَاعِ مَسْجِدَ بَيْتِ الْمَقْدِسِ فَقَالَ لَهُ عَوْفٌ عِنْدَكَ ابْنُ عَمِّكَ فَقَالَ ذُو الْكَلَاعِ أَمَا إِنَّهُ مِنْ خَيْرِ أَوْ مِنْ أَصْلَحِ النَّاسِ فَقَالَ عَوْفٌ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَقُصُّ إِلَّا أَمِيرٌ أَوْ مَأْمُورٌ أَوْ مُتَكَلِّفٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakar Al Hanafi] berkata: Telah menceritakan kepada kami [Adl Dlahhak bin 'Utsman] dari [Bukair bin 'Abdullah bin Al Asyujj] berkata: Auf bin Malik dan Dzu Al Kala' memasuki Baitul Maqdis, 'Auf berkata padanya: Kau punya saudara sepupu. Berkata Dzul Kala': Ia adalah orang paling shalih. Berkata ['Auf]: Aku bersaksi, aku pernah mendengar Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Tidak ada yang membalas kecuali pemimpin, orang yang ditunjuk pemimpin atau orang yang memaksa-maksakan diri.\""
            },
            {
                "number": 3714,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ أَنْبَأَنَا النَّهَّاسُ عَنْ شَدَّادٍ أَبِي عَمَّارٍ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَيَا طَاعُونُ خُذْنِي إِلَيْكَ قَالُوا لِمَ تَقُولُ هَذَا أَلَيْسَ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الْمُؤْمِنَ لَا يَزِيدُهُ طُولُ الْعُمُرِ إِلَّا خَيْرًا قَالَ بَلَى فَذَكَرَ مِثْلَ حَدِيثِ وَكِيعٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakar] berkata; Telah memberitakan kepada kami [An Nahhas] dari [Syaddad Abu 'Ammar] dari ['Auf bin Malik Al Asyaja'i] berkata: Wahai tha'un, seranglah aku. Mereka berkata: Kenapa kau berkata seperti itu, bukankah kau mendengar Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Sesungguhnya panjangnya usia orang mu`min itu tidaklah menambah selain kebaikan.\" Ia berkata: Benar, lalu ia menyebutkan seperti hadits Waki'."
            },
            {
                "number": 3715,
                "arab": "حَدَّثَنَا يَحْيَي بْنُ سَعِيدٍ عَنْ عَبْدِ الْحَمِيدِ يَعْنِي أَبَا جَعْفَرٍ قَالَ حَدَّثَنِي صَالِحُ بْنُ أَبِي عَرِيبٍ عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ دَخَلَ وَنَحْنُ فِي الْمَسْجِدِ وَبِيَدِهِ عَصًا وَقَدْ عَلَّقَ رَجُلٌ أَقْنَاءَ حَشَفٍ فَطَسَّ بِالْعَصَا فِي ذَلِكَ الْقِنْوِ ثُمَّ قَالَ لَوْ شَاءَ رَبُّ هَذِهِ الصَّدَقَةِ تَصَدَّقَ بِأَطْيَبَ مِنْ هَذَا إِنَّ رَبَّ هَذِهِ الصَّدَقَةِ يَأْكُلُ الْحَشَفَ يَوْمَ الْقِيَامَةِ",
                "id": "Telah bercerita kepada kami [Yahya bin Sa'id] dari ['Abdul Hamid Abu Ja'far] berkata: telah bercerita kepadaku [Shalih bin Abu 'Arib] dari [Katsir bin Murrah Al Hadlrami] dari ['Auf bin Malik Al Asyja'i] berkata: Rasulullah Shallalahu 'alaihi wa sallam keluar menghampiri kami atau masuk (menghampiri kami) dan kami tengah berada di masjid, di tangan beliau ada tongkat, seseorang menggantungkan tandan kurma yang sudah rusak, beliau menusukkan tongat beliau pada tandan kuram itu lalu bersabda: \"Andai pemilik sedekah ini berkehendak pastilah ia bersedekah dengan yang lebih baik darinya, sesungguhnya pemilik sedekah ini sungguh akan makan kurma rusak pada hari kiamat.\""
            },
            {
                "number": 3716,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيِّتٍ قَالَ فَفَهِمْتُ مِنْ صَلَاتِهِ عَلَيْهِ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَنَقِّهِ مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ",
                "id": "Telah bercerita kepada kami ['Abdur Rahman bin Mahdi] dari [Mu'awiyah] dari ['Abdur Rahman bin Jubair] dari [ayahnya] dari ['Auf bin Malik] berkata: Rasulullah Shallalahu 'alaihi wa sallam mensholati mayit. Berkata 'Auf: Aku tahu doa beliau untuk mayit itu: ALLAHUMMAGHFIR LAHU WARHAMHU WAGHSILHU BIL MAA`I WATSTSALJI MINAL KHATHAAYAA KAMA NAQQAITATS TSAUBAL ABYADLA MINAD DANASI (Ya Allah, ampunilah dia, rahamatilah dia, mandikanlah dia dengan air, salju dan es, bersihkanlah ia dari kesalahan-kesalahan seperti Engkau membersihkan baju putih dari kotoran)."
            },
            {
                "number": 3717,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ أَزْهَرَ بْنِ سَعِيدٍ عَنْ ذِي كَلَاعٍ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقُصَّاصُ ثَلَاثَةٌ أَمِيرٌ أَوْ مَأْمُورٌ أَوْ مُخْتَالٌ",
                "id": "Telah bercerita kepada kami ['Abdur Rahman] dari [Mu'awiyah bin Shalih] dari [Azhar bin Sa'id] dari [Dzi Kala'] dari ['Auf bin Malik] berkata: Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Pencerita itu ada tiga; pemimpin, yang ditunjuk oleh pemimpin atau orang sombong.\""
            },
            {
                "number": 3718,
                "arab": "حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي مَلِيحٍ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَعَرَّسَ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَافْتَرَشَ كُلُّ رَجُلٍ مِنَّا ذِرَاعَ رَاحِلَتِهِ قَالَ فَانْتَهَيْتُ إِلَى بَعْضِ الْإِبِلِ فَإِذَا نَاقَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ قُدَّامَهَا أَحَدٌ قَالَ فَانْطَلَقْتُ أَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا مُعَاذُ بْنُ جَبَلٍ وَعَبْدُ اللَّهِ بْنُ قَيْسٍ قَائِمَانِ قُلْتُ أَيْنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَا مَا نَدْرِي غَيْرَ أَنَّا سَمِعْنَا صَوْتًا بِأَعْلَى الْوَادِي فَإِذَا مِثْلُ هَزِيزِ الرَّحْلِ قَالَ امْكُثُوا يَسِيرًا ثُمَّ جَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّهُ أَتَانِي اللَّيْلَةَ آتٍ مِنْ رَبِّي فَخَيَّرَنِي بَيْنَ أَنْ يَدْخُلَ نِصْفُ أُمَّتِي الْجَنَّةَ وَبَيْنَ الشَّفَاعَةِ فَاخْتَرْتُ الشَّفَاعَةَ فَقُلْنَا نَنْشُدُكَ اللَّهَ وَالصُّحْبَةَ لَمَا جَعَلْتَنَا مِنْ أَهْلِ شَفَاعَتِكَ قَالَ فَإِنَّكُمْ مِنْ أَهْلِ شَفَاعَتِي قَالَ فَأَقْبَلْنَا مَعَانِيقَ إِلَى النَّاسِ فَإِذَا هُمْ قَدْ فَزِعُوا وَفَقَدُوا نَبِيَّهُمْ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ أَتَانِي اللَّيْلَةَ مِنْ رَبِّي آتٍ فَخَيَّرَنِي بَيْنَ أَنْ يَدْخُلَ نِصْفُ أُمَّتِي الْجَنَّةَ وَبَيْنَ الشَّفَاعَةِ وَإِنِّي اخْتَرْتُ الشَّفَاعَةَ قَالُوا يَا رَسُولَ اللَّهِ نَنْشُدُكَ اللَّهَ وَالصُّحْبَةَ لَمَا جَعَلْتَنَا مِنْ أَهْلِ شَفَاعَتِكَ قَالَ فَلَمَّا أَضَبُّوا عَلَيْهِ قَالَ فَأَنَا أُشْهِدُكُمْ أَنَّ شَفَاعَتِي لِمَنْ لَا يُشْرِكُ بِاللَّهِ شَيْئًا مِنْ أُمَّتِيحَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ الْهُذَلِيِّ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ فَأَنَاخَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَخْنَا مَعَهُ فَذَكَرَ مَعْنَاهُ إِلَّا أَنَّهُ قَالَ وَبَيْنَ أَنْ يَدْخُلَ نِصْفُ أُمَّتِي الْجَنَّةَ",
                "id": "Telah bercerita kepada kami [Bahz] berkata: telah bercerita kepada kami [Abu 'Awanah] berkata: telah bercerita kepada kami [Qatadah] dari [Abu Malih] dari ['Auf bin Malik Al Asyja'i] berkata: Pada suatu malam Rasulullah Shallalahu 'alaihi wa sallam bersama kami lalu setiap orang diantara kami berbantalkan lengan kendaraan tunggangannya. Berkata 'Auf: Aku mendatangi sebagaian unta dan ternyata unta Rasulullah Shallalahu 'alaihi wa sallam tidak dijaga oleh seorang pun. Aku pergi mencari Rasulullah Shallalahu 'alaihi wa sallam, ternyata disana ada Mu'adz bin Jabal dan 'Abdullah bin Qais tengah berdiri, aku bertanya: Di mana Rasulullah Shallalahu 'alaihi wa sallam? Keduanya menjawab: Kami tidak tahu, tapi kami mendengar suara di puncak bukit seperti getaran alat penumbuk, aku berkata: TInggallah sebentar. Kemudian Rasulullah Shallalahu 'alaihi wa sallam mendatangi kami, beliau bersabda: \"Sesungguhnya ada yang mendatangiku dari Rabbku 'azza wajalla lalu memberiku pilihan antara separuh ummatku masuk surga atau syafaat lalu aku memilih syafaat.\" Kami berkata: Kami mengingatkan Tuan pada Allah dan persahabatan kecuali Tuan menjadikan kami termasuk yang mendapatkan syafaat Tuan. Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Kalian termasuk bagian dari mereka.\" Kami pergi lalu seseorang, dua orang tiba, beliau memberitahu kepada mereka khabar yang beliau sampaikan pada kami, mereka mengingatkan beliau pada Allah dan persahabatan kecuali beliau menjadikan mereka termasuk yang mendapatkan syafaat beliau, beliau bersabda: \"Kalian termasuk bagian dari mereka.\" Orang-orang pun mendengar hal itu, mereka mendatangi beliau, mereka berkata: Jadikanlah kami termasuk bagian dari mereka. Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Aku bersaksi pada kalian, sesungguhnya syafaat itu untuk orang yang meninggal dunia dari ummatku yang tidak menyekutukan Allah dengan apa pun.\" Telah bercerita kepada kami Muhammad bin Bakar berkata telah bercerita kepada kami Sa'id dari Qadatah dari Abu Al Malih Al Hudzali dari 'Auf bin Malik Al Asyja'i berkata: Kami bersama Rasulullah Shallalahu 'alaihi wa sallam dalam salah satu perjalanan beliau lalu nabi Allah menderumkan unta, kami turut menderumkan unta bersama beiau. 'Auf menyebutkan makna hadits, hanya saja ia berkata dalam riwayatnya: \"Dan antara separuh ummatku masuk surga.\""
            },
            {
                "number": 3719,
                "arab": "حَدَّثَنَا أَبُو عَاصِمٍ قَالَ أَنْبَأَنَا عَبْدُ الْحَمِيدِ قَالَ حَدَّثَنَا صَالِحُ بْنُ أَبِي عَرِيبٍ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَدَخَلَ عَوْفُ بْنُ مَالِكٍ مَسْجِدَ حِمْصَ قَالَ وَإِذَا النَّاسُ عَلَى رَجُلٍ فَقَالَ مَا هَذِهِ الْجَمَاعَةُ قَالُوا كَعْبٌ يَقُصُّ قَالَ يَا وَيْحَهُ أَلَا سَمِعَ قَوْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُصُّ إِلَّا أَمِيرٌ أَوْ مَأْمُورٌ أَوْ مُخْتَالٌ",
                "id": "Telah bercerita kepada kami [Abu 'Ashim] berkata: telah memberitakan kepada kami ['Abdul Hamid] berkata: telah bercerita kepada kami [Shalih bin Abu 'Arib] dari [Katsir bin Murrah] dari ['Auf bin Malik] berkata: 'Auf bin Malik masuk masjid Himash, ternyata orang-orang tengah berkumpul dihadapan seseorang, 'Auf bertanya: Perkumpulan apa ini? mereka menajwab: Ka'ab sedang bercerita. Berkata 'Auf: Alangkah celakanya ia, apa ia tidak mendengar sabda Rasulullah Shallalahu 'alaihi wa sallam: \"Tidak ada yang berhak bercerita kecuali pemimpin, yang ditunjuk oleh pemimpin atau orang yang sombong.\""
            },
            {
                "number": 3720,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ أَنْبَأَنَا النَّهَّاسُ عَنْ شَدَّادٍ أَبِي عَمَّارٍ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَامْرَأَةٌ سَفْعَاءُ الْخَدَّيْنِ كَهَاتَيْنِ يَوْمَ الْقِيَامَةِ وَجَمَعَ بَيْنَ أُصْبُعَيْهِ السَّبَّابَةِ وَالْوُسْطَى امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ آمَتْ مِنْ زَوْجِهَا حَبَسَتْ نَفْسَهَا عَلَى أَيْتَامِهَا حَتَّى بَانُوا أَوْ مَاتُوا",
                "id": "Telah bercerita kepada kami [Muhammad bin Bakar] berkata: Telah memberitakan kepada kami [An Nahhas] dari [Syaddad Abu 'Ammar] dari ['Auf bin Malik] berkata: Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Aku dan wanita dengan pipi berwarna soga seperti dua ini pada hari kiamat -beliau menyatukan diantara dua jari; jari telunjuk dan jari tengah- wanita yang memiliki kedudukan dan kecantikan yang ditinggal mati suaminya, ia menahan dirinya demi anak-anak yatimnya hingga mereka menikah atau meninggal dunia.\""
            },
            {
                "number": 3721,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ النَّهَّاسِ عَنْ شَدَّادٍ أَبِي عَمَّارٍ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَامْرَأَةٌ سَفْعَاءُ فِي الْجَنَّةِ كَهَاتَيْنِ امْرَأَةٌ آمَتْ مِنْ زَوْجِهَا فَحَبَسَتْ نَفْسَهَا عَلَى يَتَامَاهَا حَتَّى بَانُوا أَوْ مَاتُواحَدَّثَنَا حُسَيْنٌ فِي تَفْسِيرِ شَيْبَانَ عَنْ قَتَادَةَ قَالَ حَدَّثَنَا صَاحِبٌ لَنَا أَظُنُّهُ أَبَا الْمَلِيحِ الْهُذَلِيَّ عَنْ عَوْفِ بْنِ مَالِكٍ فَذَكَرَهُ وَقَالَ بَيْنَ أَنْ يَدْخُلَ نِصْفُ أُمَّتِي الْجَنَّةَ آخِرُ مُسْنَدِ عَوْفِ بْنِ مَالِكٍ الْأَنْصَارِيِّ وَهُوَ تَمَامُ مُسْنَدِ الْأَنْصَارِ رَضِيَ اللَّهُ عَنْهُمْ",
                "id": "Telah bercerita kepada kami [Waki'] dari [An Nahhas] dari [Syaddad Abu 'Ammar] dari ['Auf bin Malik] berkata: Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Aku dan wanita dengan pipi berwarna soga seperti dua ini pada hari kiamat -eliau menyatukan diantara dua jari; jari telunjuk dan jari tengah- wanita yang memiliki kedudukan dan kecantikan yang ditinggal mati suaminya, ia menahan dirinya demi anak-anak yatimnya hingga mereka menikah atau meninggal dunia.\" Telah bercerita kepada kami Husain tentang penafsiran Syaiban dari Qatadah berkata: telah bercerita kepada kami seorang sahabat kami, menurutku Abu Al Malih Al Hudzali dari 'Auf bin Malik lalu ia menyebutnya dan ia berkata dalam riwayatnya: \"Antara separuh ummatku masuk surga.\" Akhir musnad 'Auf bin Malik Al Anshari dan inilah musnad terakhir kaum Anshar."
            },
            {
                "number": 3722,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ أَخْبَرَنَا بُرْدُ بْنُ سِنَانٍ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ غُضَيْفِ بْنِ الْحَارِثِ قَالَقُلْتُ لِعَائِشَةَ أَرَأَيْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ مِنْ الْجَنَابَةِ فِي أَوَّلِ اللَّيْلِ أَوْ فِي آخِرِهِ قَالَتْ رُبَّمَا اغْتَسَلَ فِي أَوَّلِ اللَّيْلِ وَرُبَّمَا اغْتَسَلَ فِي آخِرِهِ قُلْتُ اللَّهُ أَكْبَرُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الْأَمْرِ سَعَةً قُلْتُ أَرَأَيْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ فِي أَوَّلِ اللَّيْلِ أَوْ فِي آخِرِهِ قَالَتْ رُبَّمَا أَوْتَرَ فِي أَوَّلِ اللَّيْلِ وَرُبَّمَا أَوْتَرَ فِي آخِرِهِ قُلْتُ اللَّهُ أَكْبَرُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الْأَمْرِ سَعَةً قُلْتُ أَرَأَيْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَجْهَرُ بِالْقُرْآنِ أَوْ يُخَافِتُ بِهِ قَالَتْ رُبَّمَا جَهَرَ بِهِ وَرُبَّمَا خَافَتَ قُلْتُ اللَّهُ أَكْبَرُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الْأَمْرِ سَعَةً",
                "id": "Telah menceritakan kepada kami [Isam'il], dia berkata; Telah mengkabarkan kepada kita [Burdu bin Sinan] dari [Ubadah bin Nusai] dari [Ghudlaif bin Al-Harits] berkata; Saya bertanya kepada [Aisyah]; \"Apakah kamu melihat Rasulullah Shallallahu'alaihiwasallam mandi junub di awal malam atau di akhir malam?\" Aisyah berkata; \"Terkadang beliau mandi di awal malam dan terkadang pula beliau mandi di akhir malam.\" Saya berkata; \"Allahu akbar, segala puji bagi Allah yang telah memberikan keleluasan pada suatu perkara.\" Saya berkata; \"Apakah kamu melihat Rasulullah Shallallahu'alaihiwasallam berwitir di awal malam atau di akhir malam?\" Aisyah berkata; \"Terkadang beliau berwitir di awal malam dan terkadang pula beliau berwitir di akhir malam.\" Saya berkata; \"Allahu akbar, segala puji bagi Allah yang telah memberikan keleluasan pada suatu perkara.\" Saya berkata; \"Apakah kamu melihat Rasulullah Shallallahu'alaihiwasallam mengeraskan bacaan Al Quran atau melirihkannya?.\" Aisyah berkata; \"Terkadang beliau mengeraskannya dan terkadang pula beliau melirihkannya.\" Saya berkata; \"Allahu akbar, segala puji bagi Allah yang telah memberikan keleluasan pada suatu perkara.\""
            },
            {
                "number": 3723,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَكْمَلِ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنَهُمْ خُلُقًا وَأَلْطَفَهُمْ بِأَهْلِهِ",
                "id": "Telah menceritakan kepada kami [Isma'il] Telah menceritakan kepada kami [Khalid Al-Khudda`] dari [Abi Qilabah] dari [Aisyah] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Orang mukmin yang paling sempurna keimanannya adalah orang yang paling baik akhlaknya dan yang paling lemah lembut dengan istrinya.\""
            },
            {
                "number": 3724,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي سُلَيْمَانُ بْنُ مُوسَى عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نُكِحَتْ الْمَرْأَةُ بِغَيْرِ أَمْرِ مَوْلَاهَا فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَإِنْ أَصَابَهَا فَلَهَا مَهْرُهَا بِمَا أَصَابَ مِنْهَا فَإِنْ اشْتَجَرُوا فَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُقَالَ ابْنُ جُرَيْجٍ فَلَقِيتُ الزُّهْرِيَّ فَسَأَلْتُهُ عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ قَالَ وَكَانَ سُلَيْمَانُ بْنُ مُوسَى وَكَانَ فَأَثْنَى عَلَيْهِ السُّلْطَانُ الْقَاضِي لِأَنَّ إِلَيْهِ أَمْرَ الْفُرُوجِ وَالْأَحْكَامِ",
                "id": "Telah menceritakan kepada kami [Isma'il] Telah menceritakan kepada kami [Ibnu Juraij], dia berkata; \"Telah mengkabarkan kepadaku [Sulaiman bin Musa] dari [Az-Zuhri] dari [Urwah] dari [Aisyah] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Bila seorang wanita dinikahkan bukan atas perintah walinya maka nikahnya batil, maka nikahnya batil, maka nikahnya batil. Dan, bila (suaminya) Telah menggaulinya maka mahar menjadi haknya. Sedang bila mereka berbantah-bantahan maka penguasa menjadi wali bagi siapa yang tidak mempunyai wali.\" Ibnu Juraij berkata; 'Saya telah menemui Az-Zuhri dan bertanya kepadanya mengenai hadits ini dan beliau tidak mengetahuinya. Dia (Az-Zuhri) Berkata; 'Sulaiman bin Musa telah mendapat sanjungan dari penguasa Al-Qadhi karena dia ahli dalam masalah hukum.'\""
            },
            {
                "number": 3725,
                "arab": "قَالَ أَخْبَرَنَا إِسْمَاعِيلُ قَالَ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَعَدَ بَيْنَ الشُّعَبِ الْأَرْبَعِ ثُمَّ أَلْزَقَ الْخِتَانَ بِالْخِتَانِ فَقَدْ وَجَبَ الْغُسْلُ",
                "id": "Imam Ahmad bin Hambal berkata; \"Telah mengkabarkan kepada kami [Isma'il], dia berkata; Telah mengkabarkan kepada kami [Ali bin Zaid] dari [Sa'id bin Al-Musayyab] dari [Aisyah] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Apabila (seorang suami) Telah duduk di antara empat sendi (mensetubuhi istrinya) kemudian memasukkan kemaluannya ke dalam kemaluan istrinya maka dia telah wajib mandi.\""
            },
            {
                "number": 3726,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ مُسْلِمِ بْنِ صُبَيْحٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْخَيَّرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَرْنَاهُ وَلَمْ يَعْدُدْهَا عَلَيْنَا شَيْئًا",
                "id": "Telah menceritakan kepada kami [Abu Muawiyah] Telah menceritakan kepada kami [Al-A'masy] dari [Muslim bin Shubaih] dari [Masruq] dari [Aisyah] berkata; \"Rasulullah Shallallahu'alaihiwasallam pernah memberi pilihan kepada kami lalu kami memilih beliau dan beliau sama sekali tidak memperhitungkan tawaran pilihan itu sebagai thalak.\""
            },
            {
                "number": 3727,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ ضِجَاعُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يَنَامُ عَلَيْهِ بِاللَّيْلِ مِنْ أَدَمٍ مَحْشُوًّا لِيفًا",
                "id": "Telah menceritakan kepada kami [Abu Muawiyah] Telah menceritakan kepada kami [Hisyam bin Urwah] dari [ayahnya] dari [Aisyah] berkata; \"Suatu malam Nabi Shallallahu'alaihiwasallam pernah tidur di atas tulang rusuknya (beralaskan) kulit yang bulunya telah dibakar.\""
            },
            {
                "number": 3728,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ أَخْبَرَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يَقْرَأُ الْقُرْآنَ وَهُوَ مَاهِرٌ بِهِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَؤُهُ وَهُوَ عَلَيْهِ شَاقٌّ فَلَهُ أَجْرَانِ",
                "id": "Telah menceritakan kepada kami [Isma'il], dia berkata; Telah mengkabarkan kepada kami [Hisyam] dari [Qotadah] dari [Zurarah bin Aufa] dari [sa'ad bin Hisyam] dari [Aisyah] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Orang yang membaca Al Quran sedang ia pandai dalam membacanya maka dia bersama para malaikat utusan yang mulia, sedangkan orang yang membacanya dengan sulit maka ia mendapat dua pahala.\""
            },
            {
                "number": 3729,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ عُمَارَةَ عَنْ أَبِي عَطِيَّةَ قَالَدَخَلْتُ أَنَا وَمَسْرُوقٌ عَلَى عَائِشَةَ فَقُلْنَا لَهَا يَا أُمَّ الْمُؤْمِنِينَ رَجُلَانِ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدُهُمَا يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ وَالْآخَرُ يُؤَخِّرُ الْإِفْطَارَ وَيُؤَخِّرُ الصَّلَاةَ قَالَ فَقَالَتْ أَيُّهُمَا يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ قَالَ قُلْنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ قَالَتْ كَذَاكَ كَانَ يَصْنَعُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ أَبُو مُوسَىحَدَّثَنَا ابْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ قَالَ سَمِعْتُ خَيْثَمَةَ وَقَالَ يُعَجِّلُ الْإِفْطَارَ وَيُؤَخِّرُ السَّحُورَ حَدَّثَنَا مُؤَمَّلٌ حَدَّثَنَا سُفْيَانُ عَنِ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ أَبِي عَطِيَّةَ قَالَ قُلْنَا لِعَائِشَةَ رَجُلَانِ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدُهُمَا يُعَجِّلُ الْمَغْرِبَ وَيُعَجِّلُ الْإِفْطَارَ وَالْآخَرُ يُؤَخِّرُ الْمَغْرِبَ وَيُؤَخِّرُ الْإِفْطَارَ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Abu Muawiyah] Telah menceritakan kepada kami [Al-A'masy] dari [Umarah] dari [Abi Athiyah] berkata; Saya dan Masruq pernah menemui [Aisyah], lalu kami berkata; \"Wahai Ummul Mukminin, ada dua orang sahabat Nabi Shallallahu'alaihiwasallam, salah satu dari mereka berdua menyegerakan berbuka dan menyegerakan sholat, sedangkan yang satu lagi mengakhirkan berbuka dan mengakhirkan sholat.\" (Athiyyah) Berkata; Maka Aisyah bertanya; \"Siapa dari mereka berdua yang menyegerakan berbuka dan menyegerakan sholat?\" Kami berkata; \"Abdullah bin Mas`ud.\" Aisyah berkata; \"Memang seperti itulah yang diperbuat oleh Nabi Shallallahu'alaihiwasallam.\" Sedang lelaki yang lainnya adalah Abu Musa Al-Asy`ari. Telah menceritakan kepada kami [Ibnu Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] berkata; Saya telah mendengar [Khaitsamah] dan dia berkata; \"(Abu Musa) menyegarakan berbuka dan mengakhirkan sahur.\" Telah menceritakan kepada kami [Mu'ammal], Telah menceritakan kepada kami [Sufyan] dari [Al-A`masy] dari [Umaroh] dari [Abu Athiyyah] berkata; Kami berkata kepada [Aisyah]; \"Ada dua orang lelaki dari sahabat Muhammad Shallallahu'alaihiwasallam, salah satu dari mereka berdua menyegerakan (sholat) maghrib dan menyegerakan berbuka dan yang lain mengakhirkan (sholat) maghrib dan mengakhirkan berbuka.\" Lalu ia menyebutkan (seperti cerita di atas).\""
            },
            {
                "number": 3730,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ قَالَ حَدَّثَنِي عَبْدُ الْوَاحِدِ بْنُ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي بَعْضِ صَلَاتِهِ اللَّهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا فَلَمَّا انْصَرَفَ قُلْتُ يَا نَبِيَّ اللَّهِ مَا الْحِسَابُ الْيَسِيرُ قَالَ أَنْ يَنْظُرَ فِي كِتَابِهِ فَيَتَجَاوَزَ عَنْه إِنَّهُ مَنْ نُوقِشَ الْحِسَابَ يَوْمَئِذٍ يَا عَائِشَةُ هَلَكَ وَكُلُّ مَا يُصِيبُ الْمُؤْمِنَ يُكَفِّرُ اللَّهُ عَزَّ وَجَلَّ بِهِ عَنْه حَتَّى الشَّوْكَةُ تَشُوكُهُ",
                "id": "Telah menceritakan kepada kami [Isma'il] Telah menceritakan kepada kami [Muhammad bin Ishaq] dia berkata; Telah berkata kepadaku [Abdul Wahid bin Hamzah bin Abdullah bin Az-Zubair] dari [Abbad bin Abdillah bin Az-Zubair] dari [Aisyah] berkata; Saya telah mendengar Nabi Shallallahu'alaihiwasallam pada sebagian sholatnya membaca: \"Ya Allah hisablah aku dengan hisab yang mudah.\" Ketika beliau berpaling saya bekata; \"Wahai Nabi Allah, apa yang dimaksud dengan hisab yang mudah?.\" Beliau bersabda: \"Seseorang yang Allah melihat kitabnya lalu memaafkannya. Karena orang yang diperdebatkan hisabnya pada hari itu, pasti celaka wahai Aisyah, dan setiap musibah yang menimpa orang beriman Allah akan menghapus (dosanya) karenanya, bahkan sampai duri yang menusuknya.\""
            },
            {
                "number": 3731,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَكَعَ رَكْعَتَيْ الْفَجْرِ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ",
                "id": "Telah menceritakan kepada kami [Isma'il], dia berkata; Telah mengkabarkan kepada kami [Abdurrahman bin Ishaq] dari [Az-Zuhri] dari [Urwah] dari [Aisyah] berkata; \"Apabila Rasulullah Shallallahu'alaihiwasallam telah sholat dua rakaat fajar, beliau berbaring miring ke sebelah kanannya.\""
            },
            {
                "number": 3732,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ شَرِيكٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْتُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي وَفِي لَيْلَتِي",
                "id": "Telah menceritakan kepada kami [Abu Ahmad Az Zubairi] telah menceritakan kepada kami [Muhammad bin Syarik] dari [Ibnu Abi Mulaikah] dari [Aisyah] berkata; \"Nabi Shallallahu'alaihiwasallam wafat di rumahku dan pada malam (jatah giliranku).\""
            },
            {
                "number": 3733,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ شَرِيكٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ أَنَّهَاسَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَيْءٍ مِنْ أَمْرِ الصَّدَقَةِ فَذَكَرَتْ شَيْئًا قَلِيلًا فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِي وَلَا تُوعِي فَيُوعَى عَلَيْكِ",
                "id": "Telah menceritakan kepada kami [Abu Ahmad Az Zubairi] telah menceritakan kepada kami [Muhammad bin Syarik] dari [Ibnu Abi Mulaikah] dari [Aisyah] bahwa dia bertanya kepada Nabi Shallallahu'alaihiwasallam tentang perkara shodaqoh, kemudian Aisyah sampaikan bagaimana kalau halnya harta sangat terbatas. Maka Nabi Shallallahu'alaihiwasallam bersabda: \"Berikanlah (bersedekahlah) dan jangan kamu bakhil terhadapnya sehingga Allah membatasi rejekimu).\""
            },
            {
                "number": 3734,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا عَلِيٌّ عَنْ يَحْيَى قَالَ حَدَّثَنِي أَبُو سَلَمَةَ أَنَّ أُمَّ بَكْرٍ أَخْبَرَتْهُ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْمَرْأَةِ تَرَى مَا يُرِيبُهَا بَعْدَ الطُّهْرِ قَالَ إِنَّمَا هُوَ عُرُوقٌ أَوْ قَالَ عِرْقٌ",
                "id": "Telah menceritakan kepada kami [Abu Amir] telah menceritakan kepada kami [Ali] dari [Yahya] dia berkata; telah menceritakan kepadaku [Abu Salamah] bahwa [Ummu Bakr] menceritakan kepadanya dari [Aisyah] bahwa Nabi Shallallahu'alaihi wasallam bersabda kepada seorang wanita yang melihat sesuatu yang meragukannya setelah suci, beliau bersabda: \"Yang demikian itu hanyalah peluh-peluh.\" atau beliau bersabda: \"Hanyalah peluh.\""
            },
            {
                "number": 3735,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ أُسَامَةَ عَنْ عُثْمَانَ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الَّذِينَ يَصِلُونَ الصُّفُوفَ",
                "id": "Telah menceritakan kepada kami [Abu Ahmad] telah menceritakan kepada kami [Sufyan] dari [Usamah] dari [Ustman bin Urwah] dari [Urwah] dari [Aisyah] Rasulullah Shallallahu'alaihiwasallam bersabda: \"Allah AzzaWaJalla dan malaikat-Nya memberikan sholawat kepada orang-orang yang menyambung shof-shof (merapatkan barisan sholat).\""
            },
            {
                "number": 3736,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو قَالَ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَائِشَةَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَكَى رَقَاهُ جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ بِسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ دَاءٍ يَشْفِيكَ مِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ وَمِنْ شَرِّ كُلِّ ذِي عَيْنٍ",
                "id": "Telah menceritakan kepada kami [Abu Amir Abdul Malik bin Amru] dia berkata; telah menceritakan kepada kami [Zuhair bin Muhammad] dari [Yazid bin Abdullah bin Al Had] dari [Muhammad bin Ibrohim] dari [Aisyah] bahwa jika Nabi Shallallahu'alaihiwasallam merasa sakit maka Jibril Alaihissalam meruqyahnya, dia membaca: BISMILLAAHI ARQIIKA MIN KULLI DAAIN YASYFIIKA MIN SYARRI HAASIDIN IDZAA HASAD WAMIN SYARRI KULLI DZI AININ (dengan nama Allah saya meruqyahmu dari setiap penyakit, semoga Allah menyembuhkanmu dari kejelekan pendengki yang mendengki, dari kejelekan setiap orang yang memiliki Ain).\" "
            },
            {
                "number": 3737,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنِي عَلِيُّ بْنُ زَيْدٍ قَالَ حَدَّثَتْنِي أُمُّ مُحَمَّدٍ أَنَّ عَائِشَةَ حَدَّثَتْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْقُدُ مِنْ لَيْلٍ وَلَا نَهَارٍ فَيَسْتَيْقِظُ إِلَّا اسْتَاكَ قَبْلَ الْوُضُوءِ",
                "id": "Telah menceritakan kepada kami [Abdus Shomad] telah menceritakan kepada kami [Hammam] dia berkata; telah menceritakan kepadaku [Ali bin Zaid] dia berkata; telah menceritakan kepadaku [Ummu Muhmmad] bahwa [Aisyah] bercerita kepadanya; bahwa Rasulullah Shallallahu'alaihiwasallam tidaklah tidur di malam hari dan tidak pula di siang hari kemudian bangun, melainkan beliau bersiwak sebelum wudhu."
            },
            {
                "number": 3738,
                "arab": "أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ قَالَ أَخْبَرَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنِ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا فَرَهَنَهُ دِرْعَهُ",
                "id": "Ahmad bin Hanbal telah menceritakan kepada kami [Yahya bin Zakaria bin Abi Zaidah] dia berkata; telah mengabarkan kepada kami [Al A'masy] dari [Ibrohim] dari [Al Aswad] dari [Aisyah] berkata; Rasululah Shallallahu'alaihiwasallam pernah membeli makanan pada seorang yahudi lalu beliau menggadai baju besinya."
            },
            {
                "number": 3739,
                "arab": "حَدَّثَنَا قُرَّانُ بْنُ تَمَّامٍ عَنِ ابْنِ أَبِي ذِئْبٍ عَنْ مَخْلَدِ بْنِ خُفَافٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْغَلَّةَ بِالضَّمَانِسَمِعْتُ مِنْ قُرَّانَ بْنِ تَمَّامٍ فِي سَنَةِ إِحْدَى وَثَمَانِينَ وَمِائَةٍ وَكَانَ ابْنُ الْمُبَارَكِ بَاقِيًا وَفِيهَا مَاتَ ابْنُ الْمُبَارَكِ",
                "id": "Telah menceritakan kepada kami [Qurron bin Tammam] dari [Ibnu Abi Dzi'b] dari [Makhlad bin Khufaf] dari [Urwah] dari [Aisyah] berkata; Rasulullah Shallallahu'alaihiwasallam menetapkan bahwa penggadaian harus ada jaminan. Saya mendengar dari Qurron bin Tammam pada tahun seratus delapan puluh satu dan waktu itu Ibnu Mubarok masih hidup dan pada tahun itu Ibnu Mubarok wafat."
            },
            {
                "number": 3740,
                "arab": "حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ حَدَّثَنَا عَاصِمٌ عَنْ مُعَاذَةَ الْعَدَوِيَّةِ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَهُوَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Marwan bin Mu'awiyyah Al Fazari] telah menceritakan kepada kami [Ashim] dri [Mu'adzah Al Adawiyyah] dari [Aisyah] berkata; \"Saya dan Rasulullah Shallallahu'alaihiwasallam pernah mandi dalam satu bejana dan beliau berada di antara keduanya.\""
            },
            {
                "number": 3741,
                "arab": "حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى امْرَأَةٍ مِنْ الْأَنْصَارِ وَفِي الْبَيْتِ قِرْبَةٌ مُعَلَّقَةٌ فَاخْتَنَثَهَا وَشَرِبَ وَهُوَ قَائِمٌ",
                "id": "Telah menceritakan kepada kami [Al Haitsam bin Jamil] dia berkata; telah menceritakan kepada kami [Muhammad bin Muslim] dia berkata; telah menceritakan kepada kami [Abdurrohman bin Al Qosim] dari [ayahnya] dari [Aisyah] bahwa Nabi Shallallahu'alaihiwasallam menemui seorang wanita Anshor dan di dalam rumahnya terdapat geriba (tempat air yang terbuat dari kulit) yang tergantung, maka beliau memecahkan tutup mulut geriba itu dan beliau minum dengan berdiri."
            },
            {
                "number": 3742,
                "arab": "قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ أَبِي زَائِدَةَ عَنِ الْفِرَاسِ عَنِ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْأَقْبَلَتْ فَاطِمَةُ تَمْشِي كَأَنَّ مِشْيَتَهَا مِشْيَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَرْحَبًا بِابْنَتِي ثُمَّ أَجْلَسَهَا عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ ثُمَّ إِنَّهُ أَسَرَّ إِلَيْهَا حَدِيثًا فَبَكَتْ فَقُلْتُ لَهَا اسْتَخَصَّكِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَهُ ثُمَّ تَبْكِينَ ثُمَّ إِنَّهُ أَسَرَّ إِلَيْهَا حَدِيثًا فَضَحِكَتْ فَقُلْتُ مَا رَأَيْتُ كَالْيَوْمِ فَرَحًا أَقْرَبَ مِنْ حُزْنٍ فَسَأَلْتُهَا عَمَّا قَالَ فَقَالَتْ مَا كُنْتُ لِأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا قُبِضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلْتُهَا فَقَالَتْ إِنَّهُ أَسَرَّ إِلَيَّ فَقَالَ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلَام كَانَ يُعَارِضُنِي بِالْقُرْآنِ فِي كُلِّ عَامٍ مَرَّةً وَإِنَّهُ عَارَضَنِي بِهِ الْعَامَ مَرَّتَيْنِ وَلَا أُرَاهُ إِلَّا قَدْ حَضَرَ أَجَلِي وَإِنَّكِ أَوَّلُ أَهْلِ بَيْتِي لُحُوقًا بِي وَنِعْمَ السَّلَفُ أَنَا لَكِ فَبَكَيْتُ لِذَلِكَ ثُمَّ قَالَ أَلَا تَرْضَيْنَ أَنْ تَكُونِي سَيِّدَةَ نِسَاءِ هَذِهِ الْأُمَّةِ أَوْ نِسَاءِ الْمُؤْمِنِينَ قَالَتْ فَضَحِكْتُ لِذَلِكَ",
                "id": "Ia berkata; telah menceritakan kepada kami [Abu Nu'aim Alfadl bin Dukain] berkata; telah menceritakan kepada kami [Zakariya bin Abi Zaidah] dari [Al Firasy] dari [Asy Sya'bi] dari [Masruq] dari [Aisyah] berkata; \" [Fatimah] datang dengan berjalan seperti jalannya Rasulullah shallaallahu 'alaihi wa sallam, beliau pun lantas menyambutnya: \"Selamat datang putriku, \" lalu beliau mendudukkannnya di samping kanan atau kiri beliau. Lantas beliau membisikkan sesuatu kepadanya, ia pun menangis. Beliau pun membisikkan kembali sesuatu kepadanya dan ia tertawa. Aku berkata; \"Aku tidak melihat sesuatu seperti hari ini yang lebih membahagiakan daripada kesedihan.\" Aku bertanya; \"Apa yang beliau sabdakan?\" ia menjawab; \"Aku tidak akan membeberkan rahasia Rasulullah shallaallahu 'alaihi wa sallam hingga Nabi shallaallahu 'alaihi wa sallam meninggal.\" Aku bertanya kepadanya; \"Apa yang beliau katakan?\" Ia menjawab; \"Beliau mengatakan kepadaku: 'Sesungguhnya Jibril 'alaihissalam datang kepadaku, dulu ia membacakan Al Qur'an kepadaku sekali selama setahun, pada tahun itu ia membacakan kepadaku dua kali, dan aku tidak melihatnya kecuali ajalku akan segera datang. Engkau adalah ahli baitku yang pertama kali akan menyusulku, dan sebaik-baik orang yang terdahulu untuk mu adalah aku.' maka aku menangis karena itu. Kemudian beliau bersabda: 'Tidakkah engkau suka jika engkau menjadi pemimpin para wanita umat ini, atau ummul mukminin? ' maka aku tertawa karena itu.\""
            },
            {
                "number": 3743,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ قَالَ حَدَّثَنَا أَبِي عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْلَمَّا مَرِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا ابْنَتَهُ فَاطِمَةَ فَسَارَّهَا فَبَكَتْ ثُمَّ سَارَّهَا فَضَحِكَتْ فَسَأَلْتُهَا عَنْ ذَلِكَ فَقَالَتْ أَمَّا حَيْثُ بَكَيْتُ فَإِنَّهُ أَخْبَرَنِي أَنَّهُ مَيِّتٌ فَبَكَيْتُ ثُمَّ أَخْبَرَنِي أَنِّي أَوَّلُ أَهْلِهِ لُحُوقًا بِهِ فَضَحِكْتُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah menceritakan kepada mengabarkan kepada kami [Ibrahim bin Sa'ad] berkata; telah menceritakan kepada kami [Ayahku] dari [Urwah bin Az Zubair] dari [Aisyah] berkata; \"Ketika Rasulullah shallaallahu 'alaihi wa sallam sakit, beliau memanggil putrinya, [Fatimah] lalu beliau membisikkan sesuatu kepadanya dan ia pun menangis. Kemudian beliau membisikkan sesuatu lalu ia tertawa. Aku pun bertanya akan hal itu; ia menjawab; \"Aku menangis karena beliau memberitahuku bahwasannya beliau akan meninggal. Kemudian beliau memberitahuku bahwasanya aku adalah keluarganya yang pertama kali menyusul beliau, aku pun tertawa.\""
            },
            {
                "number": 3744,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ سُلَيْمَانَ بْنِ أَبِي سُلَيْمَانَ عَنْ أُمِّهِ أُمِّ سُلَيْمَانَ وَكِلَاهُمَا كَانَ ثِقَةً قَالَتْدَخَلْتُ عَلَى عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُهَا عَنْ لُحُومِ الْأَضَاحِيِّ فَقَالَتْ قَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا ثُمَّ رَخَّصَ فِيهَا قَدِمَ عَلِيُّ بْنُ أَبِي طَالِبٍ مِنْ سَفَرٍ فَأَتَتْهُ فَاطِمَةُ بِلَحْمٍ مِنْ ضَحَايَاهَا فَقَالَ أَوَلَمْ يَنْهَ عَنْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّهُ قَدْ رَخَّصَ فِيهَا قَالَتْ فَدَخَلَ عَلِيٌّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَهُ كُلْهَا مِنْ ذِي الْحِجَّةِ إِلَى ذِي الْحِجَّةِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata; telah menceritakan kepadaku [Ayahku] dari [Muhammad bin Ishaq] berkata; telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Sulaiman bin Abu Sulaiman] dari [ibunya, Ummu Sulaiman] dan keduanya adalah orang yang terpercaya, ia berkata; \"Aku menemui [Aisyah], isteri Nabi shallaallahu 'alaihi wa sallam, lalu aku bertanya kepadanya tentang daging korban?\" ia menjawab; \"(awalnya) Rasulullah shallaallahu 'alaihi wa sallam melarang untuk memakannya, namun kemudian memberikan keringanan padanya.\" Kemudian Ali bin Abi Thalib datang selepas ia berpergian dan Fatimah menemuinya dengan membawa daging korban. Lalu Ali berkata; \"Bukankah Rasulullah shallaallahu 'alaihi wa sallam telah melarangnya.\" ia menjawab; \"Sesungguhnya beliau telah memberi keringanan padanya.\" ia berkata; \"Ali pun lantas menemui Rasulullah shallaallahu 'alaihi wa sallam dan ia bertanya akan hal itu.\" Beliau menjawab: \"Makanlah ia dari Dzilhijjah ke Dzilhijjah.\""
            },
            {
                "number": 3745,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ أَبِي سُلَيْمٍ عَنْ عَبْدِ اللَّهِ بْنِ حَسَنٍ عَنْ أُمِّهِ فَاطِمَةَ ابْنَةِ حُسَيْنٍ عَنْ جَدَّتِهَا فَاطِمَةَ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْمَسْجِدَ صَلَّى عَلَى مُحَمَّدٍ وَسَلَّمَ وَقَالَ اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَإِذَا خَرَجَ صَلَّى عَلَى مُحَمَّدٍ وَسَلَّمَ ثُمَّ قَالَ اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ فَضْلِكَقَالَ إِسْمَاعِيلُ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ حَسَنٍ فَسَأَلْتُهُ عَنْ هَذَا الْحَدِيثِ فَقَالَ كَانَ إِذَا دَخَلَ قَالَ رَبِّ افْتَحْ لِي بَابَ رَحْمَتِكَ وَإِذَا خَرَجَ قَالَ رَبِّ افْتَحْ لِي بَابَ فَضْلِكَ",
                "id": "Telah menceritakan kepada kami [Ismail bin Ibrahim] berkata; telah menceritakan kepada kami [Laits, yaitu Ibnu Abi Sulaim] dari [Abdullah Bin Hasan] dari ibunya, [Fathimah, anak perempuan Husain] dari neneknya [Fathimah binti Rasulullah shallaallahu 'alaihi wa sallam] ia berkata; \"Apabila Rasulullah shallaallahu 'alaihi wa sallam masuk masjid, beliau bersalawat dan salam ke atas Muhammad dan berdoa: \"ALLAHUMMAGHFIRLI DZUNUBY WAFTAH LI ABWABA RAHMATIKA (Ya Allah, ampunilah dosa-dosaku dan bukakan lah pintu-pintu rahmat-Mu), \" Jika beliau keluar, beliau bersalawat dan salam ke atas Muhammad, beliau lalu berdoa: \"ALLAHUMMAGHFIRLI DZUNUUBY WAFTAHLI ABWAABA FADLLIKA (Ya Allah, ampunilah dosa-dosaku dan bukakanlah pintu-pintu karunia-Mu) \" Isma'il berkata; \"Lalu aku menemui Abdullah Bin Hasan dan aku bertanya akan hadits ini, ia berkata; 'Dulu, jika beliau masuk masjid beliau berdoa: RABBIFTAH LI BABA RAHMATIKA (ya Rabbi, bukakanlah untukku pintu Rahmat-Mu) dan jika beliau keluar, beliau berdoa: \"RABBIFTAH LII BABA FADLIKA (ya Rabbi, bukakanlah untukku pintu karunia-Mu).\""
            },
            {
                "number": 3746,
                "arab": "قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا لَيْثٌ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ فَاطِمَةَ بِنْتِ حُسَيْنٍ عَنْ جَدَّتِهَا فَاطِمَةَ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْمَسْجِدَ قَالَ بِسْمِ اللَّهِ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَإِذَا خَرَجَ قَالَ بِسْمِ اللَّهِ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ فَضْلِكَ",
                "id": "Telah (Imam Ahmad bin Hanbal) Berkata; telah menceritakan kepada kami [Abu Mua'wiyah] telah menceritakan kepada kami [Laits] dari [Abdullah Bin Hasan] dari [Fathimah binti Husain] dari [neneknya, Fathimah binti Rasulullah shallallahu 'alaihi wasallam.] berkata; \"Apabila Rasulullah shallaallahu 'alaihi wa sallam masuk masjid, beliau berdoa: \"BISMILLAHI WASSALAAMU 'ALA RASUULILLAH, ALLAHUMMAGHFIR LI DZUNUBI WAFTAHLI ABWAABA RAHMATIKA (dengan menyebut nama Allah serta salam kepada Rasulullah, ya Allah ampunilah dosa-dosaku dan bukakanlah pintu-pintu Rahmat-Mu), \" dan jika keluar beliau berdoa: \"BISMILLAAHI WASSALAAMU 'ALAA RASUULILLAH, ALLAHUMMAGHFIR LII DZUNUUBI WAFTAHLII ABWAABA FADLLIKA (Dengan menyebut nama Allah serta salam kepada Rasulullah, ya Allah ampunilah dosa-dosaku dan bukakanlah pintu-pintu karunia-Mu).\""
            },
            {
                "number": 3747,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ الْحَسَنِ عَنْ فَاطِمَةَ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَ عَرْقًا فَجَاءَ بِلَالٌ بِالْأَذَانِ فَقَامَ لِيُصَلِّيَ فَأَخَذْتُ بِثَوْبِهِ فَقُلْتُ يَا أَبَهْ أَلَا تَتَوَضَّأُ فَقَالَ مِمَّ أَتَوَضَّأُ يَا بُنَيَّةُ فَقُلْتُ مِمَّا مَسَّتْ النَّارُ فَقَالَ لِي أَوَلَيْسَ أَطْيَبُ طَعَامِكُمْ مَا مَسَّتْهُ النَّارُ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] telah menceritakan kepada kami [Hammad bin Salamah] dari [Muhammad bin Ishaq] dari [Ayahnya] dari [Hasan bin Hasan] dari [Fathimah] berkata; \"Rasulullah shallaallahu 'alaihi wa sallam pernah menemuiku lalu beliau makan daging. Kemudian datanglah Bilal mengumandangkan adzan. Beliau pun bersiap untuk mendirikan sholat, kemudian aku mengambilkan pakaiannya dan berkata; 'Wahai ayahku! tidakkah engkau berwudhu? ' Beliau bertanya: 'Berwudhu dari apa wahai putriku? ' aku menjawab; 'Dari apa yang dimasak? ' Beliau menjawab: 'Bukankah makanan terbaik kalian adalah yang telah dimasak'?\""
            },
            {
                "number": 3748,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا الْحَسَنُ يَعْنِي ابْنَ صَالِحٍ عَنْ لَيْثٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ فَاطِمَةَ بِنْتِ حُسَيْنٍ عَنْ فَاطِمَةَ ابْنَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ إِذَا دَخَلَ الْمَسْجِدَ صَلَّى عَلَى مُحَمَّدٍ وَسَلَّمَ ثُمَّ قَالَ اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَإِذَا خَرَجَ صَلَّى عَلَى مُحَمَّدٍ وَسَلَّمَ وَقَالَ اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ فَضْلِكَ",
                "id": "Telah menceritakan kepada kami [Aswad bin 'Amir] berkata; telah menceritakan kepada kami [Al Hasan yakni Ibnu Shalih] dari [Laits] dari [Abdullah bin Al Hasan] dari [Fathimah binti Husain] dari [neneknya, Fathimah binti Rasulullah shallaallahu 'alaihi wa sallam] berkata; \"Apabila Rasulullah shallaallahu 'alaihi wa sallam masuk masjid, beliau berdo'a: BISMILLAHI WASSALAAMU 'ALA RASUULILLAH, ALLAHUMMAGHFIR LI DZUNUBI WAFTAHLI ABWAABA RAHMATIKA (dengan menyebut nama Allah serta salam kepada Rasulullah, ya Allah ampunilah dosa-dosaku dan bukakanlah pintu-pintu Rahmat-Mu), Dan jika keluar, beliau berdo'a: BISMILLAAHI WASSALAAMU 'ALAA RASUULILLAH, ALLAHUMMAGHFIR LII DZUNUUBI WAFTAHLII ABWAABA FADLLIKA (Dengan menyebut nama Allah serta salam kepada Rasulullah, ya Allah ampunilah dosa-dosaku dan bukakanlah pintu-pintu karunia-Mu).\""
            },
            {
                "number": 3749,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ رَاشِدٍ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ قَالَدَخَلَتْ فَاطِمَةُ عَلَى أَبِي بَكْرٍ فَقَالَتْ أَخْبَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي أَوَّلُ أَهْلِهِ لُحُوقًا بِهِ",
                "id": "Telah menceritakan kepada kami [Abdurrozaq] berkata; telah menceritakan kepada kami [Muhammad, yaitu ibnu Rasyid] berkata; telah menceritakan kepadaku [Ja'far bin 'Amru bin Umayyah] berkata; \" [Fathimah] pernah menemui Abu Bakr, ia pun berkata; 'Rasulullah shallaallahu 'alaihi wa sallam telah mengabariku bahwa aku adalah keluarganya yang pertama kali menyusul kematiannya'.\""
            },
            {
                "number": 3750,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ قَالَ قَالَ لَنَا مُحَمَّدُ بْنُ عَلِيٍّكَتَبَ إِلَيَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ أَنْ أَنْسَخَ إِلَيْهِ وَصِيَّةَ فَاطِمَةَ فَكَانَ فِي وَصِيَّتِهَا السِّتْرُ الَّذِي يَزْعُمُ النَّاسُ أَنَّهَا أَحْدَثَتْهُ وَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَلَمَّا رَآهُ رَجَعَ",
                "id": "Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepada kami [Al Qasim Bin Fadh] berkata; [Muhammad bin Ali] telah berkata kepada kami; \"Umar bin Abdul Azzis pernah menyuratiku agar aku menghapus untuknya wasiat [Fathimah], diwasiat itu tertulis sitr (kain penutup yang bergambar) yang orang-orang berkata bahwa ia telah membuat perkara baru. Rasulullah shallaallahu 'alaihi wa sallam pun menemuinya dan ketika beliau melihat (satr bergambar tersebut), beliau kembali lagi.\""
            },
            {
                "number": 3751,
                "arab": "حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا زَمْعَةُ عَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَكَانَتْ فَاطِمَةُ تَنْقُزُ الْحَسَنَ بْنَ عَلِيٍّ وَتَقُولُ بِأَبِي شَبَهُ النَّبِيِّلَيْسَ شَبِيهًا بِعَلِيٍّ",
                "id": "Telah menceritakan kepada kami [Abu Dawud Atthoyalisy] telah menceritakan kepada kami [Zam'ah] dari [Ibnu Abu Malikah] berkata; \" [Fathimah] pernah menggendong Hasan Bin Ali, ia berkata kepada ayahku; \"Ia mirip dengan Nabi dan tidak mirip dengan Ali.\""
            },
            {
                "number": 3752,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنِ ابْنِ عُمَرَ عَنْ حَفْصَةَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحِلَّ مِنْ عُمْرَتِكَ قَالَ إِنِّي قَلَّدْتُ هَدْيِي وَلَبَّدْتُ رَأْسِي فَلَا أَحِلُّ حَتَّى أَحِلَّ مِنْ الْحَجِّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sai'id] dari [ubaidhullah] berkata; telah menceritakan kepadaku [Nafi'] berkata; telah menceritakan [Ibnu Umar] dari [Hafshah] ia berkata aku berkata; \"Wahai Rasulullah! bagaimana keadaan orang-orang yang mereka telah bertahallul, namun tidak bertahallul dari umrah mu?\" beliau menjawab: \"Sesungguhnya aku memintalkan taki kalung untuk hewan kurbanku sebagai tanda, aku ikat rambutku, aku tidak akan bertahallul hingga aku bertahallul dari haji.\""
            },
            {
                "number": 3753,
                "arab": "حَدَّثَنَا سُرَيْجٌ وَعَفَّانُ وَيُونُسُ قَالُوا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ وَعُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَأَنَّهُ رَأَى ابْنَ صَائِدٍ فِي سِكَّةٍ مِنْ سِكَكِ الْمَدِينَةِ فَسَبَّهُ ابْنُ عُمَرَ وَوَقَعَ فِيهِ فَانْتَفَخَ حَتَّى سَدَّ الطَّرِيقَ فَضَرَبَهُ ابْنُ عُمَرَ بِعَصًا كَانَتْ مَعَهُ حَتَّى كَسَّرَهَا عَلَيْهِ فَقَالَتْ لَهُ حَفْصَةُ مَا شَأْنُكَ وَشَأْنُهُ مَا يُولِعُكَ بِهِ أَمَا سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّمَا يَخْرُجُ الدَّجَّالُ مِنْ غَضْبَةٍ يَغْضَبُهَا قَالَ عَفَّانُ عِنْدَ غَضْبَةٍ يَغْضَبُهَا وَقَالَ يُونُسُ فِي حَدِيثِهِ مَا تَوَالُعُكَ بِهِ",
                "id": "Telah menceritakan kepada kami [Suraij] dan [Affan] dan [Yunus], mereka berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Ayyub] dan [Ubbaidullah] dari [Nafi'] dari [Ibnu Umar] bahwasanya ia melihat Ibnu Shoid berada di salah satu pintu masuk Madinah, kemudian Ibnu Umar mencelanya, dan ia pun menghinanya, ia pun semakin marah hingga menutupi jalan. Kemudian Ibnu Umar memukulnya dengan tongkat yang dibawanya, hingga ia memecahkannya. Lalu [Hafshah] berkata kepadanya; \"Ada masalah apa engkau dengannya, apa yang membuatmu mencelanya? Tidakkah engkau mendengar Rasulullah shallaallahu 'alaihi wa sallam bersabda: 'Hanyasanya Dajjal itu keluar dari kemarahan yang ia lakukan', \" [Affan] berkata ketika ia marah, [Yunus] berkata pada haditsnya; \"Apa yang membuatmu mencelanya.\""
            },
            {
                "number": 3754,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي أَبِي مَرَّةً أُخْرَى حَدَّثَنَا عَبْدُ الْوَهَّابِ الْخَفَّافُ عَنِ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَلَقِيتُ ابْنَ صَائِدٍ مَرَّتَيْنِ فَأَمَّا مَرَّةً فَلَقِيتُهُ وَمَعَهُ أَصْحَابُهُ فَذَكَرَ الْحَدِيثَ قَالَ وَنَخَرَ كَأَشَدِّ نَخِيرِ حِمَارٍ سَمِعْتُهُ قَالَ فَزَعَمَ أَصْحَابِي أَنِّي ضَرَبْتُهُ بِعَصًا كَانَتْ مَعِي حَتَّى انْكَسَرَتْ وَأَمَّا أَنَا فَلَمْ أَشْعُرْ بِذَلِكَ فَدَخَلْتُ عَلَى أُخْتِي حَفْصَةَ أُمِّ الْمُؤْمِنِينَ فَأَخْبَرْتُهَا بِذَلِكَ فَقَالَتْ وَمَا أَرَدْتَ إِلَيْهِ أَمَا عَلِمْتَ أَنَّهُ قَالَ إِنَّ أَوَّلَ خُرُوجِهِ عَلَى النَّاسِ لِغَضْبَةٍ يَغْضَبُهَا",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku Ayahku telah menceritakan kepada kami [Abdul Wahhab Al Khaffaf] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] berkata; \"Saya pernah bertemu Ibnu Shoid untuk yang kedua kalinya. Yang pertama, saya bertemu dengannya ketika ia bersama para sahabatnya dan ia telah menyebutkan kejadian tersebut.\" ia berkata; \"(yang kedua), ia bersuara seperti suara keledai yang aku sudah pernah mendengarnya.\" Ia berkata; \"Para sahabatku mengklaim bahwa aku telah memukulnya dengan tongkat milikku hingga pecah. Sementara aku tidak merasa telah melakukan hal itu. lalu saya menemui saudara perempuan ku, [Hafshah ummul mukminin], aku pun mengabarkan hal itu.\" Ia pun berkata; \"Apa yang engkau inginkan kepadanya?\" Tidakkah engkau mendengar Rasulullah shallaallahu 'alaihi wa sallam bersabda: 'Hanyasanya Dajjal itu keluar dari kemarahan yang ia lakukan', \""
            },
            {
                "number": 3755,
                "arab": "قَالَ قَرَأْتُ عَلَى عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ : مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ حَفْصَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَكَتَ الْمُؤَذِّنُ مِنْ الْأَذَانِ بِالصُّبْحِ وَبَدَا الصُّبْحُ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ تُقَامَ الصَّلَاةُ",
                "id": "Telah (Imam Ahmad) Berkata; saya telah membaca kepada [Abdurrahman bin Mahdi]; [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa [Hafshah], isteri Nabi shallaallahu 'alaihi wa sallam telah mengabarkan kepadanya; \"Apabila muadzin telah selesai adzan shubuh dan waktu shubuh sudah terlihat, Rasulullah shallaallahu 'alaihi wa sallam melakukan sholat dua raka'at ringan sebelum dilaksanakannya sholat shubuh.\""
            },
            {
                "number": 3756,
                "arab": "حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ مُحَمَّدٍ الْخَطَّابِيُّ فِي سَنَةِ ثَمَانٍ وَمِائَتَيْنِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو الرَّقِّيُّ عَنْ عَبْدِ الْكَرِيمِ يَعْنِي الْجَزَرِيَّ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنْ حَفْصَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَذَّنَ الْمُؤَذِّنُ صَلَّى رَكْعَتَيْنِ وَحَرَّمَ الطَّعَامَ وَكَانَ لَا يُؤَذِّنُ حَتَّى يَطْلُعَ الْفَجْرُ",
                "id": "Telah menceritakan kepada kami [Abdul Jabbar bin Muhammad Al Khattabi] pada tahun dua ratus delapan, ia berkata; telah menceritakan kepada kami [ubaidhullah bin Amru Arraqyu] dari [Abdul Karim, yaitu Al Jazari] dari [Nafi'] dari [Ibnu Umar] dari [Hafshah], apabila muadzin telah mengumandangkan adzan, Nabi shallaallahu 'alaihi wa sallam melakukan sholat dua raka'at dan mengharamkan makanan, sementara adzan tidak dikumandangkan hingga telah terbitnya fajar.\""
            },
            {
                "number": 3757,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنْ حَفْصَةَأَنَّهَا قَالَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَكَ لَمْ تَحِلَّ مِنْ عُمْرَتِكَ قَالَ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلَا أَحِلُّ حَتَّى أَنْحَرَ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Malik] dari [Nafi'] dari [Ibnu Umar] dari [Hafshah] bahwasanya dia bertanya kepada Nabi shallaallahu 'alaihi wa sallam, \"Apa yang membuatmu tidak bertahalul pada umrah engkau?\" beliau menjawab: \"Sesungguhnya aku melipat rambutku, mengalungkan tali kalung untuk hewan kurbanku, dan aku tidak akan bertahalul hingga aku menyembelihnya.\""
            },
            {
                "number": 3758,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ زَيْدِ بْنِ مُحَمَّدٍ قَالَ سَمِعْتُ نَافِعًا يُحَدِّثُ عَنِ ابْنِ عُمَرَ عَنْ حَفْصَةَ أَنَّهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا طَلَعَ الْفَجْرُ لَا يُصَلِّي إِلَّا رَكْعَتَيْنِ خَفِيفَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Zaid bin Muhammad] berkata; saya telah mendengar [Nafi'] menceritakan dari [Ibnu Umar] dari [Hafshah] bahwasanya ia berkata; \"Apabila telah terbit fajar, Rasulullah shallaallahu 'alaihi wa sallam tidak melakukan sholat kecuali dua raka'at ringan.\""
            },
            {
                "number": 3759,
                "arab": "حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ قَالَ حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ بُرْقَانَ حَدَّثَنَا نَافِعٌ عَنِ ابْنِ عُمَرَ أَنَّ حَفْصَةَ أَخْبَرَتْهُ قَالَتْأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَحِلَّ فِي حَجَّتِهِ الَّتِي حَجَّو قَالَ كَثِيرُ بْنُ مُرَّةَ أَنَّ ابْنَ عُمَرَ أَخْبَرَهُ",
                "id": "Telah menceritakan kepada kami [Katsir bin Hisyam] berkata; telah menceritakan kepada kami [Ja'far, yaitu ibnu Burqan] telah menceritakan kepada kami [Nafi'] dari [Ibn Umar] bahwasannya [Hafshah] telah mengabarkan kepadanya; ia berkata; \"Aku diperintah oleh Rasulullah shallaallahu 'alaihi wa sallam untuk bertahallul pada haji yang beliau tunaikan.\" Katsir bin Marrah mengatakan bahwa Ibnu Umar telah mengabarkan kepadanya."
            },
            {
                "number": 3760,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ حَدَّثَنَا شُعَيْبٌ يَعْنِي ابْنَ أَبِي حَمْزَةَ قَالَ قَالَ نَافِعٌ كَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَقُولُ أَخْبَرَتْنِي حَفْصَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَزْوَاجَهُ أَنْ يَحْلِلْنَ عَامَ حَجَّةِ الْوَدَاعِ فَقَالَتْ لَهُ فُلَانَةُ فَمَا يَمْنَعُكَ أَنْ تَحِلَّ فَقَالَ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلَسْتُ أَحِلُّ حَتَّى أَنْحَرَ هَدْيِي",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] telah menceritakan kepada kami [Syu'aib, yaitu Ibnu Abu Hamzah] berkata; [Nafi'] berkata; bahwa [Abdullah bin Umar] berkata; telah mengabarkan kepadaku [Hafshah, isteri Nabi shallallahu 'alaihi wasallam.] bahwa Nabi shallaallahu 'alaihi wa sallam memerintahkan para isterinya untuk bertahalul pada tahun haji wada'. Lalu ada seorang wanita bertanya kepadanya; \"Apa yang menghalangi engkau untuk bertahalul?\" ia menjawab; \"Sesungguhnya aku melipat rambutku, mengalungkan tali kalung untuk hewan kurbanku, dan aku tidak akan bertahalul hingga aku menyembelih hewan kurbanku.\""
            },
            {
                "number": 3761,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ حَفْصَةَ ابْنَةِ عُمَرَ قَالَتْلَمَّا أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِسَاءَهُ أَنْ يَحْلِلْنَ بِعُمْرَةٍ قُلْنَ فَمَا يَمْنَعُكَ يَا رَسُولَ اللَّهِ أَنْ تَحِلَّ مَعَنَا قَالَ إِنِّي قَدْ أَهْدَيْتُ وَلَبَّدْتُ فَلَا أَحِلُّ حَتَّى أَنْحَرَ هَدْيِي وَقَالَ يَعْقُوبُ فِي كِتَابِ الْحَجِّ أَنْحَرَ هَدِيَّتِي",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Ayahku] dari [Ibnu Ishaq] berkata; telah menceritakan kepadaku [Nafi'] dari [Abdullah bin Umar] dari [Hafshah, anak perempuan Umar] berkata; \"Ketika Rasulullah shallaallahu 'alaihi wa sallam memerintahkan para isteri beliau agar mereka bertahallul pada umrah mereka, mereka bertanya; 'Apa yang menghalangimu untuk beretahallul dengan kami wahai Rasulullah? ', beliau bersabda: 'Sesungguhnya aku telah mempersiapkan hewan kurban dan mengikat rambutku, maka aku tidak akan bertahallul hingga aku menyembelih kurbanku'.\" Ya'qub meriwayatkan di dalam kitab Haji; 'Saya menyembelih hewan kurbanku.'"
            },
            {
                "number": 3762,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبُو عَوَانَةَ حَدَّثَنَا الْحُرُّ بْنُ الصَّيَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنِ امْرَأَتِهِ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ تِسْعَ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ وَخَمِيسَيْنِ",
                "id": "Telah menceritakan kepada kami [Affan] telah menceritakan kepada kami [Abu Awanah] telah menceritakan kepada kami [Al Hurru bin Ashshayyah] dari [Hunaidah bin Khalid] dari [isterinya] dari [sebagian isteri Nabi shallaallahu 'alaihi wa sallam] berkata; \"Rasulullah shallaallahu 'alaihi wa sallam berpuasa pada hari ke sembilan bulan dzulhijjah, pada hari asyura, dan tiga hari setiap bulan, yaitu hari senin pada pekan pekan pertama dan dua hari kamis pada pekan setelah nya.\""
            },
            {
                "number": 3763,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَأَبُو كَامِلٍ وَعَفَّانُ قَالُوا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ عَفَّانُ فِي حَدِيثِهِ قَالَ أَخْبَرَنَا أَنَسُ بْنُ سِيرِينَ عَنْ أَبِي مِجْلَزٍ عَنْ حَفْصَةَأَنَّ عُطَارِدَ بْنَ حَاجِبٍ قَدِمَ مَعَهُ ثَوْبُ دِيبَاجٍ كَسَاهُ إِيَّاهُ كِسْرَى فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ اشْتَرَيْتَهُ فَقَالَ إِنَّمَا يَلْبَسُهُ مَنْ لَا خَلَاقَ لَهُ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dan [Abu Kamil] dan [Affan], mereka berkata; telah menceritakan kepada kami [Hammad bin Salamah] berkata; [Affan] berkata dalam haditsnya; telah mengabarkan kepada kami [Anas bin Sirin] dari [Abu Mijlaz] dari [Hafshah] bahwasanya Uthorid bin Hajib pernah diberi sejenis sutra yang biasa dipakai oleh para Kaisar. Lalu Umar berkata; \"Wahai Rasulullah shallaallahu 'alaihi wa sallam! Seandainya engkau membeli pakaian sepertinya.\" beliau bersabda: \"Hanyasanya orang yang memakainya adalah orang yang tidak akan mendapatkan keberuntungan.\""
            },
            {
                "number": 3764,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ نَافِعِ بْنِ عُمَرَ وَأَبُو عَامِرٍ حَدَّثَنَا نَافِعٌ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عَامِرٍ قَالَ نَافِعٌ أُرَاهَا حَفْصَةَأَنَّهَا سُئِلَتْ عَنْ قِرَاءَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّكُمْ لَا تَسْتَطِيعُونَهَا قَالَ فَقِيلَ لَهَا أَخْبِرِينَا بِهَا قَالَ فَقَرَأَتْ قِرَاءَةً تَرَسَّلَتْ فِيهَا قَالَ أَبُو عَامِرٍ قَالَ نَافِعٌ فَحَكَى لَنَا ابْنُ أَبِي مُلَيْكَةَ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ }ثُمَّ قَطَّعَ{ الرَّحْمَنِ الرَّحِيمِ }ثُمَّ قَطَّعَ{ مَالِكِ يَوْمِ الدِّينِ }",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Nafi' bin Umar] dan [Abu Amir] telah menceritakan kepada kami [Nafi'] dari [Ibnu Abu Mulaikah] dari [sebagian isteri Nabi shallaallahu 'alaihi wa sallam], [Abu Amir] berkata; berkata [Nafi']; ia pernah melihat [Hafshah] ditanya mengenai bacaannya Rasulullah shallaallahu 'alaihi wa sallam, ia menjawab; \"Sesungguhnya kalian tidak akan mampu melaksanakannya.\" Ia berkata; lalu dikatakan kepadanya; \"Kabarkanlah hal itu kepada kami!\" Ia berkata; \"Ia membacanya secara tartil.\" [Abu Amir] berkata; berkata [Nafi'], [Ibnu Mulaikah] menceritakan kepada kami; ALHAMDULILLAHI RABBIL 'ALAMIIN, kemudian ia memutusnya, ARRAHMAANIR RAHIIM, kemudian ia memutusnya, MAALIKI YAU MUDDIN.\""
            },
            {
                "number": 3765,
                "arab": "حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ سُبَيْعَةَ ابْنَةَ الْحَارِثِ وَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِعِشْرِينَ لَيْلَةً أَوْ نَحْوِ ذَلِكَ وَأَرَادَتْ التَّزْوِيجَ فَقَالَ لَهَا أَبُو السَّنَابِلِ لَيْسَ لَكِ ذَلِكَ حَتَّى يَأْتِيَ عَلَيْكِ آخِرُ الْأَجَلَيْنِ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ تَزَوَّجُ إِذَا شَاءَتْ",
                "id": "Telah menceritakan kepada kami [Husyaim bin Basyir] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sulaiman bin Yasar] dari [Ummu Salamah, isteri Nabi shallaallahu 'alaihi wa sallam] bahwasanya Subai'ah binti Harits melahirkan anaknya pada hari keduapuluh setelah suaminya meninggal, setelah itu ia ingin menikah lagi. Lalu Abu Sanabil berkata kepadanya; \"Engkau tidak boleh melakukannya hingga datang dua waktu (setelah kematian dan melahirkan).\" Hal itu pun diceritakan kepada Nabi shallaallahu 'alaihi wa sallam, beliau pun bersabda: \"Suruhlah ia menikah jika mau.\""
            },
            {
                "number": 3766,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ ابْنِ أَبِي نَجِيحٍ عَنْ أَبِيهِ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ أُمِّ سَلَمَةَ قَالَتْلَمَّا مَاتَ أَبُو سَلَمَةَ قُلْتُ غَرِيبٌ وَمَاتَ بِأَرْضِ غُرْبَةٍ فَأَفَضْتُ بُكَاءً فَجَاءَتْ امْرَأَةٌ تُرِيدُ أَنْ تُسْعِدَنِي مِنْ الصَّعِيدِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرِيدِينَ أَنْ تُدْخِلِي الشَّيْطَانَ بَيْتًا قَدْ أَخْرَجَهُ اللَّهُ عَزَّ وَجَلَّ مِنْهُ قَالَتْ فَلَمْ أَبْكِ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibnu Abi Najih] dari [Ayahnya] dari [Ubaid bin Umair] dari [Ummu Salamah] berkata; ketika Abu Salamah meninggal, aku mengatakan seolah ia terasing dan mati di keterasingan dan aku pun menangis. Kemudian datanglah seorang wanita ingin menangis bersamaku, lantas Rasulullah shallaallahu 'alaihi wa sallam bersabda: \"Apakah engkau ingin memasukkan syetan kedalam rumah yang Allah telah keluarkan darinya, \" ia berkata; \"Aku pun tidak menangisinya lagi.\""
            },
            {
                "number": 3767,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ أُمِّ سَلَمَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَتْ الْعَشْرُ فَأَرَادَ رَجُلٌ أَنْ يُضَحِّيَ فَلَا يَمَسَّ مِنْ شَعْرِهِ وَلَا مِنْ بَشَرِهِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abdurrahman bin Humaid] bahwa ia telah mendengar [Sa'id bin Musayyab] dari [Ummu Salamah] dari Nabi shallaallahu 'alaihi wa sallam: \"Apabila telah masuk hari kesepuluh Dzulhijjah, dan ada seseorang yang ingin menyembelih sembelihannya, maka janganlah ia mengambil jatah dari rambut maupun kulitnya.\""
            },
            {
                "number": 3768,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ ابْنِ سُوقَةَ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ أُمِّ سَلَمَةَذَكَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَيْشَ الَّذِي يُخْسَفُ بِهِمْ فَقَالَتْ أُمُّ سَلَمَةَ لَعَلَّ فِيهِمْ الْمُكْرَهَ فَقَالَ إِنَّهُمْ يُبْعَثُونَ عَلَى نِيَّاتِهِمْ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibnu Suqah] dari [Nafi' bin Jubair] dari [Ummu Salamah] bahwa Nabi shallaallahu 'alaihi wa sallam pernah menceritakan akan suatu pasukan yang ditenggelamkan, lalu Ummu Salamah berkata; \"Barangkali di antara mereka ada yang terpaksa?\", beliau bersabda: \"Sesungguhnya mereka akan dibangkitkan sesuai niat mereka.\""
            },
            {
                "number": 3769,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ سَعِيدٍ يَعْنِي الْمَقْبُرِيَّ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ وَهُوَ مَوْلَى أُمِّ سَلَمَةَ كَذَا قَالَ سُفْيَانُ أَنَّهَا قَالَتْيَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أَشُدُّ ضَفْرَ رَأْسِي قَالَ يُجْزِئُكِ أَنْ تَصُبِّي عَلَيْهِ الْمَاءَ ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Ayyub bin Musa] dari [Sa'id, yaitu Al Maqburi] dari [Abdullah bin Rofi', dia adalah bekas budak Ummu Salamah], seperti yang dikatakan Sufyan bahwasanya Ummu Salamah berkata; \"Wahai Rasulullah! sesungguhnya aku adalah seorang wanita dengan rambut terpintal.\" lalu beliau bersabda: \"Cukuplah engkau menyiram di atasnya tiga kali.\""
            },
            {
                "number": 3770,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ قَالَ قَالَتْ أُمُّ سَلَمَةَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ تَعْجِيلًا لِلظُّهْرِ مِنْكُمْ وَأَنْتُمْ أَشَدُّ تَعْجِيلًا لِلْعَصْرِ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Ismail bin Ibrahim] berkata; telah menceritakan kepada kami [Ibnu Juraij] dari [Abdullah bin Abi Mulaikah] berkata; [Ummu Salamah] berkata; \"Rasulullah shallaallahu 'alaihi wa sallam adalah seorang yang paling menyegerakan sholat zhuhur daripada kalian, sementara kalian lebih menyegerakan sholat Ashar daripada beliau.\""
            },
            {
                "number": 3771,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ قَالَسُئِلَتْ عَائِشَةُ وَأُمُّ سَلَمَةَ أَيُّ الْعَمَلِ كَانَ أَعْجَبَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ مَا دَامَ عَلَيْهِ وَإِنْ قَلَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Fudhail] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] berkata; [Aisyah] dan [Ummu Salamah] pernah ditanya tentang perkara apa yang paling disukai Nabi shallaallahu 'alaihi wa sallam?, ia menjawab; \"Amalan yang kontinu dilakukan walaupun sedikit.\""
            },
            {
                "number": 3772,
                "arab": "حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ قَالَدَخَلْتُ أَنَا وَأَبِي عَلَى عَائِشَةَ وَأُمِّ سَلَمَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصْبِحُ وَهُوَ جُنُبٌ ثُمَّ يَصُومُ",
                "id": "Telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Azzuhri] dari [Abu Bakr bin Abdurrahman bin Al Harits bin Hisyam] berkata; \"Saya dan ayah ku pernah menemui [Aisyah] dan [Ummu Salamah], ia berkata; 'Ketika di pagi hari, Nabi shallaallahu 'alaihi wa sallam masih dalam keadaan junub, kemudian beliau berpuasa'.\""
            },
            {
                "number": 3773,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنِ ابْنِ عَوْنٍ عَنِ الْحَسَنِ عَنْ أُمِّهِ عَنْ أُمِّ سَلَمَةَ قَالَتْمَا نَسِيتُ قَوْلَهُ يَوْمَ الْخَنْدَقِ وَهُوَ يُعَاطِيهِمُ اللَّبَنَ وَقَدْ اغْبَرَّ شَعْرُ صَدْرِهِ وَهُوَ يَقُولُ اللَّهُمَّ إِنَّ الْخَيْرَ خَيْرُ الْآخِرَهْفَاغْفِرْ لِلْأَنْصَارِ وَالْمُهَاجِرَهْقَالَ فَرَأَى عَمَّارًا فَقَالَ وَيْحَهُ ابْنُ سُمَيَّةَ تَقْتُلُهُ الْفِئَةُ الْبَاغِيَةُقَالَ فَذَكَرْتُهُ لِمُحَمَّدٍ يَعْنِي ابْنَ سِيرِينَ فَقَالَ عَنْ أُمِّهِ قُلْتُ نَعَمْ أَمَا إِنَّهَا كَانَتْ تُخَالِطُهَا تَلِجُ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Abi Adi] dari [Ibnu Aun] dari [Al Hasan] dari [Ibunya] dari [Ummu Salamah] berkata; \"Aku tidak akan pernah lupa akan do'a beliau pada perang Khandak, ketika itu beliau memberi susu kepada para sahabat, sedang bulu dadanya berdebu. Beliau berdo'a: \"ALLAHUMMA INNAL KHOIRA KHOIRUL AKHIRAH FAGHFIR LIL ANSHAR WAL MUHAJIRAH (ya Allah, sesungguhnya kebaiklan itu adalah kebaikan di akhirat, maka ampunilah orang-orang Anshor dan muhajirin) \", beliau pun lantas melihat Ammar dan bersabda: \"Celakalah ibnu Sumayyah, ia akan dibunuh oleh sekelompok pemberontak, \" ia berkata; \"Aku pun menceritakannya kepada Muhammad, yakni Ibnu Sirin, ia berkata dari ibunya; aku berkata; 'Ya.', hanya saja ia mencampurnya dan memasukinya (dengan kata tambahan)."
            },
            {
                "number": 3774,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ : مَالِكٌ عَنْ سُمَيٍّ وَعَبْدِ رَبِّهِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ وَأُمِّ سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصْبِحُ جُنُبًا مِنْ جِمَاعٍ غَيْرِ احْتِلَامٍ ثُمَّ يَصُومُوَفِي حَدِيثِ عَبْدِ رَبِّهِ فِي رَمَضَانَ",
                "id": "Telah menceritakan kepada kami [Abdurrahman, yaitu Ibnu Mahdi], [Malik] dari [Summi] dan [Abdu Rabih] dari [Abu Bakr bin Abdurrahman] dari [Aisyah] dan [Ummu Salamah] bahwa ketika di pagi hari Rasulullah shallaallahu 'alaihi wa sallam masih dalam keadaan junub karena jima', bukan karena bermimpi, lalu beliau berpuasa. Dalam hadits Abdurrabih (diriwayatkan), \"Di bulan Ramadhan.\""
            },
            {
                "number": 3775,
                "arab": "حَدَّثَنَا حَجَّاجٌ وَحَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَا أَنَا ابْنُ أَبِي ذِئْبٍ وَإِسْحَاقُ بْنُ سُلَيْمَانَ قَالَ سَمِعْتُ ابْنَ أَبِي ذِئْبٍ عَنْ صَالِحٍ مَوْلَى التَّوْأَمَةِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِنِسَائِهِ عَامَ حَجَّةِ الْوَدَاعِ هَذِهِ ثُمَّ ظُهُورَ الْحُصْرِ قَالَ فَكُنَّ كُلُّهُنَّ يَحْجُجْنَ إِلَّا زَيْنَبَ بِنْتَ جَحْشٍ وَسَوْدَةَ بِنْتَ زَمْعَةَ وَكَانَتَا تَقُولَانِ وَاللَّهِ لَا تُحَرِّكُنَا دَابَّةٌ بَعْدَ أَنْ سَمِعْنَا ذَلِكَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِسْحَاقُ بْنُ سُلَيْمَانَ فِي حَدِيثِهِ قَالَتَا وَاللَّهِ لَا تُحَرِّكُنَا دَابَّةٌ بَعْدَ قَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ ثُمَّ ظُهُورَ الْحُصْرِ وَقَالَ يَزِيدُ بَعْدَ أَنْ سَمِعْنَا ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Hajjaj] dan telah menceritakan kepada kami [Yazid bin Harun] keduanya berkata, telah memberitakan kepada kami [Ibnu Abu Dzi'b] dan [Ishaq bin Sulaiman] berkata, aku mendengar dari [Ibnu Abu Dzi'b] dari [Shalih] budak At Tauamah, dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada para isterinya pada haji Wada': \"Ini (haji yang terakhir), kemudian menetap tinggal di rumah.\" Ketika itu mereka semua melaksanakan haji, kecuali Zainab binti Jahsy dan Saudah binti Zam'ah, keduanya berkata, \"Demi Allah, tunggangan kami tidak bergerak (untuk membawa kami pergi) setelah kami mendengar hal itu dari Rasulullah shallallahu 'alaihi wasallam.\" [Ishaq bin Sulaiman] menyebutkan dalam haditsnya, \"Keduanya berkata, \"Demi Allah, tunggangan kami tidak bergerak (untuk membawa kami pergi) setelah sabda Rasulullah shallallahu 'alaihi wasallam 'Ini (haji yang terakhir) kemudian menetap tinggal di rumah'.\" [Yazid] menyebutkan, \"Setelah kami mendengar itu dari Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3776,
                "arab": "حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عُمَرَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ جَحْشٍأَنَّهَا كَانَتْ تُرَجِّلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَتْ مَرَّةً كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِخْضَبٍ مِنْ صُفْرٍ",
                "id": "Telah menceritakan kepada kami [Hammad bin Khalid] berkata telah menceritakan kepada kami ['ubaidhullah] -yakni Ibnu 'Umar- dari [Ibrahim bin Muhammad] dari [Bapaknya] dari [Zainab binti Jahsy] bahwa dia pernah menyisir rambut Rasulullah shallallahu 'alaihi wasallam, ia pernah berkata, \"Aku pernah menyisir rambut Rasulullah shallallahu 'alaihi wasallam di dalam bejana yang terbuat dari kuningan.\""
            },
            {
                "number": 3777,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ قَالَ حَدَّثَنَا الدَّرَاوَرْدِيُّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ زَيْنَبَ بِنْتِ جَحْشٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَوَضَّأُ فِي مِخْضَبٍ مِنْ صُفْرٍ",
                "id": "Telah menceritakan kepada kami ['Ali bin Bahr] berkata, telah menceritakan kepada kami [Ad Darawardi] berkata, telah mengabarkan kepada kami ['ubaidhullah bin 'Umar] dari [Muhammad bin Ibrahim] dari [Zainab binti Jahsy], bahwa Rasulullah shallallahu 'alaihi wasallam berwudlu dari bejana yang terbuat dari kuningan.\""
            },
            {
                "number": 3778,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ حُمَيْدِ بْنِ نَافِعٍ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ أَخْبَرَتْهُأَنَّهَا دَخَلَتْ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَقُولُ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثِ لَيَالٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا",
                "id": "Telah menceritakan kepada kami berkata [Abdurrazaq] berkata, telah mengabarkan kepada kami [Malik] dari [Abdullah bin Abu Bakar] dari [Humaid bin Nafi'] bahwa [Zainab binti Abu Salamah] mengabarkan kepadanya, bahwa ia menemui [Zainab binti Jahsy], isteri Nabi shallallahu 'alaihi wasallam, lalu ia berkata, \"Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Tidaklah halal bagi seorang Muslimah yang beriman kepada Allah dan Hari Akhir untuk melakukan tahdid (meninggalkan hias dan perhiasan) karena kematian lebih dari tiga malam, kecuali karena kematian suami yaitu selama empat bulan sepuluh hari.\""
            },
            {
                "number": 3779,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي أَيُّوبَ الْهَجَرِيِّ عَنْ جُوَيْرِيَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى جُوَيْرِيَةَ فِي يَوْمِ جُمُعَةٍ وَهِيَ صَائِمَةٌ فَقَالَ لَهَا أَصُمْتِ أَمْسِ قَالَتْ لَا قَالَ تَصُومِينَ غَدًا قَالَتْ لَا قَالَ فَأَفْطِرِي",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abu Ayyub Al Hajary] dari [Juwairiyah] bahwa Rasulullah shallallahu 'alaihi wasallam menemui Juwairiyah pada hari Jum'at, ketika itu dia sedang berpuasa, kemudian beliau bersabda kepadanya: \"Apakah kamu kemarin berpuasa?\" dia menjawab, \"Tidak.\" Beliau bersabda: \"Apakah kamu besok hendak berpuasa?\" dia menjawab, \"Tidak.\" Beliau bersabda: \"Berbukalah sekarang.\""
            },
            {
                "number": 3780,
                "arab": "حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي أَيُّوبَ عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَهِيَ صَائِمَةٌ فَقَالَ أَصُمْتِ أَمْسِ فَقَالَتْ لَا قَالَ أَتُرِيدِينَ أَنْ تَصُومِي غَدًا قَالَتْ لَا قَالَ فَأَفْطِرِي",
                "id": "Telah menceritakan kepada kami [Bahs] berkata, telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Abu Ayyub] dari [Juwairiyyah binti Al Harits] bahwa Nabi shallallahu 'alaihi wasallam menemuinya saat ia sedang berpuasa, kemudian beliau bersabda: \"Apakah kamu kemarin berpuasa?\" ia menjawab, \"Tidak.\" Beliau bersabda: \"Apakah kamu besok hendak berpuasa?\" ia menjawab, \"Tidak.\" Beliau bersabda: \"Berbukalah sekarang.\""
            },
            {
                "number": 3781,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا شَرِيكٌ عَنْ جَابِرٍ عَنْ خَالَتِهِ أُمِّ عُثْمَانَ عَنْ الطُّفَيْلِ ابْنِ أَخِي جُوَيْرِيَةَ عَنْ جُوَيْرِيَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَبِسَ ثَوْبَ حَرِيرٍ أَلْبَسَهُ اللَّهُ ثَوْبًا مِنْ النَّارِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Syarik] dari [Jabir] dari bibinya [Ummi 'Ustman] dari [Thufail] anak laki-laki dari saudaranya Juwairiyah, dari [Juwairiyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengenakan pakaian sutra, maka Allah akan mengenakan pakaian untuknya dari api neraka pada hari kiamat.\""
            },
            {
                "number": 3782,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ قَالَ سَمِعْتُ كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِ قَالَتْأَتَى عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُدْوَةً وَأَنَا أُسَبِّحُ ثُمَّ انْطَلَقَ لِحَاجَةٍ ثُمَّ رَجَعَ قَرِيبًا مِنْ نِصْفِ النَّهَارِ فَقَالَ مَا زِلْتِ قَاعِدَةً قُلْتُ نَعَمْ فَقَالَ أَلَا أُعَلِّمُكِ كَلِمَاتٍ لَوْ عُدِلْنَ بِهِنَّ عَدَلَتْهُنَّ أَوْ لَوْ وُزِنَّ بِهِنَّ وَزَنَتْهُنَّ يَعْنِي بِجَمِيعِ مَا سَبَّحَتْ سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ ثَلَاثَ مَرَّاتٍ سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ ثَلَاثَ مَرَّاتٍ سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ ثَلَاثَ مَرَّاتٍ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ ثَلَاثَ مَرَّاتٍ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami Hajjaj telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin 'Abdurrahman] bekas budak keluarga Thalhah, ia berkata; aku mendengar [Kuraib] budak Ibnu Abbas, menceritakan dari [Ibnu Abbas] dari [Juwairiyah binti Al Harits] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemuiku waktu Shubuh, ketika itu aku sedang bertasbih, kemudian beliau pergi untuk suatu keperluan dan kembali lagi sebelum pertengahan siang, beliau bersabda: \"Masihkah kamu duduk (bertasbih)?\" aku menjawab, \"Ya.\" Beliau lalu bersabda: \"Maukah kamu aku ajari beberapa kalimat jika ia diseimbangkan dengannya maka ia akan seimbang, atau jika ia ditimbang maka ia akan sama timbangannya, yakni dengan semua yang kamu tasbihkan; SUBHAANALLAH 'ADADA KHALQIHI (Maha suci Allah sejumlah hitungan makhluk-Nya) tiga kali, SUBHAANALLAH ZINATA 'ARSYIHI (Maha Suci Allah menurut kebesaran Arsy-Nya) tiga kali, SUBHAANALLAH RILHA NAFSIHI (Maha Suci Allah menurut keridlaan-Nya) tiga kali, dan SUBHAANALLAH MIDADA KALIMATIHI (Maha Suci Allah sebanyak paparan kalimat-Nya) tiga kali.\""
            },
            {
                "number": 3783,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍأَنَّ عُمَرَ بْنَ الْخَطَّابِ وَجَدَ رِيحَ طِيبٍ بِذِي الْحُلَيْفَةِ فَقَالَ مِمَّنْ هَذِهِ الرِّيحُ فَقَالَ مُعَاوِيَةُ مِنِّي يَا أَمِيرَ الْمُؤْمِنِينَ فَقَالَ مِنْكَ لِعَمْرِي فَقَالَ طَيَّبَتْنِي أُمُّ حَبِيبَةَ وَزَعَمَتْ أَنَّهَا طَيَّبَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ إِحْرَامِهِ فَقَالَ اذْهَبْ فَأَقْسِمْ عَلَيْهَا لَمَا غَسَلَتْهُ فَرَجَعَ إِلَيْهَا فَغَسَلَتْهُ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Hammad] -yakni Ibnu Salamah- dari [Yahya bin Abu Ishaq] dari [Sulaiman bin Yasar] bahwa 'Umar bin Khattab mencium bau harum di Dzul Hulaifah, lalu dia berkata, \"Dari manakah bau harum ini?\" Mu'awiyah menjawab, \"Dariku wahai Amirul Mukminin.\" Umar berkata, \"Darimu untuk umrahku?\" lalu dia berkata, \" [Ummi Habibah] yang telah memberikan parfum ini dan dia mengatakan bahwa ia pernah memberikan kepada Rasulullah shallallahu 'alaihi wasallam ketika beliau ihram.\" Umar berkata, \"Pergi dan suruhlah ia mencuci.\" Maka Mu'awiyah kembali menemui Ummu Habibah, hingga ia pun mencucinya.\""
            },
            {
                "number": 3784,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنِ ابْنِ إِسْحَاقَ عَنِ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍ عَنْ مُعَاوِيَةَ قَالَقُلْتُ لِأُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي الثَّوْبِ الَّذِي يَنَامُ مَعَكِ فِيهِ قَالَتْ نَعَمْ مَا لَمْ يَرَ فِيهِ أَذًى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Salamah] dari [Ibnu Ishaq] dari [Yazid bin Abu Habib] dari [Suwaid bin Qais] dari [Mu'awiyah bin Hudaij] dari [Mu'awiyah] dia berkata, \"Aku berkata kepada [Ummi Habibah] isteri Nabi shallallahu 'alaihi wasallam, \"Apakah dulu Rasulullah shallallahu 'alaihi wasallam pernah sholat dengan pakaian yang dikenakannya ketika tidur bersamamu?\" Dia menjawab, \"Ya. Jika beliau tidak melihat ada kotoran padanya.\""
            },
            {
                "number": 3785,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ قَالَ حَدَّثَنَا ضَمْرَةُ بْنُ حَبِيبٍ أَنَّ مُحَمَّدَ بْنَ أَبِي سُفْيَانَ الثَّقَفِيَّ حَدَّثَهُ أَنَّهُ سَمِعَ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَعَلَيَّ وَعَلَيْهِ ثَوْبٌ وَاحِدٌ فِيهِ كَانَ مَا كَانَ",
                "id": "Telah menceritakan kepada kami [Zaid bin Khubab] berkata, telah menceritakan kepada kami [Mu'awiyah bin Shalih] berkata, telah menceritakan kepada kami [Dlamrah bin Habib] bahwa [Muhammad bin Abu Sufyan At Tsaqafi] menceritakan kepadanya, bahwa dirinya mendengar [Ummu Habibah] isteri Nabi shallallahu 'alaihi wasallam berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam sholat dengan tetap memakai pakaian yang dipakai waktu bersamaku.\""
            },
            {
                "number": 3786,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ طَلْحَةَ بْنِ يَزِيدَ بْنِ رُكَانَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِي الْجَرَّاحِ مَوْلَى أُمِّ حَبِيبَةَ عَنْ أُمِّ حَبِيبَةَ أَنَّهَا حَدَّثَتْهُ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلَاةٍ كَمَا يَتَوَضَّئُونَ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] berkata, telah menceritakan kepadaku [Muhammad bin Thalhah bin Yazid bin Rukanah] dari [Salim bin Abdullah bin Umar] dari [Abu Al Jarrah] bekas budak Ummu Habibah, dari [Ummi Habibah] dia mengabarkan kepadanya, dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya aku tidak memberatkan umatku niscaya akan aku perintahkan mereka memakai siwak setiap akan sholat sebagaimana mereka berwudlu.\""
            },
            {
                "number": 3787,
                "arab": "حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ حَسَّانَ بْنِ عَطِيَّةَ قَالَلَمَّا نَزَلَ عَنْبَسَةَ بْنَ أَبِي سُفْيَانَ الْمَوْتُ اشْتَدَّ جَزَعُهُ فَقِيلَ لَهُ مَا هَذَا الْجَزَعُ قَالَ إِنِّي سَمِعْتُ أُمَّ حَبِيبَةَ يَعْنِي أُخْتَهُ تَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى أَرْبَعًا قَبْلَ الظُّهْرِ وَأَرْبَعًا بَعْدَهَا حَرَّمَ اللَّهُ لَحْمَهُ عَلَى النَّارِ فَمَا تَرَكْتُهُنَّ مُنْذُ سَمِعْتُهُنَّ",
                "id": "Telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Al Auza'i] dari [Hasan bin 'Athiyah] dia berkata, \"Ketika ['Anbasyah bin Abu Sufyan] mendekati ajalnya, kegelisahannya semakin menjadi-jadi, lalu dikatakan kepadanya, \"Kegelisahan apa ini?\" dia menjawab, \"Aku mendengar [Ummu Habibah], yakni saudara perempuannya, berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa sholat empat rakaat sebelum zhuhur dan empat rakaat setelahnya, maka Allah akan haramkan dagingnya dari api neraka.' Oleh karena itu aku tidak pernah lagi meninggalkannya semenjak aku mendengarnya.\""
            },
            {
                "number": 3788,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ وَحَجَّاجٌ قَالَ حَدَّثَنِي شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ قَالَ سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ قَالَتْتُوُفِّيَ حَمِيمٌ لِأُمِّ حَبِيبَةَ فَدَعَتْ بِصُفْرَةٍ فَمَسَحَتْ بِذِرَاعَيْهَا وَقَالَتْ إِنَّمَا أَصْنَعُ هَذَا لِشَيْءٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ حَجَّاجٌ لِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ مُسْلِمَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجِهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًاوَحَدَّثَتْهُ زَيْنَبُ عَنْ أُمِّهَا وَعَنْ زَيْنَبَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ عَنِ امْرَأَةٍ مِنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dan [Hajjaj] berkata, telah menceritakan kepadaku [Syu'bah] dari [Humaid bin Nafi'] berkata, aku mendengar [Zainab binti Abu Salamah] berkata, \"Sewaktu kerabat dekatnya [Ummu Habibah] meninggal, maka dia meminta bejana yang terbuat dari wewangian, kemudian dia mengusap kedua sikunya dan berkata, \"Aku melakukan seperti ini karena sesuatu yang pernah aku dengar dari Rasulullah shallallahu 'alaihi wasallam.\" [Hajjaaj] berkata, \"Sebab Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita Muslimah yang beriman dengan Allah dan hari akhir melakukan tahdid (tidak berhias) melebihi tiga hari kecuali karena kematian suaminya, yakni selama empat bulan sepuluh hari.\" Dan [Zainab] telah menceritakan kepadanya dari [Ibunya], dan dari [Zainab] isteri Nabi shallallahu 'alaihi wasallam, atau seorang wanita dari isteri - isteri Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3789,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ أَبِي الْمَلِيحِ عَنْ أُمِّ حَبِيبَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا سَمِعَ الْمُؤَذِّنَ يُؤَذِّنُ قَالَ كَمَا يَقُولُ حَتَّى يَسْكُتَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Abu Al Malih] dari [Ummu Habibah] dari Nabi shallallahu 'alaihi wasallam, bahwa jika beliau mendengar muadzin mengumandangkan adzan, maka beliau mengatakan seperti apa yang dikatakannya hingga selesai adzan.\""
            },
            {
                "number": 3790,
                "arab": "حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا حَمَّادُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا عَاصِمُ بْنُ بَهْدَلَةَ عَنْ أَبِي صَالِحٍ أَنَّ أُمَّ حَبِيبَةَ حَدَّثَتْعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً بَنَى اللَّهُ لَهُ أَوْ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Bahs] berkata, telah menceritakan kepada kami [Hammad bin Yazid] berkata, telah menceritakan kepada kami ['Ashim bin Bahdalah] dari [Abu Shalih] bahwa [Ummu Habibah] berkata dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa sholat dua belas rakaat dalam sehari, maka Allah akan membangun untuknya atau dibangunkan untuknya sebuah rumah di surga.\""
            },
            {
                "number": 3791,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ قَالَ نَافِعٌ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ أَبَا الْجَرَّاحِ مَوْلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَ عَبْدَ اللَّهِ بْنَ عُمَرَ أَنَّ أُمَّ حَبِيبَةَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْعِيرَ الَّتِي فِيهَا الْجَرَسُ لَا تَصْحَبُهَا الْمَلَائِكَةُ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah menceritakan kepada kami [Syu'aib] berkata, [Nafi'] berkata, telah mengabarkan kepadaku [Salim bin Abdullah bin Umar] bahwa [Abu Jarah] bekas budak Ummu Habibah, isteri Nabi shallallahu 'alaihi wasallam, berkata kepada Abdullah bin 'Umar bahwa [Ummu Habibah] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya malaikat tidak akan menyertai rombongan musafir yang terdapat lonceng pada mereka.\""
            },
            {
                "number": 3792,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ سَمِعْتُهُ يُحَدِّثُ يَعْنِي أَبَاهُ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ حَدَّثَهُ أَنَّ أَبَا الْجَرَّاحِ مَوْلَى أُمِّ حَبِيبَةَ أَخْبَرَهُ أَنَّ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصْحَبُ الْمَلَائِكَةُ قَوْمًا فِيهِمْ جَرَسٌ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata, aku mendengarnya menceritakan, yakni [bapaknya] dari [Yazid bin Abdullah bin Usamah bin Al Hadi] bahwa [Salim bin Abdullah bin Umar] telah menceritakan kepadanya, bahwa [Abu Al Jarrah] budak Ummu Habibah, telah mengabarkan kepadanya bahwa [Ummu Habibah] isteri Nabi shallallahu 'alaihi wasallam menceritakan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Malaikat tidak akan menyertai kaum yang terdapat lonceng di dalamnya.\""
            },
            {
                "number": 3793,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا مَالِكٌ وَإِسْحَاقُ بْنُ عِيسَى قَالَ أَخْبَرَنِي مَالِكٌ قَالَ عَبْد اللَّهِ و حَدَّثَنَا مُصْعَبٌ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَيْ يَزِيدَ ابْنِ جَارِيَةَ عَنْ خَنْسَاءَ بِنْتِ خِذَامٍأَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ كَارِهَةٌ وَكَانَتْ ثَيِّبًا فَرَدَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِكَاحَهُ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Malik] dan [Ishak bin 'Isa] berkata, telah mengabarkan kepada kami [Malik] berkata Abdullah, dan telah menceritakan kepada kami [Mush'ab] berkata, telah mengabarkan kepada kami [Malik] dari ['Abdurrahman bin Qasim] dari [Bapaknya] dari ['Abdurrahman] dan [Mujammi' bin Yazid bin Jariyah] dari [Khansa' binti Khidam], bahwa ayahnya telah menikahkan dirinya padahal ia tidak mau -dia adalah seorang janda-, maka Nabi shallallahu 'alaihi wasallam pun membatalkan pernikahan tersebut.\""
            },
            {
                "number": 3794,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَحْيَى يَعْنِي ابْنَ سَعِيدٍ قَالَ حَدَّثَنَا الْقَاسِمُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ وَمُجَمِّعٍ شَيْخَيْنِ مِنْ الْأَنْصَارِأَنَّ خَنْسَاءَ أَنْكَحَهَا أَبُوهَا وَكَرِهَتْ ذَلِكَ فَرَدَّهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Yahya] -yakni Ibnu Sa'id- berkata, telah menceritakan kepada kami [Al Qasim] dari ['Abdurrahman bin Yazid] dan [Mujammi'] dua orang Syaikh kaum Anshar, bahwa Khansa' dinikahkan oleh bapaknya akan tetapi dia membencinya, maka Rasulullah shallallahu 'alaihi wasallam membatalkan pernikahan tersebut.\""
            },
            {
                "number": 3795,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ مُجَمِّعِ بْنِ يَزِيدَ عَنْ أُمِّ مُجَمِّعٍقَالَ زَوَّجَ خِدَامٌ ابْنَتَهُ وَهِيَ كَارِهَةٌ فَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبِي زَوَّجَنِي وَأَنَا كَارِهَةٌ قَالَ فَرَدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِكَاحَ أَبِيهَا",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami dari [Al Qasim bin Muhammad] dari [Mujammi' bin Yazid] dari [Ummu Mujammi'] ia berkata, \"Khidam menikahkan anak perempuannya, sementara anaknya tidak menyukai pernikahan tersebut, maka dia menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, bapakku telah menikahkan aku padahal aku membencinya?\" Mujammi' berkata, \"Rasulullah shallallahu 'alaihi wasallam kemudian membatalkan pernikahan tersebut.\""
            },
            {
                "number": 3796,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ الْأَنْصَارِيَّ وَمُجَمِّعَ بْنَ يَزِيدَ الْأَنْصَارِيَّ أَخْبَرَاهُأَنَّ رَجُلًا مِنْهُمْ يُدْعَى خِذَامًا أَنْكَحَ ابْنَةً لَهُ فَكَرِهَتْ نِكَاحَ أَبِيهَا فَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لَهُ فَرَدَّ عَنْهَا نِكَاحَ أَبِيهَا فَتَزَوَّجَتْ أَبَا لُبَابَةَ بْنَ عَبْدِ الْمُنْذِرِفَذَكَرَ يَحْيَى أَنَّهُ بَلَغَهُ أَنَّهَا كَانَتْ ثَيِّبًا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] bahwa ['Abdurrahman bin Yazid Al Anshari] dan [Mujamma' bin Yazid Al Anshari] mengabarkan kepadanya, bahwa seorang laki-laki dari mereka yang biasa dipanggil Khidzam, telah menikahkan anak perempuannya, sementara anaknya tidak menyetujui pernikahan yang ditentukan oleh bapaknya tersebut, kemudian dia (anak perempuan) menemui Nabi shallallahu 'alaihi wasallam dan menceritakan kejadiannya kepada beliau, maka beliau mengembalikan pernikahan yang di lakukan oleh bapaknya kepada dirinya, kemudian ia menikah dengan Abu Lubabah bin Mundzir.\" Yahya menyebutkan bahwa telah sampai kepadanya, bahwa dia (anak perempuan) adalah seorang janda.\""
            },
            {
                "number": 3797,
                "arab": "قَالَ قَرَأْتُ عَلَى يَعْقُوبَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي حَجَّاجُ بْنُ السَّائِبِ بْنِ أَبِي لُبَابَةَ بْنِ عَبْدِ الْمُنْذِرِ الْأَنْصَارِيُّ أَنَّ جَدَّتَهُ أُمَّ السَّائِبِ خُنَاسَ بِنْتِ خِذَامِ بْنِ خَالِدٍكَانَتْ عِنْدَ رَجُلٍ قَبْلَ أَبِي لُبَابَةَ تَأَيَّمَتْ مِنْهُ فَزَوَّجَهَا أَبُوهَا خِذَامُ بْنُ خَالِدٍ رَجُلًا مِنْ بَنِي عَمْرِو بْنِ عَوْفِ بْنِ الْخَزْرَجِ فَأَبَتْ إِلَّا أَنْ تَحُطَّ إِلَى أَبِي لُبَابَةَ وَأَبَى أَبُوهَا إِلَّا أَنْ يُلْزِمَهَا الْعَوْفِيَّ حَتَّى ارْتَفَعَ أَمْرُهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيَ أَوْلَى بِأَمْرِهَا فَأَلْحِقْهَا بِهَوَاهَا قَالَ فَانْتُزِعَتْ مِنْ الْعَوْفِيِّ وَتَزَوَّجَتْ أَبَا لُبَابَةَ فَوَلَدَتْ لَهُ أَبَا السَّائِبِ بْنَ أَبِي لُبَابَةَ",
                "id": "Berkata aku membaca kepada [Ya'kub bin Ibrahim] berkata, telah menceritakan kepada kami [Bapakku] dari [Ibnu Ishaq] berkata, telah menceritakan kepadaku [Hajjaj bin As Saib bin Abu Lubabah bin Abdul Mundzir Al Anshari] bahwa neneknya, ibu As Saib, Khunnas binti Khidzam bin Khalid, pernah menjadi isteri seseorang sebelum menikah dengan Abu Lubabah. Ketika ia menjadi janda, bapaknya, Khidam bin Khalid, menikahkah dirinya dengan seorang laki-laki dari bani Amru bin 'Auf bin Al Khazraj, tetapi dia enggan menerimanya dan menetapkan (pilihannya) kepada Abu Lubabah, sedangkan bapaknya enggan dan mengharuskannya untuk tetap dengan Al Aufi, sehingga persoalannya sampai kepada Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Sesungguhnya dia (anak perempuan Khidam) lebih berhak dengan urusannya, maka biarkanlah dia menetapkan pilihannya sendiri.\" Perempuan itu kemudian menikah dengan Abu Lubabah dan melahirkan Abu Saib bin Abu Lubabah.\""
            },
            {
                "number": 3798,
                "arab": "قَالَ قَرَأْتُ عَلَى أَبِي : يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ إِسْحَاقَ عَنِ الْحَجَّاجِ بْنِ السَّائِبِ بْنِ أَبِي لُبَابَةَ قَالَكَانَتْ خُنَاسُ بِنْتُ خِذَامٍ عِنْدَ رَجُلٍ تَأَيَّمَتْ مِنْهُ فَزَوَّجَهَا أَبُوهَا رَجُلًا مِنْ بَنِي عَوْفٍ وَحَطَّتْ هِيَ إِلَى أَبِي لُبَابَةَ فَأَبَى أَبُوهَا إِلَّا أَنْ يُلْزِمَهَا الْعَوْفِيَّ وَأَبَتْ هِيَ حَتَّى ارْتَفَعَ شَأْنُهُمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هِيَ أَوْلَى بِأَمْرِهَا فَأَلْحِقْهَا بِهَوَاهَا فَتَزَوَّجَتْ أَبَا لُبَابَةَ فَوَلَدَتْ لَهُ أَبَا السَّائِبِ",
                "id": "Abdullah berkata; aku membacanya di hadapan bapakku; [Yazid bin Harun] berkata, telah menceritakan kepada kami [Muhammad] -yakni Ibnu Ishaq- dari [Al Hajjaj bin As Saib bin Abu Lubabah] berkata, \"Khunas binti Khidam adalah isteri dari seorang laki-laki lalu ia menjanda, bapaknya kemudian ingin menikahkannya dengan seorang laki-laki dari bani Auf, akan tetapi dia lebih memilih Abu Lubabah, sedangkan bapaknya enggan dan mengharuskannya untuk tetap dengan Al Aufi, sehingga persoalannya sampai kepada Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Sesungguhnya dia (anak perempuan Khidam) lebih berhak dengan urusannya, maka biarkanlah dia menetapkan pilihannya sendiri.\" Perempuan itu kemudian menikah dengan Abu Lubabah dan melahirkan Abu Saib bin Abu Lubabah.\""
            },
            {
                "number": 3799,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا لَيْثٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ يَزِيدَ يَعْنِي ابْنَ حَبِيبٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ طَلْحَةَ بْنِ يَزِيدَ بْنِ رُكَانَةَ أَنَّ خَالَتَهُ أُخْتَ مَسْعُودِ ابْنِ الْعَجْمَاءِ حَدَّثَتْهُأَنَّ أَبَاهَا قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ قَطِيفَةً نَفْدِيهَا بِأَرْبَعِينَ أُوقِيَّةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ تَطَّهَّرَ خَيْرٌ لَهَا فَأَمَرَ بِهَا فَقُطِعَتْ يَدُهَا وَهِيَ مِنْ بَنِي عَبْدِ الْأَشْهَلِ أَوْ مِنْ بَنِي عَبْدِ الْأَسَدِ",
                "id": "Telah menceritakan kepada kami [Yunus] berkata, telah menceritakan kepada kami [Laits] dari [Yahya bin Sa'id] dari [Yazid] -yakni Ibnu Habib- dari [Muhammad bin Ishaq] dari [Muhammad bin Thalhah bin Yazid bin Rukanah] bahwa bibinya [Saudari Mas'ud bin 'Ajm`a] mengabarkan kepadanya, bahwa ayahnya berkata kepada Rasulullah shallallahu 'alaihi wasallam tentang seorang wanita Makhzumi yang mencuri pakaian beludru, yang kemudian tebusannya kami bayar dengan uang senilai empat puluh Auqiyah (1 auqiyah=40 dirham), kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika hal itu dibersihkan maka akan lebih baik baginya, \" lalu beliau memerintah agar tangannya dipotong, dia adalah dari golongan bani 'Abdil Asyhal atau dari Bani Asad."
            },
            {
                "number": 3800,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ قَالَ حَدَّثَنَا يُوسُفُ بْنُ الْمَاجِشُونِ عَنْ أَبِيهِ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ جَدَّتِهِ رُمَيْثَةَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَلَوْ أَشَاءُ أَنْ أُقَبِّلَ الْخَاتَمَ الَّذِي بَيْنَ كَتِفَيْهِ مِنْ قُرْبِي مِنْهُ لَفَعَلْتُ يَقُولُ اهْتَزَّ لَهُ عَرْشُ الرَّحْمَنِ تَبَارَكَ وَتَعَالَى يُرِيدُ سَعْدَ بْنَ مُعَاذٍ يَوْمَ تُوُفِّيَحَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ قَالَ حَدَّثَنَا يُوسُفُ بْنُ الْمَاجِشُونِ قَالَ أَخْبَرَنِي أَبِي عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ الظَّفَرِيِّ عَنْ جَدَّتِهِ رُمَيْثَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Abu Al Abbas] berkata, telah menceritakan kepada kami [Yusuf bin Al Majisyun] dari [Bapaknya] dari ['Ashim bin 'Umar bin Qatadah] dari neneknya [Rumaitsah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika aku ingin cium stempel (tanda) yang berada pada kedua pundaknya karena kedekatannya denganku, maka aku akan melakukannya.\" Beliau melanjutkan: \"Saat kematiannya -maksudnya adalah Sa'd bin Mu'adz- Arsy Ar Rahman Tabaaraka wa Ta'ala bergetar karenanya.\" Telah menceritakan kepada kami [Sulaiman bin Dawud Al Hasyimi] berkata, telah menceritakan kepada kami [Yusuf bin Majisyun] berkata, telah mengabarkan kepadaku [ayahku] dari ['Ashim bin Umar bin Qatadah Azh Zhafari] dari neneknya [Rumaitsah] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam, lalu dia menyebutkan yang semisal dengannya.\""
            },
            {
                "number": 3801,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ فَمَاتَتْ فَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خُذُوهَا وَمَا حَوْلَهَا فَأَلْقُوهُ وَكُلُوهُ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['ubaidhullah] dari [Ibnu Abbas] dari [Maimunah] bahwa seekor tikus terjatuh pada minyak samin lalu mati di dalamnya, kemudian Rasulullah shallallahu 'alaihi wasallam ditanya akan hal itu, maka beliau bersabda: \"Ambillah ia dan apa yang ada di sekitarnya, lalu buanglah kemudian makanlah minyak tersebut.\""
            },
            {
                "number": 3802,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الشَّعْثَاءِ جَابِرٍ يَعْنِي ابْنَ زَيْدٍ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari ['Amru bin dinar] dari [Abu Asy Sya'tsa' Jabir] -yakni Ibnu Zaid- dari [Ibnu Abbas] dari [Maimunah] dia berkata, \"Aku dan Rasulullah shallallahu 'alaihi wasallam mandi bersama dari satu bejana.\""
            },
            {
                "number": 3803,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ كُرَيْبٍ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اغْتَسَلَ مِنْ الْجَنَابَةِ يَبْدَأُ فَيَغْسِلُ يَدَيْهِ ثُمَّ يُفْرِغُ بِيَمِينِهِ عَلَى شِمَالِهِ فَيَغْسِلُ فَرْجَهُ ثُمَّ يَضْرِبُ يَدَهُ عَلَى الْأَرْضِ فَيَمْسَحُهَا ثُمَّ يَغْسِلُهَا ثُمَّ يَتَوَضَّأُ وُضُوءَهُ لِلصَّلَاةِ ثُمَّ يُفْرِغُ عَلَى رَأْسِهِ وَعَلَى سَائِرِ جَسَدِهِ ثُمَّ يَتَنَحَّى فَيَغْسِلُ رِجْلَيْهِحَدَّثَنَا وَكِيعٌ عَنِ الْأَعْمَشِ قَالَ عَبْد اللَّهِ و حَدَّثَنِي أَبُو الرَّبِيعِ قَالَ حَدَّثَنَا وَكِيعٌ عَنِ الْأَعْمَشِ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ كُرَيْبٍ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Salim bin Abu Al Ja'd] dari [Kuraib] dari [Ibnu Abbas] dari [Maimunah binti Al Harist] dia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam mandi karena junub, maka beliau memulai dari mencuci tangannya kemudian mengalirkan air dari kanannya ke bagian kirinya. Kemudian beliau mencuci kemaluannya, lalu memukulkan tangannya ke atas tanah dan mengusapnya lalu mencucinya. Kemudian beliau berwudlu sebagaimana wudlu untuk sholat, lalu mengalirkan air di atas kepalanya dan seluruh badannya, kemudian beliau berpindah tempat dan mencuci kakinya.\" Telah menceritakan kepada kami [Waki'] dari [Al A'masy]. Abdullah berkata; telah menceritakan kepada kami [Abu Ar Rabi'] berkata; telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Salim bin Abu Ja'd] dari [Kuraib] dari [Ibnu Abbas] dari [Maimunah] dari Nabi shallallahu 'alaihi wasallam seperti itu.\""
            },
            {
                "number": 3804,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو دَاوُدَ الطَّيَالِسِيُّ قَالَ أَخْبَرَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ بِفَضْلِ غُسْلِهَا مِنْ الْجَنَابَةِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Abu Daud At Thayalisi] berkata, telah mengabarkan kepada kami [Syarik] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] dari [Maimunah], bahwa Nabi shallallahu 'alaihi wasallam berwudlu dengan air sisa mandi junub Maimunah.\""
            },
            {
                "number": 3805,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْأَجْنَبْتُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاغْتَسَلْتُ مِنْ جَفْنَةٍ فَفَضَلَتْ فَضْلَةٌ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَغْتَسِلَ مِنْهَا فَقُلْتُ إِنِّي قَدْ اغْتَسَلْتُ مِنْهَا فَقَالَ إِنَّ الْمَاءَ لَيْسَ عَلَيْهِ جَنَابَةٌ أَوْ لَا يُنَجِّسُهُ شَيْءٌ فَاغْتَسَلَ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] berkata, telah menceritakan kepada kami [Syarik] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] dari [Maimunah] isteri Nabi shallallahu 'alaihi wasallam, dia berkata, \"Aku dan Rasulullah shallallahu 'alaihi wasallam junub, kemudian aku mandi dari bejana dan masih ada sisa air. Kemudian Rasulullah shallallahu 'alaihi wasallam datang untuk mandi darinya, maka aku pun berkata, 'Tadi aku telah memakainya untuk mandi? ' Beliau lalu menjawab: 'Sesungguhnya air tidak (berubah) karena junub, atau tidak menjadi najis dengan sesuatu.' Kemudian beliau mandi darinya.\""
            },
            {
                "number": 3806,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ مَيْمُونَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى وَعَلَيْهِ مِرْطٌ لِبَعْضِ نِسَائِهِ وَعَلَيْهَا بَعْضُهُ قَالَ سُفْيَانُ أُرَاهُ قَالَ حَائِضٍ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Asy Syaibani] dari [Abdullah bin Syaddad] dari [Maimunah], bahwa ketika Nabi shallallahu 'alaihi wasallam sholat, sebagian kain isterinya mengenenai (menempel pada) beliau, dan sebagiannya lagi mengenai isterinya.\" Sufyan berkata, \"Menurutku ia menyebutkan, \"Haid.\""
            },
            {
                "number": 3807,
                "arab": "حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا الشَّيْبَانِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى الْخُمْرَةِ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami [Asy Syaibani] dari [Abdullah bin Syaddad] dari [Maimunah binti Al Harist] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat di atas tikar kecil.\""
            },
            {
                "number": 3808,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ عِيسَى الرَّاسِبِيُّ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ شَدَّادِ بْنِ الْهَادِ قَالَسَمِعْتُ خَالَتِي مَيْمُونَةَ بِنْتَ الْحَارِثِ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا كَانَتْ تَكُونُ حَائِضًا وَهِيَ مُفْتَرِشَةٌ بِحِذَاءِ مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي عَلَى خُمْرَتِهِ إِذَا سَجَدَ أَصَابَنِي طَرَفُ ثَوْبِهِ",
                "id": "Telah menceritakan kepada kami [Bakr bin 'Isa Ar Rasibi] telah menceritakan kepada kami [Abu 'Awanah] berkata, telah menceritakan kepada kami [Sulaiman Asy Syaibani] berkata, telah menceritakan kepada kami [Abdullah bin Syaddad bin Al Hadi] berkata, aku mendengar bibiku [Maimunah binti Al Harits] isteri Nabi shallallahu 'alaihi wasallam, bahwa saat dirinya sedang haid, dia berbaring di depan tempat sujud Rasulullah shallallahu 'alaihi wasallam yang sedang sholat, \"Ketika beliau sujud, sebagian kain beliau mengenaiku.\""
            },
            {
                "number": 3809,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا الشَّيْبَانِيُّ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ مَيْمُونَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى الْخُمْرَةِ فَيَسْجُدُ فَيُصِيبُنِي ثَوْبُهُ وَأَنَا إِلَى جَنْبِهِ وَأَنَا حَائِضٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Fudlail] telah menceritakan kepada kami [Asy Syaibani] dari [Yazid bin Al 'Asham] dari [Maimunah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat di atas tikar kecil, sewaktu sujud kain beliau mengenai aku yang sedang berada di sampingnya, padahal aku sedang haid.\""
            },
            {
                "number": 3810,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ الْأَصَمِّ قَالَ أَبِي وَقُرِئَ عَلَى سُفْيَانَ اسْمُهُ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ ابْنِ أَخِي يَزِيدَ بْنِ الْأَصَمِّ عَنْ عَمِّهِ عَنْ مَيْمُونَةَ وَهِيَ خَالَتُهُ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ وَثَمَّ بَهْمَةٌ أَرَادَتْ أَنْ تَمُرَّ بَيْنَ يَدَيْهِ تَجَافَى",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Ibnu Al 'Asham], Bapakku berkata; dan dibacakan atas Sufyan; namanya adalah 'ubaidhullah bin Abdullah, anak Akhi Yazid bin Al 'Asham, dari [pamannya] dari [Maimunah] -dan dia adalah bibinya- dia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam sujud, lalu ada seekor anak kambing yang ingin lewat maka beliau meregangkan kedua (siku) tangannya.\""
            },
            {
                "number": 3811,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي إِدْرِيسَ عَنِ ابْنِ صَفْوَانَ عَنْ صَفِيَّةَ أُمِّ الْمُؤْمِنِينَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْتَهِي النَّاسُ عَنْ غَزْوِ هَذَا الْبَيْتِ حَتَّى يَغْزُوَهُ جَيْشٌ حَتَّى إِذَا كَانُوا بِبَيْدَاءَ مِنْ الْأَرْضِ خُسِفَ بِأَوَّلِهِمْ وَآخِرِهِمْ وَلَمْ يَنْجُ أَوْسَطُهُمْ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَأَيْتَ الْمُكْرَهَ مِنْهُمْ قَالَ يَبْعَثُهُمْ اللَّهُ عَلَى مَا فِي أَنْفُسِهِمْقَالَ سُفْيَانُ قَالَ سَلَمَةُ فَحَدَّثَنِي عُبَيْدُ بْنُ أَبِي الْجَعْدِ عَنْ مُسْلِمٍ نَحْوَ هَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Abu Idris] dari [Ibnu Shafyan] dari [Shafiyah] Ummul Mukminin, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia tidak akan berhenti memerangi rumah ini (Baitullah) hingga sekumpulan tentara memeranginya, ketika mereka sampai di tanah sahara, mereka ditenggelamkan dari yang pertama dan yang terakhir, begitu juga yang di tengah-tengah mereka tidak selamat.\" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana dengan orang yang terpaksa yang berada di antara mereka?\" Beliau menjawab: \"Allah akan membangkitkan mereka sesuai dengan niat yang ada dalam hati mereka.\" [Sufyan] berkata; [Salamah] berkata; telah menceritakan kepadaku ['Ubaid bin Abu Ja'd] dari [Muslim] seperti hadits ini.\""
            },
            {
                "number": 3812,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ يَعْنِي ابْنَ كُهَيْلٍ عَنْ أَبِي إِدْرِيسَ عَنِ ابْنِ صَفْوَانَ عَنْ صَفِيَّةَ بِنْتِ حُيَيٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْتَهِي النَّاسُ عَنْ غَزْوِ هَذَا الْبَيْتِ حَتَّى إِذَا كَانُوا بِبَيْدَاءَ مِنْ الْأَرْضِ خُسِفَ أَوَّلُهُمْ وَآخِرُهُمْ وَلَمْ يَنْجُ أَوْسَطُهُمْ قَالُوا يَا رَسُولَ اللَّهِ يَكُونُ فِيهِمْ الْمُكْرَهُ قَالَ يَبْعَثُهُمْ اللَّهُ عَلَى مَا فِي أَنْفُسِهِمْحَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ عَنْ أَبِي إِدْرِيسَ الْمُرْهِبِيُّ عَنْ مُسْلِمِ بْنِ صَفْوَانَ عَنْ صَفِيَّةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْتَهِي النَّاسُ وَذَكَرَ الْحَدِيثَ وَسَاقَهُ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Salamah] -yakni Ibnu Kuhail- dari [Abu Idris] dari [Ibnu Shafwan] dari [Shafiyah binti Huyai] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Manusia tidak akan berhenti memerangi rumah ini (Ka'bah), sehingga ketika mereka sampai di padang pasir, mereka dibinasakan baik yang pertama maupun yang terakhir, dan orang-orang yang berada di tengah pun tidak akan selamat.\" Mereka (para sahabat) bertanya, \"Wahai Rasulullah, bagaimana jika di dalamnya ada yang dipaksa?\" Beliau bersabda: \"Allah akan membangkitkan sesuai dengan niat mereka.\" Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Sufyan] dari [Salamah] dari [Abu Idris Al Murhibi] dari [Muslim bin Shafwan] dari [Shafiyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia tidak akan berhenti….kemudian dia menyebutkan hadits tersebut.\""
            },
            {
                "number": 3813,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ يَعْلَى بْنَ حَكِيمٍ عَنْ صُهَيْرَةَ بِنْتِ جَيْفَرٍ قَالَتْدَخَلْتُ عَلَى صَفِيَّةَ بِنْتِ حُيَيٍّ فَسَأَلْتُ عَنْ نَبِيذِ الْجَرِّ فَقَالَتْ حَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيذَ الْجَرِّ",
                "id": "Telah menceritakan kepada kami [Wahb bin Jarir] berkata, telah menceritakan kepada kami [Bapakku] berkata, saya mendengar [Ya'la bin Hakim] dari [Shuhairah binti Jaifar] dia berkata, \"Saya menemui [Shafiyah binti Huyai], kemudian saya bertanya tentang perasan nabidz yang dibuat dalam benaja dari tembikar, dia lalu menjawab, \"Rasulullah shallallahu 'alaihi wasallam mengharamkan perasan nabidz yang dibuat dalam bajana dari tembikar.\" "
            },
            {
                "number": 3814,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ وَعَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ صَفِيَّةَ بِنْتِ حُيَيٍّ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُعْتَكِفًا فَأَتَيْتُهُ أَزُورُهُ لَيْلًا فَحَدَّثْتُهُ ثُمَّ قُمْتُ فَانْقَلَبْتُ فَقَامَ مَعِي يَقْلِبُنِي وَكَانَ مَسْكَنُهَا فِي دَارِ أُسَامَةَ بْنِ زَيْدٍ فَمَرَّ رَجُلَانِ مِنْ الْأَنْصَارِ فَلَمَّا رَأَيَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْرَعَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رِسْلِكُمَا إِنَّهَا صَفِيَّةُ بِنْتُ حُيَيٍّ فَقَالَا سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ فَقَالَ إِنَّ الشَّيْطَانَ يَجْرِي مِنْ الْإِنْسَانِ مَجْرَى الدَّمِ وَإِنِّي خَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا شَرًّا أَوْ قَالَ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dan ['Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari ['Ali bin Husain] dari [Shafiyah binti Huhai] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam beri'tikaf, lalu saya datang mengunjunginya pada malam hari, setelah berbincang-bincang saya pun berdiri untuk kembali, lantas beliau berdiri untuk mengantarku -tempat tinggal Shafiyah adalah di rumah Usamah bin Zaid-. Lalu lewatlah dua laki-laki Anshar, ketika mereka melihat Nabi shallallahu 'alaihi wasallam mereka mempercepat langkah mereka, kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Perlahanlah, sesungguhnya dia adalah Shafiyah binti Huyai.\" Maka mereka pun berkata, \"Wahai Rasulullah, Maha Suci Allah!\" Beliau lantas bersabda: \"Sesungguhnya setan mengalir dalam diri manusia pada aliran darah, dan aku khawatir jika hati kalian menuduhku berbuat tidak baik atau berkata yang tidak baik.\""
            },
            {
                "number": 3815,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنِي أَبِي قَالَ سَمِعْتُ يَعْلَى بْنَ حَكَمٍ يُحَدِّثُ عَنْ صُهَيْرَةَ بِنْتِ جَيْفَرٍ قَالَتْحَجَجْنَا ثُمَّ أَتَيْنَا الْمَدِينَةَ فَدَخَلْنَا عَلَى صَفِيَّةَ بِنْتِ حُيَيٍّ فَوَافَقْنَا عِنْدَهَا نِسْوَةً فَقَالَتْ حَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيذَ الْجَرِّ",
                "id": "Telah menceritakan kepada kami [Wahb bin Jarir] berkata, telah menceritakan kepadaku [Bapakku] berkata, saya mendengar [Ya'la bin Hakam] telah menceritakan dari [Shuhairah binti Jaifar] dia berkata, \"Kami melaksanakan haji kemudian kami datang ke Madinah dan menemui [Shafiyah binti Huyai], kebetulan di sampingnya ada beberapa wanita, kemudian dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengharamkan perasan nabidz dalam bejana dari tembikar.\""
            },
            {
                "number": 3816,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ حَدَّثَنِي يَعْلَى بْنُ حَكِيمٍ عَنْ صُهَيْرَةَ بِنْتِ جَيْفَرٍ سَمِعَهُ مِنْهَا قَالَتْحَجَجْنَا ثُمَّ انْصَرَفْنَا إِلَى الْمَدِينَةِ فَدَخَلْنَا عَلَى صَفِيَّةَ بِنْتِ حُيَيٍّ فَوَافَقْنَا عِنْدَهَا نِسْوَةً مِنْ أَهْلِ الْكُوفَةِ فَقُلْنَ لَهَا إِنْ شِئْتُنَّ سَأَلْتُنَّ وَسَمِعْنَا وَإِنْ شِئْتُنَّ سَأَلْنَا وَسَمِعْتُنَّ فَقُلْنَا سَلْنَ فَسَأَلْنَ عَنْ أَشْيَاءَ مِنْ أَمْرِ الْمَرْأَةِ وَزَوْجِهَا وَمِنْ أَمْرِ الْمَحِيضِ ثُمَّ سَأَلْنَ عَنْ نَبِيذِ الْجَرِّ فَقَالَتْ أَكْثَرْتُمْ عَلَيْنَا يَا أَهْلَ الْعِرَاقِ فِي نَبِيذِ الْجَرِّ وَمَا عَلَى إِحْدَاكُنَّ أَنْ تَطْبُخَ تَمْرَهَا ثُمَّ تَدْلُكَهُ ثُمَّ تُصَفِّيَهُ فَتَجْعَلَهُ فِي سِقَائِهَا وَتُوكِئَ عَلَيْهِ فَإِذَا طَابَ شَرِبَتْ وَسَقَتْ زَوْجَهَا",
                "id": "Telah menceritakan kepada kami ['Affan] berkata, telah menceritakan kepadaku [Jarir bin Hazim] berkata, telah menceritakan kepadaku [Ya'la bin Hakim] dari [Shuhairah binti Jaifar] bahwa dia mendengar darinya berkata; kami melaksanakan haji kemudian kami kembali ke Madinah, kemudian kami menemui [Shafiyah binti Huyai] yang kebetulan di sampingnya ada beberapa wanita dari penduduk Kufah, kami berkata kepadanya, \"Jika kalian menghendaki kalian boleh bertanya dan kami akan mendengarkan, tapi jika kalian menghendaki, kami yang akan bertanya dan kalian yang mendengarkan\". Kami katakan, \"Silahkan kalian bertanya, \" maka mereka bertanya berbagai permasalahan isteri dan suaminya, dan dari perkara haid, kemudian mereka bertanya tentang (hukum) fermentasi kurma dalam kuali. Wahai pendudik Irak, kalian telah banyak bertanya kepada kami tentang fermentasi kurma, tidaklah mengapa salah seorang dari kalian memasak kurmanya kemudian melumatkannya, menyaringnya, ia masukkan dalam wadahnya dan menutupnya? Dan apabila telah masak, ia minum dan ia suguhkan kepada suaminya?\""
            },
            {
                "number": 3817,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ ثَابِتٍ قَالَ حَدَّثَتْنِي شُمَيْسَةُ أَوْ سُمَيَّةُ قَالَ عَبْدُ الرَّزَّاقِ هُوَ فِي كِتَابِي سُمَيَّةُ عَنْ صَفِيَّةَ بِنْتِ حُيَيٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّ بِنِسَائِهِ فَلَمَّا كَانَ فِي بَعْضِ الطَّرِيقِ نَزَلَ رَجُلٌ فَسَاقَ بِهِنَّ فَأَسْرَعَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَذَاكَ سَوْقُكَ بِالْقَوَارِيرِ يَعْنِي النِّسَاءَ فَبَيْنَا هُمْ يَسِيرُونَ بَرَكَ بِصَفِيَّةَ بِنْتِ حُيَيٍّ جَمَلُهَا وَكَانَتْ مِنْ أَحْسَنِهِنَّ ظَهْرًا فَبَكَتْ وَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أُخْبِرَ بِذَلِكَ فَجَعَلَ يَمْسَحُ دُمُوعَهَا بِيَدِهِ وَجَعَلَتْ تَزْدَادُ بُكَاءً وَهُوَ يَنْهَاهَا فَلَمَّا أَكْثَرَتْ زَبَرَهَا وَانْتَهَرَهَا وَأَمَرَ النَّاسَ بِالنُّزُولِ فَنَزَلُوا وَلَمْ يَكُنْ يُرِيدُ أَنْ يَنْزِلَ قَالَتْ فَنَزَلُوا وَكَانَ يَوْمِي فَلَمَّا نَزَلُوا ضُرِبَ خِبَاءُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَخَلَ فِيهِ قَالَتْ فَلَمْ أَدْرِ عَلَامَ أُهْجَمُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَخَشِيتُ أَنْ يَكُونَ فِي نَفْسِهِ شَيْءٌ مِنِّي فَانْطَلَقْتُ إِلَى عَائِشَةَ فَقُلْتُ لَهَا تَعْلَمِينَ أَنِّي لَمْ أَكُنْ أَبِيعُ يَوْمِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ أَبَدًا وَإِنِّي قَدْ وَهَبْتُ يَوْمِي لَكِ عَلَى أَنْ تُرْضِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِّي قَالَتْ نَعَمْ قَالَ فَأَخَذَتْ عَائِشَةُ خِمَارًا لَهَا قَدْ ثَرَدَتْهُ بِزَعْفَرَانٍ فَرَشَّتْهُ بِالْمَاءِ لِيُذَكِّيَ رِيحَهُ ثُمَّ لَبِسَتْ ثِيَابَهَا ثُمَّ انْطَلَقَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَفَعَتْ طَرَفَ الْخِبَاءِ فَقَالَ لَهَا مَا لَكِ يَا عَائِشَةُ إِنَّ هَذَا لَيْسَ بِيَوْمِكِ قَالَتْ ذَلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ فَقَالَ مَعَ أَهْلِهِ فَلَمَّا كَانَ عِنْدَ الرَّوَاحِ قَالَ لِزَيْنَبَ بِنْتِ جَحْشٍ يَا زَيْنَبُ أَفْقِرِي أُخْتَكِ صَفِيَّةَ جَمَلًا وَكَانَتْ مِنْ أَكْثَرِهِنَّ ظَهْرًا فَقَالَتْ أَنَا أُفْقِرُ يَهُودِيَّتَكَ فَغَضِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ سَمِعَ ذَلِكَ مِنْهَا فَهَجَرَهَا فَلَمْ يُكَلِّمْهَا حَتَّى قَدِمَ مَكَّةَ وَأَيَّامَ مِنًى فِي سَفَرِهِ حَتَّى رَجَعَ إِلَى الْمَدِينَةِ وَالْمُحَرَّمَ وَصَفَرَ فَلَمْ يَأْتِهَا وَلَمْ يَقْسِمْ لَهَا وَيَئِسَتْ مِنْهُ فَلَمَّا كَانَ شَهْرُ رَبِيعٍ الْأَوَّلِ دَخَلَ عَلَيْهَا فَرَأَتْ ظِلَّهُ فَقَالَتْ إِنَّ هَذَا لَظِلُّ رَجُلٍ وَمَا يَدْخُلُ عَلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ هَذَا فَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَتْهُ قَالَتْ يَا رَسُولَ اللَّهِ مَا أَدْرِي مَا أَصْنَعُ حِينَ دَخَلْتَ عَلَيَّ قَالَتْ وَكَانَتْ لَهَا جَارِيَةٌ وَكَانَتْ تَخْبَؤُهَا مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ فُلَانَةُ لَكَ فَمَشَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى سَرِيرِ زَيْنَبَ وَكَانَ قَدْ رُفِعَ فَوَضَعَهُ بِيَدِهِ ثُمَّ أَصَابَ أَهْلَهُ وَرَضِيَ عَنْهُمْحَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ قَالَ حَدَّثَنَا ثَابِتٌ عَنْ سُمَيَّةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي سَفَرٍ فَاعْتَلَّ بَعِيرٌ لِصَفِيَّةَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ja'far bin Sulaiman] dari [Tsabit] berkata, telah menceritakan kepadaku Syumaisah atau [Sumayyah], [Abdurrazaq] berkata -dalam kitabku; Sumayyah- dari [Shafiyah binti Huyai] bahwa Nabi shallallahu 'alaihi wasallam melaksanakan haji bersama isteri-isterinya, tatkala sampai di salah satu jalan, ada seorang laki-laki berhenti dan mengawal isteri-isteri beliau dengan cepat, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Hati-hatilah jika mengawal seorang wanita.\" Tatkala mereka (rombongan) berjalan, tiba-tiba untanya Shafiyah menderum, dia adalah wanita yang paling bagus dalam berkendaraan (di antara isteri-isteri beliau) hingga ia pun menangis. Tatkala Rasulullah shallallahu 'alaihi wasallam mendengar perihal itu, beliau menghampirinya sambil menghapus air matanya, namun tangisan shafiyah semakin menjadi. Ketika beliau melarang dan Shafiyah masih tetap menangis, maka beliau pun mengeraskan suara dan memerintahkan orang-orang untuk singgah, maka mereka semua singgah, padahal beliau tidak ingin singgah. Shafiyah lalu berkata, \"Semuanya pun singgah. Hari itu adalah hariku, tatkala mereka singgah, tenda beliau didirikan dan beliau langsung masuk ke dalamnya.\" Shafiyah melanjutkan, \"Saya tidak tahu kenapa Rasulullah shallallahu 'alaihi wasallam masuk secara tiba-tiba, saya khawatir jangan-jangan beliau marah terhadapku. Saya langsung menemui 'Aisyah dan berkata kepadanya, 'Sesungguhnya saya belum pernah menggadaikan giliranku untuk Rasulullah shallallahu 'alaihi wasallam dengan sesuatupun, dan hari ini saya hadiahkan giliranku untukmu dengan syarat kamu jadikan Rasulullah shallallahu 'alaihi wasallam kembali ridla terhadapku.' Aisyah menjawab, 'Ya.' Shafiyah berkata, \"Lantas 'Aisyah mengambil kerudungnya yang telah diberi minyak wangi Za'faran dan dicampuri dengan minyak, agar harumnya semerbak. Kemudian dia mengenakan pakaiannya. Lalu dia menemui Rasulullah shallallahu 'alaihi wasallam sambil membuka ujung tendanya. Beliau pun bersabda kepadanya: \"Ada apa denganmu wahai 'Aisyah, hari ini bukan giliranmu?\" Aisyah menjawab, \"Itu adalah karunia yang diberikan oleh Allah kepada siapa yang dikehendaki-Nya.\" Beliau pun berbincang bersama isterinya. Tatkala beliau dalam perjalanan, beliau bersabda kepada Zainab binti Jahsyi: \"Wahai Zainab, berikanlah untamu kepada Shafiyah, karena dia adalah wanita yang paling banyak berkendaraan.\" Zainab menjawab, \"Apakah saya harus memberi kepada wanita Yahudimu?\" Tatkala Nabi shallallahu 'alaihi wasallam mendengar ucapannya, beliau pun marah dan tidak mengajaknya berbicara sampai beliau tiba di Makkah, juga pada hari-hari selama di Mina hingga kembali ke Madinah, dan selama bulan Muharam dan Shafar pun beliau tidak memberikan giliran kepadanya hingga Zainab berputus asa dari beliau. Ketika bulan Rabi'ul Awwal, beliau menemuinya, waktu dia (Zainab) melihat ada bayang-bayang seseorang dia berkata, 'Sesungguhnya ini adalah bayang-bayang seorang laki-laki, dan tidak mungkin jika Nabi shallallahu 'alaihi wasallam menemuiku, tapi bayang-bayang siapakah ini? Lantas Nabi shallallahu 'alaihi wasallam masuk untuk menemuinya, tatkala dia melihatnya dia berkata, 'Wahai Rasulullah, saya tidak mengerti apa yang seharusnya saya perbuat ketika tuan menemuiku? ' Sumayyah berkata, \"Shafiyah memiliki budak perempuan yang menyembunyikan diri dari Nabi shallallahu 'alaihi wasallam, lalu budak itu berkata, 'apakah fulanah (Zainab) adalah isterimu? ' Kemudian Nabi shallallahu 'alaihi wasallam menuju ranjangnya Zainab dan menggaulinya, dan beliau pun ridla terhadap mereka.\" Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hammad] -yaitu Ibnu Salamah- dia berkata, Telah menceritakan kepada kami [Tsabit] dari [Sumayyah] dari ['Aisyah] bahwasanya Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, tiba-tiba hewan tunggangan Shafiyah sakit, kemudian ia menyebutkan hadits semisalnya.\""
            },
            {
                "number": 3818,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنْ أُمِّهِ أَنَّهَاسَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْمَغْرِبِ بِالْمُرْسَلَاتِ عُرْفًا",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['ubaidhullah] dari [Ibnu Abbas] dari [Ibunya] bahwa dia mendengar Nabi shallallahu 'alaihi wasallam biasa membaca surat Al Mursalat pada sholat maghrib.\""
            },
            {
                "number": 3819,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍأَنَّهُ أَفْطَرَ بِعَرَفَةَ أُتِيَ بِرُمَّانٍ فَأَكَلَهُ وَقَالَ حَدَّثَتْنِي أُمُّ الْفَضْلِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ بِعَرَفَةَ أَتَتْهُ بِلَبَنٍ فَشَرِبَهُ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Ayyub] dari [Ikrimah] dari [Ibn Abbas], bahwa dia berbuka puasa di Arafah, saat disuguhkan buah delima kepadanya ia pun memakannya. Kemudian dia berkata, \" [Ummu Fadll] menceritakan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam berbuka puasa di Arafah, ia menyuguhkan susu untuk beliau, lalu beliau pun meminumnya.\""
            },
            {
                "number": 3820,
                "arab": "حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ قَالَتْصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِهِ مُتَوَشِّحًا فِي ثَوْبِ الْمَغْرِبِ فَقَرَأَ الْمُرْسَلَاتِ مَا صَلَّى صَلَاةً بَعْدَهَا حَتَّى قُبِضَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Musa bin Daud] telah menceritakan kepada kami ['Abdul 'Aziz bin Abu Salamah] dari [Humaid] dari [Anas] dari [Ummu Fadll binti Al Harits] dia berkata, \"Kami mengerjakan sholat bersama Rasulullah shallallahu 'alaihi wasallam di dalam rumahnya, beliau mengenakan pakaian sholat maghrib, kemudian beliau membaca (surat) Al Mursalaat, dan tidaklah beliau sholat setelahnya sampai beliau shallallahu 'alaihi wasallam wafat.\""
            },
            {
                "number": 3821,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ أَبِي النَّضْرِ قَالَ سَمِعْتُ عُمَيْرًا مَوْلَى أُمِّ الْفَضْلِ أُمِّ بَنِي الْعَبَّاسِ عَنْ أُمِّ الْفَضْلِ قَالَتْشَكُّوا فِي صَوْمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَرَفَةَ فَقَالَتْ أُمُّ الْفَضْلِ أَنَا أَعْلَمُ لَكُمْ ذَلِكَ فَبَعَثَتْ بِلَبَنٍ فَشَرِبَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Abu An Nadlr] berkata, saya mendengar [Umair] bekas budak Ummu Fadll Ummu bani Abbas, dari [Ummu Fadll] dia berkata, \"Mereka mengadukan tentang puasa Nabi shallallahu 'alaihi wasallam di hari Arafah, maka Ummu Fadll pun berkata, 'Saya lebih mengetahui dari kalian tentang masalah tersebut', kemudian ia mengirimkan susu kepada beliau dan beliau pun meminumnya.\""
            },
            {
                "number": 3822,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ قَالَ أَخْبَرَنَا لَيْثٌ وَيُونُسُ قَالَ حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ عَنْ يَزِيدَ بْنِ الْهَادِ عَنْ هِنْدَ بِنْتِ الْحَارِثِ عَنْ أُمِّ الْفَضْلِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى الْعَبَّاسِ وَهُوَ يَشْتَكِي فَتَمَنَّى الْمَوْتَ فَقَالَ يَا عَبَّاسُ يَا عَمَّ رَسُولِ اللَّهِ لَا تَتَمَنَّ الْمَوْتَ إِنْ كُنْتَ مُحْسِنًا تَزْدَادُ إِحْسَانًا إِلَى إِحْسَانِكَ خَيْرٌ لَكَ وَإِنْ كُنْتَ مُسِيئًا فَإِنْ تُؤَخَّرْ تَسْتَعْتِبْ خَيْرٌ لَكَ فَلَا تَتَمَنَّ الْمَوْتَ قَالَ يُونُسُ وَإِنْ كُنْتَ مُسِيئًا فَإِنْ تُؤَخَّرْ تَسْتَعْتِبْ مِنْ إِسَاءَتِكَ خَيْرٌ لَكَ",
                "id": "Telah menceritakan kepada kami [Abu Salamah Al Khuza'i] berkata, telah mengabarkan kepada kami [Laits] dan [Yunus] berkata, telah menceritakan kepada kami [Laits] -yakni Ibnu Sa'd- dari [Yazid bin Al Hadi] dari [Hindun binti Al Harits] dari [Ummi Fadll], bahwa Nabi shallallahu 'alaihi wasallam menjenguk Al Abbas yang sedang sakit dan berharap untuk mati, beliau lantas bersabda: \"Wahai Abbas, wahai paman Rasulullah, janganlah kamu mengharapkan kematian, jika kamu berbuat baik lalu engkau menambah kebaikan pada amal baikmu adalah lebih baik bagimu, dan jika kamu berbuat buruk, lalu umurmu diperpanjang dan kamu ridla maka itu lebih baik, maka janganlah kamu mengharap kematian.\" Yunus menyebutkan, \"jika kamu berbuat buruk, lalu umurmu diperpanjang dan kamu ridla dari keburukanmu maka itu lebih baik bagimu.\""
            },
            {
                "number": 3823,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ عَنْ قَابُوسَ بْنِ أَبِي الْمُخَارِقِ عَنْ أُمِّ الْفَضْلِ قَالَتْرَأَيْتُ كَأَنَّ فِي بَيْتِي عُضْوًا مِنْ أَعْضَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ فَجَزِعْتُ مِنْ ذَلِكَ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ خَيْرًا تَلِدُ فَاطِمَةُ غُلَامًا فَتَكْفُلِينَهُ بِلَبَنِ ابْنِكِ قُثَمٍ قَالَتْ فَوَلَدَتْ حَسَنًا فَأُعْطِيتُهُ فَأَرْضَعْتُهُ حَتَّى تَحَرَّكَ أَوْ فَطَمْتُهُ ثُمَّ جِئْتُ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَجْلَسْتُهُ فِي حِجْرِهِ فَبَالَ فَضَرَبْتُ بَيْنَ كَتِفَيْهِ فَقَالَ ارْفُقِي بِابْنِي رَحِمَكِ اللَّهُ أَوْ أَصْلَحَكِ اللَّهُ أَوْجَعْتِ ابْنِي قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ اخْلَعْ إِزَارَكَ وَالْبَسْ ثَوْبًا غَيْرَهُ حَتَّى أَغْسِلَهُ قَالَ إِنَّمَا يُغْسَلُ بَوْلُ الْجَارِيَةِ وَيُنْضَحُ بَوْلُ الْغُلَامِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Abu Bukair] berkata, telah menceritakan kepada kami [Israil] dari [Simak] dari [Qabus bin Abu Al Mukhariq] dari [Ummi Fadll] dia berkata, \"Aku melihat seakan-akan di rumahku ada bagian dari bagian tubuh Rasulullah shallallahu 'alaihi wasallam. Sehingga aku pun menjadi cemas, aku lalu mendatangi Rasulullah shallallahu 'alaihi wasallam dan menyebutkan akan hal itu, beliau lalu bersabda: \"Kabar baik, Fatimah akan melahirkan seorang anak, lalu kamu yang menanggungnya dengan susu anakmu, Qutsam.\" Ummu Fadll berkata, \"kemudian Fatimah melahirkan Hasan, kemudian aku memberinya, aku susui hingga ia bergerak -menyampihnya-, setelah itu bayi tersebut aku bawa ke hadapan Rasulullah shallallahu 'alaihi wasallam dan aku dudukkan di pangkuannya. Namun anak itu kencing hingga aku pun memukul antara kedua pundaknya, maka beliau pun bersabda: \"Bersikap lembutlah kepada anakku semoga Allah merahmatimu -atau, semoga Allah memberikan kebaikan kepadamu-, kamu telah membuat cemas cucuku.\" Aku lalu berkata, 'Wahai Rasulullah, lepaslah sarungmu dan pakailah kain yang lain hingga aku mencucinya, ' beliau bersabda: \"Hanyasanya yang dicuci itu adalah dari kencing yang sudah dewasa, adapun anak kecil cukup dipercikkan saja.\""
            },
            {
                "number": 3824,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ وَسَمِعْتُهُ أَنَا مِنْ أَبِي مَعْمَرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ قَالَ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ وَهِيَ أُمُّ وَلَدِ الْعَبَّاسِ أُخْتُ مَيْمُونَةَ قَالَتْأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ فَجَعَلْتُ أَبْكِي فَرَفَعَ رَأْسَهُ فَقَالَ مَا يُبْكِيكِ قُلْتُ خِفْنَا عَلَيْكَ وَمَا نَدْرِي مَا نَلْقَى مِنْ النَّاسِ بَعْدَكَ يَا رَسُولَ اللَّهِ قَالَ أَنْتُمْ الْمُسْتَضْعَفُونَ بَعْدِي",
                "id": "Telah menceritakan kepada kami [Abu Ma'mar], dan saya mendengarnya dari [Abu Ma'mar] berkata, telah menceritakan kepada kami [Abdullah bin Idris] berkata, telah menceritakan kepada kami [Yazid] -yakni Ibnu Abu Ziyad- dari [Abdullah bin Al Harits] dari [Ummu Fadll binti Harits] dia adalah Ummu Walad Al Abbas, saudara perempuan Maimunah, ia berkata, \"Saya mendatangi Nabi shallallahu 'alaihi wasallam yang sedang sakit, saat aku menangis, beliau mengangkat kepalanya seraya bersabda: \"Apa yang membuatmu menangis?\" Saya menjawab, \"Kami mencemaskanmu, dan kami tidak tahu bagaimana keadaan manusia yang kami temui setelahmu wahai Rasulullah.\" Beliau bersabda: \"Kalian akan melemah setelah kepergianku.\""
            },
            {
                "number": 3825,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ صَالِحٍ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ الْفَضْلِ قَالَتْأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي رَأَيْتُ فِي مَنَامِي أَنَّ فِي بَيْتِي أَوْ حُجْرَتِي عُضْوًا مِنْ أَعْضَائِكَ قَالَ تَلِدُ فَاطِمَةُ إِنْ شَاءَ اللَّهُ غُلَامًا فَتَكْفُلِينَهُ فَوَلَدَتْ فَاطِمَةُ حَسَنًا فَدَفَعَتْهُ إِلَيْهَا فَأَرْضَعَتْهُ بِلَبَنِ قُثَمَ وَأَتَيْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا أَزُورُهُ فَأَخَذَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَهُ عَلَى صَدْرِهِ فَبَالَ عَلَى صَدْرِهِ فَأَصَابَ الْبَوْلُ إِزَارَهُ فَزَخَخْتُ بِيَدِي عَلَى كَتِفَيْهِ فَقَالَ أَوْجَعْتِ ابْنِي أَصْلَحَكِ اللَّهُ أَوْ قَالَ رَحِمَكِ اللَّهُ فَقُلْتُ أَعْطِنِي إِزَارَكَ أَغْسِلْهُ فَقَالَ إِنَّمَا يُغْسَلُ بَوْلُ الْجَارِيَةِ وَيُصَبُّ عَلَى بَوْلِ الْغُلَامِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepada kami [Ayyub] dari [Shalih Abu Al Khalil] dari [Abdullah bin Al Harits] dari [Ummu Fadll] dia berkata, \"Saya menemui Nabi shallallahu 'alaihi wasallam seraya berkata, \"Sesungguhnya saya bermimpi bahwa di rumahku atau di kamarku ada bagian dari bagian tubuhmu?\" Beliau bersabda: \"Insyaallah Fatimah akan melahirkan seorang bayi (anak), kemudian kamu yang akan mengasuhnya.\" Lalu Fatimah melahirkan Hasan, lantas Fatimah pun menyerahkan bayi tersebut kepadanya, kemudian ia menyusuinya dengan susu Qutsam. Setelah itu aku bawa anak tersebut kepada Nabi shallallahu 'alaihi wasallam di hari berkunjungku, maka Nabi shallallahu 'alaihi wasallam mengambilnya dan meletakkannya di atas dada, anak itu lalu kencing di atas dada beliau sehingga kencingnya mengenai kain sarung beliau, maka saya memukul di antara pundaknya. Beliau pun bersabda: \"Kamu telah menyakiti cucuku, semoga Allah memperbaiki dirimu.\" Atau, beliau berkata: \"Semoga Allah merahmatimu.\" Saya pun berkata, \"Lepaslah sarungmu hingga saya dapat mencucinya.\" Namun beliau bersabda: \"Hanyasanya yang dicuci itu adalah dari kencing anak perempuan, adapun anak laki-laki cukup dipercikkan saja.\""
            },
            {
                "number": 3826,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ الْفَضْلِأَنَّ الرَّسُولَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُحَرِّمُ الْإِمْلَاجَةُ أَوْ الْإِمْلَاجَتَانِ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Hammad] dari [Qatadah] dari [Abu Al Khalil] dari [Abdullah bin Al Harits] dari [Ummu Fadll] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu atau dua hisapan tidak menjadikan haram.\""
            },
            {
                "number": 3827,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مَالِكٍ حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ عَنْ عُمَيْرٍ مَوْلَى أُمِّ الْفَضْلِ أَنَّ أُمَّ الْفَضْلِ أَخْبَرَتْهُأَنَّهُمْ شَكُّوا فِي صَوْمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَرَفَةَ فَأَرْسَلَتْ إِلَيْهِ بِلَبَنٍ فَشَرِبَ وَهُوَ يَخْطُبُ النَّاسَ بِعَرَفَةَ عَلَى بَعِيرِهِحَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ قَابُوسَ بْنِ مُخَارِقٍ عَنْ أُمِّ الْفَضْلِ قَالَتْ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ مِثْلَ حَدِيثِ عَفَّانَ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ صَالِحٍ أَبِي الْخَلِيلِ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Malik] telah menceritakan kepadaku [Salim Abu Nadlr] dari ['Umair] bekas budak Ummu Fadll, bahwa [Ummu Fadll] mengabarkan kepadanya, bahwa orang-orang mengadukan tentang puasa Nabi shallallahu 'alaihi wasallam pada hari 'Arafah, kemudian Ummu Fadll mengirim susu untuk beliau, lalu beliau meminumnya padahal beliau sedang berkhutbah di hadapan manusia di atas untanya di hari Arafah.\" Telah menceritakan kepada kami [Hajjaj] berkata, telah menceritakan kepada kami [Syarik] dari [Simak bin Harb] dari [Qabus bin Mukhariq] dari [Ummu Fadll] dia berkata, \"Saya menemui Nabi shallallahu 'alaihi wasallam…kemudian dia menyebutkan seperti hadits 'Affan.\" Abdullah berkata; telah menceritakan kepada kami Wuhaib berkata, telah menceritakan kepada kami Ayyub dari Shalih Abu Al Khalil lalu ia menyebutkan seperti itu.\""
            },
            {
                "number": 3828,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنِ ابْنِ طَاوُسٍ عَنِ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ عَنْ أُمِّ هَانِئٍ قَالَتْنَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ بِأَعْلَى مَكَّةَ فَأَتَيْتُهُ فَجَاءَ أَبُو ذَرٍّ بِجَفْنَةٍ فِيهَا مَاءٌ قَالَتْ إِنِّي لَأَرَى فِيهَا أَثَرَ الْعَجِينِ قَالَتْ فَسَتَرَهُ يَعْنِي أَبَا ذَرٍّ فَاغْتَسَلَ ثُمَّ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِ رَكَعَاتٍ وَذَلِكَ فِي الضُّحَى",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [Al Mutthalib bin Abdullah bin Hanthab] dari [Ummi Hani] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam turun dari atas dataran tinggi Makkah saat hari penaklukan Makkah, maka aku pun datang menemui beliau. Lalu datanglah Abu Dzar dengan membawa bejana besar yang di dalamnya terdapat air.\" Ummi Hani berkata, \"Sesungguhnya saya melihat di dalamnya ada bekas adonan. Kemudian dia menutupi beliau, yakni Abu Dzar, sehingga beliau pun mandi. Nabi shallallahu 'alaihi wasallam kemudian sholat delapan rakaat, dan ketika itu adalah waktu dluha.\""
            },
            {
                "number": 3829,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ قَالَ حَدَّثَنِي ابْنُ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ هَانِئٍوَكَانَ نَازِلًا عَلَيْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ سُتِرَ عَلَيْهِ فَاغْتَسَلَ فِي الضُّحَى فَصَلَّى ثَمَانِ رَكَعَاتٍ لَا يُدْرَى أَقِيَامُهَا أَطْوَلُ أَمْ سُجُودُهَا",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] berkata, telah menceritakan kepadaku [Ibnu Syihab] dari [Abdullah bin Al Harits] dari [Ummu Hani'] -saat itu beliau menemuinya-, bahwa Nabi shallallahu 'alaihi wasallam pada hari penaklukan kota Makkah ditutupi, lalu beliau mandi di waktu dluha. Setelah itu beliau mengerjakan delapan rakaat, dan tidak diketahui apakah yang lebih panjang berdirinya atau sujudnya.\""
            },
            {
                "number": 3830,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ أُمِّ هَانِئٍ قَالَتْقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ مَرَّةً وَلَهُ أَرْبَعُ غَدَائِرَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] dari [Ummu Hani'] dia berkata, \"Pernah Nabi shallallahu 'alaihi wasallam memasuki Makkah sedangkan beliau mempunyai empat ikatan pada rambutnya.\""
            },
            {
                "number": 3831,
                "arab": "حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ قَالَ أَخْبَرَنِي حَاتِمُ بْنُ أَبِي صَغِيرَةَ وَرَوْحٌ قَالَ حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ قَالَ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ عَنْ أَبِي صَالِحٍ مَوْلَى أُمِّ هَانِئٍ قَالَ رَوْحٌ فِي حَدِيثِهِ حَدَّثَتْنِي أُمُّ هَانِئٍ فَقَالَتْ لِيسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ تَعَالَى{ وَتَأْتُونَ فِي نَادِيكُمْ الْمُنْكَرَ }قَالَ كَانُوا يَخْذِفُونَ أَهْلَ الطَّرِيقِ وَيَسْخَرُونَ مِنْهُمْ فَذَاكَ الْمُنْكَرُ الَّذِي كَانُوا يَأْتُونَ قَالَ رَوْحٌ فَذَلِكَ قَوْلُهُ تَعَالَى{ وَتَأْتُونَ فِي نَادِيكُمْ الْمُنْكَرَ }",
                "id": "Telah menceritakan kepada kami [Hammad bin Usamah] berkata, telah mengabarkan kepadaku [Hatim bin Abu Shaghirah], dan [Rauh] berkata, telah menceritakan kepada kami [Hatim bin Abu Shaghirah] berkata, telah menceritakan kepada kami [Simak bin Harb] dari [Abu Shalih] bekas budak Ummu Hani', [Rauh] menyebutkan dalam haditsnya; telah menceritakan kepadaku [Ummi Hani'] ia berkata kepadaku, \"Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai firman Allah Ta'ala: '(Apakah Sesungguhnya kamu patut mendatangi laki-laki, menyamun dan mengerjakan kemungkaran di tempat-tempat pertemuanmu?) ' (Al-'Ankabuut: 29), beliau bersabda: \"Mereka melempari orang yang berada di jalan dan mencela mereka, itulah kemungkaran yang mereka lakukan.\" [Rauh] berkata, \"Itulah tafsir dari firman Allah Ta'ala: '(Apakah Sesungguhnya kamu patut mendatangi laki-laki, menyamun dan mengerjakan kemungkaran di tempat-tempat pertemuanmu?) '"
            },
            {
                "number": 3832,
                "arab": "حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ جَعْدَةَ عَنْ أُمِّ هَانِئٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَدَعَا بِشَرَابٍ فَشَرِبَ ثُمَّ نَاوَلَهَا فَشَرِبَتْ فَقَالَتْ يَا رَسُولَ اللَّهِ أَمَا إِنِّي كُنْتُ صَائِمَةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّائِمُ الْمُتَطَوِّعُ أَمِيرُ نَفْسِهِ إِنْ شَاءَ صَامَ وَإِنْ شَاءَ أَفْطَرَقَالَ قُلْتُ لَهُ سَمِعْتَهُ أَنْتَ مِنْ أُمِّ هَانِئٍ قَالَ لَا حَدَّثَنِيهِ أَبُو صَالِحٍ وَأَهْلُنَا عَنْ أُمِّ هَانِئٍ حَدَّثَنَا سُلَيْمَانُ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ كُنْتُ أَسْمَعُ سِمَاكًا يَقُولُ حَدَّثَنَا ابْنَ أُمِّ هَانِئٍ فَأَتَيْتُ أَنَا خَيْرَهُمَا وَأَفْضَلَهُمَا فَسَأَلْتُهُ وَكَانَ يُقَالُ لَهُ جَعْدَةُ",
                "id": "Telah menceritakan kepada kami [Abu Daud At Thayalisi] berkata, telah menceritakan kepada kami [Syu'bah] dari [Ja'dah] dari [Ummu Hani'], bahwa Rasulullah shallallahu 'alaihi wasallam menemuinya lalu beliau minta air minum, lalu beliau meminumnya kemudian memberikan sisanya kepadanya hingga ia pun meminumnya. Ummu Hani` lalu berkata, \"Wahai Rasulullah, sebenarnya aku sedang berpuasa.\" Rasulullah kemudian shallallahu 'alaihi wasallam bersabda: \"Seorang yang berpuasa sunnah adalah pemimpin bagi dirinya, jika ia mau maka ia berpuasa jika ia mau maka ia boleh berbuka.\" Abdullah berkata, \"Aku bertanya kepadanya, \"Apakah kamu mendengarnya dari Ummu Hani'? dia menjawab, \"Tidak. [Abu Shalih] mengabarkannya kepadaku -dan keluarganya- dari [Ummu Hani`].\" Telah menceritakan kepada kami Sulaiman berkata, telah menceritakan kepada kami Syu'bah berkata; aku mendengar Simak berkata; telah menceritakan kepada kami Ummu Hani' berkata, \"Lalu aku menemui orang yang lebih baik dari keduanya, lalu bertanya kepadanya. Orang tersebut dipanggil dengan nama Ja'dah.\""
            },
            {
                "number": 3833,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ أَبُو زَيْدٍ حَدَّثَنَا هِلَالٌ يَعْنِي ابْنَ خَبَّابٍ قَالَ نَزَلْتُ أَنَا وَمُجَاهِدٌ عَلَى يَحْيَى بْنِ جَعْدَةَ بْنِ أُمِّ هَانِئٍ فَحَدَّثَنَا عَنْ أُمِّ هَانِئٍ قَالَتْأَنَا أَسْمَعُ قِرَاءَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَوْفِ اللَّيْلِ وَأَنَا عَلَى عَرِيشِي هَذَا وَهُوَ عِنْدَ الْكَعْبَةِ",
                "id": "Telah menceritakan kepada kami [Abdus Shamad] berkata, telah menceritakan kepada kami [Tsabit bin Yazid Abu Zaid] telah menceritakan kepada kami [Hilal] -yakni Ibnu Khabab- dia berkata, saya dan Mujahid datang menemui [Yahya bin Ja'dah bin Ummi Hani'] maka dia menceritakan kepada kami dari [Ummu Hani'] bahwa dia berkata, \"Saya mendengar bacaan shallallahu 'alaihi wasallam pada tengah malam, sedang saya berada di atas atap rumah ini dan beliau berada di sisi Ka'bah.\""
            },
            {
                "number": 3834,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ عَمْرٍو عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِي مُرَّةَ مَوْلَى أُمِّ هَانِئٍ قَالَ مُحَمَّدٌ وَقَدْ رَأَيْتُ أَبَا مُرَّةَ وَكَانَ شَيْخًا قَدْ أَدْرَكَ أُمَّ هَانِئٍ عَنْ أُمِّ هَانِئٍ قَالَتْأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ أَجَرْتُ حَمْوَيْنِ لِي فَزَعَمَ ابْنُ أُمِّي أَنَّهُ قَاتَلَهُ تَعْنِي عَلِيًّا قَالَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ وَصُبَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاءٌ فَاغْتَسَلَ ثُمَّ الْتَحَفَ بِثَوْبٍ عَلَيْهِ وَخَالَفَ بَيْنَ طَرَفَيْهِ عَلَى عَاتِقِهِ فَصَلَّى الضُّحَى ثَمَانِي رَكَعَاتٍ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Muhammad] -yakni bin Amru- dari [Ibrahim bin Abdullah bin Hunain] dari [Abu Murrah] bekas budak Ummu Hani', Muhammad berkata, \"Sungguh saya pernah melihat Abu Murrah, seorang Syaikh yang pernah bertemu dengan Ummu Hani', dari [Ummu Hani`] ia berkata, \"Saya menemui Rasulullah shallallahu 'alaihi wasallam pada saat penaklukan Makkah, lalu saya tanyakan, \"Wahai Rasulullah, sungguh saya telah menjamin kedua iparku, sedangkan anak ibuku menyangka bahwa dia telah membunuh Ali?\" Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Sungguh, saya telah menjamin orang yang kamu jamin wahai Ummu Hani'.\" Kemudian dia Ummu Hani` menuangkan air untuk Rasulullah shallallahu 'alaihi wasallam, setelah mandi beliau berselimut dengan kain yang ada padanya, dengan menyelempangkan ujungnya ke pundak, lalu beliau mengerjakan sholat delapan rakaat.\""
            },
            {
                "number": 3835,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ عَنْ رَجُلٍ عَنْ أُمِّ هَانِئٍ قَالَتْلَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ جَاءَتْ فَاطِمَةُ حَتَّى قَعَدَتْ عَنْ يَسَارِهِ وَجَاءَتْ أُمُّ هَانِئٍ وَقَعَدَتْ عَنْ يَمِينِهِ وَجَاءَتْ الْوَلِيدَةُ بِشَرَابٍ فَتَنَاوَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَرِبَ ثُمَّ نَاوَلَهُ أُمَّ هَانِئٍ عَنْ يَمِينِهِ فَقَالَتْ لَقَدْ كُنْتُ صَائِمَةً فَقَالَ لَهَا أَشَيْءٌ تَقْضِينَهُ عَلَيْكِ قَالَتْ لَا قَالَ لَا يَضُرُّكِ إِذًا",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir] berkata, telah menceritakan kepada kami [Israil] dari [Simak] dari [seorang laki-laki] dari [Ummu Hani'] dia berkata, \"Tatkala penaklukan Kota Makkah, Fatimah datang dan duduk di samping kiri Rasulullah shallallahu 'alaihi wasallam, kemudian Ummu Hani` datang dan duduk sisi kanan beliau. Setelah itu datanglah seorang budak perempuan membawa minuman, maka Nabi shallallahu 'alaihi wasallam mengambilnya dan meminumnya, kemudian beliau memberikan sisanya kepada Ummu Hani' yang ada di sebelah kanannya, namun ia berkata, \"Sesungguhnya saya sedang berpuasa.\" Beliau lantas bersabda kepadanya: \"Apakah puasa itu sesuatu yang kamu gunakan untuk qadla?\" ia menjawab, \"Tidak.\" Beliau lalu bersabda: \"Kalau begitu, tidak mengapa kamu minum.\""
            },
            {
                "number": 3836,
                "arab": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ أَبِي خَالِدٍ عَنْ أَبِي صَالِحٍ عَنْ أُمِّ هَانِئٍ قَالَتْلَمَّا دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ حَجَبُوهُ وَأُتِيَ بِمَاءٍ فَاغْتَسَلَ ثُمَّ صَلَّى الضُّحَى ثَمَانِيَ رَكَعَاتٍ مَا رَآهُ أَحَدٌ بَعْدَهَا صَلَّاهَا",
                "id": "Telah menceritakan kepada kami [Ya'la bin 'Ubaid] berkata, telah menceritakan kepada kami [Isma'il] -yakni Ibnu Abu Khalid- dari [Abu Shalih] dari [Ummu Hani'] dia berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam masuk (rumah) di hari pembukaan Kota Makkah, beliau ditutupi dan diberi air kemudian mandi, setelah itu beliau sholat dluha delapan rakaat, tidak seorang pun yang melihatnya sholat setelahnya.\""
            },
            {
                "number": 3837,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنِ ابْنِ أَبِي لَيْلَى قَالَ مَا أَخْبَرَنِي أَحَدٌ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى غَيْرَ أُمِّ هَانِئٍ فَإِنَّهَا حَدَّثَتْأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ بَيْتَهَا يَوْمَ فَتْحِ مَكَّةَ فَاغْتَسَلَ وَصَلَّى ثَمَانِيَ رَكَعَاتٍ مَا رَأَتْهُ صَلَّى صَلَاةً قَطُّ أَخَفَّ مِنْهَا غَيْرَ أَنَّهُ كَانَ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Amru bin Murrah] dari [Ibnu Abu Laila] dia berkata, \"Tidak ada seorang pun yang mengabarkan kepadaku bahwa ia pernah melihat Nabi shallallahu 'alaihi wasallam sholat dluha selain [Ummu Hani'], ia menceritakan kepadaku bahwa Nabi shallallahu 'alaihi wasallam masuk rumahnya pada hari Fathu Makkah, kemudian beliau mandi dan sholat delapan rakaat. Ia (Ummu Hani`) tidak pernah melihat beliau mengerjakan sholat yang lebih ringan dari itu, hanya saja beliau menyempurnakan rukuk dan sujud.\""
            },
            {
                "number": 3838,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا شُعْبَةُ عَنْ مُسْلِمٍ الْقُرِّيِّ قَالَسَأَلْتُ ابْنَ عَبَّاسٍ عَنْ مُتْعَةِ الْحَجِّ فَرَخَّصَ فِيهَا وَكَانَ ابْنُ الزُّبَيْرِ يَنْهَى عَنْهَا فَقَالَ هَذِهِ أُمُّ ابْنِ الزُّبَيْرِ تُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِيهَا فَادْخُلُوا عَلَيْهَا فَاسْأَلُوهَا قَالَ فَدَخَلْنَا عَلَيْهَا فَإِذَا امْرَأَةٌ ضَخْمَةٌ عَمْيَاءُ فَقَالَتْ قَدْ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Syu'bah] dari [Muslim Al Qurri] berkata, \"Aku bertanya kepada [Ibnu Abbas] tentang nikah mut'ah pada waktu haji yang kemudian dia memberi keringanan di dalamnya, sedangkan Ibnu Zubair melarangnya. Ibnu Abbas menjawab, \" [Ibunya Ibnu Zubair] menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam telah memberi keringanan di dalamnya, maka temuilah dia dan tanyakan padanya.\" Maka mereka pun bertanya kepadanya.\" Ibnu Abbas berkata, \"Kami lalu masuk menenuinya, ternyata ia adalah seorang wanita besar badannya dan buta, lalu dia berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah memberi keringanan di dalamnya.\""
            },
            {
                "number": 3839,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا رَبَاحٌ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ بَعْضِهِمْ عَنْ مَوْلَى لِأَسْمَاءَ عَنْ أَسْمَاءَ أَنَّهَا قَالَتْكَانَ الْمُسْلِمُونَ ذَوِي حَاجَةٍ يَأْتَزِرُونَ بِهَذِهِ النَّمِرَةِ فَكَانَتْ إِنَّمَا تَبْلُغُ أَنْصَافَ سُوقِهِمْ أَوْ نَحْوَ ذَلِكَ فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ يَعْنِي النِّسَاءَ فَلَا تَرْفَعْ رَأْسَهَا حَتَّى نَرْفَعَ رُءُوسَنَا كَرَاهِيَةَ أَنْ تَنْظُرَ إِلَى عَوْرَاتِ الرِّجَالِ مِنْ صِغَرِ أُزُرِهِمْحَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ عَبْدِ اللَّهِ بْنِ مُسْلِمِ بْنِ شِهَابٍ أَخِي الزُّهْرِيِّ عَنْ مَوْلًى لِأَسْمَاءَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ مِنْكُنَّ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Khalid] berkata, telah menceritakan kepada kami [Rabah] dari [Ma'mar] dari [Az Zuhri] dari [sebagian mereka], dari [bekas budaknya Asma'] dari [Asma'] bahwa dia berkata, \"Kaum Muslimin mempunyai hajat, mereka memakai kain sarung dengan kain wool ini, dan hanyasanya (kain sarung mereka) hanya sebatas betis mereka atau semisalnya, kemudian aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda (kepada kaum wanita): 'Barangsiapa beriman dengan Allah dan hari akhir -yakni para wanita-, maka janganlah mengangkat kepadalanya sehingga kami mengangkat kepala kami.' Beliau ucapkan ituy karena kawatir mereka (kaum wanita) melihat auratnya laki-laki, disebabkan sarung mereka yang kecil.\" Telah menceritakan kepada kami [Abu Al A'la] dari [Ma'mar] dari [Abdullah bin Muslim bin Syihab] saudara laki-lakinya Az Zuhri, dari [bekas budaknya Asma'] dari [Asma' binti Abu Bakar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa dari kalian (para wanita) beriman kepada Allah dan hari akhir….kemudian dia menyebutkan hadits tersebut.\""
            },
            {
                "number": 3840,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنِي النُّعْمَانُ بْنُ رَاشِدٍ عَنِ ابْنِ أَخِي الزُّهْرِيِّ عَنْ مَوْلًى لِأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ عَنْ أَسْمَاءَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مَعْشَرَ النِّسَاءِ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا تَرْفَعْ رَأْسَهَا حَتَّى يَرْفَعَ الرِّجَالُ رُءُوسَهُمْ قَالَتْ وَذَلِكَ أَنَّ أُزُرَهُمْ كَانَتْ قَصِيرَةً مَخَافَةَ أَنْ تَنْكَشِفَ عَوْرَاتُهُمْ إِذَا سَجَدُوا",
                "id": "Telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepadaku [An Nu'man bin Rasyid] dari [Akhi Az Zuhri] dari [bekas budaknya Asma' binti Abu Bakar] dari [Asma'] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai kaum wanita, barangsiapa beriman kepada Allah dan hari akhir, maka janganlah mengangkat kepalanya sehingga kaum laki-laki mengangkat kepala mereka.\" Asma' berkata, \"Yang demikian itu karena sarung mereka sangat pendek sehingga dikawatirkan aurat mereka akan tersingkap sewaktu sujud.\""
            },
            {
                "number": 3841,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مَعْشَرَ النِّسَاءِ مَنْ كَانَ مِنْكُنَّ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا تَرْفَعْ رَأْسَهَا حَتَّى يَرْفَعَ الْإِمَامُ رَأْسَهُ مِنْ ضِيقِ ثِيَابِ الرِّجَالِ",
                "id": "Telah menceritakan kepada kami [Suraij bin Nu'man] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Urwah] dari [Asma' binti Abu Bakar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai kaum wanita, barangsiapa di antara kalian beriman kepada Allah dan hari akhir, maka janganlah mengangkat kepalanya sehingga imam mengangkat kepalanya.\" (Hal itu) dikarenakan sangat sempitnya (pendeknya) pakaian para lelaki.\""
            },
            {
                "number": 3842,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ جَدَّتِهِ فَمَا أَدْرِي أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ أَوْ سُعْدَى بِنْتَ عَوْفٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ فَقَالَ مَا يَمْنَعُكَ مِنْ الْحَجِّ يَا عَمَّةُ قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ سَقِيمَةٌ وَإِنِّي أَخَافُ الْحَبْسَ قَالَ فَأَحْرِمِي وَاشْتَرِطِي أَنَّ مَحِلَّكِ حَيْثُ حُبِسْتِ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] berkata, telah menceritakan kepada kami [Utsman bin Hakim] dari [Abu Bakar bin Abdullah bin Zubair] dari neneknya, aku tidak tahu apakah [Asma binti Abu Bakar] atau [Su'da binti 'Auf] bahwa Rasulullah shallallahu 'alaihi wasallam menemui Dluba'ah binti Zubair bin Abdul Muthalib, beliau bersabda: \"Apa yang menghalangimu menunaikan haji wahai bibi?\" dia menjawab, \"Wahai Rasulullah, sesungguhnya aku adalah perempuan yang menderita sakit dan aku khawatir jika aku terhalang karenanya.\" Beliau bersabda: \"Berihramlah dan bersyaratlah bahwa batas tahalulmu adalah hingga kamu mampu.\""
            },
            {
                "number": 3843,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ حُدِّثْتُ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّهَا قَالَتْفَزِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ كَسَفَتْ الشَّمْسُ فَأَخَذَ دِرْعًا حَتَّى أَدْرَكَ بِرِدَائِهِ فَقَامَ بِالنَّاسِ قِيَامًا طَوِيلًا يَقُومُ ثُمَّ يَرْكَعُ قَالَتْ فَجَعَلْتُ أَنْظُرُ إِلَى الْمَرْأَةِ الَّتِي هِيَ أَكْبَرُ مِنِّي قَائِمَةً وَإِلَى الْمَرْأَةِ الَّتِي هِيَ أَسْقَمُ مِنِّي قَائِمَةً فَقُلْتُ إِنِّي أَحَقُّ أَنْ أَصْبِرَ عَلَى طُولِ الْقِيَامِ مِنْكِو قَالَ ابْنُ جُرَيْجٍ حَدَّثَنِي مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَزِعَ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, [aku diberi cerita] dari [Asma' binti Abu Bakar] bahwa dia berkata, \"Nabi shallallahu 'alaihi wasallam terkejut pada waktu terjadi gerhana matahari, kemduian beliau mengambil jubah dan selendangnya, kemudian beliau sholat bersama manusia sampai berdiri lama, kemudian beliau rukuk.\" Asma berkata, \"Aku lihat ke arah seorang wanita yang lebih tua dariku, ia tegak berdiri, dan aku juga melihat kepada wanita yang lebih lemah dariku, dan ia tetap berdiri tegak. Maka aku berkata, \"Sungguh, aku lebih berhak bersabar atas lamanya berdiri daripada kamu.\" [Ibnu Juraij] berkata, telah menceritakan kepadaku [Manshur bin 'Abdurrahman] dari ibunya [Shafiyah binti Syaibah] dari [Asma' binti Abu Bakar] bahwa Nabi shallallahu 'alaihi wasallam terkejut.\""
            },
            {
                "number": 3844,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي يَحْيَى بْنُ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ جَدَّتِهِ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْلَمَّا وَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذِي طُوًى قَالَ أَبُو قُحَافَةَ لِابْنَةٍ لَهُ مِنْ أَصْغَرِ وَلَدِهِ أَيْ بُنَيَّةُ اظْهَرِي بِي عَلَى أَبِي قَبِيسٍ قَالَتْ وَقَدْ كُفَّ بَصَرُهُ قَالَتْ فَأَشْرَفْتُ بِهِ عَلَيْهِ فَقَالَ يَا بُنَيَّةُ مَاذَا تَرَيْنَ قَالَتْ أَرَى سَوَادًا مُجْتَمِعًا قَالَ تِلْكَ الْخَيْلُ قَالَتْ وَأَرَى رَجُلًا يَسْعَى بَيْنَ ذَلِكَ السَّوَادِ مُقْبِلًا وَمُدْبِرًا قَالَ يَا بُنَيَّةُ ذَلِكَ الْوَازِعُ يَعْنِي الَّذِي يَأْمُرُ الْخَيْلَ وَيَتَقَدَّمُ إِلَيْهَا ثُمَّ قَالَتْ قَدْ وَاللَّهِ انْتَشَرَ السَّوَادُ فَقَالَ قَدْ وَاللَّهِ إِذَا دَفَعَتْ الْخَيْلُ فَأَسْرِعِي بِي إِلَى بَيْتِي فَانْحَطَّتْ بِهِ وَتَلَقَّاهُ الْخَيْلُ قَبْلَ أَنْ يَصِلَ إِلَى بَيْتِهِ وَفِي عُنُقِ الْجَارِيَةِ طَوْقٌ لَهَا مِنْ وَرِقٍ فَتَلَقَّاهُ الرَّجُلُ فَاقْتَلَعَهُ مِنْ عُنُقِهَا قَالَتْ فَلَمَّا دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ وَدَخَلَ الْمَسْجِدَ أَتَاهُ أَبُو بَكْرٍ بِأَبِيهِ يَعُودُهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَلَّا تَرَكْتَ الشَّيْخَ فِي بَيْتِهِ حَتَّى أَكُونَ أَنَا آتِيهِ فِيهِ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ هُوَ أَحَقُّ أَنْ يَمْشِيَ إِلَيْكَ مِنْ أَنْ تَمْشِيَ أَنْتَ إِلَيْهِ قَالَ فَأَجْلَسَهُ بَيْنَ يَدَيْهِ ثُمَّ مَسَحَ صَدْرَهُ ثُمَّ قَالَ لَهُ أَسْلِمْ فَأَسْلَمَ وَدَخَلَ بِهِ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَأْسُهُ كَأَنَّهُ ثَغَامَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيِّرُوا هَذَا مِنْ شَعْرِهِ ثُمَّ قَامَ أَبُو بَكْرٍ فَأَخَذَ بِيَدِ أُخْتِهِ فَقَالَ أَنْشُدُ بِاللَّهِ وَبِالْإِسْلَامِ طَوْقَ أُخْتِي فَلَمْ يُجِبْهُ أَحَدٌ فَقَالَ يَا أُخَيَّةُ احْتَسِبِي طَوْقَكِ",
                "id": "Telah menceritakan kepada kami [Ya'kub] berkata, telah menceritakan kepada kami [Bapakku] dari [Ibnu Ishaq] berkata, telah menceritakan kepadaku [Yahya bin Abbad bin Abdullah bin Zubair] dari [Bapaknya] dari neneknya [Asma binti Abu Bakar] dia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam wukuf di Dzi Thuwa, Abu Quhafah berkata kepada anak perempuannya yang paling kecil, 'Hai anakku, tampakkanlah aku pada Abu Qabis.\" -Asma berkata; Abu Quhafah adalah seorang yang buta- Anaknya lalu berkata, \" Lalu aku melakukan untuknya, Abu Quhafah lalu berkata, \"Wahai puteriku, apa yang kamu lihat?\"anaknya menjawab, \"Aku melihat gumpalan hitam yang sedang berkumpul.\" Abu Quhafah berkata, \"Itu adalah kuda tunggangan.\" Anaknya berkata lagi, \"Aku juga melihat seseorang yang berlari di antara kumpulan itu ke depan dan belakang.\" Abu Quhafah berkata, \"Wahai puteriku, itulah Wazi', yakni orang yang menyuruh kuda kuda agar maju kedepan.\" Anaknya berkata, \"Demi Allah, kumpulan itu bergerak!\" Abu Quhafah berkata, \"Demi Allah, jika kuda telah bergerak maka bersegeralah denganku ke rumahku.\" Lalu anak perempuan tersebut terjatuh dengan ayahnya, sehingga para penunggang pun menemukannya sebelum dia sampai ke rumahnya, dan di leher gadis itu terdapat kalung miliknya dari perak, lalu seseorang menemuinya dan melepaskan dari lehernya.\" Asma melanjutkan, \"Ketika Rasulullah shallallahu 'alaihi wasallam memasuki Makkah dan beliau masuk ke dalam masjid, Abu Bakar dan ayahnya datang menemui Rasulullah shallallahu 'alaihi wasallam, maka ketika Rasulullah shallallahu 'alaihi wasallam melihatnya beliau bersabda: \"Kenapa kamu tidak meninggalkan orang tua ini di rumahnya hingga aku dapat mendatanginya?\" Abu Bakar menjawab, \"Wahai Rasulullah, dia lebih berhak untuk berjalan menemuimu daripada tuan yang berjalan menemuinya.\" Asma berkata, \"Lalu beliau mendudukkan ayah Abu Bakar di sisinya lalu mengusap dadanya dan bersabda: \"Masuklah Islam.\" Maka dia pun masuk Islam. Dan Abu Bakar membawa ayahnya menemui Rasulullah shallallahu 'alaihi wasallam sementara dikepalanya seakan-akan tumbuhan berwarna putih, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ubahlah ini dari rambutnya, \" kemudian Abu Bakar berdiri dan memegang tangan saudarinya lalu berkata, \"Aku bersumpah kepada Allah dan Islam akan kalung saudariku.\" Namun tidak seorangpun menjawabnya.\" Abu Bakar lalu berkata, \"Wahai saudariku, mintalah kalungmu.\""
            },
            {
                "number": 3845,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ جَدَّتِهِ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْلَمَّا خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَخَرَجَ مَعَهُ أَبُو بَكْرٍ احْتَمَلَ أَبُو بَكْرٍ مَالَهُ كُلَّهُ مَعَهُ خَمْسَةَ آلَافِ دِرْهَمٍ أَوْ سِتَّةَ آلَافِ دِرْهَمٍ قَالَتْ وَانْطَلَقَ بِهَا مَعَهُ قَالَتْ فَدَخَلَ عَلَيْنَا جَدِّي أَبُو قُحَافَةَ وَقَدْ ذَهَبَ بَصَرُهُ فَقَالَ وَاللَّهِ إِنِّي لَأَرَاهُ قَدْ فَجَعَكُمْ بِمَالِهِ مَعَ نَفْسِهِ قَالَتْ قُلْتُ كَلَّا يَا أَبَتِ إِنَّهُ قَدْ تَرَكَ لَنَا خَيْرًا كَثِيرًا قَالَتْ فَأَخَذْتُ أَحْجَارًا فَتَرَكْتُهَا فَوَضَعْتُهَا فِي كُوَّةِ الْبَيْتِ كَانَ أَبِي يَضَعُ فِيهَا مَالَهُ ثُمَّ وَضَعْتُ عَلَيْهَا ثَوْبًا ثُمَّ أَخَذْتُ بِيَدِهِ فَقُلْتُ يَا أَبَتِ ضَعْ يَدَكَ عَلَى هَذَا الْمَالِ قَالَتْ فَوَضَعَ يَدَهُ عَلَيْهِ فَقَالَ لَا بَأْسَ إِنْ كَانَ قَدْ تَرَكَ لَكُمْ هَذَا فَقَدْ أَحْسَنَ وَفِي هَذَا لَكُمْ بَلَاغٌ قَالَتْ لَا وَاللَّهِ مَا تَرَكَ لَنَا شَيْئًا وَلَكِنِّي قَدْ أَرَدْتُ أَنْ أُسْكِنَ الشَّيْخَ بِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ya'kub] berkata, telah menceritakan kepada kami [Bapakku] dari [Ibnu Ishaq] berkata, telah menceritakan kepadaku [Yahya bin Abdullah bin Zubair] bahwa [bapaknya] telah menceritakan kepadanya dari neneknya [Asma' binti Abu Bakar] dia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam keluar dan Abu Bakar keluar bersama beliau, Abu Bakar membawa seluruh hartanya yang berjumlah lima ribu atau enam ribu dirham.\" Asma berkata, \"Abu Bakar pergi membawa uang tersebut.\" Asma berkata, \"Kakekku, Abu Quhafah (yang saat itu telah buta), lalu masuk menemui kami seraya berkata, \"Demi Allah, aku melihatnya telah memberi kalian musibah dengan harta dan dirinya!\" Asma menjawab, \"Aku lalu berkata, \"Sekali-kali tidak wahai kakekku! Sungguh, dia telah meninggalkan bagi kami kebaikan.\" Asma melanjutkan, \"Lalu aku mengambil batu-batuan dan meninggalkan lalu menaruhnya di pintu rumah, yang ayahku biasa menaruh harta di sana. Lantas aku meletakkan kain di atas bebatuan tersebut, setelah itu aku meraih tangannya dan berkata, \"Hai kakekku, taruhlah tanganmu di atas harta ini.\" Asma melanjutkan, \"Lalu dia menaruh tangannya di atasnya seraya berkata, \"Tidaklah mengapa jika dia meninggalkan untuk kalian harta ini, sungguh dia telah berbuat baik, dan dengan ini cukup untuk kalian.\" Asma berkata, \"Demi Allah, tidak! Abu Bakar tidak meninggalkan untuk kami sedikitpun, namun aku hanya ingin menenangkan hati kakekku dengan itu.\""
            },
            {
                "number": 3846,
                "arab": "حَدَّثَنَا حَسَنٌ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنَا عُقَيْلُ بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍأَنَّهَا كَانَتْ إِذَا ثَرَدَتْ غَطَّتْهُ شَيْئًا حَتَّى يَذْهَبَ فَوْرُهُ ثُمَّ تَقُولُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ أَعْظَمُ لِلْبَرَكَةِحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عُقَيْلٍ و حَدَّثَنَا عَتَّابٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ قَالَ أَنْبَأَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّهَا كَانَتْ إِذَا ثَرَدَتْ غَطَّتْهُ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Hasan] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] berkata, telah menceritakan kepada kami [Uqail bin Khalid] dari [Ibnu Syihab] dari [Asma' binti Abu Bakar] bahwa jika dia membuat roti, maka dia menutupinya dengan sesuatu hingga cepat jadi, lalu dia berkata, \"Sungguh, aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, itu lebih barokah.\" [Qutaibah bin Sa'id] berkata; telah menceritakan kepada kami [Ibnu Lahi'ah] dari ['Uqail], dan telah menceritakan kepada kami ['Atab] berkata, telah menceritakan kepada kami [Abdullah] berkata; telah memberitakan kepada kami [Ibnu Lahi'ah] berkata; telah menceritakan kepadaku ['Uqail bin Khalid] dari [Ibnu Syihab] dari ['Urwah] dari [Asma' binti Abu Bakar] bahwa jika dia membuat roti, maka dia menutupinya…lalu dia menyebutkan (hadits) semisalnya.\""
            },
            {
                "number": 3847,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا عِمْرَانُ بْنُ يَزِيدَ حَدَّثَنَا مَنْصُورٌ عَنْ أُمِّهِ عَنِ أَسْمَاءَ قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ فَقَالَتْ فَقَالَ لَنَا مَنْ كَانَ مَعَهُ هَدْيٌ فَلْيَقُمْ عَلَى إِحْرَامِهِ وَمَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ فَلْيَحْلِلْ",
                "id": "Telah menceritakan kepada kami [Yunus] berkata, telah menceritakan kepada kami ['Imran bin Yazid] telah menceritakan kepada kami [Manshur] dari [Ibunya] dari [Asma'] dia berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam berniat untuk melaksanakan haji.\" Asma berkata, \"Beliau bersabda: \"Barangsiapa memiliki hadyu (kewajiban menyembelih kambing) maka hendaknya ia tetap dalam ihramnya, dan barangsiapa tidak memiliki hadyu hendaknya ia bertahallul.\""
            },
            {
                "number": 3848,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ قَالَتْدَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِابْنٍ لِي لَمْ يَطْعَمْ فَبَالَ عَلَيْهِ فَدَعَا بِمَاءٍ فَرَشَّهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari ['Ubaidillah] dari [Ummi Qais binti Mihshan] dia berkata, \"Aku menemui Nabi shallallahu 'alaihi wasallam bersama anakku yang belum bisa makan, lalu dia mengencingi beliau, kemudian beliau meminta air dan menyiram di atasnya.\""
            }
        ]
    }
}