{
    "status": true,
    "data": {
        "start": 6175,
        "end": 6321,
        "total": 147,
        "book": "bukhari",
        "hadits": [
            {
                "number": 6175,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ مِنْهُ حَتَّى إِنِّي لَأَرَى الرِّيَّ يَجْرِي ثُمَّ أَعْطَيْتُ فَضْلَهُ عُمَرَ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ الْعِلْمُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair], telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Hamzah bin Abdullah bin Umar], [Abdullah bin Umar] mengatakan; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku diberi segelas susu, maka aku meminumnya hingga sungguh aku melihat sungai mengalir, lantas kelebihannya kuberikan kepada Umar.\" Mereka bertanya; 'Bagaimana engkau takwilkan Ya Rasulullah? ' Nabi menjawab; \"Iilmu.\""
            },
            {
                "number": 6176,
                "arab": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ حَدَّثَنَا نَافِعٌ أَنَّ ابْنَ عُمَرَ قَالَإِنَّ رِجَالًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا يَرَوْنَ الرُّؤْيَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُصُّونَهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُولُ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا شَاءَ اللَّهُ وَأَنَا غُلَامٌ حَدِيثُ السِّنِّ وَبَيْتِي الْمَسْجِدُ قَبْلَ أَنْ أَنْكِحَ فَقُلْتُ فِي نَفْسِي لَوْ كَانَ فِيكَ خَيْرٌ لَرَأَيْتَ مِثْلَ مَا يَرَى هَؤُلَاءِ فَلَمَّا اضْطَجَعْتُ ذَاتَ لَيْلَةٍ قُلْتُ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ فِيَّ خَيْرًا فَأَرِنِي رُؤْيَا فَبَيْنَمَا أَنَا كَذَلِكَ إِذْ جَاءَنِي مَلَكَانِ فِي يَدِ كُلِّ وَاحِدٍ مِنْهُمَا مِقْمَعَةٌ مِنْ حَدِيدٍ يُقْبِلَانِ بِي إِلَى جَهَنَّمَ وَأَنَا بَيْنَهُمَا أَدْعُو اللَّهَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهَنَّمَ ثُمَّ أُرَانِي لَقِيَنِي مَلَكٌ فِي يَدِهِ مِقْمَعَةٌ مِنْ حَدِيدٍ فَقَالَ لَنْ تُرَاعَ نِعْمَ الرَّجُلُ أَنْتَ لَوْ كُنْتَ تُكْثِرُ الصَّلَاةَ فَانْطَلَقُوا بِي حَتَّى وَقَفُوا بِي عَلَى شَفِيرِ جَهَنَّمَ فَإِذَا هِيَ مَطْوِيَّةٌ كَطَيِّ الْبِئْرِ لَهُ قُرُونٌ كَقَرْنِ الْبِئْرِ بَيْنَ كُلِّ قَرْنَيْنِ مَلَكٌ بِيَدِهِ مِقْمَعَةٌ مِنْ حَدِيدٍ وَأَرَى فِيهَا رِجَالًا مُعَلَّقِينَ بِالسَّلَاسِلِ رُءُوسُهُمْ أَسْفَلَهُمْ عَرَفْتُ فِيهَا رِجَالًا مِنْ قُرَيْشٍ فَانْصَرَفُوا بِي عَنْ ذَاتِ الْيَمِينِ فَقَصَصْتُهَا عَلَى حَفْصَةَ فَقَصَّتْهَا حَفْصَةُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عَبْدَ اللَّهِ رَجُلٌ صَالِحٌ لَوْ كَانَ يُصَلِّي مِنْ اللَّيْلِفَقَالَ نَافِعٌ فَلَمْ يَزَلْ بَعْدَ ذَلِكَ يُكْثِرُ الصَّلَاةَ",
                "id": "Telah mengabrkan kepadaku ['ubaidhullah bin Sa'id], Telah menceritakan kepada kami ['Affan bin Muslim] telah menceritakan kepada kami [Shakhr bin Juwairiyah] telah menceritakan kepada kami [Nafi'] bahwasanya [Ibnu Umar] mengatakan; dahulu sahabat-sahabat Rasulullah Shallallahu'alaihiwasallam jika bermimpi, mereka suka sekali mengisahkan mimpinya kepada Rasulullah Shallallahu'alaihiwasallam sehingga Rasulullah Shallallahu'alaihiwasallam menakwilkan mimpinya. Ketika itu umurku masih belia, sedang aku sering tinggal dimasjid, karena aku belum menikah. Maka aku berkata kepada diriku sendiri; 'kalaulah dirimu ada kebaikan, niscaya engkau berimimpi sebagaimana orang-orang bermimpi.' Suatu malam ketika aku berbaring, aku memanjatkan doa; 'Ya Allah, jika Engkau mengetahui pada diriku terdapat kebaikan, maka perlihatkanlah kepadaku dalam mimpi.' Ketika aku dalam kondisi (mimpi) seperti itu, tiba-tiba ada dua malaikat mendatangiku yang di tangan masing-masing memegang palu besi, keduanya membawaku ke jahannam sedang aku diantara keduanya tiada henti memanjatkan doa; 'Ya Allah, aku berlindung kepada-Mu dari jahannam, ' Kemudian aku diperlihatkan seorang malaikat menemuiku sedang di tangannya membawa palu besi seraya berujar; 'tidak usah khawatir, sebaik-baik manusia adalah engkau, jika engkau memperbanyak sholat.' Mereka kemudian membawaku hingga menghentikanku di tepi jahannam, ternyata jahannam tergulung seperti gulungan sumur, ia mempunyai emperan sebagaimana emperan sumur, yang diantara kedua emperannya terdapat malaikat yang di tangannya membawa palu besi. Dan kulihat disana ada beberapa orang bergelantungan di rantai-rantai, kepala mereka terjungkir dibawah mereka, aku tahu disana ada beberapa pemuka Quraisy. Kemudian mereka membawaku pergi dari sisi kanan. Maka akub ceritakan mimpiku itu kepada Hafshah, kemudian [Hafshah] menceritakanya kepada Rasulullah Shallallahu'alaihiwasallam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Abdullah adalah seorang hamba yang shalih, asalkan sholat malam.\" Kata [Nafi']; 'semenjak itu Abdullah memperbanyak sholat.'"
            },
            {
                "number": 6177,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَكُنْتُ غُلَامًا شَابًّا عَزَبًا فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُنْتُ أَبِيتُ فِي الْمَسْجِدِ وَكَانَ مَنْ رَأَى مَنَامًا قَصَّهُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ اللَّهُمَّ إِنْ كَانَ لِي عِنْدكَ خَيْرٌ فَأَرِنِي مَنَامًا يُعَبِّرُهُ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنِمْتُ فَرَأَيْتُ مَلَكَيْنِ أَتَيَانِي فَانْطَلَقَا بِي فَلَقِيَهُمَا مَلَكٌ آخَرُ فَقَالَ لِي لَنْ تُرَاعَ إِنَّكَ رَجُلٌ صَالِحٌ فَانْطَلَقَا بِي إِلَى النَّارِ فَإِذَا هِيَ مَطْوِيَّةٌ كَطَيِّ الْبِئْرِ وَإِذَا فِيهَا نَاسٌ قَدْ عَرَفْتُ بَعْضَهُمْ فَأَخَذَا بِي ذَاتَ الْيَمِينِ فَلَمَّا أَصْبَحْتُ ذَكَرْتُ ذَلِكَ لِحَفْصَةَ فَزَعَمَتْ حَفْصَةُ أَنَّهَا قَصَّتْهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ عَبْدَ اللَّهِ رَجُلٌ صَالِحٌ لَوْ كَانَ يُكْثِرُ الصَّلَاةَ مِنْ اللَّيْلِقَالَ الزُّهْرِيُّ وَكَانَ عَبْدُ اللَّهِ بَعْدَ ذَلِكَ يُكْثِرُ الصَّلَاةَ مِنْ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam bin Yusuf] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] mengatakan, aku anak muda lajang di masa Nabi shallallahu 'alaihi wasallam, dan aku tidur di masjid. Dahulu ada satu kebiasan, siapa yang bermimpi, maka ia menceritakan mimpinya kepada Nabi Shallallahu'alaihiwasallam. Maka aku panjatkan doa; 'Ya Allah, jikalau aku mempunyai kebaikan disisi-Mu, maka perlihatkanlah kepadaku dalam mimpi sehingga Rasulullah Shallallahu'alaihiwasallam dapat mentakwilkan mimpiku.' aku pun tertidur, dan kulihat dua malaikat mendatangiku dan membawaku. kemudian ada malaikat lain menemui keduanya dan berujar keadaku; 'jangan khawatir, sebab kamu laki-laki shalih.' Lantas kedua malaikat itu membawaku ke neraka, ternyata neraka itu digulung seperti gulungan sumur, dan disana ada sebagian orang yang kukenal, lantas keduanya menggandengku ke sebalah kanan. Di pagi hari aku ceritakan mimpiku kepada [Hafshah], dan Hafshah mengaku telah menceritakannya kepada Nabi shallallahu 'alaihi wasallam, maka Nabi bersabda: \"Abdullah adalah laki-laki shalih, sekiranya ia memperbanyak sholat malam.\" Kata Az Zuhri, setelah peristiwa itu, Abdullah memperbanyak sholat malam."
            },
            {
                "number": 6178,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ مِنْهُ ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ الْعِلْمَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Hamzah bin Abdullah] dari [Abdullah bin Umar] radliallahu 'anhuma mengatakan, aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku diberi segelas susu, lalu aku meminumnya, kemudian aku berikan sisanya kepada Umar bin khattab.\" Mereka bertanya; 'bagaimana engkau takwilkan mimpimu ya Rasulullah? ' Beliau menjawab; \"ilmu.\""
            },
            {
                "number": 6179,
                "arab": "حَدَّثَنِي سَعِيدُ بْنُ مُحَمَّدٍ أَبُو عَبْدِ اللَّهِ الْجَرْمِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ عُبَيْدَةَ بْنِ نَشِيطٍ قَالَ قَالَ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاعَنْ رُؤْيَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّتِي ذَكَرَ فَقَالَ ابْنُ عَبَّاسٍ ذُكِرَ لِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ أَنَّهُ وُضِعَ فِي يَدَيَّ سِوَارَانِ مِنْ ذَهَبٍ فَفُظِعْتُهُمَا وَكَرِهْتُهُمَا فَأُذِنَ لِي فَنَفَخْتُهُمَا فَطَارَا فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِفَقَالَ عُبَيْدُ اللَّهِ أَحَدُهُمَا الْعَنْسِيُّ الَّذِي قَتَلَهُ فَيْرُوزٌ بِالْيَمَنِ وَالْآخَرُ مُسَيْلِمَةُ",
                "id": "telah menceritakan kepadaku [Sa'id bin Muhammad Abu Abdullah Al Jarmi] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Ayahku] dari [Shalih] dari [Ibnu Ubaidah bin Nasyith] mengatakan, [ubaidhullah bin Abdullah] mengatakan; aku bertanya [Abdullah bin Abbas] radliallahu 'anhuma tentang mimpi Rasulullah Shallallahu'alaihiwasallam yang pernah beliau ceritakan. Ibnu Abbas mengatakan; aku pernah diceritai, bahwa Rasulullah Shallallahu'alaihiwasallam mengatakan; \"Ketika aku tidur, aku bermimpi bahwa ditanganku diletakkan dua gelang emas. Aku merasa jijik dan tidak suka terhadap kedua benda itu, kemudian aku di izinkan untuk meniupnya sehingga keduanya beterbangan. Kedua gelang itu kutakwilkan, aka muncul dua pendusta.\" ubaidhullah menjelaskan; salah satunya Al Aswad al 'Ansi yang dibunuh oleh Fairuz ad Dailami di Yaman, dan satunya lagi Musailamah Alkadzdzab."
            },
            {
                "number": 6180,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ جَدِّهِ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىأُرَاهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ فَذَهَبَ وَهَلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرٌ فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ وَرَأَيْتُ فِيهَا بَقَرًا وَاللَّهِ خَيْرٌ فَإِذَا هُمْ الْمُؤْمِنُونَ يَوْمَ أُحُدٍ وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ مِنْ الْخَيْرِ وَثَوَابِ الصِّدْقِ الَّذِي آتَانَا اللَّهُ بِهِ بَعْدَ يَوْمِ بَدْرٍ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Al 'Ala`] Telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [kakeknya, Abu Burdah] dari [Abu Musa], setahuku ia dari Nabi shallallahu 'alaihi wasallam, beliau bersabda; \"Aku bermimpi bahwa aku hijrah dari Makkah ke suatu kawasan yang banyak pohon kurmanya. Awal perkiraanku, kawasan itu adalah Yamamah atau Hajar, ternyata itu adalah Madinah atau Yatsrib. Dan aku melihat disana ada sapi, demi Allah, yang bagus sekali. Dan ternyata mereka adalah orang-orang mukmin di hari Uhud. Dan kebaikan yang Allah datangkan serta pahala kejujuran adalah yang Allah berikan kepada kita setelah peperangan badar.\""
            },
            {
                "number": 6181,
                "arab": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا بِهِ أَبُو هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَحْنُ الْآخِرُونَ السَّابِقُونَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَا أَنَا نَائِمٌ إِذْ أُوتِيتُ خَزَائِنَ الْأَرْضِ فَوُضِعَ فِي يَدَيَّ سِوَارَانِ مِنْ ذَهَبٍ فَكَبُرَا عَلَيَّ وَأَهَمَّانِي فَأُوحِيَ إِلَيَّ أَنْ انْفُخْهُمَا فَنَفَخْتُهُمَا فَطَارَا فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا صَاحِبَ صَنْعَاءَ وَصَاحِبَ الْيَمَامَةِ",
                "id": "telah menceritakan kepadaku [Ishaq bin Ibrahim Al Hanzhali], Telah menceritakan kepada kami [Abdur Razaq] telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] mengatakan, inilah yang [Abu Hurairah] ceritakan kepada kami dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Kita adalah orang yang datang terkemudian, namun kita adalah orang yang pertama-tama masuk surga, \" Lantas Rasulullah Shallallahu'alaihiwasallam bersabda lagi: \"Ketika aku tidur, aku diberi perbendaharaan bumi, lantas diletakkan di tanganku dua gelang emas. Keduanya betul betul menjadikanku resah dan sedih, lantas aku memperoleh wahyu agar aku meniupnya, keduanya pun terbang. Maka kutakwilkan bahwa aka ada dua pendusta yang aku berada diantara keduanya, pertama orang Shan'a (al-Aswad al 'Ansi), orang kedua orang Yamamah (Musailamah alkadzdzab).\""
            },
            {
                "number": 6182,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي أَخِي عَبْدُ الْحَمِيدِ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ كَأَنَّ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ خَرَجَتْ مِنْ الْمَدِينَةِ حَتَّى قَامَتْ بِمَهْيَعَةَ وَهِيَ الْجُحْفَةُ فَأَوَّلْتُ أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَيْهَا",
                "id": "telah menceritakan kepada kami [Isma'il bin Abdullah] telah menceritakan kepadaku [Saudaraku, Abdul Hamid] dari [Sulaiman bin Bilal] dari [Musa bin 'Uqbah] dari [Salim bin Abdullah] dari [ayahnya], bahwasanya Nabi shallallahu 'alaihi wasallam bersabda; \"Aku bermimpi melihat wanita hitam, rambutnya acaka-acakan keluar dari madinah hingga berdiri di Mahya'ah yaitu Juhfah, maka aku takwilkan bahwa wabah penyakit Madinah telah dipindahkan kesana.\""
            },
            {
                "number": 6183,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا مُوسَى حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَافِي رُؤْيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَدِينَةِ رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ خَرَجَتْ مِنْ الْمَدِينَةِ حَتَّى نَزَلَتْ بِمَهْيَعَةَ فَتَأَوَّلْتُهَا أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَى مَهْيَعَةَ وَهِيَ الْجُحْفَةُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abi Bakar Al Muqaddami] telah menceritakan kepada kami [Fudhail bin Sulaiman] telah menceritakan kepada kami [Musa] telah menceritakan kepadaku [Salim bin Abdullah] dari [Abdullah bin Umar] radliallahu 'anhuma tentang mimpi Nabi shallallahu 'alaihi wasallam di Madinah: \"aku melihat wanita hitam berambut acak-acakan keluar dari Madinah hingga singgah di Mahya'ah, maka aku takwilkan bahwa wabah di Madinah telah dipindahkan ke Mahya'ah, yaitu Juhfah.\""
            },
            {
                "number": 6184,
                "arab": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ حَدَّثَنِي سُلَيْمَانُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ خَرَجَتْ مِنْ الْمَدِينَةِ حَتَّى قَامَتْ بِمَهْيَعَةَ فَأَوَّلْتُ أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَى مَهْيَعَةَ وَهِيَ الْجُحْفَةُ",
                "id": "Telah menceritakan kepadaku [Ibrahim bin Mundzir] telah menceritakan kepadaku [Abu Bakar bin Abi Uwais] telah menceritakan kepadaku [Sulaiman] dari [Musa bin 'Uqbah] dari [Salim] dari [Ayahnya], bahwasanya Nabi shallallahu 'alaihi wasallam bersabda; \"Aku (bermimpi) melihat seorang wanita hitam berambut acak-acakan keluar dari Madinah hingga berdiri di Mahya'ah, maka aku takwilkan bahwa wabah Madinah telah dipindahkan ke Mahya'ah yaitu Juhfah.\""
            },
            {
                "number": 6185,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ عَنْ جَدِّهِ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى أُرَاهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ فِي رُؤْيَايَ أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ فَإِذَا هُوَ مَا أُصِيبَ مِنْ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ثُمَّ هَزَزْتُهُ أُخْرَى فَعَادَ أَحْسَنَ مَا كَانَ فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنْ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al'ala] telah menceritakan kepada kami [Abu Usamah] dari [Buraid bin Abdullah bin Abi Burdah] dari [kakeknya, Abu Burdah] dari [Abu Musa], seingatku dia dari Nabi shallallahu 'alaihi wasallam bersabda; \"Pernah aku bermimpi menggerakkan pedang lantas bagian tengahnya terputus, itu berarti musibah kaum mukminin di hari Uhud, kemudian aku gerakkan sekali lagi, dan kali ini kembali lebih baik dari semula, maka itu berarti kemenangan yang Allah datangkan dan bersatu kembalinya kaum mukminin.\""
            },
            {
                "number": 6186,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَحَلَّمَ بِحُلْمٍ لَمْ يَرَهُ كُلِّفَ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ وَلَنْ يَفْعَلَ وَمَنْ اسْتَمَعَ إِلَى حَدِيثِ قَوْمٍ وَهُمْ لَهُ كَارِهُونَ أَوْ يَفِرُّونَ مِنْهُ صُبَّ فِي أُذُنِهِ الْآنُكُ يَوْمَ الْقِيَامَةِ وَمَنْ صَوَّرَ صُورَةً عُذِّبَ وَكُلِّفَ أَنْ يَنْفُخَ فِيهَا وَلَيْسَ بِنَافِخٍقَالَ سُفْيَانُ وَصَلَهُ لَنا أَيُّوبُ وَقَالَ قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ قَوْلَهُ مَنْ كَذَبَ فِي رُؤْيَاهُ وَقَالَ شُعْبَةُ عَنْ أَبِي هَاشِمٍ الرُّمَّانِيِّ سَمِعْتُ عِكْرِمَةَ قَالَ أَبُو هُرَيْرَةَ قَوْلَهُ مَنْ صَوَّرَ صُورَةً وَمَنْ تَحَلَّمَ وَمَنْ اسْتَمَعَ حَدَّثَنَا إِسْحَاقُ حَدَّثَنَا خَالِدٌ عَنْ خَالِدٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ مَنْ اسْتَمَعَ وَمَنْ تَحَلَّمَ وَمَنْ صَوَّرَ نَحْوَهُ تَابَعَهُ هِشَامٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَوْلَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bersabda; \"Barangsiapa menyatakan diri bermimpi padahal tidak, ia dipaksa untuk menyatukan dua biji gandum dan ia tak akan bisa melakukannya, dan barangsiapa mencuri dengar pembicaraan suatu kaum padahal mereka tidak menyukai atau telah menyingkir untuk menghindarinya, maka telinganya akan dialiri cairan tembaga pada hari kiamat, barang siapa menggambar ia akan disiksa dan dipaksa untuk menghidupkannya padahal tidak mampu.\" [Sufyan] mengatakan; ['Ayyub] menyambungkannya kepada kami. Sedang [Qutaibah] mengatakan; telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari ['Ikrimah] dari [Abu Hurairah] ucapannya tentang; 'Barangsiapa dusta dalam mimpinya'. Dan [Syu'bah] mengatakan; dari [Abu Hasyim Ar Rumani], aku mendengar [Ikrimah] berkata; [Abu Hurairah] dengan ucapannya; 'Barangsiapa menggambar, dan barangsiapa menyatakan bermimpi, dan barangsiapa mencuri dengar.' Telah menceritakan kepada kami [Ishaq] telah menceritakan kepada kami [Khalid] dari [Khalid] dari [Ikrimah] dari [Ibnu Abbas] mengatakan; \"Barangsiapa mencuri dengar, dan barangsiapa menyatakan bermimpi dan barangsiapa menggambar', hadits ini diikutsertakan penguatnya oleh [Hisyam] dari [Ikrimah] dari [Ibnu Abbas] dengan ucapan beliau."
            },
            {
                "number": 6187,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ مَوْلَى ابْنِ عُمَرَ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ أَفْرَى الْفِرَى أَنْ يُرِيَ عَيْنَيْهِ مَا لَمْ تَرَ",
                "id": "Telah menceritakan kepada kami ['Ali bin Muslim] telah menceritakan kepada kami ['Abdush Shamad] telah menceritakan kepada kami ['Abdurrahman bin Abdullah bin Dinar], maula Ibnu Umar, dari [ayahnya] dari [Ibnu Umar], bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diantara kebohongan yang paling bohong adalah menyatakan melihat (bermimpi) padahal tidak.\""
            },
            {
                "number": 6188,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ قَالَ سَمِعْتُ أَبَا سَلَمَةَ يَقُولُلَقَدْ كُنْتُ أَرَى الرُّؤْيَا فَتُمْرِضُنِي حَتَّى سَمِعْتُ أَبَا قَتَادَةَ يَقُولُ وَأَنَا كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي حَتَّى سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرُّؤْيَا الْحَسَنَةُ مِنْ اللَّهِ فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلَا يُحَدِّثْ بِهِ إِلَّا مَنْ يُحِبُّ وَإِذَا رَأَى مَا يَكْرَهُ فَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا وَمِنْ شَرِّ الشَّيْطَانِ وَلْيَتْفِلْ ثَلَاثًا وَلَا يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Rabi'] telah menceritakan kepada kami [Syu'bah] dari ['Abdu Rabbihi bin Sa'id] mengatakan; aku mendengar [Abu Salamah] mengatakan; 'Pernah aku bermimpi sehingga menjadikan diriku sakit, hingga aku mendengar [Abu Qatadah] mengatakan; 'Sungguh aku juga pernah bermimpi yang menjadikan diriku sakit, hingga aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Mimpi yang baik adalah berasal dari Allah, maka jika salah seorang diantara kaian bermimpi yang disukainya, jangan menceritakannya selain kepada yang disukai, dan siapa yang bermimpi yang tidak disukainya, hendaklah meminta perlindungan kepada Allah dari kejahatannya dan dari kejahatan setan, dan hendaklah meludah tiga kali dan jangan menceritakannya kepada seorang pun, sebab yang demikian tidak membahayakannya.\""
            },
            {
                "number": 6189,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ حَدَّثَنِي ابْنُ أَبِي حَازِمٍ وَالدَّرَاوَرْدِيُّ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ اللَّيْثِيِّ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا رَأَى أَحَدُكُمْ الرُّؤْيَا يُحِبُّهَا فَإِنَّهَا مِنْ اللَّهِ فَلْيَحْمَدْ اللَّهَ عَلَيْهَا وَلْيُحَدِّثْ بِهَا وَإِذَا رَأَى غَيْرَ ذَلِكَ مِمَّا يَكْرَهُ فَإِنَّمَا هِيَ مِنْ الشَّيْطَانِ فَلْيَسْتَعِذْ مِنْ شَرِّهَا وَلَا يَذْكُرْهَا لِأَحَدٍ فَإِنَّهَا لَنْ تَضُرَّهُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Hamzah] telah menceritakan kepadaku [Ibnu Abi Hazim] dan [Darawardi] dari [Yazid bin 'Abdullah bin Usamah bin Hadi Al Laitsi] dari [Abdullah bin Khabbab] dari [Abu Sa'id Al Khudzri], bahwasanya ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang diantara kalian bermimpi yang disukainya, maka itu berasal dari Allah, maka hendaklah ia memuji Allah karenanya, dan hendaklah menceritakannya, sebaliknya jika bermimpi selainnya ynag tidak disukainya, hanyasanya yang demikian itu berasal dari setan, maka hendaklah ia meminta perlindungan dari kejahatannya, dan jangan menceritakannya kepada seorang pun, sebab tidak akan membahayakannya.\""
            },
            {
                "number": 6190,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا كَانَ يُحَدِّثُأَنَّ رَجُلًا أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي رَأَيْتُ اللَّيْلَةَ فِي الْمَنَامِ ظُلَّةً تَنْطُفُ السَّمْنَ وَالْعَسَلَ فَأَرَى النَّاسَ يَتَكَفَّفُونَ مِنْهَا فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ وَإِذَا سَبَبٌ وَاصِلٌ مِنْ الْأَرْضِ إِلَى السَّمَاءِ فَأَرَاكَ أَخَذْتَ بِهِ فَعَلَوْتَ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلَا بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلَا بِهِ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَانْقَطَعَ ثُمَّ وُصِلَ فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَاللَّهِ لَتَدَعَنِّي فَأَعْبُرَهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْبُرْهَا قَالَ أَمَّا الظُّلَّةُ فَالْإِسْلَامُ وَأَمَّا الَّذِي يَنْطُفُ مِنْ الْعَسَلِ وَالسَّمْنِ فَالْقُرْآنُ حَلَاوَتُهُ تَنْطُفُ فَالْمُسْتَكْثِرُ مِنْ الْقُرْآنِ وَالْمُسْتَقِلُّ وَأَمَّا السَّبَبُ الْوَاصِلُ مِنْ السَّمَاءِ إِلَى الْأَرْضِ فَالْحَقُّ الَّذِي أَنْتَ عَلَيْهِ تَأْخُذُ بِهِ فَيُعْلِيكَ اللَّهُ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ مِنْ بَعْدِكَ فَيَعْلُو بِهِ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَعْلُو بِهِ ثُمَّ يَأْخُذُهُ رَجُلٌ آخَرُ فَيَنْقَطِعُ بِهِ ثُمَّ يُوَصَّلُ لَهُ فَيَعْلُو بِهِ فَأَخْبِرْنِي يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ أَصَبْتُ أَمْ أَخْطَأْتُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا قَالَ فَوَاللَّهِ يَا رَسُولَ اللَّهِ لَتُحَدِّثَنِّي بِالَّذِي أَخْطَأْتُ قَالَ لَا تُقْسِمْ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Yunus] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah] bahwasanya [Ibnu Abbas] radliallahu 'anhuma menceritakan; Ada seorang laki-laki mendatangi Rasulullah Shallallahu'alaihiwasallam mengatakan; 'Tadi malam aku bermimpi melihat segumpal awan yang meneteskan minyak samin dan madu, lantas kulihat orang banyak memintanya, ada yang meminta banyak dan ada yang meminta sedikit, tiba-tiba ada tali yang menghubungkan antara langit dan bumi, kulihat engkau memegangnya kemudian engkau naik, kemudian ada orang lain memegangnya dan ia pergunakan untuk naik, kemudian ada orang yag mengambilnya dan dipergunakannya untuk naik namun tali terputus, kemudian tali tersambung.' Spontan Abu Bakar berujar; 'Wahai Rasulullah, ayah dan ibuku untuk tebusanmu, demi Allah, biarkan aku untuk mentakwilkannya! ' \"takwilkanlah\" Kata Rasulullah Shallallahu'alaihiwasallam. Abu Bakar mengatakan; 'Adapun awan, itulah Islam, adapun madu dan minyak samin yang menetes, itulah Alquran, karena alqur'an manisnya menetes, maka silahkan ada yang memperbanyak atau mempersedikit, adapun tali yang menghubungkan langit dan bumi adalah kebenaran yang engkau pegang teguh sekarang ini, yang karenanya Allah meninggikan kedudukanmu, kemudian ada seseorang sepeninggalmu mengambilnya dan ia pun menjadi tinggi kedudukannya, lantas ada orang lain yang mengambilnya dan terputus, kemudian tali itu tersambung kembali sehingga ia menjadi tinggi kedudukannya karenanya, maka beritahulah aku ya Rasulullah, ayah dan ibuku sebagai tebusanmu, saya benar ataukah salah? ' Nabi shallallahu 'alaihi wasallam menjawab: \"Engkau benar sebagian dan salah sebagian!\" Abu Bakar mengatakan; 'Demi Allah ya Rasulullah, tolong beritahukanlah kepadaku takwilku yang salah! ' Nabi menjawab: \"Janganlah engkau bersumpah!\""
            },
            {
                "number": 6191,
                "arab": "حَدَّثَنِي مُؤَمَّلُ بْنُ هِشَامٍ أَبُو هِشَامٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَوْفٌ حَدَّثَنَا أَبُو رَجَاءٍ حَدَّثَنَا سَمُرَةُ بْنُ جُنْدُبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يُكْثِرُ أَنْ يَقُولَ لِأَصْحَابِهِ هَلْ رَأَى أَحَدٌ مِنْكُمْ مِنْ رُؤْيَا قَالَ فَيَقُصُّ عَلَيْهِ مَنْ شَاءَ اللَّهُ أَنْ يَقُصَّ وَإِنَّهُ قَالَ ذَاتَ غَدَاةٍ إِنَّهُ أَتَانِي اللَّيْلَةَ آتِيَانِ وَإِنَّهُمَا ابْتَعَثَانِي وَإِنَّهُمَا قَالَا لِي انْطَلِقْ وَإِنِّي انْطَلَقْتُ مَعَهُمَا وَإِنَّا أَتَيْنَا عَلَى رَجُلٍ مُضْطَجِعٍ وَإِذَا آخَرُ قَائِمٌ عَلَيْهِ بِصَخْرَةٍ وَإِذَا هُوَ يَهْوِي بِالصَّخْرَةِ لِرَأْسِهِ فَيَثْلَغُ رَأْسَهُ فَيَتَهَدْهَدُ الْحَجَرُ هَا هُنَا فَيَتْبَعُ الْحَجَرَ فَيَأْخُذُهُ فَلَا يَرْجِعُ إِلَيْهِ حَتَّى يَصِحَّ رَأْسُهُ كَمَا كَانَ ثُمَّ يَعُودُ عَلَيْهِ فَيَفْعَلُ بِهِ مِثْلَ مَا فَعَلَ الْمَرَّةَ الْأُولَى قَالَ قُلْتُ لَهُمَا سُبْحَانَ اللَّهِ مَا هَذَانِ قَالَ قَالَا لِي انْطَلِقْ انْطَلِقْ قَالَ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَجُلٍ مُسْتَلْقٍ لِقَفَاهُ وَإِذَا آخَرُ قَائِمٌ عَلَيْهِ بِكَلُّوبٍ مِنْ حَدِيدٍ وَإِذَا هُوَ يَأْتِي أَحَدَ شِقَّيْ وَجْهِهِ فَيُشَرْشِرُ شِدْقَهُ إِلَى قَفَاهُ وَمَنْخِرَهُ إِلَى قَفَاهُ وَعَيْنَهُ إِلَى قَفَاهُ قَالَ وَرُبَّمَا قَالَ أَبُو رَجَاءٍ فَيَشُقُّ قَالَ ثُمَّ يَتَحَوَّلُ إِلَى الْجَانِبِ الْآخَرِ فَيَفْعَلُ بِهِ مِثْلَ مَا فَعَلَ بِالْجَانِبِ الْأَوَّلِ فَمَا يَفْرُغُ مِنْ ذَلِكَ الْجَانِبِ حَتَّى يَصِحَّ ذَلِكَ الْجَانِبُ كَمَا كَانَ ثُمَّ يَعُودُ عَلَيْهِ فَيَفْعَلُ مِثْلَ مَا فَعَلَ الْمَرَّةَ الْأُولَى قَالَ قُلْتُ سُبْحَانَ اللَّهِ مَا هَذَانِ قَالَ قَالَا لِي انْطَلِقْ انْطَلِقْ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى مِثْلِ التَّنُّورِ قَالَ فَأَحْسِبُ أَنَّهُ كَانَ يَقُولُ فَإِذَا فِيهِ لَغَطٌ وَأَصْوَاتٌ قَالَ فَاطَّلَعْنَا فِيهِ فَإِذَا فِيهِ رِجَالٌ وَنِسَاءٌ عُرَاةٌ وَإِذَا هُمْ يَأْتِيهِمْ لَهَبٌ مِنْ أَسْفَلَ مِنْهُمْ فَإِذَا أَتَاهُمْ ذَلِكَ اللَّهَبُ ضَوْضَوْا قَالَ قُلْتُ لَهُمَا مَا هَؤُلَاءِ قَالَ قَالَا لِي انْطَلِقْ انْطَلِقْ قَالَ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى نَهَرٍ حَسِبْتُ أَنَّهُ كَانَ يَقُولُ أَحْمَرَ مِثْلِ الدَّمِ وَإِذَا فِي النَّهَرِ رَجُلٌ سَابِحٌ يَسْبَحُ وَإِذَا عَلَى شَطِّ النَّهَرِ رَجُلٌ قَدْ جَمَعَ عِنْدَهُ حِجَارَةً كَثِيرَةً وَإِذَا ذَلِكَ السَّابِحُ يَسْبَحُ مَا يَسْبَحُ ثُمَّ يَأْتِي ذَلِكَ الَّذِي قَدْ جَمَعَ عِنْدَهُ الْحِجَارَةَ فَيَفْغَرُ لَهُ فَاهُ فَيُلْقِمُهُ حَجَرًا فَيَنْطَلِقُ يَسْبَحُ ثُمَّ يَرْجِعُ إِلَيْهِ كُلَّمَا رَجَعَ إِلَيْهِ فَغَرَ لَهُ فَاهُ فَأَلْقَمَهُ حَجَرًا قَالَ قُلْتُ لَهُمَا مَا هَذَانِ قَالَ قَالَا لِي انْطَلِقْ انْطَلِقْ قَالَ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَجُلٍ كَرِيهِ الْمَرْآةِ كَأَكْرَهِ مَا أَنْتَ رَاءٍ رَجُلًا مَرْآةً وَإِذَا عِنْدَهُ نَارٌ يَحُشُّهَا وَيَسْعَى حَوْلَهَا قَالَ قُلْتُ لَهُمَا مَا هَذَا قَالَ قَالَا لِي انْطَلِقْ انْطَلِقْ فَانْطَلَقْنَا فَأَتَيْنَا عَلَى رَوْضَةٍ مُعْتَمَّةٍ فِيهَا مِنْ كُلِّ لَوْنِ الرَّبِيعِ وَإِذَا بَيْنَ ظَهْرَيْ الرَّوْضَةِ رَجُلٌ طَوِيلٌ لَا أَكَادُ أَرَى رَأْسَهُ طُولًا فِي السَّمَاءِ وَإِذَا حَوْلَ الرَّجُلِ مِنْ أَكْثَرِ وِلْدَانٍ رَأَيْتُهُمْ قَطُّ قَالَ قُلْتُ لَهُمَا مَا هَذَا مَا هَؤُلَاءِ قَالَ قَالَا لِي انْطَلِقْ انْطَلِقْ قَالَ فَانْطَلَقْنَا فَانْتَهَيْنَا إِلَى رَوْضَةٍ عَظِيمَةٍ لَمْ أَرَ رَوْضَةً قَطُّ أَعْظَمَ مِنْهَا وَلَا أَحْسَنَ قَالَ قَالَا لِي ارْقَ فِيهَا قَالَ فَارْتَقَيْنَا فِيهَا فَانْتَهَيْنَا إِلَى مَدِينَةٍ مَبْنِيَّةٍ بِلَبِنِ ذَهَبٍ وَلَبِنِ فِضَّةٍ فَأَتَيْنَا بَابَ الْمَدِينَةِ فَاسْتَفْتَحْنَا فَفُتِحَ لَنَا فَدَخَلْنَاهَا فَتَلَقَّانَا فِيهَا رِجَالٌ شَطْرٌ مِنْ خَلْقِهِمْ كَأَحْسَنِ مَا أَنْتَ رَاءٍ وَشَطْرٌ كَأَقْبَحِ مَا أَنْتَ رَاءٍ قَالَ قَالَا لَهُمْ اذْهَبُوا فَقَعُوا فِي ذَلِكَ النَّهَرِ قَالَ وَإِذَا نَهَرٌ مُعْتَرِضٌ يَجْرِي كَأَنَّ مَاءَهُ الْمَحْضُ فِي الْبَيَاضِ فَذَهَبُوا فَوَقَعُوا فِيهِ ثُمَّ رَجَعُوا إِلَيْنَا قَدْ ذَهَبَ ذَلِكَ السُّوءُ عَنْهُمْ فَصَارُوا فِي أَحْسَنِ صُورَةٍ قَالَ قَالَا لِي هَذِهِ جَنَّةُ عَدْنٍ وَهَذَاكَ مَنْزِلُكَ قَالَ فَسَمَا بَصَرِي صُعُدًا فَإِذَا قَصْرٌ مِثْلُ الرَّبَابَةِ الْبَيْضَاءِ قَالَ قَالَا لِي هَذَاكَ مَنْزِلُكَ قَالَ قُلْتُ لَهُمَا بَارَكَ اللَّهُ فِيكُمَا ذَرَانِي فَأَدْخُلَهُ قَالَا أَمَّا الْآنَ فَلَا وَأَنْتَ دَاخِلَهُ قَالَ قُلْتُ لَهُمَا فَإِنِّي قَدْ رَأَيْتُ مُنْذُ اللَّيْلَةِ عَجَبًا فَمَا هَذَا الَّذِي رَأَيْتُ قَالَ قَالَا لِي أَمَا إِنَّا سَنُخْبِرُكَ أَمَّا الرَّجُلُ الْأَوَّلُ الَّذِي أَتَيْتَ عَلَيْهِ يُثْلَغُ رَأْسُهُ بِالْحَجَرِ فَإِنَّهُ الرَّجُلُ يَأْخُذُ الْقُرْآنَ فَيَرْفُضُهُ وَيَنَامُ عَنْ الصَّلَاةِ الْمَكْتُوبَةِ وَأَمَّا الرَّجُلُ الَّذِي أَتَيْتَ عَلَيْهِ يُشَرْشَرُ شِدْقُهُ إِلَى قَفَاهُ وَمَنْخِرُهُ إِلَى قَفَاهُ وَعَيْنُهُ إِلَى قَفَاهُ فَإِنَّهُ الرَّجُلُ يَغْدُو مِنْ بَيْتِهِ فَيَكْذِبُ الْكَذْبَةَ تَبْلُغُ الْآفَاقَ وَأَمَّا الرِّجَالُ وَالنِّسَاءُ الْعُرَاةُ الَّذِينَ فِي مِثْلِ بِنَاءِ التَّنُّورِ فَإِنَّهُمْ الزُّنَاةُ وَالزَّوَانِي وَأَمَّا الرَّجُلُ الَّذِي أَتَيْتَ عَلَيْهِ يَسْبَحُ فِي النَّهَرِ وَيُلْقَمُ الْحَجَرَ فَإِنَّهُ آكِلُ الرِّبَا وَأَمَّا الرَّجُلُ الْكَرِيهُ الْمَرْآةِ الَّذِي عِنْدَ النَّارِ يَحُشُّهَا وَيَسْعَى حَوْلَهَا فَإِنَّهُ مَالِكٌ خَازِنُ جَهَنَّمَ وَأَمَّا الرَّجُلُ الطَّوِيلُ الَّذِي فِي الرَّوْضَةِ فَإِنَّهُ إِبْرَاهِيمُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَّا الْوِلْدَانُ الَّذِينَ حَوْلَهُ فَكُلُّ مَوْلُودٍ مَاتَ عَلَى الْفِطْرَةِ قَالَ فَقَالَ بَعْضُ الْمُسْلِمِينَ يَا رَسُولَ اللَّهِ وَأَوْلَادُ الْمُشْرِكِينَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَوْلَادُ الْمُشْرِكِينَ وَأَمَّا الْقَوْمُ الَّذِينَ كَانُوا شَطْرٌ مِنْهُمْ حَسَنًا وَشَطْرٌ قَبِيحًا فَإِنَّهُمْ قَوْمٌ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا تَجَاوَزَ اللَّهُ عَنْهُمْ",
                "id": "Telah menceritakan kepadaku [Mu`ammal bin Hisyam Abu Hisyam] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami ['Auf] telah menceritakan kepada kami [Abu Raja'] telah menceritakan kepada kami [Samurah bin Jundab] radliallahu 'anhu, Rasulullah Shallallahu'alaihiwasallam seringkali mengatakan kepada para sahabatnya; \"Apakah diantara kalian ada yang bermimpi?\" Kata Samurah; maka ada diantara mereka yang menceritakan kisahnya. Suatu saat ketika subuh, beliau berkata: \"Semalaman aku didatangi dua orang, keduanya mengajakku pergi dan berujar; 'Ayo kita berangkat! ' Aku pun berangkat bersama keduanya, dan kami mendatangi seseorang yang berbaring dan yang lain berdiri disampingnya dengan membawa batu besar, lalu ia menjatuhkan batu tersebut di kepalanya sehingga kepalanya pecah dan batu menggelinding disini. Orang tadi terus mengikuti batu dan mengambilnya, namun ketika dia belum kembali kepada yang dijatuhi, tetapi kepalanya telah kembali seperti sedia kala. Lantas orang tadi kembali menemuinya dan mengerjakan sebagaimana semula. Sayapun bertanya kepada dua orang yang membawaku; 'Subhanallah, mengapa kedua orang ini seperti ini? ' keduanya menjawab; 'Mari kita berangkat ke tempat lain dahulu! ' Kami pun berangkat, lantas kami mendatangi seseorang yang terlentang diatas kedua tengkuknya sedang ada orang lain yang berdiri di sampingnya sambil membawa pengait besi, ia memegang salah satu samping wajahnya dan memotong-motong dagunya hingga tengkuknya, dan tenggorokannya hingga tengkuknya, dan matanya hingga tengkuknya\" -Kata Auf, terkadang Abu Raja' menggunakan redaksi; 'lantas membelah-belah dagunya, bukan memotong- \"kemudian orang yang memotong berpindah ke sisi dagu lain dan memperlakukan korbannya sebagaimana ia lakukan pada sisi dagu pertama. Belum ia selesai memotong-mogong dagu kedua, maka dagu samping pertama kembali seperti semula, maka orang itu memperlakukannya sebagaimana semula. Maka saya bertanya; 'Subhanallah, kenapa dua orang ini? ' Namun kedua orang yang membawaku hanya berujar; 'Mari kita pindah ke tempat lain dulu! ' Maka kami berangkat, hingga kami mendatangi suatu tempat seperti tungku.\" Kata Abu Raja, seingatku Samurah mengatakan; \"Tungku tersebut mengeluarkan suara gemuruh.- Lantas kami melihat isinya, tak tahunya disana ada laki-laki dan wanita telanjang, mereka didatangi oleh sulut api dari bawah mereka, jika sulutan api mengenai mereka, mereka mengerang-ngerang. Maka saya bertanya kepada dua orang yang membawaku; 'apa sebenarnya dengan orang-orang ini? Namun kedua orang yang membawaku hanya berujar; 'Ayo kita berpindah ke tempat lain! ' Maka kami terus berangkat, dan kami mendatangi sebuah sungai.\" Dan setahuku Samurah mengatakan; 'sungai merah seperti darah-, \"tak tahunya di sungai ada laki-laki yang berenang, sedang ditepi sungai ada orang yang mengumpulkan banyak bebatuan, apabila yang berenang tadi sampai ke tepian sungai, ke tempat orang yang mengumpulkan bebatuan, maka ia membuka mulutnya dan orang yang di tepi tadi memasukkan batu ke mulutnya, lantas ia berenang kemudian kembali lagi, setiap kali ia kembali ke tepi, mulutnya membuka dan orang yang di tepi menyuapinya dengan batu itu. Saya bertanya kepada dua orang yang membawaku; 'kenapa dua orang ini? ' keduanya menjawab; 'Ayo kita pindah ke tempat lain dulu! ' Maka kami pun berangkat, lantas kami mendatangi seseorang yang wajahnya menyeramkan sebagaimana seseorang yang paling menyeramkan yang pernah kalian lihat. Dan di dekatnya terdapat api yang terus ia nyalakan dan dia berlari di sekitarnya. Saya bertanya kepada dua orang yang membawaku; 'mengapa orang ini? ' kedua orang yang membawaku berujar; 'Ayo kita pindah ke tempat lain dahulu! ' Lantas kami berangkat. Lalu kami mendatangi sebuah kebun yang secara merata berisi warna musim semi, diantara dua tepi kebun terdapat seseorang yang jangkung, yang nyaris aku belum pernah melihat manusia yang kepalanya memanjang di langit seperti itu, dan sekitar orang itu terdapat banyak anak-anak kecil yang pernah aku lihat. Saya bertanya; 'Apa ini sebenarnya, mereka ini siapa? ' kedua orang yang membawaku berujar; 'Ayo kita pindah ke tempat lain dulu! ' Kami pun berangkat melanjutkan perjalanan, hingga kami mendatangi sebuah kebun besar yang sebelumnya aku belum pernah melihat kebun lebih besar dan lebih indah daripadanya sama sekali, Keduanya berkata; 'Naiklah engkau! ' Kami pun naik, dan kami berakhir ke sebuah kota yang dibangun dari batu bata emas dan perak, lalu kami tiba di pintu kota. Kami minta di buka, maka pintu pun dibuka untuk kami, kami masuk dan kami disambut oleh beberapa orang yang separo tubuhnya seperti orang paling tampan yang pernah anda lihat, dan separohnya seperti manusia paling jelek yang pernah engkau lihat. Keduanya mengatakan kepada mereka; 'Pergilah kalian semua! ' Lantas mereka sampai di sebuah sungai. Tak tahunya sungai itu terbentang mengalir, airnya sangat putih bersih, mereka pun pergi dan mandi-mandi disana, kemudian kembali menemui kami dan kotorannya telah hilang di sungai tempat mereka mandi, sehingga mereka menjadi manusia paling tampan. Keduanya mengatakan kepadaku; 'Inilah surga Aden dan di sini hunianmu! ' lantas pandanganku menatap ke atas, tak tahunya ada sebuah istana seperti awan putih yang menyendiri. Keduanya berkata; 'Inilah hunianmu! ' Saya menjawab; 'Semoga Allah memberkati kalian berdua, sekarang biarkanlah aku untuk memasukinya! ' Keduanya menjawab; 'kalau sekarang jangan dulu, namun pasti engkau akan memasukinya! ' Saya mengatakan; 'Semenjak semalaman aku telah melihat peristiwa-peristiwa aneh nan mencengangkan, tolong kabarilah aku apa arti sebenarnya yang kulihat! ' Keduanya berujar; 'Sekarang baiklah kuberitakan kepadamu peristiwa-peristiwa itu! Adapun laki-laki pertama yang kamu datangi sedang kepalanya pecah dengan batu, itu adalah seseorang yang mempelajari alquran namun ia menolaknya, dan ia tidur sampai meninggalkan sholat wajib. Adapun orang yang kamu datangi membelah dagu kawannya hingga tengkuknya, tenggorokannya hingga dagunya, dan matanya hingga tengkuknya, itu adalah seseorang yang berangkat dari rumahnya lantas ia dusta, dan kedustaannya menembus cakrawala. Adapun laki-laki dan wanita yang telanjang dalam bangunan seperti tungku, mereka adalah laki-laki dan wanita pezina. Adapun laki-laki yang berenang dalam sungai dan disuapi batu besar, mereka adalah pemakan riba, adapun laki-laki yang raut mukanya menyeramkan di neraka sambil menyalakan api dan berlari-lari di sekitarnya, itu adalah Malik, penjaga Jahannam, adapun laki-laki jangkung dalam taman, ia adalah Ibrahim 'alaihissalam, adapun anak-anak di sekitarnya adalah bayi yang mati diatas fitrah.\" Lantas sebagian sahabat bertanya; 'ya Rasulullah, juga anak orang-orang musyrik? ' Rasulullah shallallahu 'alaihi wasallam bersabda: \"Juga anak-anak orang-orang musyrik! Adapun orang yang separoh berwajah tampan dan separohnya lagi jelek, mereka adalah orang yang mencampuradukkan amal shalih dan lainnya jelek, lantas Allah mengampuni kesalahannya.\""
            },
            {
                "number": 6192,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ حَدَّثَنَا نَافِعُ بْنُ عُمَرَ عَنْ ابْنِ أَبِي مُلَيْكَةَ قَالَ قَالَتْ أَسْمَاءُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنَا عَلَى حَوْضِي أَنْتَظِرُ مَنْ يَرِدُ عَلَيَّ فَيُؤْخَذُ بِنَاسٍ مِنْ دُونِي فَأَقُولُ أُمَّتِي فَيُقَالُ لَا تَدْرِي مَشَوْا عَلَى الْقَهْقَرَىقَالَ ابْنُ أَبِي مُلَيْكَةَ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نَرْجِعَ عَلَى أَعْقَابِنَا أَوْ نُفْتَنَ",
                "id": "Telah menceritakan kepada kami ['Ali bin Abdullah] Telah menceritakan kepada kami [Bisyir bin As Sari] telah menceritakan kepada kami [Nafi' bin Umar] dari [Ibnu Abi Mulaikah] mengatakan, [Asma'] mengatakan dari Nabi shallallahu 'alaihi wasallam; \"aku berada di telagaku menunggu-nunggu orang yang datang kepadaku, tiba-tiba orang di belakangku ditangkap dan dijauhkan dariku sehingga aku berteriak-teriak; 'Itu umatku, itu umatku! ' Tiba-tiba ada suara menjawab; 'Kamu tidak tahu! Mereka berjalan dengan melakukan bid'ah, maksiyat, dan dosa besar'.\" Ibnu Abi Mulaikah terus memanjatkan doa; Ya Allah, aku berlindung kepada-MU dari berbalik ke belakang atau terkena hantaman fitnah! "
            },
            {
                "number": 6193,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ أَبِي وَائِلٍ قَالَ قَالَ عَبْدُ اللَّهِقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ لَيُرْفَعَنَّ إِلَيَّ رِجَالٌ مِنْكُمْ حَتَّى إِذَا أَهْوَيْتُ لِأُنَاوِلَهُمْ اخْتُلِجُوا دُونِي فَأَقُولُ أَيْ رَبِّ أَصْحَابِي يَقُولُ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Abu Wa`il] mengatakan ' [Abdullah] mengatakan, Nabi shallallahu 'alaihi wasallam bersabda; \"Aku adalah manusia pertama-tama diantara kalian yang menuju telaga, lantas diperlihatkan padaku beberapa orang diantara kalian, hingga jika aku ingin menggandeng mereka, tiba-tiba mereka ditangkap dan dijauhkan dariku, sehingga aku berteriak-teriak 'Ya rabbi, itu sahabatku, ya rabbi, itu sahabatku! ' Allah menjawab; kamu tidak tahu apa yang perbuat sepeninggalmu! '\""
            },
            {
                "number": 6194,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي حَازِمٍ قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ يَقُولُسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ فَمَنْ وَرَدَهُ شَرِبَ مِنْهُ وَمَنْ شَرِبَ مِنْهُ لَمْ يَظْمَأْ بَعْدَهُ أَبَدًا لَيَرِدُ عَلَيَّ أَقْوَامٌ أَعْرِفُهُمْ وَيَعْرِفُونِي ثُمَّ يُحَالُ بَيْنِي وَبَيْنَهُمْقَالَ أَبُو حَازِمٍ فَسَمِعَنِي النُّعْمَانُ بْنُ أَبِي عَيَّاشٍ وَأَنَا أُحَدِّثُهُمْ هَذَا فَقَالَ هَكَذَا سَمِعْتَ سَهْلًا فَقُلْتُ نَعَمْ قَالَ وَأَنَا أَشْهَدُ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ لَسَمِعْتُهُ يَزِيدُ فِيهِ قَالَ إِنَّهُمْ مِنِّي فَيُقَالُ إِنَّكَ لَا تَدْرِي مَا بَدَّلُوا بَعْدَكَ فَأَقُولُ سُحْقًا سُحْقًا لِمَنْ بَدَّلَ بَعْدِي",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Ya'qub bin Abdurrahman] dari [Abu Hazim] mengatakan aku mendengar [Sahal bin Sa'd] mengatakan, aku mendengar Nabi Shallallahu'alaihiwasallam bersabda; \"Aku manusia pertama-tama diantara kalian yang menuju telaga, barangsiapa mendatanginya, maka tak akan haus selama-lamanya, sungguh beberapa orang menemuiku yang aku mengenal mereka dan juga mereka mengenalku, lantas tiba-tiba aku dan mereka terhalang.\" [Abu Hazim] mengatakan; dan [Nu'man bin Abi 'Ayyasy] mendengar aku ketika aku sedang menceritakan kepada mereka hadits ini, lantas ia bertanya kepadaku; 'kamu mendengar dari [Sahal] ' Kujawab; 'Iya.' Ia katakan; 'Dan saya bersaksi kepada [Abu Sa'id Al Khudzri], sungguh aku mendengarnya dengan tambahan redaksi; \"Mereka adalah dari ummatku' lantas ada suara yang menjawab; kamu tidak tahu perubahan yang mereka lakukan sepeninggalmu! Sehingga aku berkata; 'Celaka,, celaka bagi siapa saja yang mengganti agama sepeninggalku!\""
            },
            {
                "number": 6195,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ سَمِعْتُ عَبْدَ اللَّهِ قَالَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكُمْ سَتَرَوْنَ بَعْدِي أَثَرَةً وَأُمُورًا تُنْكِرُونَهَا قَالُوا فَمَا تَأْمُرُنَا يَا رَسُولَ اللَّهِ قَالَ أَدُّوا إِلَيْهِمْ حَقَّهُمْ وَسَلُوا اللَّهَ حَقَّكُمْ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Zaid bin Wahab] aku mendengar [Abdullah] mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami; \"Kalian akan menyaksikan sikap-sikap egois sepeninggalku, dan beberapa perkara yang kalian ingkari.\" Para sahabat bertanya; 'Lantas bagaimana anda menyuruh kami ya Rasulullah! ' Nabi menjawab; \"Tunaikanlah hak mereka dan mintalah kepada Allah hakmu!\""
            },
            {
                "number": 6196,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ الْجَعْدِ عَنْ أَبِي رَجَاءٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَرِهَ مِنْ أَمِيرِهِ شَيْئًا فَلْيَصْبِرْ فَإِنَّهُ مَنْ خَرَجَ مِنْ السُّلْطَانِ شِبْرًا مَاتَ مِيتَةً جَاهِلِيَّةً",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami ['Abdul warits] dari [Al Ja'd] dari [Abu Raja'] dari [Ibnu 'Abbas] dari Nabi shallallahu 'alaihi wasallam bersabda; \"Siapa yang tidak menyukai kebijakan amir (pemimpinnya) hendaklah bersabar, sebab siapapun yang keluar dari ketaatan kepada amir sejengkal, ia mati dalam jahiliyah.\""
            },
            {
                "number": 6197,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ الْجَعْدِ أَبِي عُثْمَانَ حَدَّثَنِي أَبُو رَجَاءٍ الْعُطَارِدِيُّ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ رَأَى مِنْ أَمِيرِهِ شَيْئًا يَكْرَهُهُ فَلْيَصْبِرْ عَلَيْهِ فَإِنَّهُ مَنْ فَارَقَ الْجَمَاعَةَ شِبْرًا فَمَاتَ إِلَّا مَاتَ مِيتَةً جَاهِلِيَّةً",
                "id": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Alja'd Abi Utsman] telah menceritakan kepadaku [Abu Raja' Al 'utharidi] mengtakan, aku mendengar [Ibnu Abbas] radliallahu 'anhuma dari Nabi Shallallahu'alaihiwasallam bersabda; \"Siapapun yang melihat sesuatu dari pemimpinnya yang tak disukainya, hendaklah ia bersabar terhadapnya, sebab siapa yang memisahkan diri sejengkal dari jama'ah, kecuali dia mati dalam jahiliyah.\""
            },
            {
                "number": 6198,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي ابْنُ وَهْبٍ عَنْ عَمْرٍو عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ قَالَ دَخَلْنَا عَلَى عُبَادَةَ بْنِ الصَّامِتِوَهُوَ مَرِيضٌ قُلْنَا أَصْلَحَكَ اللَّهُ حَدِّثْ بِحَدِيثٍ يَنْفَعُكَ اللَّهُ بِهِ سَمِعْتَهُ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دَعَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْنَاهُ فَقَالَ فِيمَا أَخَذَ عَلَيْنَا أَنْ بَايَعَنَا عَلَى السَّمْعِ وَالطَّاعَةِ فِي مَنْشَطِنَا وَمَكْرَهِنَا وَعُسْرِنَا وَيُسْرِنَا وَأَثَرَةً عَلَيْنَا وَأَنْ لَا نُنَازِعَ الْأَمْرَ أَهْلَهُ إِلَّا أَنْ تَرَوْا كُفْرًا بَوَاحًا عِنْدَكُمْ مِنْ اللَّهِ فِيهِ بُرْهَانٌ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepadaku [Ibnu Wahb] dari [Amru] dari [Bukair] dari [Busr bin Sa'id] dari [Junadah bin Umayyah] mengatakan, kami berkunjung ke [Ubadah bin Shamit] yang ketika itu sedang sakit. Kami menyapa; 'semoga Allah menyembuhkanmu, ceritakan kepada kami sebuah Hadits, yang kiranya Allah memberimu manfaat karenanya, yang engkau dengar dari Nabi shallallahu 'alaihi wasallam! ' Ia menjawab; 'Nabi shallallahu 'alaihi wasallam memanggil kami sehingga kami berbaiat kepada beliau.' Ubadah melanjutkan; diantara janji yang beliau ambil dari kami adalah, agar kami berbaiat kepada beliau untuk senantiasa mendengar dan ta'at, saat giat mapun malas, dan saat kesulitan maupun kesusahan, lebih mementingkan urusan bersama, serta agar kami tidak mencabut urusan dari ahlinya kecuali jika kalian melihat kekufuran yang terang-terangan, yang pada kalian mempunyai alasan yang jelas dari Allah.'"
            },
            {
                "number": 6199,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُسَيْدِ بْنِ حُضَيْرٍأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ اسْتَعْمَلْتَ فُلَانًا وَلَمْ تَسْتَعْمِلْنِي قَالَ إِنَّكُمْ سَتَرَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ar'arah] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas bin Malik] dari [Usaid bin Hudhair], ada seseorang yang menemui Nabi shallallahu 'alaihi wasallam dan berujar; 'Wahai Rasulullah, engkau mempekerjakan si fulan namun engkau tidak mempekerjakan aku? ' maka Nabi menjawab; \"kalian sepeninggalku akan melihat sifat-sifat egoisme, maka bersabarlah hingga kalian menemuiku.\""
            },
            {
                "number": 6200,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى بْنِ سَعِيدِ بْنِ عَمْرِو بْنِ سَعِيدٍ قَالَ أَخْبَرَنِي جَدِّي قَالَ كُنْتُ جَالِسًا مَعَ أَبِي هُرَيْرَةَفِي مَسْجِدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ وَمَعَنَا مَرْوَانُ قَالَ أَبُو هُرَيْرَةَ سَمِعْتُ الصَّادِقَ الْمَصْدُوقَ يَقُولُ هَلَكَةُ أُمَّتِي عَلَى يَدَيْ غِلْمَةٍ مِنْ قُرَيْشٍ فَقَالَ مَرْوَانُ لَعْنَةُ اللَّهِ عَلَيْهِمْ غِلْمَةً فَقَالَ أَبُو هُرَيْرَةَ لَوْ شِئْتُ أَنْ أَقُولَ بَنِي فُلَانٍ وَبَنِي فُلَانٍ لَفَعَلْتُ فَكُنْتُ أَخْرُجُ مَعَ جَدِّي إِلَى بَنِي مَرْوَانَ حِينَ مُلِّكُوا بِالشَّأْمِ فَإِذَا رَآهُمْ غِلْمَانًا أَحْدَاثًا قَالَ لَنَا عَسَى هَؤُلَاءِ أَنْ يَكُونُوا مِنْهُمْ قُلْنَا أَنْتَ أَعْلَمُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Amru bin Yahya bin Sa'id bin Amru bin Sa'id] mengatakan, telah mengabarkan kepadaku [ayahku] mengatakan, pernah aku duduk bersama [Abu Hurairah] di masjid Nabi shallallahu 'alaihi wasallam di Madinah. Pada saat itu kami juga bersama Marwan. Abu Hurairah mengatakan; 'Aku mendengar seorang yang jujur menyampaikan, dan berita yang dibawanya adalah benar (Muhammad) mengatakan: \"Kebinasaan umatku di tangan anak-anak muda Qurays.\" Spontan Marwan berseru; 'Kiranya laknat Allah tertimpa kepada mereka, anak-anak muda itu! ' Lantas Abu Hurairah mengatakan 'Kalau aku berkenan mengatakan bani fulan, bani fulan, niscaya kulakukan! ' Kemudian aku keluar (mengadakan perjalanan) bersama kakekku ke bani marwan ketika menjadi raja-raja Syam, dan jika ia melihat mereka, mereka adalah anak-anak muda yang masih belia, ia mengatakan kepada kami; 'bisa jadi mereka itu adalah diantara mereka itu (yang disebutkan dalam sabda Nabi).' Maka kami menjawab; 'Engkau lebih tahu! '"
            },
            {
                "number": 6201,
                "arab": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ حَدَّثَنَا ابْنُ عُيَيْنَةَ أَنَّهُ سَمِعَ الزُّهْرِيَّ عَنْ عُرْوَةَ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ حَبِيبَةَ عَنْ زَيْنَبَ بِنْتِ جَحْشٍ رَضِيَ اللَّهُ عَنْهُنَّ أَنَّهَا قَالَتْاسْتَيْقَظَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ النَّوْمِ مُحْمَرًّا وَجْهُهُ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ وَعَقَدَ سُفْيَانُ تِسْعِينَ أَوْ مِائَةً قِيلَ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ نَعَمْ إِذَا كَثُرَ الْخَبَثُ",
                "id": "Telah menceritakan kepada kami [Malik bin Isma'il] telah menceritakan kepada kami [Ibnu 'Uyainah], bahwasanya ia mendengar [Az Zuhri] dari ['Urwah] dari [Zainab binti Ummu Salamah] dari [Ummu Habibah] dari [Zainab binti Jahsy] rdhiyallahu'anhuna, ia mengatakan; Nabi shallallahu 'alaihi wasallam bangun tidur dalam keadaan wajahnya memerah seraya mengucapkan: \"laa-ilaaha-illallah, celaka bangsa arab karena keburukan yang telah dekat, hari ini telah dibuka benteng Ya'juj dan Ma'juj seperti ini\" --Sedang Sufyan menyatakan secara pasti jumlahnya yaitu sembilan puluh atau seratus-maka beliau di tanya; 'Apakah kita juga akan binasa sedang diantara kita masih ada orang-orang yang shalih? ' Nabi menjawab; \"Iya, jika kejahatan telah mewabah.\""
            },
            {
                "number": 6202,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ ح و حَدَّثَنِي مَحْمُودٌ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ أُسَامَةَ بْنِ زَيْدٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَأَشْرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُطُمٍ مِنْ آطَامِ الْمَدِينَةِ فَقَالَ هَلْ تَرَوْنَ مَا أَرَى قَالُوا لَا قَالَ فَإِنِّي لَأَرَى الْفِتَنَ تَقَعُ خِلَالَ بُيُوتِكُمْ كَوَقْعِ الْقَطْرِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] -lewat jalur periwayatan lain-Dan telah menceritakan kepadaku [Mahmud] telah mengabarkan kepadaku ['Abdurrazzaq] Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari [Usamah bin Zaid] radliallahu 'anhuma, mengatakan; Pernah Nabi shallallahu 'alaihi wasallam menaiki sebuah benteng Madinah lantas mengatakan; \"apakah kalian melihat yang kulihat?\" Mereka menjawab; 'Tidak.' Beliau bersabda: \"Sungguh aku melihat fitnah telah terjadi ditengah-tengah rumah kalian sebagaimana hujan turun.\""
            },
            {
                "number": 6203,
                "arab": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ أَخْبَرَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَتَقَارَبُ الزَّمَانُ وَيَنْقُصُ الْعَمَلُ وَيُلْقَى الشُّحُّ وَتَظْهَرُ الْفِتَنُ وَيَكْثُرُ الْهَرْجُ قَالُوا يَا رَسُولَ اللَّهِ أَيُّمَ هُوَ قَالَ الْقَتْلُ الْقَتْلُوَقَالَ شُعَيْبٌ وَيُونُسُ وَاللَّيْثُ وَابْنُ أَخِي الزُّهْرِيِّ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Ayyasy bin Al Walid] Telah mengabarkan kepada kami ['Abdul A'la] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda (tentang tanda-tanda kiamat); \"Jaman terasa ringkas, amal shalih berkurang, kebakhilan merajalela, fitnah (maksiat) dinyatakan secara terang-terangan, dan banyak al haraj.\" Para sahabat bertanya; 'Ya Rasulullah, apa maksud istilah al haraj? ' Nabi menjawab \"Pembunuhan-pembunuhan.\" Sedang [Syu'aib], [Yunus], dan [Al Laits], serta [anak Saudaraku, Az Zuhri], mengatakan dari [Az Zuhri] dari [Humaid] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 6204,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ وَأَبِي مُوسَى فَقَالَاقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ بَيْنَ يَدَيْ السَّاعَةِ لَأَيَّامًا يَنْزِلُ فِيهَا الْجَهْلُ وَيُرْفَعُ فِيهَا الْعِلْمُ وَيَكْثُرُ فِيهَا الْهَرْجُ وَالْهَرْجُ الْقَتْلُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami ['ubaidhullah bin Musa] dari [Al A'masy] dari [Syaqiq] mengatakan; aku bersama [Abdullah] dan [Abu Musa], keduanya mengatakan; Nabi Shallallahu'alaihiwasallam bersabda; \"Menjelang kiamat terjadi, terdapat hari-hari yang ketika itu banyak kebodohan, ilmu diangkat, dan banyak alharaj, alharaj adalah pembunuhan.\""
            },
            {
                "number": 6205,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا شَقِيقٌ قَالَجَلَسَ عَبْدُ اللَّهِ وَأَبُو مُوسَى فَتَحَدَّثَا فَقَالَ أَبُو مُوسَى قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ بَيْنَ يَدَيْ السَّاعَةِ أَيَّامًا يُرْفَعُ فِيهَا الْعِلْمُ وَيَنْزِلُ فِيهَا الْجَهْلُ وَيَكْثُرُ فِيهَا الْهَرْجُ وَالْهَرْجُ الْقَتْلُحَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ إِنِّي لَجَالِسٌ مَعَ عَبْدِ اللَّهِ وَأَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُمَا فَقَالَ أَبُو مُوسَى سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ وَالْهَرْجُ بِلِسَانِ الْحَبَشَةِ الْقَتْلُ",
                "id": "Telah menceritakan kepada kami [Umar bin Al Hafsh] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Syaqiq] mengatakan, Abdullah dan Abu Musa duduk berbincang-bincang. [Abu Musa] menuturkan; Nabi Shallallahu'alaihiwasallam bersabda; \"Menjelang kiamat terjadi, ada hari-hari yang ketika ilmu diangkat, kebodohan merajalela, banyak alharaj, alharaj adalah pembunuhan.\" Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Wa`il] mengatakan, Aku duduk bersama 'Abdullah dan Abu Musa radliallahu 'anhuma, lantas [Abu Musa] menuturkan; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda, seperti hadits diatas, dan alharaj menurut dialek orang Habsyi (Ethiopia) maknanya adalah pembunuhan."
            },
            {
                "number": 6206,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ عَنْ وَاصِلٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ وَأَحْسِبُهُ رَفَعَهُ قَالَبَيْنَ يَدَيْ السَّاعَةِ أَيَّامُ الْهَرْجِ يَزُولُ فِيهَا الْعِلْمُ وَيَظْهَرُ فِيهَا الْجَهْلُقَالَ أَبُو مُوسَى وَالْهَرْجُ الْقَتْلُ بِلِسَانِ الْحَبَشَةِ وَقَالَ أَبُو عَوَانَةَ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ الْأَشْعَرِيِّ أَنَّهُ قَالَ لِعَبْدِ اللَّهِ تَعْلَمُ الْأَيَّامَ الَّتِي ذَكَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيَّامَ الْهَرْجِ نَحْوَهُ قَالَ ابْنُ مَسْعُودٍ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مِنْ شِرَارِ النَّاسِ مَنْ تُدْرِكْهُمْ السَّاعَةُ وَهُمْ أَحْيَاءٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Washil] dari [Abu Wa`il] dari [Abdullah] dan setahu saya dia memarfukkannya, mengatakan; \"Menjelang kiamat tiba, terdapat hari-hari Alharaj, ketika itu ilmu lenyap, kebodohan merajalela.\" [Abu Musa] mengatakan alharaj maknanya adalah pembunuhan, istilah ini adalah istilah orang Habsyi (Ethiopia). Sedang [Abu 'Awanah] mengatakan, dari ['Ashim] dari [Abu Wail] dari [Al Asy'ari] bahwasanya ia berkata kepada 'Abdullah 'Kamu tahu hari-hari yang disebut Nabi shallallahu 'alaihi wasallam tentang hari-hari al haraj (pembunuhan)? ' semisal hadits diatas. Sedang [Ibnu Mas'ud] mengatakan, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda; \"Manusia yang paling jelek adalah manusia yang mendapati hari kiamat ketika dia masih hidup.\""
            },
            {
                "number": 6207,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّبَيْرِ بْنِ عَدِيٍّ قَالَ أَتَيْنَا أَنَسَ بْنَ مَالِكٍفَشَكَوْنَا إِلَيْهِ مَا نَلْقَى مِنْ الْحَجَّاجِ فَقَالَ اصْبِرُوا فَإِنَّهُ لَا يَأْتِي عَلَيْكُمْ زَمَانٌ إِلَّا الَّذِي بَعْدَهُ شَرٌّ مِنْهُ حَتَّى تَلْقَوْا رَبَّكُمْ سَمِعْتُهُ مِنْ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Zubair bin 'Adi] mengatakan, pernah kami mendatangi [Anas bin Malik], kemudian kami mengutarakan kepadanya keluh kesah kami tentang ulah para jamaah haji. Maka dia menjawab; 'Bersabarlah, sebab tidaklah kalian menjalalni suatu zaman, melainkan sesudahnya lebih buruk daripadanya, sampai kalian menjumpai rabb kalian. Aku mendengar hadit ini dari Nabi kalian Shallallahu'alaihiwasallam.'"
            },
            {
                "number": 6208,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ ح و حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي أَخِي عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ عَنْ ابْنِ شِهَابٍ عَنْ هِنْدٍ بِنْتِ الْحَارِثِ الْفِرَاسِيَّةِ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْاسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً فَزِعًا يَقُولُ سُبْحَانَ اللَّهِ مَاذَا أَنْزَلَ اللَّهُ مِنْ الْخَزَائِنِ وَمَاذَا أُنْزِلَ مِنْ الْفِتَنِ مَنْ يُوقِظُ صَوَاحِبَ الْحُجُرَاتِ يُرِيدُ أَزْوَاجَهُ لِكَيْ يُصَلِّينَ رُبَّ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٍ فِي الْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] -lewat jalur periwayatan lain- Dan Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Saudaraku] dari [Sulaiman bin Bilal] dari [Muhammad bin Abi 'Utaiq] dari [Ibnu Syihab] dari [Hindun binti Al Harits Al Firasiyyah], bahwasanya [Ummu Salamah isteri Nabi] shallallahu 'alaihi wasallam mengatakan; Suatu malam Rasulullah bangun dengan agak gusar dan mengucapkan: \"Subhanallah, perbendaharaan apa lagi yang Allah turunkan? dan fitnah apa lagi yang Allah turunkan? Siapa yang mau membangunkan penghuni kamar-kamar (maksudnya isterinya) untuk sholat? Betapa banyak orang berpakaian di dunia namun di akherat telanjang.\""
            },
            {
                "number": 6209,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Nafi'] dari [Abdullah bin Umar] radliallahu 'anhuma, bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menghunus pedang kepada kami, ia bukan golongan kami.\""
            },
            {
                "number": 6210,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] Telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menghunuskan pedangnya kepada kami, ia bukan golongan kami.\""
            },
            {
                "number": 6211,
                "arab": "حَدَّثَنَا مُحَمَّدٌ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ هَمَّامٍ سَمِعْتُ أَبَا هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُشِيرُ أَحَدُكُمْ عَلَى أَخِيهِ بِالسِّلَاحِ فَإِنَّهُ لَا يَدْرِي لَعَلَّ الشَّيْطَانَ يَنْزِعُ فِي يَدِهِ فَيَقَعُ فِي حُفْرَةٍ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Muhammad] Telah mengabarkan kepada kami [Abdurrazaq] dai [Ma'mar] dari [Hammam], aku mendengar [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang diantara kalian mengarahkan pedangnya kepada kawannya, sebab siapa tahu setan menariknya dari tangannya lantas ia terjerumus dalam lubang neraka.\""
            },
            {
                "number": 6212,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ قَالَ قُلْتُ لِعَمْرٍو يَا أَبَا مُحَمَّدٍ سَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُمَرَّ رَجُلٌ بِسِهَامٍ فِي الْمَسْجِدِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ بِنِصَالِهَا قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] mengatakan, aku bertanya kepada [Amru]; hai Abu Muhammad apakah engkau mendengar [Jabir bin Abdullah] mengatakan; 'Ada seorang laki-laki lewat dengan membawa anak panah di masjid, lantas Rasulullah Shallallahu'alaihiwasallam menegur orang itu: \"Tutuplah mata anak panahnya!\" Lantas Amru menjawab; 'Iya, benar.'"
            },
            {
                "number": 6213,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرٍأَنَّ رَجُلًا مَرَّ فِي الْمَسْجِدِ بِأَسْهُمٍ قَدْ أَبْدَى نُصُولَهَا فَأُمِرَ أَنْ يَأْخُذَ بِنُصُولِهَا لَا يَخْدِشُ مُسْلِمًا",
                "id": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amru bin Dinar] dari [Jabir], ada seorang laki-laki lewat di masjid dengan anak panah yang nampakkan mata anak panahnya, lantas ia diperintahkan untuk menutup mata panahnya agar tidak melukai kaum muslimin."
            },
            {
                "number": 6214,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَرَّ أَحَدُكُمْ فِي مَسْجِدِنَا أَوْ فِي سُوقِنَا وَمَعَهُ نَبْلٌ فَلْيُمْسِكْ عَلَى نِصَالِهَا أَوْ قَالَ فَلْيَقْبِضْ بِكَفِّهِ أَنْ يُصِيبَ أَحَدًا مِنْ الْمُسْلِمِينَ مِنْهَا شَيْءٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam bersabda; \"Jika salah seorang diantara kalian melewati masjid kami, atau pasar kami, sedang ia membawa anak panah, hendaklah ia pegang (ia tutup) mata anak panahnya\" -atau ia mengatakan dengan redaksi; hendaklah ia pegang dengan tangannya- sebab dikhawatirkan kaum muslimin terlukai daripadanya.\""
            },
            {
                "number": 6215,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ حَدَّثَنِي أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا شَقِيقٌ قَالَ قَالَ عَبْدُ اللَّهِقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِبَابُ الْمُسْلِمِ فُسُوقٌ وَقِتَالُهُ كُفْرٌ",
                "id": "Telah menceritakan kepada kami ['Umar bin Hafsh] telah menceritakan kepadaku [Ayahku] Telah menceritakan kepada kami [Al A'masy] Telah menceritakan kepada kami [Syaqiq] mengatakan; [Abdullah] mengatakan, Nabi Shallallahu'alaihiwasallam bersabda; \"Mencela orang muslim adalah kefasikan, dan memeranginya adalah kekufuran.\""
            },
            {
                "number": 6216,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي وَاقِدُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] Telah menceritakan kepada kami [Syu'bah] Telah mengabarkan kepada kami [Waqid bin Muhammad] dari [ayahnya] dari [Ibnu Umar], bahwasanya ia mendengar Nabi Shallallahu'alaihiwasallam bersabda; \"Janganlah kalian sepeninggalku kembali kepada kekafiran, sebagian kalian memenggal leher sebagian yang lainnya\"."
            },
            {
                "number": 6217,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ حَدَّثَنَا ابْنُ سِيرِينَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِي بَكْرَةَ وَعَنْ رَجُلٍ آخَرَ هُوَ أَفْضَلُ فِي نَفْسِي مِنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِي بَكْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ النَّاسَ فَقَالَ أَلَا تَدْرُونَ أَيُّ يَوْمٍ هَذَا قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ فَقَالَ أَلَيْسَ بِيَوْمِ النَّحْرِ قُلْنَا بَلَى يَا رَسُولَ اللَّهِ قَالَ أَيُّ بَلَدٍ هَذَا أَلَيْسَتْ بِالْبَلْدَةِ الْحَرَامِ قُلْنَا بَلَى يَا رَسُولَ اللَّهِ قَالَ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ وَأَبْشَارَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلَا هَلْ بَلَّغْتُ قُلْنَا نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ فَلْيُبَلِّغْ الشَّاهِدُ الْغَائِبَ فَإِنَّهُ رُبَّ مُبَلِّغٍ يُبَلِّغُهُ لِمَنْ هُوَ أَوْعَى لَهُ فَكَانَ كَذَلِكَ قَالَ لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ فَلَمَّا كَانَ يَوْمُ حُرِّقَ ابْنُ الْحَضْرَمِيِّ حِينَ حَرَّقَهُ جَارِيَةُ بْنُ قُدَامَةَ قَالَ أَشْرِفُوا عَلَى أَبِي بَكْرَةَ فَقَالُوا هَذَا أَبُو بَكْرَةَ يَرَاكَ قَالَ عَبْدُ الرَّحْمَنِ فَحَدَّثَتْنِي أُمِّي عَنْ أَبِي بَكْرَةَ أَنَّهُ قَالَ لَوْ دَخَلُوا عَلَيَّ مَا بَهَشْتُ بِقَصَبَةٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Qurrah bin Khalid] telah menceritakan kepada kami [Ibnu Sirin] dari [Abdurrahman bin Abi Bakrah] dari [Abu Bakrah] dan dari seorang lainnya yang dia lebih utama menurutku daripada Abdurrahman bin Abi Bakrah, dari Abu bakrah, Bahwasanya Rasulullah shallallahu 'alaihi wasallam berpidato di hadapan sahabat dan bertanya: \"Tahukah kalian hari apa ini?\" 'Allah dan Rasul-Nya lebih tahu' Jawab mereka. Kata Abu Bakrah; Hingga kami ketika itu menyangka bahwa Nabi menamakannya dengan nama lain. Kemudian Nabi bertutur: \"Bukankah sekarang hari nahar (korban)?\" Kami menjawab; 'betul Ya Rasulullah!.' Rasulullah bertanya: \"Negeri manakah ini, bukankah negeri haram?\" 'Benar ya Rasulullah' Jawab kami. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Sesungguhnya darah kalian, harta kalian, kehormatan kalian, dan kulit kalian adalah haram sebagaimana kehormatan hari kalian ini, dalam bulan kalian ini, dan negeri kalian ini, bukankah telah kusampaikan?\" 'Betul' Jawab kami. Nabi melanjutkan: \"Ya Allah, saksikanlah, hendaklah yang hadir menyampaikan berita ini kepada yang tidak hadir, berapa banyak orang yang menyampaikan berita kepada orang yang lebih paham.\" Selanjutnya beliau sampaikan pula sabdanya: \"Janganlah kalian menjadi kafir sepeninggalku, sebagian kalian memenggal leher sebagian lainnya.\" Dan dikala Ibnul khadrami dibakar oleh seorang hamba sahaya Ibnu Qudamah, Abdurrahman mengatakan; 'Tolong kalian lihat Abu bakrah dari tempat yang tinggi! ' lantas mereka mengatakan 'Ini Abu Bakrah melihatmu hai hamba sahaya! ' Abdurrahman berkata; 'ibuku menceritakan kepadaku dari Abu Bakrah, bahwasanya ia mengatakan; 'Kalaulah mereka menemuiku, aku pun tidak akan menohok mereka dengan tongkatku ini.'"
            },
            {
                "number": 6218,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِشْكَابٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَرْتَدُّوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Isykab] telah menceritakan kepada kami [Muhammad bin Fudhail] dari [ayahnya] dari [Ikrimah] dari [Ibnu 'Abbas] radliallahu 'anhuma, ia mengatakan; Nabi Shallallahu'alaihiwasallam bersabda; \"Jangan kalian murtad sepeninggalku, sebagian kalian memenggal leher sebagian yang lainnya.\""
            },
            {
                "number": 6219,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ عَلِيِّ بْنِ مُدْرِكٍ سَمِعْتُ أَبَا زُرْعَةَ بْنَ عَمْرِو بْنِ جَرِيرٍ عَنْ جَدِّهِ جَرِيرٍ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ اسْتَنْصِتْ النَّاسَ ثُمَّ قَالَ لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari ['Ali bin Mudrik] aku mendengar [Abu Zur'ah bin 'Amru bin Jarir] dari [kakeknya, Jarir] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku pada haji wada': \"suruhlah orang-orang diam, \" kemudian beliau bersabda: \"Janganlah kalian sepeninggalku menjadi kafir, sebagian kalian memenggal leher sebagian yang lainnya.\""
            },
            {
                "number": 6220,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ ح قَالَ إِبْرَاهِيمُ وَحَدَّثَنِي صَالِحُ بْنُ كَيْسَانَ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَتَكُونُ فِتَنٌ الْقَاعِدُ فِيهَا خَيْرٌ مِنْ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ مِنْ الْمَاشِي وَالْمَاشِي فِيهَا خَيْرٌ مِنْ السَّاعِي مَنْ تَشَرَّفَ لَهَا تَسْتَشْرِفْهُ فَمَنْ وَجَدَ مِنْهَا مَلْجَأً أَوْ مَعَاذًا فَلْيَعُذْ بِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin ubaidhullah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [ayahnya] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] -lewat jalur periwayatan lain- [Ibrahim] mengatakan, dan telah menceritakan kepada kami [Shalih bin Kisan] dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dari [Abu Hurairah] menuturkan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan terjadi fitnah, ketika itu yang duduk lebih baik daripada yang berdiri, yang berdiri lebih baik daripada yang berjalan, yang berjalan lebih baik daripada yang berlari, barangsiapa berusaha menghadapi fitnah itu, justru fitnah itu akan mempengaruhinya, maka barangsiapa mendapat tempat berlindung atau base camp pertahanan, hendaklah ia berlindung diri di tempat itu.\""
            },
            {
                "number": 6221,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَتَكُونُ فِتَنٌ الْقَاعِدُ فِيهَا خَيْرٌ مِنْ الْقَائِمِ وَالْقَائِمُ خَيْرٌ مِنْ الْمَاشِي وَالْمَاشِي فِيهَا خَيْرٌ مِنْ السَّاعِي مَنْ تَشَرَّفَ لَهَا تَسْتَشْرِفْهُ فَمَنْ وَجَدَ مَلْجَأً أَوْ مَعَاذًا فَلْيَعُذْ بِهِ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman], bahwasanya [Abu Hurairah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan terjadi fitnah, orang yang duduk pada saat itu lebih baik daripada orang yang berdiri, orang yang berdiri lebih baik daripada orang yang berjalan, orang yang berjalan lebih daripada yang berlari, barangsiapa berusaha menghadapi fitnah itu, justru fitnah itu akan mempengaruhinya, maka barangsiapa mendapat tempat berlindung atau base camp pertahanan, hendaklah ia berlindung diri di tempat itu.\""
            },
            {
                "number": 6222,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ حَدَّثَنَا حَمَّادٌ عَنْ رَجُلٍ لَمْ يُسَمِّهِ عَنْ الْحَسَنِ قَالَ خَرَجْتُ بِسِلَاحِي لَيَالِيَ الْفِتْنَةِ فَاسْتَقْبَلَنِي أَبُو بَكْرَةَ فَقَالَأَيْنَ تُرِيدُ قُلْتُ أُرِيدُ نُصْرَةَ ابْنِ عَمِّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَكِلَاهُمَا مِنْ أَهْلِ النَّارِ قِيلَ فَهَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ إِنَّهُ أَرَادَ قَتْلَ صَاحِبِهِقَالَ حَمَّادُ بْنُ زَيْدٍ فَذَكَرْتُ هَذَا الْحَدِيثَ لِأَيُّوبَ وَيُونُسَ بْنِ عُبَيْدٍ وَأَنَا أُرِيدُ أَنْ يُحَدِّثَانِي بِهِ فَقَالَا إِنَّمَا رَوَى هَذَا الحَدِيثَ الْحَسَنُ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ أَبِي بَكْرَةَ حَدَّثَنَا سُلَيْمَانُ حَدَّثَنَا حَمَّادٌ بِهَذَا وَقَالَ مُؤَمَّلٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ وَيُونُسُ وَهِشَامٌ وَمُعَلَّى بْنُ زِيَادٍ عَنْ الْحَسَنِ عَنْ الْأَحْنَفِ عَنْ أَبِي بَكْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَاهُ مَعْمَرٌ عَنْ أَيُّوبَ وَرَوَاهُ بَكَّارُ بْنُ عَبْدِ الْعَزِيزِ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ وَقَالَ غُنْدَرٌ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ أَبِي بَكْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَرْفَعْهُ سُفْيَانُ عَنْ مَنْصُورٍ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Abdul Wahhab], telah menceritakan kepada kami [Hammad] dari [seseorang yang tidak dia sebutkan namanya] dari [Al Hasan] mengatakan, Aku keluar dengan membawa senjataku di malam-malam terjadi fitnah, maka [Abu Bakrah] menemuiku dengan bertanya; 'mau kemana kamu? ' aku menjawab; 'Aku ingin menolong keponakan Rasulullah Shallallahu'alaihiwasallam' (maksudnya 'Ali). Abu Bakrah berkata, Rasulullah Shallallahu'alaihiwasallam bersabda; \"Jika dua muslim berhadap-hadapan dengan kedua pedangnya, maka keduanya sama-sama masuk neraka.\" Maka ada yang bertanya; 'kalau yang membunuh sudah maklum, lantas apa dosa yang dibunuh? ' Nabi shallallahu 'alaihi wasallam menjawab: \"Ia juga berkehendak membunuh saudaranya.\" [Hammad bin Zaid] berkata; maka hadits ini kusampaikan kepada [Ayyub] dan [Yunus bin Ubaid], dan aku ingin keduanya menceritakan kepadaku (jalur periwayatan) hadits ini, maka keduanya mengatakan; 'Hadits ini diriwayatkan oleh [Al Hasan] dari [Ahnaf bin Qais] dari [Abu Bakrah]. Telah menceritakan kepada kami [Sulaiman] telah menceritakan kepada kami [Hammad] tentang hal itu. [Mu'ammal] berkata; telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub], [Yunus bin Ubaid], [Hisyam] dan [Mu'ala bin Zaid] dari [Al Hasan] dari [Ahnaf] dari [Abu Bakrah] dari Nabi shallallahu 'alaihi wasallam, dan diriwayatkan oleh [Ma'mar] dari [Ayyub], dan diriwayatkan oleh [Bakkar bin Abdul aziz] dari [ayahnya] dari [Abu Bakrah] dan [Ghundar] mengatakan; telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Rib'i bin Hirasy] dari [Abu Bakrah] dari Nabi shallallahu 'alaihi wasallam, dan [Sufyan] tidak memarfu'kannya dari [Manshur]."
            },
            {
                "number": 6223,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا ابْنُ جَابِرٍ حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ الْحَضْرَمِيُّ أَنَّهُ سَمِعَ أَبَا إِدْرِيسَ الْخَوْلَانِيَّ أَنَّهُ سَمِعَ حُذَيْفَةَ بْنَ الْيَمَانِ يَقُولُكَانَ النَّاسُ يَسْأَلُونَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَيْرِ وَكُنْتُ أَسْأَلُهُ عَنْ الشَّرِّ مَخَافَةَ أَنْ يُدْرِكَنِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي جَاهِلِيَّةٍ وَشَرٍّ فَجَاءَنَا اللَّهُ بِهَذَا الْخَيْرِ فَهَلْ بَعْدَ هَذَا الْخَيْرِ مِنْ شَرٍّ قَالَ نَعَمْ قُلْتُ وَهَلْ بَعْدَ ذَلِكَ الشَّرِّ مِنْ خَيْرٍ قَالَ نَعَمْ وَفِيهِ دَخَنٌ قُلْتُ وَمَا دَخَنُهُ قَالَ قَوْمٌ يَهْدُونَ بِغَيْرِ هَدْيِي تَعْرِفُ مِنْهُمْ وَتُنْكِرُ قُلْتُ فَهَلْ بَعْدَ ذَلِكَ الْخَيْرِ مِنْ شَرٍّ قَالَ نَعَمْ دُعَاةٌ عَلَى أَبْوَابِ جَهَنَّمَ مَنْ أَجَابَهُمْ إِلَيْهَا قَذَفُوهُ فِيهَا قُلْتُ يَا رَسُولَ اللَّهِ صِفْهُمْ لَنَا قَالَ هُمْ مِنْ جِلْدَتِنَا وَيَتَكَلَّمُونَ بِأَلْسِنَتِنَا قُلْتُ فَمَا تَأْمُرُنِي إِنْ أَدْرَكَنِي ذَلِكَ قَالَ تَلْزَمُ جَمَاعَةَ الْمُسْلِمِينَ وَإِمَامَهُمْ قُلْتُ فَإِنْ لَمْ يَكُنْ لَهُمْ جَمَاعَةٌ وَلَا إِمَامٌ قَالَ فَاعْتَزِلْ تِلْكَ الْفِرَقَ كُلَّهَا وَلَوْ أَنْ تَعَضَّ بِأَصْلِ شَجَرَةٍ حَتَّى يُدْرِكَكَ الْمَوْتُ وَأَنْتَ عَلَى ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Ibnu Jabir] telah menceritakan kepadaku [Busr bin ubaidhullah Al Khadrami], ia mendengar [Abu Idris alkhaulani], ia mendengar [Khudzaifah Ibnul yaman] mengatakan; Orang-orang bertanya Rasulullah Shallallahu'alaihiwasallam tentang kebaikan sedang aku bertanya beliau tentang keburukan karena khawatir jangan-jangan aku terkena keburukan itu sendiri. Maka aku bertanya 'Hai Rasulullah, dahulu kami dalam kejahiliyahan dan keburukan, lantas Allah membawa kebaikan ini, maka apakah setelah kebaikan ini ada keburukan lagi? Nabi menjawab 'Tentu'. Saya bertanya 'Apakah sesudah keburukan itu ada kebaikan lagi? 'Tentu' Jawab beliau, dan ketika itu ada kotoran, kekurangan dan perselisihan. Saya bertanya 'Apa yang anda maksud kotoran, kekurangan dan perselisihan itu? Nabi menjawab 'Yaitu sebuah kaum yang menanamkan pedoman bukan dengan pedomanku, engkau kenal mereka namun pada saat yang sama engkau juga mengingkarinya. Saya bertanya 'Adakah steelah kebaikan itu ada keburukan? Nabi menjawab 'O iya,,,,, ketika itu ada penyeru-penyeru menuju pintu jahannam, siapa yang memenuhi seruan mereka, mereka akan menghempaskan orang itu ke pintu-pintu itu. Aku bertanya 'Ya Rasulullah, tolong beritahukanlah kami tentang ciri-ciri mereka! Nabi menjawab; Mereka adalah seperti kulit kita ini, juga berbicara dengan bahasa kita. Saya bertanya 'Lantas apa yang anda perintahkan kepada kami ketika kami menemui hari-hari seperti itu? Nabi menjawab; Hendaklah kamu selalu bersama jamaah muslimin dan imam mereka! Aku bertanya; kalau tidak ada jamaah muslimin dan imam bagaimana? Nabi menjawab; hendaklah kau jauhi seluruh firqah (kelompok-kelompok) itu, sekalipun kau gigit akar-akar pohon hingga kematian merenggutmu kamu harus tetap seperti itu."
            },
            {
                "number": 6224,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ وَغَيْرُهُ قَالَ حَدَّثَنَا أَبُو الْأَسْوَدِ وَقَالَ اللَّيْثُ عَنْ أَبِي الْأَسْوَدِ قَالَقُطِعَ عَلَى أَهْلِ الْمَدِينَةِ بَعْثٌ فَاكْتُتِبْتُ فِيهِ فَلَقِيتُ عِكْرِمَةَ فَأَخْبَرْتُهُ فَنَهَانِي أَشَدَّ النَّهْيِ ثُمَّ قَالَ أَخْبَرَنِي ابْنُ عَبَّاسٍ أَنَّ أُنَاسًا مِنْ الْمُسْلِمِينَ كَانُوا مَعَ الْمُشْرِكِينَ يُكَثِّرُونَ سَوَادَ الْمُشْرِكِينَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَأْتِي السَّهْمُ فَيُرْمَى فَيُصِيبُ أَحَدَهُمْ فَيَقْتُلُهُ أَوْ يَضْرِبُهُ فَيَقْتُلُهُ فَأَنْزَلَ اللَّهُ تَعَالَى{ إِنَّ الَّذِينَ تَوَفَّاهُمْ الْمَلَائِكَةُ ظَالِمِي أَنْفُسِهِمْ }",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yazid] telah menceritakan kepada kami [Haiwa] dan lainnya mengatakan, telah menceritakan kepada kami [Abul Aswad] dan [Al Laits] mengatakan dari [Abul aswad] mengatakan 'Ada sekelompok tentara dibentuk untuk menyerang penduduk Madinah (muslimin) dan namaku diikutsertakan dalam daftar. Selanjutnya aku bertemu ['Ikrimah] dan kuutarakan nasibku, lantas dia melarangku secara serius kemudian mengatakan, [Ibnu Abbas] mengabariku bahwa beberapa orang muslimin ikut serta pasukan musyrik sekedar untuk menambah jumlah pasukan demi melawan Rasulullah Shallallahu'alaihiwasallam, lantas sebagain mereka terkena anak panah sehingga meninggal, dan sebagian mereka terkena luka senjata sehingga tewas, maka Allah menurunkan ayat sebagai jawaban nasib mereka; Sesungguhnya orang-orang yang diwafatkan Allah dalam keadaan menganiaya diri mereka sendiri, \" dan seterusnya sampai akhir ayat QS.Annisa 97."
            },
            {
                "number": 6225,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا الْأَعْمَشُ عَنْ زَيْدِ بْنِ وَهْبٍ حَدَّثَنَا حُذَيْفَةُ قَالَحَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَيْنِ رَأَيْتُ أَحَدَهُمَا وَأَنَا أَنْتَظِرُ الْآخَرَ حَدَّثَنَا أَنَّ الْأَمَانَةَ نَزَلَتْ فِي جَذْرِ قُلُوبِ الرِّجَالِ ثُمَّ عَلِمُوا مِنْ الْقُرْآنِ ثُمَّ عَلِمُوا مِنْ السُّنَّةِ وَحَدَّثَنَا عَنْ رَفْعِهَا قَالَ يَنَامُ الرَّجُلُ النَّوْمَةَ فَتُقْبَضُ الْأَمَانَةُ مِنْ قَلْبِهِ فَيَظَلُّ أَثَرُهَا مِثْلَ أَثَرِ الْوَكْتِ ثُمَّ يَنَامُ النَّوْمَةَ فَتُقْبَضُ فَيَبْقَى فِيهَا أَثَرُهَا مِثْلَ أَثَرِ الْمَجْلِ كَجَمْرٍ دَحْرَجْتَهُ عَلَى رِجْلِكَ فَنَفِطَ فَتَرَاهُ مُنْتَبِرًا وَلَيْسَ فِيهِ شَيْءٌ وَيُصْبِحُ النَّاسُ يَتَبَايَعُونَ فَلَا يَكَادُ أَحَدٌ يُؤَدِّي الْأَمَانَةَ فَيُقَالُ إِنَّ فِي بَنِي فُلَانٍ رَجُلًا أَمِينًا وَيُقَالُ لِلرَّجُلِ مَا أَعْقَلَهُ وَمَا أَظْرَفَهُ وَمَا أَجْلَدَهُ وَمَا فِي قَلْبِهِ مِثْقَالُ حَبَّةِ خَرْدَلٍ مِنْ إِيمَانٍ وَلَقَدْ أَتَى عَلَيَّ زَمَانٌ وَلَا أُبَالِي أَيُّكُمْ بَايَعْتُ لَئِنْ كَانَ مُسْلِمًا رَدَّهُ عَلَيَّ الْإِسْلَامُ وَإِنْ كَانَ نَصْرَانِيًّا رَدَّهُ عَلَيَّ سَاعِيهِ وَأَمَّا الْيَوْمَ فَمَا كُنْتُ أُبَايِعُ إِلَّا فُلَانًا وَفُلَانًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] Telah mengabarkan kepada kami [Sufyan] telah menceritakan kepada kami [Al A'masy] dari [Zaid bin Wahb] telah menceritakan kepada kami [Khudzaifah] mengatakan, telah menceritakan kepada kami Rasulullah Shallallahu'alaihiwasallam dua Hadits, satunya sudah saya lihat sendiri dan satunya aku sedang menunggu-nunggu, beliau menceritakan kepada kami: \"bahwa Amanat mula-mula turun pada relung hati orang-orang, lantas mereka paham terhadap alquran dan paham terhadap sunnah.\" Khudzaifah menceritakan kepada kami kemarfu'annya, Nabi bersabda; \"seseorang tertidur nyenyak kemudian amanat dicerabut dari hatinya, dan masih ada bekasnya seperti bekas yang kecil, kemudian dia tidur lagi dan amanat dicerabut darinya sehingga bekasnya seperti kutu di tangan, sepeti bara yang kau gelindingkan di kakimu sehingga ia memar (beram-beram), maka engkau melihatnya beram-beram (memar) padahal sebenarnya tidak terjadi apa-apa, dan manusia secara beruntun melakukan baiat dan nyaris tak seorang pun menunaikan amanat dengan baik, dan ada berita bahwa di bani fulan ada seseorang yang dapat di percaya, kemudian dikatakan kepada tersebut; 'alangkah cerdasnya dia, alangkah bijaknya dia, alangkah pemberaninya dia, ' padahal tidak ada seberat biji gandum pun iman di dalam hatinya, pernah datang suatu masa kepadaku yang ketika itu aku tak peduli siapa diantara kalian yang aku baiat, kalaulah ia muslim, maka keIslamannya akan mengembalikannya kepadaku, dan kalaulah nasrani, penarik pajaknya akan mengembalikannya kepadaku, namun hari ini aku tidak membaiat selain fulan dan fulan.\""
            },
            {
                "number": 6226,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَاتِمٌ عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِأَنَّهُ دَخَلَ عَلَى الْحَجَّاجِ فَقَالَ يَا ابْنَ الْأَكْوَعِ ارْتَدَدْتَ عَلَى عَقِبَيْكَ تَعَرَّبْتَ قَالَ لَا وَلَكِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذِنَ لِي فِي الْبَدْوِوَعَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ قَالَ لَمَّا قُتِلَ عُثْمَانُ بْنُ عَفَّانَ خَرَجَ سَلَمَةُ بْنُ الْأَكْوَعِ إِلَى الرَّبَذَةِ وَتَزَوَّجَ هُنَاكَ امْرَأَةً وَوَلَدَتْ لَهُ أَوْلَادًا فَلَمْ يَزَلْ بِهَا حَتَّى قَبْلَ أَنْ يَمُوتَ بِلَيَالٍ فَنَزَلَ الْمَدِينَةَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Hatim] dari [Yazid bin Abi Ubaid] dari [Salamah bin Al Akwa'] bahwasanya ia menemui Al Hajjaj, maka Al Hajjaj berujar; 'Hai Ibnul akwa', apakah engkau berbalik ke belakang dengan cara pindah ke pelosok pedesaan? ' Ibnul akwa' menjawab; 'tidak, namun Rasulullah Shallallahu'alaihiwasallam telah memberiku izin (untuk tinggal) di pelosok pedesaan.\" Dan dari [Yazid bin Abi Ubaid] mengatakan, tatkala Utsman bin Affan terbunuh, Salamah bin Al Akwa' pergi mengucilkan diri ke Rabdzah dan menikahi wanita disana sampai melahirkan beberapa anak, dan dia terus bermukim di sana sampai beberapa malam sebelum meninggalnya, kemudian tinggal di Madinah."
            },
            {
                "number": 6227,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صَعْصَعَةَ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ أَنْ يَكُونَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنْ الْفِتَنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Abdurrahman bin Abdullah bin Abi Sha'Sha'ah] dari [ayahnya] dari [Abu Sa'id Al Khudzri] radliallahu 'anhu, bahwasanya ia menuturkan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"tak lama lagi sebaik-baik harta seorang muslim adalah kambing yang ia gembalakan di lereng-lereng gunung dan tempat-tempat hujan turun, ia lari untuk menyelamatkan agamanya dari gelombang fitnah.\""
            },
            {
                "number": 6228,
                "arab": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَسَأَلُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَحْفَوْهُ بِالْمَسْأَلَةِ فَصَعِدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ الْمِنْبَرَ فَقَالَ لَا تَسْأَلُونِي عَنْ شَيْءٍ إِلَّا بَيَّنْتُ لَكُمْ فَجَعَلْتُ أَنْظُرُ يَمِينًا وَشِمَالًا فَإِذَا كُلُّ رَجُلٍ لَافٌّ رَأْسَهُ فِي ثَوْبِهِ يَبْكِي فَأَنْشَأَ رَجُلٌ كَانَ إِذَا لَاحَى يُدْعَى إِلَى غَيْرِ أَبِيهِ فَقَالَ يَا نَبِيَّ اللَّهِ مَنْ أَبِي فَقَالَ أَبُوكَ حُذَافَةُ ثُمَّ أَنْشَأَ عُمَرُ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا نَعُوذُ بِاللَّهِ مِنْ سُوءِ الْفِتَنِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا رَأَيْتُ فِي الْخَيْرِ وَالشَّرِّ كَالْيَوْمِ قَطُّ إِنَّهُ صُوِّرَتْ لِي الْجَنَّةُ وَالنَّارُ حَتَّى رَأَيْتُهُمَا دُونَ الْحَائِطِ فَكَانَ قَتَادَةُ يَذْكُرُ هَذَا الْحَدِيثَ عِنْدَ هَذِهِ الْآيَةِ{ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ }وَقَالَ عَبَّاسٌ النَّرْسِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ حَدَّثَنَا قَتَادَةُ أَنَّ أَنَسًا حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا وَقَالَ كُلُّ رَجُلٍ لَافًّا رَأْسَهُ فِي ثَوْبِهِ يَبْكِي وَقَالَ عَائِذًا بِاللَّهِ مِنْ سُوءِ الْفِتَنِ أَوْ قَالَ أَعُوذُ بِاللَّهِ مِنْ سَوْأَى الْفِتَنِ و قَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ وَمُعْتَمِرٌ عَنْ أَبِيهِ عَنْ قَتَادَةَ أَنَّ أَنَسًا حَدَّثَهُمْ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا وَقَالَ عَائِذًا بِاللَّهِ مِنْ شَرِّ الْفِتَنِ",
                "id": "Telah menceritakan kepada kami [Mu'adz bin Fadhalah] telah menceritakan kepada kami [Hisyam] dari [Qotadah] dari [Anas] radliallahu 'anhu mengatakan, para sahabat banyak bertanya kepada Nabi shallallahu 'alaihi wasallam sehingga mereka setengah memaksa dengan pertanyaan-pertanyaan. Maka Nabi shallallahu 'alaihi wasallam suatu hari naik ke mimbar dan bersabda: \"Tidaklah kalian bertanya kepadaku mengenai sesuatu, selain kujelaskan kepada kalian, \" lantas aku melihat ke kanan-kiri, tak tahunya setiap orang membungkus kepalanya di pakaiannya sambil menangis, muncullah seseorang yang jika berdebat dia dipanggil dengan nasab selain ayahnya, orang itu berujar; 'Wahai Nabiyullah siapakah ayahku? ' Nabi menjawab: \"ayahmu adalah Hudzafah.\" Kontan Umar bergegas mengucapkan; 'RADHIINA BILLAHI RABBAN WABIL ISLAAMI DIINAN WABI MUHAMMADIN RASUULAN NA'UUDZU BILLAH MIN SUUIL FITANI (Kami ridha Allah sebagai rabb, Islam sebagai agama, dan Muhammad sebagai utusan, kami berlindung kepada Allah dari keburukan fitnah), \" Nabi shallallahu 'alaihi wasallam bersabda; \"Sama sekali belum pernah kulihat keburukan dan kebaikan seperti hari ini, sebab hari ini surga dan neraka digambarkan kepadaku sehingga aku melihat kedua-duanya dibalik dinding ini.\" Dan Qatadah selalu menyebutkan hadits ini berkaitan dengan ayat: 'Wahai orang-orang yang beriman, janganlah kalian bertanya tentang sesuatu yang sekiranya diungkapkan kepada kalian, justru malah menyusahkan kalian (QS. Almaidah; 101). [Abbas An Narsi] mengatakan, Telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] telah menceritakan kepada kami [Qotadah], bahwasanya [Anas] menceritakan kepada mereka; bahwa Nabiyullah Shallallahu'alaihiwasallam besabda masalah ini dengan redaksi: Setiap orang membungkus kepalanya dalam bajunya sambil menangis, dan ia mengatakan dengan redaksi: 'aaidzan billah min suu'il fitan (aku berlindung kepada Allah dari keburukan fitnah) atau ia mengatakan; 'a'uudzu billah min sau`atil fitan (Saya berlindung kepada Allah dari keburukan-keburukan fitnah). Sedang [Khalifah] mengatakan kepadaku Telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dan [Mu'tamir] dari [ayahnya] dari [Qotadah], bahwasanya [Anas] menceritakan kepada mereka, dari Nabi shallallahu 'alaihi wasallam dengan Hadits ini dan dia mengatakan dengan redaksi; 'aaidzan billah min syarril fitan (berlindung kepada Allah dari keburukan fitnah)."
            },
            {
                "number": 6229,
                "arab": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَامَ إِلَى جَنْبِ الْمِنْبَرِ فَقَالَ الْفِتْنَةُ هَا هُنَا الْفِتْنَةُ هَا هُنَا مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ أَوْ قَالَ قَرْنُ الشَّمْسِ",
                "id": "telah menceritakan kepadaku [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam bin Yusuf] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, bahwasanya beliau berdiri ke samping minbar dan bersabda: \"Fitnah muncul disini, fitnah muncul disini, (yaitu) dimana tempat tanduk setan muncul, \" atau beliau mengatakan: \"tanduk matahari.\""
            },
            {
                "number": 6230,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُسْتَقْبِلٌ الْمَشْرِقَ يَقُولُ أَلَا إِنَّ الْفِتْنَةَ هَا هُنَا مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Nafi'] dari [Ibnu 'Umar] radliallahu 'anhuma, ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda yang ketika itu beliau menghadap timur: \"Ketahuilah, bahawasanya fitnah muncul dari sini, yaitu tempat tanduk setan muncul.\""
            },
            {
                "number": 6231,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ عَنْ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَذَكَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَارِكْ لَنَا فِي شَأْمِنَا اللَّهُمَّ بَارِكْ لَنَا فِي يَمَنِنَا قَالُوا يَا رَسُولَ اللَّهِ وَفِي نَجْدِنَا قَالَ اللَّهُمَّ بَارِكْ لَنَا فِي شَأْمِنَا اللَّهُمَّ بَارِكْ لَنَا فِي يَمَنِنَا قَالُوا يَا رَسُولَ اللَّهِ وَفِي نَجْدِنَا فَأَظُنُّهُ قَالَ فِي الثَّالِثَةِ هُنَاكَ الزَّلَازِلُ وَالْفِتَنُ وَبِهَا يَطْلُعُ قَرْنُ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Azhar bin Sa'd] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] mengatakan, Nabi shallallahu 'alaihi wasallam pernah memanjatkan doa; \"Ya Allah, berilah kami barakah dalam Syam kami, ya Allah, berilah kami barakah dalam Yaman kami.\" Para sahabat berkata; 'ya Rasulullah, dan juga dalam Nejed kami! ' Rasulullah Shallallahu'alaihiwasallam membaca doa: \"Ya Allah, berilah kami barakah dalam Syam kami, ya Allah, berilah kami barakah dalam Yaman kami.\" Para sahabat berkata; 'Ya Rasulullah, juga dalam Nejed kami! ' dan seingatku, pada kali ketiga, beliau bersabda; \"Disanalah muncul keguncangan dan fitnah, dan disanalah tanduk setan muncul.\""
            },
            {
                "number": 6232,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ شَاهِينَ الْوَاسِطِيُّ حَدَّثَنَا خَالِدٌ عَنْ بَيَانٍ عَنْ وَبَرَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ خَرَجَ عَلَيْنَا عَبْدُ اللَّهِ بْنُ عُمَرَفَرَجَوْنَا أَنْ يُحَدِّثَنَا حَدِيثًا حَسَنًا قَالَ فَبَادَرَنَا إِلَيْهِ رَجُلٌ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ حَدِّثْنَا عَنْ الْقِتَالِ فِي الْفِتْنَةِ وَاللَّهُ يَقُولُ{ وَقَاتِلُوهُمْ حَتَّى لَا تَكُونَ فِتْنَةٌ }فَقَالَ هَلْ تَدْرِي مَا الْفِتْنَةُ ثَكِلَتْكَ أُمُّكَ إِنَّمَا كَانَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَاتِلُ الْمُشْرِكِينَ وَكَانَ الدُّخُولُ فِي دِينِهِمْ فِتْنَةً وَلَيْسَ كَقِتَالِكُمْ عَلَى الْمُلْكِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Syahin Al Wasithi] telah menceritakan kepada kami [Khalid] dari [Bayan] dari [Wabarah bin Abdurrahman] dari [Sa'id bin Jubair] mengatakan, [Abdullah bin Umar] menemui kami, kami sangat berharap agar ia menceritakan kepada kami sebuah pembicaraan yang baik. Tiba-tiba ada seorang laki-laki yang mendahului kami menemuinya dan berujar; 'ya Abu Abdurrahman, ceritakanlah kepada kami sebuah cerita tentang peperangan dalam fitnah yang telah Allah firmankan: 'Dan perangilah mereka hingga tak ada lagi fitnah di muka bumi' (QS. Albaqarah; 193). Maka Abdullah bin Umar bertanya; 'Apakah kamu tahu apa fitnah itu, duhai malangnya ibumu kehilangan dirimu, Dahulu Muhammad Shallallahu'alaihiwasallam memerangi orang-orang musyrik dan siapa saja yang memasuki agama mereka (pindah agama) itulah yang dimaksud fitnah, dan fitnah maksudnya bukanlah peperangan kalian terhadap para raja (penguasa)."
            },
            {
                "number": 6233,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا شَقِيقٌ سَمِعْتُ حُذَيْفَةَ يَقُولُبَيْنَا نَحْنُ جُلُوسٌ عِنْدَ عُمَرَ إِذْ قَالَ أَيُّكُمْ يَحْفَظُ قَوْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْفِتْنَةِ قَالَ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَوَلَدِهِ وَجَارِهِ تُكَفِّرُهَا الصَّلَاةُ وَالصَّدَقَةُ وَالْأَمْرُ بِالْمَعْرُوفِ وَالنَّهْيُ عَنْ الْمُنْكَرِ قَالَ لَيْسَ عَنْ هَذَا أَسْأَلُكَ وَلَكِنْ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْرِ قَالَ لَيْسَ عَلَيْكَ مِنْهَا بَأْسٌ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا قَالَ عُمَرُ أَيُكْسَرُ الْبَابُ أَمْ يُفْتَحُ قَالَ بَلْ يُكْسَرُ قَالَ عُمَرُ إِذًا لَا يُغْلَقَ أَبَدًا قُلْتُ أَجَلْ قُلْنَا لِحُذَيْفَةَ أَكَانَ عُمَرُ يَعْلَمُ الْبَابَ قَالَ نَعَمْ كَمَا يَعْلَمُ أَنَّ دُونَ غَدٍ لَيْلَةً وَذَلِكَ أَنِّي حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالْأَغَالِيطِ فَهِبْنَا أَنْ نَسْأَلَهُ مَنْ الْبَابُ فَأَمَرْنَا مَسْرُوقًا فَسَأَلَهُ فَقَالَ مَنْ الْبَابُ قَالَ عُمَرُ",
                "id": "Telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyats] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Syaqiq] Aku mendengar [Khudzaifah] menuturkan; ketika kami duduk-duduk bersama Umar, tiba-tiba ia bertanya; 'Siapa diantara kalian yang menghapal sabda Nabi shallallahu 'alaihi wasallam tentang fitnah? ' maka Khudzaifah menjawab; 'Fitnah seseorang di keluarganya, hartanya dan anaknya serta tetangganya bisa terhapus oleh sholat, sedekah, dan amar ma'ruf nahyi mungkar.' Umar berkata; 'Bukan tentang ini yang aku tanyakan kepadamuakan tetapi tentang (fitnah) yang bergelombang seperti gelombang lautan.' Khudzaifah berkata; 'kamu tidak terkena dampaknya dari fitnah itu ya amirul mukminin, sebab antara kamu dan fitnah itu terdapat pintu tertutup.' Umar bertanya; 'Apakah pintunya dipecahkan atau dibuka? ' Khudzaifah menjawab; 'bahkan di pecahkan.' Maka Umar berkata; 'kalau begitu tidak ditutup selama-lamanya.' aku menjawab; 'Betul.' Saya bertanya kepada Khudzaifah; 'Apakah Umar mengetahui pintu itu? ' Khudzaifah menjawab; 'Ya, sebagaimana ia mengetahui bahwa setelah esok ada malam, yang demikian itu karena aku menceritakan Hadits kepadanya dengan tanpa kekeliruan, maka kami khawatir untuk menanyakan kepada Umar siapa pintu sebenarnya.' lalu kami perintahkan kepada Masruq untuk bertanya kepada Khudzaifah; (siapakah pintu itu), Khudzaifah menjawab; 'Umar.'"
            },
            {
                "number": 6234,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا إِلَى حَائِطٍ مِنْ حَوَائِطِ الْمَدِينَةِ لِحَاجَتِهِ وَخَرَجْتُ فِي إِثْرِهِ فَلَمَّا دَخَلَ الْحَائِطَ جَلَسْتُ عَلَى بَابِهِ وَقُلْتُ لَأَكُونَنَّ الْيَوْمَ بَوَّابَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَأْمُرْنِي فَذَهَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَضَى حَاجَتَهُ وَجَلَسَ عَلَى قُفِّ الْبِئْرِ فَكَشَفَ عَنْ سَاقَيْهِ وَدَلَّاهُمَا فِي الْبِئْرِ فَجَاءَ أَبُو بَكْرٍ يَسْتَأْذِنُ عَلَيْهِ لِيَدْخُلَ فَقُلْتُ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ فَوَقَفَ فَجِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا نَبِيَّ اللَّهِ أَبُو بَكْرٍ يَسْتَأْذِنُ عَلَيْكَ قَالَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ فَدَخَلَ فَجَاءَ عَنْ يَمِينِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَشَفَ عَنْ سَاقَيْهِ وَدَلَّاهُمَا فِي الْبِئْرِ فَجَاءَ عُمَرُ فَقُلْتُ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ فَجَاءَ عَنْ يَسَارِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَشَفَ عَنْ سَاقَيْهِ فَدَلَّاهُمَا فِي الْبِئْرِ فَامْتَلَأَ الْقُفُّ فَلَمْ يَكُنْ فِيهِ مَجْلِسٌ ثُمَّ جَاءَ عُثْمَانُ فَقُلْتُ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ مَعَهَا بَلَاءٌ يُصِيبُهُ فَدَخَلَ فَلَمْ يَجِدْ مَعَهُمْ مَجْلِسًا فَتَحَوَّلَ حَتَّى جَاءَ مُقَابِلَهُمْ عَلَى شَفَةِ الْبِئْرِ فَكَشَفَ عَنْ سَاقَيْهِ ثُمَّ دَلَّاهُمَا فِي الْبِئْرِ فَجَعَلْتُ أَتَمَنَّى أَخًا لِي وَأَدْعُو اللَّهَ أَنْ يَأْتِيَقَالَ ابْنُ الْمُسَيَّبِ فَتَأَوَّلْتُ ذَلِكَ قُبُورَهُمْ اجْتَمَعَتْ هَا هُنَا وَانْفَرَدَ عُثْمَانُ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] Telah mengabarkan kepada kami [Muhammad bin Ja'far] dari [Syarik bin Abdullah] dari [Sa'id bin Al Musayyab] dari [Abu Musa Al Asy'ari] menuturkan, Nabi shallallahu 'alaihi wasallam suatu hari keluar ke sebuah kebun Madinah untuk suatu keperluannya, dan aku mengikuti di belakang beliau. Tatkala beliau masuk kebun, aku duduk di pintunya dan kukatakan dalam hati; 'Hari ini aku menjadi penjaga pintu Nabi shallallahu 'alaihi wasallam sekalipun beliau tidak memerintahkanku.' Nabi shallallahu 'alaihi wasallam terus pergi dan menuntaskan hajatnya, beliau duduk diatas emper sumur dan menyingkap kedua betisnya dan memasukkan keduanya ke dalam sumur (kolam). Abu Bakar datang dan meminta izin kepada beliau untuk masuk, maka aku berkata; 'kamu tetap di tempatmu sampai aku meminta izin untukmu! ' Abu bakar pun berhenti hingga aku menemui Nabi shallallahu 'alaihi wasallam dan kukatakan; 'ya Nabiyullah, Abu Bakar memintamu izin kepadamu.' Nabi menjawab: \"berilah dia izin, dan berilah kabar gembira kepadanya dengan surga!\" Abu bakar pun masuk kebun dan datang dari sebelah kanan Nabi shallallahu 'alaihi wasallam. Lalu ia menyingkap kedua betisnya dan masukkannya kedalam sumur (kolam). Kemudian datanglah Umar, maka aku berkata; 'kamu tetap di tempatmu sampai aku meminta izin untukmu! ' Nabi shallallahu 'alaihi wasallam lantas berkata; \"Berilah dia izin, dan berilah kabar gembira dengan surga, \" maka dia pun datang dari sebelah kiri Nabi shallallahu 'alaihi wasallam dan menyingkap kedua betisnya kemudian memasukkannya kedalam sumur, maka emperan sumur telah menjadi sesak, sehingga tak ada lagi ruangan sumur yang luang. Kemudian datanglah Utsman, maka aku katakan 'kamu tetap di tempatmu sampai aku meminta izin untukmu! ' Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Berilah dia izin, dan berilah kabar gembira dengan surga, dan bersama surga itu terdapat malapetaka yang akan menimpanya.\" Utsman pun masuk tetapi dia tidak menemukan tempat duduk bersama mereka maka dia pun berputar sehingga datang dari arah depan mereka di mulut sumur (kolam), kemudian dia menyingkap kedua betisnya dan memasukkan kedua kakinya kedalam sumur. Maka aku berkhayal saudaraku, dan aku berdoa kepada Allah agar cepat-cepat datang. Ibnul Musayyab berkata; 'maka aku takwilkan dari peristiwa itu, kuburan mereka akan menyatu disini, sedang kuburan Utsman akan tersendiri."
            },
            {
                "number": 6235,
                "arab": "حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ سَمِعْتُ أَبَا وَائِلٍ قَالَ قِيلَ لِأُسَامَةَأَلَا تُكَلِّمُ هَذَا قَالَ قَدْ كَلَّمْتُهُ مَا دُونَ أَنْ أَفْتَحَ بَابًا أَكُونُ أَوَّلَ مَنْ يَفْتَحُهُ وَمَا أَنَا بِالَّذِي أَقُولُ لِرَجُلٍ بَعْدَ أَنْ يَكُونَ أَمِيرًا عَلَى رَجُلَيْنِ أَنْتَ خَيْرٌ بَعْدَ مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُجَاءُ بِرَجُلٍ فَيُطْرَحُ فِي النَّارِ فَيَطْحَنُ فِيهَا كَطَحْنِ الْحِمَارِ بِرَحَاهُ فَيُطِيفُ بِهِ أَهْلُ النَّارِ فَيَقُولُونَ أَيْ فُلَانُ أَلَسْتَ كُنْتَ تَأْمُرُ بِالْمَعْرُوفِ وَتَنْهَى عَنْ الْمُنْكَرِ فَيَقُولُ إِنِّي كُنْتُ آمُرُ بِالْمَعْرُوفِ وَلَا أَفْعَلُهُ وَأَنْهَى عَنْ الْمُنْكَرِ وَأَفْعَلُهُ",
                "id": "Telah menceritakan kepadaku [Bisyr bin Khalid] Telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Sulaiman], aku mendengar [Abu Wa`il] berkata, pernah ditanyakan kepada [Usamah]; 'kenapa engkau tidak mengajak bicara orang ini? ' Usamah menjawab; 'Aku telah mengajak biacara orang itu, dan sekarang aku tidak mau membuka pembicaraan yang aku menjadi orang pertama-tama yang membukanya, dan aku tidak akan mengatakan kepada seseorang yang telah menjadi pemimpin terhadap dua orang; 'Engkau lebih baik', setelah aku mendengar dari Rasulullah Shallallahu'alaihiwasallam bersabda; \"akan didatangkan seseorang, kemudian dia dilempar ke dalam neraka, lantas disana ia berputar-putar sebagaimana keledai menarik alat penggilingan, maka penghuni neraka mengelilingi orang tersebut dan bertanya; 'Hai fulan, bukankah kamu dahulu pernah memerintahkan kebaikan dan melarang kemungkaran? ' Ia menjawab; 'ya, saya dahulu memerintah kebaikan, namun aku tidak mengerjakannya, dan aku melarang kemungkaran, namun justru aku melakkannya.'\""
            },
            {
                "number": 6236,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ حَدَّثَنَا عَوْفٌ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَلَقَدْ نَفَعَنِي اللَّهُ بِكَلِمَةٍ أَيَّامَ الْجَمَلِ لَمَّا بَلَغَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ فَارِسًا مَلَّكُوا ابْنَةَ كِسْرَى قَالَ لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمْ امْرَأَةً",
                "id": "Telah menceritakan kepada kami [Utsman bin Al Haitsam] telah menceritakan kepada kami ['Auf] dari [Al Hasan] dari [Abu Bakrah] mengatakan; Dikala berlangsung hari-hari perang jamal, aku telah memperoleh pelajaran dari pesan baginda Nabi, tepatnya ketika beliau Shallallahu'alaihiwasallam tahu kerajaan Persia mengangkat anak perempuan Kisra sebagai raja, beliau langsung bersabda: \"Tak akan baik keadaan sebuah kaum yang mengangkat wanita sebagai pemimpin urusan mereka.\""
            },
            {
                "number": 6237,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ حَدَّثَنَا أَبُو حَصِينٍ حَدَّثَنَا أَبُو مَرْيَمَ عَبْدُ اللَّهِ بْنُ زِيَادٍ الْأَسَدِيُّ قَالَلَمَّا سَارَ طَلْحَةُ وَالزُّبَيْرُ وَعَائِشَةُ إِلَى الْبَصْرَةِ بَعَثَ عَلِيٌّ عَمَّارَ بْنَ يَاسِرٍ وَحَسَنَ بْنَ عَلِيٍّ فَقَدِمَا عَلَيْنَا الْكُوفَةَ فَصَعِدَا الْمِنْبَرَ فَكَانَ الْحَسَنُ بْنُ عَلِيٍّ فَوْقَ الْمِنْبَرِ فِي أَعْلَاهُ وَقَامَ عَمَّارٌ أَسْفَلَ مِنْ الْحَسَنِ فَاجْتَمَعْنَا إِلَيْهِ فَسَمِعْتُ عَمَّارًا يَقُولُ إِنَّ عَائِشَةَ قَدْ سَارَتْ إِلَى الْبَصْرَةِ وَ وَاللَّهِ إِنَّهَا لَزَوْجَةُ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الدُّنْيَا وَالْآخِرَةِ وَلَكِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى ابْتَلَاكُمْ لِيَعْلَمَ إِيَّاهُ تُطِيعُونَ أَمْ هِيَ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Abu Bakar bin 'Iyyasy] telah menceritakan kepada kami [Abu Hashin] telah menceritakan kepada kami [Abu Maryam Abdullah bin Ziyad Al Asadi] menuturkan; Tatkala Thalhah, Zubair dan 'Aisyah berangkat ke Bashrah, Ali mengutus 'Ammar bin Yasir dan Hasan bin Ali mendatangi Kami di Kufah, lantas keduanya naik minbar. Ketika itu Al Hasan bin Ali diatas minbar di tangga paling atas, sedang Ammar berdiri dibawah Al Hasan, kami berkumpul di sekelilingnya, dan aku mendengar ['Ammar] mengatakan; 'Aisyah tengah berangkat ke Bashrah, demi Allah, ia adalah isteri Nabi kalian (Shallallahu'alaihiwasallam) di dunia dan di akherat, namun Allah Tabaraka wata'ala menguji kalian agar Dia mengetahui, apakah kalian taat kepada-NYA atau kepada Aisyah.'"
            },
            {
                "number": 6238,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ عَنْ الْحَكَمِ عَنْ أَبِي وَائِلٍ قَامَ عَمَّارٌعَلَى مِنْبَرِ الْكُوفَةِ فَذَكَرَ عَائِشَةَ وَذَكَرَ مَسِيرَهَا وَقَالَ إِنَّهَا زَوْجَةُ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الدُّنْيَا وَالْآخِرَةِ وَلَكِنَّهَا مِمَّا ابْتُلِيتُمْ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ibnu Abi Ghaniyyah] dari [Al Hakam] dari [Abu Wa`il]; ['Ammar] berdiri diatas minbar Kufah, lantas ia menyebut Aisyah dan keberangkatannya, dan ia berkta; 'Ia adalah isteri Nabi kalian (shallallahu 'alaihi wasallam) di dunia dan akherat, namun ia adalah diantara perkara yang kalian diuji dengannya.'"
            },
            {
                "number": 6239,
                "arab": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي عَمْرٌو سَمِعْتُ أَبَا وَائِلٍ يَقُولُدَخَلَ أَبُو مُوسَى وَأَبُو مَسْعُودٍ عَلَى عَمَّارٍ حَيْثُ بَعَثَهُ عَلِيٌّ إِلَى أَهْلِ الْكُوفَةِ يَسْتَنْفِرُهُمْ فَقَالَا مَا رَأَيْنَاكَ أَتَيْتَ أَمْرًا أَكْرَهَ عِنْدَنَا مِنْ إِسْرَاعِكَ فِي هَذَا الْأَمْرِ مُنْذُ أَسْلَمْتَ فَقَالَ عَمَّارٌ مَا رَأَيْتُ مِنْكُمَا مُنْذُ أَسْلَمْتُمَا أَمْرًا أَكْرَهَ عِنْدِي مِنْ إِبْطَائِكُمَا عَنْ هَذَا الْأَمْرِ وَكَسَاهُمَا حُلَّةً حُلَّةً ثُمَّ رَاحُوا إِلَى الْمَسْجِدِ",
                "id": "Telah menceritakan kepada kami [Badal bin Al Muhabbar] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepada kami ['Amru] aku mendengar [Abu Wa`il] mengatakan; [Abu Musa] dan [Abu Mas'ud] menemui ['Ammar] ketika ia diutus Ali ke Kufah untuk mengajak masyarakat Kufah ikut dalam barisannya, lantas keduanya mengatakan kepada Ammar; 'Kami belum pernah melihatmu melakukan sesuatu yang lebih kami benci daripada kesegeraanmu dalam masalah ini semenjak kamu masuk Islam.' 'Ammar lantas menjawab; 'Dan Saya belum pernah melihat kamu berdua melakukan sesuatu yang lebih saya benci daripada keterlambatan kalian mengikuti urusan ini, ' lantas Ammar memberi keduanya masing-masing satu pakaian, kemudian mereka bertiga pergi ke masjid."
            },
            {
                "number": 6240,
                "arab": "حَدَّثَنَا عَبْدَانُ عَنْ أَبِي حَمْزَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقِ بْنِ سَلَمَةَكُنْتُ جَالِسًا مَعَ أَبِي مَسْعُودٍ وَأَبِي مُوسَى وَعَمَّارٍ فَقَالَ أَبُو مَسْعُودٍ مَا مِنْ أَصْحَابِكَ أَحَدٌ إِلَّا لَوْ شِئْتُ لَقُلْتُ فِيهِ غَيْرَكَ وَمَا رَأَيْتُ مِنْكَ شَيْئًا مُنْذُ صَحِبْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْيَبَ عِنْدِي مِنْ اسْتِسْرَاعِكَ فِي هَذَا الْأَمْرِ قَالَ عَمَّارٌ يَا أَبَا مَسْعُودٍ وَمَا رَأَيْتُ مِنْكَ وَلَا مِنْ صَاحِبِكَ هَذَا شَيْئًا مُنْذُ صَحِبْتُمَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْيَبَ عِنْدِي مِنْ إِبْطَائِكُمَا فِي هَذَا الْأَمْرِ فَقَالَ أَبُو مَسْعُودٍ وَكَانَ مُوسِرًا يَا غُلَامُ هَاتِ حُلَّتَيْنِ فَأَعْطَى إِحْدَاهُمَا أَبَا مُوسَى وَالْأُخْرَى عَمَّارًا وَقَالَ رُوحَا فِيهِ إِلَى الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami ['Abdan] dari [Abu Hamzah] dari [Al A'masy] dari [Syaqiq bin Salamah], aku pernah duduk bersama [Abu mas'ud] dan [Abu Musa] dan ['Ammar], Abu Mas'ud berkata; 'Tak ada seorangpun dari sahabatmu yang jika aku berkenan pasti aku berkomentar tentangnya kecuali kamu, dan belum pernah kulihat sesuatu darimu yang lebih tercela bagiku semenjak kamu bersahabat dengan Nabi shallallahu 'alaihi wasallam daripada kesegeraanmu ikut serta masalah ini.' Ammar menjawab; 'Wahai Abu mas'ud, dan aku tidak pernah melihat sesuatu darimu dan juga dari para sahabatmu sesuatu yang lebih tercela bagiku semenjak engkau bersahabat dengan Nabi shallallahu 'alaihi wasallam selain keterlambatanmu ikut serta dalam masalah ini.' Lantas Abu mas'ud mengatakan -yang ketika itu ia lapang rezekinya-; 'hai anak kecil, tolong ambilkan dua pakaian untuk kedua orang ini, ' satunya untuk Abu Musa, dan satunya untuk Ammar, lantas ia berujar; 'Berangkatlah kalian berdua untuk melaksanakan sholat jum'at.'"
            },
            {
                "number": 6241,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ سَمِعَ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَنْزَلَ اللَّهُ بِقَوْمٍ عَذَابًا أَصَابَ الْعَذَابُ مَنْ كَانَ فِيهِمْ ثُمَّ بُعِثُوا عَلَى أَعْمَالِهِمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Utsman], Telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] telah mengabarkan kepada kami [Hamzah bin Abdullah bin Umar], ia mendengar [Ibnu Umar] radliallahu 'anhuma mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Allah menurunkan adzab, maka adzab itu akan mengenai siapa saja yang berada ditengah-tengah mereka, lantas mereka dihisab sesuai amalan mereka.\""
            },
            {
                "number": 6242,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا إِسْرَائِيلُ أَبُو مُوسَىوَلَقِيتُهُ بِالْكُوفَةِ وَجَاءَ إِلَى ابْنِ شُبْرُمَةَ فَقَالَ أَدْخِلْنِي عَلَى عِيسَى فَأَعِظَهُ فَكَأَنَّ ابْنَ شُبْرُمَةَ خَافَ عَلَيْهِ فَلَمْ يَفْعَلْ قَالَ حَدَّثَنَا الْحَسَنُ قَالَ لَمَّا سَارَ الْحَسَنُ بْنُ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا إِلَى مُعَاوِيَةَ بِالْكَتَائِبِ قَالَ عَمْرُو بْنُ الْعَاصِ لِمُعَاوِيَةَ أَرَى كَتِيبَةً لَا تُوَلِّي حَتَّى تُدْبِرَ أُخْرَاهَا قَالَ مُعَاوِيَةُ مَنْ لِذَرَارِيِّ الْمُسْلِمِينَ فَقَالَ أَنَا فَقَالَ عَبْدُ اللَّهِ بْنُ عَامِرٍ وَعَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ نَلْقَاهُ فَنَقُولُ لَهُ الصُّلْحَ قَالَ الْحَسَنُ وَلَقَدْ سَمِعْتُ أَبَا بَكْرَةَ قَالَ بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ جَاءَ الْحَسَنُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنِي هَذَا سَيِّدٌ وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنْ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Isra'il Abu Musa] dan aku menemuinya di Kufah, lantas Israil Abu Musa menemui Ibnu Syubrumah dan mengatakan; 'pertemukanlah aku dengan Isa sehingga aku bisa menasehatinya, ' namun seolah-olah Ibnu Syubrumah takut keadanya sehingga tidak dilakukannya. Dia menjelaskan; telah menceritakan kepada kami [Al Hasan] ia menuturkan; tatkala Al Hasan bin Ali radliallahu 'anhuma berangkat menemui Mu'awiyah dengan pasukannya, 'Amru bin 'Ash berkata kepada mu'awiyah; 'Aku melihat pasukan yang tak akan melarikan diri hingga pasukan musuhnya yang justru terpukul mundur.' Kata Mu'awiyah; 'Lantas siapa nanti yang akan mengurus anak-anak kaum muslimin? ' 'Saya' Jawab Amru bin 'ash. Abdullah bin Amir dan Abdurrahman bin Samurah mengatakan; 'Lebih baik kita menemuinya, dan kita katakan kepadanya; 'Mari kita berdamai, ' Al Hasan berkata; telah kudengar [Abu Bakrah] mengatakan; Ketika Nabi shallallahu 'alaihi wasallam berkhutbah, Al Hasan datang, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Anakku ini adalah penghulu, dan mudah-mudahan Allah mendamaikan dua kubu kaum muslimin yang bersengketa melalui dia.\""
            },
            {
                "number": 6243,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ قَالَ قَالَ عَمْرٌو أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيٍّ أَنَّ حَرْمَلَةَ مَوْلَى أُسَامَةَ أَخْبَرَهُ قَالَ عَمْرٌو قَدْ رَأَيْتُ حَرْمَلَةَ قَالَ أَرْسَلَنِي أُسَامَةُإِلَى عَلِيٍّ وَقَالَ إِنَّهُ سَيَسْأَلُكَ الْآنَ فَيَقُولُ مَا خَلَّفَ صَاحِبَكَ فَقُلْ لَهُ يَقُولُ لَكَ لَوْ كُنْتَ فِي شِدْقِ الْأَسَدِ لَأَحْبَبْتُ أَنْ أَكُونَ مَعَكَ فِيهِ وَلَكِنَّ هَذَا أَمْرٌ لَمْ أَرَهُ فَلَمْ يُعْطِنِي شَيْئًا فَذَهَبْتُ إِلَى حَسَنٍ وَحُسَيْنٍ وَابْنِ جَعْفَرٍ فَأَوْقَرُوا لِي رَاحِلَتِي",
                "id": "Telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] mengatakan, ['Amru] mengatakan, Telah mengabarkan kepadaku [Muhammad bin Ali], bahwasanya [Harmalah] maula Usamah mengabarkan kepadanya. 'Amru berkata; aku pernah melihat Harmalah mengatakan; [Usamah] mengutusku menemui Ali, dan dia mengatakan; 'Sesungguhnya Ali pasti akan bertanya kepadamu sekarang, dia berkata; 'Apa yang menyebabkan kawanmu tidak berangkat bersama aku? ' maka katakan kepadanya; 'kalaulah aku dalam mulut singa, niscaya aku ingin bersamamu, namun ini adalah sebuah masalah yang belum pernah kulihat sama sekali sebelumnya.' Ali tidak memberiku perbekalan apa-apa, karenanya aku pun pergi ke Al Hasan dan Al Husain serta Ibnu Ja'far, dan mereka memberi perbekalan-perbekalan diatas kendaraanku."
            },
            {
                "number": 6244,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ قَالَلَمَّا خَلَعَ أَهْلُ الْمَدِينَةِ يَزِيدَ بْنَ مُعَاوِيَةَ جَمَعَ ابْنُ عُمَرَ حَشَمَهُ وَوَلَدَهُ فَقَالَ إِنِّي سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُنْصَبُ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ وَإِنَّا قَدْ بَايَعْنَا هَذَا الرَّجُلَ عَلَى بَيْعِ اللَّهِ وَرَسُولِهِ وَإِنِّي لَا أَعْلَمُ غَدْرًا أَعْظَمَ مِنْ أَنْ يُبَايَعَ رَجُلٌ عَلَى بَيْعِ اللَّهِ وَرَسُولِهِ ثُمَّ يُنْصَبُ لَهُ الْقِتَالُ وَإِنِّي لَا أَعْلَمُ أَحَدًا مِنْكُمْ خَلَعَهُ وَلَا بَايَعَ فِي هَذَا الْأَمْرِ إِلَّا كَانَتْ الْفَيْصَلَ بَيْنِي وَبَيْنَهُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] mengatakan, dikala Penduduk Madinah memecat Yazid bin Mu'awiyah, [Ibnu Umar] mengumpulkan kerabat dan anak-anaknya lantas mengatakan; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda; \"Setiap pengkhianat diberi bendera pada hari kiamat, dan saya telah membaiat orang ini untuk berjanji setia kepada Allah dan rasul-NYA, dan saya tidak tahu pengkhianatan lebih besar daripada seseorang yang dibai'at untuk berjanji setia kepada Allah dan rasul-Nya kemudian ia diberi bendera untuk perang, dan aku tidak tahu salah seorang diantara kalian jika melepaskan baiatnya, atau tidak pula ia berbaiat dalam urusan ini, melainkan antara aku dan dia ada batas pemisah.\""
            },
            {
                "number": 6245,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا أَبُو شِهَابٍ عَنْ عَوْفٍ عَنْ أَبِي الْمِنْهَالِ قَالَلَمَّا كَانَ ابْنُ زِيَادٍ وَمَرْوَانُ بِالشَّأْمِ وَوَثَبَ ابْنُ الزُّبَيْرِ بِمَكَّةَ وَوَثَبَ الْقُرَّاءُ بِالْبَصْرَةِ فَانْطَلَقْتُ مَعَ أَبِي إِلَى أَبِي بَرْزَةَ الْأَسْلَمِيِّ حَتَّى دَخَلْنَا عَلَيْهِ فِي دَارِهِ وَهُوَ جَالِسٌ فِي ظِلِّ عُلِّيَّةٍ لَهُ مِنْ قَصَبٍ فَجَلَسْنَا إِلَيْهِ فَأَنْشَأَ أَبِي يَسْتَطْعِمُهُ الْحَدِيثَ فَقَالَ يَا أَبَا بَرْزَةَ أَلَا تَرَى مَا وَقَعَ فِيهِ النَّاسُ فَأَوَّلُ شَيْءٍ سَمِعْتُهُ تَكَلَّمَ بِهِ إِنِّي احْتَسَبْتُ عِنْدَ اللَّهِ أَنِّي أَصْبَحْتُ سَاخِطًا عَلَى أَحْيَاءِ قُرَيْشٍ إِنَّكُمْ يَا مَعْشَرَ الْعَرَبِ كُنْتُمْ عَلَى الْحَالِ الَّذِي عَلِمْتُمْ مِنْ الذِّلَّةِ وَالْقِلَّةِ وَالضَّلَالَةِ وَإِنَّ اللَّهَ أَنْقَذَكُمْ بِالْإِسْلَامِ وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَلَغَ بِكُمْ مَا تَرَوْنَ وَهَذِهِ الدُّنْيَا الَّتِي أَفْسَدَتْ بَيْنَكُمْ إِنَّ ذَاكَ الَّذِي بِالشَّأْمِ وَاللَّهِ إِنْ يُقَاتِلُ إِلَّا عَلَى الدُّنْيَا وَإِنَّ هَؤُلَاءِ الَّذِينَ بَيْنَ أَظْهُرِكُمْ وَاللَّهِ إِنْ يُقَاتِلُونَ إِلَّا عَلَى الدُّنْيَا وَإِنْ ذَاكَ الَّذِي بِمَكَّةَ وَاللَّهِ إِنْ يُقَاتِلُ إِلَّا عَلَى الدُّنْيَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Abu Syihab] dari ['Auf] dari [Abu Minhal] mengatakan, tatkala Ibnu Ziyad dan Marwan di Syam, dan Ibnu Zubair membelot di Makkah, dan Al qurra' membelot di Bashrah, Aku berangkat bersama ayahku ke [Abu Barzah Al Aslami] hingga kami menemuinya di rumahnya sedang duduk di tempat tinggi yang terbuat dari kayu, kami pun duduk bersamanya, ayahku lantas meminta petuah-petuah Hadits seraya mengatakan; 'Wahai Abu Barzah, bukankah telah kau lihat sendiri kemelut yang melanda manusia? ' yang pertama-tama kudengar dari yang diucapkannya ialah; 'Saya semata-mata mengharap pahala disisi Allah, sungguh saya sangat marah kepada orang quraisy, sesungguhnya kalian wahai segenap bangsa arab, dahulu keadaan kalian seperti telah kau kenal sendiri sedemikian hina, minoritas dan sesat, kemudian Allah menyelamatkan kalian dengan Islam dan Muhammad Shallallahu'alaihiwasallam hingga kalian memperoleh seperti yang kalian lihat sendiri. Dan inilah dunia yang merusak diantara kalian. Dan sesungguhnya yang terjadi di Syam, demi Allah, tidaklah mereka berperang selain karena duniawi, dan mereka yang berada ditengah-tengah kalian, demi Allah mereka juga tidak berperang selain karena duniawi, dan mereka yang berada di Makkah, demi Allah, mereka tidak berperang selain karena duniawi.'"
            },
            {
                "number": 6246,
                "arab": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ حَدَّثَنَا شُعْبَةُ عَنْ وَاصِلٍ الْأَحْدَبِ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ قَالَإِنَّ الْمُنَافِقِينَ الْيَوْمَ شَرٌّ مِنْهُمْ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا يَوْمَئِذٍ يُسِرُّونَ وَالْيَوْمَ يَجْهَرُونَ",
                "id": "Telah menceritakan kepada kami [Adam bin Abi Iyas] telah menceritakan kepada kami [Syu'bah] dari [Washil Al Ahdab] dari [Abu Wa`il] dari [Khudzaifah bin Yaman] mengatakan; 'kaum munafikin hari ini jauh lebih buruk daripada mereka yang hidup di masa Nabi shallallahu 'alaihi wasallam, sebab dahulu mereka sembunyi-sembunyi, namun sekarang mereka lakukan secara terang-terangan.'"
            },
            {
                "number": 6247,
                "arab": "حَدَّثَنَا خَلَّادٌ حَدَّثَنَا مِسْعَرٌ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أَبِي الشَّعْثَاءِ عَنْ حُذَيْفَةَ قَالَإِنَّمَا كَانَ النِّفَاقُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّا الْيَوْمَ فَإِنَّمَا هُوَ الْكُفْرُ بَعْدَ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Khallad] telah menceritakan kepada kami [Mis'ar] dari [Habib bin Abi Tsabit] dari [Abu Sya'sya`] dari [Khudzaifah] mengatakan; 'Kemunafikan itu terjadi dimasa Nabi shallallahu 'alaihi wasallam, adapun yang terjadi hari ini adalah kekufuran setelah keimanan.'"
            },
            {
                "number": 6248,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ يَا لَيْتَنِي مَكَانَهُ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepadaku [Malik] dari [Abu Zanad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Hari kiamat tidak akan terjadi sehingga seseorang melewati kuburan seseorang, lantas mengatakan; 'duhai sekiranya aku menggantikan dia.'\""
            },
            {
                "number": 6249,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ أَخْبَرَنِي أَبُو هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى تَضْطَرِبَ أَلَيَاتُ نِسَاءِ دَوْسٍ عَلَى ذِي الْخَلَصَةِ وَذُو الْخَلَصَةِ طَاغِيَةُ دَوْسٍ الَّتِي كَانُوا يَعْبُدُونَ فِي الْجَاهِلِيَّةِ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] mengatakan, [Said bin Al Musayyab] mengatakan, telah mengabarkan kepadaku [Abu Hurairah] radliallahu 'anhu, bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hari kiamat tidak akan tiba sehingga pantat-pantat wanita daus berjoget pada Dzul khulashah, dan Dzul khulashah ialah thaghut suku Daus yang mereka sembah di masa jahiliyah.\""
            },
            {
                "number": 6250,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي سُلَيْمَانُ عَنْ ثَوْرٍ عَنْ أَبِي الْغَيْثِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ رَجُلٌ مِنْ قَحْطَانَ يَسُوقُ النَّاسَ بِعَصَاهُ",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah], telah menceritakan kepadaku [Sulaiman] dari [Tsaur] dari [Abul Ghaits] dari [Abu Hurairah], bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hari kiamat tidak akan tiba hingga seseorang dari kabilah Qahthan menggiring manusia dengan tongkatnya.\""
            },
            {
                "number": 6251,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ أَخْبَرَنِي أَبُو هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى تَخْرُجَ نَارٌ مِنْ أَرْضِ الْحِجَازِ تُضِيءُ أَعْنَاقَ الْإِبِلِ بِبُصْرَى",
                "id": "Telah menceritakan kepada kami [Abul yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri]; [Sa'id bin Al Musayyab] mengatakan, telah mengabarkan kepadaku [Abu Hurairah] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hari kiamat tidak akan tiba hingga api keluar dari tanah Hejaz yang bisa menyinari tengkuk unta di Bushra.\""
            },
            {
                "number": 6252,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَدِّهِ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلَا يَأْخُذْ مِنْهُ شَيْئًاقَالَ عُقْبَةُ وَحَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id Al Kindi] telah menceritakan kepada kami ['Uqbah bin Khalid] telah menceritakan kepada kami [ubaidhullah] dari [Khubaib bin Abdurrahman] dari [Kakeknya, Hafsh bin 'Ashim] dari [Abu Hurairah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak lama lagi Eufrat tersingkap perbendaharaan-perbendaharaan emasnya, maka barangsiapa mendatanginya, jangan ia mengambilnya sedikitpun.\" Kata [Uqbah]; telah menceritakan kepada kami [ubaidhullah] telah menceritakan kepada kami [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam semisal hadits diatas, hanyasanya dia mengatakan dengan redaksi; \"tersingkap gunung emas.\""
            },
            {
                "number": 6253,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ حَدَّثَنَا مَعْبَدٌ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَصَدَّقُوا فَسَيَأْتِي عَلَى النَّاسِ زَمَانٌ يَمْشِي الرَّجُلُ بِصَدَقَتِهِ فَلَا يَجِدُ مَنْ يَقْبَلُهَاقَالَ مُسَدَّدٌ حَارِثَةُ أَخُو عُبَيْدِ اللَّهِ بْنِ عُمَرَ لِأُمِّهِ قَالَهُ أَبُو عَبْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] telah menceritakan kepada kami [Ma'bad] aku mendengar [Haritsah bin Wahb] mengatakan; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersedekahlah kalian, sebab akan Datang kepada manusia suatu zaman yang ketika itu seseorang berjalan membawa sedekahnya namun dia tidak menemukan seseorang yang mau menerima sedekahnya.\" Kata Musaddad, Haritsah adalah saudara ubaidhullah bin Umar seibu, demikian Abu Abdullah mengatakan."
            },
            {
                "number": 6254,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى تَقْتَتِلَ فِئَتَانِ عَظِيمَتَانِ يَكُونُ بَيْنَهُمَا مَقْتَلَةٌ عَظِيمَةٌ دَعْوَتُهُمَا وَاحِدَةٌ وَحَتَّى يُبْعَثَ دَجَّالُونَ كَذَّابُونَ قَرِيبٌ مِنْ ثَلَاثِينَ كُلُّهُمْ يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ وَحَتَّى يُقْبَضَ الْعِلْمُ وَتَكْثُرَ الزَّلَازِلُ وَيَتَقَارَبَ الزَّمَانُ وَتَظْهَرَ الْفِتَنُ وَيَكْثُرَ الْهَرْجُ وَهُوَ الْقَتْلُ وَحَتَّى يَكْثُرَ فِيكُمْ الْمَالُ فَيَفِيضَ حَتَّى يُهِمَّ رَبَّ الْمَالِ مَنْ يَقْبَلُ صَدَقَتَهُ وَحَتَّى يَعْرِضَهُ عَلَيْهِ فَيَقُولَ الَّذِي يَعْرِضُهُ عَلَيْهِ لَا أَرَبَ لِي بِهِ وَحَتَّى يَتَطَاوَلَ النَّاسُ فِي الْبُنْيَانِ وَحَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ يَا لَيْتَنِي مَكَانَهُ وَحَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتْ وَرَآهَا النَّاسُ يَعْنِي آمَنُوا أَجْمَعُونَ فَذَلِكَ حِينَ{ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا }وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ نَشَرَ الرَّجُلَانِ ثَوْبَهُمَا بَيْنَهُمَا فَلَا يَتَبَايَعَانِهِ وَلَا يَطْوِيَانِهِ وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ انْصَرَفَ الرَّجُلُ بِلَبَنِ لِقْحَتِهِ فَلَا يَطْعَمُهُ وَلَتَقُومَنَّ السَّاعَةُ وَهُوَ يُلِيطُ حَوْضَهُ فَلَا يَسْقِي فِيهِ وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ رَفَعَ أُكْلَتَهُ إِلَى فِيهِ فَلَا يَطْعَمُهَا",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] telah menceritakan kepada kami [Abu Az Zanad] dari ['Abdurrahman] dari [Abu Hurairah], bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hari kiamat tidak akan terjadi sehingga dua kelompok besar terjadi pembunuhan besar-besaran padahal ajakan keduanya satu, hingga muncul para pendusta yang kurang lebihnya tiga puluh, kesemuanya mengaku ia utusan Allah, hingga ilmu diangkat, banyak keguncangan, zaman terasa singkat, fitnah muncul dimana-mana, dan banyak alharaj, yaitu pembunuhan, hingga ditengah-tengah kalian harta melimpah ruah dan berlebihan, sehingga pemilik harta mencari-cari orang yang mau menerima sedekahnya, sampai ia menawar-nawarkan sedekahnya, namun orang yang ditawari mengelak seraya mengatakan ' Aku tak butuh sedekahmu', sehingga manusia berlomba-lomba meninggikan bangunan, sehingga seseorang melewati kuburan seseorang dan mengatakan; 'Aduhai sekiranya aku menggantikannya', hingga matahari terbit dari sebelah barat, padahal jika matahari telah terbit dari sebelah barat dan manusia melihatnya, mereka semua beriman, pada saat itulah sebagaimana ayat; 'Ketika itu tidak bermanfaat lagi bagi seseorang keimanannya, yang ia belum beriman sebelumnya atau belum mengerjakan kebaikan dengan keimanannya.\" (QS. Al an'am 158), dan hari kiamat terjadi ketika dua orang telah menyerahkan kedua bajunya tetapi keduanya tidak jadi melakukan jual beli, keduanya tidak jadi melipatnya, dan hari kiamat terjadi sedang seseorang telah pulang membawa susu sapinya tetapi tidak jadi ia meminumnya, dan hari kiamat terjadi ketika seseorang memperbaiki kolam (tempat minum) nya tetai dia tak jadi meminumnya, dan hari kiamat terjadi sedang seseorang telah mengangkat suapannya tetapi dia tidak jadi menyantapnya.\""
            },
            {
                "number": 6255,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي قَيْسٌ قَالَ قَالَ لِي الْمُغِيرَةُ بْنُ شُعْبَةَمَا سَأَلَ أَحَدٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّجَّالِ أَكْثَرَ مَا سَأَلْتُهُ وَإِنَّهُ قَالَ لِي مَا يَضُرُّكَ مِنْهُ قُلْتُ لِأَنَّهُمْ يَقُولُونَ إِنَّ مَعَهُ جَبَلَ خُبْزٍ وَنَهَرَ مَاءٍ قَالَ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Isma'il] telah menceritakan kepadaku [Qais] mengatakan, [Mughirah bin Syu'bah] mengatakan kepadaku; Tak seorangpun yang lebih banyak bertanya kepada Nabi shallallahu 'alaihi wasallam tentang Dajjal daripadaku, dan beliau bersabda kepadaku: \"Dia tidak membahayakanmu', Saya katakan; 'Yang demikian karena orang-orang mengatakan bahwa Dajjal membawa gunung roti dan sungai yang berair.' Nabi bersabda: \"Itu semua bagi Allah lebih sepele.\""
            },
            {
                "number": 6256,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأُرَاهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَعْوَرُ عَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu 'Umar], seingatku dia dari Nabi shallallahu 'alaihi wasallam bersabda; \"Dajjal buta matanya sebelah kanan, seolah-olah matanya buah anggur yang menjorok.\""
            },
            {
                "number": 6257,
                "arab": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجِيءُ الدَّجَّالُ حَتَّى يَنْزِلَ فِي نَاحِيَةِ الْمَدِينَةِ ثُمَّ تَرْجُفُ الْمَدِينَةُ ثَلَاثَ رَجَفَاتٍ فَيَخْرُجُ إِلَيْهِ كُلُّ كَافِرٍ وَمُنَافِقٍ",
                "id": "Telah menceritakan kepada kami [Sa'ad bin Hafsh] telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Ishaq bin Abdullah bin Abi Thalhah] dari [Anas bin Malik] mengatakan, Nabi shallallahu 'alaihi wasallam bersabda; \"Dajjal datang hingga singgah di pinggiran Madinah kemudian Madinah guncang tiga kali, sehingga setiap kafir dan munafik menemuinya.\""
            },
            {
                "number": 6258,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِي بَكْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ وَلَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ عَلَى كُلِّ بَابٍ مَلَكَانِ",
                "id": "Telah menceritakan kepada kami ['Abdul 'Aziz bin Abdullah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [ayahnya] dari [kakeknya] dari [Abu Bakrah] dari Nabi shallallahu 'alaihi wasallam bersabda; \"Kemelut al Masih ad dajjal tak akan memasuki Madinah, sebab ketika itu Madinah mempunyai tujuh pintu yang setiap pintu dijaga oleh dua malaikat.\""
            },
            {
                "number": 6259,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا مِسْعَرٌ حَدَّثَنَا سَعْدُ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ عَلَى كُلِّ بَابٍ مَلَكَانِقَالَ وَقَالَ ابْنُ إِسْحَاقَ عَنْ صَالِحِ بْنِ إِبْرَاهِيمَ عَنْ أَبِيهِ قَالَ قَدِمْتُ الْبَصْرَةَ فَقَالَ لِي أَبُو بَكْرَةَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Mis'ar] telah menceritakan kepada kami [Sa'd bin Ibrahim] dari [ayahnya] dari [Abu Bakrah] dari Nabi shallallahu 'alaihi wasallam bersabda; \"Kemelut al masih ad dajjal tak akan memasuki Madinah, sebab ketika itu Madinah mempunyai tujuh pintu yang setiap pintunya dijaga oleh dua malaikat.\" Dia berkata, [Ibnu Ishaq] mengatakan dari [Salih bin Ibrahim] dari [ayahnya] mengatakan, aku mendatangi Bashrah lantas [Abu Bakrah] mengatakan kepadaku; aku dengar Nabi shallallahu 'alaihi wasallam bersabda sama dengan Hadits ini."
            },
            {
                "number": 6260,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا إِبْرَاهِيمُ عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسِ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ ذَكَرَ الدَّجَّالَ فَقَالَ إِنِّي لَأُنْذِرُكُمُوهُ وَمَا مِنْ نَبِيٍّ إِلَّا وَقَدْ أَنْذَرَهُ قَوْمَهُ وَلَكِنِّي سَأَقُولُ لَكُمْ فِيهِ قَوْلًا لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ إِنَّهُ أَعْوَرُ وَإِنَّ اللَّهَ لَيْسَ بِأَعْوَرَ",
                "id": "Telah menceritakan kepada kami [Abdul 'Aziz bin Abdullah], Telah menceritakan kepada kami [Ibrahim] dari [Shalih] dari [Ibnu Syihab] dari [Salim bin Abdullah] bahwasanya [Abdullah bin Umar] radliallahu 'anhu mengatakan, Rasulullah Shallallahu'alaihiwasallam berdiri di tengah-tengah para sahabat lantas memuji Allah dengan pujian selayaknya bagi-Nya, kemudian beliau menyebut-nyebut dajjal dan mengatakan; \"Sungguh saya mengingatkan kalian tentang dajjal, dan tidak ada seorang pun Nabi melainkan telah mengingatkan kaumnya tentang dajjal, dan akan saya jelaskan kepada kalian tentangnya suatu hal yang belum pernah dijelaskan oleh seorang Nabi shallallahu 'alaihi wasallam pun kepada kaumnya, sesungguhnya dajjal itu buta sebelah sedang Allah tidak buta sebelah.\""
            },
            {
                "number": 6261,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَا أَنَا نَائِمٌ أَطُوفُ بِالْكَعْبَةِ فَإِذَا رَجُلٌ آدَمُ سَبْطُ الشَّعَرِ يَنْطُفُ أَوْ يُهَرَاقُ رَأْسُهُ مَاءً قُلْتُ مَنْ هَذَا قَالُوا ابْنُ مَرْيَمَ ثُمَّ ذَهَبْتُ أَلْتَفِتُ فَإِذَا رَجُلٌ جَسِيمٌ أَحْمَرُ جَعْدُ الرَّأْسِ أَعْوَرُ الْعَيْنِ كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ قَالُوا هَذَا الدَّجَّالُ أَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ رَجُلٌ مِنْ خُزَاعَةَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Salim] dari ['Abdullah bin Umar], bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku bermimpi thawaf di ka'bah, tak tahunya ada seseorang yang rambutnya lurus, kepalanya meneteskan atau mengalirkan air. Maka saya bertanya; 'siapakah ini? ' Mereka mengatakan; 'Ini Isa bin maryam'. Kemudian aku menoleh, tak tahunya ada seseorang yang berbadan besar, warnanya kemerah-merahan, rambutnya keriting, matanya buta sebelah kanan, seolah-olah matanya anggur yang menjorok. Mereka menjelaskan; 'Sedang ini adalah dajjal, manusia yang paling mirip dengannya adalah Ibnu Qaththan, laki-laki dari bani Khuza'ah.'\""
            },
            {
                "number": 6262,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَعِيذُ فِي صَلَاتِهِ مِنْ فِتْنَةِ الدَّجَّالِ",
                "id": "Telah menceritakan kepada kami ['Abdul Aziz bin Abdullah], telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Shalih] dari [Ibnu Syihab] dari ['Urwah], bahwasanya ['Aisyah] radliallahu 'anha mengatakan; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam selalu meminta perlindungan dari fitnah dajjal dalam sholatnya.\""
            },
            {
                "number": 6263,
                "arab": "حَدَّثَنَا عَبْدَانُ أَخْبَرَنِي أَبِي عَنْ شُعْبَةَ عَنْ عَبْدِ الْمَلِكِ عَنْ رِبْعِيٍّ عَنْ حُذَيْفَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الدَّجَّالِ إِنَّ مَعَهُ مَاءً وَنَارًا فَنَارُهُ مَاءٌ بَارِدٌ وَمَاؤُهُ نَارٌقَالَ أَبُو مَسْعُودٍ أَنَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Abdan] telah mengabarkan kepadaku [Ayahku] dari [Syu'bah] dari ['Abdul Malik] dari [Rib'i] dari [Khudzaifah] dari Nabi shallallahu 'alaihi wasallam bersabda tentang dajjal; \"Ia membawa air dan api, yang kelihatan api adalah air dingin, dan yang kelihatan air adalah api.\" Dan [Abu Mas'ud] mengatakan; aku mendengarnya dari Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 6264,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بُعِثَ نَبِيٌّ إِلَّا أَنْذَرَ أُمَّتَهُ الْأَعْوَرَ الْكَذَّابَ أَلَا إِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ وَإِنَّ بَيْنَ عَيْنَيْهِ مَكْتُوبٌ كَافِرٌفِيهِ أَبُو هُرَيْرَةَ وَابْنُ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Qotadah] dari [Anas] radliallahu 'anhu mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang Nabi pun diutus selain telah memperingatkan kaumnya terhadap yang buta sebelah dan pendusta, ketahuilah bahwasanya dajjal itu buta sebelah, sedang rabb kalian tidak buta sebelah, tertulis diantara kedua matanya KAFIR.\" Tentang Hadits ini, juga ada riwayat dari Abu Hurairah dan Ibnu Abbas dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 6265,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ أَبَا سَعِيدٍ قَالَحَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا حَدِيثًا طَوِيلًا عَنْ الدَّجَّالِ فَكَانَ فِيمَا يُحَدِّثُنَا بِهِ أَنَّهُ قَالَ يَأْتِي الدَّجَّالُ وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ فَيَنْزِلُ بَعْضَ السِّبَاخِ الَّتِي تَلِي الْمَدِينَةَ فَيَخْرُجُ إِلَيْهِ يَوْمَئِذٍ رَجُلٌ وَهُوَ خَيْرُ النَّاسِ أَوْ مِنْ خِيَارِ النَّاسِ فَيَقُولُ أَشْهَدُ أَنَّكَ الدَّجَّالُ الَّذِي حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَهُ فَيَقُولُ الدَّجَّالُ أَرَأَيْتُمْ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ هَلْ تَشُكُّونَ فِي الْأَمْرِ فَيَقُولُونَ لَا فَيَقْتُلُهُ ثُمَّ يُحْيِيهِ فَيَقُولُ وَاللَّهِ مَا كُنْتُ فِيكَ أَشَدَّ بَصِيرَةً مِنِّي الْيَوْمَ فَيُرِيدُ الدَّجَّالُ أَنْ يَقْتُلَهُ فَلَا يُسَلَّطُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] Telah mengabarkan kepada kami ['ubaidhullah bin Abdullah bin Utbah bin Mas'ud], bahwasanya [Abu Sa'id] mengatakan, Suatu hari Rasulullah Shallallahu'alaihiwasallam menceritakan kepada kami suatu Hadits panjang tentang dajjal, diantara yang beliau ceritakan kepada kami saat itu ialah, beliau bersabda: \"dajjal datang dan diharamkan masuk jalan Madinah, lantas ia singgah di lokasi yang tak ada tetumbuhan dekat Madinah, kemudian ada seseorang yang mendatanginya yang ia adalah sebaik-baik manusia atau diantara manusia terbaik, dia berkata; 'saya bersaksi bahwa engkau adalah dajjal, yang Rasulullah Shallallahu'alaihiwasallam telah ceritakan kepada kami.' Kemudian dajjal mengatakan; 'Apa pendapat kalian jika aku membunuh orang ini lantas aku menghidupkannya, apakah kalian masih ragu terhadap perkara ini? ' Mereka menjawab; 'tidak'. Maka Dajjal membunuh orang tersebut kemudian menghidupkannya, namun orang tersebut tiba-tiba mengatakan; 'Ketahuilah bahwa hari ini, kewaspadaanku terhadap diriku tidak sebesar kewaspadaanku terhadapmu! ' Lantas dajjal ingin membunuh orang itu, namun ia tak bisa lagi menguasainya.\""
            },
            {
                "number": 6266,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَنْقَابِ الْمَدِينَةِ مَلَائِكَةٌ لَا يَدْخُلُهَا الطَّاعُونُ وَلَا الدَّجَّالُ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Nu'aim bin Abdullah Al Mujmir] dari [Abu Hurairah] menuturkan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jalan-jalan Madinah dijaga oleh para malaikat, sehingga kota itu tidak bisa dimasuki wabah tha'un ataupun dajjal.\""
            },
            {
                "number": 6267,
                "arab": "حَدَّثَنِي يَحْيَى بْنُ مُوسَى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَدِينَةُ يَأْتِيهَا الدَّجَّالُ فَيَجِدُ الْمَلَائِكَةَ يَحْرُسُونَهَا فَلَا يَقْرَبُهَا الدَّجَّالُ قَالَ وَلَا الطَّاعُونُ إِنْ شَاءَ اللَّهُ",
                "id": "telah menceritakan kepadaku [Yahya bin Musa] telah menceritakan kepada kami [Yazid bin harun] telah mengabarkan kepada kami [Syu'bah] dari [Qotadah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Madinah akan didatangi Dajjal, namun ia mendapati para malaikat yang menjaganya sehingga Dajjal tak bisa mendekatinya.\" kata Anas; \"tidak pula penyakit Tha'un insya Allah.\""
            },
            {
                "number": 6268,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ ح و حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي أَخِي عَنْ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ حَدَّثَتْهُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ عَنْ زَيْنَبَ بِنْتِ جَحْشٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا يَوْمًا فَزِعًا يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ وَحَلَّقَ بِإِصْبَعَيْهِ الْإِبْهَامِ وَالَّتِي تَلِيهَا قَالَتْ زَيْنَبُ بِنْتُ جَحْشٍ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ نَعَمْ إِذَا كَثُرَ الْخُبْثُ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] -lewat jalur periwayatan lain-- telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Saudaraku] dari [Sulaiman] dari [Muhammad bin Abu 'Atiq] dari [Ibnu syihab] dari ['Urwah bin Zubair], bahwasanya [Zainab binti Abu Salamah] menceritakan kepadanya dari [Ummi habibah binti Sufyan], dari [Zainab binti Jahsy], Rasulullah Shallallahu'alaihiwasallam suatu hari menemuinya dengan gusar seraya mengatakan: \"Celaka bangsa arab dari keburukan yang telah dekat, hari ini telah dibuka benteng ya'juj dan Ma'juj seperti ini, \" seraya beliau melingkarkan kedua jarinya, telunjuk dan jempol. Zainab binti Jahsy mengatakan, maka aku bertanya; 'Apakah kita akan juga dibinasakan padahal ditengah-tengah kami masih ada orang-orang shalih? ' Nabi menjawab: \"Iya, jika kejahatan telah merajalela.\""
            },
            {
                "number": 6269,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُفْتَحُ الرَّدْمُ رَدْمُ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ وَعَقَدَ وُهَيْبٌ تِسْعِينَ",
                "id": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Abu Hurairah] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Benteng ya'juj dan ma'juj dibuka seperti ini.\" Wuhaib mengilustrasikan jarinya dengan membentuk sembilan puluh."
            },
            {
                "number": 6270,
                "arab": "حَدَّثَنَا عَبْدَانُ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ وَمَنْ أَطَاعَ أَمِيرِي فَقَدْ أَطَاعَنِي وَمَنْ عَصَى أَمِيرِي فَقَدْ عَصَانِي",
                "id": "Telah menceritakan kepada kami [Abdan] telah mengabarkan kepada kami [Abdullah] dari [Yunus] dari [Al Karmani] telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman], ia mendengar [Abu Hurairah] radliallahu 'anhu berkata, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mentaatiku berarti ia mentaati Allah, sebaliknya barangsiapa membangkang terhadapku, ia membangkang Allah, dan barangsiapa mentaatiku amirku berarti ia mentaatiku, dan barangsiapa membangkang amirku, berarti ia membangkang terhadapku.\""
            },
            {
                "number": 6271,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا كُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ فَالْإِمَامُ الَّذِي عَلَى النَّاسِ رَاعٍ وَهُوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهُوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ وَالْمَرْأَةُ رَاعِيَةٌ عَلَى أَهْلِ بَيْتِ زَوْجِهَا وَوَلَدِهِ وَهِيَ مَسْئُولَةٌ عَنْهُمْ وَعَبْدُ الرَّجُلِ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهُوَ مَسْئُولٌ عَنْهُ أَلَا فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ",
                "id": "Telah menceritakan kepada kami [Ismail] Telah menceritakan kepadaku [Malik] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] radliallahu 'anhuma, Rasulullah shallallahu 'alaihi wasallam bersabda: \"ketahuilah Setiap kalian adalah pemimpin, dan setiap kalian akan dimintai pertanggungjawabannya atas yang di pimpin, penguasa yang memimpin rakyat banyak dia akan dimintai pertanggungjawaban atas yang dipimpinnya, setiap kepala keluarga adalah pemimpin anggota keluarganya dan dia dimintai pertanggungjawaban atas yang dipimpinnya, dan isteri pemimpin terhadap keluarga rumah suaminya dan juga anak-anaknya, dan dia akan dimintai pertanggungjawabannya terhadap mereka, dan budak seseorang juga pemimpin terhadap harta tuannya dan akan dimintai pertanggungjawaban terhadapnya, ketahuilah, setiap kalian adalah bertanggung jawab atas yang dipimpinnya.\""
            },
            {
                "number": 6272,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ كَانَ مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ يُحَدِّثُ أَنَّهُ بَلَغَ مُعَاوِيَةَوَهُوَ عِنْدَهُ فِي وَفْدٍ مِنْ قُرَيْشٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو يُحَدِّثُ أَنَّهُ سَيَكُونُ مَلِكٌ مِنْ قَحْطَانَ فَغَضِبَ فَقَامَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّهُ بَلَغَنِي أَنَّ رِجَالًا مِنْكُمْ يُحَدِّثُونَ أَحَادِيثَ لَيْسَتْ فِي كِتَابِ اللَّهِ وَلَا تُوثَرُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُولَئِكَ جُهَّالُكُمْ فَإِيَّاكُمْ وَالْأَمَانِيَّ الَّتِي تُضِلُّ أَهْلَهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ هَذَا الْأَمْرَ فِي قُرَيْشٍ لَا يُعَادِيهِمْ أَحَدٌ إِلَّا كَبَّهُ اللَّهُ فِي النَّارِ عَلَى وَجْهِهِ مَا أَقَامُوا الدِّينَتَابَعَهُ نُعَيْمٌ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرٍ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] mengatakan, [Muhammad bin Jubair] menceritakan, [Mu'awiyah] mendapat informasi -ketika itu Jubair berada disampingnya-saat berada dalam rombongan quraisy, bahwa Abdullah bin Amru menceritakan, bahwa dirinya akan menjadi raja Qahthan. Spontan Mu'awiyah murka, ia berdiri dan memanjatkan puji-pujian kepada Allah dengan pujian semestinya, kemudian mengatakan; 'Amma ba'd. Telah sampai berita kepadaku bahwa beberapa orang diantara kalian menceritakan hadist yang tidak terdapat dalam kitabullah dan tidak pula berasal dari Rasulullah Shallallahu'alaihiwasallam, mereka itu adalah orang-orang jahil kalian, jauhilah olehmu angan-angan yang menyesatkan pemiliknya, sebab aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"'Kepemimpinan ini tetap berada di quraisy, tidaklah seseorang memusuhi mereka, selain Allah menelungkupkannya dalam neraka diatas wajahnya, selama mereka menegakkan agama.\" hadist ini dikuatkan oleh [Nu'aim] dari [Ibnul Mubarak] dari [Ma'mar] dari [Az Zuhri] dari [Muhammad Ibnu Jubair]."
            },
            {
                "number": 6273,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ سَمِعْتُ أَبِي يَقُولُ قَالَ ابْنُ عُمَرَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ هَذَا الْأَمْرُ فِي قُرَيْشٍ مَا بَقِيَ مِنْهُمْ اثْنَانِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami ['Ashim bin Muhammad], aku mendengar [Ayahku] mengatakan; [Ibnu Umar] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Urusan kepemimpinan ini berada di quraisy, sekalipun mereka tinggal dua.\""
            },
            {
                "number": 6274,
                "arab": "حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ عَنْ إِسْمَاعِيلَ عَنْ قَيْسٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالًا فَسَلَّطَهُ عَلَى هَلَكَتِهِ فِي الْحَقِّ وَآخَرُ آتَاهُ اللَّهُ حِكْمَةً فَهُوَ يَقْضِي بِهَا وَيُعَلِّمُهَا",
                "id": "Telah menceritakan kepada kami [Syihab bin Ibad] telah menceritakan kepada kami [Ibrahim bin Humaid] dari [Ismail] dari [Qais] dari [Abdullah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak diperbolehkan iri kecuali dalam dua hal, seseorang yang Allah memberinya harta, lantas ia belanjakan untuk al haq, dan seseorang yang Allah beri hikmah, kemudian ia pergunakan untuk memutuskan hukum dan ia ajarkan.\""
            },
            {
                "number": 6275,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنْ أَبِي التَّيَّاحِ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْمَعُوا وَأَطِيعُوا وَإِنْ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ كَأَنَّ رَأْسَهُ زَبِيبَةٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] dari [Abu tayyah] dari [Anas bin Malik] radliallahu 'anhu mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dengarlah dan taatilah sekalipun yang memimpin kalian adalah seorang budak habsyi, seolah-olah kepalanya gimbal.\""
            },
            {
                "number": 6276,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ الْجَعْدِ عَنْ أَبِي رَجَاءٍ عَنْ ابْنِ عَبَّاسٍ يَرْوِيهِ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَأَى مِنْ أَمِيرِهِ شَيْئًا فَكَرِهَهُ فَلْيَصْبِرْ فَإِنَّهُ لَيْسَ أَحَدٌ يُفَارِقُ الْجَمَاعَةَ شِبْرًا فَيَمُوتُ إِلَّا مَاتَ مِيتَةً جَاهِلِيَّةً",
                "id": "Telah menceritakan kepada kami [Sulaiman bin harb] telah menceritakan kepada kami [Hammad] dari [Al Ja'd] dari [Abu Raja'] dari [Ibnu 'Abbas] yang ia riwayatkan, mengatakan, Nabi shallallahu 'alaihi wasallam bersabda; \"Siapa yang melihat dari amirnya sesuatu yang tidak disukainya, hendaklah ia bersabar, sebab tidaklah seseorang meninggalkan jama'ah sejauh sejengkal, lantas ia meninggal dunia, melainkan ia mati jahiliyah.\""
            },
            {
                "number": 6277,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ السَّمْعُ وَالطَّاعَةُ عَلَى الْمَرْءِ الْمُسْلِمِ فِيمَا أَحَبَّ وَكَرِهَ مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلَا سَمْعَ وَلَا طَاعَةَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari ['ubaidhullah] Telah menceritakan kepadaku [Nafi'] dari [Abdullah] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam bersabda: \"mendengar dan taat adalah wajib bagi setiap muslim, baik yang ia sukai maupun yang tidak ia sukai, selama ia tidak diperintahkan melakukan kemaksiatan, adapun jika ia diperintahkan melakukan maksiat, maka tidak ada hak mendengar dan menaati.\""
            },
            {
                "number": 6278,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا سَعْدُ بْنُ عُبَيْدَةَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَبَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً وَأَمَّرَ عَلَيْهِمْ رَجُلًا مِنْ الْأَنْصَارِ وَأَمَرَهُمْ أَنْ يُطِيعُوهُ فَغَضِبَ عَلَيْهِمْ وَقَالَ أَلَيْسَ قَدْ أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُطِيعُونِي قَالُوا بَلَى قَالَ قَدْ عَزَمْتُ عَلَيْكُمْ لَمَا جَمَعْتُمْ حَطَبًا وَأَوْقَدْتُمْ نَارًا ثُمَّ دَخَلْتُمْ فِيهَا فَجَمَعُوا حَطَبًا فَأَوْقَدُوا نَارًا فَلَمَّا هَمُّوا بِالدُّخُولِ فَقَامَ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ قَالَ بَعْضُهُمْ إِنَّمَا تَبِعْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِرَارًا مِنْ النَّارِ أَفَنَدْخُلُهَا فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ خَمَدَتْ النَّارُ وَسَكَنَ غَضَبُهُ فَذُكِرَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَوْ دَخَلُوهَا مَا خَرَجُوا مِنْهَا أَبَدًا إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ",
                "id": "Telah menceritakan kepada kami ['Umar bin hafs bin Ghiyats] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Sa'd bin Ubaidah] dari [Abu Abdurrahman] dari ['Ali] radliallahu 'anhu mengatakan, Nabi shallallahu 'alaihi wasallam mengutus sebuah ekspedisi dan mengangkat sahabat anshar sebagai pemimpin mereka, dan beliau perintahkan mereka untuk menaatinya. Selanjutnya sahabat anshar marah dan mengatakan; \"Bukankah Rasulullah Shallallahu'alaihiwasallam telah memerintahkan kaian untuk mentaatiku?\" 'Ya' Jawab mereka. Sahabat anshar meneruskan; \"Karena itu, aku ingin jika kalian mengumpulkan kayu bakar dan menyalakan api, kemudian kalian masuk kedalamnya.\" Mereka pun mengumpulkan kayu bakar dan menyalakan api. Tatkala mereka ingin memasukinya, satu sama lain saling memandang. Sebagian mengatakan; 'bukankah kita ikut Nabi shallallahu 'alaihi wasallam untuk menjauhkan diri dari api, apakah (sekarang) kita ingin memasukinya? ' Tatkala mereka dalam keadaan seperti itu, tiba-tiba api padam dan kemarahannya mereda. Maka hal ini disampaikan kepada Nabi shallallahu 'alaihi wasallam lantas Nabi mengatakan; \"Kalaulah mereka memasukinya, niscaya mereka tidak bisa keluar dari api tersebut selama-lamanya\"."
            },
            {
                "number": 6279,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَأْتِ الَّذِي هُوَ خَيْرٌ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Jarir bin Hazim] dari [Al Hasan] dari [Abdurrahman bin Samurah] mengatakan, Nabi shallallahu 'alaihi wasallam berkata kepadaku: \"Wahai Abdurrahman bin Samurah, janganlah kamu meminta jabatan, sebab jika kamu diberi jabatan dengan tanpa meminta, maka kamu akan ditolong, dan jika kamu diberinya karena meminta, maka kamu akan ditelantarkan, dan jika kamu bersumpah, lantas kamu lihat ada suatu yang lebih baik, maka bayarlah kafarat sumpahmu dan lakukanlah yang lebih baik.\""
            },
            {
                "number": 6280,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لَا تَسْأَلْ الْإِمَارَةَ فَإِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ",
                "id": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami ['Abdl Warits] telah menceritakan kepada kami [Yunus] dari [Al Hasan] mengatkan telah menceritakan kepadaku [Abdurrahman bin Samurah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Abdurrahman bin Samurah, janganlah kamu meminta jabatan, sebab jika kamu diberi jabatan dengan meminta, maka kamu akan ditelantarkan, dan jika kamu diberi dengan tanpa meminta, maka kamu akan diotolong, dan jika kamu melakukan suatu sumpah, lantas kau lihat selainnya lebih baik, maka lakukanlah yang lebih baik dan bayarlah kafarat sumpahmu.\""
            },
            {
                "number": 6281,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّكُمْ سَتَحْرِصُونَ عَلَى الْإِمَارَةِ وَسَتَكُونُ نَدَامَةً يَوْمَ الْقِيَامَةِ فَنِعْمَ الْمُرْضِعَةُ وَبِئْسَتْ الْفَاطِمَةُوَقَالَ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حُمْرَانَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ عُمَرَ بْنِ الْحَكَمِ عَنْ أَبِي هُرَيْرَةَ قَوْلَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"kalian akan rakus terhadap jabatan, padahal jabatan itu akan menjadi penyesalan dihari kiamat, ia adalah seenak-enak penyusuan dan segetir-getir penyapihan.\" [Muhamad bin Basyar] berkata; telah menceritakan kepada kami [Abdullah bin Humran] telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Sa'id Al Maqburi] dari [Umar bin Al Hakam] dari [Abu Hurairah] seperti diatas. "
            },
            {
                "number": 6282,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَدَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَرَجُلَانِ مِنْ قَوْمِي فَقَالَ أَحَدُ الرَّجُلَيْنِ أَمِّرْنَا يَا رَسُولَ اللَّهِ وَقَالَ الْآخَرُ مِثْلَهُ فَقَالَ إِنَّا لَا نُوَلِّي هَذَا مَنْ سَأَلَهُ وَلَا مَنْ حَرَصَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] radliallahu 'anhu mengatakan; aku menemui Nabi shallallahu 'alaihi wasallam bersama dua orang kaumku, lantas satu diantara kedua orang itu mengatakan; 'Jadikanlah kami pejabat ya Rasulullah? ' orang kedua juga mengatakan yang sama. Secara spontan Rasulullah Shallallahu'alaihiwasallam bersabda; \"Kami tidak akan memberikan jabatan ini kepada orang yang memintanya, tidak juga kepada orang yang ambisi terhadapnya.\""
            },
            {
                "number": 6283,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ الْحَسَنِأَنَّ عُبَيْدَ اللَّهِ بْنَ زِيَادٍ عَادَ مَعْقِلَ بْنَ يَسَارٍ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ فَقَالَ لَهُ مَعْقِلٌ إِنِّي مُحَدِّثُكَ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ اسْتَرْعَاهُ اللَّهُ رَعِيَّةً فَلَمْ يَحُطْهَا بِنَصِيحَةٍ إِلَّا لَمْ يَجِدْ رَائِحَةَ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Abul Asyhab] dari [Al Hasan], bahwasanya Abdullah bin Ziyad mengunjungi Ma'qil bin yasar ketika sakitnya yang menjadikan kematiannya, lantas [Ma'qil] mengatakan kepadanya; 'Saya sampaikan hadist kepadamu yang aku dengar dari Rasulullah Shallallahu'alaihiwasallam, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda; \"Tidaklah seorang hamba yang Allah beri amanat kepemimpinan, namun dia tidak menindaklanjutinya dengan baik, selain tak bakalan mendapat bau surga.\""
            },
            {
                "number": 6284,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا حُسَيْنٌ الْجُعْفِيُّ قَالَ زَائِدَةُ ذَكَرَهُ عَنْ هِشَامٍ عَنْ الْحَسَنِ قَالَأَتَيْنَا مَعْقِلَ بْنَ يَسَارٍ نَعُودُهُ فَدَخَلَ عَلَيْنَا عُبَيْدُ اللَّهِ فَقَالَ لَهُ مَعْقِلٌ أُحَدِّثُكَ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا مِنْ وَالٍ يَلِي رَعِيَّةً مِنْ الْمُسْلِمِينَ فَيَمُوتُ وَهُوَ غَاشٌّ لَهُمْ إِلَّا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] Telah mengabarkan kepada kami [Husain Al Ju'fi], [Zaidah] mengatakan, bahwa ia menyebutkannya dari [Hisyam] dari [Al Hasan] mengatakan, kami mendatangi Ma'qil bin Yasar, lantas ubaidhullah menemui kami, lantas [Ma'qil] berujar kepadanya; Saya ceritakan hadist kepadamu yang aku mendengarnya dari Rasulullah Shallallahu'alaihiwasallam, beliau bersabda; \"Tidaklah seorang pemimpin memimpin masyarakat muslimin, lantas dia meninggal dalam keadaan menipu mereka, selain Allah mengharamkan surge baginya.\""
            },
            {
                "number": 6285,
                "arab": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ حَدَّثَنَا خَالِدٌ عَنْ الْجُرَيْرِيِّ عَنْ طَرِيفٍ أَبِي تَمِيمَةَ قَالَشَهِدْتُ صَفْوَانَ وَجُنْدَبًا وَأَصْحَابَهُ وَهُوَ يُوصِيهِمْ فَقَالُوا هَلْ سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا قَالَ سَمِعْتُهُ يَقُولُ مَنْ سَمَّعَ سَمَّعَ اللَّهُ بِهِ يَوْمَ الْقِيَامَةِ قَالَ وَمَنْ يُشَاقِقْ يَشْقُقْ اللَّهُ عَلَيْهِ يَوْمَ الْقِيَامَةِ فَقَالُوا أَوْصِنَا فَقَالَ إِنَّ أَوَّلَ مَا يُنْتِنُ مِنْ الْإِنْسَانِ بَطْنُهُ فَمَنْ اسْتَطَاعَ أَنْ لَا يَأْكُلَ إِلَّا طَيِّبًا فَلْيَفْعَلْ وَمَنْ اسْتَطَاعَ أَنْ لَا يُحَالَ بَيْنَهُ وَبَيْنَ الْجَنَّةِ بِمِلْءِ كَفِّهِ مِنْ دَمٍ أَهْرَاقَهُ فَلْيَفْعَلْقُلْتُ لِأَبِي عَبْدِ اللَّهِ مَنْ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جُنْدَبٌ قَالَ نَعَمْ جُنْدَبٌ",
                "id": "Telah menceritakan kepada kami [Ishaq Al Wasithi] telah menceritakan kepada kami [Khalid] dari [Al Jurairi] dari [Tharif Abu Tamimah] mengatakan, aku menghadiri Shafwan dan [Jundab] serta sahabat-sahabatnya ketika Jundab memberi wasiat kepada mereka, lantas mereka bertanya; 'Apakah kau mendengar sesuatu dari Rasulullah Shallallahu'alaihiwasallam? ' Ia menjawab; aku mendengar beliau bersabda: \"Barangsiapa beramal karena sum'ah (ingin didengar), maka Allah menjadikannya dikenal suka bersum'ah pada hari kiamat, dan barangsiapa menyusahkan (manusia), maka Allah juga bakalan menyusahkannya pada hari kiamat.\" mereka berkata; \"Wasiatilah kami!\" ia berkata; 'Yang pertama-tama membusuk dari tubuh manusia adalah perut, maka barangsiapa yang mampu untuk tidak menyantap selain yang baik, lakukanlah, dan barangsiapa tidak ingin dihalangi antara dirinya dan surga karena segenggam darah yang ia tumpahkan, lakukanlah.' Saya bertanya kepada Abu Abdillah; 'Siapa yang mengatakan aku mendengar Rasulullah Shallallahu'alaihiwasallam, apakah Jundab? ' ia menjawab; \"Iya, Jundab.\""
            },
            {
                "number": 6286,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَبَيْنَمَا أَنَا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَارِجَانِ مِنْ الْمَسْجِدِ فَلَقِيَنَا رَجُلٌ عِنْدَ سُدَّةِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَعْدَدْتَ لَهَا فَكَأَنَّ الرَّجُلَ اسْتَكَانَ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ مَا أَعْدَدْتُ لَهَا كَبِيرَ صِيَامٍ وَلَا صَلَاةٍ وَلَا صَدَقَةٍ وَلَكِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ قَالَ أَنْتَ مَعَ مَنْ أَحْبَبْتَ",
                "id": "Telah menceritakan kepada kami [Ustman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Salim bin Abul Ja'd] telah menceritakan kepada kami [Anas bin Malik] radliallahu 'anhu, ia mengatakan, ketika aku dan Nabi shallallahu 'alaihi wasallam keluar dari masjid, kami menemui seseorang di gerbang masjid dan ia bertanya; 'Ya Rasulullah, kapan hari kiamat tiba? ' Nabi shallallahu 'alaihi wasallam menjawab; \"apa yang telah kau persiapkan?\" Rupanya orang tadi berusaha menenangkan diri lantas mengatakan; 'Ya Rasulullah, saya tidak mempersiapkannya dengan banyak puasa, banyak sholat dan banyak sedekah, hanya aku cinta Allah dan rasul-NYA, ' maka Nabi bersabda; 'Engkau bersama orang yang kau cintai'."
            },
            {
                "number": 6287,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍيَقُولُ لِامْرَأَةٍ مِنْ أَهْلِهِ تَعْرِفِينَ فُلَانَةَ قَالَتْ نَعَمْ قَالَ فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهَا وَهِيَ تَبْكِي عِنْدَ قَبْرٍ فَقَالَ اتَّقِي اللَّهَ وَاصْبِرِي فَقَالَتْ إِلَيْكَ عَنِّي فَإِنَّكَ خِلْوٌ مِنْ مُصِيبَتِي قَالَ فَجَاوَزَهَا وَمَضَى فَمَرَّ بِهَا رَجُلٌ فَقَالَ مَا قَالَ لَكِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ مَا عَرَفْتُهُ قَالَ إِنَّهُ لَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَجَاءَتْ إِلَى بَابِهِ فَلَمْ تَجِدْ عَلَيْهِ بَوَّابًا فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا عَرَفْتُكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الصَّبْرَ عِنْدَ أَوَّلِ صَدْمَةٍ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] Telah mengabarkan kepada kami [Abdushshamad] Telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Tsabit Al Bunani] mengatakan, aku mendengar [Anas bin Malik] berkata kepada seorang wanita dari keluarganya; 'Apakah kamu kenal si wanita A? ' 'Tahu' Jawabnya. Anas melanjutkan; sesungguhnya Nabi shallallahu 'alaihi wasallam pernah melewati wanita itu saat ia menangis di suatu kuburan, lantas beliau menasehatinya: 'Bertaqwalah kepada Allah, dan bersabarlah! ' Si wanita itu malah menjawab; 'Sana kau menjauh, sebab kamu tidak mengalami seperti musibahku ini! ' Kata Anas, Nabi pun segera menjauh dan pergi. Lantas ada seseorang yang melewati wanita itu seraya mengatakan; 'Apa yang disabdakan Rasulullah kepadamu? ' Si wanita tadi menjawab; 'Saya tidak tahu kalau orang tadi Rasulullah.' laki-laki itu mengatakan; \"Orang tadi itu Rasulullah.!\" Anas berkata; si wanita terus datang ke pintu rumah Nabi dan ia tidak menemukan seorang penjaga pintunya, lantas mengatakan; 'Wahai Rasulullah, Demi Allah, aku mengenalmu! ' Lantas Nabi shallallahu 'alaihi wasallam bersabda; \"Kesabaran itu terlihat pada saat pertama kali benturan.\""
            },
            {
                "number": 6288,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ الذُّهْلِيُّ حَدَّثَنَا الْأَنْصَارِيُّ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبِي عَنْ ثُمَامَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَإِنَّ قَيْسَ بْنَ سَعْدٍ كَانَ يَكُونُ بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَنْزِلَةِ صَاحِبِ الشُّرَطِ مِنْ الْأَمِيرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Khalid Adz Dzuhli] telah menceritakan kepada kami [Al Anshari, Muhammad bin Abdullah] mengatakan; telah menceritakan kepadaku [Ayahku] dari [Tsumamah] dari [Anas bin Malik], ia mengatakan, bahwasa Qais bin Sa'd pernah di hadapan Nabi shallallahu 'alaihi wasallam seperti halnya seorang ajudan dengan pemimpin."
            },
            {
                "number": 6289,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى هُوَ الْقَطَّانُ عَنْ قُرَّةَ بْنِ خَالِدٍ حَدَّثَنِي حُمَيْدُ بْنُ هِلَالٍ حَدَّثَنَا أَبُو بُرْدَةَ عَنْ أَبِي مُوسَىأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ وَأَتْبَعَهُ بِمُعَاذٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya alias Al Qaththan] dari [Qurrah bin Khalid] telah menceritakan kepadaku [Humaid bin Hilal] dari [Abu Burdah] dari [Abu Musa], bahwasanya Nabi shallallahu 'alaihi wasallam pernah mengutusnya kemudian mengutus Mu'adz sebagai penyusulnya."
            },
            {
                "number": 6290,
                "arab": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ حَدَّثَنَا مَحْبُوبُ بْنُ الْحَسَنِ حَدَّثَنَا خَالِدٌ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىأَنَّ رَجُلًا أَسْلَمَ ثُمَّ تَهَوَّدَ فَأَتَى مُعَاذُ بْنُ جَبَلٍ وَهُوَ عِنْدَ أَبِي مُوسَى فَقَالَ مَا لِهَذَا قَالَ أَسْلَمَ ثُمَّ تَهَوَّدَ قَالَ لَا أَجْلِسُ حَتَّى أَقْتُلَهُ قَضَاءُ اللَّهِ وَرَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepadaku [Abdullah bin Shabah] telah menceritakan kepada kami [Mahbub bin Al Hasan] telah menceritakan kepada kami [Khalid] dari [Humaid bin Hilal] dari [Abu Burdah] dari [Abu Musa], ada seorang laki-laki masuk Islam kemudian masuk agama yahudi, lantas ia mendatangi Mu'adz bin Jabal yang ketika itu ia berada di dekat Abu Musa, maka Abu Musa bertanya: 'Memangnya kenapa orang ini? ' Mu'adz bin Jabal menjawab: 'orang ini masuk Islam, namun kemudian masuk agama yahudi.\" Spontan Abu Musa mengatakan; \"saya tidak sudi duduk hingga aku membunuhnya sebagai ketetapan Allah dan rasul-Nya Shallallahu'alaihiwasallam."
            },
            {
                "number": 6291,
                "arab": "حَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ قَالَ كَتَبَ أَبُو بَكْرَةَإِلَى ابْنِهِ وَكَانَ بِسِجِسْتَانَ بِأَنْ لَا تَقْضِيَ بَيْنَ اثْنَيْنِ وَأَنْتَ غَضْبَانُ فَإِنِّي سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَقْضِيَنَّ حَكَمٌ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ",
                "id": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] Telah menceritakan kepada kami [Abdul Malik bin Umair], aku mendengar [Abdurrahman bin Abu Bakrah] mengatakan, [Abu Bakrah] menulis surat untuk anaknya yang ketika itu berada di Sijistan yang isinya; 'Jangan engkau mengadili diantara dua orang ketika engkau marah, sebab aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Seorang hakim dilarang memutuskan antara dua orang ketika marah.\""
            },
            {
                "number": 6292,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي وَاللَّهِ لَأَتَأَخَّرُ عَنْ صَلَاةِ الْغَدَاةِ مِنْ أَجْلِ فُلَانٍ مِمَّا يُطِيلُ بِنَا فِيهَا قَالَ فَمَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطُّ أَشَدَّ غَضَبًا فِي مَوْعِظَةٍ مِنْهُ يَوْمَئِذٍ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّ مِنْكُمْ مُنَفِّرِينَ فَأَيُّكُمْ مَا صَلَّى بِالنَّاسِ فَلْيُوجِزْ فَإِنَّ فِيهِمْ الْكَبِيرَ وَالضَّعِيفَ وَذَا الْحَاجَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil] Telah mengabarkan kepada kami [Abdullah] Telah mengabarkan kepada kami [Ismail bin Abu Khalid] dari [Qais bin Abu hazim] dari [Abu Mas'ud Al Anshari] mengatakan, seorang laki-laki menemui Rasulullah Shallallahu'alaihiwasallam dan berujar; \"Hai Rasulullah, Demi Allah, sungguh saya memperlambat-lambatkan diri dari sholat subuh karena si fulan yang menjadi imam, ia selalu memanjangkan bacaan sholatnya jika sholat bersama kami.\" Abu mas'ud Kata; belum pernah kulihat Nabi shallallahu 'alaihi wasallam sedemikian marahnya seperti ketika beliau menasehatinya. Lantas Nabi menegur; \"Hai manusia, diantara kalian ada yang menjadikan orang lain menjauhkan diri dari (masjid dan ibadah), siapa diantara kalian mengimami orang-orang, lakukanlah secara ringkas (sederhana), sebab disana ada orang-orang tua, orang lemah dan orang yang mempunyai keperluan.\""
            },
            {
                "number": 6293,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ الْكَرْمَانِيُّ حَدَّثَنَا حَسَّانُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا مُحَمَّدٌ هُوَ الزُّهْرِيُّ أَخْبَرَنِي سَالِمٌ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ أَخْبَرَهُأَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَذَكَرَ عُمَرُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَغَيَّظَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ لِيُرَاجِعْهَا ثُمَّ لِيُمْسِكْهَا حَتَّى تَطْهُرَ ثُمَّ تَحِيضَ فَتَطْهُرَ فَإِنْ بَدَا لَهُ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Ya'qub Al Karmani] telah menceritakan kepada kami [Hassan bin Ibrahim] telah menceritakan kepada kami [Yunus] mengatakan, telah menceritakan kepada kami [Muhammad yaitu Az Zuhri] telah mengabarkan kepadaku [Salim], bahwasanya [Abdullah bin Umar] mengabarkan kepadanya, ia pernah menceraikan isterinya ketika haidh, lantas Umar melaporkan kasusnya kepada Nabi shallallahu 'alaihi wasallam, Rasulullah Shallallahu'alaihiwasallam pun sedemikian marah karenanya kemudian bersabda: \"Suruhlah dia merujuknya, kemudian mempertahankannya hingga suci, kemudian haidh lagi, kemudian suci, lantas jika ia berkehendak menceriakannya, ceraikanlah!\""
            },
            {
                "number": 6294,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ حَدَّثَنِي عُرْوَةُ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْجَاءَتْ هِنْدٌ بِنْتُ عُتْبَةَ بْنِ رَبِيعَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا كَانَ عَلَى ظَهْرِ الْأَرْضِ أَهْلُ خِبَاءٍ أَحَبَّ إِلَيَّ أَنْ يَذِلُّوا مِنْ أَهْلِ خِبَائِكَ وَمَا أَصْبَحَ الْيَوْمَ عَلَى ظَهْرِ الْأَرْضِ أَهْلُ خِبَاءٍ أَحَبَّ إِلَيَّ أَنْ يَعِزُّوا مِنْ أَهْلِ خِبَائِكَ ثُمَّ قَالَتْ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ فَهَلْ عَلَيَّ مِنْ حَرَجٍ أَنْ أُطْعِمَ مِنْ الَّذِي لَهُ عِيَالَنَا قَالَ لَهَا لَا حَرَجَ عَلَيْكِ أَنْ تُطْعِمِيهِمْ مِنْ مَعْرُوفٍ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepada kami ['Urwah] bahwasanya [Aisyah] radliallahu 'anha mengatakan, Hindun binti Utbah bin Rabi'ah datang dan berujar; 'Wahai Rasulullah, dahulu tidak ada penghuni rumah diatas bumi yang lebih saya sukai untuk dihinakan selain penghuni rumahmu, kebalikannya sekarang, tidak ada penghuni rumah diatas bumi yang lebih saya sukai untuk dimuliakan selain penghuni rumahmu, ' kemudian Hindun binti Utbah mengatakan; 'Sesungguhnya abu Sufyan orangnya sangat pelit, apakah saya berdosa jika memberi makan orang-orang yang menjadi tanggungan kami (dengan mengambil hartanya tanpa sepengetahuannya?) ' Nabi menjawab: \"tidak masalah kau memberi makanan untuk mereka, asalkan dengan ma'ruf (cara wajar).\""
            },
            {
                "number": 6295,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا أَرَادَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَكْتُبَ إِلَى الرُّومِ قَالُوا إِنَّهُمْ لَا يَقْرَءُونَ كِتَابًا إِلَّا مَخْتُومًا فَاتَّخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ فِضَّةٍ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِهِ وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Basyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] mengatakan, aku mendengar [Qatadah] dari [Anas bin Malik] mengatakan, Dikala Nabi shallallahu 'alaihi wasallam ingin berkirim surat kepada Romawi, mereka ternyata manusia yang tak mau membaca surat selain harus berstempel, maka Nabi shallallahu 'alaihi wasallam membuat stempel dari perak, seolah-olah aku melihat kilauannya dan ukirannya bertuliskan MUHAMMAD RASULULLAH."
            },
            {
                "number": 6296,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ ابْنُ أُخْتِ نَمِرٍ أَنَّ حُوَيْطِبَ بْنَ عَبْدِ الْعُزَّى أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ السَّعْدِيِّ أَخْبَرَهُ أَنَّهُ قَدِمَ عَلَى عُمَرَفِي خِلَافَتِهِ فَقَالَ لَهُ عُمَرُ أَلَمْ أُحَدَّثْ أَنَّكَ تَلِيَ مِنْ أَعْمَالِ النَّاسِ أَعْمَالًا فَإِذَا أُعْطِيتَ الْعُمَالَةَ كَرِهْتَهَا فَقُلْتُ بَلَى فَقَالَ عُمَرُ فَمَا تُرِيدُ إِلَى ذَلِكَ قُلْتُ إِنَّ لِي أَفْرَاسًا وَأَعْبُدًا وَأَنَا بِخَيْرٍ وَأُرِيدُ أَنْ تَكُونَ عُمَالَتِي صَدَقَةً عَلَى الْمُسْلِمِينَ قَالَ عُمَرُ لَا تَفْعَلْ فَإِنِّي كُنْتُ أَرَدْتُ الَّذِي أَرَدْتَ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي حَتَّى أَعْطَانِي مَرَّةً مَالًا فَقُلْتُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْهُ فَتَمَوَّلْهُ وَتَصَدَّقْ بِهِ فَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْهُ وَإِلَّا فَلَا تُتْبِعْهُ نَفْسَكَوَعَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي حَتَّى أَعْطَانِي مَرَّةً مَالًا فَقُلْتُ أَعْطِهِ مَنْ هُوَ أَفْقَرُ إِلَيْهِ مِنِّي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْهُ فَتَمَوَّلْهُ وَتَصَدَّقْ بِهِ فَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْهُ وَمَالَا فَلَا تُتْبِعْهُ نَفْسَكَ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [As Sa'ib bin Yazid bin Ukhti Namir], bahwa [Khuwaitib bin Abdul 'uzza] mengabarkan kepadanya, bahwa [Abdullah bin As Sa'di] mengabarkan kepadanya, ia pernah mendatangi Umar dimasa-masa pemerintahannya. [Umar] lantas berujar; \"Benarkan berita yang sampai kepadaku bahwa engkau mengurus urusan-urusan sosial, namun jika engkau diberi pesangon (uang lelah) engkau tidak menyukainya?\" Saya jawab \"Iya\". Umar lantas mengatakan; \"lalu maumu apa?\" Saya menjawab; \"Saya sudah punya kuda sekian banyak, demikian pula budak ada beberapa, dan aku dalam keadaan baik (mapan secara ekonomi), maka aku niati kerjaku ini sebagai sedekah (amal cuma-cuma) untuk kaum muslimin.\" Umar spontan mengatakan: 'jangan kau lakukan, saya sebenarnya juga ingin seperti kehendakmu, namun Rasulullah Shallallahu'alaihiwasallam juga memberiku pemberian, tetapi saya katakan; 'Coba berikan saja pemberian itu kepada orang yang lebih membutuhkan daripada aku! ' Kemudian hari, Nabi juga memberi pemberian yang sama kemudian aku katakan; 'Tolong berikan kepada orang yang lebih membutuhkan daripada aku! ' Lantas Nabi shallallahu 'alaihi wasallam bersabda; \"Ambil saja, kembangkan harta ini, dan jadikanlah untuk bersedekah, harta ini yang datang kepadamu dengan cara yang tidak berlebihan dan engkau sendiri tidak meminta, maka ambil saja, dan terhadap harta, janganlah nafsumu kau perturutkan terhadapnya!\" Dan dari [Az Zuhri] berkata; telah menceritakan kepadaku [Salim bin Abdullah] bahwa [Abdullah bin Umar] berkata; saya telah mendengar [Umar bin Khattab] berkata; Nabi shallallahu 'alaihi wasallam memberikan suatu pemberian kepadaku, lalu saya berkata; Berikan kepada orang yang lebih fakir daripadaku, sehingga pada suatu saat beliau memberi lagi dan saya jawab sebagaimana sebelumnya. Lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Ambillah! kembangkan harta ini, dan jadikanlah untuk bersedekah, harta ini yang datang kepadamu dengan cara yang tidak berlebihan dan engkau sendiri tidak meminta, maka ambil saja, dan terhadap harta, janganlah nafsumu kau perturutkan terhadapnya!\""
            },
            {
                "number": 6297,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ قَالَ الزُّهْرِيُّ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَشَهِدْتُ الْمُتَلَاعِنَيْنِ وَأَنَا ابْنُ خَمْسَ عَشْرَةَ سَنَةً وَفُرِّقَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan], [Az Zuhri] mengatakan dari [Sahal bin Sa'd], ia mengatakan; aku pernah menyaksikan dua orang yang melakukan li'an ketika umurku masih lima belas tahun, maka kedua orang itu diceraikan. "
            },
            {
                "number": 6298,
                "arab": "حَدَّثَنَا يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ سَهْلٍ أَخِي بَنِي سَاعِدَةَأَنَّ رَجُلًا مِنْ الْأَنْصَارِ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَرَأَيْتَ رَجُلًا وَجَدَ مَعَ امْرَأَتِهِ رَجُلًا أَيَقْتُلُهُ فَتَلَاعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ",
                "id": "Telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dari [Sahal saudara Bani Sa'idah], seorang laki-laki anshar menemui Nabi shallallahu 'alaihi wasallam dan berujar; \"bagaimana pendapat anda sekiranya seseorang menemukan laki-laki lain bersama isterinya? Bolehkah ia membunuhnya?\" Suami-isteri itu kemudian sama-sama meli'an dan aku menyaksikan."
            },
            {
                "number": 6299,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنِي اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ وَسَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَأَتَى رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الْمَسْجِدِ فَنَادَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ فَأَعْرَضَ عَنْهُ فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعًا قَالَ أَبِكَ جُنُونٌ قَالَ لَا قَالَ اذْهَبُوا بِهِ فَارْجُمُوهُقَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ كُنْتُ فِيمَنْ رَجَمَهُ بِالْمُصَلَّى رَوَاهُ يُونُسُ وَمَعْمَرٌ وَابْنُ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجْمِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepadaku [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Abu Salamah] dan [Sa'id bin Musayyab] dari [Abu Hurairah] mengatakan; Seorang laki-laki menemui Rasulullah Shallallahu'alaihiwasallam ketika beliau di masjid. Orang itu memanggil beliau seraya mengatakan; 'Hai Rasulullah, saya telah berzina! ' tetapi Rasulullah berpaling darinya. Tatkala kesaksiannya sampai empat kali, Nabi bertanya: \"Mungkin engkau gila?\" \"TIDAK\" Jawabnya. Lantas Nabi bersabda: \"Bawalah orang ini, dan rajamlah!\" [Ibnu Syihab] mengatakan, dan telah menceritakan kepadaku [orang yang] mendengar [Jabir bin Abdullah] mengatakan; 'Aku termasuk diantara yang merajamnya di tanah lapang.' [Yunus], [Ma'mar] dan [Ibnu Juraij] meriwayatkannya dari [Az Zuhri] dari [Abu Salamah] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 6300,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا أَنَا بَشَرٌ وَإِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِي عَلَى نَحْوِ مَا أَسْمَعُ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا فَلَا يَأْخُذْهُ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Hisyam] dari [ayahnya] dari [Zainab binti Abu Salamah] dari [Ummu Salamah] radliallahu 'anha, Rasulullah Shallallahu'alaihiwasallam bersabda; \"Saya hanyalah manusia biasa, dan kalian seringkali mengadukan sengketa kepadaku, bisa jadi sebagian diantara kalian lebih pandai bersilat lidah daripada lainnya sehingga aku putuskan seperti yang kudengar, maka barangsiapa yang kuputuskan menang dengan menganiaya hak saudaranya, janganlah ia mengambilnya, sebab sama artinya aku ambilkan sundutan api baginya.\""
            },
            {
                "number": 6301,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى عَنْ عُمَرَ بْنِ كَثِيرٍ عَنْ أَبِي مُحَمَّدٍ مَوْلَى أَبِي قَتَادَةَ أَنَّ أَبَا قَتَادَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حُنَيْنٍ مَنْ لَهُ بَيِّنَةٌ عَلَى قَتِيلٍ قَتَلَهُ فَلَهُ سَلَبُهُ فَقُمْتُ لِأَلْتَمِسَ بَيِّنَةً عَلَى قَتِيلِي فَلَمْ أَرَ أَحَدًا يَشْهَدُ لِي فَجَلَسْتُ ثُمَّ بَدَا لِي فَذَكَرْتُ أَمْرَهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَجُلٌ مِنْ جُلَسَائِهِ سِلَاحُ هَذَا الْقَتِيلِ الَّذِي يَذْكُرُ عِنْدِي قَالَ فَأَرْضِهِ مِنْهُ فَقَالَ أَبُو بَكْرٍ كَلَّا لَا يُعْطِهِ أُصَيْبِغَ مِنْ قُرَيْشٍ وَيَدَعَ أَسَدًا مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنْ اللَّهِ وَرَسُولِهِ قَالَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَدَّاهُ إِلَيَّ فَاشْتَرَيْتُ مِنْهُ خِرَافًا فَكَانَ أَوَّلَ مَالٍ تَأَثَّلْتُهُقَالَ لِي عَبْدُ اللَّهِ عَنْ اللَّيْثِ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَدَّاهُ إِلَيَّ وَقَالَ أَهْلُ الْحِجَازِ الْحَاكِمُ لَا يَقْضِي بِعِلْمِهِ شَهِدَ بِذَلِكَ فِي وِلَايَتِهِ أَوْ قَبْلَهَا وَلَوْ أَقَرَّ خَصْمٌ عِنْدَهُ لِآخَرَ بِحَقٍّ فِي مَجْلِسِ الْقَضَاءِ فَإِنَّهُ لَا يَقْضِي عَلَيْهِ فِي قَوْلِ بَعْضِهِمْ حَتَّى يَدْعُوَ بِشَاهِدَيْنِ فَيُحْضِرَهُمَا إِقْرَارَهُ وَقَالَ بَعْضُ أَهْلِ الْعِرَاقِ مَا سَمِعَ أَوْ رَآهُ فِي مَجْلِسِ الْقَضَاءِ قَضَى بِهِ وَمَا كَانَ فِي غَيْرِهِ لَمْ يَقْضِ إِلَّا بِشَاهِدَيْنِ وَقَالَ آخَرُونَ مِنْهُمْ بَلْ يَقْضِي بِهِ لِأَنَّهُ مُؤْتَمَنٌ وَإِنَّمَا يُرَادُ مِنْ الشَّهَادَةِ مَعْرِفَةُ الْحَقِّ فَعِلْمُهُ أَكْثَرُ مِنْ الشَّهَادَةِ وَقَالَ بَعْضُهُمْ يَقْضِي بِعِلْمِهِ فِي الْأَمْوَالِ وَلَا يَقْضِي فِي غَيْرِهَا وَقَالَ الْقَاسِمُ لَا يَنْبَغِي لِلْحَاكِمِ أَنْ يُمْضِيَ قَضَاءً بِعِلْمِهِ دُونَ عِلْمِ غَيْرِهِ مَعَ أَنَّ عِلْمَهُ أَكْثَرُ مِنْ شَهَادَةِ غَيْرِهِ وَلَكِنَّ فِيهِ تَعَرُّضًا لِتُهَمَةِ نَفْسِهِ عِنْدَ الْمُسْلِمِينَ وَإِيقَاعًا لَهُمْ فِي الظُّنُونِ وَقَدْ كَرِهَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظَّنَّ فَقَالَ إِنَّمَا هَذِهِ صَفِيَّةُ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Yahya] dari ['Umar bin katsir] dari [Abu Muhammad, maula Abu Qatadah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda pada perang Hunain: \"Barangsiapa mempunyai bukti atas korban yang dibunuh dalam perang, maka ia mendapat harta rampasan yang dibawanya.\" maka aku (Abu Qatadah) langsung berdiri untuk mencari bukti-bukti atas musuh yang telah kubunuh, ternyata tidak aku temukan seorang pun yang menyaksikan pembunuhanku. Maka aku duduk, dan aku punya inisiatif untuk mengadukan persoalanku kepada Rasulullah Shallallahu'alaihi wa sallam. Lantas seorang teman duduknya mengatakan: 'Senjata orang yang dibunuh yang selalu disebut-sebut oleh [Abu Qatadah] itu ada padaku? ' Orang tadi meneruskan; 'Tolong suruhlah Abu Qatadah merelakannya untukku! ' Maka Abu Bakar menyela; 'Sekali-kali tidak, tidak mungkin Rasulullah Shallallahu'alaihi wa sallam memberikan rampasan itu untuk kamu si burung pipit, dan ia tinggalkan salah satu singa Allah (maksudnya Abu Qatadah) yang ia berperang untuk Allah dan rasul-Nya.' Lantas Rasulullah Shallallahu'alaihiwasallam memberikan rampasan itu untukku, dan selanjutnya kubelikan seekor gibas. Dan itulah harta pertama-tama yang kukembangkan. [Abdullah] mengatakan kepadaku, dari [Al Laits], lantas Nabi shallallahu 'alaihi wasallam berdiri dan memberikannya untukku. Ulama Hejaz berpendapat; Seorang hakim tak berhak memutuskan keputusan hanya dengan sepengetahuannya yang ia persaksikan ketika melakukan sidang atau sebelumnya, sekalipun yang digugat mengakui bahwa hak memang milik lawan sengketanya di majlis sidang. Sebagian mereka berkomentar bahwa ia tak berhak memutuskannya hingga memanggil dua orang saksi yang kemudian si hakim mengungkapkan keputusannya. Sedang ulama Irak berpendapat, apa yang ia dengar atau yang ia lihat di majlis sidang, hakim memutuskan dengannya, adapun jika di luar majlis sidang, ia tidak boleh memutuskan selain dengan memanggil dua orang saksi. Sedang kelompok lain dari mereka berpendapat 'Sekalipun diluar sidang, tetap ia putuskan (dengan tanpa memanggil dua orang saksi), sebab hakim adalah orang yang terpercaya, dan maksud persaksian adalah sekedar untuk mengetahui kebenaran, padahal ilmu sang hakim jauh lebih banyak daripada persaksian lainnya, namun yang demikian membuka dirinya menjadi sasaran tuduhan di kalangan muslimin dan menjerumuskan mereka dalam prasangka, (padahal Nabi Shallallahu 'alaihi sangat tidak menyukai prasangka, sebagaimana prasangka buruk kedua sahabatnya ketika nabi shallallahu 'alaihi wasallam berjalan dengan seorang perempuan, lantas nabi langsung memangkas prasangka keduanya dengan mengatakan: \"ketahuilah, wanita itu Shafiyyah, (isteriku).\""
            },
            {
                "number": 6302,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْأُوَيْسِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ عَلِيِّ بْنِ حُسَيْنٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَتْهُ صَفِيَّةُ بِنْتُ حُيَيٍّ فَلَمَّا رَجَعَتْ انْطَلَقَ مَعَهَا فَمَرَّ بِهِ رَجُلَانِ مِنْ الْأَنْصَارِ فَدَعَاهُمَا فَقَالَ إِنَّمَا هِيَ صَفِيَّةُ قَالَا سُبْحَانَ اللَّهِ قَالَ إِنَّ الشَّيْطَانَ يَجْرِي مِنْ ابْنِ آدَمَ مَجْرَى الدَّمِرَوَاهُ شُعَيْبٌ وَابْنُ مُسَافِرٍ وَابْنُ أَبِي عَتِيقٍ وَإِسْحَاقُ بْنُ يَحْيَى عَنْ الزُّهْرِيِّ عَنْ عَلِيٍّ يَعْنِي ابْنَ حُسَيْنٍ عَنْ صَفِيَّةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdul 'Aziz bin Abdullah Al Uwaisi] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari ['Ali bin Husain], Nabi shallallahu 'alaihi wasallam kedatangan Shafiyyah bin Huyyai, tatkala Shafiyyah pulang, Beliau pulang bersamanya, lantas ada dua laki-laki Anshar melewati beliau, maka beliau panggil dua laki-laki itu dan mengatakan: \"Hanyasanya ia Shafiyyah binti Huyyai.\" Maka kedua laki-laki tadi mengucapkan \"SUBHANAALLAH\". Nabi mengatakan 'sesungguhnya setan mengalir dalam anak adam dalam aliran darahnya. hadist ini diriwayatkan oleh [Syu'aib], [Ibnu Musafir], [Ibnu 'Atiq], dan [Ishaq bin Yahya] dari [Az Zuhri] dari [Ali maksudnya Ali bin Husain] dari [Shafiyyah] dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 6303,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا الْعَقَدِيُّ حَدَّثَنَا شُعْبَةُ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ قَالَ سَمِعْتُ أَبِي قَالَبَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبِي وَمُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ فَقَالَ يَسِّرَا وَلَا تُعَسِّرَا وَبَشِّرَا وَلَا تُنَفِّرَا وَتَطَاوَعَا فَقَالَ لَهُ أَبُو مُوسَى إِنَّهُ يُصْنَعُ بِأَرْضِنَا الْبِتْعُ فَقَالَ كُلُّ مُسْكِرٍ حَرَامٌوَقَالَ النَّضْرُ وَأَبُو دَاوُدَ وَيَزِيدُ بْنُ هَارُونَ وَوَكِيعٌ عَنْ شُعْبَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Al 'Aqdi] telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Abu Burdah] mengatakan, aku mendengar [Ayahku] mengatakan; Nabi shallallahu 'alaihi wasallam mengutus ayahku dan Mu'adz bin Jabal ke Yaman, Nabi berpesan: \"Hendaknya kalian berdua mempermudah, jangan mempersulit, memberi kabar gembira, tidak menjadikan orang menjauh, dan bersatu padulah!\" Lantas Abu Musa mengatakan kepadanya; \"Di daerah kami sering dibuat fermentasi kurma (Albit'u).\" Mu'adz menjawab; \"setiap yang memabukkan adalah haram.\" Sedang [Abu Nadhr], [Abu Daud], [Yazid bin harun] dan [Waki'] mengatakan dari [Syu'bah] dari [Sa'id bin Abu Burdah] dari [ayahnya] dari [kakeknya], dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 6304,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ حَدَّثَنِي مَنْصُورٌ عَنْ أَبِي وَائِلٍ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فُكُّوا الْعَانِيَ وَأَجِيبُوا الدَّاعِيَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] telah menceritakan kepadaku [Manshur] dari [Abu Wa`il] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bebaskanlah para tawanan, dan penuhilah orang yang mengundang.\""
            },
            {
                "number": 6305,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ أَنَّهُ سَمِعَ عُرْوَةَ أَخْبَرَنَا أَبُو حُمَيْدٍ السَّاعِدِيُّ قَالَاسْتَعْمَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنْ بَنِي أَسْدٍ يُقَالُ لَهُ ابْنُ الْأُتَبِيَّةِ عَلَى صَدَقَةٍ فَلَمَّا قَدِمَ قَالَ هَذَا لَكُمْ وَهَذَا أُهْدِيَ لِي فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ قَالَ سُفْيَانُ أَيْضًا فَصَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ مَا بَالُ الْعَامِلِ نَبْعَثُهُ فَيَأْتِي يَقُولُ هَذَا لَكَ وَهَذَا لِي فَهَلَّا جَلَسَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَيَنْظُرُ أَيُهْدَى لَهُ أَمْ لَا وَالَّذِي نَفْسِي بِيَدِهِ لَا يَأْتِي بِشَيْءٍ إِلَّا جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى رَقَبَتِهِ إِنْ كَانَ بَعِيرًا لَهُ رُغَاءٌ أَوْ بَقَرَةً لَهَا خُوَارٌ أَوْ شَاةً تَيْعَرُ ثُمَّ رَفَعَ يَدَيْهِ حَتَّى رَأَيْنَا عُفْرَتَيْ إِبْطَيْهِ أَلَا هَلْ بَلَّغْتُ ثَلَاثًاقَالَ سُفْيَانُ قَصَّهُ عَلَيْنَا الزُّهْرِيُّ وَزَادَ هِشَامٌ عَنْ أَبِيهِ عَنْ أَبِي حُمَيْدٍ قَالَ سَمِعَ أُذُنَايَ وَأَبْصَرَتْهُ عَيْنِي وَسَلُوا زَيْدَ بْنَ ثَابِتٍ فَإِنَّهُ سَمِعَهُ مَعِي وَلَمْ يَقُلْ الزُّهْرِيُّ سَمِعَ أُذُنِي{ خُوَارٌ }صَوْتٌ وَالْجُؤَارُ مِنْ{ تَجْأَرُونَ }كَصَوْتِ الْبَقَرَةِ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri], ia mendengar ['Urwah] telah mengabarkan kepada kami, [Abu Humaid assa'idi] mengtakan, Pernah Nabi shallallahu 'alaihi wasallam mempekerjakan seseorang dari bani Asad yang namanya Ibnul Utbiyah untuk menggalang dana sedekah. Orang itu datang sambil mengatakan; \"Ini bagimu, dan ini hadiah bagiku.\" Secara spontan Nabi shallallahu 'alaihi wasallam berdiri diatas minbar -sedang Sufyan mengatakan dengan redaksi; 'naik minbar-, beliau memuja dan memuji Allah kemudian bersabda; \"ada apa dengan seorang amil zakat yang kami utus, lalu ia datang dengan mengatakan; ini untukmu dan ini hadiah untukku! Cabalah ia duduk saja di rumah ayahnya atau rumah ibunya, dan cermatilah, apakah ia menerima hadiah ataukah tidak? Demi Dzat yang jiwaku berada di tangan-NYA, tidaklah seorang amil zakat membawa sesuatu dari harta zakat, selain ia memikulnya pada hari kiamat diatas tengkuknya, jikalau unta, maka unta itu mendengus, dan jika sapi, ia melenguh, dan jika kambing, ia mengembik, \" kemudian beliau mengangkat kedua tangannya sehingga kami melihat putih kedua ketiaknya seraya mengatakan: \" ketahuilah, bukankah telah kusampaikan?\" (beliau mengulang-ulanginya tiga kali). Sedang [Sufyan] mengatakan; [Az Zuhri] telah mengisahkannya kepada kami, dan [Hisyam] menambahkan dari [ayahnya] dari [Abu Humaid] mengatakan; 'kedua telingaku mendengar dan mataku melihatnya, ' dan mereka menanyakan kepada Zaid bin Tsabit bahwasanya ia mendengarnya bersamaku, sedang Az Zuhri tidak mengatakan; 'telingaku mendengar lenguh'."
            },
            {
                "number": 6306,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ جُرَيْجٍ أَنَّ نَافِعًا أَخْبَرَهُ أَنَّ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَخْبَرَهُ قَالَكَانَ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ يَؤُمُّ الْمُهَاجِرِينَ الْأَوَّلِينَ وَأَصْحَابَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسْجِدِ قُبَاءٍ فِيهِمْ أَبُو بَكْرٍ وَعُمَرُ وَأَبُو سَلَمَةَ وَزَيْدٌ وَعَامِرُ بْنُ رَبِيعَةَ",
                "id": "Telah menceritakan kepada kami [Ustman bin Shalih] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Ibnu Juraij], bahwasanya [Nafi'] mengabarinya, bahwa [Ibnu Umar] radliallahu 'anhuma mengabarinya, Salim maula Abu hudzaifah pernah mengimami orang-orang muhajirin kalangan pertama dan sahabat Nabi shallallahu 'alaihi wasallam di masjid, padahal ditengah-tengah mereka ada Abu bakar, Umar, Abu Salamah, Zaid, dan Amir bin Rabi'ah."
            },
            {
                "number": 6307,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنْ عَمِّهِ مُوسَى بْنِ عُقْبَةَ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَخْبَرَاهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حِينَ أَذِنَ لَهُمْ الْمُسْلِمُونَ فِي عِتْقِ سَبْيِ هَوَازِنَ إِنِّي لَا أَدْرِي مَنْ أَذِنَ مِنْكُمْ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ فَرَجَعُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرُوهُ أَنَّ النَّاسَ قَدْ طَيَّبُوا وَأَذِنُوا",
                "id": "Telah menceritakan kepada kami [Ismail bin Abu uwais] telah menceritakan kepadaku [Ismail bin Ibrahim] dari [pamannya, Musa bin 'Uqbah], [Ibnu Syihab] mengatakan, telah menceritakan kepadaku [Urwah bin Zubair] bahwasanya [Marwan bin Hakam] dan [Miswar bin mahkramah] keduanya mengabarkan kepadanya, bahwa Rasulullah Shallallahu'alaihiwasallam bersabda ketika sebagian kaum muslimin mengizinkan tawanan Hawazin dibebaskan; \"Saya tidak tahu siapa diantara kaian yang mengizinkan dan siapa yang tidak, maka kembalilah kalian hingga orang-orang yang cerdik diantara kalian mengadukan kepadaku.\" Lantas para sahabat kembali dan orang-orang cendekia mereka mengajak dialog internal, lantas mereka kembali menemui Rasulullah Shallallahu'alaihiwasallam dan memberitahukan kepada beliau bahwa semua sahabat lega dan mengizinkan."
            },
            {
                "number": 6308,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ أُنَاسٌ لِابْنِ عُمَرَإِنَّا نَدْخُلُ عَلَى سُلْطَانِنَا فَنَقُولُ لَهُمْ خِلَافَ مَا نَتَكَلَّمُ إِذَا خَرَجْنَا مِنْ عِنْدِهِمْ قَالَ كُنَّا نَعُدُّهَا نِفَاقًا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Ashim bin Muhammad bin Zaid bin Abdullah bin Umar] dari [ayahnya], Beberapa orang berkata kepada Ibnu Umar; 'dahulu jika kami menemui penguasa kami, kami mengatakan sesuatu yang menyelisihi pembicaraan kami ketika kami telah meninggalkannya.' Maka [Ibnu Umar] berkata; \"yang demikian kami anggap suatu kemunafikan.\""
            },
            {
                "number": 6309,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عِرَاكٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ شَرَّ النَّاسِ ذُو الْوَجْهَيْنِ الَّذِي يَأْتِي هَؤُلَاءِ بِوَجْهٍ وَهَؤُلَاءِ بِوَجْهٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Hubaib] dari [Irak] dari [Abu Hurairah], ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia yang paling buruk adalah yang bermuka dua (OPORTUNIS), yang mendatangi kaum dengan muka tertentu dan mendatangi lainnya dengan muka yang lain.\""
            },
            {
                "number": 6310,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ هِنْدًا قَالَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ فَأَحْتَاجُ أَنْ آخُذَ مِنْ مَالِهِ قَالَ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] Telah mengabarkan kepada kami [Sufyan] dari [Hisyam] dari [ayahnya] dari [Aisyah] radliallahu 'anha, Hindun binti Utbah berkata kepada Nabi shallallahu 'alaihi wasallam; \"Abu Sufyan itu orangnya sangat pelit, maka aku perlu mengambil hartanya (tanpa sepengetahuannya)!\" Nabi menjawab: \"ambillah yang mencukupimu dan anak-anakmu dengan cara yang ma'ruf (wajar)!\""
            },
            {
                "number": 6311,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ أَخْبَرَتْهُ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهَاعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سَمِعَ خُصُومَةً بِبَابِ حُجْرَتِهِ فَخَرَجَ إِلَيْهِمْ فَقَالَ إِنَّمَا أَنَا بَشَرٌ وَإِنَّهُ يَأْتِينِي الْخَصْمُ فَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ فَأَحْسِبُ أَنَّهُ صَادِقٌ فَأَقْضِي لَهُ بِذَلِكَ فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ فَإِنَّمَا هِيَ قِطْعَةٌ مِنْ النَّارِ فَلْيَأْخُذْهَا أَوْ لِيَتْرُكْهَا",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Salih] dari [Ibnu Syihab] mengatakan, [Urwah bin Zubair] mengabarkan kepadaku, bahwasanya [Zainab binti Abu Salamah] mengabarkan kepadanya, bahwa [Ummu Salamah isteri Nabi shallallahu 'alaihi wasallam] mengabarinya dari Rasulullah shallallahu 'alaihi wasallam; Beliau mendengar pertengkaran di pintu kamarnya, spontan beliau keluar menemui mereka dan mengatakan; \"Saya hanyalah manusia biasa seperti kalian, dan aku mendapatkan pengaduan, siapa tahu diantara kalian lebih pandai bersilat lidah daripada yang lain, sehingga aku menyangka dirinya benar (padahal tidak), lalu aku putuskan untuknya, maka barangsiapa kuputuskan menang dengan melanggar hak saudaranya semuslim, sama artinya aku mengambilkan suluh api baginya, maka silahkan ia ambil atau ia tinggalkan!\""
            },
            {
                "number": 6312,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْكَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي فَاقْبِضْهُ إِلَيْكَ فَلَمَّا كَانَ عَامُ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي قَدْ كَانَ عَهِدَ إِلَيَّ فِيهِ فَقَامَ إِلَيْهِ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي وَابْنُ وَلِيدَةِ أَبِي وُلِدَ عَلَى فِرَاشِهِ فَتَسَاوَقَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ ابْنُ أَخِي كَانَ عَهِدَ إِلَيَّ فِيهِ وَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي وُلِدَ عَلَى فِرَاشِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ احْتَجِبِي مِنْهُ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ تَعَالَى",
                "id": "Telah menceritakan kepada kami [Ismail] mengatakan, telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari ['Urwah bin Zubair] dari [Aisyah, isteri Nabi shallallahu 'alaihi wasallam] mengatakan, Utbah bin Abu Waqqash melimpahkan kuasa kepada saudaranya, Sa'd bin Abu waqqash yang isinya; 'anak laki-laki dari budak perempuan Zam'ah adalah bagian dariku (anakku), maka tolong ambillah.' Tatkala penaklukan Mekah, maka Sa'd mengambilnya dengan mengatakan; 'Ini adalah anak laki-laki saudaraku, ia telah melimpahkan urusan tentangnya kepadaku.' Spontan Abd bin Zam'ah berdiri menghadapinya seraya berujar; 'Bahkan ia adalah saudaraku dan anak laki-laki dari hamba sahaya ayahku, ia dilahirkan di kasurnya, ' keduanya lantas melaporkan kasusnya kepada Rasulullah Shallallahu'alaihiwasallam. Sa'd bin Abu Waqqash kemudian mengatakan; 'Hai Rasulullah, ia adalah anak laki-laki saudaraku yang telah ia limpahkan wewenangnya kepadaku.' Abd bin Zam'ah tak mau kalah seraya mengatakan; 'Bahkan ia adalah saudaraku, dan anak laki-laki dari hamba sahaya ayahku, ia dilahirkan di kasurnya.' Lantas Rasulullah Shallallahu'alaihiwasallam bersabda; \"dia milkmu wahai Abd bin Zam'ah, \" kemudian Rasulullah Shallallahu'alaihiwasallam bersabda: \"Anak adalah pemilik ranjang, dan pezina harus dihukum dengan batu (rajam), \" kemudian beliau bersabda kepada Saudah binti Zam'ah: \"Berhijablah engkau daripadanya!\" karena ada kemiripannya dengan Utbah, sehingga anak laki-laki dari hamba sahaya Zam'ah itu tidak melihat Saudah selama-lamanya."
            },
            {
                "number": 6313,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَالْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ قَالَ عَبْدُ اللَّهِقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْلِفُ عَلَى يَمِينِ صَبْرٍ يَقْتَطِعُ مَالًا وَهُوَ فِيهَا فَاجِرٌ إِلَّا لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ فَأَنْزَلَ اللَّهُ{ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا }الْآيَةَفَجَاءَ الْأَشْعَثُ وَعَبْدُ اللَّهِ يُحَدِّثُهُمْ فَقَالَ فِيَّ نَزَلَتْ وَفِي رَجُلٍ خَاصَمْتُهُ فِي بِئْرٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَكَ بَيِّنَةٌ قُلْتُ لَا قَالَ فَلْيَحْلِفْ قُلْتُ إِذًا يَحْلِفُ فَنَزَلَتْ{ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ }الْآيَةَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Nashr] telah menceritakan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Sufyan] dari [Manshur] dan [Al A'masy] dari [Abu Wa'il] mengatakan, [Abdullah] mengatakan, Nabi shallallahu 'alaihi wasallam bersabda; \"Tidaklah seseorang bersumpah dusta dengan tujuan merampas harta orang lain dan dia bertindak zhalim dengan sumpahnya itu, kecuali ia akan bertemu Allah dan Allah dalam keadaan murka terhadapnya, \" kemudian Allah menurunkan ayat 'Sesungguhnya orang-orang yang membeli janji Allah dan sumpah mereka dengan harga yang sedikit' (QS. Ali'Imran.77), kemudian [Al Asy'ats] datang ketika [Abdullah] sedang menceritakan kepada mereka, dan mengatakan; sebenarnya ayat itu diturunkan kepada saya dan seseorang yang kuajak bersengketa tentang sebuah sumur, kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"apa kamu punya bukti?\" \"TIDAK\" Jawabku. Nabi bersabda: \"kalau begitu, suruhlah lawan sengketamu bersumpah!\" maka Abdullah mengatakan; 'Kalau bukti sekedar sumpah, tentu dia akan bersumpah. Lantas turunlah ayat: 'Sesungguhnya orang-orang yang membeli janji Allah dan sumpah mereka dengan harga yang sedikit….sampai akhir ayat ' (QS. Ali'Imran.77) "
            },
            {
                "number": 6314,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ أَخْبَرَتْهُ عَنْ أُمِّهَا أُمِّ سَلَمَةَ قَالَتْسَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَلَبَةَ خِصَامٍ عِنْدَ بَابِهِ فَخَرَجَ عَلَيْهِمْ فَقَالَ إِنَّمَا أَنَا بَشَرٌ وَإِنَّهُ يَأْتِينِي الْخَصْمُ فَلَعَلَّ بَعْضًا أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ أَقْضِي لَهُ بِذَلِكَ وَأَحْسِبُ أَنَّهُ صَادِقٌ فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ فَإِنَّمَا هِيَ قِطْعَةٌ مِنْ النَّارِ فَلْيَأْخُذْهَا أَوْ لِيَدَعْهَا",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Urwah bin Zubair] bahwasanya [Zainab binti Abu Salamah] mengabarkannya dari ibunya, [Ummu Salamah] mengatakan; Pernah Nabi shallallahu 'alaihi wasallam mendengar gaduh percekcokan di pintunya, lantas beliau menemui mereka dengan mengatakan; \"Saya hanyalah manusia biasa seperti kalian, dan sengketa diadukan kepadaku, dan bisa jadi diantara kalian ada yang lebih pandai bersilat lidah daripada yang lain sehingga aku memenangkannya dan aku mengira dirinya yang benar, maka siapa yang kumenangkan dengan melanggar hak muslim lainnya, itu adalah sundutan api, silahkan ia mengambil atau tinggalkan!\""
            },
            {
                "number": 6315,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَبَلَغَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَجُلًا مِنْ أَصْحَابِهِ أَعْتَقَ غُلَامًا لَهُ عَنْ دُبُرٍ لَمْ يَكُنْ لَهُ مَالٌ غَيْرَهُ فَبَاعَهُ بِثَمَانِ مِائَةِ دِرْهَمٍ ثُمَّ أَرْسَلَ بِثَمَنِهِ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Ismail] telah menceritakan kepada kami [Salamah bin Kuhail] dari ['Atho`] dari [Jabir bin Abdullah] mengatakan, Nabi Shallallahu'alaihiwasallam mendengar informasi ada seorang sahabat membebaskan budaknya dengan cara mudabbar, padahal ia tidak punya harta selainnya, lantas Nabi membelinya seharga delapan ratus dirham, kemudian beliau kirimkan hasilnya kepadanya. "
            },
            {
                "number": 6316,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْثًا وَأَمَّرَ عَلَيْهِمْ أُسَامَةَ بْنَ زَيْدٍ فَطُعِنَ فِي إِمَارَتِهِ وَقَالَ إِنْ تَطْعَنُوا فِي إِمَارَتِهِ فَقَدْ كُنْتُمْ تَطْعَنُونَ فِي إِمَارَةِ أَبِيهِ مِنْ قَبْلِهِ وَايْمُ اللَّهِ إِنْ كَانَ لَخَلِيقًا لِلْإِمْرَةِ وَإِنْ كَانَ لَمِنْ أَحَبِّ النَّاسِ إِلَيَّ وَإِنَّ هَذَا لَمِنْ أَحَبِّ النَّاسِ إِلَيَّ بَعْدَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin ismail] telah menceritakan kepada kami [Abdul Aziz bin Muslim] telah menceritakan kepada kami [Abdullah bin dinar] mengatakan, aku mendengar [Ibnu Umar] radliallahu 'anhuma mengatakan; Rasulullah Shallallahu'alaihiwasallam mengutus sebuah ekspedisi dan mengangkat Usamah bin Zaid sebagai panglimanya, kemudian kepemimpinannya dicela habis-habisan oleh para sahabat ketika itu, maka Nabi langsung menegur; \"Jikalau kalian mencela kepemimpinanya, dahulu kalian juga mencela kepemimpinan bapaknya, demi Allah, dia sangat ideal memegang kepemimpinan, dan sungguh ayahnya (Zaid bin haritsah) termasuk manusia yang paling kucintai, dan dia (Usamah bin Zaid) termasuk manusia yang paling kucintai sepeninggalnya.\""
            },
            {
                "number": 6317,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ يُحَدِّثُ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْغَضُ الرِّجَالِ إِلَى اللَّهِ الْأَلَدُّ الْخَصِمُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij], aku mendengar [Ibnu Abu Mulaikah] menceritakan dari [Aisyah] radliallahu 'anha, ia mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia yang paling dibenci Allah adalah yang keras kepala dan suka membantah.\""
            },
            {
                "number": 6318,
                "arab": "حَدَّثَنَا مَحْمُودٌ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ بَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالِدًا ح و حَدَّثَنِي أَبُو عَبْدِ اللَّهِ نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا عَبْدُ اللَّهِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَبَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالِدَ بْنَ الْوَلِيدِ إِلَى بَنِي جَذِيمَةَ فَلَمْ يُحْسِنُوا أَنْ يَقُولُوا أَسْلَمْنَا فَقَالُوا صَبَأْنَا صَبَأْنَا فَجَعَلَ خَالِدٌ يَقْتُلُ وَيَأْسِرُ وَدَفَعَ إِلَى كُلِّ رَجُلٍ مِنَّا أَسِيرَهُ فَأَمَرَ كُلَّ رَجُلٍ مِنَّا أَنْ يَقْتُلَ أَسِيرَهُ فَقُلْتُ وَاللَّهِ لَا أَقْتُلُ أَسِيرِي وَلَا يَقْتُلُ رَجُلٌ مِنْ أَصْحَابِي أَسِيرَهُ فَذَكَرْنَا ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اللَّهُمَّ إِنِّي أَبْرَأُ إِلَيْكَ مِمَّا صَنَعَ خَالِدُ بْنُ الْوَلِيدِ مَرَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Mahmud] telah menceritakan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], Nabi shallallahu 'alaihi wasallam mengutus Khalid -lewat jalur periwayatan lain-Dan telah menceritakan kepadaku [Abu Abdullah Nu'aim bin Hammad] telah menceritakan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ayahnya], mengatakan, Nabi shallallahu 'alaihi wasallam mengutus Khalid bin Al Walid ke Bani Judzaimah yang lidah mereka belum fasih mengucapkan ASLAMNAA (kami masuk Islam), sehingga mereka ucapkan; 'ASHBA'NA' (yang arti secara harfiah kami menganut agama shabiiyah, padahal maksud mereka ASLAMNA), sehingga Khalid terus membunuh dan menawan dan menyerahkan tawanannya kepada masing-maing kami, dan menyuruh masing-masing kami untuk membunuhnya, maka kukatakan; 'demi Allah, saya tak akan membunuh tawananku, ' dan tak seorang pun sahabatku membunuh tawanannya. Maka kasus ini kulaporkan kepada Nabi shallallahu 'alaihi wasallam dan beliau berujar; \"ya Allah, sesungguhnya aku berlepas diri kepadamu dari apa yang dilakukan Khalid bin Walid\" (beliau ulangi ucapannya dua kali)."
            },
            {
                "number": 6319,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَبُو حَازِمٍ الْمَدَنِيُّ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ قَالَكَانَ قِتَالٌ بَيْنَ بَنِي عَمْرٍو فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى الظُّهْرَ ثُمَّ أَتَاهُمْ يُصْلِحُ بَيْنَهُمْ فَلَمَّا حَضَرَتْ صَلَاةُ الْعَصْرِ فَأَذَّنَ بِلَالٌ وَأَقَامَ وَأَمَرَ أَبَا بَكْرٍ فَتَقَدَّمَ وَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ فِي الصَّلَاةِ فَشَقَّ النَّاسَ حَتَّى قَامَ خَلْفَ أَبِي بَكْرٍ فَتَقَدَّمَ فِي الصَّفِّ الَّذِي يَلِيهِ قَالَ وَصَفَّحَ الْقَوْمُ وَكَانَ أَبُو بَكْرٍ إِذَا دَخَلَ فِي الصَّلَاةِ لَمْ يَلْتَفِتْ حَتَّى يَفْرُغَ فَلَمَّا رَأَى التَّصْفِيحَ لَا يُمْسَكُ عَلَيْهِ الْتَفَتَ فَرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلْفَهُ فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ أَنْ امْضِهْ وَأَوْمَأَ بِيَدِهِ هَكَذَا وَلَبِثَ أَبُو بَكْرٍ هُنَيَّةً يَحْمَدُ اللَّهَ عَلَى قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ مَشَى الْقَهْقَرَى فَلَمَّا رَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ تَقَدَّمَ فَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّاسِ فَلَمَّا قَضَى صَلَاتَهُ قَالَ يَا أَبَا بَكْرٍ مَا مَنَعَكَ إِذْ أَوْمَأْتُ إِلَيْكَ أَنْ لَا تَكُونَ مَضَيْتَ قَالَ لَمْ يَكُنْ لِابْنِ أَبِي قُحَافَةَ أَنْ يَؤُمَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ لِلْقَوْمِ إِذَا رَابَكُمْ أَمْرٌ فَلْيُسَبِّحْ الرِّجَالُ وَلْيُصَفِّحْ النِّسَاءُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Abu Hazim Al Madani] dari [Sahal bin Sa'd As Sa'idi] mengatakan; ketika terjadi peperangan antara bani 'Amru, berita ini sampai kepada Nabi Shallallahu'alaihiwasallam, maka beliau sholat zhuhur kemudian mendatangi mereka untuk mendamaikan sesama mereka. Tatkala tiba sholat ashar, Bilal mengumandangkan adzan dan iqamat. Lantas beliau perintahkan Abu bakar untuk mengimami orang-orang. Ia pun maju mengimami. Selanjutnya Nabi shallallahu 'alaihi wasallam datang sedang Abu Bakar tengah mengimami. Nabi menerobos barisan hingga berdiri di belakang Abu Bakar, dan terus melaju hingga tepat di shaff (barisan) setelah Abu Bakar. Kata Sahal, saat itulah para sahabat menepukkan tangan kanannya diatas punggung lengan kiri (tashfiih) sebagai pertanda Rasul di belakangnya. Adalah kebiasaan Abu bakar jika telah menunaikan sholat, ia tidak menolah-noleh hingga selesai, maka tatkala beliau melihat tashfih terus dilakukan tanpa henti, dia menoleh dan melihat Nabi shallallahu 'alaihi wasallam berada di belakangnya. Nabi shallallahu 'alaihi wasallam memberi isyarat kepadanya agar meneruskan sholatnya dengan tangannya dan mengisyaratkan dengan tangannya sedemikian. Abu Bakar meneruskan sholat beberapa saat, memuji Allah atas ucapan Nabi shallallahu 'alaihi wasallam, kemudian dia berjalan mundur, dikala Nabi shallallahu 'alaihi wasallam melihat yang demikian, Nabi maju dan mengimami orang-orang. Selesai beliau menunaikan sholatnya, beliau mengatakan: \"Hai Abu bakar, apa yang menghalangimu ketika aku memberi isyarat kepadamu, namun engkau malah tidak melanjutkannya?\" Abu bakar menjawab; \"Tidak pantas bagi Ibnu Abu Quhafah mengimami Nabi shallallahu 'alaihi wasallam.\" Kemudian Nabi bersabda kepada para sahabat: \"Jika kalian ragu ketika sholat, hendaklah yang laki-laki mengucapkan tasbih, sedang jika perempuan menepukkan tangan (tashfiih).\""
            },
            {
                "number": 6320,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ أَبُو ثَابِتٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ بْنِ السَّبَّاقِ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَبَعَثَ إِلَيَّ أَبُو بَكْرٍ لِمَقْتَلِ أَهْلِ الْيَمَامَةِ وَعِنْدَهُ عُمَرُ فَقَالَ أَبُو بَكْرٍ إِنَّ عُمَرَ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدْ اسْتَحَرَّ يَوْمَ الْيَمَامَةِ بِقُرَّاءِ الْقُرْآنِ وَإِنِّي أَخْشَى أَنْ يَسْتَحِرَّ الْقَتْلُ بِقُرَّاءِ الْقُرْآنِ فِي الْمَوَاطِنِ كُلِّهَا فَيَذْهَبَ قُرْآنٌ كَثِيرٌ وَإِنِّي أَرَى أَنْ تَأْمُرَ بِجَمْعِ الْقُرْآنِ قُلْتُ كَيْفَ أَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ عُمَرُ هُوَ وَاللَّهِ خَيْرٌ فَلَمْ يَزَلْ عُمَرُ يُرَاجِعُنِي فِي ذَلِكَ حَتَّى شَرَحَ اللَّهُ صَدْرِي لِلَّذِي شَرَحَ لَهُ صَدْرَ عُمَرَ وَرَأَيْتُ فِي ذَلِكَ الَّذِي رَأَى عُمَرُ قَالَ زَيْدٌ قَالَ أَبُو بَكْرٍ وَإِنَّكَ رَجُلٌ شَابٌّ عَاقِلٌ لَا نَتَّهِمُكَ قَدْ كُنْتَ تَكْتُبُ الْوَحْيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَتَبَّعْ الْقُرْآنَ فَاجْمَعْهُ قَالَ زَيْدٌ فَوَاللَّهِ لَوْ كَلَّفَنِي نَقْلَ جَبَلٍ مِنْ الْجِبَالِ مَا كَانَ بِأَثْقَلَ عَلَيَّ مِمَّا كَلَّفَنِي مِنْ جَمْعِ الْقُرْآنِ قُلْتُ كَيْفَ تَفْعَلَانِ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو بَكْرٍ هُوَ وَاللَّهِ خَيْرٌ فَلَمْ يَزَلْ يَحُثُّ مُرَاجَعَتِي حَتَّى شَرَحَ اللَّهُ صَدْرِي لِلَّذِي شَرَحَ اللَّهُ لَهُ صَدْرَ أَبِي بَكْرٍ وَعُمَرَ وَرَأَيْتُ فِي ذَلِكَ الَّذِي رَأَيَا فَتَتَبَّعْتُ الْقُرْآنَ أَجْمَعُهُ مِنْ الْعُسُبِ وَالرِّقَاعِ وَاللِّخَافِ وَصُدُورِ الرِّجَالِ فَوَجَدْتُ فِي آخِرِ سُورَةِ التَّوْبَةِ{ لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ }إِلَى آخِرِهَا مَعَ خُزَيْمَةَ أَوْ أَبِي خُزَيْمَةَ فَأَلْحَقْتُهَا فِي سُورَتِهَا وَكَانَتْ الصُّحُفُ عِنْدَ أَبِي بَكْرٍ حَيَاتَهُ حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ ثُمَّ عِنْدَ عُمَرَ حَيَاتَهُ حَتَّى تَوَفَّاهُ اللَّهُ ثُمَّ عِنْدَ حَفْصَةَ بِنْتِ عُمَرَقَالَ مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ اللِّخَافُ يَعْنِي الْخَزَفَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin ubaidhullah] Abu Tsabit, telah menceritakan kepada kami [Ibrahim bin sa'd] dari [Ibnu Syihab] dari [Ubaid bin Sibaq] dari [Zaid bin tsabit] mengatakan, Abu bakar mengutus seseorang menemuiku karena banyaknya korban yang gugur pada perang Yamamah, ketika itu Abu bakar bersama Umar. Abu Bakar berkata; 'Umar mendatangiku dan mengatakan; 'Korban perang telah meluas pada perang yamamah hingga merenggut qurra` (penghafal) alquran, dan saya khawatir jangan-jangan dengan meninggalnya qurra` alquran di banyak tempat, mengakibatkan sekian banyak ayat quran akan menghilang, dan saya berpendapat jika engkau perintahkan untuk mengumpulkan alquran.' Maka Saya menjawab; 'bagaimana aku lakukan sesuatu yang belum pernah Rasulullah lakukan? ' Umar kontan mengemukakan pendapatnya; 'Demi Allah, ini adalah suatu kebaikan, ' Umar tiada henti-hentinya mendorongku untuk melakukan pekerjaan ini, hingga Allah melapangkan dadaku untuk melakukan pekerjaan yang dada Umar telah lebih dahulu dilapangkan terhadapnya, dan aku sependapat dengan pendapat Umar.' Zaid mengatakan, Abu Bakar berkata; 'Sungguh engkau adalah laki-laki yang masih muda, cerdas, dan kami sama sekali tidak menyangsikan kemampuanmu, sebab engkau sudah terbiasa menulis wahyu untuk Rasulullah. Maka susurilah alquran (yang masih terpencar-pencar) dan kumpulkanlah.' Maka Zaid menjawab; \"Demi Allah, sekiranya Abu bakar menugasiku untuk memindahkan sebuah gunung, itu tidak lebih berat bagiku daripada menugasiku untuk menghimpun alquran. Maka aku berkata; 'Bagaimana mungkin anda berdua melakukan sesuatu yang tidak pernah di lakukan Rasulullah Shallallahu'alaihiwasallam? ' Abu Bakar menjawab; 'demi Alllah, pekerjaan ini adalah kebaikan.' Tiada henti-hentinya Abu Bakar memotivasi pertimbanganku hingga Allah melapangkan dadaku untuk melakukan suatu hal yang Allah telah melapangkan dada Abu Bakar dan Umar untuk melakukannya. Dan aku sependapat dengan keduanya, maka kutelusuri alquran yang terpencar-pencar dan kuhimpun dari pelepah, kulit, tembikar, tulang dan dada para penghapal, dan kutemukan di akhir surat at taubah ayat yang berbunyi; 'Telah datang kepada kalian seorang rasul dari jenis kamu sendiri,,,, hingga akhir ayat (QS. Attaubah 128) bersama Khuzaimah atau Abu Khuzaemah, sehingga aku masukkan dalam suratnya. Kemudian shuhuf (manuskrip pencatatan asli alquran) ini berada di Abu Bakar ketika hidupnya sampai Allah mewafatkannya, kemudian keberadaan shuhuf ini pada Umar 'azza wajalla semasa hidupnya sampai Allah mewafatkannya, kemudian pada Hafshah binti Umar.' Muhammad bin ubaidhullah mengatakan; maksud al likhaf ialah tembikar (tanah liat yang dibakar)."
            },
            {
                "number": 6321,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ عَنْ أَبِي لَيْلَى ح حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي مَالِكٌ عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ أَنَّهُ أَخْبَرَهُهُوَ وَرِجَالٌ مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُخْبِرَ مُحَيِّصَةُ أَنَّ عَبْدَ اللَّهِ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ قَالُوا مَا قَتَلْنَاهُ وَاللَّهِ ثُمَّ أَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ وَأَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمُحَيِّصَةَ كَبِّرْ كَبِّرْ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذِنُوا بِحَرْبٍ فَكَتَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِمْ بِهِ فَكُتِبَ مَا قَتَلْنَاهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ قَالُوا لَا قَالَ أَفَتَحْلِفُ لَكُمْ يَهُودُ قَالُوا لَيْسُوا بِمُسْلِمِينَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ مِائَةَ نَاقَةٍ حَتَّى أُدْخِلَتْ الدَّارَ قَالَ سَهْلٌ فَرَكَضَتْنِي مِنْهَا نَاقَةٌ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Abu Laila] -lewat jalur periwayatan lain-Telah menceritakan kepada kami [Ismail] telah menceritakan kepadaku [Malik] dari [Abu Laila bin Abdullah bin Abduurrahman bin Sahal bin Abu Khatsmah], ia dan beberapa pemuka kaumnya mengabarinya, bahwa Abdullah bin Sahal dan Muhayshah berangkat ke Khaibar karena musim paceklik yang menimpa mereka, lantas Muhayshah diberi kabar bahwa Abdullah terbunuh dan di hempaskan begitu saja di sebuah mata air. Maka ia datangi kaum yahudi dan mengatakan; 'Hei, kalianlah -demi Allah- yang telah membunuhnya! ' Mereka menjawab; 'Kami tidak membunuhnya, demi Allah.' Kemudian Muhayshah pulang hingga ia temui kaumnya dan ia ceritakan kasusnya kepada mereka. Ia temui kaumnya bersama saudaranya, Huwaysah yang usianya lebih tua daripadanya, dan Abdurrahman bin Sahal. Muhayshah kontan ingin bicara -karena dialah yang pergi ke Khaibar--, namun Nabi shallallahu 'alaihi wasallam menegur Muhayshah; \"hendaklah yang lebih tua, hendaklah yang lebih tua\" yang beliau maksudkan adalah umurnya. Maka Huwayshah -kakak Muhaysah-berbicara, kemudian baru diteruskan oleh Muhayshah. Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adakah mereka ingin membayar diyat sahabat kalian ataukah mereka ingin mengumumkan perang?\" lantas Rasulullah Shallallahu'alaihiwasallam berkirim surat kepada mereka, dan mereka pun memberi balasan bahwa; 'kami tidak membunuhnya.' Lantas Rasulullah Shallallahu'alaihiwasallam berkata kepada Muhayshah, Huwayshah, dan Abdurrahman bin Sahal; \"Bagaimana kalau kalian bersumpah dan berhak menuntut darah kawan kalian?\" mereka menjawab; 'tidak'. Nabi lantas mengatakan; \"bagaimana kalau kaum yahudi itu yang bersumpah untuk kalian?\" Mereka menjawab; \"mereka bukan muslimin.\" Selanjutnya malahan Rasulullah Shallallahu'alaihiwasallam yang membayar diyatnya dari miliknya sendiri sebanyak seratus ekor unta hingga dimasukkan kekandang. [Sahal] berkata; 'seekor diantaranya ada yang menyepakku.'"
            }
        ]
    }
}