{
    "status": true,
    "data": {
        "start": 736,
        "end": 882,
        "total": 147,
        "book": "bukhari",
        "hadits": [
            {
                "number": 736,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ بِأُمِّ الْكِتَابِ وَسُورَةٍ مَعَهَا فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنْ صَلَاةِ الظُّهْرِ وَصَلَاةِ الْعَصْرِ وَيُسْمِعُنَا الْآيَةَ أَحْيَانًا وَكَانَ يُطِيلُ فِي الرَّكْعَةِ الْأُولَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] berkata, telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepadaku [Yahya bin Abu Katsir] telah menceritakan kepadaku ['Abdullah bin Abu Qatadah] dari [Bapaknya] bahwa Nabi shallallahu 'alaihi wasallam membaca Al Fathihah dan dua surah pada dua rakaat pertama dalam sholat Zhuhur dan 'Ashar. Terkadang beliau memperdengarkan (mengeraskan bacaan) ayat yang dibacanya, dan beliau biasa memanjangkannya pada rakaat pertama.\""
            },
            {
                "number": 737,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُطَوِّلُ فِي الرَّكْعَةِ الْأُولَى مِنْ صَلَاةِ الظُّهْرِ وَيُقَصِّرُ فِي الثَّانِيَةِ وَيَفْعَلُ ذَلِكَ فِي صَلَاةِ الصُّبْحِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hisyam] dari [Yahya bin Abu Katsir] dari ['Abdullah bin Abu Qatadah] dari [Bapaknya], bahwa Nabi shallallahu 'alaihi wasallam dalam sholat Zhuhur memanjangkan bacaan pada rakaat pertama dan memendekkannya pada rakaat kedua. Beliau lakukan pula seperti itu pada sholat Shubuh.\""
            },
            {
                "number": 738,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَمَّنَ الْإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَقَالَ ابْنُ شِهَابٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ آمِينَ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dan [Abu Salamah bin 'Abdurrahman] bahwa keduanya mengabarkan kepadanya dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika Imam membaca 'Amiin', maka bacalah 'Amiin', karena barangsiapa bacaan 'Amiin' nya bersamaan dengan bacaan Malaikat, maka dosanya yang telah lalu akan diampuni.\" Ibnu Syihab berkata, \"Rasulullah shallallahu 'alaihi wasallam juga membaca amin.\""
            },
            {
                "number": 739,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ أَحَدُكُمْ آمِينَ وَقَالَتْ الْمَلَائِكَةُ فِي السَّمَاءِ آمِينَ فَوَافَقَتْ إِحْدَاهُمَا الْأُخْرَى غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian 'Amiin' dan para Malaikat yang ada di langit juga membaca 'Amiin', lalu bacaan salah satunya bersamaan dengan bacaan yang lain, maka dosanya yang telah lalu akan diampuni.\""
            },
            {
                "number": 740,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ{ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }فَقُولُوا آمِينَ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِتَابَعَهُ مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنُعَيْمٌ الْمُجْمِرُ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Sumayya] mantan budak Abu Bakar, dari [Abu Shalih As Siman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Imam membaca GHAIRIL MAGHDLUUBI 'ALAIHIM WALADL DLAALLIIN, maka ucapkanlah 'AMIIN'. Karena siapa yang ucapan 'AMIIN' nya bersamaan dengan 'AMIIN' nya Malaikat, maka dosanya yang telah lalu akan diampuni.\" Hadits ini dikuatkan oleh [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, dan [Nu'aim Al Mujmir] dari [Abu Hurairah].\""
            },
            {
                "number": 741,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ الْأَعْلَمِ وَهُوَ زِيَادٌ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَأَنَّهُ انْتَهَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ رَاكِعٌ فَرَكَعَ قَبْلَ أَنْ يَصِلَ إِلَى الصَّفِّ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ زَادَكَ اللَّهُ حِرْصًا وَلَا تَعُدْ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammam] dari [Al A'lam] -yaitu Ziyad- dari [Al Hasan] dari [Abu Bakrah], bahwa dia pernah mendapati Nabi shallallahu 'alaihi wasallam sedang rukuk, maka dia pun ikut rukuk sebelum sampai ke dalam barisan shaf. Kemudian dia menceritakan kejadian tersebut kepada Nabi shallallahu 'alaihi wasallam, Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Semoga Allah menambah semangat kepadamu, namun jangan diulang kembali.\""
            },
            {
                "number": 742,
                "arab": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ قَالَ حَدَّثَنَا خَالِدٌ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَصَلَّى مَعَ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ بِالْبَصْرَةِ فَقَالَ ذَكَّرَنَا هَذَا الرَّجُلُ صَلَاةً كُنَّا نُصَلِّيهَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَنَّهُ كَانَ يُكَبِّرُ كُلَّمَا رَفَعَ وَكُلَّمَا وَضَعَ",
                "id": "Telah menceritakan kepada kami [Ishaq Al Wasithi] berkata, telah menceritakan kepada kami [Khalid] dari [Al Jurairi] dari [Abu Al A'la] dari [Mutharrif] dari ['Imran bin Hushain] berkata, \"Dia sholat bersama 'Ali? radliallahu 'anhu di Bashrah. Lalu ia berkata, \"Orang ini mengingatkan kami tentang sholat yang kami lakukan bersama Rasulullah shallallahu 'alaihi wasallam. Dia menyebutkan bahwa Beliau bertakbir setiap mengangkat tangan dan setiap menurunkan tangan.\""
            },
            {
                "number": 743,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّهُ كَانَ يُصَلِّي بِهِمْ فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ فَإِذَا انْصَرَفَ قَالَ إِنِّي لَأَشْبَهُكُمْ صَلَاةً بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu Salamah] dari [Abu Hurairah], bahwa dia sholat mengimami para sahabat, Abu Hurairah lalu takbir setiap menurunkan tangan dan setiap mengangkat tangan. Selesai sholat ia berkata, \"Sungguh, aku adalah orang yang sholatnya paling mirip dengan Rasulullah shallallahu 'alaihi wasallam daripada kalian semua.\""
            },
            {
                "number": 744,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ غَيْلَانَ بْنِ جَرِيرٍ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ قَالَصَلَّيْتُ خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ أَنَا وَعِمْرَانُ بْنُ حُصَيْنٍ فَكَانَ إِذَا سَجَدَ كَبَّرَ وَإِذَا رَفَعَ رَأْسَهُ كَبَّرَ وَإِذَا نَهَضَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ فَلَمَّا قَضَى الصَّلَاةَ أَخَذَ بِيَدِي عِمْرَانُ بْنُ حُصَيْنٍ فَقَالَ قَدْ ذَكَّرَنِي هَذَا صَلَاةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ لَقَدْ صَلَّى بِنَا صَلَاةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami [Hammad] dari [Ghailan bin Jarir] dari [Mutharrif bin 'Abdullah] berkata, \"Aku dan 'Imran bin Hushain sholat di belakang 'Ali bin Abu Thalib? radliallahu 'anhu. Ali bertakbir ketika sujud, ketika mengangkat kepalanya, dan ketika bangkit dari dua rakaat (menuju rakaat tiga). Selesai ['Imran bin Hushain] memegang tanganku seraya berkata, \"Sunguh dia telah mengingatkan aku tentang sholatnya Muhammad shallallahu 'alaihi wasallam.\" Atau dia berkata, \"Sungguh dia telah sholat bersama kami dengan sholatnya Muhammad shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 745,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ عِكْرِمَةَ قَالَرَأَيْتُ رَجُلًا عِنْدَ الْمَقَامِ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ وَإِذَا قَامَ وَإِذَا وَضَعَ فَأَخْبَرْتُ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ أَوَلَيْسَ تِلْكَ صَلَاةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أُمَّ لَكَ",
                "id": "Telah menceritakan kepada kami ['Amru bin 'Aun] berkata, telah menceritakan kepada kami [Husyaim] dari [Abu Bisyr] dari ['Ikrimah] berkata, \"Aku melihat seseorang sholat di dekat Maqam (Masjidil Haram), lalu dia bertakbir pada setiap menurunkan tangan, setiap mengangkat tangan dan ketika berdiri dan turun.\" Aku lalu kabarkan hal itu kepada [Ibnu 'Abbas] radliallahu 'anhu, maka ia berkata, \"Bagaimana kamu ini, bukankah memang begitu caranya Nabi shallallahu 'alaihi wasallam melaksanakan sholatnya!\""
            },
            {
                "number": 746,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ قَالَ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ قَالَصَلَّيْتُ خَلْفَ شَيْخٍ بِمَكَّةَ فَكَبَّرَ ثِنْتَيْنِ وَعِشْرِينَ تَكْبِيرَةً فَقُلْتُ لِابْنِ عَبَّاسٍ إِنَّهُ أَحْمَقُ فَقَالَ ثَكِلَتْكَ أُمُّكَ سُنَّةُ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَوَقَالَ مُوسَى حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا عِكْرِمَةُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah mengabarkan kepada kami [Hammam] dari [Qatadah] dari ['Ikrimah] berkata, \"Aku sholat di belakang seorang syaikh di Makkah. Orang itu bertakbir sejumlah dua puluh dua kali. Lalu aku katakan kepada Ibnu Abbas, 'Betapa bodohnya orangitu!\" Maka [Ibnu 'Abbas] pun berkata, \"Celaka kamu. Sungguh dia telah mempraktekkan sunnah yang dicontohlan oleh Abu Al Qasim shallallahu 'alaihi wasallam.\" [Musa] berkata, telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Qatadah] telah menceritakan kepada kami ['Ikrimah]."
            },
            {
                "number": 747,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ يُكَبِّرُ حِينَ يَقُومُ ثُمَّ يُكَبِّرُ حِينَ يَرْكَعُ ثُمَّ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ حِينَ يَرْفَعُ صُلْبَهُ مِنْ الرَّكْعَةِ ثُمَّ يَقُولُ وَهُوَ قَائِمٌ رَبَّنَا لَكَ الْحَمْدُقَالَ عَبْدُ اللَّهِ بْنُ صَالِحٍ عَنْ اللَّيْثِ وَلَكَ الْحَمْدُ ثُمَّ يُكَبِّرُ حِينَ يَهْوِي ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ ثُمَّ يُكَبِّرُ حِينَ يَسْجُدُ ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ ثُمَّ يَفْعَلُ ذَلِكَ فِي الصَّلَاةِ كُلِّهَا حَتَّى يَقْضِيَهَا وَيُكَبِّرُ حِينَ يَقُومُ مِنْ الثِّنْتَيْنِ بَعْدَ الْجُلُوسِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata, telah mengabarkan kepadaku [Abu Bakar bin 'Abdurrahman] bahwa dia mendengar [Abu Hurairah] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam sholat, beliau takbir saat memulai berdiri (takbiratul Ikram), kemudian ketika akan rukuk sambil membaca: 'SAMI'ALLAHU LIMAN HAMIDAH (semoga Allah mendengar orang yang memuji-Nya) ' ketika mengangkat punggungnya dari rukuk, dalam saat posisi berdiri baliau membaca: RABBANAA LAKAL HAMDU (Ya Rabb kami, milik-Mu lah segala pujian) '.\" ['Abdullah bin Shalih] dari [Al Laits] menyebutkan, 'WA LAKAL HAMDU', kemudian bertakbir ketika turun (sujud), kemudian bertakbir ketika mengangkat kepala (dari sujud), lalu bertakbir ketika sujud dan ketika mengangkat kepalanya (dari sujud), kemudian Beliau melakukan seperti itu dalam sholat seluruhnya hingga selesai. Dan beliau juga bertakbir ketika bangkit dari dua rakaat setelah duduk (tasyahud awal).\""
            },
            {
                "number": 748,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ مُصْعَبَ بْنَ سَعْدٍ يَقُولُصَلَّيْتُ إِلَى جَنْبِ أَبِي فَطَبَّقْتُ بَيْنَ كَفَّيَّ ثُمَّ وَضَعْتُهُمَا بَيْنَ فَخِذَيَّ فَنَهَانِي أَبِي وَقَالَ كُنَّا نَفْعَلُهُ فَنُهِينَا عَنْهُ وَأُمِرْنَا أَنْ نَضَعَ أَيْدِينَا عَلَى الرُّكَبِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Ya'fur] berkata, Aku mendengar [Mush'ab bin Sa'd] berkata, \"Aku sholat di samping [ayahku], lalu aku rapatkan tanganku dan aku letakkan di atas pahaku. Maka ayahku pun melarangnya seraya berkata, \"Kami pernah mengerjakan seperti itu lalu kami dilarang (oleh Nabi shallallahu 'alaihi wasallam), dan kami diperintahkan untuk meletakkan tangan kami pada lutut-lutut kami.\""
            },
            {
                "number": 749,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ قَالَ رَأَى حُذَيْفَةُرَجُلًا لَا يُتِمُّ الرُّكُوعَ وَالسُّجُودَ قَالَ مَا صَلَّيْتَ وَلَوْ مُتَّ مُتَّ عَلَى غَيْرِ الْفِطْرَةِ الَّتِي فَطَرَ اللَّهُ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Hafsh bin 'Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] berkata, \"Aku mendengar [Zaid bin Wahb] berkata, \" [Hudzaifah] melihat seseorang sholat namun tidak menyempurnakan rukuk dan sujudnya. Maka dia berkata, \"Kamu belum sholat. Seandainya kamu meninggal dunia, maka kamu mati dalam keadaan di luar fithrah (agama), padahal Allah telah menciptakan Muhammad shallallahu 'alaihi wasallam berada diatasnya.\""
            },
            {
                "number": 750,
                "arab": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي الْحَكَمُ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ قَالَكَانَ رُكُوعُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسُجُودُهُ وَبَيْنَ السَّجْدَتَيْنِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ مَا خَلَا الْقِيَامَ وَالْقُعُودَ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah menceritakan kepada kami [Badal bin Al Muhabbar] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah mengabarkan kepadaku [Al Hakam] dari [Ibnu Abu Laila] dari [Al Bara'] berkata, \"Rukuk Nabi shallallahu 'alaihi wasallam, sujudnya, (duduk) antara dua sujud, dan ketika mengangkat kepala dari rukuk, tidaklah berbeda antara berdiri (i'tidal) dan duduknya melainkan semuanya sama (dalam thu'maninah).\""
            },
            {
                "number": 751,
                "arab": "حَدَّثَنَا مُسَدَّدٌ قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْمَسْجِدَ فَدَخَلَ رَجُلٌ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَدَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ السَّلَامَ فَقَالَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ثَلَاثًا فَقَالَ وَالَّذِي بَعَثَكَ بِالْحَقِّ فَمَا أُحْسِنُ غَيْرَهُ فَعَلِّمْنِي قَالَ إِذَا قُمْتَ إِلَى الصَّلَاةِ فَكَبِّرْ ثُمَّ اقْرَأْ مَا تَيَسَّرَ مَعَكَ مِنْ الْقُرْآنِ ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ افْعَلْ ذَلِكَ فِي صَلَاتِكَ كُلِّهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah mengabarkan kepadaku [Yahya bin Sa'id] dari ['ubaidhullah] berkata, telah menceritakan kepada kami [Sa'id Al Maqburi] dari [Bapaknya] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam masuk ke dalam Masjid, lalu ada seorang laki-laki masuk ke dalam Masjid dan sholat, kemudian orang itu datang dan memberi salam kepada Nabi shallallahu 'alaihi wasallam. Lalu Nabi shallallahu 'alaihi wasallam menjawab salamnya kemudian bersabda: \"Kembali dan ulangilah sholatmu, karena kamu belum sholat!\" Orang itu kemudian mengulangi sholat dan kembali datang menghadap kepada Nabi shallallahu 'alaihi wasallam sambil memberi salam. Namun beliau kembali bersabda: \"Kembali dan ulangilah sholatmu karena kamu belum sholat!\" Beliau memerintahkan orang ini sampai tiga kali dan akhirnya, sehingga ia berkata, \"Demi Dzat yang mengutus tuan dengan kebenaran, aku tidak bisa melakukan yang lebih baik dari itu. Maka ajarilah aku.\" Beliau pun bersabda: \"Jika kamu mengerjakan sholat maka bertakbirlah, lalu bacalah ayat yang mudah dari al-qur'an. Kemudian rukuklah hingga benar-benar rukuk dengan tenang, lalu bangkitlah (dari rukuk) hingga kamu berdiri tegak, setelah itu sujudlah sampai benar-benar sujud, lalu angkat (kepalamu) untuk duduk hingga benar-benar duduk, Setelah itu sujudlah sampai benar-benar sujud, Kemudian lakukanlah seperti cara tersebut di seluruh sholat (rakaat) mu.\""
            },
            {
                "number": 752,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
                "id": "Telah menceritakan kepada kami [Hafsh bin 'Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Abu Adl Dluha] dari [Masruq] dari ['Aisyah] ia berkata, \"Nabi shallallahu 'alaihi wasallam membaca do'a dalam rukuk dan sujudnya dengan bacaan: \"SUBHAANAKALLAHUMMA RABBANAA WA BIHAMDIKA ALLAHUMMAGHFIRLII (Maha suci Engkau wahai Tuhan kami, segala pujian bagi-Mu. Ya Allah, ampunilah aku) '.\""
            },
            {
                "number": 753,
                "arab": "حَدَّثَنَا آدَمُ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ يُكَبِّرُ وَإِذَا قَامَ مِنْ السَّجْدَتَيْنِ قَالَ اللَّهُ أَكْبَرُ",
                "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id Al Maqburi] dari [Abu Hurairah] berkata, \"Jika Nabi shallallahu 'alaihi wasallam membaca: 'SAMI'ALLAHU LIMAN HAMIDAH (Semoga Allah mendengar pujian orang yang memuji-Nya) ', maka beliau melanjutkan dengan: 'RABBANAA WA LAKAL HAMDU (Wahai Rabb kami, bagi-Mu lah segala pujian) '. Jika Nabi shallallahu 'alaihi wasallam rukuk dan mengangkat kepalanya (dari sujud), beliau bertakbir, dan jika bangkit dari dua sujud (dua rakaat), beliau mengucapkan 'Allahu Akbar'.\""
            },
            {
                "number": 754,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Sumayya] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Imam mengucapkan 'SAMI'ALLAHU LIMAN HAMIDAH (semoga Allah mendengar pujian orang yang memuji-Nya) ', maka ucapkanlah: 'ALLAHUMMA RABBANAA LAKAL HAMDU (Wahai Rabb kami, bagi-Mu lah segala pujian) '.\" Karena barangsiapa yang ucapannya bersamaan dengan ucapan Malaikat, maka dosanya yang telah lalu akan diampuni.\""
            },
            {
                "number": 755,
                "arab": "بَاب حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَلَأُقَرِّبَنَّ صَلَاةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ أَبُو هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ يَقْنُتُ فِي الرَّكْعَةِ الْآخِرَةِ مِنْ صَلَاةِ الظُّهْرِ وَصَلَاةِ الْعِشَاءِ وَصَلَاةِ الصُّبْحِ بَعْدَ مَا يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَيَدْعُو لِلْمُؤْمِنِينَ وَيَلْعَنُ الْكُفَّارَ",
                "id": "Bab. Telah menceritakan kepada kami [Mu'adz bin Fadlalah] berkata, telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] berkata, \"Aku akan contohkan sholatnya Nabi shallallahu 'alaihi wasallam.\" Abu Hurairah? radliallahu 'anhu membaca do'a qunut pada rakaat terakhir dalam sholat Zhuhur, sholat 'Isya dan sholat Shubuh setelah mengucapkan 'SAMI'ALLAHU LIMAN HAMIDAH (semoga Allah mendengar pujian orang yang memuji-Nya) '.\" Maka dia mendo'akan Kaum Mu'minin dan melaknat orang-orang kafir.\""
            },
            {
                "number": 756,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الْأَسْوَدِ قَالَ حَدَّثَنَا إِسْمَاعِيلُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَكَانَ الْقُنُوتُ فِي الْمَغْرِبِ وَالْفَجْرِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Abu Al Aswad] berkata, telah menceritakan kepada kami [Isma'il] dari [Khalid Al Hadzdza'] dari [Abu Qilabah] dari [Anas bin Malik] radliallahu 'anhu berkata, \"do'a qunut itu ada dalam sholat Maghrib dan Shubuh.\""
            },
            {
                "number": 757,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ عَنْ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادٍ الزُّرَقِيِّ عَنْ أَبِيهِ عَنْ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيِّ قَالَكُنَّا يَوْمًا نُصَلِّي وَرَاءَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَفَعَ رَأْسَهُ مِنْ الرَّكْعَةِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ رَجُلٌ وَرَاءَهُ رَبَّنَا وَلَكَ الْحَمْدُ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ فَلَمَّا انْصَرَفَ قَالَ مَنْ الْمُتَكَلِّمُ قَالَ أَنَا قَالَ رَأَيْتُ بِضْعَةً وَثَلَاثِينَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَكْتُبُهَا أَوَّلُ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Nu'aim bin 'Abdullah Al Mujmir] dari ['Ali bin Yahya bin Khallad Az Zuraqi] dari [Bapaknya] dari [Rifa'ah bin Rafi' Az Zuraqi] berkata, \"Pada suatu hari kami sholat di belakang Nabi shallallahu 'alaihi wasallam. Ketika mengangkat kepalanya dari rukuk beliau mengucapkan: 'SAMI'ALLAHU LIMAN HAMIDAH (Semoga Allah mendengar punjian orang yang memuji-Nya) '. Kemudian ada seorang laki-laki yang berada di belakang beliau membaca; 'RABBANAA WA LAKAL HAMDU HAMDAN KATSIIRAN THAYYIBAN MUBAARAKAN FIIHI (Wahai Tuhan kami, bagi-Mu segala pujian, aku memuji-Mu dengan pujian yang banyak, yang baik dan penuh berkah) '.\" Selesai sholat beliau bertanya: \"Siapa orang yang membaca kalimat tadi?\" Orang itu menjawab, \"Saya.\" Beliau bersabda: \"Aku melihat lebih dari tiga puluh Malaikat berebut siapa di antara mereka yang lebih dahulu untuk menuliskan kalimat tersebut.\""
            },
            {
                "number": 758,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ ثَابِتٍ قَالَ كَانَ أَنَسٌيَنْعَتُ لَنَا صَلَاةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ يُصَلِّي وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَامَ حَتَّى نَقُولَ قَدْ نَسِيَ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] berkata, telah menceritakan kepada kami [Syu'bah] dari [Tsabit] berkata, \" [Anas] pernah menceritakan sifat sholat Nabi shallallahu 'alaihi wasallam kepada kami, jika beliau sholat dan mengangkat kepalanya dari rukuk, maka beliau berdiri (lama) hingga kami mengatakan 'beliau telah lupa'.\""
            },
            {
                "number": 759,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ رَضِيَ اللَّهُ عَنْهُ قَالَكَانَ رُكُوعُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسُجُودُهُ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَبَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] berkata, telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibnu Abu Laila] dari [Al Bara'] berkata, \"Rukuknya Nabi shallallahu 'alaihi wasallam, sujudnya dan ketika mengangkat kepala dari rukuk, serta duduk antara dua sujud, semuanya hampir sama (lama dan thunam'ninah).\""
            },
            {
                "number": 760,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ قَالَ كَانَ مَالِكُ بْنُ الْحُوَيْرِثِيُرِينَا كَيْفَ كَانَ صَلَاةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَاكَ فِي غَيْرِ وَقْتِ صَلَاةٍ فَقَامَ فَأَمْكَنَ الْقِيَامَ ثُمَّ رَكَعَ فَأَمْكَنَ الرُّكُوعَ ثُمَّ رَفَعَ رَأْسَهُ فَأَنْصَبَ هُنَيَّةً قَالَ فَصَلَّى بِنَا صَلَاةَ شَيْخِنَا هَذَا أَبِي بُرَيْدٍ وَكَانَ أَبُو بُرَيْدٍ إِذَا رَفَعَ رَأْسَهُ مِنْ السَّجْدَةِ الْآخِرَةِ اسْتَوَى قَاعِدًا ثُمَّ نَهَضَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] berkata, \" [Malik bin Al Huwirits] pernah memperlihatkan kepada kami tata cara sholat Rasulullah shallallahu 'alaihi wasallam. Ia lakukan itu bukan pas waktu sholat. Dia lalu berdiri hingga dengan thuma'ninah, lalu rukuk dengan thuma'ninah, lalu mengangkat kepalanya dan berdiam diri sejenak, kemudian dia berkata, \"Guru (syaikh) kami ini Abu Buraid pernah sholat memimpin kami.\" Jika Abu Buraid mengangkat kepalanya dari sujud yang akhir, maka dia duduk dengan lurus sejenak lalu bangkit berdiri.\""
            },
            {
                "number": 761,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَكَانَ يُكَبِّرُ فِي كُلِّ صَلَاةٍ مِنْ الْمَكْتُوبَةِ وَغَيْرِهَا فِي رَمَضَانَ وَغَيْرِهِ فَيُكَبِّرُ حِينَ يَقُومُ ثُمَّ يُكَبِّرُ حِينَ يَرْكَعُ ثُمَّ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ يَقُولُ رَبَّنَا وَلَكَ الْحَمْدُ قَبْلَ أَنْ يَسْجُدَ ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ حِينَ يَهْوِي سَاجِدًا ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ مِنْ السُّجُودِ ثُمَّ يُكَبِّرُ حِينَ يَسْجُدُ ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ مِنْ السُّجُودِ ثُمَّ يُكَبِّرُ حِينَ يَقُومُ مِنْ الْجُلُوسِ فِي الِاثْنَتَيْنِ وَيَفْعَلُ ذَلِكَ فِي كُلِّ رَكْعَةٍ حَتَّى يَفْرُغَ مِنْ الصَّلَاةِ ثُمَّ يَقُولُ حِينَ يَنْصَرِفُ وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَقْرَبُكُمْ شَبَهًا بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَتْ هَذِهِ لَصَلَاتَهُ حَتَّى فَارَقَ الدُّنْيَا",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku [Abu Bakar bin 'Abdurrahman bin Al Harits bin Hisyam] dan [Abu Salamah bin Abdurrahman] bahwa [Abu Hurairah] bertakbir dalam setiap sholat yang wajib dan yang lainnya baik pada bulan Ramadan maupun di luar Ramadan. Dia bertakbir ketika berdiri dan ketika akan rukuk, kemudian dia mengucapkan: 'SAMI'ALLAHU LIMAN HAMIDAH (Semoga Allah mendengar pujian orang yang memuji-Nya) ', kemudian sebelum sujud dia membaca: 'RABBANAA WA LAKAL HAMDU (Wahai Rabb kami, bagi-Mu segala puji) ', lalu mengucapkan: 'Allahu Akbar' ketika akan turun sujud. Kemudian bertakbir ketika mengangkat kepalanya dari sujud, kemudian bertakbir lagi ketika akan sujud, kemudian bertakbir ketika mengangkat kepalanya dari sujud, dan ketika bangkit berdiri dari duduk setelah dua rakaat (tasyahud awal) ia juga bertakbir kembali. Dan dalam setiap rakaat sholat dia mengerjakan seperti itu, lalu setelah selesai ia berkata, \"Demi Dzat yang jiwaku berada di tangan-Nya, sungguh aku telah mencontohkan kepada kalian sholat seperti sholatnya Rasulullah shallallahu 'alaihi wasallam. Sungguh inilah cara sholatnya hingga beliau meninggalkan dunia ini.\""
            },
            {
                "number": 762,
                "arab": "قَالَا وَقَالَ أَبُو هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُوَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ يَرْفَعُ رَأْسَهُ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ يَدْعُو لِرِجَالٍ فَيُسَمِّيهِمْ بِأَسْمَائِهِمْ فَيَقُولُ اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ وَسَلَمَةَ بْنَ هِشَامٍ وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ وَالْمُسْتَضْعَفِينَ مِنْ الْمُؤْمِنِينَ اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَاجْعَلْهَا عَلَيْهِمْ سِنِينَ كَسِنِي يُوسُفَوَأَهْلُ الْمَشْرِقِ يَوْمَئِذٍ مِنْ مُضَرَ مُخَالِفُونَ لَهُ",
                "id": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya) keduanya berkata; [Abu Hurairah] radliallahu 'anhu berkata, \"Rasulullah shallallahu 'alaihi wasallam ketika mengangkat kepalanya dari rukuk sambil mengucapkan: 'SAMI'ALLAHU LIMAN HAMIDAH, RABBANAA WA LAKAL HAMDU (Semoga Allah mendengar pujian orang yang memuji-Nya. Wahai Rabb kami, dan milik-Mu lah segala pujian) ', kemudian beliau berdo'a: \"Ya Allah, selamatkanlah Al Walid bin Al Walid, Salamah bin Hisyam, 'Ayyasy bin Abu Rabi'ah orang-orang lemah dari kaum Mukminin. Ya Allah, timpakanlah kerasnya siksa-Mu kepada Mudlar dan jadikanlah siksa-Mu untuk mereka berupa paceklik seperti paceklik yang terjadi pada zaman Nabi Yusuf.\" Pada waktu itu, orang-orang penduduk Masyriq menyelisih atau menentang Mudlar.\""
            },
            {
                "number": 763,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا سُفْيَانُ غَيْرَ مَرَّةٍ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُسَقَطَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ فَرَسٍ وَرُبَّمَا قَالَ سُفْيَانُ مِنْ فَرَسٍ فَجُحِشَ شِقُّهُ الْأَيْمَنُ فَدَخَلْنَا عَلَيْهِ نَعُودُهُ فَحَضَرَتْ الصَّلَاةُ فَصَلَّى بِنَا قَاعِدًا وَقَعَدْنَاوَقَالَ سُفْيَانُ مَرَّةً صَلَّيْنَا قُعُودًا فَلَمَّا قَضَى الصَّلَاةَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ وَإِذَا سَجَدَ فَاسْجُدُوا قَالَ سُفْيَانُ كَذَا جَاءَ بِهِ مَعْمَرٌ قُلْتُ نَعَمْ قَالَ لَقَدْ حَفِظَ كَذَا قَالَ الزُّهْرِيُّ وَلَكَ الْحَمْدُ حَفِظْتُ مِنْ شِقِّهِ الْأَيْمَنِ فَلَمَّا خَرَجْنَا مِنْ عِنْدِ الزُّهْرِيِّ قَالَ ابْنُ جُرَيْجٍ وَأَنَا عِنْدَهُ فَجُحِشَ سَاقُهُ الْأَيْمَنُ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah menceritakan kepada kami [Sufyan] tidak hanya sekali dari [Az Zuhri] berkata, \"Aku mendengar [Anas bin Malik] radliallahu 'anhu berkata, \"Rasulullah shallallahu 'alaihi wasallam terjatuh dari kudanya, dimungkinkan Sufyan juga menyebutkan, \"Beliau jatuh dari kudanya hingga bagian lambung kananannya terluka. Lalu kami pun menjenguk beliau, tidak lama kemudian masuk waktu sholat, beliau lalu sholat mengimami kami sambil duduk, kemudian kami sholat di belakangnya dengan duduk.\" Sekali waktu waktu Sufyan menyebutkan, \"Kami sholat dengan duduk. Setalah selesai sholat beliau bersabda: \"Hanyasanya dijadikannya imam adalah agar diikuti, jika dia takbir maka takbirlah, jika dia rukuk maka rukuklah, jika ia mengangkat kepala maka angkatlah kepala kalian, dan jika ia mengucapkan 'SAMI'ALLAHU LIMAN HAMIDAH (Semoga Allah mendengar pujian orang yang memuji-Nya) ', maka ucapkanlah oleh kalian 'RABBANAA WA LAKAL HAMDU (Ya Rabb kami, milik Engkaulah segala pujian) '. Dan jika dia sujud maka sujudlah kalian.\" Sufyan berkata, \"Apakah begitu yang dibawa oleh Ma'mar? Aku jawab, \"Ya.\" Lalu Sufyan berkata, \"Sungguh dia telah menjaga (memelihara) masalah ini.\" Az Zuhri berkata, \"Segala puji bagi Engkau ya Allah. Sungguh aku masih ingat bahwa beliau terhempas pada bagian kanan lambungnya.\" Setelah kami berpisah dari Az Zuhri, [Ibnu Juraij] berkata, \"Saat itu aku ada di sisi beliau, lalu terjatuhlah beliau pada lambung bagian kanannya.\""
            },
            {
                "number": 764,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ وَعَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُمَاأَنَّ النَّاسَ قَالُوا يَا رَسُولَ اللَّهِ هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ قَالَ هَلْ تُمَارُونَ فِي الْقَمَرِ لَيْلَةَ الْبَدْرِ لَيْسَ دُونَهُ سَحَابٌ قَالُوا لَا يَا رَسُولَ اللَّهِ قَالَ فَهَلْ تُمَارُونَ فِي الشَّمْسِ لَيْسَ دُونَهَا سَحَابٌ قَالُوا لَا قَالَ فَإِنَّكُمْ تَرَوْنَهُ كَذَلِكَ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ فَيَقُولُ مَنْ كَانَ يَعْبُدُ شَيْئًا فَلْيَتَّبِعْ فَمِنْهُمْ مَنْ يَتَّبِعُ الشَّمْسَ وَمِنْهُمْ مَنْ يَتَّبِعُ الْقَمَرَ وَمِنْهُمْ مَنْ يَتَّبِعُ الطَّوَاغِيتَ وَتَبْقَى هَذِهِ الْأُمَّةُ فِيهَا مُنَافِقُوهَا فَيَأْتِيهِمْ اللَّهُ فَيَقُولُ أَنَا رَبُّكُمْ فَيَقُولُونَ هَذَا مَكَانُنَا حَتَّى يَأْتِيَنَا رَبُّنَا فَإِذَا جَاءَ رَبُّنَا عَرَفْنَاهُ فَيَأْتِيهِمْ اللَّهُ فَيَقُولُ أَنَا رَبُّكُمْ فَيَقُولُونَ أَنْتَ رَبُّنَا فَيَدْعُوهُمْ فَيُضْرَبُ الصِّرَاطُ بَيْنَ ظَهْرَانَيْ جَهَنَّمَ فَأَكُونُ أَوَّلَ مَنْ يَجُوزُ مِنْ الرُّسُلِ بِأُمَّتِهِ وَلَا يَتَكَلَّمُ يَوْمَئِذٍ أَحَدٌ إِلَّا الرُّسُلُ وَكَلَامُ الرُّسُلِ يَوْمَئِذٍ اللَّهُمَّ سَلِّمْ سَلِّمْ وَفِي جَهَنَّمَ كَلَالِيبُ مِثْلُ شَوْكِ السَّعْدَانِ هَلْ رَأَيْتُمْ شَوْكَ السَّعْدَانِ قَالُوا نَعَمْ قَالَ فَإِنَّهَا مِثْلُ شَوْكِ السَّعْدَانِ غَيْرَ أَنَّهُ لَا يَعْلَمُ قَدْرَ عِظَمِهَا إِلَّا اللَّهُ تَخْطَفُ النَّاسَ بِأَعْمَالِهِمْ فَمِنْهُمْ مَنْ يُوبَقُ بِعَمَلِهِ وَمِنْهُمْ مَنْ يُخَرْدَلُ ثُمَّ يَنْجُو حَتَّى إِذَا أَرَادَ اللَّهُ رَحْمَةَ مَنْ أَرَادَ مِنْ أَهْلِ النَّارِ أَمَرَ اللَّهُ الْمَلَائِكَةَ أَنْ يُخْرِجُوا مَنْ كَانَ يَعْبُدُ اللَّهَ فَيُخْرِجُونَهُمْ وَيَعْرِفُونَهُمْ بِآثَارِ السُّجُودِ وَحَرَّمَ اللَّهُ عَلَى النَّارِ أَنْ تَأْكُلَ أَثَرَ السُّجُودِ فَيَخْرُجُونَ مِنْ النَّارِ فَكُلُّ ابْنِ آدَمَ تَأْكُلُهُ النَّارُ إِلَّا أَثَرَ السُّجُودِ فَيَخْرُجُونَ مِنْ النَّارِ قَدْ امْتَحَشُوا فَيُصَبُّ عَلَيْهِمْ مَاءُ الْحَيَاةِ فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ ثُمَّ يَفْرُغُ اللَّهُ مِنْ الْقَضَاءِ بَيْنَ الْعِبَادِ وَيَبْقَى رَجُلٌ بَيْنَ الْجَنَّةِ وَالنَّارِ وَهُوَ آخِرُ أَهْلِ النَّارِ دُخُولًا الْجَنَّةَ مُقْبِلٌ بِوَجْهِهِ قِبَلَ النَّارِ فَيَقُولُ يَا رَبِّ اصْرِفْ وَجْهِي عَنْ النَّارِ قَدْ قَشَبَنِي رِيحُهَا وَأَحْرَقَنِي ذَكَاؤُهَا فَيَقُولُ هَلْ عَسَيْتَ إِنْ فُعِلَ ذَلِكَ بِكَ أَنْ تَسْأَلَ غَيْرَ ذَلِكَ فَيَقُولُ لَا وَعِزَّتِكَ فَيُعْطِي اللَّهَ مَا يَشَاءُ مِنْ عَهْدٍ وَمِيثَاقٍ فَيَصْرِفُ اللَّهُ وَجْهَهُ عَنْ النَّارِ فَإِذَا أَقْبَلَ بِهِ عَلَى الْجَنَّةِ رَأَى بَهْجَتَهَا سَكَتَ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ ثُمَّ قَالَ يَا رَبِّ قَدِّمْنِي عِنْدَ بَابِ الْجَنَّةِ فَيَقُولُ اللَّهُ لَهُ أَلَيْسَ قَدْ أَعْطَيْتَ الْعُهُودَ وَالْمِيثَاقَ أَنْ لَا تَسْأَلَ غَيْرَ الَّذِي كُنْتَ سَأَلْتَ فَيَقُولُ يَا رَبِّ لَا أَكُونُ أَشْقَى خَلْقِكَ فَيَقُولُ فَمَا عَسَيْتَ إِنْ أُعْطِيتَ ذَلِكَ أَنْ لَا تَسْأَلَ غَيْرَهُ فَيَقُولُ لَا وَعِزَّتِكَ لَا أَسْأَلُ غَيْرَ ذَلِكَ فَيُعْطِي رَبَّهُ مَا شَاءَ مِنْ عَهْدٍ وَمِيثَاقٍ فَيُقَدِّمُهُ إِلَى بَابِ الْجَنَّةِ فَإِذَا بَلَغَ بَابَهَا فَرَأَى زَهْرَتَهَا وَمَا فِيهَا مِنْ النَّضْرَةِ وَالسُّرُورِ فَيَسْكُتُ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ فَيَقُولُ يَا رَبِّ أَدْخِلْنِي الْجَنَّةَ فَيَقُولُ اللَّهُ وَيْحَكَ يَا ابْنَ آدَمَ مَا أَغْدَرَكَ أَلَيْسَ قَدْ أَعْطَيْتَ الْعُهُودَ وَالْمِيثَاقَ أَنْ لَا تَسْأَلَ غَيْرَ الَّذِي أُعْطِيتَ فَيَقُولُ يَا رَبِّ لَا تَجْعَلْنِي أَشْقَى خَلْقِكَ فَيَضْحَكُ اللَّهُ عَزَّ وَجَلَّ مِنْهُ ثُمَّ يَأْذَنُ لَهُ فِي دُخُولِ الْجَنَّةِ فَيَقُولُ تَمَنَّ فَيَتَمَنَّى حَتَّى إِذَا انْقَطَعَ أُمْنِيَّتُهُ قَالَ اللَّهُ عَزَّ وَجَلَّ مِنْ كَذَا وَكَذَا أَقْبَلَ يُذَكِّرُهُ رَبُّهُ حَتَّى إِذَا انْتَهَتْ بِهِ الْأَمَانِيُّ قَالَ اللَّهُ تَعَالَى لَكَ ذَلِكَ وَمِثْلُهُ مَعَهُقَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ لِأَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُمَا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ اللَّهُ لَكَ ذَلِكَ وَعَشَرَةُ أَمْثَالِهِ قَالَ أَبُو هُرَيْرَةَ لَمْ أَحْفَظْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا قَوْلَهُ لَكَ ذَلِكَ وَمِثْلُهُ مَعَهُ قَالَ أَبُو سَعِيدٍ إِنِّي سَمِعْتُهُ يَقُولُ ذَلِكَ لَكَ وَعَشَرَةُ أَمْثَالِهِ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku [Sa'id bin Al Musayyab] dan ['Atha' bin Yazid Al Laitsi] bahwa [Abu Hurairah] mengabarkan kepada keduanya, bahwa orang-orang berkata, \"Wahai Rasulullah, apakah kita akan melihat Rabb kita pada hari kiamat nanti?\" Beliau menjawab: \"Apakah kalian dapat membantah (bahwa kalian dapat melihat) bulan pada malam purnama, bila tidak ada awan yang menghalanginya?\" Mereka menjawab, \"Tidak, wahai Rasulullah.\" Beliau bertanya lagi: \"Apakah kalian dapat membantah (bahwa kalian dapat melihat) matahari, bila tidak ada awan yang menghalanginya?\" Mereka menjawab, \"Tidak.\" Beliau lantas bersabda: \"Sungguh kalian akan dapat melihat-Nya seperti itu juga. Manusia akan dikumpulkan pada hari kiamat, lalu Allah Subhaanahu Wa Ta'ala berfirman: 'Barangsiapa menyembah seseuatu, maka ia akan ikut dengannya.' Maka di antara mereka ada yang mengikuti matahari, di antara mereka ada yang mengikuti bulan dan di antara mereka ada pula yang mengikuti thaghut-thaghut. Maka tinggallah ummat ini, yang diantaranya ada para munafiknya. Maka Allah mendatangi mereka dan lalu berfirman: 'Aku adalah Rabb kalian.' Mereka berkata, 'Inilah tempat kedudukan kami hingga datang Rabb kami. Apabila Rabb kami telah datang pasti kami mengenalnya.' Maka Allah mendatangi mereka seraya berfirman: 'Akulah Rabb kalian.' Allah kemudian memanggil mereka, lalu dibentangkanlah Ash Shirath di atas neraka Jahannam. Dan akulah orang yang pertama berhasil melewatinya di antara para Rasul bersama ummatnya. Pada hari itu tidak ada seorangpun yang dapat berbicara kecuali para Rasul, dan ucapan para Rasul adalah: 'Ya Allah selamatkanlah, selamatkanlah.' Dan di dalam Jahannam ada besi yang ujungnya bengkok seperti duri Sa'dan (tumbuhan yang berduri tajam). Pernahkah kalian melihat duri Sa'dan?\" Mereka menjawab: \"Ya, pernah.\" Beliau melanjutkan: \"Sungguh dia seperti duri Sa'dan, hanya saja tidak ada yang mengetahui ukuran besarnya duri tersebut kecuali Allah. Duri tersebut akan menusuk-nusuk manusia berdasarkan amal amal mereka. Di antara mereka ada yang dikoyak-koyak hingga binasa disebabkan amalnya, ada pula yang dipotong-potong kemudian selamat melewatinya. Hingga apabila Allah berkehendak memberikan rahmat-Nya bagi siapa yang dikehendaki-Nya dari penghuni neraka, maka Allah memerintahkan Malaikat untuk mengeluarkan siapa saja yang pernah menyembah Allah. Maka para Malikat mengeluarkan mereka, yang mereka dikenal berdasarkan tanda bekas-bekas sujud (atsarus sujud). Dan Allah telah mengharamkan kepada neraka untuk memakan (membakar) atsarus sujud, lalu keluarlah mereka dari neraka. Setiap anak keturunan Adam akan dibakar oleh neraka kecuali mereka yang memiliki atsarus sujud. Maka mereka keluar dalam keadaan sudah hangus terbakar (gosong), lalu mereka disiram dengan air kehidupan kemudian jadilah mereka tumbuh seperti tumbuhnya benih di tepian aliran sungai. Setelah itu selesailah Allah memutuskan perkara di antara hamba-hambaNya. Dan yang tinggal hanyalah seorang yang berada antara surga dan neraka, dan dia adalah orang terakhir yang memasuki surga di antara penghuni neraka yang berhak memasukinya, dia sedang menghadapkan wajahnya ke neraka seraya berkata, 'Ya Rabb, palingkanlah wajahku dari neraka! Sungguh anginnya neraka telah meracuni aku dan baranya telah memanggang aku.' Lalu Allah berfirman: 'Apakah seandainya kamu diberi kesempatan kali yang lain kamu tidak akan meminta yang lain lagi? ' Orang itu menjawab: 'Tidak, demi kemuliaan-Mu, ya Allah! ' Maka Allah memberikan kepadanya janji dan ikatan perjanjian sesuai apa yang dikehendati orang tersebut. Kemudian Allah memalingkan wajah orang tersebut dari neraka. Maka ketika wajahnya dihadapkan kepada surga, dia meliahat taman-taman dan keindahan surga lalu terdiam dengan tertegun sesuai apa yang Allah kehendaki. Kemudian orang itu berkata, 'Ya Rabb, dekatkan aku ke pintu surga! ' Allah Azza Wa Jalla berfirman: 'Bukankah kamu telah berjanji dan mengikat perjanjian untuk tidak meminta sesuatu setelah permintaan kamu sebelumnya?\" Orang itu menjawab, 'Ya Rabb, aku tidak mau menjadi ciptaanM-u yang paling celaka.' Allah kembali bertanya: 'Apakah kamu bila telah diberikan permintaanmu sekarang ini, nantinya kamu tidak akan meminta yang lain lagi?\" Orang itu menjawab, 'Tidak, demi kemuliaan-Mu. Aku tidak akan meminta yang lain setelah ini.' Maka Rabbnya memberikan kepadanya janji dan ikatan sesuai apa yang dikehendati orang tersebut. Lalu orang tersebut didekatkan ke pintu surga. Maka manakala orang itu sudah sampai di pintu surga, dia melihat keindahan surga dan taman-taman yang hijau serta kegembiraan yang terdapat didalamnya, orang itu terdiam dengan tertegun sesuai apa yang Allah kehendaki. Kemudian orang itu berkata, 'Ya Rabb, masukkanlah aku ke surga! ' Allah berfirman: 'Celakalah kamu dari sikap kamu yang tidak menepati janji. Bukankah kamu telah berjanji dan mengikat perjanjian untuk tidak meminta sesuatu setelah kamu diberikan apa yang kamu pinta?\" Orang itu berkata, 'Ya Rabb, janganlah Engkau menjadikan aku ciptaan-Mu yang paling celaka.' Maka Allah Azza Wa Jalla tertawa mendengarnya. Lalu Allah mengizinkan orang itu memasuki surga. Setelahitu Allah Azza Wa Jalla berfirman: 'Bayangkanlah! ' Lalu orang itu membayangkan hingga setelah selesai apa yang ia bayangkan, Allah berfirman kepadanya: 'Dari sini.' Dan demikianlah Rabbnya mengingatkan orang tersebut hingga manakala orang tersebut selesai membayangkan, Allah berfirman lagi: \"Ini semua untuk kamu dan yang serupa dengannya.\" [Abu Sa'id Al Khudri] berkata kepada Abu Hurairah, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah berfirman: 'Ini semua untukmu dan sepuluh macam yang serupa dengannya.' [Abu Hurairah] berkata, \"Aku tidak mengingat dari Rasulullah shallallahu 'alaihi wasallam kecuali sabdanya: \"Ini semua untuk kamu dan yang serupa dengannya.\" Abu Sa'id Al Khudri berkata, \"Sungguh aku mendengar Beliau menyebutkan: 'Ini semua untukmu dan sepuluh macam yang serupa dengannya'.\""
            },
            {
                "number": 765,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ حَدَّثَنِي بَكْرُ بْنُ مُضَرَ عَنْ جَعْفَرٍ عَنْ ابْنِ هُرْمُزَ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى فَرَجَ بَيْنَ يَدَيْهِ حَتَّى يَبْدُوَ بَيَاضُ إِبْطَيْهِوَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepadaku [Bakar bin Mudlar] dari [Ja'far] dari [Ibnu Hurmuz] dari ['Abdullah bin Malik bin Buhainah], bahwa jika Nabi shallallahu 'alaihi wasallam melaksanakan sholat, beliau membentangkan kedua lengannya hingga tampak putih ketiaknya.\" [Al Laits] berkata; [Ja'far bin Rabi'ah] menceritakan kepadaku seperti itu.\""
            },
            {
                "number": 766,
                "arab": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ عَنْ وَاصِلٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَرَأَى رَجُلًا لَا يُتِمُّ رُكُوعَهُ وَلَا سُجُودَهُ فَلَمَّا قَضَى صَلَاتَهُ قَالَ لَهُ حُذَيْفَةُ مَا صَلَّيْتَ قَالَ وَأَحْسِبُهُ قَالَ وَلَوْ مُتَّ مُتَّ عَلَى غَيْرِ سُنَّةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ash Shalt bin Muhammad] berkata, telah menceritakan kepada kami [Mahdi bin Maimun] dari [Washil] dari [Abu Wa'il] dari [Hudzaifah], bahwa dia melihat seorang laki-laki sholat namun tidak menyempurnakan rukuk dan sujudnya. Setelah laki-laki tersebut selesai dari sholatnya, Hudzaifah berkata kepadanya, \"Kamu belumlah sholat.\" Abu Wail berkata, \"Menurutku ia mengatakan, \"Seandainya engkau mati, maka engkau mati bukan di atas sunnah Muhammad shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 767,
                "arab": "حَدَّثَنَا قَبِيصَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأُمِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةِ أَعْضَاءٍ وَلَا يَكُفَّ شَعَرًا وَلَا ثَوْبًا الْجَبْهَةِ وَالْيَدَيْنِ وَالرُّكْبَتَيْنِ وَالرِّجْلَيْنِ",
                "id": "Telah menceritakan kepada kami [Qabishah] berkata, telah menceritakan kepada kami [Sufyan] dari ['Amru bin Dinar] dari [Thawus] dari [Ibnu 'Abbas]: \"Nabi shallallahu 'alaihi wasallam diperintahkan untuk melaksanakan sujud dengan tujuh anggota sujud; muka, kedua telapak tangan, kedua lutut dan kedua kaki tidak boleh terhalang oleh rambut atau pakaian.\""
            },
            {
                "number": 768,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرٍو عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْنَا أَنْ نَسْجُدَ عَلَى سَبْعَةِ أَعْظُمٍ وَلَا نَكُفَّ ثَوْبًا وَلَا شَعَرًا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Syu'bah] dari ['Amru] dari [Thawus] dari [Ibnu 'Abbas] radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kami diperintahkan untuk melaksanakan sujud dengan tujuh tulang (anggota sujud), dan dilarang menahan rambut atau pakaian (sehingga menghalangi anggota sujud).\""
            },
            {
                "number": 769,
                "arab": "حَدَّثَنَا آدَمُ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ حَدَّثَنَا الْبَرَاءُ بْنُ عَازِبٍ وَهُوَ غَيْرُ كَذُوبٍ قَالَكُنَّا نُصَلِّي خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ لَمْ يَحْنِ أَحَدٌ مِنَّا ظَهْرَهُ حَتَّى يَضَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَبْهَتَهُ عَلَى الْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Isra'il] dari [Abu Ishaq] dari ['Abdullah bin Yazid Al Khaththami] telah menceritakan kepada kami [Al Bara' bin 'Azib] -dan dia bukanlah pendusta- bahwa dia berkata, \"Kami pernah sholat di belakang Nabi shallallahu 'alaihi wasallam, ketika beliau mengucapkan: 'SAMI'ALLAHU LIMAN HAMIDAH (Semoga Allah mendengar pujian orang yang memuji-Nya) ', tidak seorang pun dari kami yang membungkukkan punggungnya hingga Nabi shallallahu 'alaihi wasallam meletakkan keningnya di atas tanah.\""
            },
            {
                "number": 770,
                "arab": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةِ أَعْظُمٍ عَلَى الْجَبْهَةِ وَأَشَارَ بِيَدِهِ عَلَى أَنْفِهِ وَالْيَدَيْنِ وَالرُّكْبَتَيْنِ وَأَطْرَافِ الْقَدَمَيْنِ وَلَا نَكْفِتَ الثِّيَابَ وَالشَّعَرَ",
                "id": "Telah menceritakan kepada kami [Mu'alla bin Asad] berkata, telah menceritakan kepada kami [Wuhaib] dari ['Abdullah bin Thawus] dari [Bapaknya] dari [Ibnu 'Abbas] radliallahu 'anhu, ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Aku diperintahkan untuk melaksanakan sujud dengan tujuh tulang (anggota sujud); kening -beliau lantas memberi isyarat dengan tangannya menunjuk hidung- kedua telapak tangan, kedua lutut dan ujung jari dari kedua kaki dan tidak boleh menahan rambut atau pakaian (sehingga menghalangi anggota sujud).\""
            },
            {
                "number": 771,
                "arab": "حَدَّثَنَا مُوسَى قَالَ حَدَّثَنَا هَمَّامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ قَالَ انْطَلَقْتُ إِلَى أَبِي سَعِيدٍ الْخُدْرِيِّفَقُلْتُ أَلَا تَخْرُجُ بِنَا إِلَى النَّخْلِ نَتَحَدَّثُ فَخَرَجَ فَقَالَ قُلْتُ حَدِّثْنِي مَا سَمِعْتَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي لَيْلَةِ الْقَدْرِ قَالَ اعْتَكَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشْرَ الْأُوَلِ مِنْ رَمَضَانَ وَاعْتَكَفْنَا مَعَهُ فَأَتَاهُ جِبْرِيلُ فَقَالَ إِنَّ الَّذِي تَطْلُبُ أَمَامَكَ فَاعْتَكَفَ الْعَشْرَ الْأَوْسَطَ فَاعْتَكَفْنَا مَعَهُ فَأَتَاهُ جِبْرِيلُ فَقَالَ إِنَّ الَّذِي تَطْلُبُ أَمَامَكَ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا صَبِيحَةَ عِشْرِينَ مِنْ رَمَضَانَ فَقَالَ مَنْ كَانَ اعْتَكَفَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيَرْجِعْ فَإِنِّي أُرِيتُ لَيْلَةَ الْقَدْرِ وَإِنِّي نُسِّيتُهَا وَإِنَّهَا فِي الْعَشْرِ الْأَوَاخِرِ فِي وِتْرٍ وَإِنِّي رَأَيْتُ كَأَنِّي أَسْجُدُ فِي طِينٍ وَمَاءٍ وَكَانَ سَقْفُ الْمَسْجِدِ جَرِيدَ النَّخْلِ وَمَا نَرَى فِي السَّمَاءِ شَيْئًا فَجَاءَتْ قَزْعَةٌ فَأُمْطِرْنَا فَصَلَّى بِنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى رَأَيْتُ أَثَرَ الطِّينِ وَالْمَاءِ عَلَى جَبْهَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَرْنَبَتِهِ تَصْدِيقَ رُؤْيَاهُ",
                "id": "Telah menceritakan kepada kami [Musa] berkata, telah menceritakan kepada kami [Hammam] dari [Yahya] dari [Abu Salamah] berkata, Aku pergi menemui [Abu Sa'id Al Khudri], lalu aku bertanya kepadanya, \"Maukah anda pergi bersama kami ke bawah pohon kurma lalu kita berbincang-bincang di sana?\" Ia pun pergi dan bercakap-cakap bersama kami. Aku kemudian berkata, \"Ceritakanlah kepadaku apa yang pernah anda dengar dari Nabi shallallahu 'alaihi wasallam tentang Lailatul Qadar.\" Dia lalu menjelaskan, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan i'tikaf pada sepuluh malam yang awal dari Ramadan, dan kami juga ikut beri'tikaf bersama beliau. Lalu datanglah Malaikat Jibril berkata, \"Sesungguhnya apa yang kamu cari ada di depan kamu (pada malam berikutnya).\" Maka Beliau beri'tikaf pada sepuluh malam pertengahannnya dan kami pun ikut beri'tikaf bersama Beliau. Kemudian Malaikat Jibril datang lagi dan berkata, \"Sesungguhnya apa yang kamu cari ada di depan kamu (pada malam berikutnya).\" Maka Nabi shallallahu 'alaihi wasallam berdiri memberi khuthbah kepada kami pada pagi hari di hari ke dua puluh dari bulan Ramadan, sabdanya: \"Barangsiapa sudah beri'tikaf bersama Nabi shallallahu 'alaihi wasallam maka pulanglah, karena aku diperlihatkan (dalam mimpi) Lailatul Qadar namun aku dilupakan waktunya yang pasti. Namun dia ada pada sepuluh malam-malam akhir dan pada malam yang ganjil. Sungguh aku melihat dalam mimpi, bahwa aku sujud di atas tanah dan air (yang becek).\" Pada masa itu atap masjid masih terbuat dari daun dan pelepah pohon kurma, dan kami tidak melihat sesuatu di atas langit hingga kemudian datang awan dan turunlah air hujan. Maka Nabi shallallahu 'alaihi wasallam sholat bersama kami hingga aku melihat sisa-sisa tanah dan air pada wajah dan ujung hidung Rasulullah shallallahu 'alaihi wasallam sebagai bukti kebenaran mimpi beliau.\""
            },
            {
                "number": 772,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَكَانَ النَّاسُ يُصَلُّونَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمْ عَاقِدُوا أُزْرِهِمْ مِنْ الصِّغَرِ عَلَى رِقَابِهِمْ فَقِيلَ لِلنِّسَاءِ لَا تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَسْتَوِيَ الرِّجَالُ جُلُوسًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Sufyan] dari [Abu Hazim] dari [Sahal bin Sa'd] berkata, \"Orang-orang sholat bersama Nabi shallallahu 'alaihi wasallam dengan mengikatkan kain mereka di leher-leher karena kainnya kecil. Lalu dikatakan kepada Kaum Wanita: \"Janganlah kalian mengangkat kepala kalian hingga para laki-laki telah duduk.\""
            },
            {
                "number": 773,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ قَالَ حَدَّثَنَا حَمَّادٌ وَهْوَ ابْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَأُمِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةِ أَعْظُمٍ وَلَا يَكُفَّ ثَوْبَهُ وَلَا شَعَرَهُ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- dari ['Amru bin Dinar] dari [Thawus] dari [Ibnu 'Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam diperintahkan untuk melaksanakan sujud dengan tujuh anggota sujud, tidak boleh mengumpulkan rambutnya atau pakaiannya (sehingga menghalangi anggota sujud).\""
            },
            {
                "number": 774,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَمْرٍو عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةٍ لَا أَكُفُّ شَعَرًا وَلَا ثَوْبًا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Abu 'Awanah] dari ['Amru] dari [Thawus] dari [Ibnu 'Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Aku diperintahkan untuk melaksanakan sujud dengan tujuh anggota sujud, dan dilarang mengumpulkan rambut atau pakaian (sehingga menghalangi anggota sujud).\""
            },
            {
                "number": 775,
                "arab": "حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي مَنْصُورُ بْنُ الْمُعْتَمِرِ عَنْ مُسْلِمٍ هُوَ ابْنُ صُبَيْحٍ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ أَنْ يَقُولَ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي يَتَأَوَّلُ الْقُرْآنَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sufyan] berkata, telah menceritakan kepadaku [Manshur bin Al Mu'tamir] dari [Muslim] -yaitu Ibnu Shubaih Abu Adl Dluha- dari [Masruq] dari ['Aisyah] berkata, \"Saat rukuk dan sujud Nabi shallallahu 'alaihi wasallam memperbanyak membaca do'a: 'SUBHAANAKALLAHUMMA RABBANAA WA BIHAMDIKA ALLAHUMMAGHFIRLII (Maha suci Engkau wahai Tuhan kami, segala puji bangi-Mu, ya Allah ampunilah aku) ', sebagai pengamalan perintah al-qur'an.\""
            },
            {
                "number": 776,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ أَنَّ مَالِكَ بْنَ الْحُوَيْرِثِ قَالَ لِأَصْحَابِهِأَلَا أُنَبِّئُكُمْ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَذَاكَ فِي غَيْرِ حِينِ صَلَاةٍ فَقَامَ ثُمَّ رَكَعَ فَكَبَّرَ ثُمَّ رَفَعَ رَأْسَهُ فَقَامَ هُنَيَّةً ثُمَّ سَجَدَ ثُمَّ رَفَعَ رَأْسَهُ هُنَيَّةً فَصَلَّى صَلَاةَ عَمْرِو بْنِ سَلِمَةَ شَيْخِنَا هَذَا قَالَ أَيُّوبُ كَانَ يَفْعَلُ شَيْئًا لَمْ أَرَهُمْ يَفْعَلُونَهُ كَانَ يَقْعُدُ فِي الثَّالِثَةِ وَالرَّابِعَةِ قَالَ فَأَتَيْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَمْنَا عِنْدَهُ فَقَالَ لَوْ رَجَعْتُمْ إِلَى أَهْلِيكُمْ صَلُّوا صَلَاةَ كَذَا فِي حِينِ كَذَا صَلُّوا صَلَاةَ كَذَا فِي حِينِ كَذَا فَإِذَا حَضَرَتْ الصَّلَاةُ فَلْيُؤَذِّنْ أَحَدُكُمْ وَلْيَؤُمَّكُمْ أَكْبَرُكُمْ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Malik bin Al Huwairits] ia berkata kepada para sahabatnya, \"Maukah kalian aku sampaikan cara sholat Rasulullah shallallahu 'alaihi wasallam?\" padahal saat itu bukan pada waktu sholat. Malik kemudian berdiri lalu rukuk dan bertakbir, kemudian mengangkat kepalanya lalu berdiri dan berdiam sejenak. Kemudian dia sujud, lalu mengangkat kepalanya, lalu (duduk) sejenak. Dia sholat seperti sholatnya 'Amru bin Salamah, guru kita ini.\" Ayyub berkata, \"Dia mengerjakan sesuatu yang tidak pernah aku lihat orang-orang melakukannya, dia duduk pada setiap akan berdiri ke rakaat ketiga dan keempat. Maka kami menemui Nabi shallallahu 'alaihi wasallam dan berdiam di sisi beliau. Beliau kemudian bersabda: \"Jika kalian kembali kepada keluarga kalian, maka sholatlah dengan cara ini pada waktu begini, dan sholat ini pada waktu begini. Jika telah datang waktu sholat maka hendaklah seseorang dari kalian adzan, dan hendaklah yang mengimami sholat adalah yang paling tua di antara kalian.\""
            },
            {
                "number": 777,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنَا أَبُو أَحْمَدَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الزُّبَيْرِيُّ قَالَ حَدَّثَنَا مِسْعَرٌ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ قَالَكَانَ سُجُودُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرُكُوعُهُ وَقُعُودُهُ بَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Abdurrahim] berkata, telah menceritakan kepada kami [Abu Ahmad Muhammad bin 'Abdullah Az Zubairi] berkata, telah menceritakan kepada kami [Mis'ar] dari [Al Hakam] dari ['Abdurrahman bin Abu Laila] dari [Al Bara'] berkata, \"Sujudnya Nabi shallallahu 'alaihi wasallam, rukuk, dan duduknya antara dua sujud semuanya hampir sama (panjangnya).\""
            },
            {
                "number": 778,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَإِنِّي لَا آلُو أَنْ أُصَلِّيَ بِكُمْ كَمَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِنَا قَالَ ثَابِتٌ كَانَ أَنَسُ بْنُ مَالِكٍ يَصْنَعُ شَيْئًا لَمْ أَرَكُمْ تَصْنَعُونَهُ كَانَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَامَ حَتَّى يَقُولَ الْقَائِلُ قَدْ نَسِيَ وَبَيْنَ السَّجْدَتَيْنِ حَتَّى يَقُولَ الْقَائِلُ قَدْ نَسِيَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas bin Malik] berkata, \"Aku tidak akan segan-segan untuk mencontohkan kepada kalian cara sholat sebagaimana aku melihat Nabi shallallahu 'alaihi wasallam melakanakan sholat bersama kami.\" Tsabit berkata, \"Anas bin Malik mengerjakan sesuatu yang belum pernah aku melihat kalian mengerjakannya. Dia mengangkat kepala dari rukuk lalu berdiri (lama sekali) hingga ada seseorang berkata, 'Dia lupa', dan jika duduk di antara dua sujud dia berdiam lama hingga ada seseorang berkata, 'Dia lupa'.\""
            },
            {
                "number": 779,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اعْتَدِلُوا فِي السُّجُودِ وَلَا يَبْسُطْ أَحَدُكُمْ ذِرَاعَيْهِ انْبِسَاطَ الْكَلْبِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] berkata, Aku mendengar [Qatadah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seimbanglah kalian salam sujud, dan janganlah salah seorang dari kalian membentangkan kedua sikunya sebagaimana anjing membentangkan tangannya.\""
            },
            {
                "number": 780,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ قَالَ أَخْبَرَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ قَالَ أَخْبَرَنَا مَالِكُ بْنُ الْحُوَيْرِثِ اللَّيْثِيُّأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فَإِذَا كَانَ فِي وِتْرٍ مِنْ صَلَاتِهِ لَمْ يَنْهَضْ حَتَّى يَسْتَوِيَ قَاعِدًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabah] berkata, telah mengabarkan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami [Khalid Al Hadzdza'] dari [Abu Qilabah] berkata, telah mengabarkan kepada kami [Malik bin Al Huwairits AL Laitsi], bahwa dia melihat Nabi shallallahu 'alaihi wasallam melaksanakan sholat, jika sampai pada rakaat yang ganjil, maka beliau tidak bangkit berdiri hingga duduk sejenak.\""
            },
            {
                "number": 781,
                "arab": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ قَالَ جَاءَنَا مَالِكُ بْنُ الْحُوَيْرِثِفَصَلَّى بِنَا فِي مَسْجِدِنَا هَذَا فَقَالَ إِنِّي لَأُصَلِّي بِكُمْ وَمَا أُرِيدُ الصَّلَاةَ وَلَكِنْ أُرِيدُ أَنْ أُرِيَكُمْ كَيْفَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَالَ أَيُّوبُ فَقُلْتُ لِأَبِي قِلَابَةَ وَكَيْفَ كَانَتْ صَلَاتُهُ قَالَ مِثْلَ صَلَاةِ شَيْخِنَا هَذَا يَعْنِي عَمْرَو بْنَ سَلِمَةَ قَالَ أَيُّوبُ وَكَانَ ذَلِكَ الشَّيْخُ يُتِمُّ التَّكْبِيرَ وَإِذَا رَفَعَ رَأْسَهُ عَنْ السَّجْدَةِ الثَّانِيَةِ جَلَسَ وَاعْتَمَدَ عَلَى الْأَرْضِ ثُمَّ قَامَ",
                "id": "Telah menceritakan kepada kami [Mu'allaa bin Asad] berkata, telah menceritakan kepada kami [Wuhaib] dari [Ayyub] dari [Abu Qilabah] berkata, \" [Malik bin Al Huwairits] datang kepada kami lalu sholat bersama di masjid milik ini, kemudian berkata, \"Aku bukan ingin melaksanakan sholat, tapi aku akan menerangkan kepada kalian bagaimana Nabi shallallahu 'alaihi wasallam melaksanakan sholat.\" Ayyub berkata, \"Lalu aku bertanya kepada Abu Qilabah, \"Bagaimana cara sholat dia?\" Abu Qilabah menjawab, \"Seperti sholatnya guru (syaikh) kita ini, yaitu 'Amru bin Salamah.\" Ayyub berkata, \"Guru kita itu selalu menyempurnakan takbir. Dan jika mengangkat kepalanya dari sujud yang kedua dia duduk di atas tanah, kemudian baru berdiri.\""
            },
            {
                "number": 782,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ قَالَ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ الْحَارِثِ قَالَ صَلَّى لَنَا أَبُو سَعِيدٍفَجَهَرَ بِالتَّكْبِيرِ حِينَ رَفَعَ رَأْسَهُ مِنْ السُّجُودِ وَحِينَ سَجَدَ وَحِينَ رَفَعَ وَحِينَ قَامَ مِنْ الرَّكْعَتَيْنِ وَقَالَ هَكَذَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Shalih] berkata, telah menceritakan kepada kami [Fulaih bin Sulaiman] dari [Sa'id bin Al Harits] berkata, \" [Abu Sa'id] memimpin kami sholat, dia lalu mengeraskan bacaan takbirnya ketika mengangkat kepala dari sujud, ketika mau sujud, ketika mengangkat (kepala dari sujud) dan ketika bangkit berdiri dari rakaat kedua, setelah itu ia berkata, \"Begitulah aku melihat Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 783,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ حَدَّثَنَا غَيْلَانُ بْنُ جَرِيرٍ عَنْ مُطَرِّفٍ قَالَ صَلَّيْتُ أَنَا وَعِمْرَانُصَلَاةً خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ فَكَانَ إِذَا سَجَدَ كَبَّرَ وَإِذَا رَفَعَ كَبَّرَ وَإِذَا نَهَضَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ فَلَمَّا سَلَّمَ أَخَذَ عِمْرَانُ بِيَدِي فَقَالَ لَقَدْ صَلَّى بِنَا هَذَا صَلَاةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ لَقَدْ ذَكَّرَنِي هَذَا صَلَاةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Ghailan bin Jarir] dari [Mutharrif] berkata, \"Aku dan 'Imran pernah sholat di belakang 'Ali bin Abu Thalib? radliallahu 'anhu, jika sujud ia bertakbir, jika rukuk ia bertakbir, jika mengangkat (kepala dari sujud) ia bertakbir, jika bangkit berdiri dari rakaat ia juga bertabir. Selesai salam, ['Imran] memegang tanganku lalu berkata, \"Sungguh dia telah sholat bersama kita dengan tata cara sholatnya Muhammad shallallahu 'alaihi wasallam.\" Atau dia berkata, \"Sungguh dengan sholatnya ini dia telah mengingatkan aku tentang sholatnya Muhammad shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 784,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّهُ أَخْبَرَهُ أَنَّهُ كَانَ يَرَى عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَايَتَرَبَّعُ فِي الصَّلَاةِ إِذَا جَلَسَ فَفَعَلْتُهُ وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ فَنَهَانِي عَبْدُ اللَّهِ بْنُ عُمَرَ وَقَالَ إِنَّمَا سُنَّةُ الصَّلَاةِ أَنْ تَنْصِبَ رِجْلَكَ الْيُمْنَى وَتَثْنِيَ الْيُسْرَى فَقُلْتُ إِنَّكَ تَفْعَلُ ذَلِكَ فَقَالَ إِنَّ رِجْلَيَّ لَا تَحْمِلَانِي",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari ['Abdurrahman bin Al Qasim] dari ['Abdullah bin 'Abdullah] ia mengabarkan kepadanya, bahwa dia pernah melihhat ['Abdullah bin 'Umar] radliallahu 'anhuma mengerjakan sholat dengan cara bersimpuh dengan kedua kakinya ketika duduk. Maka aku juga melakukan hal serupa. Saat itu aku masih berusia muda. Namun 'Abdullah bin 'Umar melarangku berbuat seperti itu. Ia mengatakan, \"Sesungguhnya yang sesuai sunnah adalah kamu menegakkan telapak kakimu yang kanan sedangkan yang kiri kamu masukkan dibawahnya (melipat).\" Aku pun berkata, \"Tapi aku melihat anda melakukan hal itu!\" Dia menjawab, \"Kakiku tidak mampu.\""
            },
            {
                "number": 785,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ خَالِدٍ عَنْ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ وَحَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ وَيَزِيدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ أَنَّهُ كَانَ جَالِسًا مَعَ نَفَرٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا صَلَاةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَبُو حُمَيْدٍ السَّاعِدِيُّأَنَا كُنْتُ أَحْفَظَكُمْ لِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَيْتُهُ إِذَا كَبَّرَ جَعَلَ يَدَيْهِ حِذَاءَ مَنْكِبَيْهِ وَإِذَا رَكَعَ أَمْكَنَ يَدَيْهِ مِنْ رُكْبَتَيْهِ ثُمَّ هَصَرَ ظَهْرَهُ فَإِذَا رَفَعَ رَأْسَهُ اسْتَوَى حَتَّى يَعُودَ كُلُّ فَقَارٍ مَكَانَهُ فَإِذَا سَجَدَ وَضَعَ يَدَيْهِ غَيْرَ مُفْتَرِشٍ وَلَا قَابِضِهِمَا وَاسْتَقْبَلَ بِأَطْرَافِ أَصَابِعِ رِجْلَيْهِ الْقِبْلَةَ فَإِذَا جَلَسَ فِي الرَّكْعَتَيْنِ جَلَسَ عَلَى رِجْلِهِ الْيُسْرَى وَنَصَبَ الْيُمْنَى وَإِذَا جَلَسَ فِي الرَّكْعَةِ الْآخِرَةِ قَدَّمَ رِجْلَهُ الْيُسْرَى وَنَصَبَ الْأُخْرَى وَقَعَدَ عَلَى مَقْعَدَتِهِوَسَمِعَ اللَّيْثُ يَزِيدَ بْنَ أَبِي حَبِيبٍ وَيَزِيدُ مِنْ مُحَمَّدِ بْنِ حَلْحَلَةَ وَابْنُ حَلْحَلَةَ مِنْ ابْنِ عَطَاءٍ قَالَ أَبُو صَالِحٍ عَنْ اللَّيْثِ كُلُّ فَقَارٍ وَقَالَ ابْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَيُّوبَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ أَنَّ مُحَمَّدَ بْنَ عَمْرٍو حَدَّثَهُ كُلُّ فَقَارٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Al Laits] dari [Khalid] dari [Sa'id] dari [Muhammad bin 'Amru bin Halhalah] dari [Muhammad bin 'Amru bin 'Atha'], dan telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dan [Yazid bin Muhammad] dari [Muhammad bin 'Amru bin Halhalah] dari [Muhammad bin 'Amru bin 'Atha'], bahwasanya dia duduk bersama beberapa orang sahabat Nabi shallallahu 'alaihi wasallam, mereka bercerita tentang sholatnya Nabi shallallahu 'alaihi wasallam. Maka berkatalah [Abu Hamid As Sa'idi], \"Aku adalah orang yang paling hafal dengan sholatnya Rasulullah shallallahu 'alaihi wasallam, jika sholat aku melihat beliau takbir dengan mengangkat kedua tangannya sejajar dengan pundaknya, jika rukuk maka beliau menempatkan kedua tangannya pada lutut dan meluruskan punggungnya. Jika mengangkat kepalanya, beliau berdiri lurus hingga seluruh tulung punggungnya kembali pada tempatnya semula. Dan jika sujud maka beliau meletakkan tangannya dengan tidak menempelkan lengannya ke tanah atau badannya, dan dalam posisi sujud itu beliau menghadapkan jari-jari kakinya ke arah kiblat. Apabila duduk pada rakaat kedua, beliau duduk di atas kakinya yang kiri dan menegakkan kakinya yang kanan. Dan jika duduk pada rakaat terakhir, maka beliau memasukkan kaki kirinya (di bawah kaki kananya) dan menegakkan kaki kanannya dan beliau duduk pada tempat duduknya.\" Dan [Al Laits] telah mendengar dari [Yazid bin Abu Habib], dan Yazid dari [Muhammad bin Halhalah], dan Ibnu Halhalah dari [Ibnu 'Atha']. [Abu Shalih] menyebutkan dari [Al Laits], \"Seluruh tulung punggung.\" [Ibnu Al Mubarak] berkata dari [Yahya bin Ayyub] ia berkata, telah menceritakan kepadaku [Yazid bin Abu Habib] bahwa [Muhammad bin 'Amru] menceritakan kepadanya, \"Seluruh tulung punggung.\""
            },
            {
                "number": 786,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ مَوْلَى بَنِي عَبْدِ الْمُطَّلِبِ وَقَالَ مَرَّةً مَوْلَى رَبِيعَةَ بْنِ الْحَارِثِ أَنَّ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ وَهُوَ مِنْ أَزْدِ شَنُوءَةَ وَهُوَ حَلِيفٌ لِبَنِي عَبْدِ مَنَافٍ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ الظَّهْرَ فَقَامَ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ لَمْ يَجْلِسْ فَقَامَ النَّاسُ مَعَهُ حَتَّى إِذَا قَضَى الصَّلَاةَ وَانْتَظَرَ النَّاسُ تَسْلِيمَهُ كَبَّرَ وَهُوَ جَالِسٌ فَسَجَدَ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ ثُمَّ سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah menceritakan kepadaku ['Abdurrahman bin Hurmuz] mantan budak Bani 'Abdul Muthalib -sekali waktu ia menyebutkan- mantan budak Rabi'ah bin Al Harits, bahwa ['Abdullah Ibnu Buhainah] dia berasal dari suku Azdi Sya'unah, sekutunya Bani 'Abdu Manaf, dan dia adalah seorang sahabat Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam pernah sholat Zhuhur bersama mereka, lalu beliau berdiri pada dua rakaat yang pertama dan tidak duduk (untuk tasyahud), dan orang-orang ikut berdiri. Sehingga ketika sholat akan selesai, dan orang-orang menanti salamnya, beliau bertakbir dalam posisi duduk, lalu sujud dua kali sebelum salam, setelahitu baru beliau salam.\""
            },
            {
                "number": 787,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا بَكْرٌ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ الْأَعْرَجِ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فَقَامَ وَعَلَيْهِ جُلُوسٌ فَلَمَّا كَانَ فِي آخِرِ صَلَاتِهِ سَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Bakar] dari [Ja'far bin Rabi'ah] dari [Al A'raj] dari [Abdullah bin Malik Ibnu Buhainah] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah sholat Zhuhur bersama kami, lalu beliau berdiri yang semestinya beliau duduk. Kemudian di akhir sholatnya, beliau sujud dua kali dalam posisi duduk.\""
            },
            {
                "number": 788,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقِ بْنِ سَلَمَةَ قَالَ قَالَ عَبْدُ اللَّهِكُنَّا إِذَا صَلَّيْنَا خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْنَا السَّلَامُ عَلَى جِبْرِيلَ وَمِيكَائِيلَ السَّلَامُ عَلَى فُلَانٍ وَفُلَانٍ فَالْتَفَتَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ هُوَ السَّلَامُ فَإِذَا صَلَّى أَحَدُكُمْ فَلْيَقُلْ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ فَإِنَّكُمْ إِذَا قُلْتُمُوهَا أَصَابَتْ كُلَّ عَبْدٍ لِلَّهِ صَالِحٍ فِي السَّمَاءِ وَالْأَرْضِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Al A'masy] dari [Syaqiq bin Salamah] berkata, berkata, \" [Abdullah] berkata, \"Jika kami sholat di belakang Nabi shallallahu 'alaihi wasallam, kami membaca: 'ASSALAAMU 'ALAA JIBRIL WA MIKAA'IL. ASSALAAMU 'ALAA FULAN WA FULAN (Semoga kesejahteraan terlimpahkan kepada malaikat Jibril dan Mika'il, dan semoga kesejahteraan terlimpahkan kepada si anu dan si anu) '. Lalu Rasulullah shallallahu 'alaihi wasallam menoleh ke arah kami seraya bersabda: \"Sesungguhnya Allah, Dialah As-Salaam. Maka jika seseorang dari kalian sholat, hendaklah ia membaca: 'ATTAHIYYAATU LILLAHI WASHSHALAWAATU WATHTHAYYIBAAT. ASSALAAMU 'ALAIKA AYYUHANNABIYYU WA RAHMATULLAHI WA BARAKAATUH. ASSALAAMU 'ALAINAA WA 'ALAA 'IBAADILLAHISH SHAALIHIIN (Segala penghormatan hanya milik Allah, juga segala pengagungan dan kebaikan. Semoga kesejahteraan terlimpahkan kepada engkau wahai Nabi dan juga rahmat dan berkah-Nya. Dan juga semoga kesejahteraan terlimpahkan kepada kami dan kepada hamba-hamba Allah yang shalih) '. Sesungguhnya jika kalian mengucapkan seperti ini, maka kalian telah mengucapkan salam kepada seluruh hamba Allah yang shalih di langit maupun di bumi. (Dan lanjutkanlah dengan bacaan): 'ASYHADU ALLAA ILAAHA ILLALLAH WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Aku bersaksi tidak ada tuhan yang berhak disembah selain Allah, dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya').\""
            },
            {
                "number": 789,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنَا عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو فِي الصَّلَاةِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَفِتْنَةِ الْمَمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْمَأْثَمِ وَالْمَغْرَمِ فَقَالَ لَهُ قَائِلٌ مَا أَكْثَرَ مَا تَسْتَعِيذُ مِنْ الْمَغْرَمِ فَقَالَ إِنَّ الرَّجُلَ إِذَا غَرِمَ حَدَّثَ فَكَذَبَ وَوَعَدَ فَأَخْلَفَوَعَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَعِيذُ فِي صَلَاتِهِ مِنْ فِتْنَةِ الدَّجَّالِ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepada kami ['Urwah bin Az Zubair] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia telah mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam di dalam sholat membaca do'a: 'ALLAHUMMA INNII A'UUDZU BIKA MIN 'ADZAABIL QABRI, WA A'UUDZU BIKA MIN FITNATIL MASIIHID DAJJAAL, WA A'UUDZU BIKA MIN FITNATIL MAHYAA WA FITNATIL MAMAAT. ALLAHUMMA INNII A'UUDZU BIKA MINAL MA'TSAMI WAL MAGHRAM (Ya Allah, aku berlindung kepada-Mu dari siksa kubur dan aku berlindung kepada-Mu dari fitnah Al Masihid Dajjal, dan aku berlindung kepada-Mu dari fitnah kehidupan dan fitnah kematian. Ya Allah, aku berlindung kepada-Mu dari perbuatan dosa dan hutang) '. Tiba-tiba ada seseorang berkata kepada beliau, \"Kenapa tuan banyak meminta perlindungan dari hutang?\" Beliau menjawab, \"Sesungguhnya seseorang apabila berhutang dia akan cenderung berkata dusta dan berjanji lalu mengingkarinya.\" Dan dari Az Zuhri ia berkata, 'Urwah bin Az Zubair telah mengabarkan kepadaku, bahwa 'Aisyah? radliallahu 'anha berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam dalam sholatnya meminta perlindungan dari fitnah Dajjal.\""
            },
            {
                "number": 790,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُأَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلَاتِي قَالَ قُلْ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّك أَنْتَ الْغَفُورُ الرَّحِيمُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari ['Abdullah bin 'Amru] dari [Abu Bakar Ash Shiddiq] radliallahu 'anhu, ia berkata kepada Rasulullah shallallahu 'alaihi wasallam: \"Ajarkanlah aku suatu do'a yang bisa aku panjatkan saat sholat!\" Maka Beliau pun berkata: \"Bacalah 'ALLAHUMMA INNII ZHALAMTU NAFSII ZHULMAN KATSIIRAN WA LAA YAGHFIRUDZ DZUNUUBA ILLAA ANTA FAGHFIRLII MAGHFIRATAN MIN 'INDIKA WARHAMNII INNAKA ANTAL GHAFUURUR RAHIIM (Ya Allah, sungguh aku telah menzhalimi diriku sendiri dengan kezhaliman yang banyak, sedangkan tidak ada yang dapat mengampuni dosa-dosa kecuali Engkau. Maka itu ampunilah aku dengan suatu pengampunan dari sisi-Mu, dan rahmatilah aku. Sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang) '.\""
            },
            {
                "number": 791,
                "arab": "حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا يَحْيَى عَنْ الْأَعْمَشِ حَدَّثَنِي شَقِيقٌ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا إِذَا كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ قُلْنَا السَّلَامُ عَلَى اللَّهِ مِنْ عِبَادِهِ السَّلَامُ عَلَى فُلَانٍ وَفُلَانٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُولُوا السَّلَامُ عَلَى اللَّهِ فَإِنَّ اللَّهَ هُوَ السَّلَامُ وَلَكِنْ قُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ فَإِنَّكُمْ إِذَا قُلْتُمْ أَصَابَ كُلَّ عَبْدٍ فِي السَّمَاءِ أَوْ بَيْنَ السَّمَاءِ وَالْأَرْضِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ يَتَخَيَّرُ مِنْ الدُّعَاءِ أَعْجَبَهُ إِلَيْهِ فَيَدْعُو",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Al A'masy] telah menceritakan kepadaku [Syaqiq] dari ['Abdullah] berkata, \"Jika kami sholat bersama Nabi shallallahu 'alaihi wasallam, kami mengucapkan: \"ASSALAAMU 'ALAALLAH MIN 'IBAADIHIS SALAAMU 'ALAA FULAAN WA FULAAN (Semoga kesejahteraan terlimpahkan kepada Allah dari hamba-hamba Nya, dan semoga kesejahteraan terlimpahkan kepada si anu dan si anu) '. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengucapkan: 'ASSALAAMU 'ALAALLAH (Semoga kesejahteraan terlimpahkan kepada Allah) ', karena sesungguhnya Allah, Dialah As-Salaam. Akan tetapi bacalah: 'ATTAHIYYAATU LILLAHI WASHSHALAAWAATU WATHTHAYYIBAAT ASSALAAMU 'ALAIKA AYYUHANNABIYYU WA RAHMATULLAHI WA BARAKAATUH ASSALAAMU 'ALAINAA WA 'ALAA 'IBAADILLAHISH SHAALIHIIN (Segala penghormatan hanya milik Allah, juga segala pengagungan dan kebaikan. Semoga kesejahteraan terlimpahkan kepada engkau wahai Nabi dan juga rahmat dan berkah-Nya. Semoga kesejahteraan terlimpahkan kepada kami dan kepada hamba-hamba Allah yang shalih). Karena apabila kalian mengucapkan seperti ini, maka berarti kalian telah mengucapkan salam kepada seluruh yang ada di langit atau yang berada di antara langit dan bumi.\" (Dan lanjutkanlah dengan bacaan): 'ASYHADU ALLAA ILAAHA ILLALLAH WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Aku bersaksi tidak ada tuhan yang berhak disembah selain Allah, dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya) '. Lalu ia memilih do'a yang paling ia sukai kemudian berdo'a dengannya.\""
            },
            {
                "number": 792,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ قَالَ سَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ فَقَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ فِي الْمَاءِ وَالطِّينِ حَتَّى رَأَيْتُ أَثَرَ الطِّينِ فِي جَبْهَتِهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] berkata, \"Aku bertanya kepada [Abu Sa'id Al Khudri] (tentang Lailatul Qadar). Lalu ia menjawab, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam sujud di atas air dan lumpur hingga aku bisa melihat bekas lumpur itu di dahi beliau.\""
            },
            {
                "number": 793,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ حَدَّثَنَا الزُّهْرِيُّ عَنْ هِنْدٍ بِنْتِ الْحَارِثِ أَنَّ أُمَّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ قَامَ النِّسَاءُ حِينَ يَقْضِي تَسْلِيمَهُ وَمَكَثَ يَسِيرًا قَبْلَ أَنْ يَقُومَقَالَ ابْنُ شِهَابٍ فَأُرَى وَاللَّهُ أَعْلَمُ أَنَّ مُكْثَهُ لِكَيْ يَنْفُذَ النِّسَاءُ قَبْلَ أَنْ يُدْرِكَهُنَّ مَنْ انْصَرَفَ مِنْ الْقَوْمِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] telah menceritakan kepada kami [Az Zuhri] dari [Hind binti Al Harits] bahwa [Ummu Salamah] radliallahu 'anha berkata, \"Apabila Rasulullah shallallahu 'alaihi wasallam mengucapkan salam, maka seketika selesainya salam beliau itu pula mereka langsung bangkit, sementara beliau berdiam diri sebentar sebelum berdiri.\" Ibnu Syihab berkata, \"Menurutku -dan hanya Allah yang tahu- beliau melakukan itu agar kaum wanita punya kesempatan untuk pergi sehingga seseorang yang berlalu pulang dari kalangan laki-laki tidak bertemu dengan mereka.\""
            },
            {
                "number": 794,
                "arab": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ مَحْمُودِ بْنِ الرَّبِيعِ عَنْ عِتْبَانَ بْنِ مَالِكٍ قَالَصَلَّيْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْنَا حِينَ سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Hibban bin Musa] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Mahmud bin Ar Rabi'] dari ['Itban bin Malik] berkata, \"Kami pernah sholat bersama Nabi shallallahu 'alaihi wasallam, maka kami salam ketika beliau salam.\""
            },
            {
                "number": 795,
                "arab": "حَدَّثَنَا عَبْدَانُ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِوَزَعَمَ أَنَّهُ عَقَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَقَلَ مَجَّةً مَجَّهَا مِنْ دَلْوٍ كَانَ فِي دَارِهِمْ قَالَ سَمِعْتُ عِتْبَانَ بْنَ مَالِكٍ الْأَنْصارِيَّ ثُمَّ أَحَدَ بَنِي سَالِمٍ قَالَ كُنْتُ أُصَلِّي لِقَوْمِي بَنِي سَالِمٍ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي أَنْكَرْتُ بَصَرِي وَإِنَّ السُّيُولَ تَحُولُ بَيْنِي وَبَيْنَ مَسْجِدِ قَوْمِي فَلَوَدِدْتُ أَنَّكَ جِئْتَ فَصَلَّيْتَ فِي بَيْتِي مَكَانًا حَتَّى أَتَّخِذَهُ مَسْجِدًا فَقَالَ أَفْعَلُ إِنْ شَاءَ اللَّهُ فَغَدَا عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ مَعَهُ بَعْدَ مَا اشْتَدَّ النَّهَارُ فَاسْتَأْذَنَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى قَالَ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ فَأَشَارَ إِلَيْهِ مِنْ الْمَكَانِ الَّذِي أَحَبَّ أَنْ يُصَلِّيَ فِيهِ فَقَامَ فَصَفَفْنَا خَلْفَهُ ثُمَّ سَلَّمَ وَسَلَّمْنَا حِينَ سَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Abdan] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] berkata, telah mengabarkan kepadaku [Mahmud bin Ar Rabi'], dia mengklaim bahwa ia telah membuat perjanjian dengan Rasulullah shallallahu 'alaihi wasallam dan meminta keberkahan kewat air yang diambil dari sumur yang ada di dalam mereka. Dia berkata, Aku mendengar ['Itban bin Malik Al Anshari] kemudian seseorang dari suku Bani Salim berkata, \"Aku pernah memimpin sholat kaumku, Bani Salim. Pada kemudian hari aku menemui Nabi shallallahu 'alaihi wasallam, lalu aku berkata kepada beliau, \"Wahai Rasulullah, aku adalah orang yang sudah lemah penglihatan sedangkan genangan-genangan dari saluran air sering menghalangi antara aku dan masjid kaumku. Seandainya tuan berkenan, bolehlah tuan datang berkunjung lalu sholat di rumahku pada suatu tempat yang akan aku jadikan masjid.\" Maka Beliau berkata, \"Aku akan datang, Insyaallah.\" Kemudian beliau datang kepadaku bersama Abu Bakar di waktu siang yang terik. Nabi shallallahu 'alaihi wasallam lalu minta izin masuk dan aku pun mengizinkannya. Sebelum duduk beliau langsung bersabda: \"Mana tempat yang kau sukai untuk aku sholat padanya di rumahmu ini?\" Maka Itban memberi isyarat kepada Beliau tempat yang disukainya supaya Beliau sholat di tempat tersebut. Beliau lalu berdiri sholat dan kamipun berdiri sholat mengatur shaf di belakangnya. Kemudian Beliau mengakhiri sholat dengan salam, maka kamipun mengucapkan salam setelah Beliau salam.\""
            },
            {
                "number": 796,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَمْرٌو أَنَّ أَبَا مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ أَخْبَرَهُ أَنَّ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَخْبَرَهُأَنَّ رَفْعَ الصَّوْتِ بِالذِّكْرِ حِينَ يَنْصَرِفُ النَّاسُ مِنْ الْمَكْتُوبَةِ كَانَ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ ابْنُ عَبَّاسٍ كُنْتُ أَعْلَمُ إِذَا انْصَرَفُوا بِذَلِكَ إِذَا سَمِعْتُهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Nashir] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku ['Amru] bahwa [Abu Ma'bad] mantan budak Ibnu 'Abbas, mengabarkan kepadanya bahwa [Ibnu 'Abbas] radliallahu 'anhuma mengabarkan kepadanya, bahwa mengeraskan suara dalam berdzikir setelah orang selesai menunaikah sholat fardlu terjadi di zaman Nabi shallallahu 'alaihi wasallam. Ibnu 'Abbas mengatakan, \"Aku mengetahui bahwa mereka telah selesai dari sholat itu karena aku mendengarnya.\""
            },
            {
                "number": 797,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا عَمْرٌو قَالَ أَخْبَرَنِي أَبُو مَعْبَدٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَكُنْتُ أَعْرِفُ انْقِضَاءَ صَلَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالتَّكْبِيرِقَالَ عَلِيٌّ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو قَالَ كَانَ أَبُو مَعْبَدٍ أَصْدَقَ مَوَالِي ابْنِ عَبَّاسٍ قَالَ عَلِيٌّ وَاسْمُهُ نَافِذٌ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami ['Amru] berkata, telah mengabarkan kepadaku [Abu Ma'bad] dari [Ibnu 'Abbas] radliallahu 'anhuma berkata, \"Aku mengetahui selesainya sholat Nabi shallallahu 'alaihi wasallam dari suara takbir.\" 'Ali berkata, telah menceritakan kepada kami Sufyan dari 'Amru ia berkata, \"Abu Ma'bad adalah salah satu budak Ibnu 'Abbas yang paling jujur.\" 'Ali berkata, \"Nama aslinya adalah Nafidz.\""
            },
            {
                "number": 798,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ قَالَ حَدَّثَنَا مُعْتَمِرٌ عَنْ عُبَيْدِ اللَّهِ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَجَاءَ الْفُقَرَاءُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا ذَهَبَ أَهْلُ الدُّثُورِ مِنْ الْأَمْوَالِ بِالدَّرَجَاتِ الْعُلَا وَالنَّعِيمِ الْمُقِيمِ يُصَلُّونَ كَمَا نُصَلِّي وَيَصُومُونَ كَمَا نَصُومُ وَلَهُمْ فَضْلٌ مِنْ أَمْوَالٍ يَحُجُّونَ بِهَا وَيَعْتَمِرُونَ وَيُجَاهِدُونَ وَيَتَصَدَّقُونَ قَالَ أَلَا أُحَدِّثُكُمْ إِنْ أَخَذْتُمْ أَدْرَكْتُمْ مَنْ سَبَقَكُمْ وَلَمْ يُدْرِكْكُمْ أَحَدٌ بَعْدَكُمْ وَكُنْتُمْ خَيْرَ مَنْ أَنْتُمْ بَيْنَ ظَهْرَانَيْهِ إِلَّا مَنْ عَمِلَ مِثْلَهُ تُسَبِّحُونَ وَتَحْمَدُونَ وَتُكَبِّرُونَ خَلْفَ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ فَاخْتَلَفْنَا بَيْنَنَا فَقَالَ بَعْضُنَا نُسَبِّحُ ثَلَاثًا وَثَلَاثِينَ وَنَحْمَدُ ثَلَاثًا وَثَلَاثِينَ وَنُكَبِّرُ أَرْبَعًا وَثَلَاثِينَ فَرَجَعْتُ إِلَيْهِ فَقَالَ تَقُولُ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ حَتَّى يَكُونَ مِنْهُنَّ كُلِّهِنَّ ثَلَاثًا وَثَلَاثِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Bakar] berkata, telah menceritakan kepada kami [Mu'tamir] dari ['ubaidhullah] dari [Sumayyah] dari [Abu Shalih] dari [Abu Hurairah] berkata, \"Pernah datang para fuqara kepada Nabi shallallahu 'alaihi wasallam seraya berkata, \"Orang-orang kaya, dengan harta benda mereka itu, mereka mendapatkan kedudukan yang tinggi, juga kenikmatan yang abadi. Karena mereka melaksanakan sholat seperti juga kami melaksanakan sholat. Mereka shaum sebagaimana kami juga shaum. Namun mereka memiliki kelebihan disebabkan harta mereka, sehingga mereka dapat menunaikan 'ibadah haji dengan harta tersebut, juga dapat melaksnakan 'umrah bahkan dapat berjihad dan bersedekah.\" Maka beliau pun bersabda: \"Maukah aku sampaikan kepada kalian sesuatu yang apabila kalian ambil (sebagai amal ibadah) kalian akan dapat melampaui (derajat) orang-orang yang sudah mengalahkan kalian tersebut, dan tidak akan ada yang dapat mengalahkan kalian dengan amal ini sehingga kalian menjadi yang terbaik di antara kalian dan di tengah-tengah mereka kecuali bila ada orang yang mengerjakan seperti yang kalian amalkan ini. Yaitu kalian membaca tasbih (Subhaanallah), membaca tahmid (Alhamdulillah) dan membaca takbir (Allahu Akbar) setiap selesai dari sholat sebanyak tiga puluh tiga kali.\" Kemudian setelah itu di antara kami terdapat perbedaan pendapat. Di antara kami ada yang berkata, \"Kita bertasbih tiga puluh tiga kali, lalu bertahmid tiga puluh tiga kali, lalu bertakbir empat puluh tiga kali.\" Kemudian aku kembali menemui Beliau shallallahu 'alaihi wasallam, beliau lalu bersabda: \"Bacalah 'Subhaanallah walhamdulillah wallahu Akbar' hingga dari itu semuanya berjumlah tiga puluh tiga kali.\""
            },
            {
                "number": 799,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ وَرَّادٍ كَاتِبِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ أَمْلَى عَلَيَّ الْمُغِيرَةُ بْنُ شُعْبَةَ فِي كِتَابٍ إِلَى مُعَاوِيَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي دُبُرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّوَقَالَ شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ بِهَذَا وَعَنْ الْحَكَمِ عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ وَرَّادٍ بِهَذَا وَقَالَ الْحَسَنُ الْجَدُّ غِنًى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] berkata, telah menceritakan kepada kami [Sufyan] dari ['Abdul Malik bin 'Umair] dari [Warrad] penulisnya Al Mughirah bin Syu'bah, berkata, \" [Al Mughirah bin Syu'bah] meminta aku untuk menulis (hadits) buat dikirim kepada Mu'awiyyah bahwa Nabi shallallahu 'alaihi wasallam berdo'a setiap selesai dari sholat fardlu: 'LAA ILAAHA ILLALLAH WAHDAHU LAA SYARIIKA LAHU, LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI'IN QADIIR. ALLAHUMMA LAA MAANI'A LIMA A'THAITA WA LAA MU'THIYA LIMA MANA'TA WA LAA YANFA'U DZAL JADDI MINKAL JADDU (Tidak ada tuhan yang berhak disembah selain Allah, yang Tunggal dan tidak ada sekutu bagi-Nya. Milik-Nya segala kerajaan, dan milik-Nya segala pujian. Dan Dia Maha Kuasa atas segala sesuatu. Ya Allah, tidak ada yang dapat menahan dari apa yang Engkau berikan dan dan tidak ada yang dapat memberi dari apa yang Engkau tahan. Dan tidak bermanfaat kekayaan orang yang kaya di hadapan-Mu sedikitpun) '.\" [Syu'bah] berkata dari ['Abdul Malik bin 'Umair] dengan lafadz seperti ini. Dan dari [Al Hakam] dari [Al Qasim bin Mukhaimirah] dari [Warrad] dengan seperti ini juga. Al Hasan berkata, \"Al Jaddu artinyaadalah kekayaan.\""
            },
            {
                "number": 800,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ حَدَّثَنَا أَبُو رَجَاءٍ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى صَلَاةً أَقْبَلَ عَلَيْنَا بِوَجْهِهِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Jarir bin Hazim] berkata, telah menceritakan kepada kami [Abu Raja'] dari [Samrah bin Jundub] berkata, \"Jika Nabi shallallahu 'alaihi wasallam selesai dari menunaikan sholat, beliau menghadapkan wajahnya ke arah kami.\""
            },
            {
                "number": 801,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَنَّهُ قَالَصَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ عَلَى إِثْرِ سَمَاءٍ كَانَتْ مِنْ اللَّيْلَةِ فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ فَأَمَّا مَنْ قَالَ مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ فَذَلِكَ مُؤْمِنٌ بِي وَكَافِرٌ بِالْكَوْكَبِ وَأَمَّا مَنْ قَالَ بِنَوْءِ كَذَا وَكَذَا فَذَلِكَ كَافِرٌ بِي وَمُؤْمِنٌ بِالْكَوْكَبِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Shalih bin Kaisan] dari ['ubaidhullah bin 'Abdullah bin 'Utbah bin Mas'ud] dari [Zaid bin Khalid Al Juhaini] bahwasanya dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memimpin kami sholat Shubuh di Hudaibiyyah pada suatu malam sehabis turun hujan. Setelah selesai Beliau menghadapkan wajahnya kepada orang banyak lalu bersabda: \"Tahukah kalian apa yang sudah difirmankan oleh Rabb kalian?\" Orang-orang menjawab, \"Allah dan rasul-Nya lebih mengetahui.\" Beliau bersabda: '(Allah berfirman): 'Di pagi ini ada hamba-hamba Ku yang beriman kepada-Ku dan ada yang kafir. Orang yang berkata, 'Hujan turun kepada kita karena karunia Allah dan rahmat-Nya', maka dia adalah yang beriman kepada-Ku dan kafir kepada bintang-bintang. Adapun yang berkata, '(Hujan turun disebabkan) bintang ini atau itu', maka dia telah kafir kepada-Ku dan beriman kepada bintang-bintang'.\""
            },
            {
                "number": 802,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ سَمِعَ يَزِيدَ بْنَ هَارُونَ قَالَ أَخْبَرَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَأَخَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ ذَاتَ لَيْلَةٍ إِلَى شَطْرِ اللَّيْلِ ثُمَّ خَرَجَ عَلَيْنَا فَلَمَّا صَلَّى أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ إِنَّ النَّاسَ قَدْ صَلَّوْا وَرَقَدُوا وَإِنَّكُمْ لَنْ تَزَالُوا فِي صَلَاةٍ مَا انْتَظَرْتُمْ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Munir] dia mendengar [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Humaid] dari [Anas bin Malik] berkata, \"Pada suatu malam Rasulullah shallallahu 'alaihi wasallam pernah mengakhirkan sholat hingga pertengahan malam, lalu beliau keluar menemui kami (untuk melaksanakan sholat). Selesai sholat beliau menghadap ke arah kami dan bersabda: \"Manusia sudah selesai melaksanakan sholat lalu mereka tidur. Dan kalian akan tetqap dalan hitungan sholat selama kalian masih menunggu (pelaksanaan) sholat.\""
            },
            {
                "number": 803,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ حَدَّثَنَا الزُّهْرِيُّ عَنْ هِنْدٍ بِنْتِ الْحَارِثِ عَنْ أُمِّ سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَلَّمَ يَمْكُثُ فِي مَكَانِهِ يَسِيرًاقَالَ ابْنُ شِهَابٍ فَنُرَى وَاللَّهُ أَعْلَمُ لِكَيْ يَنْفُذَ مَنْ يَنْصَرِفُ مِنْ النِّسَاءِ وَقَالَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ رَبِيعَةَ أَنَّ ابْنَ شِهَابٍ كَتَبَ إِلَيْهِ قَالَ حَدَّثَتْنِي هِنْدُ بِنْتُ الْحَارِثِ الْفِرَاسِيَّةُ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَتْ مِنْ صَوَاحِبَاتِهَا قَالَتْ كَانَ يُسَلِّمُ فَيَنْصَرِفُ النِّسَاءُ فَيَدْخُلْنَ بُيُوتَهُنَّ مِنْ قَبْلِ أَنْ يَنْصَرِفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ أَخْبَرَتْنِي هِنْدُ الْفِرَاسِيَّةُ وَقَالَ عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ حَدَّثَتْنِي هِنْدُ الْفِرَاسِيَّةُ وَقَالَ الزُّبَيْدِيُّ أَخْبَرَنِي الزُّهْرِيُّ أَنَّ هِنْدَ بِنْتَ الْحَارِثِ الْقُرَشِيَّةَ أَخْبَرَتْهُ وَكَانَتْ تَحْتَ مَعْبَدِ بْنِ الْمِقْدَادِ وَهُوَ حَلِيفُ بَنِي زُهْرَةَ وَكَانَتْ تَدْخُلُ عَلَى أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ شُعَيْبٌ عَنْ الزُّهْرِيِّ حَدَّثَتْنِي هِنْدُ الْقُرَشِيَّةُ وَقَالَ ابْنُ أَبِي عَتِيقٍ عَنْ الزُّهْرِيِّ عَنْ هِنْدٍ الْفِرَاسِيَّةِ وَقَالَ اللَّيْثُ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ حَدَّثَهُ عَنْ ابْنِ شِهَابٍ عَنْ امْرَأَةٍ مِنْ قُرَيْشٍ حَدَّثَتْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Ibrahim bin Sa'd] telah menceritakan kepada kami [Az Zuhri] dari [Hind binti Al Harits] dari [Ummu Salamah], bahwa Nabi shallallahu 'alaihi wasallam jika selesai salam, beliau tetap berdiam di tempatnya sejenak.\" Ibnu Syihab berkata, \"Menurut kami -dan Allah yang lebih tahu, hal itu agar wanita yang akan pergi punya kesempatan.\" Dan [Ibnu Abu Maryam] berkata; telah mengabarkan kepada kami [Nafi' bin Yazid] berkata, telah mengabarkan kepadaku [Ja'far bin Rabi'ah] bahwa [Ibnu Syihab] menulis surat kepadanya; telah menceritakan kepadaku [Hind binti Al Harits Al Firasiyyah] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam -dia adalah teman Ummu Salamah- ia berkata, \"Ketika beliu salam, para wanita bergegas kembali ke rumah-rumah mereka masing-masing sebelum Rasulullah shallallahu 'alaihi wasallam beranjak pergi.\" [Ibnu Wahab] berkata; dari [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Hind Al Firasiyyah]. Dan ['Utsman bin 'Umar] berkata; telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] telah menceritakan kepadaku [Hind Al Firasiyyah]. Dan [Az Zubaidi] berkata; telah mengabarkan kepadaku [Az Zuhri] bahwa [Hind binti Al Harits Al Firasiyyah] mengabarkan kepadanya - saat itu wanita ini adalah isteri Ma'bad bin Al Miqdad, sekutunya Bani Zuhrah- Hind sering mengunjungi isteri-isrti Nabi shallallahu 'alaihi wasallam. Dan [Syu'aib] berkata; dari [Az Zuhri] telah menceritakan kepadaku [Hind Al Firasiyyah]. Dan [Ibnu Abu 'Atiq] berkata; dari [Az Zuhri] dari [Hind Al Firasiyyah]. Dan [Al Laits] berkata; telah menceritakan kepadaku [Yahya bin Sa'id] ia menceritakan kepadanya dari [Ibnu Syihab] dari [seorang wanita] suku Quraisy, ia menceritakan kepadanya dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 804,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ عُمَرَ بْنِ سَعِيدٍ قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ قَالَصَلَّيْتُ وَرَاءَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ الْعَصْرَ فَسَلَّمَ ثُمَّ قَامَ مُسْرِعًا فَتَخَطَّى رِقَابَ النَّاسِ إِلَى بَعْضِ حُجَرِ نِسَائِهِ فَفَزِعَ النَّاسُ مِنْ سُرْعَتِهِ فَخَرَجَ عَلَيْهِمْ فَرَأَى أَنَّهُمْ عَجِبُوا مِنْ سُرْعَتِهِ فَقَالَ ذَكَرْتُ شَيْئًا مِنْ تِبْرٍ عِنْدَنَا فَكَرِهْتُ أَنْ يَحْبِسَنِي فَأَمَرْتُ بِقِسْمَتِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid bin Maimun] berkata, telah menceritakan kepada kami ['Isa bin Yunus] dari ['Umar bin Sa'id] berkata, telah mengabarkan kepadaku [Ibnu Abu Mulaikah] dari ['Uqbah] berkata, \"Aku pernah sholat 'Ashar di belakang Nabi shallallahu 'alaihi wasallam di kota Madinah. Setelah salam, tiba-tiba beliau berdiri dengan tergesa-gesa sambil melangkahi leher-leher orang banyak menuju sebagian kamar isteri-isterinya. Orang-orang pun merasa heran dengan ketergesa-gesaan beliau. Setelah itu beliau keluar kembali menemui orang banyak, dan beliau lihat orang-orang merasa heran. Maka beliau pun bersabda: \"Aku teringat dengan sebatang emas yang ada pada kami. Aku khawatir itu dapat menggangguku, maka aku perintahkan untuk dibagi-bagikan.\""
            },
            {
                "number": 805,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ الْأَسْوَدِ قَالَ قَالَ عَبْدُ اللَّهِلَا يَجْعَلْ أَحَدُكُمْ لِلشَّيْطَانِ شَيْئًا مِنْ صَلَاتِهِ يَرَى أَنَّ حَقًّا عَلَيْهِ أَنْ لَا يَنْصَرِفَ إِلَّا عَنْ يَمِينِهِ لَقَدْ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَثِيرًا يَنْصَرِفُ عَنْ يَسَارِهِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] berkata, telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] dari ['Umarah bin 'Umair] dari [Al Aswad] berkata, [Abdullah] berkata, \"Janganlah salah seorang dari kalian memberi peluang sedikitpun kepada setan untuk menggangu sholatnya.\" Dia berpendapat bahwa tidak boleh seseorang beranjak pergi kecuali dari sebelah kanannya, dan aku melihat Nabi shallallahu 'alaihi wasallam sering beranjak pergi dari sebelah kirinya.\""
            },
            {
                "number": 806,
                "arab": "حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي غَزْوَةِ خَيْبَرَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ يَعْنِي الثُّومَ فَلَا يَقْرَبَنَّ مَسْجِدَنَا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] berkata, telah menceritakan kepadaku [Nafi'] dari [Ibnu 'Umar] radliallahu 'anhuma, bahwa Nabi shallallahu 'alaihi wasallam bersabda saat terjadinya perang Khaibar: \"Barangsiapa memakan dari pohon ini, yaitu bawang putih, maka jangan sekali-kali dia mendekati masjid kami.\""
            },
            {
                "number": 807,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ يُرِيدُ الثُّومَ فَلَا يَغْشَانَا فِي مَسَاجِدِنَاقُلْتُ مَا يَعْنِي بِهِ قَالَ مَا أُرَاهُ يَعْنِي إِلَّا نِيئَهُ وَقَالَ مَخْلَدُ بْنُ يَزِيدَ عَنْ ابْنِ جُرَيْجٍ إِلَّا نَتْنَهُ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] berkata, telah menceritakan kepada kami [Abu 'Ashim] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku ['Atha] berkata, \"Aku mendengar [Jabir bin 'Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memakan dari pohon ini, - maksudnya bawang putih-, maka hendaklah dia tidak mendatangi kami di masjid-masjid kami.\" Aku bertanya, \"Apa yang beliau maksudkan itu?\" Maka Jabir menjawab, \"Aku tidak melihat maksud beliau yang lain kecuali yang mentah (belum dimasak).\" [Makhallad bin Yazid] menyebutkan dari [Ibnu Juraij], \"Kecuali yang mentah.\""
            },
            {
                "number": 808,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ زَعَمَ عَطَاءٌ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِزَعَمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ ثُومًا أَوْ بَصَلًا فَلْيَعْتَزِلْنَا أَوْ قَالَ فَلْيَعْتَزِلْ مَسْجِدَنَا وَلْيَقْعُدْ فِي بَيْتِهِ وَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِقِدْرٍ فِيهِ خَضِرَاتٌ مِنْ بُقُولٍ فَوَجَدَ لَهَا رِيحًا فَسَأَلَ فَأُخْبِرَ بِمَا فِيهَا مِنْ الْبُقُولِ فَقَالَ قَرِّبُوهَا إِلَى بَعْضِ أَصْحَابِهِ كَانَ مَعَهُ فَلَمَّا رَآهُ كَرِهَ أَكْلَهَا قَالَ كُلْ فَإِنِّي أُنَاجِي مَنْ لَا تُنَاجِيوَقَالَ أَحْمَدُ بْنُ صَالِحٍ عَنْ ابْنِ وَهْبٍ أُتِيَ بِبَدْرٍ وَقَالَ ابْنُ وَهْبٍ يَعْنِي طَبَقًا فِيهِ خَضِرَاتٌ وَلَمْ يَذْكُرِ اللَّيْثُ وَأَبُو صَفْوَانَ عَنْ يُونُسَ قِصَّةَ الْقِدْرِ فَلَا أَدْرِي هُوَ مِنْ قَوْلِ الزُّهْرِيِّ أَوْ فِي الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] bahwa ['Atha] menyakini bahwa [Jabir bin 'Abdullah] meyakini bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memakan bawang putih atau bawang merah hendaklah dia menjauhi kami.\" Atau beliau mengatakan: \"Hendaklah dia menjauhi masjid kami dan hendaklah dia duduk berdiam di rumahnya.\" Dan bahwasanya Nabi shallallahu 'alaihi wasallam pernah diberikan periuk yang di dalamnya sayuran seperti kol. Kemudian beliau mencium arama sesuatu, beliau lalu menanyakannya dan beliau pun diberi kabar tentang beau tersebut. Maka beliau bersabda: \"Sodorkanlah!\" yakni kepada para sahabat yang bersamanya. Ketika beliau melihat mereka enggan memakannya, beliau pun bersabda: \"Makanlah! Sesungghuhnya aku berbicara dengan orang yang bukan engkau ajak bicara.\" [Ahmad bin Shalih] menyebutkan dari [Ibnu Wahab], \"Saat perang badar beliau diberi..\". Ibnu menyebutkan, \"Yakni mangkuk berisi sayuran.\" Namun [Al Laits] dan [Abu Shafwan] dari [Yunus] tidak menyebutkan perihal mangkuk tersebut, dan aku tidak tahu ucapan tadi perkataan Az Zuhri atau memang redaksi hadits begitu.\""
            },
            {
                "number": 809,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ قَالَ سَأَلَ رَجُلٌ أَنَسَ بْنَ مَالِكٍمَا سَمِعْتَ نَبِيَّ اللَّه صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي الثُّومِ فَقَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلَا يَقْرَبْنَا أَوْ لَا يُصَلِّيَنَّ مَعَنَا",
                "id": "Telah menceritakan kepada kami [Abu Ma'mar] berkata, telah menceritakan kepada kami ['Abdul Warits] dari ['Abdul 'Aziz] berkata, \"Seorang laki-laki bertanya kepada [Anas bin Malik], \"Pernyataan apa yang pernah kamu dengar dari Nabi shallallahu 'alaihi wasallam tentang bawang putih?\" Anas bin Malik menjawab, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memakan dari pohon ini, maka jangan sekali-kali dia mendekati kami atau sholat bersama kami.\""
            },
            {
                "number": 810,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنِي غُنْدَرٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ سُلَيْمَانَ الشَّيْبَانِيَّ قَالَ سَمِعْتُ الشَّعْبِيَّ قَالَ أَخْبَرَنِي مَنْ مَرَّمَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَبْرٍ مَنْبُوذٍ فَأَمَّهُمْ وَصَفُّوا عَلَيْهِ فَقُلْتُ يَا أَبَا عَمْرٍو مَنْ حَدَّثَكَ فَقَالَ ابْنُ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] berkata, telah menceritakan kepadaku [Ghundar] berkata, telah menceritakan kepada kami [Syu'bah] berkata, Aku mendengar [Sulaiman Asy Syaibani] berkata, Aku mendengar [Asy Sya'bi] berkata, \"Telah mengabarkan kepadaku [orang yang berjalan] besama Nabi shallallahu 'alaihi wasallam melewati sebuah kuburan yang terpisah, kemudian Beliau memimpin mereka sholat dan orang-orang membuat shaf lalu sholat untuk kuburan tersebut.\" Maka aku tanyakan, \"Wahai Abu 'Amru, siapa yang menceritakan kepadamu tentang ini?\" Dia menjawab, \"Ibnu 'Abbas.\""
            },
            {
                "number": 811,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي صَفْوَانُ بْنُ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah menceritakan kepada kami [Sufyan] berkata, telah menceritakan kepadaku [Shafwan bin Sulaim] dari ['Atha' bin Yasar] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Mandi pada hari Jum'at adalah wajib bagi orang yang sudah bermimpi (baligh).\""
            },
            {
                "number": 812,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ عَمْرٍو قَالَ أَخْبَرَنِي كُرَيْبٌ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَبِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ لَيْلَةً فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا كَانَ فِي بَعْضِ اللَّيْلِ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَوَضَّأَ مِنْ شَنٍّ مُعَلَّقٍ وُضُوءًا خَفِيفًا يُخَفِّفُهُ عَمْرٌو وَيُقَلِّلُهُ جِدًّا ثُمَّ قَامَ يُصَلِّي فَقُمْتُ فَتَوَضَّأْتُ نَحْوًا مِمَّا تَوَضَّأَ ثُمَّ جِئْتُ فَقُمْتُ عَنْ يَسَارِهِ فَحَوَّلَنِي فَجَعَلَنِي عَنْ يَمِينِهِ ثُمَّ صَلَّى مَا شَاءَ اللَّهُ ثُمَّ اضْطَجَعَ فَنَامَ حَتَّى نَفَخَ فَأَتَاهُ الْمُنَادِي يَأْذَنُهُ بِالصَّلَاةِ فَقَامَ مَعَهُ إِلَى الصَّلَاةِ فَصَلَّى وَلَمْ يَتَوَضَّأْقُلْنَا لِعَمْرٍو إِنَّ نَاسًا يَقُولُونَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَنَامُ عَيْنُهُ وَلَا يَنَامُ قَلْبُهُ قَالَ عَمْرٌو سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ إِنَّ رُؤْيَا الْأَنْبِيَاءِ وَحْيٌ ثُمَّ قَرَأَ{ إِنِّي أَرَى فِي الْمَنَامِ أَنِّي أَذْبَحُكَ }",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah mengabarkan kepada kami [Sufyan] dari ['Amru] berkata, telah mengabarkan kepadaku [Kuraib] dari [Ibnu 'Abbas] radliallahu 'anhuma berkata, \"Suatu malam aku pernah menginap di rumah bibiku, Maimunah? radliallahu 'anha. Lalu Nabi shallallahu 'alaihi wasallam tidur dan bangun kembali di sebagian waktu malam, beliau berwudlu dari geriba yang sudah yang digantung secara ringan -'Amru teramat mensedikitkan (air yang dipakai) -. Kemudian beliau berdiri sholat, aku lalu bangun; berwudlu sebagaimana beliau wudlu. Kemudian aku datang dan berdiri di sisi kiri beliau, namun beliau kemudian menggeser aku ke sebelah kanannya. Beliau lalu sholat menurut apa yang Allah kehendaki (lamanya), kemudian beliau berbaring tertidur hingga mendengkur. Setelah itu datanglah seorang mu'adzin yang memberitahukan bahwa waktu sholat shubuh telah tiba. Beliau kemudian berangkat bersama mu'adzin tersebut untuk menunaikan sholat dengan tidak berwudlu lagi.\" Kami tanyakan kepada 'Amru: \"Orang-orang mengatakan bahwa Nabi shallallahu 'alaihi wasallam (jika tidur), mata beliau tidur namun hatinya tidak.\" Maka 'Amru menjawab, \"Aku mendengar 'Ubaid bin 'Umair berkata, \"Sesungguhnya mimpinya para Nabi adalah wahyu.\" Lalu dia membaca firman Allah: '(Sesungguhnya Aku melihat dalam mimpi bahwa Aku menyembelihmu) ' (Qs. Ash Shaffaat: 102)."
            },
            {
                "number": 813,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنِي مَالِكٌ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ جَدَّتَهُ مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِطَعَامٍ صَنَعَتْهُ فَأَكَلَ مِنْهُ فَقَالَ قُومُوا فَلِأُصَلِّيَ بِكُمْ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدْ اسْوَدَّ مِنْ طُولِ مَا لَبِثَ فَنَضَحْتُهُ بِمَاءٍ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْيَتِيمُ مَعِي وَالْعَجُوزُ مِنْ وَرَائِنَا فَصَلَّى بِنَا رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepadaku [Malik] dari [Ishaq bin 'Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwa neneknya, Mulaikah, mengundang Rasulullah shallallahu 'alaihi wasallam untuk menghadiri hidangan yang ia masak untuknya. Beliau lantas memakannya lalu bersabda: \"Berdirilah kalian, aku akan pimpin sholat kalian.\" Maka aku berdiri di tikar milik kami yang sudah hitam lusuh akibat sering digunakan. Tikar itu kemudian aku perciki dengan air, lalu Rasulullah shallallahu 'alaihi wasallam berdiri diatasnya. Maka aku dan anak yatim yang tinggal bersama kami merapatkan shaf di belakang beliau sedangkan nenek kami berdiri di belakang kami. Nabi shallallahu 'alaihi wasallam kemudian sholat memimpim kami sebanyak dua rakaat.\""
            },
            {
                "number": 814,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّهُ قَالَأَقْبَلْتُ رَاكِبًا عَلَى حِمَارٍ أَتَانٍ وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الِاحْتِلَامَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالنَّاسِ بِمِنًى إِلَى غَيْرِ جِدَارٍ فَمَرَرْتُ بَيْنَ يَدَيْ بَعْضِ الصَّفِّ فَنَزَلْتُ وَأَرْسَلْتُ الْأَتَانَ تَرْتَعُ وَدَخَلْتُ فِي الصَّفِّ فَلَمْ يُنْكِرْ ذَلِكَ عَلَيَّ أَحَدٌ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari ['ubaidhullah bin 'Abdullah bin 'Utbah] dari [Ibnu 'Abbas] radliallahu 'anhuma, bahwa dia berkata, \"Pada suatu hari aku datang sambil menunggang keledai betina dan pada saat itu usiaku hampir baligh. Saat itu Rasulullah shallallahu 'alaihi wasallam sedang sholat bersama orang banyak di Mina tanpa ada dinding di hadapannya. Maka aku lewat di depan sebagian shaf. Lalu aku turun dan aku biarkan keledaiku mencari makan, aku lantas masuk ke dalam barisan shaf dan tidak ada seorangpun yang menegurku.\""
            },
            {
                "number": 815,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ قَالَتْ أَعْتَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ عَيَّاشٌ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْأَعْتَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعِشَاءِ حَتَّى نَادَاهُ عُمَرُ قَدْ نَامَ النِّسَاءُ وَالصِّبْيَانُ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّهُ لَيْسَ أَحَدٌ مِنْ أَهْلِ الْأَرْضِ يُصَلِّي هَذِهِ الصَّلَاةَ غَيْرُكُمْ وَلَمْ يَكُنْ أَحَدٌ يَوْمَئِذٍ يُصَلِّي غَيْرَ أَهْلِ الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwa ['Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengakhirkan sholat 'Isya' ketika malam sudah larut.\" ['Ayyasy] berkata; telah menceritakan kepada kami ['Abdul A'la] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] radliallahu 'anhuma, berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengakhirkan sholat 'Isya' ketika malam sudah larut, hingga akhirnya 'Umar berseru kepada Beliau, \"Para wanita dan anak-anak sudah tidur.\" Beliau lalu keluar seraya bersabda: \"Tidak ada seorangpun dari penduduk bumi mengerjakan sholat ini selain kalian.\" Dan pada saat itu tidak ada satu orangpun yang melaksanakan sholat selain penduduk Madinah.\""
            },
            {
                "number": 816,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ سَمِعْتُ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاقَالَ لَهُ رَجُلٌ شَهِدْتَ الْخُرُوجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ وَلَوْلَا مَكَانِي مِنْهُ مَا شَهِدْتُهُ يَعْنِي مِنْ صِغَرِهِ أَتَى الْعَلَمَ الَّذِي عِنْدَ دَارِ كَثِيرِ بْنِ الصَّلْتِ ثُمَّ خَطَبَ ثُمَّ أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ وَأَمَرَهُنَّ أَنْ يَتَصَدَّقْنَ فَجَعَلَتْ الْمَرْأَةُ تُهْوِي بِيَدِهَا إِلَى حَلْقِهَا تُلْقِي فِي ثَوْبِ بِلَالٍ ثُمَّ أَتَى هُوَ وَبِلَالٌ الْبَيْتَ",
                "id": "Telah menceritakan kepada kami ['Amru bin 'Ali] berkata, telah menceritakan kepada kami [Yahya] berkata, telah menceritakan kepada kami [Sufyan] telah menceritakan kepadaku ['Abdurrahman bin 'Abis] berkata, Aku mendengar ada seseorang bertanya kepada [Ibnu 'Abbas] radliallahu 'anhuma, \"Apakah engkau pernah ikut keluar (sholat) bersama Rasulullah shallallahu 'alaihi wasallam?\" Dia menjawab, \"Ya. Sekiranya bukan karena kedudukanku di sisi Beliau, niscaya aku tidak mungkin (bisa) ikut -karena umurnya masih kecil-. Beliau mendatangi tempat yang agak tinggi dekat rumah Katsir bin Ash Shalt lalu memberikan ceramah, kemudian mendatangi para wanita. Beliau lantas memberi nasihat kepada mereka, mengingatkan dan memerintahkan mereka agar bersedekah. Maka para wanita tersebut memberikan apa yang ada pada tangan dan leher mereka (emas perhiasan) lalu dimasukkan ke dalam kain Bilal, setelah itu beliau dan Bilal menuju Ka'bah.\""
            },
            {
                "number": 817,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْأَعْتَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعَتَمَةِ حَتَّى نَادَاهُ عُمَرُ نَامَ النِّسَاءُ وَالصِّبْيَانُ فَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا يَنْتَظِرُهَا أَحَدٌ غَيْرُكُمْ مِنْ أَهْلِ الْأَرْضِ وَلَا يُصَلَّى يَوْمَئِذٍ إِلَّا بِالْمَدِينَةِ وَكَانُوا يُصَلُّونَ الْعَتَمَةَ فِيمَا بَيْنَ أَنْ يَغِيبَ الشَّفَقُ إِلَى ثُلُثِ اللَّيْلِ الْأَوَّلِ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari ['Aisyah] radliallahu 'anha berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengakhirkan sholat 'Isya' ketika malam sudah larut, hingga 'Umar berseru pun kepada beliau, \"Para wanita dan anak-anak sudah tidur!\" Maka keluarlah Rasulullah seraya bersabda: \"Tidak ada seorangpun yang menunggu pelaksanaan sholat 'Isya ini dari penduduk bumi selain kalian.\" Dan pada hari itu tidak ada satu orangpun yang melaksanakan sholat selain penduduk Madinah. Mereka melakanakan sholat 'Isya antara telah berlalunya waktu syafaq hingga sepertiga awal malam.\""
            },
            {
                "number": 818,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ حَنْظَلَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَأْذَنَكُمْ نِسَاؤُكُمْ بِاللَّيْلِ إِلَى الْمَسْجِدِ فَأْذَنُوا لَهُنَّتَابَعَهُ شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Musa] dari [Hanzhalah] dari [Salim bin 'Abdullah] dari [Ibnu 'Umar] radliallahu 'anhuma dari Nabi shallallahu 'alaihi wasallam bersabda: \"Jika isteri-isteri kalian minta izin ke masjid di waktu malam, maka berilah mereka izin.\" Hadits ini dikuatkan oleh [Syu'bah] dari [Al A'masy] dari [Mujahid] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 819,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَتْنِي هِنْدُ بِنْتُ الْحَارِثِ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهَاأَنَّ النِّسَاءَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنَّ إِذَا سَلَّمْنَ مِنْ الْمَكْتُوبَةِ قُمْنَ وَثَبَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ صَلَّى مِنْ الرِّجَالِ مَا شَاءَ اللَّهُ فَإِذَا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ الرِّجَالُ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami ['Utsman bin 'Umar] telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] berkata, telah menceritakan kepadaku [Hind binti Al Harits] bahwa [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam mengabarkan kepadanya, bahwa para wanita di zaman Rasulullah shallallahu 'alaihi wasallam jika mereka telah selesai dari sholat fardlu, maka mereka segera beranjak pergi. Sedangkan Rasulullah shallallahu 'alaihi wasallam dan kaum laki-laki yang sholat bersama beliau tetap diam di tempat sampai waktu yang Allah kehendaki. Ketika Rasulullah shallallahu 'alaihi wasallam berdiri dan beranjak pergi maka mereka pun mengikutinya.\""
            },
            {
                "number": 820,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُصَلِّي الصُّبْحَ فَيَنْصَرِفُ النِّسَاءُ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ مَا يُعْرَفْنَ مِنْ الْغَلَسِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Yahya bin Sa'id] dari ['Amrah binti 'Abdurrahman] dari ['Aisyah] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat Shubuh, maka para wanita yang ikut berjama'ah datang dengan menutup wajah mereka dengan tanpa diketahui oleh seorangpun karena hari masih gelap.\""
            },
            {
                "number": 821,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ أَخْبَرَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ الْأَنْصَارِيِّ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَقُومُ إِلَى الصَّلَاةِ وَأَنَا أُرِيدُ أَنْ أُطَوِّلَ فِيهَا فَأَسْمَعُ بُكَاءَ الصَّبِيِّ فَأَتَجَوَّزُ فِي صَلَاتِي كَرَاهِيَةَ أَنْ أَشُقَّ عَلَى أُمِّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Miskin] berkata, telah menceritakan kepada kami [Bisyir bin Bakar] telah mengabarkan kepada kami [Al Auza'i] telah menceritakan kepadaku [Yahya bin Abu Katsir] dari ['Abdullah bin Abu Qatadah Al Anshari] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku pernah berdiri melaksanakan sholat dan aku ingin memanjangkannya, namun kemudian aku mendengar tangisan bayi. Maka aku pendekkan sholatku karena aku khawatir akan memberatkan ibunya.\""
            },
            {
                "number": 822,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْلَوْ أَدْرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ كَمَا مُنِعَتْ نِسَاءُ بَنِي إِسْرَائِيلَ قُلْتُ لِعَمْرَةَ أَوَمُنِعْنَ قَالَتْ نَعَمْ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Yahya bin Sa'id] dari ['Amrah] dari ['Aisyah] radliallahu 'anha berkata, \"Seandainya Rasulullah shallallahu 'alaihi wasallam mengetahui apa yang telah terjadi dengan para wanita sekarang ini, niscaya beliau akan melarang mereka sebagaimana dilarangnya para wanita bani Isra'il.\" Yahya berkata, \"Aku bertanya 'Amrah, \"Apakah mereka dilarang? 'Amrah menjawab, \"Ya.\""
            },
            {
                "number": 823,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ هِنْدٍ بِنْتِ الْحَارِثِ عَنْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ قَامَ النِّسَاءُ حِينَ يَقْضِي تَسْلِيمَهُ وَيَمْكُثُ هُوَ فِي مَقَامِهِ يَسِيرًا قَبْلَ أَنْ يَقُومَقَالَ نَرَى وَاللَّهُ أَعْلَمُ أَنَّ ذَلِكَ كَانَ لِكَيْ يَنْصَرِفَ النِّسَاءُ قَبْلَ أَنْ يُدْرِكَهُنَّ أَحَدٌ مِنْ الرِّجَالِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Qaza'ah] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Az Zuhri] dari [Hind binti Al Harits] dari [Ummu Salamah] radliallahu 'anhu, ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam mengucapkan salam, maka para wanita langsung beranjak pergi ketika beliau selesai mengucapkan salamnya. Sementara beliau tetap di tempatnya sejenak sebelum beranjak pergi. Menurut kami -dan hadits hanya Allah yang tahu- beliau lakukan itu agar para wanita bisa segera pergi sebelum diketahui oleh seorangpun dari jama'ah laki-laki.\""
            },
            {
                "number": 824,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ أُمِّ سُلَيْمٍ فَقُمْتُ وَيَتِيمٌ خَلْفَهُ وَأُمُّ سُلَيْمٍ خَلْفَنَا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Ishaq bin 'Abdullah] dari [Anas bin Malik] radliallahu 'anhu, ia berkata, \"Nabi shallallahu 'alaihi wasallam pernah melaksanakan sholat di rumah Ummu Sulaim, maka aku dan anak yatim ikut di belakang beliau sedangkan Ummu Sulaim berdiri di belakang kami.\""
            },
            {
                "number": 825,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا فُلَيْحٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الصُّبْحَ بِغَلَسٍ فَيَنْصَرِفْنَ نِسَاءُ الْمُؤْمِنِينَ لَا يُعْرَفْنَ مِنْ الْغَلَسِ أَوْ لَا يَعْرِفُ بَعْضُهُنَّ بَعْضًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Musa] telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Fulaih] dari ['Abdurrahman bin Al Qasim] dari [Bapaknya] dari ['Aisyah] radliallahu 'anha, bahwasanya Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat Shubuh di waktu yang masih gelap, sehingga kaum Mukminah berlalu pergi tidak ada yang dapat mengenalinya, atau sebagian mereka tidak bisa mengetahui sebagian yang lain.\""
            },
            {
                "number": 826,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَأْذَنَتْ امْرَأَةُ أَحَدِكُمْ فَلَا يَمْنَعْهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] dari [Ma'mar] dari [Az Zuhri] dari [Salim bin 'Abdullah] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika isteri salah seorang dari kalian minta izin (untuk ke Masjid), hendaklah ia larang.\""
            },
            {
                "number": 827,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ قَالَ حَدَّثَنَا أَبُو الزِّنَادِ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الْأَعْرَجَ مَوْلَى رَبِيعَةَ بْنِ الْحَارِثِ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ نَحْنُ الْآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا ثُمَّ هَذَا يَوْمُهُمْ الَّذِي فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] berkata, telah menceritakan kepada kami [Abu Az Zinad] banwa ['Abdurrahman bin Hurmuz Al A'raj] mantan budak Rabi'ah bin Al Harits, menceritakan kepadanya bahwasanya dia mendengar [Abu Hurairah] radliallahu 'anhu, bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita datang terakhir dan pertama pada hari kiamat, meskipun mereka diberi Kitab sebelum kita. Dan ini adalah hari dimana mereka mendapat kewajiban, namun kemudian mereka berselisih di dalamnya. Allah lalu memberi hidayah kepada kita, maka semua manusia akan mengikuti kita (hari ini), besok hari untuk Yahudi dan Nashrani hari setelahnya lagi.\""
            },
            {
                "number": 828,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَاءَ أَحَدُكُمْ الْجُمُعَةَ فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorangii kalian mendatangi sholat jum'at hendaklah ia mandi.\""
            },
            {
                "number": 829,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ قَالَ أَخْبَرَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ عَنْ مَالِكٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ عُمَرَ بْنَ الْخَطَّابِبَيْنَمَا هُوَ قَائِمٌ فِي الْخُطْبَةِ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ رَجُلٌ مِنْ الْمُهَاجِرِينَ الْأَوَّلِينَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَادَاهُ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ قَالَ إِنِّي شُغِلْتُ فَلَمْ أَنْقَلِبْ إِلَى أَهْلِي حَتَّى سَمِعْتُ التَّأْذِينَ فَلَمْ أَزِدْ أَنْ تَوَضَّأْتُ فَقَالَ وَالْوُضُوءُ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِالْغُسْلِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad bin Asma'] berkata, telah mengabarkan kepada kami [Juwairiyah bin Asma'] dari [Malik] dari [Az Zuhri] dari [Salim bin 'Abdullah bin 'Umar] dari [Ibnu Umar] radliallahu 'anhuma, bahwa ketika ['Umar bin Al Khaththab] berdiri khuthbah pada hari Jum'at, tiba-tiba ada seorang laki-laki Muhajirin Al Awwalin (generasi pertama), sahabat Nabi shallallahu 'alaihi wasallam, masuk (ke dalam Masjid). Maka 'Umar pun bertanya, \"Jam berapakah ini?\" Sahabat tersebut menjawab, \"Aku sibuk, dan aku belum sempat pulang ke rumah hingga akhirnya aku mendengar adzan dan aku hanya bisa berwudlu.\" Umar berkata, \"Hanya berwudlu' saja! Sungguh kamu sudah mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk mandi (di hari Jum'at).\""
            },
            {
                "number": 830,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Shafwan bin Sulaim] dari ['Atha' bin Yasar] dari [Abu Sa'id Al Khudri] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari Jum'at adalah wajib bagi setiap orang yang sudah baligh.\""
            },
            {
                "number": 831,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بَكرِ بْنِ الْمُنكَدِرِ قَالَ حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ الْأَنْصَارِيُّ قَالَ أَشْهَدُ عَلَى أَبِي سَعِيدٍ قَالَأَشْهَدُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ وَأَنْ يَسْتَنَّ وَأَنْ يَمَسَّ طِيبًا إِنْ وَجَدَقَالَ عَمْرٌو أَمَّا الْغُسْلُ فَأَشْهَدُ أَنَّهُ وَاجِبٌ وَأَمَّا الِاسْتِنَانُ وَالطِّيبُ فَاللَّهُ أَعْلَمُ أَوَاجِبٌ هُوَ أَمْ لَا وَلَكِنْ هَكَذَا فِي الْحَدِيثِ قَالَ أَبُو عَبْد اللَّهِ هُوَ أَخُو مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَلَمْ يُسَمَّ أَبُو بَكْرٍ هَذَا رَوَاهُ عَنْهُ بُكَيْرُ بْنُ الْأَشَجِّ وَسَعِيدُ بْنُ أَبِي هِلَالٍ وَعِدَّةٌ وَكَانَ مُحَمَّدُ بْنُ الْمُنْكَدِرِ يُكْنَى بِأَبِي بَكْرٍ وَأَبِي عَبْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah bin Ja'far] berkata, telah menceritakan kepada kami [Harami bin 'Umarah] berkata, telah menceritakan kepadaku [Syu'bah] dari [Abu Bakar bin Al Munkadir] berkata, telah menceritakan kepadaku ['Amru bin Sulaim Al Anshari] berkata, \"Aku bersaksi atas [Abu Sa'id Al Khudri] ia berkata, \"Aku bersaksi atas Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Mandi pada hari Jum'at merupakan kewajiban bagi orang yang sudah bermimpi (baligh), dan agar bersiwak (menggosok gigi) dan memakai wewangian bila memilikinya.\" 'Amru berkata, \"Adapun mandi, aku bersaksi bahwa itu adalah wajib. Sedangkan bersiwak dan memakai wewangian -dan Allah yang lebih tahu- aku tidak tahu ia wajib atau tidak, tapi begitulah yang ada dalam hadits.\" Abu 'Abdullah -yaitu saudara Muhammad bin Al Munkadir, dan tidak disbeut dengan nama Abu Bakar- berkata, 'Hadits ini diriwayatkan darinya oleh [Bukair bin Al Asyaj] dan [Sa'id bin Abu Hilal] dan masih banyak lagi.' Dan Muhammad bin Al Munkadir punya nama panggilan Abu Bakar dan 'Abdullah.\""
            },
            {
                "number": 832,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الْإِمَامُ حَضَرَتْ الْمَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Sumayya] mantan budak Abu Bakar bin 'Abdurrahman, dari [Abu Shalih As Saman] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mandi pada hari Jum'at sebagaimana mandi junub, lalu berangkat menuju Masjid, maka dia seolah berkurban seekor unta. Dan barangiapa datang pada kesempatan (saat) kedua maka dia seolah berkurban seekor sapi. Dan barangiapa datang pada kesempatan (saat) ketiga maka dia seolah berkurban seekor kambing yang bertanduk. Dan barangiapa datang pada kesempatan (saat) keempat maka dia seolah berkurban seekor ayam. Dan barangiapa datang pada kesempatan (saat) kelima maka dia seolah berkurban sebutir telur. Dan apabila imam sudah keluar (untuk memberi khuthbah), maka para Malaikat hadir mendengarkan dzikir (khuthbah tersebut).\""
            },
            {
                "number": 833,
                "arab": "بَاب حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى هُوَ ابْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ عُمَرَ رَضِيَ اللَّهُ عَنْهُبَيْنَمَا هُوَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ رَجُلٌ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ لِمَ تَحْتَبِسُونَ عَنْ الصَّلَاةِ فَقَالَ الرَّجُلُ مَا هُوَ إِلَّا أَنْ سَمِعْتُ النِّدَاءَ تَوَضَّأْتُ فَقَالَ أَلَمْ تَسْمَعُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَاحَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Syaiban] dari [Yahya] -yaitu Ibnu Abu Katsir- dari [Abu Salamah] dari [Abu Hurairah] bahwa ['Umar] radliallahu 'anhu ketika berdiri memberikah khuthbah pada hari Jum'at, tiba-tiba ada seorang laki-laki masuk (Masjid). 'Umar lalu bertanya, \"Kenapa anda terlambat sholat?\" Laki-laki itu menjawab: \"Aku tidak tahu hingga aku mendengar adzan, maka aku pun hanya berwudlu.\" Maka \"Umar berkata, \"Bukankah kamu sudah mendengar bahwa Nabi shallallahu 'alaihi wasallam bersabda: 'Jika salah seorang dari kalian berangkat sholat jum'at hendaklah mandi.\""
            },
            {
                "number": 834,
                "arab": "حَدَّثَنَا آدَمُ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ قَالَ أَخْبَرَنِي أَبِي عَنْ ابْنِ وَدِيعَةَ عَنْ سَلْمَانَ الْفَارِسِيِّ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغْتَسِلُ رَجُلٌ يَوْمَ الْجُمُعَةِ وَيَتَطَهَّرُ مَا اسْتَطَاعَ مِنْ طُهْرٍ وَيَدَّهِنُ مِنْ دُهْنِهِ أَوْ يَمَسُّ مِنْ طِيبِ بَيْتِهِ ثُمَّ يَخْرُجُ فَلَا يُفَرِّقُ بَيْنَ اثْنَيْنِ ثُمَّ يُصَلِّي مَا كُتِبَ لَهُ ثُمَّ يُنْصِتُ إِذَا تَكَلَّمَ الْإِمَامُ إِلَّا غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى",
                "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id Al Maqburi] berkata, telah mengabarkan kepadaku [Bapakku] dari [Ibnu Wadi'ah] dari [Salman Al Farsi] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang laki-laki mandi pada hari Jum'at lalu bersuci semaksimal mungkin, memakai wewangian miliknya atau minyak wangi keluarganya, lalu keluar rumah menuju Masjid, ia tidak memisahkan dua orang pada tempat duduknya lalu dia sholat yang dianjurkan baginya dan diam mendengarkan khutbah Imam, kecuali dia akan diampuni dosa-dosanya yang ada antara Jum'atnya itu dan Jum'at yang lainnya.\""
            },
            {
                "number": 835,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ طَاوُسٌ قُلْتُ لِابْنِ عَبَّاسٍ ذَكَرُواأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اغْتَسِلُوا يَوْمَ الْجُمُعَةِ وَاغْسِلُوا رُءُوسَكُمْ وَإِنْ لَمْ تَكُونُوا جُنُبًا وَأَصِيبُوا مِنْ الطِّيبِ قَالَ ابْنُ عَبَّاسٍ أَمَّا الْغُسْلُ فَنَعَمْ وَأَمَّا الطِّيبُ فَلَا أَدْرِي",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri], [Thawus] berkata, Aku berkata kepada [Ibnu 'Abbas], \"Orang-orang menyebutkan bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Mandilah pada hari Jum'at dan basuhlah kepala kalian sekalipun tidak sedang junub, dan pakailah wewangian.\" Ibnu 'Abbas berkata, \"Adapun mandi, memang benar bahwa itu adalah wajib, sedangkan memakai wewangian aku tidak tahu.\""
            },
            {
                "number": 836,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى قَالَ أَخْبَرَنَا هِشَامٌ أَنَّ ابْنَ جُرَيْجٍ أَخْبَرَهُمْ قَالَ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاأَنَّهُ ذَكَرَ قَوْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْغُسْلِ يَوْمَ الْجُمُعَةِ فَقُلْتُ لِابْنِ عَبَّاسٍ أَيَمَسُّ طِيبًا أَوْ دُهْنًا إِنْ كَانَ عِنْدَ أَهْلِهِ فَقَالَ لَا أَعْلَمُهُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] berkata, telah mengabarkan kepada kami [Hisyam] bahwa [Ibnu Juraij] telah mengabarkan kepada mereka, ia katakan; telah mengabarkan kepadaku [Ibrahim bin Maisarah] dari [Thawus] dari [Ibnu 'Abbas] radliallahu 'anhuma, bahwa dia menyebutkan sabda Nabi shallallahu 'alaihi wasallam perihal mandi pada hari Jum'at. Maka aku pun bertanya kepada Ibnu 'Abbas, 'Apakah beliau memakai wewangian ketika berada bersama keluarga Beliau? ' ia menjawab, 'Aku tidak tahu'.\""
            },
            {
                "number": 837,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ عُمَرَ بْنَ الْخَطَّابِ رَأَى حُلَّةً سِيَرَاءَ عِنْدَ بَابِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ لَوْ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لَا خَلَاقَ لَهُ فِي الْآخِرَةِ ثُمَّ جَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا حُلَلٌ فَأَعْطَى عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ كَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَمْ أَكْسُكَهَا لِتَلْبَسَهَا فَكَسَاهَا عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَخًا لَهُ بِمَكَّةَ مُشْرِكًا",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar], bahwa 'Umar bin Al Khaththab melihat pakaian sutera di depan pintu masjid, maka ia pun berkata, \"Wahai Rasulullah, seandainya tuan beli pakaian ini lalu tuan kenakan pada hari Jum'at atau saat menyambut utusan (delegasi) bila datang menghadap tuan.\" Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Sesungguhnya orang yang memakai pakaian seperti ini tidak akan mendapat bagian di akhirat.\" Kemudian datang hadiah untuk Rasulullah shallallahu 'alaihi wasallam yang diantaranya ada pakain sutera. Beliau lalu memberikan pakaian sutera tersebut kepada 'Umar bin Al Khaththab? radliallahu 'anhu, maka berkatalah 'Umar, \"Wahai Rasulullah, tuan telah memberikan pakaian ini untukku, padahal tuan telah menjelaskan konsekwensi orang yang memakainya!\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku memberikannya kepadamu bukan untuk kamu pakai.\" Maka 'Umar bin Al Khaththab memberikan pakaian sutera tersebut kepada saudaranya yang musyrik di kota Makkah.\""
            },
            {
                "number": 838,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي أَوْ عَلَى النَّاسِ لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلَاةٍ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya tidak memberatkan ummatku atau manusia, niscaya aku akan perintahkan kepada mereka untuk bersiwak (menggosok gigi) pada setiap kali hendak sholat.\""
            },
            {
                "number": 839,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ الْحَبْحَابِ حَدَّثَنَا أَنَسٌ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرْتُ عَلَيْكُمْ فِي السِّوَاكِ",
                "id": "Telah menceritakan kepada kami [Abu Ma'mar] berkata, telah menceritakan kepada kami ['Abdul Warits] berkata, telah menceritakan kepada kami [Syu'aib bn Al Habhab] telah menceritakan kepada kami [Anas] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku telah terlalu sering memperingatkan kalian untuk selalu bersiwak.\""
            },
            {
                "number": 840,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَحُصَيْنٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ يَشُوصُ فَاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Sufyan] dari [Manshur] dan [Hushain] dari [Abu Wa'il] dari [Hudzifah] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam bangun untuk sholat malam, beliau menggosok mulutnya.\""
            },
            {
                "number": 841,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ قَالَ قَالَ هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنِي أَبِي عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْدَخَلَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ وَمَعَهُ سِوَاكٌ يَسْتَنُّ بِهِ فَنَظَرَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ لَهُ أَعْطِنِي هَذَا السِّوَاكَ يَا عَبْدَ الرَّحْمَنِ فَأَعْطَانِيهِ فَقَصَمْتُهُ ثُمَّ مَضَغْتُهُ فَأَعْطَيْتُهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَنَّ بِهِ وَهُوَ مُسْتَسْنِدٌ إِلَى صَدْرِي",
                "id": "Telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepada saya [Sulaiman bin Bilal] berkata, [Hisyam bin 'Urwah] berkata, telah mengabarkan kepadaku [Bapakku] dari ['Aisyah] radliallahu 'anha, ia berkata, \"'Abdurrahman bin Abu Bakar datang dengan membawa siwak yang dia gunakan untuk membersihkan giginya, Rasulullah shallallahu 'alaihi wasallam lalu memandang ke arahnya. Maka aku pun berkata kepadanya, \"Wahai 'Abdurrahman, berikanlah siwak itu kepadaku.\" 'Abdurrahman kemudian memberikannya kepadaku, kemudian aku pecahkan dengan gigiku dan mengunyahnya (hingga lembut). Setelah itu siwak tersebut aku berikan kepada Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah menggosok giginya dengan menyandar pada dadaku.\""
            },
            {
                "number": 842,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ هُرْمُزَ الْأَعْرَجُ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ فِي صَلَاةِ الْفَجْرِ الم تَنْزِيلُ السَّجْدَةَ وَهَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنْ الدَّهْرِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Sufyan] dari [Sa'd bin Ibrahim] dari ['Abdurrahman] -yaitu Ibnu Hurmuz Al A'raj dari [Abu Hurairah] radliallahu 'anhu berkata, \"Nabi shallallahu 'alaihi wasallam dalam sholat Fajar membaca: \"ALIF LAAM MIIM TANZIIL (Surah As Sajadah), dan 'HAL ATAA 'ALAL INSAANI HIINUM MINAD DAHRI (Surah Al Insaan).\""
            },
            {
                "number": 843,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ أَبِي جَمْرَةَ الضُّبَعِيِّ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَإِنَّ أَوَّلَ جُمُعَةٍ جُمِّعَتْ بَعْدَ جُمُعَةٍ فِي مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسْجِدِ عَبْدِ الْقَيْسِ بِجُوَاثَى مِنْ الْبَحْرَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] berkata, telah menceritakan kepada kami [Abu 'Amir Al 'Aqadi] berkata, telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Abu Jamrah Adl Dluba'i] dari [Ibnu 'Abbas] bahwa dia berkata, \"Sesungguhnya (sholat) Jum'at yang pertama kali dilaksanakan setelah (sholat) Jum'at) di Masjid Rasulullah shallallahu 'alaihi wasallam adalah di Masjid 'Abdul Qais di kampung Juwatsa, negeri Bahrain.\""
            },
            {
                "number": 844,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنَا سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّكُمْ رَاعٍ وَزَادَ اللَّيْثُ قَالَ يُونُسُ كَتَبَ رُزَيْقُ بْنُ حُكَيْمٍ إِلَى ابْنِ شِهَابٍ وَأَنَا مَعَهُ يَوْمَئِذٍ بِوَادِي الْقُرَى هَلْ تَرَى أَنْ أُجَمِّعَ وَرُزَيْقٌ عَامِلٌ عَلَى أَرْضٍ يَعْمَلُهَا وَفِيهَا جَمَاعَةٌ مِنْ السُّودَانِ وَغَيْرِهِمْ وَرُزَيْقٌ يَوْمَئِذٍ عَلَى أَيْلَةَ فَكَتَبَ ابْنُ شِهَابٍ وَأَنَا أَسْمَعُ يَأْمُرُهُ أَنْ يُجَمِّعَ يُخْبِرُهُ أَنَّ سَالِمًا حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ الْإِمَامُ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ وَالرَّجُلُ رَاعٍ فِي أَهْلِهِ وَهُوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ وَالْمَرْأَةُ رَاعِيَةٌ فِي بَيْتِ زَوْجِهَا وَمَسْئُولَةٌ عَنْ رَعِيَّتِهَا وَالْخَادِمُ رَاعٍ فِي مَالِ سَيِّدِهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ قَالَ وَحَسِبْتُ أَنْ قَدْ قَالَ وَالرَّجُلُ رَاعٍ فِي مَالِ أَبِيهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ وَكُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Muhammad Al Marwazi] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] berkata, telah mengabarkan kepada kami [Salim bin 'Abdullah] dari [Ibnu 'Umar] radliallahu 'anhuma, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap kalian adalah pemimpin.\" [Al Laits] menambahkan; [Yunus] berkata; Ruzaiq bin Hukaim menulis surat kepada [Ibnu Syihab], dan pada saat itu aku bersamanya di Wadi Qura (pinggiran kota), \"Apa pendapatmu jika aku mengumpulkan orang untuk sholat Jum'at?\" -Saat itu Ruzaiq bertugas di suatu tempat dimana banyak jama'ah dari negeri Sudan dan yang lainnya, yaitu di negeri Ailah-. Maka Ibnu Syihab membalasnya dan aku mendengar dia memerintahkan (Ruzaiq) untuk mendirikan sholat Jum'at. Lalu mengabarkan bahwa [Salim] telah menceritakan kepadanya, bahwa ['Abdullah bin 'Umar] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap kalian adalah pemimpin, dan setiap pemimpin akan dimintai pertanggung jawaban atas yang dipimpinnya. Imam adalah pemimpin yang akan diminta pertanggung jawaban atas rakyatnya. Seorang suami adalah pemimpin dan akan dimintai pertanggung jawaban atas keluarganya. Seorang isteri adalah pemimpin di dalam urusan rumah tangga suaminya, dan akan dimintai pertanggung jawaban atas urusan rumah tangga tersebut. Seorang pembantu adalah pemimpin dalam urusan harta tuannya, dan akan dimintai pertanggung jawaban atas urusan tanggung jawabnya tersebut.\" Aku menduga Ibnu 'Umar menyebutkan: \"Dan seorang laki-laki adalah pemimpin atas harta bapaknya, dan akan dimintai pertanggung jawaban atasnya. Setiap kalian adalah pemimpin dan setiap pemimpin akan dimintai pertanggung jawaban atas yang dipimpinnya.\""
            },
            {
                "number": 845,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ جَاءَ مِنْكُمْ الْجُمُعَةَ فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah menceritakan kepadaku [Salim bin 'Abdullah] bahwa dia mendengar ['Abdullah bin 'Umar] radliallahu 'anhuma berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa di antara kalian yang mendatangi sholat Jum'at, maka hendaklah dia mandi?\""
            },
            {
                "number": 846,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Shafwan bin Sulaim] dari ['Atha' bin Yaar] dari [Abu Sa'id Al Khudri], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari Jum'at adalah wajib bagi setiap orang yang sudah baligh.\""
            },
            {
                "number": 847,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ فَهَذَا الْيَوْمُ الَّذِي اخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ فَغَدًا لِلْيَهُودِ وَبَعْدَ غَدٍ لِلنَّصَارَى فَسَكَتَ ثُمَّ قَالَ حَقٌّ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا يَغْسِلُ فِيهِ رَأْسَهُ وَجَسَدَهُرَوَاهُ أَبَانُ بْنُ صَالِحٍ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلَّهِ تَعَالَى عَلَى كُلِّ مُسْلِمٍ حَقٌّ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepada kami [Ibnu Thawus] dari [Bapaknya] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita datang terakhir dan akan pertama pada hari kiamat. Mereka diberi Kitab sebelum kita dan kita diberi sesudah mereka. Inilah hari (Jum'at) dimana mereka berselisih tentangnya namun Allah memberi petunjuk kepada kita. Maka esok hari untuk Yahudi dan lusa untuk Nashrani.\" Beliau lalu diam, setelah itu beliau bersabda lagi: \"Sudah menjadi kewajiban bagi setiap Muslim untuk mandi pada satu hari dari setiap tujuh hari, pada hari itu dia basuh kepala dan tubuhnya.\" Diriwayatkan oleh [Aban bin Shalih] dari [Mujahid] dari [Thawus] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagi setiap Muslim sudah menjadi kewajiban karena Allah Ta'ala untuk mandi pada satu hari dari setiap tujuh hari.\""
            },
            {
                "number": 848,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا وَرْقَاءُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ائْذَنُوا لِلنِّسَاءِ بِاللَّيْلِ إِلَى الْمَسَاجِدِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami [Syababah] telah menceritakan kepada kami [Warqa'] dari ['Amru bin Dinar] dari [Mujahid] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Izinkanlah para wanita (bila minta izin) pergi ke masjid di malam hari.\""
            },
            {
                "number": 849,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَتْ امْرَأَةٌ لِعُمَرَ تَشْهَدُ صَلَاةَ الصُّبْحِ وَالْعِشَاءِ فِي الْجَمَاعَةِ فِي الْمَسْجِدِ فَقِيلَ لَهَا لِمَ تَخْرُجِينَ وَقَدْ تَعْلَمِينَ أَنَّ عُمَرَ يَكْرَهُ ذَلِكَ وَيَغَارُ قَالَتْ وَمَا يَمْنَعُهُ أَنْ يَنْهَانِي قَالَ يَمْنَعُهُ قَوْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Yusuf bin Musa] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami ['ubaidhullah bin 'Umar] dari [Nafi'] dari [Ibnu 'Umar]: \"Isteri Umar ikut menghadiri sholat Shubuh dan 'Isya berjama'ah di masjid.\" Lalu dikatakan kepadanya, \"Kenapa kamu pergi ke masjid padahal kamu telah mengetahui bahwa 'Umar tidak menyukainya?\" Wanita itu berkata, \"Apa yang menghalangi dia untuk melarangku?\" Penanya itu berkata, \"Yang mencegahnya adalah sabda Rasulullah shallallahu 'alaihi wasallam: 'Janganlah kalian larang para wanita mendatangi masjid-masjid Allah.\""
            },
            {
                "number": 850,
                "arab": "حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا إِسْمَاعِيلُ قَالَ أَخْبَرَنِي عَبْدُ الْحَمِيدِ صَاحِبُ الزِّيَادِيِّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ ابْنُ عَمِّ مُحَمَّدِ بْنِ سِيرِينَ قَالَ ابْنُ عَبَّاسٍلِمُؤَذِّنِهِ فِي يَوْمٍ مَطِيرٍ إِذَا قُلْتَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَلَا تَقُلْ حَيَّ عَلَى الصَّلَاةِ قُلْ صَلُّوا فِي بُيُوتِكُمْ فَكَأَنَّ النَّاسَ اسْتَنْكَرُوا قَالَ فَعَلَهُ مَنْ هُوَ خَيْرٌ مِنِّي إِنَّ الْجُمْعَةَ عَزْمَةٌ وَإِنِّي كَرِهْتُ أَنْ أُحْرِجَكُمْ فَتَمْشُونَ فِي الطِّينِ وَالدَّحَضِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isma'il] berkata, telah mengabarkan kepadaku ['Abdul Hamid] sahabatnya Az Ziyadi, berkata; telah menceritakan kepada kami ['Abdullah bin Al Harits] anak pamannya Muhammad bin Sirin, [Ibnu 'Abbas] berkata kepada Mu'adzinnya saat hari turun hujan, \"Jika kamu sudah mengucapkan 'ASYHADU ANNA MUHAMMADAR RASULULLAH', janganlah kamu sambung dengan HAYYA 'ALASHSHALAAH (Marilah mendirikan sholat) '. Tapi serukanlah, 'SHALLUU FII BUYUUTIKUM (sholatlah di tempat tinggal masing-masing) '.\" Lalu orang-orang seakan mengingkarinya. Maka Ibnu 'Abbas pun berkata, \"Sesungguhnya hal yang demikian ini pernah dilakukan oleh orang yang lebih baik dariku. Sesungguhnya sholat Jum'at adalah kewajiban dan aku tidak suka untuk mengeluarkan kalian, sehingga kalian berjalan di tanah yang penuh dengan air dan lumpur.\""
            },
            {
                "number": 851,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ النَّاسُ يَنْتَابُونَ يَوْمَ الْجُمُعَةِ مِنْ مَنَازِلِهِمْ وَالْعَوَالِيِّ فَيَأْتُونَ فِي الْغُبَارِ يُصِيبُهُمْ الْغُبَارُ وَالْعَرَقُ فَيَخْرُجُ مِنْهُمْ الْعَرَقُ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْسَانٌ مِنْهُمْ وَهُوَ عِنْدِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّكُمْ تَطَهَّرْتُمْ لِيَوْمِكُمْ هَذَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami ['Abdullah bin Wahab] berkata, telah mengabarkan kepadaku ['Amru bin Al Harits] dari ['ubaidhullah bin Abu Ja'far] bahwa [Muhammad bin Ja'far bin Az Zubair] menceritakan kepadanya dari ['Urwah bin Az Zubair] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Orang-orang datang berbondong-bondong pada hari Jum'at dari tempat tinggal mereka dan pinggiran kota yang jauh, mereka datang melewati padang pasir yang berdebu sehingga mereka pun berdebu dan berkeringat. Lalu seorang dari mereka mendatangi Rasulullah shallallahu 'alaihi wasallam yang saat itu beliau sedang bersamaku, beliau lantas bersabda: \"Seandainya kalian mandi dahulu.\""
            },
            {
                "number": 852,
                "arab": "حَدَّثَنَا عَبْدَانُ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ أَنَّهُ سَأَلَ عَمْرَةَ عَنْ الْغُسْلِ يَوْمَ الْجُمُعَةِ فَقَالَتْ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَاكَانَ النَّاسُ مَهَنَةَ أَنْفُسِهِمْ وَكَانُوا إِذَا رَاحُوا إِلَى الْجُمُعَةِ رَاحُوا فِي هَيْئَتِهِمْ فَقِيلَ لَهُمْ لَوْ اغْتَسَلْتُمْ",
                "id": "Telah menceritakan kepada kami ['Abdan] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Yahya bin Sa'id] bahwa dia bertanya kepada ['Amrah] tentang mandi pada hari Jum'at. Maka dia menjawab, \"' [Aisyah? radliallahu 'anha] berkata, \"Orang-orang bekerja untuk memenuhi kebutuhan diri mereka masing-masing, ketika menghadiri sholat Jum'at, mereka tetap dalam keadaan mereka masing-masing (dengan pakaian kerjanya), maka dikatakan kepada mereka, \"Seandainya kalian mandi terlebih dahulu.\""
            },
            {
                "number": 853,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ قَالَ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْجُمُعَةَ حِينَ تَمِيلُ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Suraij bin An Nu'man] berkata, telah menceritakan kepada kami [Fulaih bin Sulaiman] dari ['Utsman bin 'Abdurrahman bin 'Utsman At Taimi] dari [Anas bin Malik] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam melaksanakan sholat Jum'at ketika matahari sudah tergelincir.\""
            },
            {
                "number": 854,
                "arab": "حَدَّثَنَا عَبْدَانُ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنَّا نُبَكِّرُ بِالْجُمُعَةِ وَنَقِيلُ بَعْدَ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami ['Abdan] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Humaid] dari [Anas bin Malik] berkata, \"Kami bersegera (berpagi-pagi dan awal wwaktu) dalam mengerjakan sholat Jum'at, dan tidur siang setelahnya.\""
            },
            {
                "number": 855,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ قَالَ حَدَّثَنَا أَبُو خَلْدَةَ هُوَ خَالِدُ بْنُ دِينَارٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَدَّ الْبَرْدُ بَكَّرَ بِالصَّلَاةِ وَإِذَا اشْتَدَّ الْحَرُّ أَبْرَدَ بِالصَّلَاةِ يَعْنِي الْجُمُعَةَقَالَ يُونُسُ بْنُ بُكَيْرٍ أَخْبَرَنَا أَبُو خَلْدَةَ فَقَالَ بِالصَّلَاةِ وَلَمْ يَذْكُرْ الْجُمُعَةَ وَقَالَ بِشْرُ بْنُ ثَابِتٍ حَدَّثَنَا أَبُو خَلْدَةَ قَالَ صَلَّى بِنَا أَمِيرٌ الْجُمُعَةَ ثُمَّ قَالَ لِأَنَسٍ رَضِيَ اللَّهُ عَنْهُ كَيْفَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الظُّهْرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Bakar Al Muqaddami] berkata, telah menceritakan kepada kami [Harami bin 'Umarah] berkata, telah menceritakan kepada kami [Abu Khaldah] -yaitu Khalid bin Dinar- berkata, Aku mendengar [Anas bin Malik] berkata, \"Jika hari terasa sejuk Nabi shallallahu 'alaihi wasallam menyegerakan pelaksanaan sholat, dan bila udara panas beliau mengakhirkannya, yakni sholat Jum'at.\" [Yunus bin Bukair] berkata; telah mengabarkan kepada kami [Abu Khaldah] menyebutkan dengan lafadz 'sholat' saja dan tidak menyebutkan kata 'jum'at'. [Bisyr bin Tsabit] berkata; telah menceritakan kepada kami [Abu Khaldah] ia berkata, \"Ada seorang amir (pemimpin) sholat bersama kami kemudian bertanya kepada Anas? radliallahu 'anhu, \"Bagaimana cara Nabi shallallahu 'alaihi wasallam sholat Zhuhur?\""
            },
            {
                "number": 856,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي مَرْيَمَ الْأَنْصَارِيُّ قَالَ حَدَّثَنَا عَبَايَةُ بْنُ رِفَاعَةَ قَالَ أَدْرَكَنِي أَبُو عَبْسٍ وَأَنَا أَذْهَبُ إِلَى الْجُمُعَةِ فَقَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اغْبَرَّتْ قَدَمَاهُ فِي سَبِيلِ اللَّهِ حَرَّمَهُ اللَّهُ عَلَى النَّارِ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Yazid bin Abu Maryam Al Anshari] berkata, telah menceritakan kepada kami ['Abayah bin Rifa'ah] berkata, \" [Abu 'Abas] berjumpa denganku saat aku sedang berangkat untuk sholat Jum'at, lalu ia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang kedua kakinya berdebu di jalan Allah, maka Allah mengharamkan orang itu untuk masuk neraka.\""
            },
            {
                "number": 857,
                "arab": "حَدَّثَنَا آدَمُ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ الزُّهْرِيُّ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا تَأْتُوهَا تَسْعَوْنَ وَأْتُوهَا تَمْشُونَ عَلَيْكُمْ السَّكِينَةُ فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا فَاتَكُمْ فَأَتِمُّوا",
                "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b], [Az Zuhri] berkata dari [Sa'id] dan [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. (dalam jalur lain disebutkan) Dan telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku [Abu Salamah bin 'Abdurrahman] bahwa [Abu Hurairah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika sholat sudak ditegakkan (iqamatnya) janganlah kalian mendatnginya dengan tergesa-gesa. Datangilah dengan berjalan tenang. Maka apa yang kalian dapatkan sholatlah, dan mana yang ketinggalan sempurnakanlah.\""
            },
            {
                "number": 858,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنِي أَبُو قُتَيْبَةَ قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ لَا أَعْلَمُهُ إِلَّا عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُوا حَتَّى تَرَوْنِي وَعَلَيْكُمْ السَّكِينَةُ",
                "id": "Telah menceritakan kepada kami ['Amru bin 'Ali] berkata, telah menceritakan kepadaku [Abu Qutaibah] berkata, telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Yahya bin Abu Katsir] dari ['Abdullah bin Abu Qatadah] yang aku tidak mengetahuinya kecuali dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian berdiri hingga kalian melihat aku. Dan wajib bagi kalian (mengerjakannya dengan) tenang.\""
            },
            {
                "number": 859,
                "arab": "حَدَّثَنَا عَبْدَانُ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ ابْنِ وَدِيعَةَ حَدَّثَنَا سَلْمَانُ الْفَارِسِيُّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ وَتَطَهَّرَ بِمَا اسْتَطَاعَ مِنْ طُهْرٍ ثُمَّ ادَّهَنَ أَوْ مَسَّ مِنْ طِيبٍ ثُمَّ رَاحَ فَلَمْ يُفَرِّقْ بَيْنَ اثْنَيْنِ فَصَلَّى مَا كُتِبَ لَهُ ثُمَّ إِذَا خَرَجَ الْإِمَامُ أَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى",
                "id": "Telah menceritakan kepada kami ['Abdan] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id Al Maqburi] dari [Bapaknya] dari [Ibnu Wadi'ah] telah menceritakan kepada kami [Salman Al Farsi] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mandi pada hari Jum'at lalu bersuci semaksimal mungkin, lalu memakai minyak atau wewangian lalu keluar rumah menuju masjid, ia tidak memisahkan antara dua orang pada tempat duduknya, kemudian ia mengerjakan sholat yang dianjurkan baginya, lalu bila imam sudah datang dia berdiam mendengarkan, maka dia akan diampuni dosa-dosanya yang ada antara Jum'atnya itu dan Jum'at yang lainnya.\""
            },
            {
                "number": 860,
                "arab": "حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ سَلَّامٍ قَالَ أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ نَافِعًا يَقُولُ سَمِعْتُ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُنَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقِيمَ الرَّجُلُ أَخَاهُ مِنْ مَقْعَدِهِ وَيَجْلِسَ فِيهِ قُلْتُ لِنَافِعٍ الْجُمُعَةَ قَالَ الْجُمُعَةَ وَغَيْرَهَا",
                "id": "Telah menceritakan kepada kami [Muhammad] -yaitu Ibnu Salam- berkata, telah mengabarkan kepada kami [Makhlad bin Yazid] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, Aku mendengar [Nafi'] berkata, Aku mendengar [Ibnu 'Umar] berkata, \"Nabi shallallahu 'alaihi wasallam melarang seseorang meminta kawannya berdiri dari tempat duduknya lalu dia menempati tempat duduk tersebut.\" Aku bertanya kepada Nafi', \"Apakah ini berlaku pada saat sholat Jum'at?\" Dia menjawab, \"Untuk sholat Jum'at dan yang lainnya.\""
            },
            {
                "number": 861,
                "arab": "حَدَّثَنَا آدَمُ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَكَانَ النِّدَاءُ يَوْمَ الْجُمُعَةِ أَوَّلُهُ إِذَا جَلَسَ الْإِمَامُ عَلَى الْمِنْبَرِ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا فَلَمَّا كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ وَكَثُرَ النَّاسُ زَادَ النِّدَاءَ الثَّالِثَ عَلَى الزَّوْرَاءِقَالَ أَبُو عَبْد اللَّهِ الزَّوْرَاءُ مَوْضِعٌ بِالسُّوقِ بِالْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [As Sa'ib bin Yazid] berkata, \"Adzan panggilan sholat Jum'at pada mulanya dilakukan ketika imam sudah duduk di atas mimbar. Hal ini dipraktekkan sejak zaman Nabi shallallahu 'alaihi wasallam, Abu Bakar dan 'Umar? radliallahu 'anhuma. Ketika masa 'Utsman? radliallahu 'anhu dan manusia sudah semakin banyak, maka dia menambah adzan ketiga di Az Zaura'.\" Abu 'Abdullah berkata, \"Az Zaura' adalah bangunan yang ada di pasar di Kota Madinah.\""
            },
            {
                "number": 862,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَأَنَّ الَّذِي زَادَ التَّأْذِينَ الثَّالِثَ يَوْمَ الْجُمُعَةِ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ حِينَ كَثُرَ أَهْلُ الْمَدِينَةِ وَلَمْ يَكُنْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُؤَذِّنٌ غَيْرَ وَاحِدٍ وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الْإِمَامُ يَعْنِي عَلَى الْمِنْبَرِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami ['Abdul 'Aziz bin Abu Salamah Al Majisyun] dari [Az Zuhri] dari [As Sa'ib bin Yazid], \"Sesungguhnya orang yang menambah adzan ketiga pada sholat Jum'at adalah 'Utsman bin 'Affan? radliallahu 'anhu, ketika penduduk Madinah semakin banyak. Dan tidak ada mu'adzin bagi Nabi shallallahu 'alaihi wasallam kecuali satu. Dan adzan sholat Jum'at dilaksanakan ketika Imam sudah duduk, yakni duduk di atas mimbar.\""
            },
            {
                "number": 863,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا أَبُو بَكْرِ بْنُ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَوَهُوَ جَالِسٌ عَلَى الْمِنْبَرِ أَذَّنَ الْمُؤَذِّنُ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ قَالَ مُعَاوِيَةُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَقَالَ مُعَاوِيَةُ وَأَنَا فَقَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَقَالَ مُعَاوِيَةُ وَأَنَا فَلَمَّا أَنْ قَضَى التَّأْذِينَ قَالَ يَا أَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذَا الْمَجْلِسِ حِينَ أَذَّنَ الْمُؤَذِّنُ يَقُولُ مَا سَمِعْتُمْ مِنِّي مِنْ مَقَالَتِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Abu Bakar bin 'Utsman bin Sahl bin Hunaif] dari [Abu Umamah bin Sahl bin Hunaif] berkata, Aku mendengar [Mu'awiyyah bin Abu Suyan] ketika dia sedang duduk di atas mimbar dan mu'adzan sedang mengumandangkan adzan: 'Allahu Akbar Allahu Akbar', Mu'awiyyah mengucapkan, 'Allahu Akbar Allahu Akbar'. Ketika mu'adzin membaca 'Asyhadu anlaa ilaaha illallah', Mu'awiyyah dan aku mengucapkan seperti yang diucapkan mu'adzin. Dan ketika mu'adzin membaca 'Asyhadu anna Muhammadar rasulullah, ' Mu'awiyyah dan aku mengucapkan seperti yang diucapkan mu'adzin. Ketika adzan sudah selesai Mu'awiyyah berkata, \"Wahai manusia, sungguh ketika adzan dikumandangkan aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam mengatakan dari tempat ini seperti yang kalian dengar dari (bacaan) ucapanku tadi.\""
            },
            {
                "number": 864,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَنَّ السَّائِبَ بْنَ يَزِيدَ أَخْبَرَهُأَنَّ التَّأْذِينَ الثَّانِيَ يَوْمَ الْجُمُعَةِ أَمَرَ بِهِ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ حِينَ كَثُرَ أَهْلُ الْمَسْجِدِ وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الْإِمَامُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] bahwa [As Sa'ib bin Yazid] mengabarkan kepadanya, bahwa adzan yang kedua pada hari Jum'at diperintahkan oleh 'Utsman bin 'Affan? radliallahu 'anhu ketika penduduk Madinah semakin banyak. Adapun sebelumnya, adzan hari Jum'at dikumandangkan ketika Imam sudah duduk.\""
            },
            {
                "number": 865,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ يَقُولُإِنَّ الْأَذَانَ يَوْمَ الْجُمُعَةِ كَانَ أَوَّلُهُ حِينَ يَجْلِسُ الْإِمَامُ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا فَلَمَّا كَانَ فِي خِلَافَةِ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ وَكَثُرُوا أَمَرَ عُثْمَانُ يَوْمَ الْجُمُعَةِ بِالْأَذَانِ الثَّالِثِ فَأُذِّنَ بِهِ عَلَى الزَّوْرَاءِ فَثَبَتَ الْأَمْرُ عَلَى ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] berkata, Aku mendengar [As Sa'ib bin Yazid] berkata, \"Pada mulanya adzan pada hari Jum'at dikumandangkan ketika Imam sudah duduk di atas mimbar. Yaitu apa yang biasa dipraktekkan sejak zaman Nabi shallallahu 'alaihi wasallam, Abu Bakar dan 'Umar? radliallahu 'anhu. Pada masa Khilafah 'Utsman bin 'Affan? radliallahu 'anhu ketika manusia sudah semakin banyak, maka pada hari Jum'at dia mememerintahkan adzan yang ketiga. Sehingga dikumandangkanlah adzan (ketiga) tersebut di Az Zaura'. Kemudian berlakulah urusan tersebut menjadi ketetapan.\""
            },
            {
                "number": 866,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدٍ الْقَارِيُّ الْقُرَشِيُّ الْإِسْكَنْدَرَانِيُّ قَالَ حَدَّثَنَا أَبُو حَازِمِ بْنُ دِينَارٍأَنَّ رِجَالًا أَتَوْا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ وَقَدْ امْتَرَوْا فِي الْمِنْبَرِ مِمَّ عُودُهُ فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ وَاللَّهِ إِنِّي لَأَعْرِفُ مِمَّا هُوَ وَلَقَدْ رَأَيْتُهُ أَوَّلَ يَوْمٍ وُضِعَ وَأَوَّلَ يَوْمٍ جَلَسَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى فُلَانَةَ امْرَأَةٍ مِنْ الْأَنْصَارِ قَدْ سَمَّاهَا سَهْلٌ مُرِي غُلَامَكِ النَّجَّارَ أَنْ يَعْمَلَ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ إِذَا كَلَّمْتُ النَّاسَ فَأَمَرَتْهُ فَعَمِلَهَا مِنْ طَرْفَاءِ الْغَابَةِ ثُمَّ جَاءَ بِهَا فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهَا فَوُضِعَتْ هَا هُنَا ثُمَّ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَيْهَا وَكَبَّرَ وَهُوَ عَلَيْهَا ثُمَّ رَكَعَ وَهُوَ عَلَيْهَا ثُمَّ نَزَلَ الْقَهْقَرَى فَسَجَدَ فِي أَصْلِ الْمِنْبَرِ ثُمَّ عَادَ فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ أَيُّهَا النَّاسُ إِنَّمَا صَنَعْتُ هَذَا لِتَأْتَمُّوا وَلِتَعَلَّمُوا صَلَاتِي",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Ya'qub bin 'Abdurrahman bin Muhammad bin 'Abdullah bin 'Abdul Qari Al Qurasyi Al Iskandarani] berkata, telah menceritakan kepada kami [Abu Hazim bin Dinar] bahwa ada orang-orang mendatangi [Sahl bin Sa'd As Sa'idi] yang berdebat tentang mimbar dan bahan membuatnya? Mereka menanyakan hal itu kepadanya. Sahl lalu berkata, \"Demi Allah, akulah orang yang paling mengerti tentang masalah ini. Sungguh aku telah melihat hari pertama mimbar tersebut dipasang dan hari saat Rasulullah shallallahu 'alaihi wasallam duduk di atasnya. Rasulullah shallallahu 'alaihi wasallam mengutus orang untuk menemui seorang wanita Anshar, yang namanya sudah disebutkan oleh Sahl, Sahl lalu berkata, \"Perintahkanlah budak lelakimu yang tukang kayu itu untuk membuat mimbar bertangga, sehingga saat berbicara dengan orang banyak aku bisa duduk di atasnya.\" Maka kemudian wanita itu memerintahkan budak lelakinya membuat mimbar yang terbuat dari batang kayu hutan. Setelah diberikan kepada wanita itu, lalu itu mengirimnya untuk Rasulullah shallallahu 'alaihi wasallam. Maka Beliau memerintahkan orang untuk meletakkan mimbar tersebut di sini. Lalu aku melihat Rasulullah shallallahu 'alaihi wasallam sholat diatasnya. Beliau bertakbir dalam posisi di atas mimbar lalu rukuk dalam posisi masih di atas mimbar. Kemudian Beliau turun dengan mundur ke belakang, lalu sujud di dasar mimbar, kemudian Beliau mengulangi lagi (hingga sholat selesai). Setelah selesai, beliau menghadap kepada orang banyak lalu bersabda: \"Wahai sekalian manusia, sesungguhnya aku berbuat seperti tadi agar kalian mengikuti dan agar kalian dapat mengambil pelajaran tentang tata cara sholatku.\""
            },
            {
                "number": 867,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ قَالَ أَخْبَرَنِي ابْنُ أَنَسٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَكَانَ جِذْعٌ يَقُومُ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا وُضِعَ لَهُ الْمِنْبَرُ سَمِعْنَا لِلْجِذْعِ مِثْلَ أَصْوَاتِ الْعِشَارِ حَتَّى نَزَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَ يَدَهُ عَلَيْهِقَالَ سُلَيْمَانُ عَنْ يَحْيَى أَخْبَرَنِي حَفْصُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah mengabarkan kepadaku [Yahya bin Sa'id] berkata, telah mengabarkan kepada kami [Ibnu Anas] bahwa dia mendengar [Jabir bin 'Abdullah] berkata, \"Pada mulanya Nabi shallallahu 'alaihi wasallam menggunakan batang kayu sebagai tongkat yang biasa beliau gunakan untuk bersandar. Ketika sudah dibuatkan mimbar untuk Beliau, kami mendengar sesuatu dari batang kayu tersebut seperti suara unta hendak beranak, hingga akhirnya Nabi shallallahu 'alaihi wasallam turun lalu meletakkan tangan Beliau pada kayu tersebut.\" [Sulaiman] berkata, dari [Yahya] berkata, telah mengabarkan kepadaku [Hafsh bin 'ubaidhullah bin Anas] bahwa dia mendengar dari [Jabir bin 'Abdullah].\""
            },
            {
                "number": 868,
                "arab": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى الْمِنْبَرِ فَقَالَ مَنْ جَاءَ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Adam bin Abu Iyas] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [Salim] dari [Bapaknya] berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda saat sedang berkhuthbah di atas mimbar: \"Siapa yang mendatangi sholat Jum'at, hendaklah dia mandi.\""
            },
            {
                "number": 869,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ ثُمَّ يَقُومُ كَمَا تَفْعَلُونَ الْآنَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin 'Umar Al Qawariri] berkata, telah menceritakan kepada kami [Khalid bin Al Harits] berkata, telah menceritakan kepada kami ['ubaidhullah bin 'Umar] dari [Nafi'] dari [Ibnu 'Umar] radliallahu 'anhuma, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhuthbah sambil berdiri, kemudian duduk lalu berdiri kembali seperti yang kalian lakukan di zaman sekarang ini.\""
            },
            {
                "number": 870,
                "arab": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ حَدَّثَنَا عَطَاءُ بْنُ يَسَارٍ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَلَسَ ذَاتَ يَوْمٍ عَلَى الْمِنْبَرِ وَجَلَسْنَا حَوْلَهُ",
                "id": "Telah menceritakan kepada kami [Mu'adz bin Fadlalah] berkata, telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Hilal bin Abu Maimunah] telah menceritakan kepada kami ['Atha' bin Yasar] bahwasanya dia mendengar [Abu Sa'id Al Khudri] radliallahu 'anhu berkata, \"Pada suatu hari Nabi shallallahu 'alaihi wasallam duduk di atas mimbar dan kami duduk di sekitarnya.\""
            },
            {
                "number": 871,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ جَرِيرِ بْنِ حَازِمٍ قَالَ سَمِعْتُ الْحَسَنَ يَقُولُ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِمَالٍ أَوْ سَبْيٍ فَقَسَمَهُ فَأَعْطَى رِجَالًا وَتَرَكَ رِجَالًا فَبَلَغَهُ أَنَّ الَّذِينَ تَرَكَ عَتَبُوا فَحَمِدَ اللَّهَ ثُمَّ أَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ فَوَاللَّهِ إِنِّي لَأُعْطِي الرَّجُلَ وَأَدَعُ الرَّجُلَ وَالَّذِي أَدَعُ أَحَبُّ إِلَيَّ مِنْ الَّذِي أُعْطِي وَلَكِنْ أُعْطِي أَقْوَامًا لِمَا أَرَى فِي قُلُوبِهِمْ مِنْ الْجَزَعِ وَالْهَلَعِ وَأَكِلُ أَقْوَامًا إِلَى مَا جَعَلَ اللَّهُ فِي قُلُوبِهِمْ مِنْ الْغِنَى وَالْخَيْرِ فِيهِمْ عَمْرُو بْنُ تَغْلِبَ فَوَاللَّهِ مَا أُحِبُّ أَنَّ لِي بِكَلِمَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُمْرَ النَّعَمِتَابَعَهُ يُونُسُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ma'mar] berkata, telah menceritakan kepada kami [Abu 'Ashim] dari [Jarir bin Hazim] berkata, aku mendengar [Al Hasan] berkata, telah menceritakan kepada kami ['Amru bin Taghlib], bahwa Rasulullah shallallahu 'alaihi wasallam pernah diberi hadiah berupa harta atau tawanan wanita, beliau lalu membagi-bagikannya. Ada orang yang diberi dan ada yang tidak. Kemudian sampai berita kepada beliau bahwa orang-orang yang tidak diberi, mereka mencela (beliau). Maka mengucapkan puja dan puji kepada Allah lalu bersabda: \"Amma ba'du. Demi Allah, memang aku telah memberi seseorang dan tidak kepada yang lain. Orang yang tidak aku beri sesungguhnya lebih aku cintai daripada orang yang aku beri. Namun aku memberi sekelompok kaum karena aku melihat hati-hati mereka masih sangat bersedih dan punya rasa takut. Dan aku biarkan sekelompok orang karena Allah telah menjadikan hati-hati mereka penuh dengan perasaan cukup dan penuh kebaikan. Di antara mereka adalah 'Amru bin Taghlib.\" 'Amru bin Taghlib berkata, \"Demi Allah, tidak ada yang lebih aku sukai dari unta yang paling baik dibandingkan ucapan Rasulullah shallallahu 'alaihi wasallam kepadaku tadi.\" Hadits ini dikuatkan oleh [Yunus].\""
            },
            {
                "number": 872,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ ذَاتَ لَيْلَةٍ مِنْ جَوْفِ اللَّيْلِ فَصَلَّى فِي الْمَسْجِدِ فَصَلَّى رِجَالٌ بِصَلَاتِهِ فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا فَاجْتَمَعَ أَكْثَرُ مِنْهُمْ فَصَلَّوْا مَعَهُ فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا فَكَثُرَ أَهْلُ الْمَسْجِدِ مِنْ اللَّيْلَةِ الثَّالِثَةِ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّوْا بِصَلَاتِهِ فَلَمَّا كَانَتْ اللَّيْلَةُ الرَّابِعَةُ عَجَزَ الْمَسْجِدُ عَنْ أَهْلِهِ حَتَّى خَرَجَ لِصَلَاةِ الصُّبْحِ فَلَمَّا قَضَى الْفَجْرَ أَقْبَلَ عَلَى النَّاسِ فَتَشَهَّدَ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّهُ لَمْ يَخْفَ عَلَيَّ مَكَانُكُمْ لَكِنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ فَتَعْجِزُوا عَنْهَاقَالَ أَبُو عَبْد اللَّهِ تَابَعَهُ يُونُسُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah mengabarkan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata, telah mengabarkan kepadaku ['Urwah] bahwa ['Aisyah] radliallahu 'anha mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam pada suatu malam keluar di tengah malam untuk melaksanakan sholat di masjid, orang-orang kemudian mengikuti beliau dan sholat dibelakangnya. Pada waktu paginya orang-orang membicarakan kejadian tersebut. Kemudian pada malam berikutnya orang-orang yang berkumpul bertambah banyak lalu ikut sholat dengan Beliau. Dan pada waktu paginya orang-orang kembali membicarakan kejadian tersebut. Kemudian pada malam yang ketiga orang-orang yang hadir di masjid semakin bertambah banyak lagi, lalu Rasulullah shallallahu 'alaihi wasallam keluar untuk sholat dan mereka sholat bersama beliau. Kemudian pada malam yang keempat, masjid sudah penuh dengan jama'ah hingga akhirnya beliau keluar hanya untuk sholat Shubuh. Setelah beliau selesai sholat Fajar, beliau menghadap kepada orang banyak membaca syahadat lalu bersabda: \"Amma ba'du, sesungguhnya aku bukannya tidak tahu keberadaan kalian (semalam). Akan tetapi aku takut sholat tersebut akan diwajibkan atas kalian, sementara kalian tidak mampu.\" Abu 'Abdullah Al Bukhari berkata, \"Hadits ini dikuatkan oleh [Yunus].\""
            },
            {
                "number": 873,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ أَنَّهُ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ عَشِيَّةً بَعْدَ الصَّلَاةِ فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُتَابَعَهُ أَبُو مُعَاوِيَةَ وَأَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَمَّا بَعْدُ تَابَعَهُ الْعَدَنِيُّ عَنْ سُفْيَانَ فِي أَمَّا بَعْدُ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku ['Urwah] dari [Abu Humaid As Sa'idi] bahwasanya dia mengabarkan kepadanya, bahwa setelah melaksanakan sholat di awal malam (Isya) Rasulullah shallallahu 'alaihi wasallam berdiri, lalu membaca syahadah dan puja pujnya kepada Allah dengan pujian yang layak (bagi Allah), beliau lalu mengucapkan: \"Amma ba'du.\" Hadits ini dikuatkan oleh [Abu Mu'awiyyah] dan [Abu Usamah] dari [Hisyam] dari [Bapaknya] dari [Abu Humaid As Sa'idi] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Amma ba'du.\" Dikuatkan juga oleh [Al 'Adani] dari [Sufyan] tentang ucapan 'Amma ba'du'.\""
            },
            {
                "number": 874,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْتُهُ حِينَ تَشَهَّدَ يَقُولُ أَمَّا بَعْدُتَابَعَهُ الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku ['Ali bin Husain] dari [Al Miswar bin Makhramah] berkata, \"Rasulullah shallallahu 'alaihi wasallam berdiri, lalu ketika beliau mengucapkan syahadat, aku mendengar beliau mengucapkan: 'Amma ba'du'.\" Hadits ini dikuatkan oleh [Az Zubaidi] dari [Az Zuhri].\""
            },
            {
                "number": 875,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ قَالَ حَدَّثَنَا ابْنُ الْغَسِيلِ قَالَ حَدَّثَنَا عِكْرِمَةُ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَصَعِدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمِنْبَرَ وَكَانَ آخِرَ مَجْلِسٍ جَلَسَهُ مُتَعَطِّفًا مِلْحَفَةً عَلَى مَنْكِبَيْهِ قَدْ عَصَبَ رَأْسَهُ بِعِصَابَةٍ دَسِمَةٍ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِلَيَّ فَثَابُوا إِلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ هَذَا الْحَيَّ مِنْ الْأَنْصَارِ يَقِلُّونَ وَيَكْثُرُ النَّاسُ فَمَنْ وَلِيَ شَيْئًا مِنْ أُمَّةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَطَاعَ أَنْ يَضُرَّ فِيهِ أَحَدًا أَوْ يَنْفَعَ فِيهِ أَحَدًا فَلْيَقْبَلْ مِنْ مُحْسِنِهِمْ وَيَتَجَاوَزْ عَنْ مُسِيِّهِمْ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Aban] berkata, telah menceritakan kepada kami [Ibnu Al Ghasil] berkata, telah menceritakan kepada kami ['Ikrimah] dari [Ibnu 'Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam menaiki mimbar -yang merupakan kali terakhir beliau duduk di situ- dalam keadaan berselimut yang diletakkannya di atas kedua pundaknya dan mengikat kepalanya dengan ikat kepala berwarna hitam. Setelah memuji Allah dan mensucikan-Nya, beliau bersabda: \"Amma ba'du, wahai sekalian manusia berkumpullah di hadapanku.\" Maka orang-orang berkumpul mengelilingi beliau. Kemudian beliau melanjutkan: \"Amma ba'du, sesungguhnya orang yang masih hidup dari kalangan Anshar semakin sedikit, sedangkan orang-orang lain (selain Anshar) terus bertambah banyak. Maka barangsiapa mengurus sesuatu dari urusan ummat Muhammad lalu dia mampu mendatangkan madlarat kepada seseorang atau memberi manfaat kepada seseorang, maka terimalah orang-orang baik mereka (kaum Anshar) dan maafkanlah orang yang keliru dari kalangan mereka.\""
            },
            {
                "number": 876,
                "arab": "حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ خُطْبَتَيْنِ يَقْعُدُ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Bisyir bin Al Mufadldlal] berkata, telah menceritakan kepada kami ['ubaidhullah bin 'Umar] dari [Nafi'] dari ['Abdullah bin 'Umar] radliallahu 'anhuma, ia berkata, \"Nabi shallallahu 'alaihi wasallam berkhuthbah dengan dua kali khuthbah dan duduk di antara keduanya.\""
            },
            {
                "number": 877,
                "arab": "حَدَّثَنَا آدَمُ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ وَقَفَتْ الْمَلَائِكَةُ عَلَى بَابِ الْمَسْجِدِ يَكْتُبُونَ الْأَوَّلَ فَالْأَوَّلَ وَمَثَلُ الْمُهَجِّرِ كَمَثَلِ الَّذِي يُهْدِي بَدَنَةً ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً ثُمَّ كَبْشًا ثُمَّ دَجَاجَةً ثُمَّ بَيْضَةً فَإِذَا خَرَجَ الْإِمَامُ طَوَوْا صُحُفَهُمْ وَيَسْتَمِعُونَ الذِّكْرَ",
                "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [Abu 'Abdullah Al Aghar] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Pada hari Jum'at para Malaikat hadir di pintu Masjid mencatat siapa orang yang datang paling awal dan seterusnya. Orang yang paling awal datang ke Masjid seperti orang yang berkurban dengan seekor unta, kemudian seperti orang yang berkurban dengan seekor sapi, kemudian seperti orang yang berkurban seekor kambing yang bertanduk, kemudian seperti orang yang berkurban seekor ayam, kemudian seperti orang yang berkurban sebutir telur. Dan apabila Imam sudah keluar (untuk memberi khutbah), maka para Malaikat menutup buku catatan mereka kemudian mendengarkan dzikir (khutbah).\""
            },
            {
                "number": 878,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَجَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ فَقَالَ أَصَلَّيْتَ يَا فُلَانُ قَالَ لَا قَالَ قُمْ فَارْكَعْ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amru bin Dinar] dari [Jabir bin 'Abdullah] berkata, \"Seorang laki-laki datang saat Nabi shallallahu 'alaihi wasallam sedang memberikan khutbah di hadapan orang banyak pada hari Jum'at. Beliau lalu bertanya: \"Wahai fulan, apakah kamu sudah sholat?\" Orang itu menjawab, \"Belum.\" Maka beliau bersabda: \"Bangun dan sholatlah dua rakaat.\""
            },
            {
                "number": 879,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ جَابِرًا قَالَدَخَلَ رَجُلٌ يَوْمَ الْجُمُعَةِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ أَصَلَّيْتَ قَالَ لَا قَالَ قُمْ فَصَلِّ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah menceritakan kepada kami [Sufyan] dari ['Amru] bahwa dia telah mendengar [Jabir] berkata, \"Pada hari Jum'at seorang laki-laki datang ketika Nabi shallallahu 'alaihi wasallam sedang memberikan khutbah. Beliau lalu bertanya: \"Apakah kamu sudah sholat?\" Orang itu menjawab, \"Belum.\" Maka beliau pun bersabda: \"Bangun dan sholatlah dua rakaat.\""
            },
            {
                "number": 880,
                "arab": "حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ وَعَنْ يُونُسَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَبَيْنَمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْكُرَاعُ وَهَلَكَ الشَّاءُ فَادْعُ اللَّهَ أَنْ يَسْقِيَنَا فَمَدَّ يَدَيْهِ وَدَعَا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari ['Abdul 'Aziz bin Shuhaib] dari [Anas] dan dari [Yunus] dari [Tsabit] dari [Anas] berkata, \"Ketika Nabi shallallahu 'alaihi wasallam sedang menyampaikan khutbah pada hari Jum'at, tiba-tiba ada seorang laki-laki berdiri dan berkata, \"Wahai Rasulullah, telah binasa binatang ternak (unta) dan telah binasa kehidupan (telah menjadi sulit), maka berdo'alah kepada Allah agar menurunkan air untuk kami.\" Rasulullah lalu menengadahkan kedua telapak tangan dan berdo'a.\""
            },
            {
                "number": 881,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا أَبُو عَمْرٍو الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَأَصَابَتْ النَّاسَ سَنَةٌ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فِي يَوْمِ جُمُعَةٍ قَامَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْمَالُ وَجَاعَ الْعِيَالُ فَادْعُ اللَّهَ لَنَا فَرَفَعَ يَدَيْهِ وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً فَوَالَّذِي نَفْسِي بِيَدِهِ مَا وَضَعَهَا حَتَّى ثَارَ السَّحَابُ أَمْثَالَ الْجِبَالِ ثُمَّ لَمْ يَنْزِلْ عَنْ مِنْبَرِهِ حَتَّى رَأَيْتُ الْمَطَرَ يَتَحَادَرُ عَلَى لِحْيَتِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمُطِرْنَا يَوْمَنَا ذَلِكَ وَمِنْ الْغَدِ وَبَعْدَ الْغَدِ وَالَّذِي يَلِيهِ حَتَّى الْجُمُعَةِ الْأُخْرَى وَقَامَ ذَلِكَ الْأَعْرَابِيُّ أَوْ قَالَ غَيْرُهُ فَقَالَ يَا رَسُولَ اللَّهِ تَهَدَّمَ الْبِنَاءُ وَغَرِقَ الْمَالُ فَادْعُ اللَّهَ لَنَا فَرَفَعَ يَدَيْهِ فَقَالَ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا فَمَا يُشِيرُ بِيَدِهِ إِلَى نَاحِيَةٍ مِنْ السَّحَابِ إِلَّا انْفَرَجَتْ وَصَارَتْ الْمَدِينَةُ مِثْلَ الْجَوْبَةِ وَسَالَ الْوَادِي قَنَاةُ شَهْرًا وَلَمْ يَجِئْ أَحَدٌ مِنْ نَاحِيَةٍ إِلَّا حَدَّثَ بِالْجَوْدِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Abu 'Amru Al Auza'i] berkata, telah menceritakan kepadaku [Ishaq bin 'Abdullah bin Abu Thalhah] dari [Anas bin Malik] berkata, \"Pasa masa Nabi shallallahu 'alaihi wasallam manusia tertimpa paceklik. Ketika Nabi shallallahu 'alaihi wasallam sedang memberikan khutbah pada hari Jum'at, tiba-tiba ada seorang Arab badui berdiri dan berkata, \"Wahai Rasulullah, harta benda telah binasa dan telah terjadi kelaparan, maka berdo'alah kepada Allah untuk kami.\" Beliau lalu mengangkat kedua telapak tangan berdo'a, dan saat itu kami tidak melihat sedikitpun ada awan di langit. Namun demi Dzat yang jiwaku berada di tangan-Nya, sungguh beliau tidak menurunkan kedua tangannya kecuali gumpalan awan telah datang membumbung tinggi laksana pegunungan. Dan beliau belum turun dari mimbar hingga akhirnya aku melihat hujan turun membasahi jenggot beliau shallallahu 'alaihi wasallam. Maka pada hari itu, keesokan harinya dan lusa kami terus-terusan mendapatkan guyuran hujan dan hari-hari berikutnya hingga hari Jum'at berikutnya. Pada Jum'at berikut itulah orang Arab badui tersebut, atau orang yang lain berdiri seraya berkata, \"Wahai Rasulullah, banyak bangunan yang roboh, harta benda tenggelam dan hanyut, maka berdo'alah kepada Allah untuk kami.\" Beliau lalu mengangkat kedua telapak tangannya dan berdo'a: 'ALLAHUMMA HAWAALAINAA WA LAA 'ALAINAA (Ya Allah, turunkanlah hujan di sekeliling kami dan jangan sampai menimbulkan kerusakan kepada kami) '. Belum lagi beliau memberikan isyarat dengan tangannya kepada gumpalan awan, melainkan awan tersebut hilang seketika. Saat itu kota Madinah menjadi seperti danau dan aliran-aliran air, Madinah juga tidak mendapatkan sinar matahari selama satu bulan. Dan tidak seorang pun yang datang dari segala pelosok kota kecuali akan menceritakan tentang terjadinya hujan yang lebat tersebut.\""
            },
            {
                "number": 882,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ لِصَاحِبِكَ يَوْمَ الْجُمُعَةِ أَنْصِتْ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata, telah menceritakan kepadaku [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu berkata kepada temanmu pada hari Jum'at 'diamlah', padahal Imam sedang memberikan khutbah maka sungguh kamu sudah berbuat sia-sia (tidak mendapat pahala).\""
            }
        ]
    }
}