{
    "status": true,
    "data": {
        "start": 2941,
        "end": 3087,
        "total": 9,
        "book": "darimi",
        "hadits": [
            {
                "number": 2941,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لِأَبِي مُوسَى وَكَانَ حَسَنَ الصَّوْتِ بِالْقُرْآنِ لَقَدْ أُوتِيَ هَذَا مِنْ مَزَامِيرِ آلِ دَاوُدَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata; Telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada [Abu Musa], ia adalah seorang yang bagus suaranya saat membaca al-qur'an: \"Sungguh, orang ini telah diberi suara seperti (suara) seruling dari seruling-seruling keluarga Dawud.\" "
            },
            {
                "number": 2942,
                "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ حَدَّثَنَا إِبْرَاهِيمُ الْهَجَرِيُّ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَ لَا أُلْفِيَنَّ أَحَدَكُمْ يَضَعُ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى يَتَغَنَّى وَيَدَعُ أَنْ يَقْرَأَ سُورَةَ الْبَقَرَةِ فَإِنَّ الشَّيْطَانَ يَفِرُّ مِنْ الْبَيْتِ يُقْرَأُ فِيهِ سُورَةُ الْبَقَرَةِ وَإِنَّ أَصْفَرَ الْبُيُوتِ الْجَوْفُ يَصْفَرُ مِنْ كِتَابِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] telah menceritakan kepada kami [Ibrahim Al Hajari] dari [Abu Al Ahwash] dari [Abdullah] berkata; Sungguh, aku tidak akan menemui salah seorang dari kalian yang meletakkan salah satu kaki di atas kaki lainnya sambil melantunkan al-qur'an namun ia meninggalkan membaca surat Al Baqarah, karena sesungguhnya setan akan lari dari rumah yang dibacakan surat Al Baqarah di dalamnya. Dan sesungguhnya rumah yang paling kosong adalah rumah yang kosong dari (bacaan) kitab Allah."
            },
            {
                "number": 2943,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ قَالَ حَدَّثَنِي بَعْضُ آلِ سَالِمِ بْنِ عَبْدِ اللَّهِ قَالَ قَدِمَ سَلَمَةُ الْبَيْذَقُ الْمَدِينَةَ فَقَامَ يُصَلِّي بِهِمْ فَقِيلَ لِسَالِمٍ لَوْ جِئْتَ فَسَمِعْتَ قِرَاءَتَهُ فَلَمَّا كَانَ بِبَابِ الْمَسْجِدِ سَمِعَ قِرَاءَتَهُ رَجَعَ فَقَالَ غِنَاءٌ غِنَاءٌ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] ia berkata; Telah menceritakan kepadaku [sebagian keluarga Salim bin Abdullah] berkata; Salamah Al Baidzaq datang ke Madinah, lalu ia berdiri melakukan sholat bersama mereka. Maka dikatakan kepada [Salim]; Seandainya engkau datang maka engkau akan mendengarkan bacaannya? Ketika berada di pintu masjid, ia mendengar bacaannya, ia pun langsung kembali seraya berkata; Ini adalah nyanyian, ini adalah nyanyian."
            },
            {
                "number": 2944,
                "arab": " حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَذِنَ اللَّهُ لِشَيْءٍ كَأَذَنِهِ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Muhammad] ia adalah Ibnu Amr, dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah tidak mengizinkan sesuatu seperti izinNya kepada Nabi untuk melantunkan al-qur'an dengan suara yang indah sambil mengeraskan bacaannya.\""
            },
            {
                "number": 2945,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَقَدْ أُوتِيَ أَبُو مُوسَى مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] dari [Malik bin Mighwal] dari [Ibnu Buraidah] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sungguh, Abu Musa telah diberi suara seperti seruling dari seruling-seruling keluarga Dawud.\" "
            },
            {
                "number": 2946,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعَ قِرَاءَةَ رَجُلٍ فَقَالَ مَنْ هَذَا قِيلَ عَبْدُ اللَّهِ بْنُ قَيْسٍ قَالَ لَقَدْ أُوتِيَ هَذَا مِنْ مَزَامِيرِ آلِ دَاوُدَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Muhammad bin Amr] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Ketika Rasulullah shallallahu 'alaihi wasallam masuk, beliau mendengar bacaan seorang laki-laki. Beliau pun bertanya: \"Siapa orang ini?\" Dikatakan; Abdullah bin Qais. Beliau bersabda: \"Sungguh, orang ini telah diberi suara seperti seruling dari seruling-seruling keluarga Dawud.\" "
            },
            {
                "number": 2947,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا صَدَقَةُ بْنُ أَبِي عِمْرَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ زَاذَانَ أَبِي عُمَرَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حَسِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ فَإِنَّ الصَّوْتَ الْحَسَنَ يَزِيدُ الْقُرْآنَ حُسْنًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr] telah menceritakan kepada kami [Shadaqah bin Abu Imran] dari ['Alqamah bin Martsad] dari [Zadzan Abu Umar] dari [Al Bara` bin 'Azib] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Baguskanlah al-qur'an dengan suara-suara kalian, sesungguhnya suara yang indah dapat menambah keindahan al-qur'an.\""
            },
            {
                "number": 2948,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ عَنْ الْأَعْمَشِ قَالَ قَرَأَ رَجُلٌ عِنْدَ أَنَسٍ بِلَحْنٍ مِنْ هَذِهِ الْأَلْحَانِ فَكَرِهَ ذَلِكَ أَنَسٌ قَالَ أَبُو مُحَمَّد و قَالَ غَيْرُهُ قَرَأَ غُورَكُ بْنُ أَبِي الْخِضْرِمِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] dari [Abdullah bin Idris] dari [Al A'masy] ia berkata; Suatu ketika ada seseorang membaca al-qur'an di samping [Anas] dengan salah satu dari lahn ini, lalu Anas membenci hal itu. Abu Muhammad dan yang lainnya berkata; Yang membaca adalah Ghaurak bin Abu Al Khidlrim. "
            },
            {
                "number": 2949,
                "arab": " حَدَّثَنَا الْعَبَّاسُ بْنُ سُفْيَانَ عَنْ ابْنِ عُلَيَّةَ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ كَانُوا يَرَوْنَ هَذِهِ الْأَلْحَانَ فِي الْقُرْآنِ مُحْدَثَةً",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Sufyan] dari [Abu 'Ullayah] dari [Ibnu Aun] dari [Muhammad] berkata; mereka berpendapat bahwa lahn yang dilakukan pada al-qur'an adalah sesuatu yang baru. "
            }
        ]
    }
}