{
    "status": true,
    "data": {
        "start": 148,
        "end": 294,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 148,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ بِشْرٍ حَدَّثَنَا أَبِي عَنْ إِسْمَعِيلَ عَنْ عَامِرٍ أَنَّهُ قَالَ كَانَ يَقُولُ مَا أَبْغَضَ إِلَيَّ أَرَأَيْتَ أَرَأَيْتَ يَسْأَلُ الرَّجُلُ صَاحِبَهُ فَيَقُولُ أَرَأَيْتَ وَكَانَ لَا يُقَايِسُ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Bisyr] telah menceritakan kepada kami [ayahku] dari [Isma'il] dari ['Amir] Bahwasanya ia berkata: \" Suatu hal yang paling membangkitkan kemarahanku adalah jika seseorang bertanya; menurut anda bagaimana, menurut anda bagaimana. Seorang bertanya kepada temannya: 'menurut anda bagaimana'. Dan Amir tidak melakukan qiyas'\"."
            },
            {
                "number": 149,
                "arab": " أَخْبَرَنَا صَدَقَةُ بْنُ الْفَضْلِ أَخْبَرَنَا ابْنُ عُيَيْنَةَ عَنْ إِسْمَعِيلَ عَنْ الشَّعْبِيِّ قَالَ لَوْ أَنَّ هَؤُلَاءِ كَانُوا عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنَزَلَتْ عَامَّةُ الْقُرْآنِ يَسْأَلُونَكَ يَسْأَلُونَكَ",
                "id": "Telah mengabarkan kepada kami [Shadaqah bin Al Fadl] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Isma'il] dari [As Sya'bi] ia berkata: \" Sekiranya mereka itu berada pada zaman Nabi shallallahu 'alaihi wasallam, niscaya kebanyakan ayat Al Qur`an yang turun adalah YAS`ALUUNAKA, YAS`ALUUNAKA (mereka bertanya kepadamu) \". "
            },
            {
                "number": 150,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبَانَ أَخْبَرَنِي مُحَمَّدٌ هُوَ ابْنُ طَلْحَةَ عَنْ مَيْمُونٍ أَبِي حَمْزَةَ قَالَ قَالَ لِي إِبْرَاهِيمُ يَا أَبَا حَمْزَةَ وَاللَّهِ لَقَدْ تَكَلَّمْتُ وَلَوْ وَجَدْتُ بُدًّا مَا تَكَلَّمْتُ وَإِنَّ زَمَانًا أَكُونُ فِيهِ فَقِيهَ أَهْلِ الْكُوفَةِ زَمَانُ سُوءٍ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin `Abaan] telah mengabarkan kepadaku [Muhammad Ibnu Thalhah], dari [Maimun Abu Hamzah] ia berkata: \" [Ibrahim] berkata kepadaku: 'Wahai Abu Hamzah, demi Allah, aku telah berkata (berfatwa), sekiranya ada yang menggantikan, aku tidak mau berkata (berfatwa), sesungguhnya zaman saat aku menjadi seorang ahli fikih kota Kufah adalah zaman yang tidak baik\"."
            },
            {
                "number": 151,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ قَالَ قَالَ عُمَرُ إِيَّاكَ وَالْمُكَايَلَةَ يَعْنِي فِي الْكَلَامِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Laits] dari [Mujahid] ia berkata: \" [Umar] radliallahu 'anhu berkata: ' Berhati-hatilah dengan mengqiyaskan sesuatu\" Yaitu dalam perkataan."
            },
            {
                "number": 152,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا مَالِكٌ هُوَ ابْنُ مِغْوَلٍ قَالَ قَالَ لِيَ الشَّعْبِيُّ مَا حَدَّثُوكَ هَؤُلَاءِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخُذْ بِهِ وَمَا قَالُوهُ بِرَأْيِهِمْ فَأَلْقِهِ فِي الْحُشِّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Malik Ibnu Mighwal], ia berkata: [As Sya'bi] telah berkata kepadaku: \"Apa yang mereka ceritakan dari Rasulullah shallallahu 'alaihi wasallam maka ambilah, dan apa yang mereka katakan (berdasarkan) pendapat mereka maka lemparkanlah ke WC\". "
            },
            {
                "number": 153,
                "arab": " أَخْبَرَنِي الْعَبَّاسُ بْنُ سُفْيَانَ عَنْ زَيْدِ بْنِ حُبَابٍ أَخْبَرَنِي رَجَاءُ بْنُ أَبِي سَلَمَةَ قَالَ سَمِعْتُ عَبْدَةَ بْنَ أَبِي لُبَابَةَ يَقُولُ قَدْ رَضِيتُ مِنْ أَهْلِ زَمَانِي هَؤُلَاءِ أَنْ لَا يَسْأَلُونِي وَلَا أَسْأَلُهُمْ إِنَّمَا يَقُولُ أَحَدُهُمْ أَرَأَيْتَ أَرَأَيْتَ",
                "id": "Telah mengabarkan kepada kami [Al 'Abbas bin Sufyan] dari [Zaid bin hubab], telah mengabarkan kepada kami [Raja` bin Abu Salamah] ia berkata: Aku mendengar ['Abdah bin Abu Lubabah] berkata: 'Sungguh aku senang (jika) masyarakat pada zamanku, mereka tidak bertanya kepadaku dan aku juga tidak bertanya kepada mereka, (Aku sangat tidak suka) karena mereka selalu bertanya: 'Bagaimana menurut pendapatmu, bagaimana menurut pendapatmu\"."
            },
            {
                "number": 154,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا وَرْقَاءُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ { وَلَا تَتَّبِعُوا السُّبُلَ } قَالَ الْبِدَعَ وَالشُّبُهَاتِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Warqa`] dari [Ibnu Abu Najih] dari [Mujahid]: \"Dan janganlah kalian mengikuti jalan-jalan itu, ia menafsirkan: 'Yaitu bid`ah dan syubhat-syubhat' \"."
            },
            {
                "number": 155,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ أَبِيهِ قَالَ كُنَّا نَجْلِسُ عَلَى بَابِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَبْلَ صَلَاةِ الْغَدَاةِ فَإِذَا خَرَجَ مَشَيْنَا مَعَهُ إِلَى الْمَسْجِدِ فَجَاءَنَا أَبُو مُوسَى الْأَشْعَرِيُّ فَقَالَ أَخَرَجَ إِلَيْكُمْ أَبُو عَبْدِ الرَّحْمَنِ بَعْدُ قُلْنَا لَا فَجَلَسَ مَعَنَا حَتَّى خَرَجَ فَلَمَّا خَرَجَ قُمْنَا إِلَيْهِ جَمِيعًا فَقَالَ لَهُ أَبُو مُوسَى يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي رَأَيْتُ فِي الْمَسْجِدِ آنِفًا أَمْرًا أَنْكَرْتُهُ وَلَمْ أَرَ وَالْحَمْدُ لِلَّهِ إِلَّا خَيْرًا قَالَ فَمَا هُوَ فَقَالَ إِنْ عِشْتَ فَسَتَرَاهُ قَالَ رَأَيْتُ فِي الْمَسْجِدِ قَوْمًا حِلَقًا جُلُوسًا يَنْتَظِرُونَ الصَّلَاةَ فِي كُلِّ حَلْقَةٍ رَجُلٌ وَفِي أَيْدِيهِمْ حَصًى فَيَقُولُ كَبِّرُوا مِائَةً فَيُكَبِّرُونَ مِائَةً فَيَقُولُ هَلِّلُوا مِائَةً فَيُهَلِّلُونَ مِائَةً وَيَقُولُ سَبِّحُوا مِائَةً فَيُسَبِّحُونَ مِائَةً قَالَ فَمَاذَا قُلْتَ لَهُمْ قَالَ مَا قُلْتُ لَهُمْ شَيْئًا انْتِظَارَ رَأْيِكَ وَانْتِظَارَ أَمْرِكَ قَالَ أَفَلَا أَمَرْتَهُمْ أَنْ يَعُدُّوا سَيِّئَاتِهِمْ وَضَمِنْتَ لَهُمْ أَنْ لَا يَضِيعَ مِنْ حَسَنَاتِهِمْ ثُمَّ مَضَى وَمَضَيْنَا مَعَهُ حَتَّى أَتَى حَلْقَةً مِنْ تِلْكَ الْحِلَقِ فَوَقَفَ عَلَيْهِمْ فَقَالَ مَا هَذَا الَّذِي أَرَاكُمْ تَصْنَعُونَ قَالُوا يَا أَبَا عَبْدِ الرَّحْمَنِ حَصًى نَعُدُّ بِهِ التَّكْبِيرَ وَالتَّهْلِيلَ وَالتَّسْبِيحَ قَالَ فَعُدُّوا سَيِّئَاتِكُمْ فَأَنَا ضَامِنٌ أَنْ لَا يَضِيعَ مِنْ حَسَنَاتِكُمْ شَيْءٌ وَيْحَكُمْ يَا أُمَّةَ مُحَمَّدٍ مَا أَسْرَعَ هَلَكَتَكُمْ هَؤُلَاءِ صَحَابَةُ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَوَافِرُونَ وَهَذِهِ ثِيَابُهُ لَمْ تَبْلَ وَآنِيَتُهُ لَمْ تُكْسَرْ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّكُمْ لَعَلَى مِلَّةٍ هِيَ أَهْدَى مِنْ مِلَّةِ مُحَمَّدٍ أَوْ مُفْتَتِحُو بَابِ ضَلَالَةٍ قَالُوا وَاللَّهِ يَا أَبَا عَبْدِ الرَّحْمَنِ مَا أَرَدْنَا إِلَّا الْخَيْرَ قَالَ وَكَمْ مِنْ مُرِيدٍ لِلْخَيْرِ لَنْ يُصِيبَهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا أَنَّ قَوْمًا يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ وَايْمُ اللَّهِ مَا أَدْرِي لَعَلَّ أَكْثَرَهُمْ مِنْكُمْ ثُمَّ تَوَلَّى عَنْهُمْ فَقَالَ عَمْرُو بْنُ سَلَمَةَ رَأَيْنَا عَامَّةَ أُولَئِكَ الْحِلَقِ يُطَاعِنُونَا يَوْمَ النَّهْرَوَانِ مَعَ الْخَوَارِجِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah memberitakan kepada kami ['Amr bin Yahya] ia berkata: \"Aku mendengar [ayahku] menceritakan dari [ayahnya], ia berkata: 'Dahulu kami pernah duduk di depan pintu [Abdullah bin Mas'ud] radliallahu 'anhu sebelum sholat subuh, ketika ia keluar kami berjalan bersamanya menuju masjid. Kemudian Abu Musa Al 'Asy'ari radliallahu 'anhu datang menemui kami dan bertanya: 'Apakah Abu Abdur Rahman telah datang menemui kalian? ', kami menjawab: 'belum', lalu beliau duduk bersama kami hingga (Abu Abdur Rahman) datang. Tatkala ia datang, kami semua berdiri dan menghampirinya, Abu Musa berkata kepadanya: 'Wahai Abu Abdur Rahman, baru saja di masjid aku melihat satu kejadian baru yang tidak aku sukai. Setahuku, Alhamdulillah, sekali pun itu diniyati kebaikan. Ia bertanya: 'apakah itu gerangan? ', 'Jika kamu masih hidup kamu akan melihatnya', Kata Abu Musa. Abu Musa melanjutkan: 'Aku melihat di masjid, sekelompok orang yang (duduk) melingkar sambil menunggu sholat, setiap lingkaran ada seorang (pemandu) nya dan tangan-tangan mereka membawa kerikil, lalu si (pemandu) berkata: 'ucapkanlah takbir seratus kali' dan mereka bertakbir seratus kali, 'dan ucapkanlah tahlil seratus kali' lalu mereka bertahlil seratus kali, 'dan ucapkanlah tasbih seratus kali' lalu mereka mengucapkan tasbih seratus kali. Abu Abdurrahman bertanya: 'Lantas apa yang telah kau katakan kepada mereka? ' Abu Musa menjawab: 'Aku belum berkata apa pun kepada mereka, karena aku menunggu pendapatmu atau perintahmu'. Abu Abdurrahman berkata: 'Tidak sebaiknyakah kamu perintahkan saja mereka untuk menghitung dosa-dosa mereka, serta kamu jamin bahwa kebaikan mereka tidak akan hilang?. Kemudian Abu Abdurrahman beranjak dan kami pun beranjak bersamanya, hingga ia sampai di lokasi jama'ah dzikir yang diceritakannya. Ia berdiri di hadapan mereka, dan berkata: 'Apa yang sedang kalian lakukan? ', mereka menjawab: 'Wahai Abu Abdur Rahman, ini adalah batu-batu kerikil untuk menghitung takbir, tahlil dan tasbih'. Ia berkata: 'Hendaklah kalian menghitung dosa-dosa kalian (saja), aku menjamin amal kebaikan kalian tidak akan hilang, celakalah kalian umat Muhammad shallallahu 'alaihi wasallam, alangkah cepatnya masa kehancuran kalian, padahal mereka para sahabat Nabi shallallahu 'alaihi wasallam masih banyak, dan baju mereka belum basah, juga periuknya belum pecah, demi Dzat yang jiwaku berada di genggaman tangannya, sesungguhnya kalian seakan-akan memiliki agama yang lebih baik dari agama yang dibawa oleh Nabi Muhammad shallallahu 'alaihi wasallam, atau kalian sengaja hendak membuka pintu kesesatan?, mereka menjawab: 'Demi Allah wahai Abu Abdur rahman kami tidak menginginkan kecuali kebaikan'. Abu Abdurrahman menjawab: 'Berapa banyak orang yang menginginkan kebaikan tetapi ia tidak dapat mencapainya, sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah menceritakan kepada kami bahwa ada satu kaum yang membaca Al Qur`an namun tidak melampaui tenggorokan mereka, demi Allah, aku tidak tahu siapa tahu mayoritas mereka adalah dari kalian\", Abu Abdurrahman lantas berpaling dari mereka. 'Amr bin Salamah berkata: 'Kami melihat kebanyakan dari yang berada di kelompok jama'ah dzikir tersebut dihari selanjutnya mencaci-maki kami pada hari (perang) Nahrawan bersama orang-orang khawarij ' \". "
            },
            {
                "number": 156,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ حَدَّثَنِي جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ أَفْضَلَ الْهَدْيِ هَدْيُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَشَرَّ الْأُمُورِ مُحْدَثَاتُهَا وَكُلَّ بِدْعَةٍ ضَلَالَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Yahya bin Sulaim] ia berkata: \"Telah menceritakan kepada kami [Ja'far bin Muhammad] dari [ayahnya] dari [Jabir bin Abdullah Al Anshari] radliallahu 'anhu ia berkata: \"Rasulullah subhanallahu wa ta'ala berkhutbah (di depan kami) lalu beliau memuji Allah dan mengagungkanNya, kemudian beliau bersabda: 'Sesungguhnya petunjuk yang terbaik adalah petunjuk Muhammad shallallahu 'alaihi wasallam dan seburuk-buruk perkara adalah hal baru yang diada-adakan dan setiap bid`ah adalah sesat' \"."
            },
            {
                "number": 157,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ الْفَزَارِيِّ عَنْ أَسْلَمَ الْمِنْقَرِيِّ عَنْ بِلَادِ بْنِ عِصْمَةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ يَقُولُ وَكَانَ إِذَا كَانَ عَشِيَّةَ الْخَمِيسِ لِلَيْلَةِ الْجُمُعَةِ قَامَ فَقَالَ إِنَّ أَصْدَقَ الْقَوْلِ قَوْلُ اللَّهِ وَإِنَّ أَحْسَنَ الْهَدْيِ هَدْيُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالشَّقِيُّ مَنْ شَقِيَ فِي بَطْنِ أُمِّهِ وَإِنَّ شَرَّ الرَّوَايَا رَوَايَا الْكَذِبِ وَشَرَّ الْأُمُورِ مُحْدَثَاتُهَا وَكُلَّ مَا هُوَ آتٍ قَرِيبٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Uyainah] dari [Abu Ishak Al Fazari] dari [Aslam Al Minqari] dari [Bilad bin 'Ishmah] ia berkata: \"Aku mendengar [Abdullah bin Mas'ud] radliallahu 'anhu berkata -Dan ini kebiasaan beliau jika hari kamis malam jum'at--: 'Sesungguhnya perkataan yang paling benar adalah perkataan Allah, petunjuk yang paling baik adalah petunjuk Muhammad shallallahu 'alaihi wasallam, kesengsaraan telah ditentukan sejak di rahim ibu, sejelek-jelek periwayatan adalah periwayatan yang bohong, dan seburuk-buruk perkara adalah perkara bid`ah, dan segala yang aku sebutkan ini sudah dekat waktu kedatangannya) \". "
            },
            {
                "number": 158,
                "arab": " أَخْبَرَنِي مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ الْفَزَارِيِّ عَنْ لَيْثٍ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ قَالَ مَا أَخَذَ رَجُلٌ بِبِدْعَةٍ فَرَاجَعَ سُنَّةً",
                "id": "Telah mengabarkan kepadaku [Muhammad bin 'Uyainah] dari [Abu Ishak Al Fazari] dari [Laits] dari [Ayyub] dari [Ibnu Sirin] ia berkata: \"Seseorang yang mengambil bid`ah, tak bakalan kembali kepada sunnah.\" "
            },
            {
                "number": 159,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ أَبُو الْوَلِيدِ الْهَرَوِيُّ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ عَنْ ابْنِ عَوْنٍ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ حَيَّةَ بِنْتِ أَبِي حَيَّةَ قَالَتْ دَخَلَ عَلَيْنَا رَجُلٌ بِالظَّهِيرَةِ فَقُلْتُ يَا عَبْدَ اللَّهِ مِنْ أَيْنَ أَقْبَلْتَ قَالَ أَقْبَلْتُ أَنَا وَصَاحِبٌ لِي فِي بُغَاءٍ لَنَا فَانْطَلَقَ صَاحِبِي يَبْغِي وَدَخَلْتُ أَنَا أَسْتَظِلُّ بِالظِّلِّ وَأَشْرَبُ مِنْ الشَّرَابِ فَقُمْتُ إِلَى لُبَيْنَةٍ حَامِضَةٍ رُبَّمَا قَالَتْ فَقُمْتُ إِلَى ضَيْحَةٍ حَامِضَةٍ فَسَقَيْتُهُ مِنْهَا فَشَرِبَ وَشَرِبْتُ قَالَتْ وَتَوَسَّمْتُهُ فَقُلْتُ يَا عَبْدَ اللَّهِ مَنْ أَنْتَ فَقَالَ أَنَا أَبُو بَكْرٍ قُلْتُ أَنْتَ أَبُو بَكْرٍ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي سَمِعْتُ بِهِ قَالَ نَعَمْ قَالَتْ فَذَكَرْتُ غَزْوَنَا خَثْعَمًا وَغَزْوَةَ بَعْضِنَا بَعْضًا فِي الْجَاهِلِيَّةِ وَمَا جَاءَ اللَّهُ بِهِ مِنْ الْأُلْفَةِ وَأَطْنَابِ الْفَسَاطِيطِ وَشَبَّكَ ابْنُ عَوْنٍ أَصَابِعَهُ وَوَصَفَهُ لَنَا مُعَاذٌ وَشَبَّكَ أَحْمَدُ فَقُلْتُ يَا عَبْدَ اللَّهِ حَتَّى مَتَى تَرَى أَمْرَ النَّاسِ هَذَا قَالَ مَا اسْتَقَامَتْ الْأَئِمَّةُ قُلْتُ مَا الْأَئِمَّةُ قَالَ أَمَا رَأَيْتِ السَّيِّدَ يَكُونُ فِي الْحِوَاءِ فَيَتَّبِعُونَهُ وَيُطِيعُونَهُ فَمَا اسْتَقَامَ أُولَئِكَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah Abu Al Walid Al Harawi] telah menceritakan kepada kami [Mu'adz bin Mu'adz] dari [Ibnu 'Aun] dari ['Amr bin Sa'id] dari [Abu Zur'ah bin 'Amr bin Jarir] dari [Hayyah binti Abu Hayyah] ia berkata: \"Seorang laki-laki datang menemui kami pada siang hari, lalu aku bertanya: 'Wahai hamba Allah, kamu datang dari arah mana?\" Ia menjawab: aku datang bersama sahabatku untuk membereskan keperluan kami, lalu sahabatku pergi untuk satu keperluan, maka aku masuk kesini untuk berteduh dan minum. Lalu aku bangkit mengambil susu yang asam (difermentasi). Mungkin ia berkata dengan redaksi: \"QUMTU ILAA DLAIHATIN HAAMIDLAH\"-Perawi ragu kepastian redaksi kalimatnya-- lalu aku suguhkan dan ia pun meminumnya dan aku juga minum. Ia berkata: \"Dan aku mencoba menyeledikinya, aku bertanya: 'Wahai hamba Allah siapakah kamu gerangan? ', ia menjawab: 'Aku [Abu Bakar] ', aku bertanya lagi: 'kamu Abu Bakar sahabat Rasulullah shallallahu 'alaihi wasallam yang pernah aku dengar? ', ia menjawab: 'Ya, benar'. Hayyah bin Abi Hayyah berkata: 'Kemudian kuceritakan kembali peperangan kami alias perang Khats'am, dan peperangan lainnya yang terjadi diantara kami sewaktu zaman jahiliyah dahulu, dan kemudian Allah datang (untuk memancangkan) tali-tali tenda, dan Abu 'Aun mengaitkan jari-jemarinya satu sama lain, dan Mu'adz memperagakan itu pada kami, dan Ahmad pun mengaitkan juga (jari-jemarinya). Kemudian aku bertanya: 'Wahai hamba Allah (kira-kira) sampai kapan kamu dapat lihat kondisi manusia (yang bagus) seperti ini? ', ia menjawab: 'Selama para pemimpin (mereka) tetap istiqamah. Aku bertanya: 'Lho kenapa kok pemimpin? ' ia menjawab: 'Tidakkah kamu lihat bahwa seorang tuan (pemimpin) itu selalu ditengah-tengah perkumpulan rerumahan, lalu orang-orang mengikuti dan menaatinya, dan itu pun terkadang orang-orang tidak mau istiqamah?\". "
            },
            {
                "number": 160,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ أَخٍ لِعَدِيِّ بْنِ أَرْطَاةَ عَنْ أَبِي الدَّرْدَاءِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخْوَفُ مَا أَخَافُ عَلَيْكُمْ الْأَئِمَّةَ الْمُضِلِّينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin As Shalt] telah menceritakan kepada kami [Ibarahim bin Sa'ad] dari [ayahnya] dari [saudara 'Adi bin `Arthah] dari [Abu Darda`] radliallahu 'anhu ia berkata: rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang paling aku takutkan dari kalian adalah para pemimpin yang menyesatkan\". "
            },
            {
                "number": 161,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ وَاصِلٍ عَنْ امْرَأَةٍ يُقَالُ لَهَا عَائِذَةُ قَالَتْ رَأَيْتُ ابْنَ مَسْعُودٍ يُوصِي الرِّجَالَ وَالنِّسَاءَ وَيَقُولُ مَنْ أَدْرَكَ مِنْكُنَّ مِنْ امْرَأَةٍ أَوْ رَجُلٍ فَالسَّمْتَ الْأَوَّلَ فَإِنَّكُمْ عَلَى الْفِطْرَةِ قَالَ عَبْدُ اللَّهِ السَّمْتُ الطَّرِيقُ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Abdur Rahman bin Mahdi] dari [Sufyan] dari [Washil] dari seorang wanita -yang dikenal (dengan nama) [A`idzah] -, ia berkata: \"Aku pernah melihat [Ibnu Mas'ud] memberi wasiat kepada orang laki-laki dan perempuan, ia berkata: 'Siapa saja dari laki-laki atau perempuan hendaklah ia berpegang pada Assamtu yang pertama, pastilah kita akan berada dalam dijalan fitrah' \". Abdullah mengatakan: \"Yang dimaksud dengan AsSamtu adalah jalan\". "
            },
            {
                "number": 162,
                "arab": " أَخْبَرَنَا مَنْصُورُ بْنُ سَلَمَةَ الْخُزَاعِيُّ عَنْ شَرِيكٍ عَنْ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ قَالَ لَقَدْ أَدْرَكْتُ أَقْوَامًا لَوْ لَمْ يُجَاوِزْ أَحَدُهُمْ ظُفْرًا لَمَا جَاوَزْتُهُ كَفَى إِزْرَاءً عَلَى قَوْمٍ أَنْ تُخَالَفَ أَفْعَالُهُمْ ",
                "id": "Telah mengabarkan kepada kami [Mansur bin Salamah Al Khuza'i] dari [Syarik] dari [Abu Hamzah] dari [Ibrahim] ia berkata: \"Sungguh telah aku dapati beberapa kaum yang sekiranya salah satu dari mereka tidak melampaui seujung kuku, niscaya aku tidak juga akan melampauinya. Cukuplah dianggap menghina suatu kaum jika perbuatan mereka diselisihi\"."
            },
            {
                "number": 163,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ { أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ } قَالَ أُولُو الْعِلْمِ وَالْفِقْهِ وَطَاعَةُ الرَّسُولِ اتِّبَاعُ الْكِتَابِ وَالسُّنَّةِ",
                "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`]: \"`ATHII'ULLAHA WA `ATHII'UR RASUULA WA `ULIL `AMRI MINKUM\" (Dan taatlah kepada Allah dan taatlah kepada Rasul shallallahu 'alaihi wasallam serta taatlah kepada pemimpin diantara kalian) ia berkata: '(Ulul `amri yaitu) yang mempunyai ilmu dan fikih, dan yang dimaksud taat kepada Rasul adalah mengikuti Al Qur`an dan sunnah' \"."
            },
            {
                "number": 164,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَدْهَمَ قَالَ سَأَلْتُ ابْنَ شُبْرُمَةَ عَنْ شَيْءٍ وَكَانَتْ عِنْدِي مَسْأَلَةٌ شَدِيدَةٌ فَقُلْتُ رَحِمَكَ اللَّهُ انْظُرْ فِيهَا قَالَ إِذَا وَضَحَ لِيَ الطَّرِيقُ وَوَجَدْتُ الْأَثَرَ لَمْ أَحْبَسْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibrahim bin Adham] ia berkata: \"Pernah aku bertanya kepada [Ibnu Syubrumah] tentang suatu hal yang ketika itu aku mempunyai masalah yang sangat berat. aku berkata: 'Mohon selidiki permasalahan itu, semoga Allah merahmatimu', ia menjawab: 'Apabila jelas jalan bagiku dan aku telah menemukan atsar, aku tidak akan menyembunyikannya' \". "
            },
            {
                "number": 165,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ الْهَيْثَمِ حَدَّثَنَا عَوْفٌ عَنْ رَجُلٍ يُقَالُ لَهُ سُلَيْمَانُ بْنُ جَابِرٍ مِنْ أَهْلِ هَجَرَ قَالَ قَالَ ابْنُ مَسْعُودٍ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَلَّمُوا الْعِلْمَ وَعَلِّمُوهُ النَّاسَ تَعَلَّمُوا الْفَرَائِضَ وَعَلِّمُوهُ النَّاسَ تَعَلَّمُوا الْقُرْآنَ وَعَلِّمُوهُ النَّاسَ فَإِنِّي امْرُؤٌ مَقْبُوضٌ وَالْعِلْمُ سَيُقْبَضُ وَتَظْهَرُ الْفِتَنُ حَتَّى يَخْتَلِفَ اثْنَانِ فِي فَرِيضَةٍ لَا يَجِدَانِ أَحَدًا يَفْصِلُ بَيْنَهُمَا",
                "id": "Telah mengabarkan kepada kami [Utsman bin Al Haitsam] telah menceritakan kepada kami ['Auf] dari seseorang -ia dikenal dengan sebutan [Sulaiman bin Jabir] dari penduduk Hajar-, ia berkata: \" [Ibnu Mas'ud] pernah berkata: 'Rasulullah shallallahu 'alaihi wasallam pernah bersabda kepadaku: Hendaklah kalian belajar ilmu, dan ajarkanlah kepada manusia, pelajarilah ilmu fara`idl dan ajarkanlah kepada manusia, pelajarilah Al Qur`an dan ajarkanlah kepada manusia, karena aku seorang yang akan dipanggil (wafat), dan ilmu senantiasa akan berkurang sedangkan kekacauan akan muncul hingga ada dua orang yang akan berselisih pendapat tentang (wajib atau tidaknya) suatu kewajiban, dan keduanya tidak mendapatkan orang yang dapat memutuskan antara keduanya\"."
            },
            {
                "number": 166,
                "arab": " أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عُمَرُ بْنُ أَبِي خَلِيفَةَ قَالَ سَمِعْتُ زِيَادَ بْنَ مِخْرَاقٍ ذَكَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ أَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُعَاذَ بْنَ جَبَلٍ وَأَبَا مُوسَى إِلَى الْيَمَنِ قَالَ تَسَانَدَا وَتَطَاوَعَا وَبَشِّرَا وَلَا تُنَفِّرَا فَقَدِمَا الْيَمَنَ فَخَطَبَ النَّاسَ مُعَاذٌ فَحَضَّهُمْ عَلَى الْإِسْلَامِ وَأَمَرَهُمْ بِالتَّفَقُّهِ وَالْقُرْآنِ وَقَالَ إِذَا فَعَلْتُمْ ذَلِكَ فَاسْأَلُونِي أُخْبِرْكُمْ عَنْ أَهْلِ الْجَنَّةِ مِنْ أَهْلِ النَّارِ فَمَكَثُوا مَا شَاءَ اللَّهُ أَنْ يَمْكُثُوا فَقَالُوا لِمُعَاذٍ قَدْ كُنْتَ أَمَرْتَنَا إِذَا نَحْنُ تَفَقَّهْنَا وَقَرَأْنَا أَنْ نَسْأَلَكَ فَتُخْبِرَنَا بِأَهْلِ الْجَنَّةِ مِنْ أَهْلِ النَّارِ فَقَالَ لَهُمْ مُعَاذٌ إِذَا ذُكِرَ الرَّجُلُ بِخَيْرٍ فَهُوَ مِنْ أَهْلِ الْجَنَّةِ وَإِذَا ذُكِرَ بِشَرٍّ فَهُوَ مِنْ أَهْلِ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Umar bin Abu Khalifah] ia berkata: Aku pernah mendengar [Ziyad bin Mikhraq] menyebutkan dari [Abdullah bin Umar] ia berkata: \"Rasulullah shallallahu 'alaihi wasallam mengutus Mu'adz bin Jabal dan Abu Musa radliallahu 'anhuma ke negara Yaman, beliau berkata: 'Hendaknya kalian saling bersandar, dan saling membantu, dan hendaknya kalian berdua memberikan (kepada mereka) kabar gembira dan janganlah kalian berdua membuat (mereka) lari (dari ajaran Islam), kemudian keduanya datang ke Yaman, lalu Mu'adz memberikan khutbah kepada orang-orang, mengajak mereka untuk masuk Islam, dan memerintahkan kepada mereka untuk memperdalam isi Al Qur`an, dan ia juga berkata: 'Jika kalian sudah lakukan itu semua maka tanyalah kepadaku, akan kukabarkan kepada kalian tentang penghuni surga dan penghuni neraka, mereka (para penghuni surga dan neraka) berada di dalamnya tergantung seberapa lama Allah menghendaki, kemudian mereka berkata kepada Mu'adz: 'Sungguh kamu telah memerintahkan kami, jika kami sudah memperdalam Islam dan telah membaca (mempelajari) Al Qur`an agar kami menanyakanmu (tentang penghuni surga dan neraka), maka kabarkanlah kepada kami tentang penghuni surga dan neraka', kemudian Mu'adz berkata kepada mereka: 'Jika seorang dikenal baik, ia penghuni surga, dan jika seorang dikenal jelek, ia penghuni neraka' \"."
            },
            {
                "number": 167,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ هُوَ ابْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ عَنْ عَبْدِ الْوَهَّابِ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُعَاوِيَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abdullah bin Usamah bin Al Had] dari [Abdul Wahab] dari [Ibnu Syihab] dari [Humaid bin Abdur Rahman] dari [Mu'awiyah] radliallahu 'anhu ia berkata: \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa yang Allah inginkan menjadi orang baik, Allah jadikan dirinya paham agama\"."
            },
            {
                "number": 168,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ إِسْمَعِيلَ بْنِ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Sulaiman] dari [Isma'il bin Ja'far] dari [Abdullah bin Sa'id bin Abu Hindun] dari [ayahnya] dari [Ibnu Abbas] radliallahu 'anhu ia berkata: \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa yang Allah inginkan menjadi baik, Allah jadikan dirinya paham agama' \"."
            },
            {
                "number": 169,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ الزَّهْرَانِيُّ أَخْبَرَنَا إِسْمَعِيلُ هُوَ ابْنُ جَعْفَرٍ حَدَّثَنَا عَمْرُو بْنُ أَبِي عَمْرٍو عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحُوَيْرِثِ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ أَنَّهُ شَهِدَ خُطْبَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ عَرَفَةَ فِي حَجَّةِ الْوَدَاعِ أَيُّهَا النَّاسُ إِنِّي وَاللَّهِ لَا أَدْرِي لَعَلِّي لَا أَلْقَاكُمْ بَعْدَ يَوْمِي هَذَا بِمَكَانِي هَذَا فَرَحِمَ اللَّهُ مَنْ سَمِعَ مَقَالَتِي الْيَوْمَ فَوَعَاهَا فَرُبَّ حَامِلِ فِقْهٍ وَلَا فِقْهَ لَهُ وَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ وَاعْلَمُوا أَنَّ أَمْوَالَكُمْ وَدِمَاءَكُمْ حَرَامٌ عَلَيْكُمْ كَحُرْمَةِ هَذَا الْيَوْمِ فِي هَذَا الشَّهْرِ فِي هَذَا الْبَلَدِ وَاعْلَمُوا أَنَّ الْقُلُوبَ لَا تُغِلُّ عَلَى ثَلَاثٍ إِخْلَاصِ الْعَمَلِ لِلَّهِ وَمُنَاصَحَةِ أُولِي الْأَمْرِ وَعَلَى لُزُومِ جَمَاعَةِ الْمُسْلِمِينَ فَإِنَّ دَعْوَتَهُمْ تُحِيطُ مِنْ وَرَائِهِمْ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud Az Zahrani] telah mengabarkan kepada kami [Isma'il Ibnu Ja'far], telah menceritakan kepada kami ['Amr bin Abu 'Amr] dari [Abdur Rahman bin Al Huwairits] dari [Muhammad bin Jubair bin Muth'im] dari [ayahnya] Bahwasanya ia menghadiri hutbah Rasulullah shallallahu 'alaihi wasallam pada hari Arafah ketika haji wada', beliau bersabda: \"Wahai sekalian manusia, demi Allah, aku tidak tahu mungkin aku tidak akan bertemu kalian lagi setelah hari ini, dan di tempat ini, Allah akan merahmati orang yang mendengarkan perkataanku serta mau menjaganya, mungkin saja ada seorang yang membawa ilmu fikih tetapi ia tidak punya pemahaman, dan mungkin saja ada orang yang menyampaikan ilmu fikih kepada orang yang lebih memahaminya. Ketauhilah bahwa harta-harta, dan darah-darah kalian terjaga kehormatannya atas kalian, sebagaimana kehormatan hari, bulan dan tanah ini. Dan ketahuilah, bahwa hati seorang muslim tidak akan dengki dengan tiga hal: ikhlas dalam beramal hanya untuk Allah, saling memberi nasehat dengan para pemimpin, dan senantiasa berada dalam barisan orang-orang muslim. Karena doa mereka akan menjaga dari belakang kalian\". "
            },
            {
                "number": 170,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْخَيْفِ مِنْ مِنًى فَقَالَ نَضَّرَ اللَّهُ عَبْدًا سَمِعَ مَقَالَتِي فَوَعَاهَا ثُمَّ أَدَّاهَا إِلَى مَنْ لَمْ يَسْمَعْهَا فَرُبَّ حَامِلِ فِقْهٍ لَا فِقْهَ لَهُ وَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ ثَلَاثٌ لَا يُغِلُّ عَلَيْهِنَّ قَلْبُ الْمُؤْمِنِ إِخْلَاصُ الْعَمَلِ لِلَّهِ وَطَاعَةُ ذَوِي الْأَمْرِ وَلُزُومُ الْجَمَاعَةِ فَإِنَّ دَعْوَتَهُمْ تَكُونُ مِنْ وَرَائِهِمْ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Khalid] telah menceritakan kepada kami [Muhammad Ibnu Ishak], dari [Az Zuhri] dari [Muhammad bin Jubair bin Muth'im] dari [ayahnya] ia berkata: \"Rasulullah shallallahu 'alaihi wasallam berdiri di (masjid) khaif di Mina seraya bersabda: 'Semoga Allah memperbagus rupa seseorang yang mendengarkan perkataanku lantas menjaganya, kemudian menyampaikannya kepada orang yang tidak mendengarnya (dariku), berapa banyak orang yang membawa ilmu fikih tetapi ia tidak punya pemahaman, dan berapa banyak ada orang yang menyampaikan ilmu fikih kepada orang yang lebih memahaminya, ada tiga hal yang hati seorang mu`min tidak hasad padanya: ikhlas beramal hanya untuk Allah, taat kepada para pemimpin, dan senantiasa berada dalam barisan kaum muslimin, karena doa mereka menyokong dari belakang mereka\". "
            },
            {
                "number": 171,
                "arab": " أَخْبَرَنَا عِصْمَةُ بْنُ الْفَضْلِ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ عَنْ شُعْبَةَ عَنْ عُمَرَ بْنِ سُلَيْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبَانَ بْنِ عُثْمَانَ عَنْ أَبِيهِ قَالَ خَرَجَ زَيْدُ بْنُ ثَابِتٍ مِنْ عِنْدِ مَرْوَانَ بْنِ الْحَكَمِ بِنِصْفِ النَّهَارِ قَالَ فَقُلْتُ مَا خَرَجَ هَذِهِ السَّاعَةَ مِنْ عِنْدِ مَرْوَانَ إِلَّا وَقَدْ سَأَلَهُ عَنْ شَيْءٍ فَأَتَيْتُهُ فَسَأَلْتُهُ فَقَالَ نَعَمْ سَأَلَنِي عَنْ حَدِيثٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَضَّرَ اللَّهُ امْرَأً سَمِعَ مِنَّا حَدِيثًا فَحَفِظَهُ فَأَدَّاهُ إِلَى مَنْ هُوَ أَحْفَظُ مِنْهُ فَرُبَّ حَامِلِ فِقْهٍ لَيْسَ بِفَقِيهٍ وَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ لَا يَعْتَقِدُ قَلْبُ مُسْلِمٍ عَلَى ثَلَاثِ خِصَالٍ إِلَّا دَخَلَ الْجَنَّةَ قَالَ قُلْتُ مَا هُنَّ قَالَ إِخْلَاصُ الْعَمَلِ لِلَّهِ وَالنَّصِيحَةُ لِوُلَاةِ الْأَمْرِ وَلُزُومُ الْجَمَاعَةِ فَإِنَّ دَعْوَتَهُمْ تُحِيطُ مِنْ وَرَائِهِمْ وَمَنْ كَانَتْ الْآخِرَةُ نِيَّتَهُ جَعَلَ اللَّهُ غِنَاهُ فِي قَلْبِهِ وَجَمَعَ لَهُ شَمْلَهُ وَأَتَتْهُ الدُّنْيَا وَهِيَ رَاغِمَةٌ وَمَنْ كَانَتْ الدُّنْيَا نِيَّتَهُ فَرَّقَ اللَّهُ عَلَيْهِ شَمْلَهُ وَجَعَلَ فَقْرَهُ بَيْنَ عَيْنَيْهِ وَلَمْ يَأْتِهِ مِنْ الدُّنْيَا إِلَّا مَا قُدِّرَ لَهُ قَالَ وَسَأَلْتُهُ عَنْ صَلَاةِ الْوُسْطَى قَالَ هِيَ الظُّهْرُ",
                "id": "Telah mengabarkan kepada kami ['Ishmah bin Al fadl] telah menceritakan kepada kami [Harami bin 'Umarah] dari [Syu'bah] dari [Umar bin Sulaiman] dari [Abdur Rahman bin `Abaan bin Utsman] dari [ayahnya] ia berkata: \"Di pertengahan hari [Zaid bin Tsabit] keluar (setelah menemui) Marwan bin Hakam, -perawi berkata: aku berkata: 'Dia (Zaid bin Tsabit) tidak akan keluar dari tempat Marwan pada waktu seperti ini kecuali ia telah menanyakan kepadanya tentang sesuatu (yang penting) ', lalu aku menemuinya dan bertanya kepadanya, ia pun menjawab: 'Ya, benar ia (Marwan) Telah menanyakan kepadaku tentang satu hadis yang aku dengar dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: 'Semoga Allah membaguskan rupa seseorang yang mendengarkan hadis dari kami lalu ia menjaganya (menghafalnya) dan menyampaikannya kepada orang yang lebih hafal darinya, berapa banyak orang yang membawa ilmu fikih tetapi ia bukan ahli fikih, dan mungkin saja ada orang yang menyampaikan ilmu fikih kepada orang yang lebih paham (tentang fikih), Tidaklah (hati) seorang muslim meyakini tiga hal ini melainkan ia akan masuk ke surga, aku bertanya: 'Apa saja itu? ', beliau menjawab: 'Ikhlas dalam beramal hanya untuk Allah, memberi nasehat kepada para pemimpin, dan senantiasa bersama dengan jama`ah (kaum muslimin), karena doa mereka akan menyokong mereka dari belakang. Dan barang siapa yang akhirat sebagai tujuannya, Allah memberinya rasa cukup dalam hatinya, dan Ia akan mengumpulkan dunia untuknya, serta dunia akan mendatanginya dengan keinginan yang sangat besar. Sebaliknya barang siapa yang dunia menjadi tujuannya, Allah akan memisahkan apa yang dikumpulkannya dari dirinya, dan menjadikan kefakiran ada di depan kedua matanya (sangat dekat dengannya), dan dunia tidak menghampirinya kecuali bagian yang telah ditetapkan untuknya. Ia (perawi) ' berkata: 'lalu aku bertanya tentang sholat wushtha? ', ia (Zaid bin Tsabit) menjawab: 'Itu sholat zhuhur' \"."
            },
            {
                "number": 172,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Isa] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang berbohong dengan sengaja atas namaku, hendaknya ia persiapkan tempat duduknya dari api neraka\"."
            },
            {
                "number": 173,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْأَعْلَى عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Isa] telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul A'laa] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang berbohong dengan sengaja atas namaku, hendaknya ia persiapkan tempat duduknya dari api neraka\"."
            },
            {
                "number": 174,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عُرْوَةَ عَنْ عَبْدِ اللَّهِ بْنِ عُرْوَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ الزُّبَيْرِ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ حَدَّثَ عَنِّي كَذِبًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yazid bin Abdullah] dari ['Amr bin Abdullah bin 'Urwah] dari [Abdullah bin 'Urwah] dari [Abdullah bin Az Zubair] dari [Az Zubair] bahwasanya ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang menyampaikan satu hadis dariku, padahal dia berbohong, hendaklah ia persiapkan tempat duduknya dari api neraka\"."
            },
            {
                "number": 175,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنِي الصَّبَّاحُ بْنُ مُحَارِبٍ عَنْ عُمَرَ بْنِ عَبْدِ اللَّهِ بْنِ يَعْلَى بْنِ مُرَّةَ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] telah menceritakan kepadaku [As Shabbah bin Muharib] dari [Umar bin Abdullah bin Ya'laa bin Murrah] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang berbohong dengan sengaja atas namaku, hendaklah ia persiapkan tempat duduknya dari api neraka\"."
            },
            {
                "number": 176,
                "arab": " أَخْبَرَنَا أَسَدُ بْنُ مُوسَى حَدَّثَنَا شُعْبَةُ عَنْ عَتَّابٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ لَوْلَا أَنِّي أَخْشَى أَنْ أُخْطِئَ لَحَدَّثْتُكُمْ بِأَشْيَاءَ سَمِعْتُهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَاكَ أَنِّي سَمِعْتُهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Asad bin Musa] telah menceritakan kepada kami [Syu'bah] dari ['Attab] ia berkata: \"Aku pernah mendengar [Anas bin Malik] radliallahu 'anhu berkata: ' Kalau aku tidak hawatir akan salah, sungguh akan aku ceritakan banyak hal yang aku dengar dari Rasulullah shallallahu 'alaihi wasallam (atau yang Rasulullah shallallahu 'alaihi wasallam sabdakan), hal itu karena aku pernah mendengar beliau bersabda: 'Barang siapa yang berdusta atas namaku dengan sengaja, hendaklah ia siapkan tempat duduknya dari api neraka' \"."
            },
            {
                "number": 177,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ أَخْبَرَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ عَنْ عَبْدِ الْعَزِيزِ وَعَنْ حَمَّادِ بْنِ أَبِي سُلَيْمَانَ وَعَنْ التَّيْمِيِّ وَعَنْ عَتَّابٍ مَوْلَى ابْنِ هُرْمُزَ سَمِعُوا أَنَسَ بْنَ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah] telah mengabarkan kepada kami [Abu Daud] dari [Syu'bah] dari [Abdul Aziz], dan dari [Hammad bin Abu Sulaiman] dari [At taimi] dari ['Attab] -bekas budak Ibnu Hurmuz-, mereka telah mendengar [Anas bin Malik] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang berbohong atasku dengan sengaja, hendaknya ia siapkan tempat duduknya dari api neraka\"."
            },
            {
                "number": 178,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَقَ عَنْ مَعْبَدِ بْنِ كَعْبٍ عَنْ أَبِي قَتَادَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ يَا أَيُّهَا النَّاسُ إِيَّاكُمْ وَكَثْرَةَ الْحَدِيثِ عَنِّي فَمَنْ قَالَ عَلَيَّ فَلَا يَقُلْ إِلَّا حَقًّا أَوْ إِلَّا صِدْقًا وَمَنْ قَالَ عَلَيَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Khalid] telah menceritakan kepada kami [Muhammad Ibnu Ishak], dari [Ma'bad bin Ka'ab] dari [Abu Qatadah] ia berkata: 'Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda dari atas mimbar: 'Wahai manusia sekalian, hendaklah kalian berhati-hati terhadap berlebihan menyampaikan hadis dariku, karena barang siapa berkata atas namaku, maka ia tidak boleh berkata kecuali yang benar dan jujur, dan barang siapa yang berkata dengan sengaja atas namaku apa yang tidak pernah aku katakan, hendaknya ia siapkan tempat duduknya dari api neraka' \"."
            },
            {
                "number": 179,
                "arab": " أَخْبَرَنَا هَارُونُ بْنُ مُعَاوِيَةَ عَنْ إِبْرَاهِيمَ بْنِ سُلَيْمَانَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ مُحَمَّدِ بْنِ بِشْرٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Harun bin Mu'awiyah] dari [Ibrahim bin Sulaiman] dari ['Ashim Al Ahwal] dari [Muhammad bin Bisyr] dari [Anas] radliallahu 'anhu ia berkata: \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barang siapa yang berbohong dengan sengaja atas namaku, hendaknya ia siapkan tempat duduknya dari api neraka' \". "
            },
            {
                "number": 180,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَا يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنْ النَّاسِ وَلَكِنْ قَبْضُ الْعِلْمِ قَبْضُ الْعُلَمَاءِ فَإِذَا لَمْ يُبْقِ عَالِمًا اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالًا فَسُئِلُوا فَأَفْتَوْا بِغَيْرِ عِلْمٍ فَضَلُّوا وَأَضَلُّوا",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Hisyam] dari [ayahnya] dari [Abdullah bin 'Amr] ia berkata: \"Rasulullah shallahu 'alaihi wa sallam bersabda: 'Allah tidak akan mencabut ilmu dari manusia secara langsung, akan tetapi dicabutnya ilmu itu dengan diwafatkannya para ulama`, sehingga ketika tidak tersisa seorang ulama` pun, manusia akan menjadikan orang-orang yang bodoh sebagai pemimpin, lalu mereka ditanya dan mereka berfatwa tanpa dasar ilmu, mereka itu sesat dan menyesatkan' \"."
            },
            {
                "number": 181,
                "arab": " أَخْبَرَنَا مُوسَى بْنُ خَالِدٍ أَخْبَرَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ الْحَجَّاجِ عَنْ عَوْفِ بْنِ مَالِكٍ عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي أُمَامَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ خُذُوا الْعِلْمَ قَبْلَ أَنْ يَذْهَبَ قَالُوا وَكَيْفَ يَذْهَبُ الْعِلْمُ يَا نَبِيَّ اللَّهِ وَفِينَا كِتَابُ اللَّهِ قَالَ فَغَضِبَ لَا يُغْضِبُهُ اللَّهُ ثُمَّ قَالَ ثَكِلَتْكُمْ أُمَّهَاتُكُمْ أَوَلَمْ تَكُنِ التَّوْرَاةُ وَالْإِنْجِيلُ فِي بَنِي إِسْرَائِيلَ فَلَمْ يُغْنِيَا عَنْهُمْ شَيْئًا إِنَّ ذَهَابَ الْعِلْمِ أَنْ يَذْهَبَ حَمَلَتُهُ إِنَّ ذَهَابَ الْعِلْمِ أَنْ يَذْهَبَ حَمَلَتُهُ",
                "id": "Telah mengabarkan kepada kami [Musa bin Khalid] telah mengabarkan kepada kami [Mu'tamir bin Sulaiman] dari [Al Hajjaj] dari ['Auf bin Malik] dari [Al Qasim Abu Abdur Rahman] -bekas budak Abdur Rahman bin Yazid-, dari [Abu Umamah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Ambilah ilmu sebelum ia hilang', mereka bertanya: 'Bagaimana ilmu bisa hilang wahai Nabi Allah, sedang Al Qur`an masih berada bersama kami? ', perawi berkata: 'lalu beliau marah', seraya berkata: 'TSAKILATKUM UMMAHATUKUM, Bukankah Taurat dan Injil ada bersama Bani Isra`il tetapi keduanya tidak memberikan manfaat bagi mereka? ', sesungguhnya hilangnya ilmu itu dengan wafatnya para pemegangnya, sesungguhnya hilangnya ilmu itu dengan wafatnya para pemegangnya' \". "
            },
            {
                "number": 182,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ حَدَّثَنَا هِلَالٌ هُوَ ابْنُ خَبَّابٍ قَالَ سَأَلْتُ سَعِيدَ بْنَ جُبَيْرٍ قُلْتُ يَا أَبَا عَبْدِ اللَّهِ مَا عَلَامَةُ هَلَاكِ النَّاسِ قَالَ إِذَا هَلَكَ عُلَمَاؤُهُمْ",
                "id": "Telah mengabarkan kepada kami [Abu An Anu'man] telah menceritakan kepada kami [Tsabit bin Yazid] telah menceritakan kepada kami [Hilal Ibnu Khabbab], ia berkata: \"Aku pernah bertanya kepada [Sa'id bin Jubair]: Wahai Abu Abdullah, apa saja tanda kehancuran manusia?, lalu ia menjawab: 'Jika ulama` mereka telah rusak' \". "
            },
            {
                "number": 183,
                "arab": " أَخْبَرَنَا مَالِكُ بْنُ إِسْمَعِيلَ حَدَّثَنَا مَسْعُودُ بْنُ سَعْدٍ الْجُعْفِيُّ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَبْدِ اللَّهِ بْنِ رُبَيِّعَةَ عَنْ سَلْمَانَ قَالَ لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا بَقِيَ الْأَوَّلُ حَتَّى يَتَعَلَّمَ أَوْ يُعَلِّمَ الْآخِرَ فَإِنْ هَلَكَ الْأَوَّلُ قَبْلَ أَنْ يُعَلِّمَ أَوْ يَتَعَلَّمَ الْآخِرُ هَلَكَ النَّاسُ",
                "id": "Telah mengabarkan kepada kami [Malik bin Isma'il] telah menceritakan kepada kami [Mas'ud bin Sa'ad Al Ju'fi] dari ['Atha` bin As Sa`ib] dari [Abdullah bin Rabi'ah] dari [Salman] ia berkata: \"Manusia akan tetap dalam keadaan baik-baik saja, selama ada generasi awal hingga ia belajar atau mengajar generasi yang selanjutnya, apabila generasi awal tiada sebelum ia belajar atau mengajar generasi selanjutnya maka manusia akan hancur lebur\". "
            },
            {
                "number": 184,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا أَبُو كُدَيْنَةَ عَنْ قَابُوسَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ هَلْ تَدْرُونَ مَا ذَهَابُ الْعِلْمِ قُلْنَا لَا قَالَ ذَهَابُ الْعُلَمَاءِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin As Shalt] telah menceritakan kepada kami [Abu Kudainah] dari [Qabus] dari [ayahnya] dari [Ibnu Abbas] radliallau 'anhu ia berkata: \"Apakah kalian tahu apa yang dimaksud dengan hilangnya ilmu itu?, kami menjawab: '(kami) tidak tahu', ia berkata: 'Meninggalnya para ulama`' \". "
            },
            {
                "number": 185,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ عَنْ مَنْصُورِ بْنِ أَبِي الْأَسْوَدِ عَنْ حُصَيْنٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ أَبِي الدَّرْدَاءِ قَالَ مَا لِي أَرَى عُلَمَاءَكُمْ يَذْهَبُونَ وَجُهَّالَكُمْ لَا يَتَعَلَّمُونَ فَتَعَلَّمُوا قَبْلَ أَنْ يُرْفَعَ الْعِلْمُ فَإِنَّ رَفْعَ الْعِلْمِ ذَهَابُ الْعُلَمَاءِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin As Shalt] dari [Mansur bin Abu Al `Aswad] dari [Hushain] dari [Salim bin Abu Al Ja'd] dari [Abu Darda`] radliallahu 'anhu ia berkata: \" Mengapa aku melihat para ulama` kalian wafat sedang orang-orang bodoh diantara kalian tidak (mau) belajar?, hendaklah kalian belajar sebelum ilmu itu diangkat, karena pengangkatan ilmu itu dengan kepergian (wafat) -nya para ulama`\". "
            },
            {
                "number": 186,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ أَسَدٍ أَبُو عَاصِمٍ حَدَّثَنَا عَبْثَرٌ عَنْ بُرْدٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ أَبِي الدَّرْدَاءِ قَالَ النَّاسُ عَالِمٌ وَمُتَعَلِّمٌ وَلَا خَيْرَ فِيمَا بَعْدَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Asad Abu 'Ashim] telah menceritakan kepada kami ['Abtsar] dari [Burd] dari [Sulaiman bin Musa] dari [Abu Darda`] radliallahu 'anhu ia berkata: \"Manusia itu (terbagi menjadi dua) golongan, yang berilmu serta pelajar (pemburu ilmu), sungguh tidak ada kebaikan pada golongan yang ketiga\"."
            },
            {
                "number": 187,
                "arab": " أَخْبَرَنَا قَبِيصَةُ أَخْبَرَنَا سُفْيَانُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ اغْدُ عَالِمًا أَوْ مُتَعَلِّمًا أَوْ مُسْتَمِعًا وَلَا تَكُنِ الرَّابِعَ فَتَهْلِكَ",
                "id": "Telah mengabarkan kepada kami [Qabishah] telah mengabarkan kepada kami [Sufyan] dari ['Atha` bin As Sa`ib] dari [Al Hasan] dari [Abdullah bin mas'ud] radliallahu 'anhu ia berkata: \"Siapkanlah diri kamu (untuk menjadi) seorang ulama`, seorang pelajar, atau seorang pendengar setia, dan janganlah kamu menjadi (bagian) dari yang keempat, niscaya kamu akan celaka\"."
            },
            {
                "number": 188,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا خَالِدٌ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَبْدِ اللَّهِ بْنِ رُبَيِّعَةَ قَالَ قَالَ سَلْمَانُ لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا بَقِيَ الْأَوَّلُ حَتَّى يَتَعَلَّمَ الْآخِرُ فَإِذَا هَلَكَ الْأَوَّلُ قَبْلَ أَنْ يَتَعَلَّمَ الْآخِرُ هَلَكَ النَّاسُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Khalid] dari ['Atha` bin As Sa`ib] dari [Abdullah bin Rabi'ah] ia berkata: \" [Salman] berkata: 'Manusia akan tetap dalam keadaan baik-baik saja selama masih ada generasi awal, hingga generasi berikutnya belajar (darinya), jika generasi awal telah hilang sebelum generasi akhir belajar, hancurlah manusia\"."
            },
            {
                "number": 189,
                "arab": " أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ وَعُثْمَانُ بْنُ عُمَرَ قَالَا أَخْبَرَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ الْأَحْنَفِ قَالَ قَالَ عُمَرُ تَفَقَّهُوا قَبْلَ أَنْ تُسَوَّدُوا",
                "id": "Telah mengabarkan kepada kami [Wahab bin Jarir] dan [Utsman bin Umar] keduanya berkata: \"telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] dari [Al Ahnaf] ia berkata: \" [Umar] telah berkata: 'Hendaklah kalian belajar sebelum kalian tidak bisa berbuat apa-apa\"."
            },
            {
                "number": 190,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ أَخْبَرَنَا بَقِيَّةُ حَدَّثَنَا صَدَقَةُ بْنُ عَبْدِ اللَّهِ أَنَّ الْمُهَاصِرَ بْنَ حَبِيبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ تَعَالَى إِنِّي لَسْتُ كُلَّ كَلَامِ الْحَكِيمِ أَتَقَبَّلُ وَلَكِنِّي أَتَقَبَّلُ هَمَّهُ وَهَوَاهُ فَإِنْ كَانَ هَمُّهُ وَهَوَاهُ فِي طَاعَتِي جَعَلْتُ صَمْتَهُ حَمْدًا لِي وَوَقَارًا وَإِنْ لَمْ يَتَكَلَّمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mubarak] telah mengabarkan kepada kami [Baqiyyah] telah menceritakan kepada kami [Shadaqah bin Abdullah] Bahwasanya [Al Muhashir bin Habib] telah berkata: \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Allah berfirman': 'Tidak semua perkataan orang yang bijak Aku terima, tetapi Aku hanya menerima berdasarkan niat dan keinginannya, jika niat dan keinginannya semata dalam ketaatan kepada-Ku, maka Aku jadikan diamnya itu sebagai pujian, meski ia tidak sedang memuji' \". "
            },
            {
                "number": 191,
                "arab": " أَخْبَرَنَا مَخْلَدُ بْنُ مَالِكٍ عَنْ حَجَّاجِ بْنِ مُحَمَّدٍ عَنْ لَيْثِ بْنِ سَعْدٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ أَبِي الزَّاهِرِيَّةِ يَرْفَعُ الْحَدِيثَ إِنَّ اللَّهَ تَعَالَى قَالَ أَبُثُّ الْعِلْمَ فِي آخِرِ الزَّمَانِ حَتَّى يَعْلَمَهُ الرَّجُلُ وَالْمَرْأَةُ وَالْعَبْدُ وَالْحُرُّ وَالصَّغِيرُ وَالْكَبِيرُ فَإِذَا فَعَلْتُ ذَلِكَ بِهِمْ أَخَذْتُهُمْ بِحَقِّي عَلَيْهِمْ",
                "id": "Telah mengabarkan kepada kami [Makhlad bin Malik] dari [Hajjaj bin Muhammad] dari [Laits bin sa'ad] dari [Mu'awiyah bin Shalih] dari [Abu Az Zahiriyyah] ia telah memarfu'kan hadis ini: \" Allah telah berfirman: 'Aku tebarkan ilmu pada akhir zaman, sehingga laki-laki, wanita, budak, orang merdeka, anak kecil, serta orang dewasa mengetahuinya, jika Aku telah lakukan hal itu, niscaya Aku akan mengambil hakKu dari mereka' \"."
            },
            {
                "number": 192,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ عَوْنٍ عَنْ إِبْرَاهِيمَ بْنِ عِيسَى قَالَ قَالَ ابْنُ مَسْعُودٍ لَا تَعَلَّمُوا الْعِلْمَ لِثَلَاثٍ لِتُمَارُوا بِهِ السُّفَهَاءَ وَتُجَادِلُوا بِهِ الْعُلَمَاءَ وَلِتَصْرِفُوا بِهِ وُجُوهَ النَّاسِ إِلَيْكُمْ وَابْتَغُوا بِقَوْلِكُمْ مَا عِنْدَ اللَّهِ فَإِنَّهُ يَدُومُ وَيَبْقَى وَيَنْفَدُ مَا سِوَاهُ",
                "id": "Telah mengabarkan kepada kammi [Ya'la] telah menceritakan kepada kami [Muhammad bin 'Aun] dari [Ibrahim bin isa] ia berkata: \" [Ibnu Mas'ud] telah berkata: 'Janganlah kalian mencari ilmu untuk tiga hal: Untuk menghina orang bodoh, mendebat para ulama`, serta untuk mencari perhatian orang-orang. Dan carilah dengan perkataan kalian apa yang ada di sisi Allah, sebab hal itu terus berlanjut dan tersisa, serta menepis selainnya' \"."
            },
            {
                "number": 193,
                "arab": " وَبِهَذَا الْإِسْنَادِ قَالَ كُونُوا يَنَابِيعَ الْعِلْمِ مَصَابِيحَ الْهُدَى أَحْلَاسَ الْبُيُوتِ سُرُجَ اللَّيْلِ جُدُدَ الْقُلُوبِ خُلْقَانَ الثِّيَابِ تُعْرَفُونَ فِي أَهْلِ السَّمَاءِ وَتَخْفَوْنَ عَلَى أَهْلِ الْأَرْضِ_",
                "id": "Dan dengan sanad ini (sama dengan hadits sebelumnya), ia ([Ibnu Mas'ud]) berkata: \"Jadilah kalian sumber pengetahuan, lentera petunjuk yang selalu menerangi rumah, cahaya malam hari, hatinya senantiasa suci, berbaju apa adanya, (sehingga) kalian dikenal oleh penghuni langit, dan tidak dikenal oleh penghuni bumi\". "
            },
            {
                "number": 194,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُمَارَةَ بْنِ حَزْمٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَطْلُبُ هَذَا الْعِلْمَ أَحَدٌ لَا يُرِيدُ بِهِ إِلَّا الدُّنْيَا إِلَّا حَرَّمَ اللَّهُ عَلَيْهِ عَرْفَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah mengabarkan kepaada kami [Abu Ashim] telah menceritakan kepada kami [Muhammad bin Umarah bin Hazm] telah menceritakan kepada kami [Abdullah bin Abdur Rahman] ia berkata; \"Rasulullah salallahu 'alaihi wa sallam bersabda; 'Tidaklah seseorang menuntut ilmu ini dan ia tidak menghendaki kecuali dunia, melainkan Allah mengharamkan aroma surga baginya\"."
            },
            {
                "number": 195,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا عُمَرُ بْنُ مَزْيَدٍ عَنْ أَوْفَى بْنِ دَلْهَمٍ أَنَّهُ بَلَغَهُ عَنْ عَلِيٍّ قَالَ تَعَلَّمُوا الْعِلْمَ تُعْرَفُوا بِهِ وَاعْمَلُوا بِهِ تَكُونُوا مِنْ أَهْلِهِ فَإِنَّهُ سَيَأْتِي بَعْدَ هَذَا زَمَانٌ لَا يَعْرِفُ فِيهِ تِسْعَةُ عُشَرَائِهِمْ الْمَعْرُوفَ وَلَا يَنْجُو مِنْهُ إِلَّا كُلُّ نُوَمَةٍ فَأُولَئِكَ أَئِمَّةُ الْهُدَى وَمَصَابِيحُ الْعِلْمِ لَيْسُوا بِالْمَسَايِيحِ وَلَا الْمَذَايِيعِ الْبُذْرِ قَالَ أَبُو مُحَمَّد نُوَمَةٌ غَافِلٌ عَنْ الشَّرِّ الْمَذَايِيعُ الْبُذْرِ كَثِيرُ الْكَلَامِ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Umar] menceritakan kepada kami [Umar bin Yazid] dari [Aufa bin Dahlan], bahwasanya telah [disampaikan kabar] dari [Ali] radliallahu 'anhu ia berkata; \" Pelajarilah ilmu, kamu akan mengenalnya, dan amalkanlah ilmu kalian, kalian menjadi ahlinya. Akan datang satu jaman yang ketika itu sembilan persepuluh kebaikan sudah tidak dikenali lagi. Tidak ada yang selamat kecuali sekelompok kecil. Mereka adalah para pemimpin yang tercerahkan dan menjadi cahaya ilmu, mereka bukanlah orang yang selalu berbuat buruk dan mengadu domba, dan mereka juga bukan orang yang hanya pandai bicara \"."
            },
            {
                "number": 196,
                "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ يَزِيدَ بْنِ جَابِرٍ قَالَ قَالَ مُعَاذُ بْنُ جَبَلٍ اعْمَلُوا مَا شِئْتُمْ بَعْدَ أَنْ تَعْلَمُوا فَلَنْ يَأْجُرَكُمْ اللَّهُ بِالْعِلْمِ حَتَّى تَعْمَلُوا",
                "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Sa'id bin Abdul Aziz] dari [Yazid bin Jabir] ia berkata; \" [Muadz bin Jabal] berkata; 'Kerjakanlah sesuatu semaksimalkemampuan kalian setelah kalian mempelajari ilmu. Kalian tidak diberikan ganjaran oleh Allah atas ilmu kalian hingga kalian mengamalkannya' \". "
            },
            {
                "number": 197,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبَانَ عَنْ ابْنِ الْقَاسِمِ بْنِ قَيْسٍ حَدَّثَنِي يُونُسُ بْنُ سَيْفٍ الْحِمْصِيُّ قَالَ حَدَّثَنِي أَبُو كَبْشَةَ السَّلُولِيُّ قَالَ سَمِعْتُ أَبَا الدَّرْدَاءِ يَقُولُ إِنَّ مِنْ أَشَرِّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ عَالِمًا لَا يَنْتَفِعُ بِعِلْمِهِ",
                "id": "Telah mengabarkan kepada kami [Ismail bin Aban] dari [Ibnu Al Qasim bin Qois] ia berkata: Telah menceritakan kepadaku [Yunus bin Saif Al Himshi] ia berkata: Telah menceritakan kepadaku [Abu Kabsyah As Saluli] ia berkata: \" Aku pernah mendengar [Abu Darda] ` radliallahu 'anhu berkata: 'Orang terjelek tempatnya di sisi Allah pada hari kiamat adalah seorang yang memiki ilmu, namun ia tidak mengamalkannya\". "
            },
            {
                "number": 198,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو قُدَامَةَ عَنْ مَالِكِ بْنِ دِينَارٍ قَالَ قَالَ أَبُو الدَّرْدَاءِ مَنْ يَزْدَدْ عِلْمًا يَزْدَدْ وَجَعًا وَقَالَ أَبُو الدَّرْدَاءِ مَا أَخَافُ عَلَى نَفْسِي أَنْ يُقَالَ لِي مَا عَلِمْتَ وَلَكِنْ أَخَافُ أَنْ يُقَالَ لِي مَاذَا عَمِلْتَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Abu Qudamah] dari [Malik bin Dinar] ia berkata: \" [Abu Darda] ` radliallahu 'anhu pernah berkata: 'Barang siapa yang bertambah ilmunya, bertambah pula bebannya. Dan Abu Darda` radliallahu 'anhu berkata: 'Aku tidak takut akan pernyataan atasku: Apa yang telah kamu ketahui? Namun yang aku takutkan adalah pernyataan atasku: Apa yang telah kamu kerjakan?\". "
            },
            {
                "number": 199,
                "arab": " أَخْبَرَنَا هَارُونُ بْنُ مُعَاوِيَةَ عَنْ حَفْصِ بْنِ غِيَاثٍ قَالَ سَمِعْتُ ابْنَ جُرَيْجٍ يَذْكُرُ عَمَّنْ حَدَّثَهُ عَنْ ابْنِ عَبَّاسٍ قَالَ تَدَارُسُ الْعِلْمِ سَاعَةً مِنْ اللَّيْلِ خَيْرٌ مِنْ إِحْيَائِهَا و قَالَ أَبُو هُرَيْرَةَ إِنِّي لَأُجَزِّئُ اللَّيْلَ ثَلَاثَةَ أَجْزَاءٍ فَثُلُثٌ أَنَامُ وَثُلُثٌ أَقُومُ وَثُلُثٌ أَتَذَكَّرُ أَحَادِيثَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menghabarka kepada kami [Harun bin Mu'awiyah] dari [Hafsh bin Ghiats] ia berkata: Aku telah mendengar [Ibnu Juraij] menerangkan apa yang telah [diceritakan padanya] dari [Ibnu Abbas] radliallahu 'anhu ia berkata: \" Mempelajari ilmu dalam satu malam lebih baik dibandingkan dengan menghidupkannya (Memperbanyak ibadah) \". [Abu Hurairah] radliallahu 'anhu pernah berkata: \"Sungguh aku membagi malamku menjadi tiga bagian, sepertiga waktu malam untuk tidur, sepertiga untuk beribadah, dan sepertiga lagi untuk mempelajari hadis Rasulullah salallhu 'alaihi wa sallam \". "
            },
            {
                "number": 200,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ حَدَّثَنَا عَاصِمٌ قَالَ سَأَلْتُ الشَّعْبِيَّ عَنْ حَدِيثٍ فَحَدَّثَنِيهِ فَقُلْتُ إِنَّهُ يُرْفَعُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا عَلَى مَنْ دُونَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ إِلَيْنَا فَإِنْ كَانَ فِيهِ زِيَادَةٌ أَوْ نُقْصَانٌ كَانَ عَلَى مَنْ دُونَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Tsabit bin Yazid] telah menceritakan kepada kami ['Ashim] ia berkata: \"Aku bertanya kepada [As Sya'bi] tentang satu hadis lalu ia menceritakannya kepadaku, aku bertanya kepadanya: \"(Apakah hadis itu dihukumi marfu' kepada Nabi sallallahu 'alai wa sallam? ia menjawab: \"Tidak, yang tidak marfu' kepada Nabi sallallahu 'alai wa sallam lebih aku sukai, maka jika ada penambahan atau pengurangan hal itu bukan dari Nabi sallallahu 'alaihi wa sallam\". "
            },
            {
                "number": 201,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ عِيسَى حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي هَاشِمٍ عَنْ إِبْرَاهِيمَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ فَقِيلَ لَهُ أَمَا تَحْفَظُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا غَيْرَ هَذَا قَالَ بَلَى وَلَكِنْ أَقُولُ قَالَ عَبْدُ اللَّهِ قَالَ عَلْقَمَةُ أَحَبُّ إِلَيَّ",
                "id": "Telah mengabarkan kepada kami [Ishak bin Isa] telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu Hasym] dari [Ibrahim] ia berkat: \"Rasulullah sallallhu 'alai wa sallam melarang muhaaqalah dan muzaabanah 'Kemudian ada seseorang bertanya kepadanya: 'Tidaklah anda menyimpan hadis lain dari Rasululah sallallhu 'alai wa sallam? Ia menjawab: ' Ya ada, tetapi aku lebih suka mengutip: ' Abdullah berkata: 'Al Qamah berkata' 'Suatu hal yang paling kusukai.....\". "
            },
            {
                "number": 202,
                "arab": " أَخْبَرَنَا أَسَدُ بْنُ مُوسَى حَدَّثَنَا مُعَاوِيَةُ عَنْ رَبِيعَةَ بْنِ يَزِيدَ قَالَ كَانَ أَبُو الدَّرْدَاءِ إِذَا حَدَّثَ حَدِيثًا قَالَ اللَّهُمَّ إِلَّا هَكَذَا أَوْ كَشَكْلِهِ",
                "id": "Telah mengabarkan kepada kami [`Asad bin Musa] telah menceritakan kepada kami [Mu'awiyah] dari [Rabi'ah bin Yazid] ia berkata: \" [Abu Darda`] apabila menceritakan hadis dari Rasulullah sallallahu 'alaihi wa sallam ia berkata: 'Ya Allah semoga yang seperti demikian atau yang seperti redaksinya' \"."
            },
            {
                "number": 203,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا ابْنُ عَوْنٍ عَنْ مُسْلِمٍ أَبِي عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَ كُنْتُ لَا تَفُوتُنِي عَشِيَّةُ خَمِيسٍ إِلَّا آتِي فِيهَا عَبْدَ اللَّهِ بْنَ مَسْعُودٍ فَمَا سَمِعْتُهُ يَقُولُ لِشَيْءٍ قَطُّ قَالَ رَسُولُ اللَّهِ حَتَّى كَانَتْ ذَاتَ عَشِيَّةٍ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَاغْرَوْرَقَتَا عَيْنَاهُ وَانْتَفَخَتْ أَوْدَاجُهُ فَأَنَا رَأَيْتُهُ مَحْلُولَةً أَزْرَارُهُ وَقَالَ أَوْ مِثْلُهُ أَوْ نَحْوُهُ أَوْ شَبِيهٌ بِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Ibnu 'Aun] dari [Muslim Abu Abdullah] dari [Ibrahim At Taimi] dari [ayahnya] dari ['Amr bin Maimun] ia berkata: \"Aku tidak pernah luput pada setiap kamis sore melainkan selalu mengunjungi [Abdullah bin Mas'ud] radliallahu 'anhu, aku tidak pernah mendengarnya ia mengatakan dengan redaksi \"Rasulullah sallallahu 'alaihi wa sallam bersabda\", hingga pada satu sore ia berkata: 'Rasulullah sallalllahu 'alaihi wa sallam bersabda' maka kedua matanya berlinang air mata, dan keluarlah otot lehernya, aku pun melihatnya kancing celananya terlepas. Lantas Ia berkata: 'Atau semisalnya, menyerupainya, atau yang sepadan dengannya' \". "
            },
            {
                "number": 204,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا أَشْعَثُ عَنْ الشَّعْبِيِّ وَابْنِ سِيرِينَ أَنَّ ابْنَ مَسْعُودٍ كَانَ إِذَا حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْأَيَّامِ تَرَبَّدَ وَجْهُهُ وَقَالَ هَكَذَا أَوْ نَحْوَهُ هَكَذَا أَوْ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepadakami [Asy'ats] dari [As Sya'bi] dan [Ibnu Sirin]: \" [Ibnu Mas'ud] radliallahu 'anhu apabila menceritakan hadis dari Rasulullah sallallahu 'alaihi wa sallam beberapa hari, maka berubahlah rona wajahnya, setelah itu ia berkata: 'Seperti ini atau yang menyerupainya, seperti ini atau yang menyerupainya\"."
            },
            {
                "number": 205,
                "arab": " أَخْبَرَنَا أَسَدُ بْنُ مُوسَى حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ عَنْ الشَّعْبِيِّ قَالَ جَالَسْتُ ابْنَ عُمَرَ سَنَةً فَلَمْ أَسْمَعْهُ يَذْكُرُ حَدِيثًا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [`Asad bin Musa] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abdullah bin Abu As Safar] dari [As Sya'bi] ia berkata: \"Aku bergaul bersama [Ibnu Umar] radliallahu 'anhu selama satu tahun, maka aku tidak pernah mendengar ia menyebutkan satu haditspun dari Rasulullah sallallahu 'alaihi wa sallam\". "
            },
            {
                "number": 206,
                "arab": " أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا أَبُو بَكْرٍ عَنْ أَبِي حَصِينٍ عَنْ الشَّعْبِيِّ عَنْ ثَابِتِ بْنِ قُطْبَةَ الْأَنْصَارِيِّ قَالَ كَانَ عَبْدُ اللَّهِ يُحَدِّثُنَا فِي الشَّهْرِ بِالْحَدِيثَيْنِ أَوْ الثَّلَاثَةِ",
                "id": "Telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Abu Bakar] dari [Abu Hashin] dari [As Sya'bi] dari [Tsabit bin Quthbah Al Anshari] ia berkata: \" [Abdullah] dalam satu bulan hanya menyampaikan dua atau tiga hadis Nabi sallallahu 'alaihi wa sallam kepada kami\"."
            },
            {
                "number": 207,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ كَانَ أَنَسٌ قَلِيلَ الْحَدِيثِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ إِذَا حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَوْ كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] ia berkata: telah menceritakan kepada kami [Hammad bin Zaid] dari [Ibnu 'Aun] dari [Muhammad] ia berkata: \" [Anas] radliallahu 'anhu (termasuk) orang yang sedikit menyampaikan hadis dari Rasulullah sallallahu 'alaihi wa sallam, dan jika ia menceritakan hadis dari Rasulullah sallallahu 'alaihi wa sallam ia (selalu) berkata: 'Atau seperti yang dikatakan Rasulullah sallallahu 'alaihi wa sallam' \". "
            },
            {
                "number": 208,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ قَالَ كَانَ أَنَسٌ إِذَا حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا قَالَ أَوْ كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Muhammad] ia berkata: \" [Anas] radliallahu 'anhu apabila menceritakan hadis dari Rasulullah sallallahu 'alaihi wa sallam ia (selalu) berkata: 'Atau seperti yang dikatakan Rasulullah sallallahu 'alaihi wa sallam\"."
            },
            {
                "number": 209,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ حَدَّثَنِي السَّائِبُ بْنُ يَزِيدَ قَالَ خَرَجْتُ مَعَ سَعْدٍ إِلَى مَكَّةَ فَمَا سَمِعْتُهُ يُحَدِّثُ حَدِيثًا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى رَجَعْنَا إِلَى الْمَدِينَةِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] ia berkata: telah menceritakan kepadaku [As Sa`ib bin Yazid] ia berkata: \"Aku pergi ke Makkah bersama [Sa'ad], maka aku tidak pernah mendengarnya bercerita tentang hadis dari Rasulullah sallallahu 'alaihi wa sallam hingga kami kembali ke Madinah\"."
            },
            {
                "number": 210,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي مُعَاوِيَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ جُبْيَرِ بْنِ نُفَيْرٍ عَنْ أَبِي الدَّرْدَاءِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَخَصَ بِبَصَرِهِ إِلَى السَّمَاءِ ثُمَّ قَالَ هَذَا أَوَانُ يُخْتَلَسُ الْعِلْمُ مِنْ النَّاسِ حَتَّى لَا يَقْدِرُوا مِنْهُ عَلَى شَيْءٍ فَقَالَ زِيَادُ بْنُ لَبِيدٍ الْأَنْصَارِيُّ يَا رَسُولَ اللَّهِ وَكَيْفَ يُخْتَلَسُ مِنَّا وَقَدْ قَرَأْنَا الْقُرْآنَ فَوَاللَّهِ لَنَقْرَأَنَّهُ وَلَنُقْرِئَنَّهُ نِسَاءَنَا وَأَبْنَاءَنَا فَقَالَ ثَكِلَتْكَ أُمُّكَ يَا زِيَادُ إِنْ كُنْتُ لَأَعُدُّكَ مِنْ فُقَهَاءِ أَهْلِ الْمَدِينَةِ هَذِهِ التَّوْرَاةُ وَالْإِنْجِيلُ عِنْدَ الْيَهُودِ وَالنَّصَارَى فَمَاذَا يُغْنِي عَنْهُمْ قَالَ جُبَيْرٌ فَلَقِيتُ عُبَادَةَ بْنَ الصَّامِتِ قَالَ قُلْتُ أَلَا تَسْمَعُ مَا يَقُولُ أَخُوكَ أَبُو الدَّرْدَاءِ فَأَخْبَرْتُهُ بِالَّذِي قَالَ قَالَ صَدَقَ أَبُو الدَّرْدَاءِ إِنْ شِئْتَ لَأُحَدِّثَنَّكَ بِأَوَّلِ عِلْمٍ يُرْفَعُ مِنْ النَّاسِ الْخُشُوعُ يُوشِكُ أَنْ تَدْخُلَ مَسْجِدَ الْجَمَاعَةِ فَلَا تَرَى فِيهِ رَجُلًا خَاشِعًا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepada kami [Mu'awiyah] dari [Abdur Rahman bin Jubair bin nufair] dari ayahnya - [Jubair bin Nufair] -, dari [Abu Darda`] radliallahu 'anhu ia berkata: \"Dahulu kami bersama Rasulullah sallallahu 'alaihi wa sallam, beliau menengadahkan pandangannya ke langit, kemudian bersabda: 'Sekarang adalah waktu ilmu terampas dari (genggaman) manusia, hingga mereka tidak menghargainya sedikit pun', lalu Ziyad bin Labid Al Anshari radliallahu 'anhu bertanya: 'Wahai Rasulullah sallallahu 'alaihi wa sallam, bagaimana ilmu itu bisa terampas dari kami sedang kami (selalu) membaca Al Qur`an?, demi Allah kami akan selalu membacanya dan mengajarkannya kepada isteri-isteri dan anak-anak kami. kemudian beliau berkata: 'Celaka wahai Ziyad, aku telah menganggapmu sebagai ahli fikih bagi penduduk kota Madinah, (bukankah) Taurat dan Injil masih berada di (tangan) orang-orang Yahudi dan Nasrani, dan hal itu tidakkah bisa mencerahkan mereka? ', Jubair berkata: 'kemudian aku bertemu dengan ['Ubadah bin As Shamit] radliallahu 'anhu, aku bertanya: 'apakah kamu pernah mendengar apa yang telah dikatakan saudaramu Abu Darda` radliallahu 'anhu? '. Lalu aku kabarkan kepadanya apa yang telah dikatakannya, ia berkata: 'Abu Darda` radliallahu 'anhu benar, jika kamu berkehendak maka aku akan menceritakan kepadamu tentang ilmu pertama yang dicabut dari manusia, yaitu kekhusyu'an, hingga hampir-hampir kamu masuk ke masjid dan kamu tidak dapati di sana orang yang khusyu' ' \"."
            },
            {
                "number": 211,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ أَسَدٍ أَبُو عَاصِمٍ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ عَنْ سُفْيَانَ عَنْ لَيْثٍ عَنْ رَجُلٍ عَنْ ابْنِ عُمَرَ قَالَ لَا يَكُونُ الرَّجُلُ عَالِمًا حَتَّى لَا يَحْسُدَ مَنْ فَوْقَهُ وَلَا يَحْقِرَ مَنْ دُونَهُ وَلَا يَبْتَغِيَ بِعِلْمِهِ ثَمَنًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin `Asad Abu 'Ashim] telah menceritakan kepada kami [Yahya bin Yaman] dari [Sufyan] dari [Laits] dari [seseorang] dari [Ibnu Umar] radliallahu 'anhu ia berkata: \"Seseorang tidak menjadi seorang ulama sampai ia tidak hasad (dengki) terhadap orang yang (keilmuannya) di atasnya, dan tidak meremehkan orang yang (keilmuannya) di bawahnya, serta tidak mengharap upah dari ilmunya\"."
            },
            {
                "number": 212,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ أَبِي أُسَامَةَ عَنْ مِسْعَرٍ قَالَ سَمِعْتُ عَبْدَ الْأَعْلَى التَّيْمِيَّ يَقُولُ مَنْ أُوتِيَ مِنْ الْعِلْمِ مَا لَا يُبْكِيهِ لَخَلِيقٌ أَنْ لَا يَكُونَ أُوتِيَ عِلْمًا يَنْفَعُهُ لِأَنَّ اللَّهَ تَعَالَى نَعَتَ الْعُلَمَاءَ ثُمَّ قَرَأَ الْقُرْآنَ { إِنَّ الَّذِينَ أُوتُوا الْعِلْمَ إِلَى قَوْلِهِ يَبْكُونَ }",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Sulaiman] dari [Abu Usamah] dari [Mis'ar] ia berkata: \"Aku pernah mendengar [Abdul A'la At Taimi] berkata: 'Barangsiapa yang dianugerahi ilmu dan ilmunya tidak membuatnya menangis kepada Allah, berarti ia mendapatkan ilmu yang tidak bermanfaat, karena Allah mensifati para ulama, kemudian ia membaca Al Qur`an: INNALLADZIINA UUTUL 'ILMA\" (sesungguhnya orang-orang yang dianugerahi ilmu) sampai firmanNya: \"YABKUUN\" (mereka selalu menangis) -Qs. Al Isra`: 107-108-' \"."
            },
            {
                "number": 213,
                "arab": " أَخْبَرَنَا عِصْمَةُ بْنُ الْفَضْلِ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ عَنْ مُبَارَكِ بْنِ فَضَالَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ الْعُمَرِيِّ عَنْ أَبِي حَازِمٍ قَالَ لَا تَكُونُ عَالِمًا حَتَّى يَكُونَ فِيكَ ثَلَاثُ خِصَالٍ لَا تَبْغِي عَلَى مَنْ فَوْقَكَ وَلَا تَحْقِرُ مَنْ دُونَكَ وَلَا تَأْخُذُ عَلَى عِلْمِكَ دُنْيَا",
                "id": "Telah mengabarkan kepada kami ['Ishmah bin Al Fadlel] telah menceritakan kepada kami [Zaid bin Hubab] dari [Mubarak bin Fadlalah] dari [ubaidhullah bin Umar Al 'Umari] dari [Abu Hazim] ia berkata: \"Kamu tidak akan menjadi seorang ulama hingga ada tiga hal dalam dirimu: Kamu tidak dengki terhadap orang yang (keilmuannya) di atasmu, dan kamu tidak meremehkan orang yang (keilmuannya) ada di bawah kamu, serta kamu tidak mengambil (mencari) dunia dengan ilmu kamu\"."
            },
            {
                "number": 214,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا الْمُبَارَكُ بْنُ سَعِيدٍ عَنْ أَخِيهِ سُفْيَانَ الثَّوْرِيِّ عَنْ عِمْرَانَ الْمِنْقَرِيِّ قَالَ قُلْتُ لِلْحَسَنِ يَوْمًا فِي شَيْءٍ قَالَهُ يَا أَبَا سَعِيدٍ لَيْسَ هَكَذَا يَقُولُ الْفُقَهَاءُ فَقَالَ وَيْحَكَ وَرَأَيْتَ أَنْتَ فَقِيهًا قَطُّ إِنَّمَا الْفَقِيهُ الزَّاهِدُ فِي الدُّنْيَا الرَّاغِبُ فِي الْآخِرَةِ الْبَصِيرُ بِأَمْرِ دِينِهِ الْمُدَاوِمُ عَلَى عِبَادَةِ رَبِّهِ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin 'Arafah] telah menceritakan kepada kami [Al Mubarak bin Sa'id] dari saudaranya - [Sufyan Al Tsauri] -, dari [Imran Al Minqari] ia berkata: \"Pada satu hari aku pernah bertanya kepada Al hasan tentang sesuatu, ia terus berkomentar: 'Wahai Abu Sa'id, bukan demikian yang telah disampaikan oleh para ahli fikih?, maka [Alhasan] menjawab: 'Celaka kamu, kamu telah menganggap dirimu seorang ahli fikih, hanyasanya seorang ahli fikih adalah ia yang bersikap zuhud dari (gemerlapnya) dunia dan cinta akan akhirat, yang berilmu dalam permasalahan agamanya, serta selalu (menjaga) ibadahnya kepada Tuhannya' \"."
            },
            {
                "number": 215,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا النَّضْرُ بْنُ إِسْمَعِيلَ الْبَجَلِيُّ عَنْ مِسْعَرٍ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ قِيلَ لَهُ مَنْ أَفْقَهُ أَهْلِ الْمَدِينَةِ قَالَ أَتْقَاهُمْ لِرَبِّهِ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin 'Arafah] telah menceritakan kepada kami [An Nadlr bin Ismail Al Bajali] dari [Mis'ar] dari [Sa'ad bin Ibrahim] ia berkata: \"ia ditanya: 'Siapakah orang yang paling menguasai ilmu fikih dari penduduk Madinah? ', ia menjawab: 'yaitu orang yang paling bertaqwa kepada Tuhannya' \"."
            },
            {
                "number": 216,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ عَنْ مُجَاهِدٍ قَالَ إِنَّمَا الْفَقِيهُ مَنْ يَخَافُ اللَّهَ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin 'Arafah] telah menceritakan kepada kami [Al Husain bin Ali] dari [Laits bin Abu Sulaim] dari [Mujahid] ia berkata: \"Seorang ahli fikih hanyalah yang takut kepada Allah\"."
            },
            {
                "number": 217,
                "arab": " حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ لَيْثٍ عَنْ يَحْيَى بْنِ عَبَّادٍ قَالَ قَالَ عَلِيٌّ الْفَقِيهُ حَقُّ الْفَقِيهِ الَّذِي لَا يُقَنِّطُ النَّاسَ مِنْ رَحْمَةِ اللَّهِ وَلَا يُؤَمِّنُهُمْ مِنْ عَذَابِ اللَّهِ وَلَا يُرَخِّصُ لَهُمْ فِي مَعَاصِي اللَّهِ إِنَّهُ لَا خَيْرَ فِي عِبَادَةٍ لَا عِلْمَ فِيهَا وَلَا خَيْرَ فِي عِلْمٍ لَا فَهْمَ فِيهِ وَلَا خَيْرَ فِي قِرَاءَةٍ لَا تَدَبُّرَ فِيهَا",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin 'Arafah] telah menceritakan kepada kami [Ismail bin Ibrahim] dari [Laits] dari [Yahya bin 'Abbad] ia berkata: \" [Ali] radliallahu 'anhu telah berkata: 'Seorang yang benar-benar ahli fikih adalah orang yang tidak membuat manusia putus asa dari rahmat Allah, jangan membuat mereka merasa aman dari adzab Allah dan jangan memberikan mereka kemudahan hingga akhirnya terjatuh ke dalam perbuatan maksiat. Sesungguhnya tidak ada kebaikan dalam ibadah yang dilakukan tanpa dasar ilmu, tidak ada kebaikan dalam ilmu tanpa pemahaman dan tidak ada kebaikan dalam membaca Al qur`an tanpa merenungi maknanya' \"."
            },
            {
                "number": 218,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَزِيدَ بْنِ حَازِمٍ حَدَّثَنِي عَمِّي جَرِيرُ بْنُ زَيْدٍ أَنَّهُ سَمِعَ تُبَيْعًا يُحَدِّثُ عَنْ كَعْبٍ قَالَ إِنِّي لَأَجِدُ نَعْتَ قَوْمٍ يَتَعَلَّمُونَ لِغَيْرِ الْعَمَلِ وَيَتَفَقَّهُونَ لِغَيْرِ الْعِبَادَةِ وَيَطْلُبُونَ الدُّنْيَا بِعَمَلِ الْآخِرَةِ وَيَلْبَسُونَ جُلُودَ الضَّأْنِ وَقُلُوبُهُمْ أَمَرُّ مِنْ الصَّبْرِ فَبِي يَغْتَرُّونَ أَوْ إِيَّايَ يُخَادِعُونَ فَحَلَفْتُ بِي لَأُتِيحَنَّ لَهُمْ فِتْنَةً تَتْرُكُ الْحَلِيمَ فِيهَا حَيْرَانَ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yazid bin Hazim] ia berkata: telah menceritakan kepadaku pamanku - [Jarir bin Zaid] -: ia mendengar [Tubai'] menceritakan dari [Ka'ab] ia berkata: \"Telah kudapatkan sifat satu kaum, mereka belajar bukan untuk diamalkan, mereka perdalam fikih bukan untuk beribadah, serta mereka jadikan amal akhirat untuk mendapatkan dunia, mereka mengenakan kulit domba, hati mereka lebih pahit dari pada buah yang paling pahit, mereka menipuku, aku bersumpah, aku akan menguji mereka dengan satu ujian, yang menjadikan mereka kebingungan\". "
            },
            {
                "number": 219,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ الْعَمِّيُّ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ هَرِمِ بْنِ حَيَّانَ أَنَّهُ قَالَ إِيَّاكُمْ وَالْعَالِمَ الْفَاسِقَ فَبَلَغَ عُمَرَ بْنَ الْخَطَّابِ فَكَتَبَ إِلَيْهِ وَأَشْفَقَ مِنْهَا مَا الْعَالِمُ الْفَاسِقُ قَالَ فَكَتَبَ إِلَيْهِ هَرِمٌ يَا أَمِيرَ الْمُؤْمِنِينَ وَاللَّهِ مَا أَرَدْتُ بِهِ إِلَّا الْخَيْرَ يَكُونُ إِمَامٌ يَتَكَلَّمُ بِالْعِلْمِ وَيَعْمَلُ بِالْفِسْقِ فَيُشَبِّهُ عَلَى النَّاسِ فَيَضِلُّوا",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Abdul Aziz bin Abdus shamad Al 'Ammi] telah menceritakan kepada kami [Abu Imran Al Jauni] dari [Haram bin Hayyan], ia berkata: \"Hendaklah kalian berhati-hati terhadap ulama fasik. Pernyataan ini sampai ke telinga Umar bin Al Khatthab radliallahu 'anhu, kontan ia langsung menulis surat kepada Haram bin Hayyan, dengan setengah mengingatkan, [Umar] bertanya: 'Apa yang kamu maksud seorang ulama yang fasik? ', Haram membalas surat dengan mengatakan: 'Wahai amirul mu`minin, aku tidak menginginkan dengan hal itu kecuali kebaikan semata, yang kumaksud mereka berbicara dengan ilmu tetapi beramal dengan kefasikan, (sikapnya yang demikian membuat) bias di depan manusia, hingga mereka menjadi sesat' \"."
            },
            {
                "number": 220,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ قَالَ قَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِذَا رَأَيْتَ قَوْمًا يُنْتِجُونَ بِأَمْرٍ دُونَ عَامَّتِهِمْ فَهُمْ عَلَى تَأْسِيسِ الضَّلَالَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Al 'Auza'i] ia berkata: \" [Umar bin Abdul Aziz] pernah berkata: 'Jika kamu melihat satu kaum yang mengurai masalah (untuk kepentingan diri mereka sendiri) tanpa mempedulikan kebanyakan orang, mereka berada dalam pondasi kesesatan\"."
            },
            {
                "number": 221,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ إِسْحَقَ عَنْ ابْنِ الْمُبَارَكِ عَنْ الْأَوْزَاعِيِّ قَالَ قَالَ إِبْلِيسُ لِأَوْلِيَائِهِ مِنْ أَيِّ شَيْءٍ تَأْتُونَ بَنِي آدَمَ فَقَالُوا مِنْ كُلِّ شَيْءٍ قَالَ فَهَلْ تَأْتُونَهُمْ مِنْ قِبَلِ الِاسْتِغْفَارِ قَالُوا هَيْهَاتَ ذَاكَ شَيْءٌ قُرِنَ بِالتَّوْحِيدِ قَالَ لَأَبُثَّنَّ فِيهِمْ شَيْئًا لَا يَسْتَغْفِرُونَ اللَّهَ مِنْهُ قَالَ فَبَثَّ فِيهِمْ الْأَهْوَاءَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ishak] dari [Ibnu Al Mubarak] dari [Al 'Auza'i] ia berkata: \"Iblis berkata kepada pengikutnya, Dari sisi mana saja kalian datang (menggoda) manusia?, mereka menjawab: 'dari segala arah', ia bertanya lagi: 'Apakah kalian akan datang (menggoda) mereka dari arah istighfar? ', mereka menjawab: 'tidak mungkin, karena hal itu sangat berkaitan dengan tauhid, ia berkata: 'Aku akan sebarkan sesuatu diantara mereka hingga mereka tidak beristighfar kepada Allah. Dia (Al 'Auza'i) berkata: 'Lalu iblis menyebarkan (keinginan mengikuti) hawa nafsu kepada mereka' \". "
            },
            {
                "number": 222,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ إِسْحَقَ عَنْ الْمُحَارِبِيِّ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ قَالَ مَا أَدْرِي أَيُّ النِّعْمَتَيْنِ عَلَيَّ أَعْظَمُ أَنْ هَدَانِي لِلْإِسْلَامِ أَوْ عَافَانِي مِنْ هَذِهِ الْأَهْوَاءِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ishak] dari [Al Muharibi] dari [Al A'masy] dari [Mujahid], ia berkata: Aku tidak tahu diantara dua nikmat yang aku terima, manakah yang lebih besar, Allah memberiku hidayah dengan Islam atau Allah menjagaku dari rongrongan hawa nafsu\"."
            },
            {
                "number": 223,
                "arab": " أَخْبَرَنَا مُوسَى بْنُ خَالِدٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ الْأَعْوَرِ عَنْ حَبَّةَ بْنِ جُوَيْنٍ قَالَ سَمِعْتُ عَلِيًّا أَوْ قَالَ قَالَ عَلِيٌّ لَوْ أَنَّ رَجُلًا صَامَ الدَّهْرَ كُلَّهُ وَقَامَ الدَّهْرَ كُلَّهُ ثُمَّ قُتِلَ بَيْنَ الرُّكْنِ وَالْمَقَامِ لَحَشَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ مَعَ مَنْ يُرَى أَنَّهُ كَانَ عَلَى هُدًى",
                "id": "Telah mengabarkan kepada kami [Musa bin khalid] telah menceritakan kepada kami [Isa bin Yunus] dari [Al A'masy] dari [Muslim Al A'war] dari [Habbah bin Juwain] ia berkata: Aku pernah mendengar [Ali], -atau ia berkata: Ali telah berkata: - 'Kalau seseorang puasa setahun penuh, dan sholat malam setahun penuh, kemudian ia terbunuh diantara rukun yamani dan maqam Ibrahim, niscaya Allah mengumpulkannya dihari kiamat bersama siapa saja yang memandangnya bahwa dia berada di jalan hidayah\"."
            },
            {
                "number": 224,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ عَنْ هَارُونَ هُوَ ابْنُ الْمُغِيرَةِ عَنْ شُعَيْبٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي صَادِقٍ قَالَ قَالَ سَلْمَانُ لَوْ وَضَعَ رَجُلٌ رَأْسَهُ عَلَى الْحَجَرِ الْأَسْوَدِ فَصَامَ النَّهَارَ وَقَامَ اللَّيْلَ لَبَعَثَهُ اللَّهُ يَوْمَ الْقِيَامَةِ مَعَ هَوَاهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] dari [Harun Ibnu Al Mughirah] dari [Syu'aib] dari [Salamah bin Kuhail] dari [Abu Shadiq] ia berkata: [Salman] berkata: \"Sekiranya seseorang meletakkan kepalanya pada hajar aswad, berpuasa pada siang hari, dan sholat pada malam hari, Allah membangkitkannya pada hari kiamat bersama keinginannya \"."
            },
            {
                "number": 225,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا مَنْصُورٌ هُوَ ابْنُ أَبِي الْأَسْوَدِ عَنْ الْحَارِثِ بْنِ حَصِيرَةَ عَنْ أَبِي صَادِقٍ الْأَزْدِيِّ عَنْ رَبِيعَةَ بْنِ نَاجِذٍ قَالَ قَالَ عَلِيٌّ كُونُوا فِي النَّاسِ كَالنَّحْلَةِ فِي الطَّيْرِ إِنَّهُ لَيْسَ مِنْ الطَّيْرِ شَيْءٌ إِلَّا وَهُوَ يَسْتَضْعِفُهَا وَلَوْ يَعْلَمُ الطَّيْرُ مَا فِي أَجْوَافِهَا مِنْ الْبَرَكَةِ لَمْ يَفْعَلُوا ذَلِكَ بِهَا خَالِطُوا النَّاسَ بِأَلْسِنَتِكُمْ وَأَجْسَادِكُمْ وَزَايِلُوهُمْ بِأَعْمَالِكُمْ وَقُلُوبِكُمْ فَإِنَّ لِلْمَرْءِ مَا اكْتَسَبَ وَهُوَ يَوْمَ الْقِيَامَةِ مَعَ مَنْ أَحَبَّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin As Shalt] telah m, enceritakan kepada kami [Mansur Ibnu Abu Al Aswad], dari [Al Harits bin Hashirah] dari [Abu Shadiq Al `Azdi] dari [Rabi'ah bin Najid] ia berkata: \" [Ali] radliallahu 'anhu berkata: 'Jadilah kalian semua diantara manusia seperti lebah yang berada dalam perut burung. Sesungguhnya tidak ada satu jenis burung pun kecuali akan melemahkan apa yang ada dalam perutnya. Padahal jika burung itu tahu apa yang ada dalam perutnya mendatangkan keberkahan, ia tidak akan bersikap demikian. Hendaklah kalian bergaul dengan manusia dengan lisan (ucapan) dan anggota badan (perilaku). Tetapi buatlah perbedaan dari mereka dengan amal dan hati kalian. Sesungguhnya setiap orang akan mendapatkan balasan sesuai apa yang dilakukannya, dan di hari kiamat nanti seorang akan dibangkitkan bersama orang yang dicintaintya\"."
            },
            {
                "number": 226,
                "arab": " أَخْبَرَنَا الْوَلِيدُ بْنُ شُجَاعٍ حَدَّثَنِي بَقِيَّةُ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ قَالَ نِعْمَ وَزِيرُ الْعِلْمِ الرَّأْيُ الْحَسَنُ",
                "id": "Telah mengabarkan kepada kami [Al Walid bin Syuja'] ia berkata: \"Telah menceritakan kepadaku [Baqiyyah] dari [Al 'Auza'i] dari [Az Zuhri] ia berkata: \"Sebaik-baik pembantu orang yang alim adalah pemikiran yang baik\"."
            },
            {
                "number": 227,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا زَائِدَةُ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ قَالَ كَفَى بِالْمَرْءِ عِلْمًا أَنْ يَخْشَى اللَّهَ وَكَفَى بِالْمَرْءِ جَهْلًا أَنْ يُعْجَبَ بِعِلْمِهِ قَالَ و قَالَ مَسْرُوقٌ الْمَرْءُ حَقِيقٌ أَنْ يَكُونَ لَهُ مَجَالِسُ يَخْلُو فِيهَا فَيَذْكُرُ ذُنُوبَهُ فَيَسْتَغْفِرُ اللَّهَ تَعَالَى مِنْهَا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Zaidah] dari [Al A'masy] dari [Muslim] dari [Masruq] ia berkata: \"Cukuplah seseorang dianggap berilmu jika ia takut kepada Allah, dan cukuplah seseorang dianggap bodoh jika ia bangga dengan ilmunya, perawi berkata: Masruq berkata: 'Hendaknya seseorang memiliki tempat khusus yang ia pergunakan untuk menyendiri dan mengingat dosanya, kemudian ia memohon ampun kepada Allah' \". "
            },
            {
                "number": 228,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنِي مَعْنٌ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ مَكْحُولٍ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَ إِذَا حَدَّثْنَاكُمْ بِالْحَدِيثِ عَلَى مَعْنَاهُ فَحَسْبُكُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepadaku [Ma'an] dari [Mu'awiyah bin Shalih] dari [Al 'Ala` bin Al Harits] dari [Makhul] dari [Watsilah bin Al `Asfa'] ia berkata: \"Apabila kami menceritakan satu hadits kepada kalian dengan redaksi maknanya, maka hal itu sudah cukup bagi kalian\". "
            },
            {
                "number": 229,
                "arab": " أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ أَنَّهُ كَانَ إِذَا حَدَّثَ لَمْ يُقَدِّمْ وَلَمْ يُؤَخِّرْ وَكَانَ الْحَسَنُ إِذَا حَدَّثَ قَدَّمَ وَأَخَّرَ",
                "id": "Telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Fudlail bin 'Iyadl] dari [Hisyam] dari [Ibnu Sirin]: \"Apabila ia menceritakan satu hadits, ia tidak pernah mendahulukan atau mengakhirkan (mengubah redaksi kalimatnya), sementara [Al Hasan] apabila menceritakan satu hadits terkadang mendahulukan dan mengakhirkan (redaksinya) \"."
            },
            {
                "number": 230,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ كَانَ الْحَسَنُ يُحَدِّثُ بِالْحَدِيثِ الْأَصْلُ وَاحِدٌ وَالْكَلَامُ مُخْتَلِفٌ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah mengabarkan kepada kami [Jarir bin Hazim] ia berkata: \" [Al Hasan] apabila menceritakan hadits (mengatakan): Haditsnya satu (sama), namun redaksi pengungkapannya bisa berbeda\"."
            },
            {
                "number": 231,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ سُوقَةَ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ قَالَ حَدَّثَ عُبَيْدُ بْنُ عُمَيْرٍ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُنَافِقِ مَثَلُ الشَّاةِ بَيْنَ الرَّبِيضَيْنِ أَوْ بَيْنَ الْغَنَمَيْنِ فَقَالَ ابْنُ عُمَرَ لَا إِنَّمَا قَالَ كَذَا وَكَذَا قَالَ وَكَانَ ابْنُ عُمَرَ إِذَا سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَزِدْ فِيهِ وَلَمْ يُنْقِصْ مِنْهُ وَلَمْ يُجَاوِزْهُ وَلَمْ يُقَصِّرْ عَنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Suqah] dari [Muhammad bin Ali bin Al Husain] ia berkata: \" [Ubaid bin Umair] menceritakan kepada Abdullah bin Umar, ia berkata: Rasulullah sallallahu 'alaihi wa sallam bersabda: 'perumpamaan orang munafik seperti seekor kambing diantara dua kandang kambing atau diantara dua kambing, [Ibnu Umar] berkata: 'tidak, sesungguhnya beliau bersabda demikian dan demikian'. Dia (Ali bin Al Husain) berkata: 'Ibnu Umar radliallahu 'anhu jika mendengar (sabda) Nabi ia tidak menambahi, tidak mengurangi, tidak memanjangkan serta tidak memendekkannya' \". "
            },
            {
                "number": 232,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ ابْنِ عَوْنٍ قَالَ كَانَ الشَّعْبِيُّ وَالنَّخَعِيُّ وَالْحَسَنُ يُحَدِّثُونَ بِالْحَدِيثِ مَرَّةً هَكَذَا وَمَرَّةً هَكَذَا فَذَكَرْتُ ذَلِكَ لِمُحَمَّدِ بْنِ سِيرِينَ فَقَالَ أَمَا إِنَّهُمْ لَوْ حَدَّثُوا بِهِ كَمَا سَمِعُوهُ كَانَ خَيْرًا لَهُمْ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Ibnu 'Ulayyah] dari [Ibnu 'Aun] ia berkata: \"Pernah [As Sya'bi], [An Nakha'i], dan [Al Hasan] menceritakan hadits (dengan redaksi) tertentu, dan (suatu saat dengan redaksi) yang berbeda, lalu aku menyampaikan hal tersebut kepada [Muhammad bin Sirin], lantas ia berkata: \"Bila mereka menceritakan hadis tertentu, sebagaimana mereka dengar apa adanya, hal itu lebih baik.\" "
            },
            {
                "number": 233,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا عَثَّامٌ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ قَالَ إِنِّي لَأَسْمَعُ الْحَدِيثَ لَحْنًا فَأَلْحَنُ اتِّبَاعًا لِمَا سَمِعْتُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`], telah menceritakan kepada kami ['Atsam] dari [Al A'masy] dari ['Umarah ibnu 'Umair] dari [Abu Ma'mar] ia berkata: \"Pernah aku mendengar hadits lahnan (secara takwil atau makna) maka aku takwilkan hadits sebagaimana yang aku dengar\"."
            },
            {
                "number": 234,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ قَالَ رَأَى مُجَاهِدٌ طَاوُسًا فِي الْمَنَامِ كَأَنَّهُ فِي الْكَعْبَةِ يُصَلِّي مُتَقَنِّعًا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى بَابِ الْكَعْبَةِ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ اكْشِفْ قِنَاعَكَ وَأَظْهِرْ قِرَاءَتَكَ قَالَ فَكَأَنَّهُ عَبَّرَهُ عَلَى الْعِلْمِ فَانْبَسَطَ بَعْدَ ذَلِكَ فِي الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] ia berkata: [Mujahid] melihat Thawus dalam mimpinya, dia di Ka`bah mendirikan sholat sambil menutupi muka dengan kain, sementara Nabi sallallahu 'alaihi wa sallam berada di pintu Ka`bah. Kontan beliau berkata kepadanya: Wahai Abdullah bukalah kain penutup wajahmu dan tampakkan bacaanmu\". Dia berkata: Seakan-akan Rasulullah sallallahu 'alaihi wa sallam memberikan gambaran tentang ilmu, setelah itu Thawus lebih terbuka dan sering meriwayatkan hadits\"."
            },
            {
                "number": 235,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ عَنْ بَحِيرٍ عَنْ خَالِدِ بْنِ مَعْدَانَ قَالَ النَّاسُ عَالِمٌ وَمُتَعَلِّمٌ وَمَا بَيْنَ ذَلِكَ هَمَجٌ لَا خَيْرَ فِيهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Al 'Auza'i] dari [Bahir] dari [Khalid bin Ma'dan] ia berkata: \"Manusia (terbagi dua) yaitu alim (orang yang mengajar) dan pelajar, selain itu adalah orang hina yang tidak ada kebaikan\"."
            },
            {
                "number": 236,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ عَنْ هِشَامٍ عَنْ الْحَسَنِ قَالَ كَانُوا يَقُولُونَ مَوْتُ الْعَالِمِ ثُلْمَةٌ فِي الْإِسْلَامِ لَا يَسُدُّهَا شَيْءٌ مَا اخْتَلَفَ اللَّيْلُ وَالنَّهَارُ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Hakam] telah menceritakan kepada kami [Abdullah bin Rajab] dari [Hisyam] dari [Hasan] ia berkata: \"Mereka berkata bahwa wafatnya seorang alim laksana robeknya sesuatu yang tidak bisa ditambal, selama masih ada siang dan malam\"."
            },
            {
                "number": 237,
                "arab": " أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا وَكِيعٌ قَالَ قَالَ سُفْيَانُ مَا أَعْلَمُ عَمَلًا أَفْضَلَ مِنْ طَلَبِ الْعِلْمِ وَحِفْظِهِ لِمَنْ أَرَادَ اللَّهَ بِهِ قَالَ قَالَ الْحَسَنُ بْنُ صَالِحٍ إِنَّ النَّاسَ لَيَحْتَاجُونَ إِلَى هَذَا الْعِلْمِ فِي دِينِهِمْ كَمَا يَحْتَاجُونَ إِلَى الطَّعَامِ وَالشَّرَابِ فِي دُنْيَاهُمْ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] telah mengabarkan kepada kami [Waki'] dia berkata: [Sufyan] berkata: \"Aku tidak mengetahui suatu amalan yang lebih utama dari pada mencari ilmu dan menjaganya, bagi siapa yang Allah kehendaki. Sufyan juga berkata: Berkata Al Hasan bin Shalih: 'Manusia membutuhkan ilmu ini untuk agamanya, sebagaimana mereka membutuhkan ilmu untuk makanan dan minuman dalam dunia mereka' \"."
            },
            {
                "number": 238,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ وَجَعْفَرُ بْنُ عَوْنٍ قَالَا حَدَّثَنَا مِسْعَرٌ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ قَالَ قَالَ أَبُو الدَّرْدَاءِ تَعَلَّمُوا قَبْلَ أَنْ يُقْبَضَ الْعِلْمُ فَإِنَّ قَبْضَ الْعِلْمِ قَبْضُ الْعُلَمَاءِ وَإِنَّ الْعَالِمَ وَالْمُتَعَلِّمَ فِي الْأَجْرِ سَوَاءٌ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] dan telah mengabarkan kepada kami [Ja'far bin 'Aun] berkata: telah menceritakan kepada kami [Mis'ar] dari ['Amr bin Murrah] dari [Salim bin Abu Al Ja'd] ia berkata: berkata [Abu Darda`] radliallahu 'anhu: \"Belajarlah kalian sebelum ilmu dicabut, sesungguhnya dicabutnya ilmu dengan diwafatkan ulama. Sesungguhnya orang alim (yang mengajarkan ilmu) dan manusia terpelajar (yang berburu ilmu) memperoleh pahala sama\"."
            },
            {
                "number": 239,
                "arab": " أَخْبَرَنَا هَارُونُ بْنُ مُعَاوِيَةَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ الْخُرَاسَانِيِّ عَنْ الضَّحَّاكِ وَلَكِنْ كُونُوا رَبَّانِيِّينَ بِمَا كُنْتُمْ تُعَلِّمُونَ الْكِتَابَ قَالَ حَقٌّ عَلَى كُلِّ مَنْ قَرَأَ الْقُرْآنَ أَنْ يَكُونَ فَقِيهًا",
                "id": "Telah mengabarkan kepada kami [Harun bin Mu'awiyah] dari [Hafsh bin Ghiyats] dari [Abi Abdullah Al Khurasani] dari [Ad Dlahaq] -Ia mengomentari ayat- 'Akan tetapi jadilah kalian semua Rabbaniyyun karena kamu selalu mengajarkan Al kitab' (Surat Ali-Imran; 79), dia berkata: \"adalah kewajiban setiap orang yang membaca Al Qur`an untuk menjadi faqih (mengetahui maksud atau isinya secara mendalam) \"."
            },
            {
                "number": 240,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ الْفَزَارِيِّ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ { كُونُوا رَبَّانِيِّينَ } قَالَ عُلَمَاءُ فُقَهَاءُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Uyainah] dari [Abu Ishaq Al Fazari] dari ['Atha' bin As Sa`ib] dari [Sa'id bin Jubair] ia berkata: \"jadilah kalian semua Rabbaniyyun\" dia berkata: maksudnya adalah ulama yang ahli fikih\"."
            },
            {
                "number": 241,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ يَقُولُ يُرَادُ لِلْعِلْمِ الْحِفْظُ وَالْعَمَلُ وَالِاسْتِمَاعُ وَالْإِنْصَاتُ وَالنَّشْرُ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id] ia berkata: \"aku telah mendengar [Sufyan bin 'Uyainah] berkata: \"Yang dimaksud ilmu adalah menghafal, beramal, mendengar, diam dan menyebarkan\"."
            },
            {
                "number": 242,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو عَنْ زَيْدٍ هُوَ ابْنُ أَبِي أُنَيْسَةَ عَنْ سَيَّارٍ عَنْ الْحَسَنِ قَالَ مَنْهُومَانِ لَا يَشْبَعَانِ مَنْهُومٌ فِي الْعِلْمِ لَا يَشْبَعُ مِنْهُ وَمَنْهُومٌ فِي الدُّنْيَا لَا يَشْبَعُ مِنْهَا فَمَنْ تَكُنِ الْآخِرَةُ هَمَّهُ وَبَثَّهُ وَسَدَمَهُ يَكْفِي اللَّهُ ضَيْعَتَهُ وَيَجْعَلُ غِنَاهُ فِي قَلْبِهِ وَمَنْ تَكُنِ الدُّنْيَا هَمَّهُ وَبَثَّهُ وَسَدَمَهُ يُفْشِي اللَّهُ عَلَيْهِ ضَيْعَتَهُ وَيَجْعَلُ فَقْرَهُ بَيْنَ عَيْنَيْهِ ثُمَّ لَا يُصْبِحُ إِلَّا فَقِيرًا وَلَا يُمْسِي إِلَّا فَقِيرًا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Ja'far Ar Raqi] dari [ubaidhullah bin 'Amr] dari [Zaid Ibnu Abu Unaisah] dari [Sayyar] dari [Al Hasan] ia berkata: \"Ada dua golongan orang rakus yang tidak pernah merasa kenyang, Pertama orang yang rakus terhadap ilmu, Kedua orang yang rakus terhadap dunia. Barang siapa yang menjadikan akhirat sebagai tujuan, semboyan, dan kesukaannya, Allah mencukupkan kekurangannya (amal perbuatannya) dan Allah menjadikan kekayaannya di hatinya. Dan barangsiapa menjadikan dunia sebagai tujuan, semboyan dan kesukaannya, maka Allah menjadikan hartanya berlimpah dan menjadikan kefakiran di depan matanya, kemudian dia tidak menjadi selain sebagai orang fakir di pagi dan sore harinya\"."
            },
            {
                "number": 243,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عُمَيْسٍ عَنْ عَوْنٍ قَالَ قَالَ عَبْدُ اللَّهِ مَنْهُومَانِ لَا يَشْبَعَانِ صَاحِبُ الْعِلْمِ وَصَاحِبُ الدُّنْيَا وَلَا يَسْتَوِيَانِ أَمَّا صَاحِبُ الْعِلْمِ فَيَزْدَادُ رِضًا لِلرَّحْمَنِ وَأَمَّا صَاحِبُ الدُّنْيَا فَيَتَمَادَى فِي الطُّغْيَانِ ثُمَّ قَرَأَ عَبْدُ اللَّهِ { كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَى أَنْ رَآهُ اسْتَغْنَى } قَالَ وَقَالَ الْآخَرُ { إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ }",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Abu 'Umais] dari ['Aun] ia berkata: \" [Abdullah] berkata: 'Ada dua golongan yang tidak pernah merasa kenyang, yaitu pemilik ilmu dan pemilik dunia, dan keduanya tidak sama. Adapun pemilik ilmu semakin menambah kerelaan terhadap Ar Rahman, dan pemilik dunia selalu melampaui batas (menambah kelaliman), kemudian Abdullah membaca: \"KALLA INNAL INSAANA LAYATHGHAA AN RA`AHUS TAGHNAA\" (Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas, karena ia melihat dirinya serba cukup), dia berkata juga, yang lain juga berkata: 'Yang takut kepada Allah diantara hambaNya, hanyalah ulama\"."
            },
            {
                "number": 244,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ قَالَ سَمِعْتُ سُفْيَانَ مُنْذُ أَرْبَعِينَ سَنَةً قَالَ مَا كَانَ طَلَبُ الْحَدِيثِ أَفْضَلَ مِنْهُ الْيَوْمَ قَالُوا لِسُفْيَانَ إِنَّهُمْ يَطْلُبُونَهُ بِغَيْرِ نِيَّةٍ قَالَ طَلَبُهُمْ إِيَّاهُ نِيَّةٌ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Imran] telah menceritakan kepada kami [Yahya bin Yaman] ia berkata: \"Aku pernah mendengar [Sufyan] sejak empat puluh tahun yang lalu, ia berkata: 'Hari ini tak ada yang lebih utama daripada perburuan hadis. Mereka berkomentar kepada Sofyan; \"Paling-paling mereka mencarinya tanpa niat\". Kontan Sofyan berkata: \"Pencarian mereka untuk berburu hadis itu sendiri merupakan niat' \". "
            },
            {
                "number": 245,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْأَجْلَحِ قَالَ حَدَّثَنِي أَبِي عَنْ مُجَاهِدٍ قَالَ طَلَبْنَا هَذَا الْعِلْمَ وَمَا لَنَا فِيهِ كَبِيرُ نِيَّةٍ ثُمَّ رَزَقَ اللَّهُ بَعْدُ فِيهِ النِّيَّةَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa`ad] telah menceritakan kepada kami [Abdullah bin Al Ajlah] telah menceritakan kepadaku [ayahku] dari [Mujahid] ia berkata: \"Dahulu kami mencari ilmu ini dengan tanpa niat yang benar. Kemudian Allah memberi niat (kepada kami) di kemudian hari\"."
            },
            {
                "number": 246,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ ثَابِتٍ الْبَزَّارُ حَدَّثَنَا حَسَّانُ بْنُ مُسْلِمٍ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ الْحَسَنِ قَالَ لَقَدْ طَلَبَ أَقْوَامٌ الْعِلْمَ مَا أَرَادُوا بِهِ اللَّهَ وَلَا مَا عِنْدَهُ قَالَ فَمَا زَالَ بِهِمْ الْعِلْمُ حَتَّى أَرَادُوا بِهِ اللَّهَ وَمَا عِنْدَهُ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Tsabit Al Bazzar] telah menceritakan kepada kami [Hassan bin Muslim] dari [Yunus bin Ubaid] dari [Al Hasan] ia berkata: \"Sungguh ada beberapa kaum yang mencari ilmu sedang mereka menghendaki hal itu bukan karena Allah dan bukan untuk memperoleh yang ada di sisiNya, maka tak henti-hentinya mereka mencari ilmu hingga mereka menghendakinya karena Allah dan untuk memperoleh apa yang ada di sisiNya\"."
            },
            {
                "number": 247,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ قَالَ قَالَ أَبُو مُسْلِمٍ الْخَوْلَانِيُّ الْعُلَمَاءُ ثَلَاثَةٌ فَرَجُلٌ عَاشَ فِي عِلْمِهِ وَعَاشَ مَعَهُ النَّاسُ فِيهِ وَرَجُلٌ عَاشَ فِي عِلْمِهِ وَلَمْ يَعِشْ مَعَهُ فِيهِ أَحَدٌ وَرَجُلٌ عَاشَ النَّاسُ فِي عِلْمِهِ وَكَانَ وَبَالًا عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] ia berkata: \" [Abu Muslim Al Khaulani] pernah berkata: 'Ulama' itu ada tiga: Pertama Ulama' yang hidup dengan ilmunya dan manusia lain hidup dengan ilmunya, Kedua ulama' yang hidup dengan ilmunya dan tidak seorang pun mendapatkan manfaat ilmu tersebut, dan ketiga ulama yang masyarakat hidup dengan ilmunya, namun ilmu tersebut justru mencelakaan dirinya sendiri\"."
            },
            {
                "number": 248,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ عُثْمَانَ بْنِ الْأَسْوَدِ عَنْ عَطَاءٍ قَالَ قَالَ مُوسَى يَا رَبِّ أَيُّ عِبَادِكَ أَحْكَمُ قَالَ الَّذِي يَحْكُمُ لِلنَّاسِ كَمَا يَحْكُمُ لِنَفْسِهِ قَالَ يَا رَبِّ أَيُّ عِبَادِكَ أَغْنَى قَالَ أَرْضَاهُمْ بِمَا قَسَمْتُ لَهُ قَالَ يَا رَبِّ أَيُّ عِبَادِكَ أَخْشَى لَكَ قَالَ أَعْلَمُهُمْ بِي",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Musa] dari [Utsman bin Al Aswad] dari ['Atha`] ia berkata: \"Nabi Musa 'alaihaihissalam: 'Ya Rabbi, siapakah diantara hamba-Mu yang paling bijaksana?, Allah menjawab: 'yaitu orang yang menghukumi manusia sebagaimana ia menghukumi untuk dirinya sendiri. Beliau juga berkata: ' Wahai Tuhanku siapa diantara hamba-Mu yang paling kaya? Allah menjawab: 'Ia adalah orang yang paling rela dengan apa-apa yang Aku bagikan kepadanya'. Beliau juga bertanya: 'Wahai Tuhanku siapakah dari hambaMu yang paling takut kepadaMu? Allah menjawab: 'Mereka yang paling tahu tentang diriKu' \"."
            },
            {
                "number": 249,
                "arab": " أَخْبَرَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ الْحَسَنِ قَالَ الْعِلْمُ عِلْمَانِ فَعِلْمٌ فِي الْقَلْبِ فَذَلِكَ الْعِلْمُ النَّافِعُ وَعِلْمٌ عَلَى اللِّسَانِ فَذَلِكَ حُجَّةُ اللَّهِ عَلَى ابْنِ آدَمَ أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ عَنْ فُضَيْلِ بْنِ عِيَاضٍ عَنْ هِشَامٍ عَنْ الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Makki bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Al Hasan] ia berkata: \"Ilmu itu ada dua, yaitu ilmu dalam hati, itulah ilmu yang bermanfaat dan ilmu yang ada di lisan, itulah hujjah Allah atas Ibnu Adam (manusia) \". ['Ashim bin Yusuf] mengabarkan kepada kami dari [Fudhail bin Iyadh] dari [Hisyam] dari [Al Hasan] dari Rasulullah sallallahu 'alaihi wa sallam seperti itu\"."
            },
            {
                "number": 250,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ تَعَلَّمُوا تَعَلَّمُوا فَإِذَا عَلِمْتُمْ فَاعْمَلُوا",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Khalid bin Abdullah] dari [Yazid bin Abu Ziyad] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] ia berkata: \"Belajarlah kalian semua, belajarlah kalian semua, Jika kalian semua telah mengetahui maka amalkanlah\"."
            },
            {
                "number": 251,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ هِشَامٍ صَاحِبِ الدَّسْتَوَائِيِّ قَالَ قَرَأْتُ فِي كِتَابٍ بَلَغَنِي أَنَّهُ مِنْ كَلَامِ عِيسَى تَعْمَلُونَ لِلدُّنْيَا وَأَنْتُمْ تُرْزَقُونَ فِيهَا بِغَيْرِ عَمَلٍ وَلَا تَعْمَلُونَ لِلْآخِرَةِ وَأَنْتُمْ لَا تُرْزَقُونَ فِيهَا إِلَّا بِالْعَمَلِ وَإِنَّكُمْ عُلَمَاءَ السَّوْءِ الْأَجْرَ تَأْخُذُونَ وَالْعَمَلَ تُضَيِّعُونَ يُوشِكُ رَبُّ الْعَمَلِ أَنْ يَطْلُبَ عَمَلَهُ وَتُوشِكُونَ أَنْ تَخْرُجُوا مِنْ الدُّنْيَا الْعَرِيضَةِ إِلَى ظُلْمَةِ الْقَبْرِ وَضِيقِهِ اللَّهُ نَهَاكُمْ عَنْ الْخَطَايَا كَمَا أَمَرَكُمْ بِالصَّلَاةِ وَالصِّيَامِ كَيْفَ يَكُونُ مِنْ أَهْلِ الْعِلْمِ مَنْ سَخِطَ رِزْقَهُ وَاحْتَقَرَ مَنْزِلَتَهُ وَقَدْ عَلِمَ أَنَّ ذَلِكَ مِنْ عِلْمِ اللَّهِ وَقُدْرَتِهِ كَيْفَ يَكُونُ مِنْ أَهْلِ الْعِلْمِ مَنْ اتَّهَمَ اللَّهَ فِيمَا قَضَى لَهُ فَلَيْسَ يَرْضَى شَيْئًا أَصَابَهُ كَيْفَ يَكُونُ مِنْ أَهْلِ الْعِلْمِ مَنْ دُنْيَاهُ آثَرُ عِنْدَهُ مِنْ آخِرَتِهِ وَهُوَ فِي الدُّنْيَا أَفْضَلُ رَغْبَةً كَيْفَ يَكُونُ مِنْ أَهْلِ الْعِلْمِ مَنْ مَصِيرُهُ إِلَى آخِرَتِهِ وَهُوَ مُقْبِلٌ عَلَى دُنْيَاهُ وَمَا يَضُرُّهُ أَشْهَى إِلَيْهِ أَوْ قَالَ أَحَبُّ إِلَيْهِ مِمَّا يَنْفَعُهُ كَيْفَ يَكُونُ مِنْ أَهْلِ الْعِلْمِ مَنْ يَطْلُبُ الْكَلَامَ لِيُخْبِرَ بِهِ وَلَا يَطْلُبُهُ لِيَعْمَلَ بِهِ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Hisyam] pengarang kitab Ad Dastawa`i ia berkata: \"Aku pernah membaca dalam sebuah kitab, telah sampai kepadaku bahwa kitab itu dari ucapan Isa 'alaihissalam: 'Kamu semua beramal untuk dunia padahal kamu semua diberi rizki disana tanpa amal, dan kamu semua tidak beramal untuk akhirat dan padahal kamu semua tidak diberi rizki disana kecuali dengan beramal. Celakalah kalian semua ulama` su` (ulama yang jahat), kalian semua mengambil pahala, sedang amal kalian sia-siakan. Khawatirkan olehmu jangan-jangan pemilik amal (Allah) meminta amalnya, dan dikhawatirkan kalian semua keluar dari dunia yang luas menuju kegelapan kubur dan kesempitannya. Allah melarang kalian semua berbuat kesalahan sebagaimana Ia memerintahkan kalian semua sholat dan puasa. Bagaimana mungkin seseorang menjadi seorang alim jika ia khawatir terhadap rizkinya dan merendahkan derajatnya padahal ia tahu bahwa hal itu dari ilmu Allah dan taqdirNya?, Bagaimana mungkin seseorang dianggap sebagai orang berilmu sedang dia menghujat Allah terhadap apa yang telah ditentukan-Nya, dan dia tidak ridha atas sesuatu yang menimpa dirinya?. Bagaimana bisa dianggap sebagai orang berilmu, seseorang yang lebih mengutamakan dunia di sisinya dari pada akhiratnya dan dia lebih mementingkan masalah dunia?, bagaimana bisa dianggap sebagai orang yang berilmu, seseorang yang berjalan menuju akhirat, namun ia selalu mengejar dunia, dan apa-apa yang membahayakannya lebih ia sukai (atau dia berkata: aku lebih mencintainya) dari apa-apa yang membawa manfaat kepadanya?, bagaimana bisa dianggap sebagai orang yang berilmu, orang yang mencari Al kalam (ilmu) untuk sekedar diinformasikan dan tidak mencarinya untuk beramal?\"."
            },
            {
                "number": 252,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا حَرِيزٌ عَنْ حَبِيبِ بْنِ عُبَيْدٍ قَالَ كَانَ يُقَالُ تَعَلَّمُوا الْعِلْمَ وَانْتَفِعُوا بِهِ وَلَا تَعَلَّمُوهُ لِتَتَجَمَّلُوا بِهِ فَإِنَّهُ يُوشِكُ إِنْ طَالَ بِكُمْ عُمُرٌ أَنْ يَتَجَمَّلَ ذُو الْعِلْمِ بِعِلْمِهِ كَمَا يَتَجَمَّلُ ذُو الْبِزَّةِ بِبِزَّتِهِ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Hariz] dari [Habib bin Ubaid] ia berkata: \"Pelajarilah ilmu dan ambillah manfaat, dan janganlah kalian mempelajarinya karena ingin memperbagus diri dengan ilmu. Siapa tahu kalian berumur panjang, dan ketika itu orang yang mempunyai ilmu memperbagus dirinya dengan ilmunya seperti orang yang mempunyai kain dan dipergunakannya untuk memperindah diri.\""
            },
            {
                "number": 253,
                "arab": " أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا بَقِيَّةُ عَنْ الْأَحْوَصِ بْنِ حَكِيمٍ عَنْ أَبِيهِ قَالَ سَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الشَّرِّ فَقَالَ لَا تَسْأَلُونِي عَنْ الشَّرِّ وَاسْأَلُونِي عَنْ الْخَيْرِ يَقُولُهَا ثَلَاثًا ثُمَّ قَالَ أَلَا إِنَّ شَرَّ الشَّرِّ شِرَارُ الْعُلَمَاءِ وَإِنَّ خَيْرَ الْخَيْرِ خِيَارُ الْعُلَمَاءِ",
                "id": "Telah mengabarkan kepada kami [Nu'aim bin Hammad] telah menceritakan kepada kami [Baqiyyah] dari [Al `Ahwash bin Hakim] dari [ayahnya] ia berkata: \"Seorang laki-laki bertanya kepada Rasulullah sallallahu 'alaihi wa sallam tentang kejahatan, maka Rasulullah sallallahu 'alaihi wa sallam menjawab: \"Janganlah anda sekalian bertanya kepadaku tentang kejahatan, dan bertanyalah kepadaku tentang kebaikan\". Rasul berkata tiga kali, kemudian beliau bersabda: \"Ketahuilah bahwa sejelek-jelek kejahatan adalah kejahatan ulama, dan sebaik-baik kebaikan adalah kebaikan ulama.\""
            },
            {
                "number": 254,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ قَالَ زَعَمَ لِي سُفْيَانُ قَالَ كَانَ الرَّجُلُ لَا يَطْلُبُ الْعِلْمَ حَتَّى يَتَعَبَّدَ قَبْلَ ذَلِكَ أَرْبَعِينَ سَنَةً",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] berkata: \"Sepertinya [Sofyan] pernah mengatakan kepadaku: \"Pernah ada seorang laki-laki yang tidak mencari ilmu hingga ia mau berkorban untuk ibadah, dan itu memerlukan waktu empat puluh tahun.\""
            },
            {
                "number": 255,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ بُرْدِ بْنِ سِنَانٍ أَبِي الْعَلَاءِ عَنْ مَكْحُولٍ قَالَ مَنْ طَلَبَ الْعِلْمَ لِيُمَارِيَ بِهِ السُّفَهَاءَ وَلِيُبَاهِيَ بِهِ الْعُلَمَاءَ أَوْ لِيَصْرِفَ بِهِ وُجُوهَ النَّاسِ إِلَيْهِ فَهُوَ فِي نَارِ جَهَنَّمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Burd bin Sinan Abu Al 'Ala`] dari [Makhul] berkata: \"Barang siapa mencari ilmu sekedar untuk berbantah-bantahan dengan orang bodoh, untuk menandingi para ulama dan untuk mencari muka manusia, dia masuk neraka jahannam\"."
            },
            {
                "number": 256,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبَانَ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ عَنْ الْمِنْهَالِ بْنِ خَلِيفَةَ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّمَا يُحْفَظُ حَدِيثُ الرَّجُلِ عَلَى قَدْرِ نِيَّتِهِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Abban] telah menceritakan kepada kami [Yahya bin Yaman] dari [Minhal bin Khalifah] [dari [Mathar Al Warraq] dari [Syahr bin Hausyab] dari [Ibnu Abbas] radliallahu 'anhu ia berkata: \" Perkataan seseorang akan diingat sesuai dengan kadar niatnya\"."
            },
            {
                "number": 257,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ أَيُّوبَ قَالَ قَالَ أَبُو قِلَابَةَ لَا تُجَالِسُوا أَهْلَ الْأَهْوَاءِ وَلَا تُجَادِلُوهُمْ فَإِنِّي لَا آمَنُ أَنْ يَغْمِسُوكُمْ فِي ضَلَالَتِهِمْ أَوْ يَلْبِسُوا عَلَيْكُمْ مَا كُنْتُمْ تَعْرِفُونَ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin harb] dari [Hammad bin Zaid] dari [Ayyub] ia berkata: \" [Abu Qilabah] pernah berkata: 'Janganlah kalian bergaul dengan orang yang mengikuti hawa nafsu, dan jangan pula kalian berdebat dengan mereka, karena aku khawatir akan menjerumuskan kalian dalam kesesatan, atau mencampuradukkan perkara-perkara yang kalian ketahui' \"."
            },
            {
                "number": 258,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ قَالَ رَآنِي سَعِيدُ بْنُ جُبَيْرٍ جَلَسْتُ إِلَى طَلْقِ بْنِ حَبِيبٍ فَقَالَ لِي أَلَمْ أَرَكَ جَلَسْتَ إِلَى طَلْقِ بْنِ حَبِيبٍ لَا تُجَالِسَنَّهُ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] ia berkata: \" [Sa'id bin Jubair] pernah melihatku duduk bersama dengan Thalq bin Habib, lalu ia berkata kepadaku: 'Bukankah aku pernah melihatmu duduk bersama dengan Thalq bin Habib, janganlah kamu duduk bersamanya' \"."
            },
            {
                "number": 259,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنِي أَبُو صَخْرٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ جَاءَهُ رَجُلٌ فَقَالَ إِنَّ فُلَانًا يَقْرَأُ عَلَيْكَ السَّلَامَ قَالَ بَلَغَنِي أَنَّهُ قَدْ أَحْدَثَ فَإِنْ كَانَ قَدْ أَحْدَثَ فَلَا تَقْرَأْ عَلَيْهِ السَّلَامَ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Haiwah bin Syuraih] telah menceritakan kepadaku [Abu Shakhr] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhu: \"Seorang laki-laki datang menemuinya lalu berkata: 'Sesungguhnya si fulan menyampaikan salam untukmu', lalu ia berkata: 'Telah sampai berita kepadaku bahwa ia berbuat bid'ah, jika benar ia telah berbuat bid'ah maka janganlah kamu sampaikan salamku untuknya' \"."
            },
            {
                "number": 260,
                "arab": " أَخْبَرَنَا مَخْلَدُ بْنُ مَالِكٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَغْرَاءَ حَدَّثَنَا الْأَعْمَشُ قَالَ كَانَ إِبْرَاهِيمُ لَا يَرَى غِيبَةً لِلْمُبْتَدِعِ",
                "id": "Telah mengabarkan kepada kami [Makhlad bin Malik] telah menceritakan kepada kami [Abdur Rahman bin Maghra`] telah menceritakan kepada kami [Al A'masy] ia berkata: \" [Ibrahim] berpendapat bahwa membicarakan ahli bid'ah tidak termasuk mengghibah\"."
            },
            {
                "number": 261,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا جَرِيرٌ عَنْ ابْنِ شُبْرُمَةَ عَنْ الشَّعْبِيِّ قَالَ إِنَّمَا سُمِّيَ الْهَوَى لِأَنَّهُ يَهْوِي بِصَاحِبِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] telah menceritakan kepada kami [Jarir] dari [Ibnu Syubrumah] dari [As Sya'bi] ia berkata: \"Hanyasanya disebut hawa nafsu, karena ia menjerumuskan pelakunya\". "
            },
            {
                "number": 262,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ أَسْمَاءَ بْنِ عُبَيْدٍ قَالَ دَخَلَ رَجُلَانِ مِنْ أَصْحَابِ الْأَهْوَاءِ عَلَى ابْنِ سِيرِينَ فَقَالَا يَا أَبَا بَكْرٍ نُحَدِّثُكَ بِحَدِيثٍ قَالَ لَا قَالَا فَنَقْرَأُ عَلَيْكَ آيَةً مِنْ كِتَابِ اللَّهِ قَالَ لَا لِتَقُومَانِ عَنِّي أَوْ لَأَقُومَنَّ قَالَ فَخَرَجَا فَقَالَ بَعْضُ الْقَوْمِ يَا أَبَا بَكْرٍ وَمَا كَانَ عَلَيْكَ أَنْ يَقْرَأَا عَلَيْكَ آيَةً مِنْ كِتَابِ اللَّهِ قَالَ إِنِّي خَشِيتُ أَنْ يَقْرَأَا عَلَيَّ آيَةً مِنْ كِتَابِ اللَّهِ فَيُحَرِّفَانِهَا فَيَقِرُّ ذَلِكَ فِي قَلْبِي",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [`Asma` bin 'Ubaid] ia berkata: \"Ada dua orang (yang dikenal) memperturutkan hawa nafsu masuk menemui [Ibnu Sirin] kemudian keduanya berkata; 'Wahai Abu Bakar, bolehkah kami menceritakan kepadamu suatu hadits? ', ia menjawab: 'Tidak', keduanya berkata: 'Bagaimana kalau kami membacakan kepadamu sebuah ayat dari kitab Allah?, ia menjawab: 'tidak, kamu berdua yang pergi meninggalkanku ataukah aku yang harus pergi meninggalkan kamu berdua'. ia berkata: 'maka kedua orang itu pergi'. Sebagian orang-orang berkata kepadanya: 'Wahai Abu Bakar mengapa tidak kamu biarkan saja dia membacakan sebuah ayat dari kitab Allah? ', ia menjawab: 'Aku khawatir ia membacakan sebuah ayat kepadaku (tetapi) kemudian mereka putarbalikkan maknanya, dan hal itu bisa tertanam dalam hatiku' \"."
            },
            {
                "number": 263,
                "arab": " أَخْبَرَنَا سَعِيدٌ عَنْ سَلَّامِ بْنِ أَبِي مُطِيعٍ أَنَّ رَجُلًا مِنْ أَصْحَابِ الْأَهْوَاءِ قَالَ لِأَيُّوبَ يَا أَبَا بَكْرٍ أَسْأَلُكَ عَنْ كَلِمَةٍ قَالَ فَوَلَّى وَهُوَ يُشِيرُ بِأُصْبُعِهِ وَلَا نِصْفَ كَلِمَةٍ وَأَشَارَ لَنَا سَعِيدٌ بِخِنْصِرِهِ الْيُمْنَى",
                "id": "Telah mengabarkan kepada kami [Sa'id] dari [Salam bin Abu Muthi']: \"Ada seorang (yang selalu) mengikuti hawa nafsu berkata kepada [Ayyub]: 'Wahai Abu Bakar, bolehkah aku meminta kepadamu satu kalimat saja?\", Abu Bakar berpaling sambil memberikan isyarat dengan jarinya, dan ia tidak menjawab walau dengan satu kalimat pun, dan Sa'id memberikan isyarat kepada kami dengan jari kelingkingnya yang kanan\"."
            },
            {
                "number": 264,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ كُلْثُومِ بْنِ جَبْرٍ أَنَّ رَجُلًا سَأَلَ سَعِيدَ بْنَ جُبَيْرٍ عَنْ شَيْءٍ فَلَمْ يُجِبْهُ فَقِيلَ لَهُ فَقَالَ أَزِيشَانْ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin harb] dari [Hammad bin Zaid] dari [Kultsum bin Jabr]: \"Ada seorang bertanya kepada [Sa'id bin Jubair] tentang sesuatu dan ia tidak menjawabnya, kemudian ada seorang yang bertanya: 'Mengapa kamu bersikap demikian? ', ia menjawab: 'Azisyan (ia termasuk bagian dari orang yang suka membuat bid'ah dan memperturutkan hawa nafsu) ' \". "
            },
            {
                "number": 265,
                "arab": " أَخْبَرَنَا أَحْمَدُ حَدَّثَنَا زَائِدَةُ عَنْ هِشَامٍ عَنْ الْحَسَنِ وَابْنِ سِيرِينَ أَنَّهُمَا قَالَا لَا تُجَالِسُوا أَصْحَابَ الْأَهْوَاءِ وَلَا تُجَادِلُوهُمْ وَلَا تَسْمَعُوا مِنْهُمْ",
                "id": "Telah mengabarkan kepada kami [Ahmad] telah menceritakan kepada kami [Za`idah] dari [Hisyam] dari [Al Hasan] dan [Ibnu Sirin] keduanya berkata: \"Janganlah kalian duduk-duduk bersama orang-orang yang mengumbar atau mengikuti hawa nafsunya, jangan berbantah-bantahan bersama mereka dan janganlah kalian mendengarkan dari mereka\"."
            },
            {
                "number": 266,
                "arab": " أَخْبَرَنَا أَحْمَدُ حَدَّثَنَا شَرِيكٌ عَنْ أُمَيٍّ عَنْ الشَّعْبِيِّ قَالَ إِنَّمَا سُمُّوا أَصْحَابَ الْأَهْوَاءِ لِأَنَّهُمْ يَهْوُونَ فِي النَّارِ",
                "id": "Telah mengabarkan kepada kami [Ahmad] telah menceritakan kepada kami [Syarik] dari [`Umay] dari [As Sya'bi] ia berkata: \"Mereka disebut sebagai Ashhabul Ahwa`, karena mereka akan jatuh ke dalam api neraka\". "
            },
            {
                "number": 267,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ مَيْسَرَةَ قَالَ مَا رَأَيْتُ أَحَدًا مِنْ النَّاسِ الشَّرِيفُ وَالْوَضِيعُ عِنْدَهُ سَوَاءٌ غَيْرَ طَاوُسٍ وَهُوَ يَحْلِفُ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Sufyan] dari [Ibnu Maisarah] ia berkata: 'Aku tidak melihat satu orang pun, yang baginya orang mulia dan orang sederhana sama saja disisinya kecuali [Thawus], dan ia bersumpah untuk hal yang demikian\"."
            },
            {
                "number": 268,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ قَالَ كُنَّا نَكْرَهُ كِتَابَةَ الْعِلْمِ حَتَّى أَكْرَهَنَا عَلَيْهِ السُّلْطَانُ فَكَرِهْنَا أَنْ نَمْنَعَهُ أَحَدًا",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] ia berkata: \"Dahulu kami tidak suka menulis ilmu hingga ahirnya pemerintah memaksa kami, maka kami (akhirnya) tidak suka melarang seseorang melakukan hal tersebut\"."
            },
            {
                "number": 269,
                "arab": " أَخْبَرَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ حَدَّثَنَا ابْنُ عَوْنٍ قَالَ كَلَّمُوا مُحَمَّدًا فِي رَجُلٍ يَعْنِي يُحَدِّثُهُ فَقَالَ لَوْ كَانَ رَجُلًا مِنْ الزِّنْجِ لَكَانَ عِنْدِي وَعَبْدُ اللَّهِ بْنُ مُحَمَّدٍ فِي هَذَا سَوَاءً",
                "id": "Telah mengabarkan kepada kami [Yusuf bin musa] telah menceritakan kepada kami [Mu'adz bin Mu'adz] telah menceritakan kepada kami [Ibnu 'Aun] ia berkata: \"Orang-orang mengomentari [Muhammad] karena meladeni seseorang yang diajaknya bicara. Kontan Aun bin Abdullah berkomentar: Walaupun yang diajaknya bicara itu berasal dari suku Az Zinji (yang berkulit hitam), ia bagiku dan Abdullah bin Muhammad tetap sama saja\"."
            },
            {
                "number": 270,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ الصَّلْتِ بْنِ رَاشِدٍ سَأَلَ سَلْمُ بْنُ قُتَيْبَةَ طَاوُسًا عَنْ مَسْأَلَةٍ فَلَمْ يُجِبْهُ فَقِيلَ لَهُ هَذَا سَلْمُ بْنُ قُتَيْبَةَ قَالَ ذَلِكَ أَهْوَنُ لَهُ عَلَيَّ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] dari [Hammad bin Zaid] dari [As Shalt bin Rasyid] ia berkata: \"Salam bin Qutaibah pernah bertanya kepada [Thawus] tentang suatu masalah, tetapi ia tidak menjawabnya, lalu dikatakan kepadanya: 'Yang bertanya kepadamu ini Salam bin Qutaibah' ia menjawab: 'Kabar yang demikian pun tidak mempengaruhiku' \"."
            },
            {
                "number": 271,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ إِسْحَقَ عَنْ بَقِيَّةَ قَالَ حَدَّثَنِي حَبِيبُ بْنُ صَالِحٍ قَالَ مَا خِفْتُ أَحَدًا مِنْ النَّاسِ مَخَافَةَ خَالِدِ بْنِ مَعْدَانَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ishak] dari [Baqiyyah] ia berkata: [Habib bin Shalih] pernah berkata: 'Aku tidak pernah takut pada seorang pun seperti ketakutanku kepada Khalid bin Ma'dan\"."
            },
            {
                "number": 272,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ مُغِيرَةَ قَالَ كُنَّا نَهَابُ إِبْرَاهِيمَ هَيْبَةَ الْأَمِيرِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Mughirah] ia berkata: \"Kami menghormati (segan kepada) Ibrahim sebagaimana kami menghormati seorang Raja\"."
            },
            {
                "number": 273,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ قَالَ حَدَّثَ سَعِيدُ بْنُ جُبَيْرٍ يَوْمًا بِحَدِيثٍ فَقُمْتُ إِلَيْهِ فَاسْتَعَدْتُهُ فَقَالَ لِي مَا كُلَّ سَاعَةٍ أَحْلُبُ فَأُشْرَبُ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad Ibnu Zaid], dari [Ayyub] ia berkata: \"Pada suatu hari [Sa'id bin Jubair] membicarakan satu hadits, kemudian aku berdiri menemuinya dan memintanya mengulangi kembali', kemudian ia berkata: 'Tidaklah setiap saat aku memerah susu lalu diminumkan\"."
            },
            {
                "number": 274,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا هَارُونُ هُوَ ابْنُ الْمُغِيرَةِ وَيَحْيَى بْنُ ضُرَيْسٍ عَنْ عَمْرِو بْنِ أَبِي قَيْسٍ عَنْ عَطَاءٍ أَنَّ أَبَا عَبْدِ الرَّحْمَنِ كَرِهَ الْحَدِيثَ فِي الطَّرِيقِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] telah menceritakan kepada kami [Harun Ibnu Al Mughirah] dan [Yahya bin Dlurais] dari ['Amr bin Abu Qais] dari ['Atha`]: \" [Abu Abdur Rahman] membenci menceritakan sebuah hadits di jalanan\"."
            },
            {
                "number": 275,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ حَدَّثَنَا يَحْيَى بْنُ ضُرَيْسٍ حَدَّثَنَا أَبُو سِنَانٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَ كُنَّا عِنْدَ سَعِيدِ بْنِ جُبَيْرٍ فَحَدَّثَ بِحَدِيثٍ فَقَالَ لَهُ رَجُلٌ مَنْ حَدَّثَكَ هَذَا أَوْ مِمَّنْ سَمِعْتَ هَذَا فَغَضِبَ وَمَنَعَنَا حَدِيثَهُ حَتَّى قَامَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Imran] telah menceritakan kepada kami [Yahya bin Dlurais] telah menceritakan kepada kami [Abu Sinan] dari [Habib bin Abu Tsabit] ia berkata: \"Kami berada di samping [Sa'id bin Jubair], lalu dia membicarakan sebuah hadits. Seorang laki-laki berkata kepadanya: 'Siapa yang menceritakan kepadamu tentang (hadits) ini, atau dari siapa kamu mendengar (hadits) ini? ', kemudian ia marah dan tidak melanjutkan pembicaraan haditsnya hingga beranjak pergi\"."
            },
            {
                "number": 276,
                "arab": " أَخْبَرَنَا أَبُو مَعْمَرٍ إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ قَالَ لَوْ رَفَقْتُ بِابْنِ عَبَّاسٍ لَأَصَبْتُ مِنْهُ عِلْمًا كَثِيرًا",
                "id": "Telah mengabarkan kepada kami [Abu Ma'mar Isma'il bin Ibrahim], dari [Sufyan] dari [Az Zuhri] dari [Abu Salamah] ia berkata: \"Kalau saja dahulu aku berteman dengan Ibnu Abbas niscaya aku mendapatkan ilmu yang banyak\"."
            },
            {
                "number": 277,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ أَخْبَرَنَا بَقِيَّةُ عَنْ أُمِّ عَبْدِ اللَّهِ بِنْتِ خَالِدٍ قَالَتْ مَا رَأَيْتُ أَحَدًا أَكْرَمَ لِلْعِلْمِ مِنْ أَبِي",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah mengabarkan kepada kami [Baqiyyah] dari [Ummu Abdullah binti Khalid] ia berkata: \"Aku tidak pernah melihat seorang pun yang lebih memuliakan ilmu dari [ayahku] \"."
            },
            {
                "number": 278,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ مِسْعَرٍ قَالَ قَالَ سَعْدُ بْنُ إِبْرَاهِيمَ لَا يُحَدِّثْ عَنْ رَسُولِ اللَّهِ إِلَّا الثِّقَاتُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] dari [Mas'ar] ia berkata: \" [Sa'ad bin Ibrahim] pernah berkata: \"Tidak boleh siapapun menceritakan satu hadits dari Rasulullah sallallahu 'alaihi wa sallam kecuali jika dipercaya\"."
            },
            {
                "number": 279,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا جَرِيرٌ عَنْ عَاصِمٍ عَنْ ابْنِ سِيرِينَ قَالَ كَانُوا لَا يَسْأَلُونَ عَنْ الْإِسْنَادِ ثُمَّ سَأَلُوا بَعْدُ لِيَعْرِفُوا مَنْ كَانَ صَاحِبَ سُنَّةٍ أَخَذُوا عَنْهُ وَمَنْ لَمْ يَكُنْ صَاحِبَ سُنَّةٍ لَمْ يَأْخُذُوا عَنْهُ قَالَ أَبُو مُحَمَّد مَا أَظُنُّهُ سَمِعَهُ مِنْ عَاصِمٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] telah menceritakan kepada kami [Jarir] dari ['Ashim] dari [Ibnu Sirin] ia berkata: \"Dahulu, mereka tidak bertanya tentang sanad (jalur periwayatan hadits), kemudian mereka bertanya untuk mengenal para perawi, jika ia orang yang mengikut sunnah maka mereka ambil (hadits) nya, dan jika bukan, mereka tidak mengambilnya\"."
            },
            {
                "number": 280,
                "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا جَرِيرٌ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ قَالَ قَالَ إِبْرَاهِيمُ إِذَا حَدَّثْتَنِي فَحَدِّثْنِي عَنْ أَبِي زُرْعَةَ فَإِنَّهُ حَدَّثَنِي بِحَدِيثٍ ثُمَّ سَأَلْتُهُ بَعْدَ ذَلِكَ بِسَنَةٍ فَمَا أَخْرَمَ مِنْهُ حَرْفًا",
                "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Jarir] dari ['Umarah bin Al Qa'qa'] ia berkata: \"I [brahim] pernah berkata: 'Jika kamu hendak menceritakan (hadits) maka ceritakanlah melalui jalur Abu Zur'ah, karena ia telah menceritakan kepadaku satu hadits, kemudian aku bertanya kepadanya setahun berikutnya, dan tidak ada satu huruf pun yang berubah\"."
            },
            {
                "number": 281,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ إِنَّ هَذَا الْعِلْمَ دِينٌ فَلْيَنْظُرْ الرَّجُلُ عَمَّنْ يَأْخُذُ دِينَهُ",
                "id": "Terlah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ibnu 'Aun] dari [Muhammad] ia berkata: \"Ilmu (sanad) ini merupakan (bagian dari) agama, maka hendaklah seseorang memperhatikan dari siapa ia mengambil agamanya\"."
            },
            {
                "number": 282,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ هُشَيْمٍ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ كَانُوا إِذَا أَتَوْا الرَّجُلَ لِيَأْخُذُوا عَنْهُ نَظَرُوا إِلَى صَلَاتِهِ وَإِلَى سَمْتِهِ وَإِلَى هَيْئَتِهِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Ibrahim] dari [Husyaim] dari [Mughirah] dari [Ibrahim] ia berkata: \"Dahulu, mereka ketika mendatangi seseorang untuk mengambil (suatu hadits), mereka melihat (terlebih dahulu) tentang sholat orang tersebut dan sunnahnya serta sikap hidupnya, kemudian baru mereka mengambil (hadits) nya\"."
            },
            {
                "number": 283,
                "arab": " أَخْبَرَنَا أَبُو مَعْمَرٍ إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَبِي جَعْفَرٍ الرَّازِيُّ عَنْ أَبِيهِ عَنْ الرَّبِيعِ عَنْ أَبِي الْعَالِيَةِ قَالَ كُنَّا نَأْتِي الرَّجُلَ لِنَأْخُذَ عَنْهُ فَنَنْظُرُ إِذَا صَلَّى فَإِنْ أَحْسَنَهَا جَلَسْنَا إِلَيْهِ وَقُلْنَا هُوَ لِغَيْرِهَا أَحْسَنُ وَإِنْ أَسَاءَهَا قُمْنَا عَنْهُ وَقُلْنَا هُوَ لِغَيْرِهَا أَسْوَأُ قَالَ أَبُو مَعْمَرٍ لَفْظُهُ نَحْوُ هَذَا",
                "id": "Telah mengabarkan kepada kami [Abu Ma'mar Isma'il bin Ibrahim] telah mengabarkan kepada kami [Abdullah bin Abu Ja'far Ar Razi] dari [ayahnya] dari [Ar Rabi'] dari [Abul 'Aliyah] ia berkata: \"Dahulu kami jika menemui seseorang untuk mengambil (ilmu) nya, maka kami melihat (bagaimana) sholatnya, jika ia baik dalam menunaikannya, kami duduk dengannya, lalu kami berkata: Dia (dalam amalan selain sholat) pasti lebih baik, tetapi jika ia buruk dalam menunaikannya, maka kami segera beranjak pergi meninggalkannya, lalu kami katakan: 'Dia (dalam amalan selain sholat) pasti lebih buruk\". Abu Ma'mar berkata: \"Redaksinya seperti ini\"."
            },
            {
                "number": 284,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ قَالَ لَا أَدْرِي سَمِعْتُهُ مِنْهُ أَوْ لَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ إِنَّ هَذَا الْعِلْمَ دِينٌ فَانْظُرُوا عَمَّنْ تَأْخُذُونَ دِينَكُمْ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] ia berkata: \"Aku tidak tahu mendengarnya dari dia atau bukan [Ibnu 'Aun] dari [Muhammad] ia berkata: \"Sesungguhnya ilmu ini adalah (bagian dari) agama, karena itu hendaklah kalian perhatikan dari siapa kalian mengambil agama kalian\"."
            },
            {
                "number": 285,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ حُجَيْرٍ عَنْ طَاوُسٍ قَالَ جَاءَ بُشَيْرُ بْنُ كَعْبٍ إِلَى ابْنِ عَبَّاسٍ فَجَعَلَ يُحَدِّثُهُ فَقَالَ ابْنُ عَبَّاسٍ أَعِدْ عَلَيَّ الْحَدِيثَ الْأَوَّلَ قَالَ لَهُ بُشَيْرٌ مَا أَدْرِي عَرَفْتَ حَدِيثِي كُلَّهُ وَأَنْكَرْتَ هَذَا أَوْ عَرَفْتَ هَذَا وَأَنْكَرْتَ حَدِيثِي كُلَّهُ فَقَالَ ابْنُ عَبَّاسٍ إِنَّا كُنَّا نُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ لَمْ يَكُنْ يُكْذَبُ عَلَيْهِ فَلَمَّا رَكِبَ النَّاسُ الصَّعْبَ وَالذَّلُولَ تَرَكْنَا الْحَدِيثَ عَنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] dari [Hisyam bin Hujair] dari [Thawus] ia berkata: \"Basyir bin Ka'ab pernah datang menemui Ibnu Abbas, lalu ia menceritakan hadits kepadanya, lalu [Ibnu Abbas] berkata: 'Tolong ulangi hadits yang pertama', Basyir berkata kepadanya: 'Aku tidak tahu apakah kamu mengakui semua hadisku, atau kamu menolak hadits yang ini dan mengakui yang ini, atau menolak seluruh haditsku?. Lalu Ibnu Abbas berkata: 'Kami menceritakan hadits dari Rasulullah sallallahu 'alaihi wa sallam ketika tidak ada kebohongan atas nama Nabi sallallahu 'alaihi wa sallam. Namun ketika manusia menemui kesulitan (membedakan kejujuran perawi) dan menceritakan hadis diperlonggar, kami menahan diri untuk tidak meriwayatkan hadits dari beliau' \". "
            },
            {
                "number": 286,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبَانَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ كُنَّا نَحْفَظُ الْحَدِيثَ وَالْحَدِيثُ يُحْفَظُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى رَكِبْتُمْ الصَّعْبَ وَالذَّلُولَ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin `Aban] ia berkata: \"telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] ia berkata: 'Dahulu kami menjaga hadits dan hadits senantiasa terjaga dari Rasulullah sallallahu 'alaihi wa sallam hingga kalian menemui kesulitan (membedakan kejujuran perawi) dan menceritakan hadis diperlonggar\". "
            },
            {
                "number": 287,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ لَيْثٍ عَنْ طَاوُسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ يُوشِكُ أَنْ يَظْهَرَ شَيَاطِينُ قَدْ أَوْثَقَهَا سُلَيْمَانُ يُفَقِّهُونَ النَّاسَ فِي الدِّينِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Laits] dari [Thawus] dari [Abdullah bin 'Amr] ia berkata: \"Hampir saja setan-setan (yang pernah tunduk kepada Nabi Sulaiman 'alaihissalam menampakkan diri dan mengajarkan manusia tentang agama\"."
            },
            {
                "number": 288,
                "arab": " أَخْبَرَنَا مُوسَى بْنُ خَالِدٍ حَدَّثَنَا مُعْتَمِرٌ عَنْ أَبِيهِ قَالَ لِيُتَّقَى مِنْ تَفْسِيرِ حَدِيثِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا يُتَّقَى مِنْ تَفْسِيرِ الْقُرْآنِ",
                "id": "Telah mengabarkan kepada kami [Musa bin Khalid] telah menceritakan kepada kami [Mu'tamir] dari [ayahnya] ia berkata: \"Hendaknya seseorang bersikap hati-hati dalam menafsirkan hadits Rasulullah sallallahu 'alaihi wa sallam sebagaimana ia bersikap hati-hati dalam menafsirkan Al Qur`an\"."
            },
            {
                "number": 289,
                "arab": " أَخْبَرَنَا صَدَقَةُ بْنُ الْفَضْلِ حَدَّثَنَا مُعْتَمِرٌ عَنْ أَبِيهِ قَالَ قَالَ ابْنُ عَبَّاسٍ أَمَا تَخَافُونَ أَنْ تُعَذَّبُوا أَوْ يُخْسَفَ بِكُمْ أَنْ تَقُولُوا قَالَ رَسُولُ اللَّهِ وَقَالَ فُلَانٌ",
                "id": "Telah mengabarkan kepada kami [Shadaqah bin Al Fadl] telah menceritakan kepada kami [Mu'tamir] dari [ayahnya] ia berkata: \" [Ibnu Abbas] pernah berkata: 'Tidakkah kalian takut akan diadzab atau ditenggelamkan jika kalian mengatakan: Rasulullah sallallahu 'alaihi wa sallam bersabda dan si fulan berkata \". "
            },
            {
                "number": 290,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ بِشْرٍ حَدَّثَنَا الْمُعَافَى عَنْ الْأَوْزَاعِيِّ قَالَ كَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِنَّهُ لَا رَأْيَ لِأَحَدٍ فِي كِتَابِ اللَّهِ وَإِنَّمَا رَأْيُ الْأَئِمَّةِ فِيمَا لَمْ يَنْزِلْ فِيهِ كِتَابٌ وَلَمْ تَمْضِ بِهِ سُنَّةٌ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا رَأْيَ لِأَحَدٍ فِي سُنَّةٍ سَنَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin bisyr] telah menceritakan kepada kami [Al Mu'afi] dari [Al 'Auza'i] ia berkata: \" [Umar bin Abdul Aziz] pernah menulis surat (yang isinya): 'Tidak boleh ada pendapat seseorang mengenai hal-hal yang telah diputuskan dalam kitabullah. Hanyasanya pendapat para Imam dalam hal-hal yang belum ada penjelasannya dalam Al quran, atau sunnah Rasulullah Shallallahu Alahi wa Sallam belum menjelaskannya, dan tidak ada pula pendapat seseorang dalam sunnah yang telah di sunnahkan oleh Rasullah Shallallahu Alaihi Wa Sallam\". "
            },
            {
                "number": 291,
                "arab": " حَدَّثَنَا مُوسَى بْنُ خَالِدٍ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ خَطَبَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ لَمْ يَبْعَثْ بَعْدَ نَبِيِّكُمْ نَبِيًّا وَلَمْ يُنْزِلْ بَعْدَ هَذَا الْكِتَابِ الَّذِي أَنْزَلَ عَلَيْهِ كِتَابًا فَمَا أَحَلَّ اللَّهُ عَلَى لِسَانِ نَبِيِّهِ فَهُوَ حَلَالٌ إِلَى يَوْمِ الْقِيَامَةِ وَمَا حَرَّمَ عَلَى لِسَانِ نَبِيِّهِ فَهُوَ حَرَامٌ إِلَى يَوْمِ الْقِيَامَةِ أَلَا وَإِنِّي لَسْتُ بِقَاصٍّ وَلَكِنِّي مُنَفِّذٌ وَلَسْتُ بِمُبْتَدِعٍ وَلَكِنِّي مُتَّبِعٌ وَلَسْتُ بِخَيْرٍ مِنْكُمْ غَيْرَ أَنِّي أَثْقَلُكُمْ حِمْلًا أَلَا وَإِنَّهُ لَيْسَ لِأَحَدٍ مِنْ خَلْقِ اللَّهِ أَنْ يُطَاعَ فِي مَعْصِيَةِ اللَّهِ أَلَا هَلْ أَسْمَعْتُ",
                "id": "Telah menceraitakan kepada kami [Musa bin Khalid] telah menceritakan kepada kami [Mu'tamir bin Sulaiman] dari [ubaidhullah bin Umar], bahwasanya [Umar bin Abdul Aziz] berhutbah, ia berkata: \"Wahai sekalian manusia, Allah subhanallahu wa ta'ala tidak mengutus seorang nabi pun setelah Nabi kalian, dan Allah subhanallahu wa ta'ala tidak menurunkan sebuah kitab pun setelah kitab yang diturunkan kepadanya ini. Apa-apa yang telah Allah subhanallahu wa ta'ala halalkan melalui lisan NabiNya, hal itu halal sampai hari kiamat, dan apa-apa yang diharamkan melalui lisan NabiNya, hal itu haram sampai hari kiamat. Ketahuilah bahwasannya aku tidak dapat memutuskan, tetapi aku hanya bisa melaksanakan, aku tidak membuat amalan baru\/bid`ah, tetapi aku hanyalah muttabi` (seorang pengikut sunah), aku tidaklah orang yang terbaik dari kalian semua, akan tetapi aku adalah orang yang paling berat bebannya dari kamu semua, dan seseorang dari makhluk Allah subhanallahu wa ta'ala tidak berhak ditaati dalam hal maksiat kepada Allah subhanallahu wa ta'ala, ketahuilah apakah aku telah memperdengarkan (kepada kalian)?\""
            },
            {
                "number": 292,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامِ بْنِ حُجَيْرٍ قَالَ كَانَ طَاوُسٌ يُصَلِّي رَكْعَتَيْنِ بَعْدَ الْعَصْرِ فَقَالَ لَهُ ابْنُ عَبَّاسٍ اتْرُكْهُمَا قَالَ إِنَّمَا نُهِيَ عَنْهَا أَنْ تُتَّخَذُ سُلَّمًا قَالَ ابْنُ عَبَّاسٍ فَإِنَّهُ قَدْ نُهِيَ عَنْ صَلَاةٍ بَعْدَ الْعَصْرِ فَلَا أَدْرِي أَتُعَذَّبُ عَلَيْهَا أَمْ تُؤْجَرُ لِأَنَّ اللَّهَ يَقُولُ { وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمْ الْخِيَرَةُ مِنْ أَمْرِهِمْ } قَالَ سُفْيَانُ تُتَّخَذَ سُلَّمًا يَقُولُ يُصَلِّي بَعْدَ الْعَصْرِ إِلَى اللَّيْلِ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id] telah mencertitakan kepada kami [Sufyan bin 'Uyainah] dari [Hisyam bin Hujair] ia berkata: \"Thawus pernah sholat dua rakaat setelah (selesai) sholat Ashr, lalu [Ibnu Abbas] berkata kepadanya: 'Tinggalkanlah dua rakaat tersebut', ia (Thawus) berkata: 'Yang dilarang adalah jika menjadikannya sebagai sullaman, Ibnu Abbas berkata: 'Sesungguhnya telah dilarang sholat setelah Ashr, aku tidak tahu apakah (dengannya) kamu disiksa atasnya atau diberi pahala, karena Allah subhanallahu wa ta'ala telah berfirman: \"WA MAA KAANA LI MU`MININ WA LAA MU`MINATIN IDZAA QADLALLAHU WA RASUULUHU AMRAN AN YAKUNA LAHUMUL KHIYARATU MIN AMRIHIM\" (Dan tidaklah patut bagi laki-laki yang mu`min dan tidak pula bagi perempuan yang mu`min, Apabila Allah subhanallahu wa ta'ala dan RasulNya telah menetapkan suatu ketetapan, akan ada bagi mereka pilihan yang lain tentang urusan mereka) -Qs. Al Ahzab: 36-. Sufyan berkata: 'Yang dimaksud dengan kata sullaman adalah melaksanakan sholat setelah ashr sampai malam' \". "
            },
            {
                "number": 293,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ مُجَالِدٍ عَنْ عَامِرٍ عَنْ جَابِرٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنُسْخَةٍ مِنْ التَّوْرَاةِ فَقَالَ يَا رَسُولَ اللَّهِ هَذِهِ نُسْخَةٌ مِنْ التَّوْرَاةِ فَسَكَتَ فَجَعَلَ يَقْرَأُ وَوَجْهُ رَسُولِ اللَّهِ يَتَغَيَّرُ فَقَالَ أَبُو بَكْرٍ ثَكِلَتْكَ الثَّوَاكِلُ مَا تَرَى مَا بِوَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَظَرَ عُمَرُ إِلَى وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَغَضَبِ رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ بَدَا لَكُمْ مُوسَى فَاتَّبَعْتُمُوهُ وَتَرَكْتُمُونِي لَضَلَلْتُمْ عَنْ سَوَاءِ السَّبِيلِ وَلَوْ كَانَ حَيًّا وَأَدْرَكَ نُبُوَّتِي لَاتَّبَعَنِي",
                "id": "Tealah mengabarkan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Ibnu Numair] dari [Mujalid] dari ['Amir] dari [Jabir], bahwasanya Umar bin Al Khatthab pernah datang menemui Rasulullah sallallahu 'alaihi wa sallam dengan membawa satu salinan dari kitab Taurat, lalu ia berkata: 'Wahai Rasulullah sallallahu 'alaihi wa sallam?! Nabi tidak menyambutnya selain diam, Umar membacakan (Taurat) dan Rasulullah sallallahu 'alaihi wa sallam nampak berubah raut mukanya, lalu Abu Bakar berkata: 'TSAKILATKATTshallallahu 'alaihi wasallamAAKUL, apakah kamu tidak melihat perubahan wajah Rasulullah sallallahu 'alaihi wa sallam? Ketika Umar melihat perubahan wajah Rasulullah sallallahu 'alaihi wa sallam, ia berkata: 'Aku berlindung kepada Allah subhanallahu wa ta'ala dari kemarahan Allah subhanallahu wa ta'ala dan kemarahan RasulNya, kami rela Allah subhanallahu wa ta'ala sebagai Tuhan dan agama Islam sebagai agama, dan Muhammad sebagai Nabi'. Maka Rasulullah sallallahu 'alaihi wa sallam bersabda: 'Demi Dzat yang jiwa Muhammad dalam genggamanNya jika Musa ada diantara kalian semua lalu kalian mengikutinya dan meninggalkan aku, niscaya kalian akan tersesat dari jalan yang lurus, dan kalau sekiranya ia (Nabi Musa 'alaihissalam) masih hidup, dan ia dapati kenabianku, niscaya ia akan mengikutiku' \". "
            },
            {
                "number": 294,
                "arab": " حَدَّثَنَا قَبِيصَةُ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي رَبَاحٍ شَيْخٌ مِنْ آلِ عُمَرَ قَالَ رَأَى سَعِيدُ بْنُ الْمُسَيَّبِ رَجُلًا يُصَلِّي بَعْدَ الْعَصْرِ الرَّكْعَتَيْنِ يُكْثِرُ فَقَالَ لَهُ فَقَالَ يَا أَبَا مُحَمَّدٍ أَيُعَذِّبُنِي اللَّهُ عَلَى الصَّلَاةِ قَالَ لَا وَلَكِنْ يُعَذِّبُكَ اللَّهُ بِخِلَافِ السُّنَّةِ",
                "id": "Telah menceritakan kepada kami [Qabishah] telah mengabarkan kepada kami [Sufyan] dari [Abu Rabah] -seorang tua dari keluarga umar-, ia berkata: \" [Sa'id bin Al Musayyab] pernah melihat seorang yang sholat dua rakaat setelah sholat Ashr, lalu ia bertanya kepadanya: 'Wahai Abu Muhammad, apakah Allah subhanallahu wa ta'ala akan mengadzabku atas sholat ini? ', ia (Sa'id bin Al Musayyab) menjawab: 'Tidak, akan tetapi Allah subhanallahu wa ta'ala akan mengadzabmu lantaran kamu menyelisihi sunah' \"."
            }
        ]
    }
}