{
    "status": true,
    "data": {
        "start": 883,
        "end": 1029,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 883,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي طَلْحَةُ بْنُ مُصَرِّفٍ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَوْسَجَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ سَوُّوا صُفُوفَكُمْ لَا تَخْتَلِفُ قُلُوبُكُمْ قَالَ وَكَانَ يَقُولُ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الصَّفِّ الْأَوَّلِ أَوْ الصُّفُوفِ الْأُوَلِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Thalhah bin Musharrif] ia berkata, saya mendengar ['Abdurrahman bin 'Ausajah] dari [Al Barra` bin 'Azib], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Luruskan barisan kalian, janganlah hati kalian berselisih.\" Al Barra` berkata, \"Beliau pernah bersabda: \"Sesungguhnya Allah dan Malaikat-Nya mengucapkan shalawat kepada shaf yang pertama.\""
            },
            {
                "number": 884,
                "arab": " أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عِرْبَاضِ بْنِ سَارِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَغْفِرُ لِلصَّفِّ الْأَوَّلِ ثَلَاثًا وَلِلصَّفِّ الثَّانِي مَرَّةً أَخْبَرَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى الْأَشْيَبُ عَنْ شَيْبَانَ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ عِرْبَاضِ بْنِ سَارِيَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Muhammad bin Ibrahim] dari [Khalid bin Ma'dan] dari ['Irbadh bin Sariyah], bahwa Rasulullah shallallahu 'alaihi wasallam memintakan ampunan untuk shaf yang pertama sebanyak tiga kali, dan untuk shaf yang kedua sebanyak satu kali.\" Telah mengabarkan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Al Hasan bin Musa Al Asyyab] dari [Syaiban] dari [Yahya] dari [Muhammad bin Ibrahim] dari [Khalid bin Ma'dan] dari [Jubair bin Nufair] dari ['Irbadh bin Sariyah] dari Nabi shallallahu 'alaihi wasallam sama seperti itu.\""
            },
            {
                "number": 885,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ مَنَاكِبَنَا فِي الصَّلَاةِ وَيَقُولُ لَا تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ لِيَلِيَنِّي مِنْكُمْ أُولُو الْأَحْلَامِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ قَالَ أَبُو مَسْعُودٍ فَأَنْتُمْ الْيَوْمَ أَشَدُّ اخْتِلَافًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari ['Umarah bin 'Umair] dari [Abu Ma'mar] dari [Abu Mas'ud Al Anshari] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengusap pundak kami ketika hendak melakukan sholat, lalu bersabda: \"Janganlah kalian berselisih sehingga hati kalian pun berselisih. Hendaknya yang menempati posisi setelahku di antara kalian adalah orang-orang yang sabar dan berakal, kemudian orang yang setelahnya, kemudian orang yang setelahnya.\" Abu Mas'ud berkata, \"Hari ini perselisihan kalian lebih nampak.\" "
            },
            {
                "number": 886,
                "arab": " أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ خَالِدٍ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَلِيَنِّي مِنْكُمْ أُولُو الْأَحْلَامِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ وَلَا تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ وَإِيَّاكُمْ وَهَوْشَاتِ الْأَسْوَاقِ",
                "id": "Telah mengabarkan kepada kami [Zakaria bin 'Adi] telah menceritakan kepada kami [Yazid bin Zurai'] dari [Khalid] dari [Abu Ma'syar] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya yang menempati posisi setelahku di antara kalian adalah orang-orang yang sabar dan berakal, kemudian orang yang setelahnya, kemudian orang yang setelahnya. Janganlah kalian berselisih sehingga hati kalian pun berselisih, dan jauhilah perselisihan dan kekacauan di pasar.\""
            },
            {
                "number": 887,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وَشَرُّهَا أَوَّلُهَا",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari ['Ajlan] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik shaf laki-laki adalah yang paling pertama dan yang paling buruk adalah yang paling terakhir. Dan sebaik-baik shaf wanita adalah yang paling terakhir dan yang paling buruk adalah yang paling pertama.\""
            },
            {
                "number": 888,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَصِيرٍ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ أَشَاهِدٌ فُلَانٌ قَالُوا لَا فَقَالَ أَشَاهِدٌ فُلَانٌ فَقَالُوا لَا لِنَفَرٍ مِنْ الْمُنَافِقِينَ لَمْ يَشْهَدُوا الصَّلَاةَ فَقَالَ إِنَّ هَاتَيْنِ الصَّلَاتَيْنِ أَثْقَلُ الصَّلَاةِ عَلَى الْمُنَافِقِينَ وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لَأَتَوْهُمَا وَلَوْ حَبْوًا قَالَ أَبُو مُحَمَّد عَبْدُ اللَّهِ بْنُ أَبِي بَصِيرٍ قَالَ حَدَّثَنِي أَبِي عَنْ أُبَيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَمِعْتُهُ مِنْ أُبَيٍّ أَخْبَرَنَا أَبُو غَسَّانَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَصِيرٍ عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ خَالِدِ بْنِ مَيْمُونٍ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَصِيرٍ عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Abdullah bin Abu Bashir] dari [Ubai bin Ka'b] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat subuh, kemudian menghadap kepada kami dengan wajahnya seraya mengatakan: \"Apakah Fulan hadir?\" Mereka mengatakan, \"Tidak.\" Lalu beliau bersabda lagi: \"Apakah Fulan hadir?\" Mereka menjawab, \"Tidak.\" Yaitu beberapa orang-orang Munafik yang tidak ikut menghadiri sholat. Kemudian beliau bersabda: \"Sesungguhnya dua sholat ini (yaitu Subuh dan Isya`) paling berat bagi orang-orang munafik, seandainya mereka mengetahui apa yang ada pada keduanya niscaya mereka mendatanginya walaupun dengan merangkak.\" Abu Muhammad [Abdullah bin Bashir] berkata; telah menceritakan kepadaku [Ayahku] dari [Ubai] dari Nabi shallallahu 'alaihi wasallam, dan saya mendengarnya dari Ubai.\" Telah mengabarkan kepada kami [Abu Ghassan] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Abdullah bin Abu Bashir] dari [Ayahnya] dari [Ubai bin Ka'b] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" Telah mengabarkan kami [Sa'id bin 'Amir] dari [Sa'id Abu 'Arubah] dari [Khalid bin Maimun] dari [Abu Ishaq] dari [Abdullah bin Abu Bashir] dari [Ayah] dari [Ubai bin Ka'b] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
            },
            {
                "number": 889,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ لَيْسَ مِنْ صَلَاةٍ أَثْقَلُ عَلَى الْمُنَافِقِينَ مِنْ صَلَاةِ الْعِشَاءِ الْآخِرَةِ وَصَلَاةِ الْفَجْرِ وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لَأَتَوْهُمَا وَلَوْ حَبْوًا",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Ar Rabi'] telah menceritakan kepada kami [Abu Al Ahwash] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya tidak ada sholat yang lebih berat bagi orang-orang munafik dari pada sholat Isya` dan sholat Subuh. Seandainya mereka mengetahui apa yang ada pada keduanya, niscaya mereka akan mendatanginya walaupun dengan merangkak.\""
            },
            {
                "number": 890,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ هَمَمْتُ أَنْ آمُرَ فِتْيَانِي فَيَجْمَعُوا حَطَبًا فَآمُرَ رَجُلًا يُصَلِّي بِالنَّاسِ ثُمَّ أُخَالِفَ إِلَى أَقْوَامٍ يَتَخَلَّفُونَ عَنْ هَذِهِ الصَّلَاةِ فَأُحَرِّقَ عَلَيْهِمْ بُيُوتَهُمْ لَوْ كَانَ عَرْقًا سَمِينًا أَوْ مُعَرَّقَتَيْنِ لَشَهِدُوهَا وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لَأَتَوْهُمَا وَلَوْ حَبْوًا",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu 'Ajlan] dari [Ayahnya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku telah berkeinginan memerintahkan beberapa pemuda untuk mengumpulkan kayu bakar, kemudian aku perintahkan seseorang agar memimpin orang-orang melaksanakan sholat. Kemudian aku menemui orang-orang yang tidak menghadiri sholat ini, lalu membakar rumah mereka. Seandainya salah seorang dari mereka mengetahui bahwa ia akan mendapatkan satu atau dua tulang yang berdaging banyak, niscaya mereka akan menghadirinya. Sungguh, seandainya mereka mengetahui apa yang ada pada keduanya (sholat isya dan subuh), niscaya mereka akan mendatanginya walaupun dengan merangkak.\""
            },
            {
                "number": 891,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ نَزَلَ بِضَجْنَانَ فِي لَيْلَةٍ بَارِدَةٍ فَأَمَرَ مُنَادِيًا فَنَادَى الصَّلَاةُ فِي الرِّحَالِ ثُمَّ أَخْبَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا كَانَ فِي سَفَرٍ فِي لَيْلَةٍ بَارِدَةٍ أَوْ الْمَطَرِ أَمَرَ مُنَادِيًا فَنَادَى الصَّلَاةُ فِي الرِّحَالِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar], bahwa ia pernah singgah di Dlajnan pada malam yang dingin, kemudian beliau memerintahkan seseorang agar mengumandangkan adzan seraya menyerukan, 'sholat di rumah! ' Kemudian ia mengabarkan bahwa Nabi shallallahu 'alaihi wasallam apabila sedang dalam perjalanan pada malam yang dingin, atau ketika turun hujan, maka beliau memerintahkan seseorang agar mengumandangkan adzan seraya menyerukan, 'sholat di rumah! \""
            },
            {
                "number": 892,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ قَالَ قُلْتُ لِسَعِيدِ بْنِ الْمُسَيَّبِ رَجُلٌ صَلَّى فِي بَيْتِهِ ثُمَّ أَدْرَكَ الْإِمَامَ وَهُوَ يُصَلِّي أَيُصَلِّي مَعَهُ قَالَ نَعَمْ قُلْتُ بِأَيَّتِهِمَا يَحْتَسِبُ قَالَ بِالَّتِي صَلَّى مَعَ الْإِمَامِ فَإِنَّ أَبَا هُرَيْرَةَ حَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الرَّجُلِ فِي الْجَمِيعِ تَزِيدُ عَلَى صَلَاتِهِ وَحْدَهُ بِضْعًا وَعِشْرِينَ جُزْءًا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Daud bin Abu Hindun] ia berkata, saya bertanya kepada [Sa'id bin Al Musayyab], \"Ada seorang laki-laki telah melakukan sholat di rumahnya, kemudian ia menjumpai imam sedang melakukan sholat, apakah ia melakukan sholat bersamanya? Ia menjawab, \"Ya.\" Saya bertanya lagi, \"sholat manakah yang ia hitung? Ia menjawab, \"sholat yang ia lakukan bersama imam, karena sesungguhnya [Abu Hurairah] telah menceritakan kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholatnya seorang laki-laki dalam berjama'ah lebih utama dengan sholat yang ia kerjakan sendirian dengan dua puluh sekian derajat.\" "
            },
            {
                "number": 893,
                "arab": " أَخْبَرَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَلَى صَلَاتِهِ وَحْدَهُ سَبْعًا وَعِشْرِينَ دَرَجَةً",
                "id": "Telah mengabarkan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] telah menceritakan kepadaku [Nafi'] dari [Abdullah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholatnya seorang laki-laki dalam jama'ah melebihi sholatnya yang dilakukan sendirian sebanyak dua puluh tujuh derajat.\""
            },
            {
                "number": 894,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَأْذَنَتْ أَحَدَكُمْ زَوْجَتُهُ إِلَى الْمَسْجِدِ فَلَا يَمْنَعْهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepadaku [Az Zuhri] dari [Salim] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila isteri salah seorang dari kalian meminta izin untuk pergi ke masjid, maka janganlah ia melarangnya.\""
            },
            {
                "number": 895,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ وَلْيَخْرُجْنَ إِذَا خَرَجْنَ تَفِلَاتٍ أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو بِإِسْنَادِ هَذَا الْحَدِيثِ قَالَ قَالَ سَعِيدُ بْنُ عَامِرٍ التَّفِلَةُ الَّتِي لَا طِيبَ لَهَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melarang para wanita untuk menuju ke masjid, hendaklah mereka keluar jika tidak memakai minyak wangi.\" Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Muhammad bin 'Amru] dengan sanad hadits ini. Ia berkata, [Sa'id bin 'Amir] berkata, \"At tafilah adalah wanita yang tidak memakai minyak wangi.\" "
            },
            {
                "number": 896,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وُضِعَ الْعَشَاءُ وَحَضَرَتْ الصَّلَاةُ فَابْدَءُوا بِالْعَشَاءِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Hisyam] dari [Ayahnya] dari [Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila makan malam telah dihidangkan lalu hadir waktu sholat, maka dahulukan makan malam.\""
            },
            {
                "number": 897,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ وَسُلَيْمَانُ بْنُ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا حَضَرَ الْعَشَاءُ وَأُقِيمَتْ الصَّلَاةُ فَابْدَءُوا بِالْعَشَاءِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dan [Sulaiman bin Katsir] dari [Az Zuhri] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila makan malam telah sedia, lalu sholat dikumandangkan maka mulailah dengan makan malam.\" "
            },
            {
                "number": 898,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَتَيْتُمْ الصَّلَاةَ فَلَا تَأْتُوهَا تَسْعَوْنَ وَأْتُوهَا تَمْشُونَ وَعَلَيْكُمْ السَّكِينَةُ فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا فَاتَكُمْ فَأَتِمُّوا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika kalian datang untuk melakukan sholat maka janganlah kalian mendatanginya dengan berlari, datangilah sholat dengan berjalan kaki, dan hendaknya kalian bersikap tenang. Laksanakanlah sholat yang kalian dapatkan dan sempurnakanlah sholat yang kalian tertinggal.\" "
            },
            {
                "number": 899,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَيْتُمْ الصَّلَاةَ فَعَلَيْكُمْ بِالسَّكِينَةِ فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا سُبِقْتُمْ فَأَتِمُّوا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syaiban] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian mendatangi sholat maka datangilah dengan tenang, laksanakanlah sholat yang kalian dapatkan dan sempurnakanlah apa yang kalian tertinggal.\" "
            },
            {
                "number": 900,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ كَانَ رَجُلٌ بِالْمَدِينَةِ لَا أَعْلَمُ بِالْمَدِينَةِ مَنْ يُصَلِّي إِلَى الْقِبْلَةِ أَبْعَدَ مَنْزِلًا مِنْ الْمَسْجِدِ مِنْهُ وَكَانَ يَشْهَدُ الصَّلَوَاتِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ لَهُ لَوْ ابْتَعْتَ حِمَارًا تَرْكَبُهُ فِي الرَّمْضَاءِ وَالظَّلْمَاءِ قَالَ وَاللَّهِ مَا يَسُرُّنِي أَنَّ مَنْزِلِي بِلِزْقِ الْمَسْجِدِ فَأُخْبِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ يَا رَسُولَ اللَّهِ كَيْمَا يُكْتَبَ أَثَرِي وَخُطَايَ وَرُجُوعِي إِلَى أَهْلِي وَإِقْبَالِي وَإِدْبَارِي أَوْ كَمَا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْطَاكَ اللَّهُ ذَلِكَ كُلَّهُ وَأَعْطَاكَ مَا احْتَسَبْتَ أَجْمَعَ أَوْ كَمَا قَالَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [At Taimi] dari [Abu Utsman] dari [Ubai bin Ka'b] ia berkata, \"Di Madinah ada seorang laki-laki, dan aku tidak mengetahui di kota Madinah ada orang yang sholat menghadap kiblat, rumahnya paling jauh dari masjid kecuali dia. Ia selalu menghadiri sholat bersama Rasulullah shallallahu 'alaihi wasallam. Kemudian ada yang mengatakan kepadanya, \"Sekiranya engkau membeli seekor keledai hingga engkau bisa menungganginya melewati gurun dan gelapnya malam, maka itu akan lebih baik.\" Laki-laki itu lalu berkata, \"Demi Allah, bukan berarti aku senang jika rumahku dekat dengan masjid.\" Maka dikabarkanlah hal itu kepada Nabi shallallahu 'alaihi wasallam, sehingga beliau bertanya kepada orang itu mengenai hal tersebut. Laki-laki itu lalu berkata, \"Wahai Rasulullah, agar setiap jejak langkahku saat pergi dan kembali kepada keluargaku ditulis sebagai pahala.\" Atau sebagaimana yang ia katakan. Lalu Rasulullah shallallahu 'alaihi wasallam pun bersabda: 'Semoga Allah memberimu semua itu dan memberikan kepadamu seluruh pahala yang engkau harapkan.' Atau sebagaimana yang beliau katakan.\" "
            },
            {
                "number": 901,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو زُبَيْدٍ هُوَ عَبْثَرُ بْنُ الْقَاسِمِ عَنْ حُصَيْنٍ عَنْ هِلَالِ بْنِ يَسَافٍ قَالَ أَخَذَ بِيَدِي زِيَادُ بْنُ أَبِي الْجَعْدِ فَأَقَامَنِي عَلَى شَيْخٍ مِنْ بَنِي أَسَدٍ يُقَالُ لَهُ وَابِصَةُ بْنُ مَعْبَدٍ فَقَالَ حَدَّثَنِي هَذَا وَالرَّجُلُ يَسْمَعُ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ صَلَّى خَلْفَهُ رَجُلٌ وَلَمْ يَتَّصِلْ بِالصُّفُوفِ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعِيدَ الصَّلَاةَ قَالَ أَبُو مُحَمَّد كَانَ أَحْمَدُ بْنُ حَنْبَلٍ يُثْبِتُ حَدِيثَ عَمْرِو بْنِ مُرَّةَ وَأَنَا أَذْهَبُ إِلَى حَدِيثِ يَزِيدَ بْنِ زِيَادِ بْنِ أَبِي الْجَعْدِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Zubaid] -yaitu 'Abtsar bin Al Qasim- dari [Hushain] dari [Hilal bin Yasaf] ia berkata; [Ziyad bin Abu Al Ja'd] menggandeng tanganku dan membawaku kepada orang yang telah tua dari Bani Asad yang dipanggil dengan nama [Wabishah bin Ma'bad], Kemudian ia berkata, \"Orang ini (Wabishah) telah menceritakan kepadaku -dan orang tersebut mendengar- bahwa ia melihat Rasulullah shallallahu 'alaihi wasallam yang dibelakangnya ada seorang laki-laki melaksanakan sholat dan tidak masuk ke dalam barisan (sholat sendirian). Lalu Rasulullah shallallahu 'alaihi wasallam memerintahkan agar dia mengulangi sholat.\" Abu Muhammad berkata, \"Ahmad bin Hanbal menetapkan hadits 'Amru bin Murrah, sedangkan saya berpendapat dengan hadits Yazid bin Ziyad bin Abu Al Ja'd.\" "
            },
            {
                "number": 902,
                "arab": " أَخْبَرَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ حَدَّثَنَا يَزِيدُ بْنُ زِيَادٍ عَنْ عُبَيْدِ بْنِ أَبِي الْجَعْدِ عَنْ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ وَابِصَةَ بْنِ مَعْبَدٍ أَنَّ رَجُلًا صَلَّى خَلْفَ الصُّفُوفِ وَحْدَهُ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعِيدَ قَالَ أَبُو مُحَمَّد أَقُولُ بِهَذَا",
                "id": "Telah mengabarkan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Daud] telah menceritakan kepada kami [Yazid bin Ziyad] dari ['Ubaid bin Abu Al Ja'd] dari [Ziyad bin Abu Al Ja'd] dari [Wabishah bin Ma'bad], bahwa ada seorang laki-laki sholat di belakang shaf sendirian, lalu Nabi shallallahu 'alaihi wasallam memerintahkan dia agar mengulangi sholatnya.\" Abu Muhammad berkata, \"Saya berpendapat dengan hal ini.\" "
            },
            {
                "number": 903,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ جَدَّتَهُ مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِطَعَامٍ صَنَعَتْهُ فَأَكَلَ ثُمَّ قَالَ قُومُوا فَلِأُصَلِّيَ بِكُمْ قَالَ أَنَسٌ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدْ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ فَنَضَحْتُهُ بِمَاءٍ فَقَامَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَفَفْتُ أَنَا وَالْيَتِيمُ وَرَاءَهُ وَالْعَجُوزُ وَرَاءَنَا فَصَلَّى لَنَا رَكْعَتَيْنِ ثُمَّ انْصَرَفَ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik], bahwa neneknya, Mulaikah, mengundang Rasulullah shallallahu 'alaihi wasallam untuk menyantap makanan yang telah ia buat. Beliau kemudian memakannya dan bersabda: \"Berdirilah sehingga aku melakukan sholat bersama kalian.\" Anas berkata, \"Lalu saya berdiri menuju tikar kami yang telah menghitam karena telah lama dipakai, kemudian saya memercikinya dengan air. Rasulullah shallallahu 'alaihi wasallam lantas berdiri, lalu saya dan seorang anak yatim membuat shaf di belakang beliau, sedangkan wanita tua di belakang kami. Lalu beliau melakukan sholat bersama kami dua rakaat kemudian pergi.\" "
            },
            {
                "number": 904,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورِ بْنِ زَاذَانَ عَنْ الْوَلِيدِ أَبِي بِشْرٍ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُومُ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنْ الظُّهْرِ قَدْرَ ثَلَاثِينَ آيَةً وَفِي الْأُخْرَيَيْنِ عَلَى قَدْرِ النِّصْفِ مِنْ ذَلِكَ وَفِي الْعَصْرِ عَلَى قَدْرِ الْأُخْرَيَيْنِ مِنْ الظُّهْرِ وَفِي الْأُخْرَيَيْنِ عَلَى قَدْرِ النِّصْفِ مِنْ ذَلِكَ أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنْ الْوَلِيدِ أَبِي بِشْرٍ عَنْ أَبِي الصِّدِّيقِ عَنْ أَبِي سَعِيدٍ بِنَحْوِهِ وَزَادَ قَدْرَ قِرَاءَةِ الم تَنْزِيلُ السَّجْدَةِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hammad] telah menceritakan kepada kami [Abu 'Uwanah] dari [Manshur bin Zadan] dari [Al Walid Abu Bisyr] dari [Abu Ash Shiddiq An Naji] dari [Abu Sa'id], bahwa Nabi shallallahu 'alaihi wasallam berdiri pada dua rakaat pertama sholat zhuhur kira-kira sekadar bacaan tiga puluh ayat, dan pada dua dua rakaat yang lainnya kira-kira setengah dari yang pertama. Sedangkan pada sholat asar seukuran dua rakaat terakhir dari sholat zhuhur, dan pada dua rakaat yang terakhir setengah dari itu.\" Telah mengabarkan kepada kami ['Amru bin 'Aun] telah menceritakan kepada kami [Husyaim] dari [Manshur] dari [Al Walid Abu Bisyr] dari [Abu Ash Shiddiq] dari [Abu Sa'id] sama seperti itu. Hanya ia menambahkan, \"Seukuran bacaan surat As Sajdah.\""
            },
            {
                "number": 905,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ بِالسَّمَاءِ وَالطَّارِقِ وَالسَّمَاءِ ذَاتِ الْبُرُوجِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Hammad bin Salamah] dari [Simak bin Harb] dari [Jabir bin Samurah], bahwa Nabi shallallahu 'alaihi wasallam pada sholat zhuhur dan asar membaca surat Ath Thariq dan surat Al Buruj.\""
            },
            {
                "number": 906,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ بِأُمِّ الْقُرْآنِ وَبِسُورَتَيْنِ مَعَهَا فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنْ صَلَاةِ الظُّهْرِ وَصَلَاةِ الْعَصْرِ وَيُسْمِعُنَا الْآيَةَ أَحْيَانًا وَكَانَ يُطَوِّلُ فِي الرَّكْعَةِ الْأُولَى أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بِإِسْنَادِهِ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abdullah bin Abu Qatadah] dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam membaca Al Fatihah dan dua surat pada dua rakaat pertama sholat zhuhur dan asar. Terkadang beliau memperdengarkan bacaan ayat kepada kami, dan beliau memanjangkan bacaan pada rakaat pertama.\" Telah mengabarkan kepada kami [Abu 'Ashim] dari [Al Auza'i] dari [Yahya] dengan sanadnya sama seperti hadits itu.\" "
            },
            {
                "number": 907,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنْ صَلَاةِ الظُّهْرِ بِأُمِّ الْكِتَابِ وَبِسُورَتَيْنِ وَفِي الْأُخْرَيَيْنِ بِأُمِّ الْكِتَابِ وَكَانَ يُسْمِعُنَا الْآيَةَ وَكَانَ يُطِيلُ فِي الرَّكْعَةِ الْأُولَى مَا لَا يُطِيلُ فِي الثَّانِيَةِ وَهَكَذَا فِي صَلَاةِ الْعَصْرِ وَهَكَذَا فِي صَلَاةِ الْغَدَاةِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hammam] telah menceritakan kepada kami [Yahya bin Abu Katsir] telah menceritakan kepada kami [Abdullah bin Abu Qatadah] bahwa [Ayahnya] telah menceritakan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam pada dua rakaat pertama sholat zhuhur membaca surat Al Fatihah dan dua surat yang lain, sedangkan pada dua rakaat yang terakhir membaca surat Al Fatihah saja. Terkadang beliau memperdengarkan bacaan ayat kepada kami, beliau juga memanjangkan bacaan pada rakaat pertama yang tidak beliau panjangkan pada rakaat yang kedua. Seperti inilah beliau melakukannya pada sholat asar dan sholat subuh.\" "
            },
            {
                "number": 908,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ أَنَّهَا سَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْمَغْرِبِ بِالْمُرْسَلَاتِ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas] dari [Ummu Al Fadll], bahwa ia mendengar Nabi shallallahu 'alaihi wasallam membaca surat Al Mursalat saat melaksanakan sholat Maghrib.\" "
            },
            {
                "number": 909,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْمَغْرِبِ بِالطُّورِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Muhammad bin Jubair bin Muth'im] dari [Ayahnya], bahwa ia mendengar Nabi shallallahu 'alaihi wasallam membaca surat Ath Thuur dalam sholat Maghrib.\""
            },
            {
                "number": 910,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ مُعَاذًا كَانَ يُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ يَأْتِي قَوْمَهُ فَيُصَلِّي بِهِمْ فَجَاءَ ذَاتَ لَيْلَةٍ فَصَلَّى الْعَتَمَةَ وَقَرَأَ الْبَقَرَةَ فَجَاءَ رَجُلٌ مِنْ الْأَنْصَارِ فَصَلَّى ثُمَّ ذَهَبَ فَبَلَغَهُ أَنَّ مُعَاذًا يَنَالُ مِنْهُ فَشَكَا ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمُعَاذٍ فَاتِنًا فَاتِنًا فَاتِنًا أَوْ فَتَّانًا فَتَّانًا فَتَّانًا ثُمَّ أَمَرَهُ بِسُورَتَيْنِ مِنْ وَسَطِ الْمُفَصَّلِ قَالَ أَبُو مُحَمَّد نَأْخُذُ بِهَذَا",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Syu'bah] dari ['Amru bin Dinar] dari [Jabir bin Abdullah], bahwa Mu'adz pernah melakukan sholat bersama Rasulullah shallallahu 'alaihi wasallam, kemudian ia datang kepada kaumnya dan melakukan sholat bersama mereka. Pada suatu malam ia datang dan melakukan sholat Isya` dengan membaca Surat Al Baqarah, kemudian seorang laki-laki Anshar datang melaksanakan sholat dan langsung pergi. Maka sampailah kepadanya kabar bahwa Mu'adz telah mencelanya, maka ia mengadukan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda kepada Mu'adz: \"Apakah engkau akan menjadi tukang fitnah? Apakah engkau akan menjadi tukang fitnah? Apakah engkau akan menjadi tukang fitnah?\" Kemudian beliau memerintahkan agar ia membaca dua surat yang sedang.\" Abu Muhammad berkata, \"Kami mengambil pendapat ini.\" "
            },
            {
                "number": 911,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَ سَمِعْتُ عَمِّي يَقُولُ إِنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعَهُ يَقْرَأُ فِي إِحْدَى الرَّكْعَتَيْنِ مِنْ الصُّبْحِ وَالنَّخْلَ بَاسِقَاتٍ قَالَ شُعْبَةُ وَسَأَلْتُهُ مَرَّةً أُخْرَى قَالَ سَمِعْتُهُ يَقْرَأُ بْ ق",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari [Ziyad bin 'Alqamah] ia berkata; Saya mendengar [Pamanku] berkata, bahwa ia pernah melakukan sholat bersama Nabi shallallahu 'alaihi wasallam. Ia mendengar beliau membaca: 'WAN NAKHLA BAASIQAATIN (dan pohon kurma yang tinggi-tinggi…) (Qs. Qaaf: 10) pada salah satu rakaat sholat Subuh.\" Syu'bah berkata, \"Sekali waktu aku bertanya lagi kepadanya, lalu ia berkata, 'Saya mendengar beliau membaca surat Qaaf.\" "
            },
            {
                "number": 912,
                "arab": " أَخْبَرَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ قُطْبَةَ بْنِ مَالِكٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْفَجْرِ فِي الرَّكْعَةِ الْأُولَى وَالنَّخْلَ بَاسِقَاتٍ لَهَا طَلْعٌ نَضِيدٌ",
                "id": "Telah mengabarkan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Ziyad bin 'Alqamah] dari [Quthbah bin Malik] ia berkata, \"Saya mendengar Nabi shallallahu 'alaihi wasallam pada rakaat pertama sholat Subuh membaca: 'WAN NAKHLA BAASIQAATIN LAHAA THAL'UN NADHIID (dan pohon kurma yang tinggi-tinggi yang mempunyai mayang yang bersusun-susun) ' (Qs. Qaaf: 10)."
            },
            {
                "number": 913,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ الْوَلِيدِ بْنِ سَرِيعٍ عَنْ عَمْرِو بْنِ حُرَيْثٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الصُّبْحِ إِذَا الشَّمْسُ كُوِّرَتْ فَلَمَّا انْتَهَى إِلَى هَذِهِ الْآيَةِ { وَاللَّيْلِ إِذَا عَسْعَسَ } جَعَلْتُ أَقُولُ فِي نَفْسِي مَا اللَّيْلُ إِذَا عَسْعَسَ أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا مِسْعَرٌ عَنْ الْوَلِيدِ عَنْ عَمْرِو بْنِ حُرَيْثٍ بِنَحْوِهِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Al Mas'udi] dari [Al Walid bin Sari'] dari ['Amru bin Huraits], bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam pada sholat Subuh membaca: IDZASY SYAMSU KUWWIRAT kemudian setelah sampai pada ayat WALLAILI IDZAA 'AS'AS (demi malam apabila telah hampir meninggalkan gelapnya) (Qs. At Takwir: 17), maka saya berkata dalam hati, 'Apakah malam yang apabila telah hampir meninggalkan gelapnya itu?.\" Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Mis'ar] dari [Al Walid] dari ['Amru bin Huraits] seperti hadits tersebut.\" "
            },
            {
                "number": 914,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ حَدَّثَنَا عَوْفٌ عَنْ سَيَّارِ بْنِ سَلَامَةَ قَالَ دَخَلْتُ مَعَ أَبِي عَلَى أَبِي بَرْزَةَ الْأَسْلَمِيِّ وَهُوَ عَلَى عِلْوٍ مِنْ قَصَبٍ فَسَأَلَهُ أَبِي عَنْ وَقْتِ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَانَ يُصَلِّي الْهَجِيرَ الَّتِي تَدْعُونَ الظُّهْرَ إِذَا دَحَضَتْ الشَّمْسُ وَكَانَ يُصَلِّي الْعَصْرَ ثُمَّ يَنْطَلِقُ أَحَدُنَا إِلَى أَهْلِهِ فِي أَقْصَى الْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ قَالَ وَنَسِيتُ مَا ذَكَرَ فِي الْمَغْرِبِ وَكَانَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ مِنْ صَلَاةِ الْعِشَاءِ الَّتِي تَدْعُونَ الْعَتَمَةَ وَكَانَ يَنْصَرِفُ مِنْ صَلَاةِ الصُّبْحِ وَالرَّجُلُ يَعْرِفُ جَلِيسَهُ وَكَانَ يَقْرَأُ فِيهَا مِنْ السِّتِّينَ إِلَى الْمِائَةِ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] telah menceritakan kepada kami ['Auf] dari [Sayyar bin Salamah] ia berkata, \"Saya bersama ayahku menemui [Abu Barzah Al Aslami] yang saat itu berada di atas loteng yang terbuat dari kayu. Ayahku lalu bertanya kepadanya tentang waktu sholat yang dilakukan Rasulullah shallallahu 'alaihi wasallam. Ia lalu menjawab, \"Beliau melakukan sholat siang hari yang kalian sebut zhuhur saat matahari telah bergeser ke Barat, dan beliau melakukan sholat asar saat salah seorang dari kami menemui keluarganya di ujung Madinah, sementara matahari dalam keadaan putih dan sangat panas -Sayyar berkata, 'Dan saya lupa apa yang ia sebutkan mengenai sholat Maghrib-. Dan beliau senang mengakhirkan sholat Isya` yang kalian sebut 'Atamah. Beliau beranjak dari sholat Subuh ketika seseorang mengetahui siapa orang yang duduk di sebelahnya, dan pada sholat tersebut (subuh) beliau membaca antara enam puluh hingga seratus ayat.\" "
            },
            {
                "number": 915,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ خَلِيلٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ أَخْبَرَنَا الْأَعْمَشُ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ وَقَدْ رَفَعُوا أَبْصَارَهُمْ فِي الصَّلَاةِ فَقَالَ لَتَنْتَهُنَّ أَوْ لَا تَرْجِعُ إِلَيْكُمْ أَبْصَارُكُمْ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Khalil] telah menceritakan kepada kami [Ali bin Mushir] telah mengabarkan kepada kami [Al A'masy] dari [Al Musayyab bin Rafi'] dari [Tamim bin Tharafah] dari [Jabir bin Samurah] ia berkata, \"Nabi shallallahu 'alaihi wasallam memasuki masjid, sementara para sahabat mengangkat pandangannya saat melaksanakan sholat, maka beliau pun bersabda: \"Sungguh, kalian segera berhenti dari perbuatan seperti itu atau pandangan kalian tidak akan kembali kepada kalian! \""
            },
            {
                "number": 916,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَا بَالُ أَقْوَامٍ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ فِي صَلَاتِهِمْ فَاشْتَدَّ قَوْلُهُ فِي ذَلِكَ حَتَّى قَالَ لَتَنْتَهُنَّ عَنْ ذَلِكَ أَوْ لَيَخْطَفَنَّ اللَّهُ أَبْصَارَكُمْ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Muhammad bin Bisyr] [Sa'id] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Kenapa orang-orang mengangkat pandangan mereka ke atas ketika melakukan sholat?\" Ucapan beliau dalam hal tersebut sangat keras hingga beliau bersabda: \"Sungguh, kalian segera berhenti dari perbuatan itu atau Allah membutakan pandangan kalian?\" "
            },
            {
                "number": 917,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا إِسْرَائِيلُ حَدَّثَنَا أَبُو يَعْفُورٍ الْعَبْدِيُّ حَدَّثَنِي مُصْعَبُ بْنُ سَعْدٍ قَالَ كَانَ بَنُو عَبْدِ اللَّهِ بْنِ مَسْعُودٍ إِذَا رَكَعُوا جَعَلُوا أَيْدِيَهُمْ بَيْنَ أَفْخَاذِهِمْ فَصَلَّيْتُ إِلَى جَنْبِ سَعْدٍ فَصَنَعْتُهُ فَضَرَبَ يَدِي فَلَمَّا انْصَرَفَ قَالَ يَا بُنَيَّ اضْرِبْ بِيَدَيْكَ رُكْبَتَيْكَ ثُمَّ فَعَلْتُهُ مَرَّةً أُخْرَى بَعْدَ ذَلِكَ بِيَوْمٍ فَصَلَّيْتُ إِلَى جَنْبِهِ فَضَرَبَ يَدِي فَلَمَّا انْصَرَفَ قَالَ كُنَّا نَفْعَلُ هَذَا وَأُمِرْنَا أَنْ نَضْرِبَ بِالْأَكُفِّ عَلَى الرُّكَبِ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ مُصْعَبٍ بِإِسْنَادِهِ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Israil] telah menceritakan kepada kami [Abu Ya'fur Al 'Abdi] telah menceritakan kepadaku [Mush'ab bin Sa'd] ia berkata, \"Anak-anak Abdullah bin Mas'ud apabila melakukan rukuk, maka mereka meletakkan tangan-tangan mereka di antara paha. Maka saat aku sholat di sisi [Sa'ad] dan aku melakukan hal tersebut, ia pun memukul tanganku. Selesai sholat ia berkata, \"Wahai anakku, letakkan kedua tanganmu pada kedua lututmu.\" Setelah berlalu, maka pada suatu hari saat aku sholat di sisinya dan aku tetap melakukan hal yang sama, ia memukul tanganku. Selesai sholat ia berkata, \"(Dahulu) kami melakukannya seperti ini, kami diperintahkan agar meletakkan telapak tangan di atas lutut.\" Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Israil] dari [Abu Ishaq] dari [Mush'ab] dengan sanadnya seperti hadits tersebut.\" "
            },
            {
                "number": 918,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ عَنْ سَالِمٍ الْبَرَّادِ قَالَ وَكَانَ أَوْثَقَ عِنْدِي مِنْ نَفْسِي قَالَ قَالَ لَنَا أَبُو مَسْعُودٍ الْأَنْصَارِيُّ أَلَا أُصَلِّي بِكُمْ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَكَبَّرَ وَرَكَعَ وَوَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ وَفَرَّجَ بَيْنَ أَصَابِعِهِ حَتَّى اسْتَقَرَّ كُلُّ شَيْءٍ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Atha' bin As Sa`ib] dari [Salim Al Barrad] -berkata; bagiku ia lebih tsiqah daripada diriku- ia berkata; [Abu Mas'ud Al Anshari] berkata kepada kami, \"Maukah kuperlihatkan kepada kalian bagaimana sholatnya Rasulullah shallallahu 'alaihi wasallam? Salim berkata, \"Kemudian ia bertakbir, lalu rukuk dan meletakkan kedua tangannya di atas kedua lututnya. Ia merenggangkan jari-jarinya hingga segala anggota badannya menempati posisinya.\" "
            },
            {
                "number": 919,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ حَدَّثَنَا مُوسَى بْنُ أَيُّوبَ حَدَّثَنِي عَمِّي إِيَاسُ بْنُ عَامِرٍ قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ يَقُولُ لَمَّا نَزَلَتْ { فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ } قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلُوهَا فِي رُكُوعِكُمْ فَلَمَّا نَزَلَتْ { سَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى } قَالَ اجْعَلُوهَا فِي سُجُودِكُمْ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Yazid Al Muqri`] telah menceritakan kepada kami [Musa bin Ayyub] telah menceritakan kepadaku pamanku [Iyas bin 'Amir] ia berkata, saya mendengar ['Uqbah bin 'Amir] berkata, \"Tatkala turun ayat: 'FASABBIH BISMIRABBIKAL 'AZHIIM (Maka bertasbihlah dengan (menyebut) nama Rabbmu Yang Maha Besar) ' (Qs.?Al Waaqi'ah: 74), Rasulullah shallallahu 'alaihi wasallam berkata kepada kami: \"Jadikanlah ayat tersebut ada dalam rukuk kalian.\" Kemudian setelah turun ayat: 'SABBIHISMA RABBIKAL A'LAA (Sucikanlah nama Tuhanmu Yang Maha Tinggi) ' (Qs.?Al A'laa: 1), beliau bersabda: \"Jadikanlah ayat tersebut ada dalam sujud kalian.\""
            },
            {
                "number": 920,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ عَنْ الْمُسْتَوْرِدِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ أَنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَكَانَ يَقُولُ فِي رُكُوعِهِ سُبْحَانَ رَبِّيَ الْعَظِيمِ وَفِي سُجُودِهِ سُبْحَانَ رَبِّيَ الْأَعْلَى وَمَا أَتَى عَلَى آيَةِ رَحْمَةٍ إِلَّا وَقَفَ عِنْدَهَا فَسَأَلَ وَمَا أَتَى عَلَى آيَةِ عَذَابٍ إِلَّا تَعَوَّذَ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Syu'bah] dari [Sulaiman] dari [Al Mustaurid] dari [Shilah bin Zufar] dari [Hudzaifah], bahwa ia pernah melaksanakan sholat bersama Nabi shallallahu 'alaihi wasallam pada suatu malam, dalam rukuknya beliau membaca: 'SUBHAANA RABBIYAL 'AZHIIM (Maha Suci Allah, Rabb yang Maha Agung), dan dalam sujudnya membaca: SUBHAANA RABBIYAL A'LAA (Maha Suci Allah, Rabb Yang Maha Tinggi). Dan tidaklah beliau membaca ayat yang berisi mengenai rahmat melainkan beliau berhenti padanya dan berdo'a, dan tidaklah beliau membaca ayat mengenai adzab melainkan beliau meminta perlindungan.\""
            },
            {
                "number": 921,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ عَبَّاسِ بْنِ سَهْلٍ قَالَ اجْتَمَعَ مُحَمَّدُ بْنُ مَسْلَمَةَ وَأَبُو أُسَيْدٍ وَأَبُو حُمَيْدٍ وَسَهْلُ بْنُ سَعْدٍ فَذَكَرُوا صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو حُمَيْدٍ أَنَا أَعْلَمُكُمْ بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فَكَبَّرَ وَرَفَعَ يَدَيْهِ ثُمَّ رَفَعَ يَدَيْهِ حِينَ كَبَّرَ لِلرُّكُوعِ ثُمَّ رَكَعَ وَوَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ كَأَنَّهُ قَابِضٌ عَلَيْهِمَا وَوَتَرَ يَدَيْهِ فَنَحَّاهُمَا عَنْ جَنْبَيْهِ وَلَمْ يُصَوِّبْ رَأْسَهُ وَلَمْ يُقْنِعْهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Abu 'Amir Al 'Aqadi] telah menceritakan kepada kami [Fulaih bin Sulaiman] dari [Abbas bin Sahl] ia berkata, \"Muhammad bin Maslamah, Abu Usaid, Abu Humaid, dan Sahl bin Sa'd berkumpul menjadi satu, kemudian mereka menyebutkan sholat Rasulullah shallallahu 'alaihi wasallam. [Abu Humaid] berkata, \"Saya adalah orang yang lebih mengetahui di antara kalian mengenai sholat Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam berdiri lalu takbir dan mengangkat kedua tangannya, kemudian kembali mengangkat kedua tangannya saat takbir untuk rukuk, kemudian beliau rukuk dan meletakkan kedua tangannya pada lutut, seolah-olah beliau menggenggam keduanya. Beliau meregangkan kedua tangan dan menjauhkannya dari kedua sisi badannya, tidak merendahkan kepala dan tidak mengangkatnya.\" "
            },
            {
                "number": 922,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ فَإِذَا رَكَعَ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَعَلَ مِثْلَ ذَلِكَ وَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ وَلَا يَفْعَلُ ذَلِكَ فِي السُّجُودِ أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ رَبَّنَا وَلَكَ الْحَمْدُ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Salim] dari [Ayahnya] ia berkata, \"Nabi shallallahu 'alaihi wasallam apabila memulai sholat beliau mengangkat kedua tangannya sejajar dengan kedua pundak, beliau juga akan melakukan seperti itu jika akan rukuk dan mengangkat kepala dari rukuk, sambil mengucapkan: 'SAMI'ALLAHU LIMAN HAMIDAH, ALLAHUMMA RABBANAA WA LAKAL HAMDU (Semoga Allah mendengar pujian orang yang memuji-Nya. Ya Allah Rabb kami, kepada-Mu lah semua pujian). Dan beliau tidak mengangkat kedua tangannya ketika akan bersujud.\" Telah mengabarkan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Malik bin Anas] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits tersebut. Hanya saja ia menyebutkan: 'RABBANAA WALAKAL HAMDU(Ya Rabb kami, kepada-Mu lah segala pujian).\""
            },
            {
                "number": 923,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ وَإِذَا قَالَ الْإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Apabila imam mengucapkan; 'SAMI'ALLAHU LIMAN HAMIDAH (Semoga Allah mendengar pujian orang yang memuji-Nya) maka ucapkanlah; 'RABBANAA WA LAKAL HAMDU (Ya Rabb kami, kepada-Mu lah segala pujian) \"."
            },
            {
                "number": 924,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ وَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya dijadikannya imam adalah agar ia diikuti, apabila ia bertakbir maka bertakbirlah, apabila ia rukuk maka rukuklah, apabila ia sujud maka sujudlah, apabila ia mengucapkan; 'SAMI'ALLAHU LIMAN HAMIDAH (Semoga Allah mendengar pujian orang yang memuji-Nya), maka ucapkanlah; 'RABBANAA LAKAL HAMDU (Ya Rabb kami, kepada-Mu lah segala pujian). Dan apabila ia melakukan sholat dengan berdiri maka sholatlah dengan berdiri, apabila ia melakukan sholat dengan duduk maka sholatlah dengan duduk semua.\" "
            },
            {
                "number": 925,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ عَنْ أَبِي مُوسَى أَنَّهُ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَنَا فَعَلَّمَنَا صَلَاتَنَا وَسَنَّ لَنَا سُنَّتَنَا قَالَ أَحْسَبُهُ قَالَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلْيَؤُمَّكُمْ أَحَدُكُمْ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَالَ { غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ } فَقُولُوا آمِينَ يُجِبْكُمْ اللَّهُ وَإِذَا كَبَّرَ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا فَإِنَّ الْإِمَامَ يَرْكَعُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ أَوْ قَالَ رَبَّنَا لَكَ الْحَمْدُ فَإِنَّ اللَّهَ قَالَ عَلَى لِسَانِ نَبِيِّهِ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Yunus bin Jubair] dari [Hiththan bin Abdullah Ar Raqasyi] dari [Abu Musa], bahwa ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami, lalu beliau mengajarkan sholat dan menetapkan sunah kami.\" Perawi berkata, \"Saya mengira beliau bersabda: \"Jika sholat telah dikumandangkan, maka hendaklah salah seorang dari kalian menjadi imam. Jika imam bertakbir maka bertakbirlah, jika ia mengucapkan; 'GHAIRIL MAGHDHUUBI 'ALAIHIM WA LADHDHAALLIIN (bukan (jalan) mereka yang dimurkai dan bukan (pula jalan) mereka yang sesat), maka ucapkanlah; AAMIIN (Semoga Allah mengabulkan). Sehingga Allah akan mengabulkan do'amu. Jika ia takbir dan rukuk maka takbir dan rukuklah kalian. Sesungguhnya imam melakukan rukuk sebelum kalian dan mengangkat kepala sebelum kalian.\" Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Saat rukuk yang itu sama kadarnya dengan saat rukuk yang itu. Dan jika ia mengucapkan; 'SAMI'ALLAHU LIMAN HAMIDAH (Semoga Allah mendengar pujian orang yang memuji-Nya) ', maka ucapkanlah; 'ALLAHUMMA RABBANAA LAKAL HAMDU (Ya Allah Rabb kami, kepada-Mu lah segala pujian) -atau beliau mengatakan- 'RABBANAA LAKAL HAMDU (Ya Rabb kami, kepada-Mu lah segala pujian). Sesungguhnya Allah berfirman melalui perantara lisan Nabi-Nya; 'SAMI'ALLAHU LIMAN HAMIDAH.\" "
            },
            {
                "number": 926,
                "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ عَطِيَّةَ بْنِ قَيْسٍ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ أَهْلَ الثَّنَاءِ وَالْمَجْدِ أَحَقُّ مَا قَالَ الْعَبْدُ وَكُلُّنَا لَكَ عَبْدٌ اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
                "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Sa'id bin Abdul Aziz] dari ['Athiyah bin Qais] dari [Qazarah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam apabila mengangkat kepala dari rukuk beliau mengucapkan: 'RABBANAA LAKAL HAMDU MIL AS SAMAAWAATI WA MIL Al ARDLI WA MIL A MAA SYI'TA MIN SYAI`IN BA'DU, AHLATS TSANAA`I WAL MAJDI AHAQQU MAA QAALAL 'ABDU WA KULLUNAA LAKA 'ABDUN. ALLAAHUMMA LAA MAANI'A LIMAA A'THAITA WA LAA MU'THIYA LIMAA MANA'TA WA LAA YANFA'U MINKAL JADDU.\""
            },
            {
                "number": 927,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ عَنْ عَمِّهْ الْمَاجِشُونَ عَنْ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَالْأَرْضِ وَمِلْءَ مَا بَيْنَهُمَا وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ قِيلَ لِعَبْدِ اللَّهِ تَأْخُذُ بِهِ قَالَ لَا وَقِيلَ لَهُ تَقُولُ هَذَا فِي الْفَرِيضَةِ قَالَ عَسَى وَقَالَ كُلُّهُ طَيِّبٌ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Abdul Aziz bin Abu Salamah] dari pamannya [Al Majisyun] dari [Al A'raj] dari ['ubaidhullah bin Abu Rafi'] dari [Ali bin Abu Thalib] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam apabila mengangkat kepala dari rukuk beliau mengucapkan: SAMI'ALLAAHU LIMAN HAMIDAH RABBANAA LAKAL HAMDU MIL AS SAMAAWAATI WA MIL Al ARDLI WA MIL`A MAA BAINAHUMAA WA MIL`A MAA SYI'TA MIN SYAI`IN BA'DU.\" Abdullah lalu ditanya, \"Apakah engkau mengambilnya? Ia berkata, \"Tidak.\" Ia ditanya lagi, \"Apakah engkau mengatakan hal ini dalam sholat fardlu? Ia menjawab, \"Mungkin. Dan semuanya adalah baik.\" "
            },
            {
                "number": 928,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ ابْنِ مُحَيْرِيزٍ عَنْ مُعَاوِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي قَدْ بَدَّنْتُ فَلَا تَسْبِقُونِي بِالرُّكُوعِ وَلَا بِالسُّجُودِ فَإِنِّي مَهْمَا أَسْبِقُكُمْ حِينَ أَرْكَعُ تُدْرِكُونِي حِينَ أَرْفَعُ وَمَهْمَا أَسْبِقُكُمْ حِينَ أَسْجُدُ تُدْرِكُونِي حِينَ أَرْفَعُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Muhammad bin 'Ajlan] dari [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz] dari [Mu'awiyah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku telah tua dan gemuk, maka janganlah kalian mendahuluiku melakukan rukuk dan sujud. Sesungguhnya bagaimanapun saya mendahului kalian ketika melakukan rukuk, kalian akan dapat mengejarku ketika aku mengangkat kepala dari rukuk, dan bagaimanapun saya mendahului kalian ketika sujud, kalian akan dapat mengejarku ketika aku mengangkat kepala dari sujud.\""
            },
            {
                "number": 929,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا يَخْشَى أَحَدُكُمْ أَوْ أَلَا يَخْشَى أَحَدُكُمْ إِذَا رَفَعَ رَأْسَهُ قَبْلَ الْإِمَامِ أَنْ يَجْعَلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ أَوْ صُورَتَهُ صُورَةَ حِمَارٍ",
                "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Ziyad] ia berkata, saya mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah salah seorang di antara kalian merasa takut Allah akan mengubah kepalanya menjadi kepala himar, atau bentuknya menjadi bentuk himar jika ia mengangkat kepalanya sebelum imam?\""
            },
            {
                "number": 930,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا زَائِدَةُ حَدَّثَنَا الْمُخْتَارُ بْنُ فُلْفُلٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَثَّهُمْ عَلَى الصَّلَاةِ وَنَهَاهُمْ أَنْ يَسْبِقُوهُ إِذَا كَانَ يَؤُمُّهُمْ بِالرُّكُوعِ وَالسُّجُودِ وَأَنْ يَنْصَرِفُوا قَبْلَ انْصِرَافِهِ مِنْ الصَّلَاةِ وَقَالَ إِنِّي أَرَاكُمْ مِنْ خَلْفِي وَأَمَامِي",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Zaidah] telah menceritakan kepada kami [Al Mukhtar bin Fulful] dari [Anas bin Malik], bahwa Nabi shallallahu 'alaihi wasallam menganjurkan mereka untuk melakukan sholat dan melarang mereka dari mendahului beliau saat menjadi imam. Yaitu ketika rukuk, sujud dan beranjak dari tempat sholat sebelum beliau beranjak pergi. Beliau bersabda: \"Aku bisa melihat kalian dari belakang sebagaimana aku melihat kalian dari depan.\""
            },
            {
                "number": 931,
                "arab": " أَخْبَرَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ طَاوُسًا يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍ قَالَ أُمِرَ نَبِيُّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةٍ وَأُمِرَ أَنْ لَا يَكُفَّ شَعَرًا وَلَا ثَوْبًا قَالَ شُعْبَةُ وَحَدَّثَنِيهِ مَرَّةً أُخْرَى قَالَ أُمِرْتُ بِالسُّجُودِ وَلَا أَكُفَّ شَعَرًا وَلَا ثَوْبًا",
                "id": "Telah mengabarkan kepada kami [Abu An Nadlr Hasyim Al Qasim] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Dinar] ia berkata, Saya mendengar [Thawus] menceritakan dari [Ibnu Abbas] ia berkata, \"Nabi kalian shallallahu 'alaihi wasallam telah diperintahkan agar sujud di atas tujuh anggota badan. Dan diperintahkan agar tidak menahan rambut dan baju.\""
            },
            {
                "number": 932,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ وَيَحْيَى بْنُ حَسَّانَ قَالَا حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةِ أَعْظُمٍ الْجَبْهَةِ قَالَ وُهَيْبٌ وَأَشَارَ بِيَدِهِ إِلَى أَنْفِهِ وَالْيَدَيْنِ وَالرُّكْبَتَيْنِ وَأَطْرَافِ الْقَدَمَيْنِ وَلَا نَكُفَّ الثِّيَابَ وَلَا الشَّعَرَ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] dan [Yahya bin Hassan] mereka berkata; telah menceritakan kepada kami [Wuhaib] ia berkata, telah menceritakan kepada kami [Ibnu Thawus] dari [Ayahnya] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Aku diperintahkan untuk sujud di atas tujuh tulang; kening.. [Wuhaib] menyebutkan, \"Beliau lalu menunjukkan dengan tangannya ke hidung, kedua tangan, kedua lutut, dan ujung telapak kaki. Dan kami tidak menahan kain dan rambut.\" "
            },
            {
                "number": 933,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ يَضَعُ رُكْبَتَيْهِ قَبْلَ يَدَيْهِ وَإِذَا نَهَضَ رَفَعَ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Syarik] dari ['Ashim bin Kulaib] dari [Ayahnya] dari [Wail bin Hujr] ia berkata, \"Saya melihat Rasulullah shallallahu 'alaihi wasallam apabila bersujud meletakkan kedua lutut sebelum ke dua tangan, dan apabila berdiri beliau mengangkat ke dua tangan sebelum kedua lutut.\""
            },
            {
                "number": 934,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَلَا يَبْرُكْ كَمَا يَبْرُكُ الْبَعِيرُ وَلْيَضَعْ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ قِيلَ لِعَبْدِ اللَّهِ مَا تَقُولُ قَالَ كُلُّهُ طَيِّبٌ وَقَالَ أَهْلُ الْكُوفَةِ يَخْتَارُونَ الْأَوَّلَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Muhammad bin Abdullah bin Al Hasan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian melakukan sholat maka janganlah ia sujud seperti unta menderum, hendaklah ia meletakkan kedua tangannya sebelum kedua lututnya.\" Abdullah ditanya, \"Apa pendapat anda?\" Ia menjawab, \"Semuanya baik.\" Dan ia berkata, \"Penduduk Kufah memilih yang pertama.\" "
            },
            {
                "number": 935,
                "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ وَسَعِيدُ بْنُ الرَّبِيعِ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَدِلُوا فِي الرُّكُوعِ وَالسُّجُودِ وَلَا يَبْسُطْ أَحَدُكُمْ ذِرَاعَيْهِ بِسَاطَ الْكَلْبِ",
                "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] dan [Sa'id bin Ar Rabi'] mereka berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] ia berkata, Saya mendengar [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seimbanglah saat kalian rukuk dan sujud, dan janganlah salah seorang di antara kalian membentangkan kedua sikunya seperti anjing\""
            },
            {
                "number": 936,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ أَبِيهِ عَنْ تَمِيمِ بْنِ مَحْمُودٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِبْلٍ الْأَنْصَارِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ افْتِرَاشِ السَّبُعِ وَنَقْرَةِ الْغُرَابِ وَأَنْ يُوطِنَ الرَّجُلُ الْمَكَانَ كَمَا يُوطِنُ الْبَعِيرُ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Abdul Hamid bin Ja'far] dari [Ayahnya] dari [Tamim bin Mahmud] dari ['Abdurrahman bin Syibl Al Anshari] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang membentangkan kedua siku layaknya binatang buas, sujud seperti burung gagak mematuk (tergesa-gesa), dan seorang laki-laki yang mengkhususkan tempat untuk sholat seperti seekor unta mengkhususkan tempat untuk menderum.\""
            },
            {
                "number": 937,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ الْعَلَاءِ بْنِ الْمُسَيَّبِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ طَلْحَةَ بْنِ يَزِيدَ الْأَنْصَارِيِّ عَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ بَيْنَ السَّجْدَتَيْنِ رَبِّ اغْفِرْ لِي فَقِيلَ لِعَبْدِ اللَّهِ تَقُولُ هَذَا قَالَ رُبَّمَا قُلْتُ وَرُبَّمَا سَكَتُّ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Al 'Ala` bin Al Musayyab] dari ['Amru bin Murrah] dari [Thalhah bin Yazid Al Anshari] dari [Hudzaifah], bahwa Nabi shallallahu 'alaihi wasallam di antara dua sujud mengucapkan: 'RABBIGHFIRLII (Ya Allah, ampunilah aku) \". Abdullah ditanya, \"Anda mengucapkan ini juga?\" Ia berkata, \"Terkadang aku mengucapkan dan terkadang diam.\" "
            },
            {
                "number": 938,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ سُلَيْمَانَ بْنِ سُحَيْمٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ كَشَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السِّتَارَةَ وَالنَّاسُ صُفُوفٌ خَلْفَ أَبِي بَكْرٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّهُ لَمْ يَبْقَ مِنْ مُبَشِّرَاتِ النُّبُوَّةِ إِلَّا الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ أَلَا إِنِّي نُهِيتُ أَنْ أَقْرَأَ رَاكِعًا أَوْ سَاجِدًا فَأَمَّا الرُّكُوعُ فَعَظِّمُوا رَبَّكُمْ وَأَمَّا السُّجُودُ فَاجْتَهِدُوا فِي الدُّعَاءِ فَقَمِنٌ أَنْ يُسْتَجَابَ لَكُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Sulaiman bin Suhaim] dari [Ibrahim bin Abdullah bin Ma'bad] dari [Ayahnya] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah membuka korden dan orang-orang sedang berbaris di belakang Abu Bakr, kemudian beliau bersabda: \"Wahai manusia, sesungguhnya tidak tersisa lagi kabar-kabar gembira kenabian selain mimpi yang baik yang dilihat oleh seorang muslim, atau beliau mengatakan, 'diperlihatkan kepadanya. Ketahuilah, aku dilarang membaca al-qur'an ketika sedang rukuk atau sujud. Jika rukuk maka agungkanlah Tuhan kalian, dan jika sujud maka bersungguh-sungguhlah dalam berdo'a karena lebih memungkinkan dikabulkan do'a kalian.\""
            },
            {
                "number": 939,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ وَإِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ سُلَيْمَانَ بْنِ سُحَيْمٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي نُهِيتُ أَنْ أَقْرَأَ وَأَنَا رَاكِعٌ أَوْ سَاجِدٌ فَأَمَّا الرُّكُوعُ فَعَظِّمُوا فِيهِ الرَّبَّ وَأَمَّا السُّجُودُ فَاجْتَهِدُوا فِي الدُّعَاءِ فَقَمِنٌ أَنْ يُسْتَجَابَ لَكُمْ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dan [Isma'il bin Ja'far] dari [Sulaiman bin Suhaim] dari [Ibraihim bin Abdullah bin Ma'bad bin Abbas] dari [Bapaknya] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku dilarang untuk membaca al-qur'an ketika sedang rukuk atau sujud. Jika rukuk maka agungkanlah Tuhan kalian, dan jika sujud maka bersungguh-sungguhlah dalam berdo'a karena lebih memungkinkan dikabulkan do'a kalian.\""
            },
            {
                "number": 940,
                "arab": " أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا الْأَعْمَشُ عَنْ عُمَارَةَ هُوَ ابْنُ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُجْزِئُ صَلَاةٌ لَا يُقِيمُ الرَّجُلُ فِيهَا صُلْبَهُ فِي الرُّكُوعِ وَالسُّجُودِ",
                "id": "Telah mengabarkan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Al A'masy] dari ['Umarah] -yaitu Ibnu 'Umair- dari [Abu Ma'mar] dari [Abu Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah sah sholat seseorang yang tidak meluruskan tulang punggungnya disaat rukuk dan sujud.\" "
            },
            {
                "number": 941,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْوَأُ النَّاسِ سَرِقَةً الَّذِي يَسْرِقُ صَلَاتَهُ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ يَسْرِقُ صَلَاتَهُ قَالَ لَا يُتِمُّ رُكُوعَهَا وَلَا سُجُودَهَا",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Al Walid bin Muslim] dari [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pencuri yang paling buruk adalah orang yang mencuri sholatnya.\" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana ia mencuri sholatnya?\" Beliau menjawab: \"Ia tidak menyempurnakan rukuk dan sujudnya.\" "
            },
            {
                "number": 942,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادٍ عَنْ أَبِيهِ عَنْ عَمِّهِ رِفَاعَةَ بْنِ رَافِعٍ وَكَانَ رِفَاعَةُ وَمَالِكُ ابْنَيْ رَافِعٍ أَخَوَيْنِ مِنْ أَهْلِ بَدْرٍ قَالَ بَيْنَمَا نَحْنُ جُلُوسٌ حَوْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ وَنَحْنُ حَوْلَهُ شَكَّ هَمَّامٌ إِذْ دَخَلَ رَجُلٌ فَاسْتَقْبَلَ الْقِبْلَةَ فَصَلَّى فَلَمَّا قَضَى الصَّلَاةَ جَاءَ فَسَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى الْقَوْمِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ فَرَجَعَ الرَّجُلُ فَصَلَّى وَجَعَلْنَا نَرْمُقُ صَلَاتَهُ لَا نَدْرِي مَا يَعِيبُ مِنْهَا فَلَمَّا قَضَى صَلَاتَهُ جَاءَ فَسَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى الْقَوْمِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ قَالَ هَمَّامٌ فَلَا أَدْرِي أَمَرَهُ بِذَلِكَ مَرَّتَيْنِ أَوْ ثَلَاثًا قَالَ الرَّجُلُ مَا أَلَوْتُ فَلَا أَدْرِي مَا عِبْتَ عَلَيَّ مِنْ صَلَاتِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا لَا تَتِمُّ صَلَاةُ أَحَدِكُمْ حَتَّى يُسْبِغَ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ عَزَّ وَجَلَّ فَيَغْسِلُ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَيَمْسَحُ بِرَأْسِهِ وَرِجْلَيْهِ إِلَى الْكَعْبَيْنِ ثُمَّ يُكَبِّرُ اللَّهَ وَيَحْمَدُهُ ثُمَّ يَقْرَأُ مِنْ الْقُرْآنِ مَا أَذِنَ اللَّهُ عَزَّ وَجَلَّ لَهُ فِيهِ ثُمَّ يُكَبِّرُ فَيَرْكَعُ فَيَضَعُ كَفَّيْهِ عَلَى رُكْبَتَيْهِ حَتَّى تَطْمَئِنَّ مَفَاصِلُهُ وَتَسْتَرْخِيَ وَيَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَيَسْتَوِي قَائِمًا حَتَّى يُقِيمَ صُلْبَهُ فَيَأْخُذَ كُلُّ عَظْمٍ مَأْخَذَهُ ثُمَّ يُكَبِّرُ فَيَسْجُدُ فَيُمَكِّنُ وَجْهَهُ قَالَ هَمَّامٌ وَرُبَّمَا قَالَ جَبْهَتَهُ مِنْ الْأَرْضِ حَتَّى تَطْمَئِنَّ مَفَاصِلُهُ وَتَسْتَرْخِيَ ثُمَّ يُكَبِّرُ فَيَسْتَوِي قَاعِدًا عَلَى مَقْعَدِهِ وَيُقِيمُ صُلْبَهُ فَوَصَفَ الصَّلَاةَ هَكَذَا أَرْبَعَ رَكَعَاتٍ حَتَّى فَرَغَ لَا تَتِمُّ صَلَاةُ أَحَدِكُمْ حَتَّى يَفْعَلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Ishaq bin Abdullah] dari [Ali bin Yahya bin Khallad] dari [Ayahnya] dari pamannya [Rifa'ah bin Rafi'] -Rifa'ah dan Malik adalah anak Rafi', dan keduanya termasuk ahli badar-. Ia berkata, \"Ketika kami sedang duduk-duduk di sekitar Rasulullah shallallahu 'alaihi wasallam, atau ketika Rasulullah shallallahu 'alaihi wasallam sedang duduk dan kami berada di sekitar beliau -Hammam merasa ragu-, tiba-tiba ada seorang laki-laki masuk, lalu menghadap kiblat dan mengerjakan sholat. Selesai sholat ia datang dan mengucapkan salam kepada Rasulullah shallallahu 'alaihi wasallam dan orang-orang. Lalu Rasulullah shallallahu 'alaihi wasallam mengatakan: \"Celaka kamu! Kembali dan kerjakanlah sholat, sesungguhnya engkau belum melakukan sholat.\" Maka orang tersebut kembali dan melakukan sholat, kami memperhatikan sholatnya dan tidak mengetahui apa yang beliau cela dari sholatnya tersebut. Selesai sholat ia ia kembali datang dan mengucapkan salam kepada Rasulullah shallallahu 'alaihi wasallam dan orang-orang. Lalu Rasulullah shallallahu 'alaihi wasallam mengatakan: \"Celaka kamu! Kembali dan kerjakanlah sholat, sesungguhnya kamu belum melakukan sholat.\" Hammam berkata, \"Saya tidak tahu beliau memerintahkan hal tersebut dua atau tiga kali. Orang itu akhirnya berkata, \"Saya tidak mengurangi dan tidak mengetahui apa yang anda cela atas sholatku.\" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Sesungguhnya tidaklah sempurna sholat salah seorang dari kalian hingga ia menyempurnakan wudlu sebagaimana yang Allah 'azza wajalla perintahkan. Ia cuci wajah dan kedua tangannya hingga kedua siku, mengusap kepala dan kedua kakinya hingga kedua mata kaki. Kemudian takbir dan memuji Allah, lalu membaca sebagian dari al-qur'an yang Allah 'azza wajalla izinkan padanya. Kemudian takbir dan rukuk, lalu ia letakkan kedua telapak tangannya di atas kedua lutut hingga persendiannya tenang dan rileks. Lalu membaca; SAMI'ALLAHU LIMAN HAMIDAHU(Semoga Allah mendengar pujian orangyang memuji-Nya) hingga tegak berdiri dan lurus tulang sulbinya. Dan setiap tulang persendiannya kembali ke tempatnya semula. Kemudian takbir, lalu sujud dan menempelkan wajahnya -Hammam berkata; terkadang beliau mengatakan 'wajahnya'- di tanah hingga persendiannya menjadi tenang dan rileks. Kemudian takbir hingga duduk dengan tegak di atas tempat duduknya, dan lurus tulang sulbinya.\" Beliau kemudian menyebutkan sifat sholat -empat rakaat- tersebut seperti ini hingga selesai. Dan tidaklah sempurna sholat salah seorang di antara kalian hingga melakukan hal tersebut.\" "
            },
            {
                "number": 943,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ حَدَّثَنَا يَزِيدُ بْنُ الْأَصَمِّ عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ جَافَى حَتَّى يَرَى مَنْ خَلْفَهُ وَضَحَ إِبِطَيْهِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ja'far bin Burqan] telah menceritakan kepada kami [Yazid bin Al Asham] dari [Maimunah binti Al Harits] ia berkata, \"Nabi shallallahu 'alaihi wasallam apabila sujud merenggangkan tangan hingga orang yang di belakangnya melihat putihnya ketiak beliau.\" "
            },
            {
                "number": 944,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ وَإِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَصَمِّ عَنْ عَمِّهِ يَزِيدَ بْنِ الْأَصَمِّ عَنْ مَيْمُونَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ جَافَى حَتَّى لَوْ شَاءَتْ بَهْمَةٌ تَمُرُّ تَحْتَهُ لَمَرَّتْ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dan [Isma'il bin Zakaria] dari ['ubaidhullah bin Abdullah bin Al Asham] dari pamannya [Yazid bin Al Asham] dari [Maimunah] ia berkata, \"Jika Nabi shallallahu 'alaihi wasallam sujud, maka beliau merenggangkan tangan hingga apabila hewan ternak hendak lewat di bawahnya niscaya ia dapat melewatinya.\""
            },
            {
                "number": 945,
                "arab": " حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا مَرْوَانُ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الْأَصَمِّ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ خَوَّى بِيَدَيْهِ يَعْنِي جَنَّحَ حَتَّى يُرَى وَضَحُ إِبْطَيْهِ مِنْ وَرَائِهِ وَإِذَا قَعَدَ اطْمَأَنَّ عَلَى فَخِذِهِ الْيُسْرَى",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Marwan] telah menceritakan kepada kami ['ubaidhullah bin Abdullah bin Al Asham] dari [Yazid bin Al Asham] dari [Maimunah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam sujud, maka beliau mengosongkan dengan kedua tangannya, membentangkan kedua sikunya seperti sayap hingga dari belakang terlihat putihnya kedua ketiak beliau. Jika duduk maka beliau duduk dengan tenang di atas paha kirinya.\" "
            },
            {
                "number": 946,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ الرَّبِيعِ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى حَدَّثَنِي الْبَرَاءُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ رُكُوعُهُ إِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَسُجُودُهُ وَبَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Ar Rabi'] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibnu Abu Laila] telah menceritakan kepadaku [Al Barra`], bahwa jika Rasulullah shallallahu 'alaihi wasallam melakukan rukuk, atau beliau mengangkat kepalanya dari rukuk, atau saat sujud dan di antara dua sujud, maka lamanya hampir sama.\" "
            },
            {
                "number": 947,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ هِلَالِ بْنِ حُمَيْدٍ الْوَزَّانِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ قَالَ رَمَقْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاتِهِ فَوَجَدْتُ قِيَامَهُ وَرَكْعَتَهُ وَاعْتِدَالَهُ بَعْدَ الرَّكْعَةِ فَسَجْدَتَهُ فَجِلْسَتَهُ بَيْنَ السَّجْدَتَيْنِ فَسَجْدَتَهُ فَجِلْسَتَهُ بَيْنَ التَّسْلِيمِ وَالِانْصِرَافِ قَرِيبًا مِنْ السَّوَاءِ قَالَ أَبُو مُحَمَّد هِلَالُ بْنُ حُمَيْدٍ أُرَى أَبُو حُمَيْدٍ الْوَزَّانُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah menceritakan kepada kami [Abu 'Awanah] dari [Hilal bin Humaid Al Wazzan] dari ['Abdurrahman bin Abu Laila] dari [Al Barra`] ia berkata, \"Saya memperhatikan Rasulullah shallallahu 'alaihi wasallam ketika melakukan sholat, maka saya dapati berdirinya, rukuknya dan I'tidalnya setelah rukuk, kemudian sujudnya, duduknya di antara dua sujud, sujudnya, duduknya di antara salam dan beranjak pergi adalah hampir sama lamanya.\" Abu Muhammad Hilal bin Humaid berkata, \"Saya diperlihatkan oleh Abu Humaid Al Wazzan.\""
            },
            {
                "number": 948,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ بْنُ سَعْدٍ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَبَّادُ بْنُ زِيَادٍ عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ وَحَمْزَةَ بْنِ الْمُغِيرَةِ أَنَّهُمَا سَمِعَا الْمُغِيرَةَ بْنَ شُعْبَةَ يُخْبِرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبَلَ وَأَقْبَلَ مَعَهُ الْمُغِيرَةُ بْنُ شُعْبَةَ حَتَّى وَجَدُوا النَّاسَ قَدْ أَقَامُوا الصَّلَاةَ صَلَاةَ الْفَجْرِ وَقَدَّمُوا عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ يُصَلِّي بِهِمْ فَصَلَّى بِهِمْ عَبْدُ الرَّحْمَنِ رَكْعَةً مِنْ صَلَاةِ الْفَجْرِ قَبْلَ أَنْ يَأْتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَفَّ مَعَ النَّاسِ وَرَاءَ عَبْدِ الرَّحْمَنِ فِي الرَّكْعَةِ الثَّانِيَةِ فَلَمَّا سَلَّمَ عَبْدُ الرَّحْمَنِ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ صَلَّى فَفَزِعَ النَّاسُ لِذَلِكَ وَأَكْثَرُوا التَّسْبِيحَ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ قَالَ لِلنَّاسِ قَدْ أَصَبْتُمْ أَوْ قَدْ أَحْسَنْتُمْ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits bin Sa'd] telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku ['Abbad bin Ziyad] dari ['Urwah bin Al Mughirah] dan [Hamzah bin Al Mughirah] bahwa keduanya telah mendengar [Al Mughirah bin Syu'bah] mengabarkan, bahwa Rasulullah shallallahu 'alaihi wasallam datang bersama Al Mughirah bin Syu'bah dan mendapati orang-orang telah mendirikan sholat subuh. Orang-orang itu (para sahabat) telah menunjuk Abdurrahman bin 'Auf untuk menjadi imam, maka Abdurrahman pun sholat bersama mereka satu rakaat sholat subuh sebelum Rasulullah shallallahu 'alaihi wasallam datang. Kemudian Rasulullah shallallahu 'alaihi wasallam datang dan berbaris di shaf bersama orang-orang di belakang Abdurrahman bin 'Auf pada rakaat kedua. Lalu ketika Abdurrahman bin 'Auf mengucapkan salam, Rasulullah shallallahu 'alaihi wasallam berdiri kemudian melakukan sholat. Maka orang-orang pun kaget karena hal tersebut hingga mereka memperbanyak mengucapkan kalimat tasbih. Kemudian tatkala Rasulullah shallallahu 'alaihi wasallam menyelesaikan sholatnya beliau berkata kepada orang-orang: \"Sungguh kalian telah benar, atau kalian telah berbuat baik.\""
            },
            {
                "number": 949,
                "arab": " أَخْبَرَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ حَدَّثَنَا بَكْرُ بْنُ عَبْدِ اللَّهِ الْمُزَنِيُّ عَنْ حَمْزَةَ بْنِ الْمُغِيرَةِ عَنْ أَبِيهِ أَنَّهُ قَالَ فَانْتَهَيْنَا إِلَى الْقَوْمِ وَقَدْ قَامُوا إِلَى الصَّلَاةِ يُصَلِّي بِهِمْ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ وَقَدْ رَكَعَ بِهِمْ فَلَمَّا أَحَسَّ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ يَتَأَخَّرُ فَأَوْمَى إِلَيْهِ بِيَدِهِ فَصَلَّى بِهِمْ فَلَمَّا سَلَّمَ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقُمْتُ فَرَكَعْنَا الرَّكْعَةَ الَّتِي سُبِقْنَا قَالَ أَبُو مُحَمَّد أَقُولُ فِي الْقَضَاءِ بِقَوْلِ أَهْلِ الْكُوفَةِ أَنْ يَجْعَلَ مَا فَاتَهُ مِنْ الصَّلَاةِ قَضَاءً",
                "id": "Telah mengabarkan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Humaid Ath Thawil] telah menceritakan kepada kami [Bakr bin Abdullah Al Muzani] dari [Hamzah bin Al Mughirah] dari [Ayahnya] bahwa ia berkata, \"Kemudian kami sampai kepada orang-orang sementara mereka telah berdiri melakukan sholat dengan Abdurrahman bin 'Auf sebagai imamnya, dan 'Abdurrahman telah mendapatkan satu rakaat bersama mereka. Kemudian tatkala ia merasakan kehadiran Nabi shallallahu 'alaihi wasallam maka ia mundur, tetapi beliau memberi isyarat kepadanya dengan tangannya (agar tetap sholat bersama mereka), maka ia pun tetap sholat bersama mereka. Ketika 'Abdurrahman salam, Nabi shallallahu 'alaihi wasallam berdiri dan akupun berdiri, kemudian kami melakukan rukuk untuk rakaat kami yang telah tertinggal.\" Abu Muhammad berkata, \"Dalam masalah mengqadla sholat aku berpendapat seperti pendapat penduduk Kufah, yaitu menjadikan apa yang tertinggal sebagai qadla.\""
            },
            {
                "number": 950,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا غَالِبٌ الْقَطَّانُ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسٍ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شِدَّةِ الْحَرِّ فَإِذَا لَمْ يَسْتَطِعْ أَحَدُنَا أَنْ يُمَكِّنَ جَبْهَتَهُ مِنْ الْأَرْضِ بَسَطَ ثَوْبَهُ فَصَلَّى عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] telah menceritakan kepada kami [Ghalib Al Qaththan] dari [Bakr bin Abdullah] dari [Anas] ia berkata, \"Kami pernah melakukan sholat bersama Rasulullah shallallahu 'alaihi wasallam pada waktu yang sangat panas, apabila salah seorang di antara kami tidak mampu menempelkan keningnya di tanah maka ia menghamparkan kain dan melakukan sholat di atasnya.\" "
            },
            {
                "number": 951,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ ابْنِ عَجْلَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو هَكَذَا فِي الصَّلَاةِ وَأَشَارَ ابْنُ عُيَيْنَةَ بِأُصْبُعِهِ وَأَشَارَ أَبُو الْوَلِيدِ بِالسَّبَّاحَةِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Ibnu 'Ajlan] dari ['Amir bin Abdullah bin Az Zubair] dari [Ayahnya] ia berkata, \"Saya melihat Nabi shallallahu 'alaihi wasallam berdo'a demikian di dalam sholat.\" Ibnu 'Uyainah memberikan isyarat menggunakan jari-jarinya, dan Abu Al Walid berisyarat menggunakan jari telunjuk.\""
            },
            {
                "number": 952,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَعَدَ فِي آخِرِ الصَّلَاةِ وَضَعَ يَدَهُ الْيُسْرَى عَلَى رُكْبَتِهِ الْيُسْرَى وَوَضَعَ يَدَهُ الْيُمْنَى عَلَى رُكْبَتِهِ الْيُمْنَى وَنَصَبَ إِصْبَعَهُ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam apabila duduk di akhir sholat, beliau meletakkan tangan kirinya di atas lutut kiri dan meletakkan tangan kanannya di atas lutut kanan serta menegakkan jari-jarinya.\""
            },
            {
                "number": 953,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَ كُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْنَا السَّلَامُ عَلَى اللَّهِ قَبْلَ عِبَادِهِ السَّلَامُ عَلَى جِبْرِيلَ السَّلَامُ عَلَى مِيكَائِيلَ السَّلَامُ عَلَى إِسْرَافِيلَ السَّلَامُ عَلَى فُلَانٍ وَفُلَانٍ قَالَ فَأَقْبَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ تَعَالَى هُوَ السَّلَامُ فَإِذَا جَلَسْتُمْ فِي الصَّلَاةِ فَقُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ فَإِنَّكُمْ إِذَا قُلْتُمُوهَا أَصَابَتْ كُلَّ عَبْدٍ صَالِحٍ فِي السَّمَاءِ وَالْأَرْضِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ لِيَتَخَيَّرْ مَا شَاءَ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Abdullah] ia berkata, \"Dahulu jika kami sholat di belakang Rasulullah shallallahu 'alaihi wasallam, maka kami mengucapkan, 'Semoga keselamatan bagi Allah sebelum para hamba-Nya, semoga keselamatan bagi Jibril, semoga keselamatan bagi Mikail, semoga keselamatan bagi Israfil, semoga keselamatan bagi fulan dan fulan'.\" Abdullah berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam menghadap ke arah kami dan mengatakan: \"Sesungguhnya Allah Ta'ala adalah As Salam (Maha Sejahtera), maka apabila kalian duduk dalam sholat maka ucapkanlah: AT TAHIYYAATU LILLAAHI WASH SHALAWAATU WATH THAYYIBAATU, AS SALAAMU 'ALAIKA AYYUHAN NABIYYU WA RAHMATULLAAHI WA BARAKAATUH, AS SALAAMU 'ALAINAA WA 'ALAA 'IBAADILLAAHISH SHAALIHIIN (Segala ucapan selamat milik Allah, shalawat serta segala kebaikan. Semoga keselamatan bagimu wahai Nabi dan rahmat Allah serta berkah-Nya. Semoga keselamatan bagi hamba-hamba Allah yang shalih), sesungguhnya apabila kalian mengucapkan hal tersebut maka kalian kalimat tersebut telah mencakup seluruh hamba yang shalih di langit dan bumi. ASYHADU AN LAA ILAAHA ILLALLAAHU WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya). Kemudian hendaknya ia memilih (do'a) yang ia kehendaki.\""
            },
            {
                "number": 954,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ الْحَسَنِ بْنِ حُرٍّ حَدَّثَنِي الْقَاسِمُ بْنُ مُخَيْمِرَةَ قَالَ أَخَذَ عَلْقَمَةُ بِيَدِي فَحَدَّثَنِي أَنَّ عَبْدَ اللَّهِ أَخَذَ بِيَدِهِ وَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِ عَبْدِ اللَّهِ فَعَلَّمَهُ التَّشَهُّدَ فِي الصَّلَاةِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ قَالَ زُهَيْرٌ أُرَاهُ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَيْضًا شَكَّ فِي هَاتَيْنِ الْكَلِمَتَيْنِ إِذَا فَعَلْتَ هَذَا أَوْ قَضَيْتَ فَقَدْ قَضَيْتَ صَلَاتَكَ إِنْ شِئْتَ أَنْ تَقُومَ فَقُمْ وَإِنْ شِئْتَ أَنْ تَقْعُدَ فَاقْعُدْ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Al Hasan bin Hurr] telah menceritakan kepadaku [Al Qasim bin Mukhaimarah] ia berkata, ['Alqamah] menggandeng tanganku kemudian menceritakan kepadaku bahwa [Abdullah] telah menggandeng tangannya, bahwa Rasulullah shallallahu 'alaihi wasallam menggandeng tangan Abdullah kemudian mengajarkan kepadanya tasyahud dalam sholat: \"AT TAHIYYAATU LILLAAHI WASH SHALAWAATU WATH THAYYIBAATU, AS SALAAMU 'ALAIKA AYYUHAN NABIYYU WA RAHMATULLAAHI WA BARAKAATUH, AS SALAAMU 'ALAINAA WA 'ALAA 'IBAADILLAAHISH SHAALIHIIN (Segala ucapan selamat milik Allah, shalawat serta segala kebaikan. Semoga keselamatan bagimu wahai Nabi dan rahmat Allah serta berkah-Nya. Semoga keselamatan bagi hamba-hamba Allah yang shalih).\" Zuhair berkata, \"Menurutku beliau mengucapkan: \"ASYHADU AN LAA ILAAHA ILLALLAAHU WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya) -Zuhair masih merasa ragu antara dua kalimat ini-. Apabila engkau melakukan hal ini atau menyelesaikannya sungguh engkau telah menyelesaikan sholatmu. Apabila engkau ingin berdiri maka berdirilah, dan apabila engkau ingin duduk maka duduklah.\""
            },
            {
                "number": 955,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ قَالَ الْحَكَمُ أَخْبَرَنِي قَالَ سَمِعْتُ ابْنَ أَبِي لَيْلَى يَقُولُ لَقِيَنِي كَعْبُ بْنُ عُجْرَةَ فَقَالَ أَلَا أُهْدِي لَكَ هَدِيَّةً إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْنَا فَقُلْنَا قَدْ عَلِمْنَا السَّلَامَ عَلَيْكَ فَكَيْفَ نُصَلِّي قَالَ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thalisi] telah menceritakan kepada kami [Syu'bah] ia berkata; [Al Hakam] telah mengabarkan kepadaku, ia berkata; aku mendengar [Ibnu Abu Laila] berkata; [Ka'b bin 'Ujrah] bertemu denganku dan berkata, \"Maukah kamu aku beri hadiah? Sesungguhnya Rasulullah shallallahu 'alaihi wasallam keluar menemui kami, kemudian kami berkata, \"Kami telah tahu cara mengucapkan salam kepada anda, lalu bagaimana kami bershalawat? Beliau lalu berkata: \"Ucapkanlah: 'ALLAAHUMMA SHALLI 'ALAA MUHAMMADIN WA 'ALAA AALI MUHAMMADIN KAMAA SHALLAITA 'ALAA AALI IBRAAHIIMA, INNAKA HAMIIDUN MAJIID, WA BAARIK 'ALAA MUHAMMADIN WA 'ALAA AALI MUHAMMADIN KAMAA BAARAKTA 'ALAA AALI IBRAAHIIMA INNAKA HAMIIDUN MAJIID (Ya Allah, limpahkanlah shalawat kepada Muhammad dan keluarga Muhammad, sebagaimana Engkau melimpahkan shalawat kepada keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji dan Maha Pemurah. Berilah berkah kepada Muhammad dan keluarga Muhammad sebagaimana Engkau memberikan berkah kepada keluarga Ibrahim. Sesungguhnya Engkau Maha terpuji dan Maha Pemurah).\""
            },
            {
                "number": 956,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ نُعَيْمٍ الْمُجْمِرِ مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ زَيْدٍ الْأَنْصَارِيَّ الَّذِي كَانَ أُرِيَ النِّدَاءَ بِالصَّلَاةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُ أَنَّ أَبَا مَسْعُودٍ الْأَنْصَارِيَّ قَالَ أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَلَسَ مَعَنَا فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ وَهُوَ أَبُو النُّعْمَانِ بْنُ بَشِيرٍ أَمَرَنَا اللَّهُ أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللَّهِ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ فَصَمَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَالسَّلَامُ كَمَا قَدْ عَلِمْتُمْ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Nu'aim Al Mujmir] mantan budak Umar bin Al Khathab, bahwa [Muhammad bin Abdullah bin Zaid Al Anshari] yang bermimpi mengenai seruan adzan untuk sholat pada masa Rasulullah shallallahu 'alaihi wasallam mengabarkan kepadanya, bahwa [Abu Mas'ud Al Anshari] berkata, \"Rasulullah shallallahu 'alaihi wasallam datang menemui kami lalu duduk bersama kami di dalam majelis Sa'd bin 'Ubadah. Kemudian Basyir bin Sa'd -Abu An Nu'man bin Basyir- berkata kepada beliau, 'Wahai Rasulullah, Allah telah memerintahkan kami untuk bershalawat kepada anda, lalu bagaimana kami bershalawat kepada anda? ' Abu Mas'ud berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam diam hingga kami berangan-angan bahwa ia tidak bertanya kepada beliau. Beliau kemudian berkata: \"Ucapkanlah; 'ALLAAHUMMA SHALLI 'ALAA MUHAMMADIN WA 'ALAA AALI MUHAMMADIN KAMAA SHALLAITA 'ALAA IBRAAHIIMA, WA BAARIK 'ALAA MUHAMMADIN WA 'ALAA AALI MUHAMMADIN KAMAA BAARAKTA 'ALAA AALI IBRAAHIIMA FIL 'AALAMIINA INNAKA HAMIIDUN MAJIID (Ya Allah, limpahkanlah shalawat kepada Muhammad dan keluarga Muhammad, sebagaimana Engkau melimpahkan shalawat kepada Ibrahim, berilah berkah kepada Muhammad dan keluarga Muhammad sebagaimana Engkau memberikan berkah kepada keluarga Ibrahim di seluruh alam sesungguhnya Engkau Maha terpuji dan Maha Pemurah).sedangkan salam sebagaimana kalian telah ketahui.\""
            },
            {
                "number": 957,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ حَسَّانَ عَنْ مُحَمَّدِ بْنِ أَبِي عَائِشَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَرَغَ أَحَدُكُمْ مِنْ التَّشَهُّدِ فَلْيَتَعَوَّذْ بِاللَّهِ مِنْ أَرْبَعٍ مِنْ عَذَابِ جَهَنَّمَ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَشَرِّ الْمَسِيحِ الدَّجَّالِ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Hassan] dari [Muhammad bin Abu Aisyah] ia berkata; aku mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam berkata: \"Apabila salah seorang di antara kalian telah selesai bertasyahud, maka hendaknya ia berlindung kepada Allah dari empat perkara; dari adzab Jahannam, adzab kubur, fitnah kehidupan dan kamatian serta kejahatan Al Masih Dajjal.\" Telah menceritakan kepada kami [Muhammad bin Katsir] dari [Al Auza'i] seperti itu.\" "
            },
            {
                "number": 958,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَلِّمُ عَنْ يَمِينِهِ حَتَّى يُرَى بَيَاضُ خَدِّهِ ثُمَّ يُسَلِّمُ عَنْ يَسَارِهِ حَتَّى يُرَى بَيَاضُ خَدِّهِ",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Abdullah bin Ja'far] dari [Isma'il bin Muhammad bin Sa'd] dari ['Amir bin Sa'd] dari [Ayahnya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengucapkan salam ke samping kanan hingga kelihatan putih pipinya, kemudian mengucapkan salam ke kirinya hingga terlihat putih pipinya.\" "
            },
            {
                "number": 959,
                "arab": " حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ الْحَكَمِ وَمَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ قَالَ صَلَّيْتُ خَلْفَ رَجُلٍ بِمَكَّةَ فَسَلَّمَ تَسْلِيمَتَيْنِ فَذَكَرْتُ ذَلِكَ لِعَبْدِ اللَّهِ فَقَالَ أَنَّى عَلِقَهَا وَقَالَ الْحَكَمُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] dari [Al Hakam] dan [Manshur] dari [Mujahid] dari [Abu Ma'mar] ia berkata, \"Aku pernah sholat di belakang seseorang di Makkah, kemudian ia mengucapkan dua kali salam. Lalu hal itu aku ceritakan kepada [Abdullah], maka ia pun berkata, \"Dari mana ia mendapatkan sunah tersebut? Al Hakam berkata, \"Dahulu Nabi shallallahu 'alaihi wasallam melakukannya.\""
            },
            {
                "number": 960,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَاصِمٌ عَنْ أَبِي الْوَلِيدِ هُوَ عَبْدُ اللَّهِ بْنُ الْحَارِثِ عَنْ عَائِشَةَ قَالَتْ مَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْلِسُ بَعْدَ الصَّلَاةِ إِلَّا قَدْرَ مَا يَقُولُ اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami ['Ashim] dari [Abu Al Walid] -yaitu Abdullah bin Al Harits- dari [Aisyah] ia berkata, \"Tidaklah Nabi shallallahu 'alaihi wasallam duduk setelah sholat kecuali seukuran mengucapkan 'ALLAAHUMMA ANTAS SALAAM WA MINKAS SALAAM TABAARAKTA YAA DZAL JALAALI WAL IKRAAM (Ya Allah, Engkau adalah As Salaam (Yang Maha Sejahtera), dari-Mu lah datang keselamatan, Maha Suci Engkau wahai Dzat Yang memiliki kemuliaan) '.\" "
            },
            {
                "number": 961,
                "arab": "أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ شَدَّادٍ أَبِي عَمَّارٍ عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ عَنْ ثَوْبَانَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنْصَرِفَ مِنْ صَلَاتِهِ اسْتَغْفَرَ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Syaddad Abu 'Ammar] dari [Abu Asma` Ar Rahabi] dari [Tsauban] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam apabila hendak beranjak dari sholatnya, maka beliau beristighfar tiga kali kemudian mengucapkan: 'ALLAAHUMMA ANTAS SALAAM WA MINKAS SALAAM TABAARAKTA YAA DZAL JALAALI WAL IKRAAM (Ya Allah, Engkau adalah As Salaam (Yang Maha Sejahtera), dari-Mu lah datang keselamatan, Maha Suci Engkau wahai Dzat Yang memiliki kemuliaan) '.\""
            },
            {
                "number": 962,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ وَرَّادٍ كَاتِبِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ أَمْلَى عَلَيَّ الْمُغِيرَةُ بْنُ شُعْبَةَ فِي كِتَابٍ إِلَى مُعَاوِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي دُبُرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Abdul Malik bin 'Umair] dari [Warrad] penulis Al Mughirah bin Syu'bah, ia berkata, \" [Al Mughirah bin Syu'bah] mendektekan kepadaku ketika menulis surat kepada Mu'awiyah, bahwa Rasulullah shallallahu 'alaihi wasallam dahulu setiap selesai sholat wajib mengucapkan: 'LAA ILAAHA ILLAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI`IN QADIIR, ALLAAHUMMA LAA MAANI'A LIMAA A'THAITA WA LAA MU'THIYA LIMAA MANA'TA WA LAA YANFA'U DZAL JADDI MINKAL JADDU (Tidak ada tuhan yang berhak disembah kecuali Allah semata, tidak ada sekutu bagi-Nya, segala kerajaan milik-Nya serta segala puji bagi-Nya, dan Dia Maha Mampu Melakukan segala sesuatu. Ya Allah, tidak ada yang dapat menahan apa yang Engkau berikan dan tidak ada yang dapat memberi apa yang Engkau tahan, dan tidak bermanfaat dari-Mu kekayaan bagi orang yang memiliki kekayaan).\""
            },
            {
                "number": 963,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ قَالَ لَا يَجْعَلْ أَحَدُكُمْ لِلشَّيْطَانِ نَصِيبًا مِنْ صَلَاتِهِ يَرَى أَنَّ حَقًّا عَلَيْهِ أَنْ لَا يَنْصَرِفَ إِلَّا عَنْ يَمِينِهِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَثِيرًا يَنْصَرِفُ عَنْ يَسَارِهِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dari ['Umarah] dari [Al Aswad] dari [Abdullah] ia berkata, \"Janganlah salah seorang di antara kalian menjadikan bagi setan bagian dari sholatnya, ia melihat bahwa kewajibannya adalah tidak beranjak (pergi) kecuali dari sisi kanannya. Sungguh, aku sering melihat Rasulullah shallallahu 'alaihi wasallam beranjak ke sisi sebelah kirinya.\" "
            },
            {
                "number": 964,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ السُّدِّيِّ قَالَ سَمِعْتُ أَنَسًا يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْصَرِفُ عَنْ يَمِينِهِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Israil] dari [As Suddi] ia berkata; aku mendengar [Anas] berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam beranjak pergi dari sisi sebelah kanannya.\" "
            },
            {
                "number": 965,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ السُّدِّيِّ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ قَالَ انْصَرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ يَمِينِهِ يَعْنِي فِي الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [As Suddi] ia berkata, \"Aku mendengar [Anas bin Malik] berkata, \"Nabi shallallahu 'alaihi wasallam beranjak pergi dari sisi sebelah kanannya, yakni saat sholat.\" "
            },
            {
                "number": 966,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا هِقْلٌ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي حَسَّانُ بْنُ عَطِيَّةَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عَائِشَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو ذَرٍّ يَا رَسُولَ اللَّهِ ذَهَبَ أَصْحَابُ الدُّثُورِ بِالْأُجُورِ يُصَلُّونَ كَمَا نُصَلِّي وَيَصُومُونَ كَمَا نَصُومُ وَلَهُمْ فُضُولُ أَمْوَالٍ يَتَصَدَّقُونَ بِهَا وَلَيْسَ لَنَا مَا نَتَصَدَّقُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَلَا أُعَلِّمُكَ كَلِمَاتٍ إِذَا أَنْتَ قُلْتَهُنَّ أَدْرَكْتَ مَنْ سَبَقَكَ وَلَمْ يَلْحَقْكَ مَنْ خَلَفَكَ إِلَّا مَنْ عَمِلَ بِمِثْلِ عَمَلِكَ قَالَ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ قَالَ تُسَبِّحُ دُبُرَ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ وَتَحْمَدُهُ ثَلَاثًا وَثَلَاثِينَ وَتُكَبِّرُهُ ثَلَاثًا وَثَلَاثِينَ وَتَخْتِمُهَا بِلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Hiql] dari [Al Auza'i] ia berkata, telah menceritakan kepadaku [Hassan bin 'Athiyyah] ia berkata, telah menceritakan kepadaku [Muhammad bin Abu 'Aisyah] dari [Abu Hurairah] ia berkata, Abu Dzar berkata, \"Wahai Rasulullah, orang-orang kaya telah pergi dengan membawa pahala, mereka sholat sebagaimana kami sholat, berpuasa sebagaimana kami berpuasa dan mereka memiliki kelebihan harta yang mereka sedekahkan, sedang kami tidak memiliki sesuatu yang kami sedekahkan?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah aku ajarkan kepadamu beberapa kalimat, apabila engkau ucapkan maka engkau akan dapat menyusul orang-orang yang telah mendahuluimu, dan tidak ada orang setelahmu yang dapat mengejarmu kecuali orang yang melakukan seperti apa yang engkau lakukan?\" Abu Dzar berkata, \"Maka aku katakan, \"Wahai Rasulullah, baiklah.\" Beliau lalu bersabda: \"Bertasbih setiap selesai sholat sebanyak tiga puluh tiga kali, bertahmid tiga puluh tiga kali, bertakbir tiga puluh tiga kali dan engkau tutup dengan ucapan LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAHU, LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI`IN QADIIR (Tidak ada tuhan yang berhak disembah kecuali Allah semata, tidak ada sekutu bagi-Nya, milik-Nya seluruh kerajaan dan bagi-Nya seluruh pujian, dan ia Dia Maha Mampu melakukan segala sesuatu).\""
            },
            {
                "number": 967,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ كَثِيرِ بْنِ أَفْلَحَ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ أُمِرْنَا أَنْ نُسَبِّحَ فِي دُبُرِ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ وَنَحْمَدَهُ ثَلَاثًا وَثَلَاثِينَ وَنُكَبِّرَ أَرْبَعًا وَثَلَاثِينَ فَأُتِيَ رَجُلٌ أَوْ أُرِيَ رَجُلٌ مِنْ الْأَنْصَارِ فِي الْمَنَامِ فَقِيلَ أَمَرَكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُسَبِّحُوا اللَّهَ فِي دُبُرِ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ وَتَحْمَدُوا ثَلَاثًا وَثَلَاثِينَ وَتُكَبِّرُوا أَرْبَعًا وَثَلَاثِينَ قَالَ نَعَمْ قَالَ فَاجْعَلُوهَا خَمْسًا وَعِشْرِينَ خَمْسًا وَعِشْرِينَ وَاجْعَلُوا مَعَهَا التَّهْلِيلَ فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ افْعَلُوهَا",
                "id": "Telah mengabarkan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Katsir bin Aflah] dari [Zaid bin Tsabit] ia berkata, \"Kami diperintahkan agar bertasbih setiap selesai sholat tiga puluh tiga kali, bertahmid tiga puluh tiga kali, dan bertakbir tiga puluh empat. Kemudian seorang laki-laki dari kalangan anshar didatangkan, atau bermimpi, lalu dikatakan kepadanya, \"Apakah Rasulullah shallallahu 'alaihi wasallam telah memerintahkan kalian agar bertasbih kepada Allah setiap selesai sholat sebanyak tiga puluh tiga kali, bertahmid tiga puluh tiga kali, dan bertakbir tiga puluh empat kali? Ia berkata, \"Ya.\" Orang yang bertanya itu berkata, \"Jadikan kalimat-kalimat tersebut dua puluh lima kali, dua puluh lima kali, dan jadikan bersamanya tahlil.\" Kemudian Nabi shallallahu 'alaihi wasallam diberitahu mengenai hal tersebut, maka beliau berkata: \"Lakukan.\""
            },
            {
                "number": 968,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ تَمِيمٍ الدَّارِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ مَا يُحَاسَبُ بِهِ الْعَبْدُ الصَّلَاةُ فَإِنْ وَجَدَ صَلَاتَهُ كَامِلَةً كُتِبَتْ لَهُ كَامِلَةً وَإِنْ كَانَ فِيهَا نُقْصَانٌ قَالَ اللَّهُ تَعَالَى لِمَلَائِكَتِهِ انْظُرُوا هَلْ لِعَبْدِي مِنْ تَطَوُّعٍ فَأَكْمِلُوا لَهُ مَا نَقَصَ مِنْ فَرِيضَتِهِ ثُمَّ الزَّكَاةُ ثُمَّ الْأَعْمَالُ عَلَى حَسَبِ ذَلِكَ قَالَ أَبُو مُحَمَّد لَا أَعْلَمُ أَحَدًا رَفَعَهُ غَيْرَ حَمَّادٍ قِيلَ لِأَبِي مُحَمَّدٍ صَحَّ هَذَا قَالَ إِي",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Daud bin Abu Hindun] dari [Zurarah bin Aufa] dari [Tamim Ad Dari] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya pertama kali yang akan dihisab dari seorang hamba adalah sholat, jika sholatnya sempurna maka akan ditulis sempurna untuknya. Apabila padanya terdapat kekurangan, maka Allah Ta'ala berfirman kepada para malaikat-Nya: 'Lihatlah apakah hamba-Ku memiliki amalan sunah? Lalu sempurnakanlah apa yang kurang sempurna dari ibadah wajibnya.' Kemudian zakat, kemudian amalan-amalan lain juga seperti itu (perhitungannya).\" Abu Muhammad berkata, \"Aku tidak mengetahui seseorang yang memarfu'kan hadits tersebut selain Hammad.\" Abu Muhammad ditanya, \"Apakah hadits ini benar? Ia menjawab, \"Ya.\" "
            },
            {
                "number": 969,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ قَالَ سَمِعْتُ أَبَا حُمَيْدٍ السَّاعِدِيَّ فِي عَشَرَةٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدُهُمْ أَبُو قَتَادَةَ قَالَ أَنَا أَعْلَمُكُمْ بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا لِمَ فَمَا كُنْتَ أَكْثَرَنَا لَهُ تَبَعَةً وَلَا أَقْدَمَنَا لَهُ صُحْبَةً قَالَ بَلَى قَالُوا فَاعْرِضْ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ رَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ ثُمَّ كَبَّرَ حَتَّى يَقَرَّ كُلُّ عَظْمٍ فِي مَوْضِعِهِ ثُمَّ يَقْرَأُ ثُمَّ يُكَبِّرُ وَيَرْفَعُ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ ثُمَّ يَرْكَعُ وَيَضَعُ رَاحَتَيْهِ عَلَى رُكْبَتَيْهِ حَتَّى يَرْجِعَ كُلُّ عَظْمٍ إِلَى مَوْضِعِهِ وَلَا يُصَوِّبُ رَأْسَهُ وَلَا يُقْنِعُ ثُمَّ يَرْفَعُ رَأْسَهُ فَيَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ يَرْفَعُ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ يَظُنُّ أَبُو عَاصِمٍ أَنَّهُ قَالَ حَتَّى يَرْجِعَ كُلُّ عَظْمٍ إِلَى مَوْضِعِهِ مُعْتَدِلًا ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ ثُمَّ يَهْوِي إِلَى الْأَرْضِ فَيُجَافِي يَدَيْهِ عَنْ جَنْبَيْهِ ثُمَّ يَسْجُدُ ثُمَّ يَرْفَعُ رَأْسَهُ فَيَثْنِي رِجْلَهُ الْيُسْرَى فَيَقْعُدُ عَلَيْهَا وَيَفْتَحُ أَصَابِعَ رِجْلَيْهِ إِذَا سَجَدَ ثُمَّ يَعُودُ فَيَسْجُدُ ثُمَّ يَرْفَعُ رَأْسَهُ فَيَقُولُ اللَّهُ أَكْبَرُ وَيَثْنِي رِجْلَهُ الْيُسْرَى فَيَقْعُدُ عَلَيْهَا مُعْتَدِلًا حَتَّى يَرْجِعَ كُلُّ عَظْمٍ إِلَى مَوْضِعِهِ مُعْتَدِلًا ثُمَّ يَقُومُ فَيَصْنَعُ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ فَإِذَا قَامَ مِنْ السَّجْدَتَيْنِ كَبَّرَ وَرَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ كَمَا فَعَلَ عِنْدَ افْتِتَاحِ الصَّلَاةِ ثُمَّ يَصْنَعُ مِثْلَ ذَلِكَ فِي بَقِيَّةِ صَلَاتِهِ حَتَّى إِذَا كَانَتْ السَّجْدَةُ أَوْ الْقَعْدَةُ الَّتِي يَكُونُ فِيهَا التَّسْلِيمُ أَخَّرَ رِجْلَهُ الْيُسْرَى وَجَلَسَ مُتَوَرِّكًا عَلَى شِقِّهِ الْأَيْسَرِ قَالَ قَالُوا صَدَقْتَ هَكَذَا كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Abdul Hamid bin Ja'far] telah menceritakan kepadaku [Muhammad bin 'Amru bin 'Atha`] ia berkata; saya mendengar [Abu Humaid As Sa'idi] di antara sepuluh orang para sahabat Nabi shallallahu 'alaihi wasallam, yang salah seorang di antara mereka adalah Abu Qatadah, berkata, \"Aku adalah orang yang paling mengetahui sholat Rasulullah shallallahu 'alaihi wasallam. Kemudian mereka berkata, \"Kenapa bisa? Padahal engkau bukanlah orang yang lebih banyak mengikuti beliau, dan bukan orang yang paling lama menyertai Rasulullah shallallahu 'alaihi wasallam di antara kami?\" Ia mengatakan, \"Benar.\" Mereka berkata, \"Jelaskan! \" Abu Humaid lalu berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam berdiri untuk melakukan sholat, beliau mengangkat kedua tangannya hingga sejajar kedua pundaknya, kemudian takbir hingga setiap tulang menempati tempatnya, lalu membaca surat. Kemudian takbir dan mengangkat kedua tangannya hingga sejajar kedua pundak, kemudian rukuk dan meletakkan kedua telapak tangannya di atas kedua lutut hingga setiap tulang kembali ke tempatnya, beliau tidak menundukkan kepala dan tidak menengadahkan. Kemudian mengangkat kepalanya seraya mengucapkan: 'SAMI'ALLAAHU LIMAN HAMIDAHU (Semoga Allah mendengar orang yang memuji-Nya).' Kemudian mengangkat kedua tangannya hingga sejajar kedua pundaknya.\" Menurut Abu 'Ashim Abu Humaid berkata, \"Hingga setiap tulang kembali kepada tempatnya dalam keadaan lurus, kemudian beliau mengucapkan: 'Allaahu akbar (Allah Maha Besar).' Kemudian turun ke lantai dan merenggangkan kedua tangannya dari kedua sisi badannya, kemudian bersujud, kemudian mengangkat kepalanya. Kemudian beliau membengkokkan kaki kirinya dan duduk di atasnya seraya membuka jari-jari kedua kakinya apabila sujud, kemudian kembali dan sujud, kemudian mengangkat kepalanya sambil mengaucapkan: 'ALLAAHU AKBAR dan membengkokkan kaki kiri dan duduk di atasnya dengan lurus hingga setiap tulang kembali kepada tempatnya secara seimbang. Kemudian beliau berdiri dan melakukan rakaat yang lain seperti itu pula. Apabila berdiri dari dua sujud, beliau takbir dan mengangkat kedua tangannya hingga sejajar kedua pundak sebagaimana beliau melakukan di saat permulaan sholat. Kemudian melakukan seperti itu pada sisa sholatnya hingga pada saat sujud atau duduk yang padanya terdapat salam, beliau memundurkan kaki kirinya dan duduk dalam keadaan tawarruk (posisi duduk dengan meletakkan kedua pantat di atas lantai) miring ke sisi kiri.\" Perawi berkata, \"Orang-orang berkata, \"Engkau benar demikianlah sholat Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 970,
                "arab": " حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا زَائِدَةُ بْنُ قُدَامَةَ حَدَّثَنَا عَاصِمُ بْنُ كُلَيْبٍ أَخْبَرَنِي أَبِي أَنَّ وَائِلَ بْنَ حُجْرٍ أَخْبَرَهُ قَالَ قُلْتُ لَأَنْظُرَنَّ إِلَى صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ يُصَلِّي فَنَظَرْتُ إِلَيْهِ فَقَامَ فَكَبَّرَ فَرَفَعَ يَدَيْهِ حَتَّى حَاذَتَا بِأُذُنَيْهِ وَوَضَعَ يَدَهُ الْيُمْنَى عَلَى ظَهْرِ كَفِّهِ الْيُسْرَى قَالَ ثُمَّ لَمَّا أَرَادَ أَنْ يَرْكَعَ رَفَعَ يَدَيْهِ مِثْلَهَا وَوَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ ثُمَّ رَفَعَ رَأْسَهُ فَرَفَعَ يَدَيْهِ مِثْلَهَا ثُمَّ سَجَدَ فَجَعَلَ كَفَّيْهِ بِحِذَاءِ أُذُنَيْهِ ثُمَّ قَعَدَ فَافْتَرَشَ رِجْلَهُ الْيُسْرَى وَوَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخِذِهِ وَرُكْبَتِهِ الْيُسْرَى وَجَعَلَ مِرْفَقَهُ الْأَيْمَنَ عَلَى فَخْذِهِ الْيُمْنَى ثُمَّ قَبَضَ ثِنْتَيْنِ فَحَلَّقَ حَلْقَةً ثُمَّ رَفَعَ أُصْبُعَهُ فَرَأَيْتُهُ يُحَرِّكُهَا يَدْعُو بِهَا قَالَ ثُمَّ جِئْتُ بَعْدَ ذَلِكَ فِي زَمَانٍ فِيهِ بَرْدٌ فَرَأَيْتُ عَلَى النَّاسِ جُلَّ الثِّيَابِ يُحَرِّكُونَ أَيْدِيَهُمْ مِنْ تَحْتِ الثِّيَابِ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin 'Amru] telah menceritakan kepada kami [Zaidah bin Qudamah] telah menceritakan kepada kami ['Ashim bin Kulaib] telah mengabarkan kepadaku [Ayahku] bahwa [Wail bin Hujr] telah mengabarkan kepadanya, ia berkata, \"Aku katakan, \"Sungguh, aku akan memperhatikan sholat Rasulullah shallallahu 'alaihi wasallam, bagaimana beliau melakukan sholat.\" Kemudian aku memperhatikan Rasulullah, beliau berdiri dan takbir, lalu mengangkat kedua tangannya hingga sejajar kedua telinga, dan meletakkan tangan kanannya di atas punggung telapak tangan kirinya.\" Wail bin Hujr berkata, \"Kemudian saat akan rukuk beliau mengangkat kedua tangannya seperti itu dan meletakkan kedua tangannya di atas kedua lututnya, kemudian mengangkat kepalanya dan mengangkat kedua tangannya seperti itu. Baru setelah itu beliau sujud dan menjadikan kedua telapak tangannya sejajar dengan kedua telinganya, kemudian duduk dan menyilangkan kaki kirinya, lalu meletakkan telapak tangan kirinya di atas paha serta lutut kirinya dan menjadikan siku kanannya berada di atas paha kanannya, Beliau menggenggam dua jarinya dan membuat lingkaran dengan mengangkat satu jari (telunjuk) nya, dan aku melihat beliau menggerakkan jari tersebut sambl membaca berdo'a.\" Wail bin Hujr berkata, \"Setelah itu aku kepada mereka saat musim dingin, dan aku lihat mereka memakai pakaian besar dan menggerakkan tangan mereka dari bawah pakaian.\""
            },
            {
                "number": 971,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ قَالَ صَلَّى بِنَا أَبُو مُوسَى إِحْدَى صَلَاتَيْ الْعَشِيِّ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ أُقِرَّتْ الصَّلَاةُ بِالْبِرِّ وَالزَّكَاةِ فَلَمَّا قَضَى أَبُو مُوسَى الصَّلَاةَ قَالَ أَيُّكُمْ الْقَائِلُ كَلِمَةَ كَذَا وَكَذَا فَأَرَمَّ الْقَوْمُ فَقَالَ لَعَلَّكَ يَا حِطَّانُ قُلْتَهَا قَالَ مَا أَنَا قُلْتُهَا وَقَدْ خِفْتُ أَنْ تَبْكَعَنِي بِهَا فَقَالَ رَجُلٌ مِنْ الْقَوْمِ أَنَا قُلْتُهَا وَمَا أَرَدْتُ بِهَا إِلَّا الْخَيْرَ فَقَالَ أَبُو مُوسَى أَوَ مَا تَعْلَمُونَ مَا تَقُولُونَ فِي صَلَاتِكُمْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَنَا فَعَلَّمَنَا صَلَاتَنَا وَبَيَّنَ لَنَا سُنَّتَنَا قَالَ أَحْسَبُهُ قَالَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلْيَؤُمَّكُمْ أَحَدُكُمْ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَالَ { غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ } فَقُولُوا آمِينَ يُجِبْكُمْ اللَّهُ فَإِذَا كَبَّرَ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا فَإِنَّ الْإِمَامَ يَرْكَعُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ فَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ أَوْ قَالَ رَبَّنَا وَلَكَ الْحَمْدُ فَإِنَّ اللَّهَ قَالَ عَلَى لِسَانِ نَبِيِّهِ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ وَإِذَا كَبَّرَ وَسَجَدَ فَكَبِّرُوا وَاسْجُدُوا فَإِنَّ الْإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ فَإِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ أَوَّلِ قَوْلِ أَحَدِكُمْ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ أَوْ سَلَامٌ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ أَوْ سَلَامٌ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Yunus bin Jubair] dari [Hiththan bin Abdullah Ar Raqasyi] ia berkata, \" [Abu Musa] melakukan sholat bersama kami salah satu sholat di waktu malam (sholat Maghrib atau Isya`). Kemudian seorang laki-laki berkata, \"sholat diiringi dengan perbuatan baik dan zakat.\" Maka ketika Abu Musa menyelesaikan sholatnya ia berkata, \"Siapakah di antara kalian yang mengatakan perkataan demikian dan demikian?\" Orang-orang pun diam. Abu Musa lalu berkata, \"Kemungkinan engkau yang mengatakannya wahai Hiththan.\" Ia menjawab, \"Bukan aku yang mengatakannya. Sungguh aku telah khawatir engkau akan mencelaku karenanya.\" Kemudian seorang laki-laki di antara orang-orang tersebut berkata, \"Aku yang mengatakannya, dan tidak ada yang aku inginkan dengan kata-kata itu kecuali kebaikan.\" Lalu Abu Musa berkata, \"Tidakkah kalian mengetahui apa yang kalian ucapkan dalam sholat kalian? Rasulullah shallallahu 'alaihi wasallam pernah berkhutbah di hadapan kami, beliau mengajarkan kami sholat dan menjelaskan sunah kepada kami.\" Perawi berkata, \"Aku mengira beliau mengatakan: \"Jika sholat telah diserukan maka hendaklah salah seorang dari kalian menjadi imam bagi yang lain. Kemudian apabila imam takbir maka bertakbirlah, jika ia mengucapkan; 'GHAIRIL MAGHDHUUBI 'ALAIHIM WA LADLAALLIIN, maka ucapkan; AAMIIN, maka Allah akan mengabulkan kalian. Jika ia takbir dan rukuk maka takbir dan rukuklah, karena sesungguhnya Imam sujud sebelum kalian dan rukuk sebelum kalian.\" Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Waktu itu (waktu imam) sama dengan waktu itu (makmum). Jika ia mengucapkan; SAMI'ALLAHU LIMAN HAMIDAHU (Semoga Allah mendengar pujian orang yang memuji-Nya) maka ucapkanlah; ALLAHUMMA RABBANAA LAKAL HAMDU (Ya Allah, Rabb kami, segala puji hanya milik-Mu), atau beliau mengatakan; RABBANAA WA LAKAL HAMDU (Ya Rabb kami, dan bagi-Mu lah segala pujian). Sebab Allah telah berfirman melalui lisan Nabi-Nya; SAMI'ALLAHU LIMAN HAMIDAHU. Dan jika ia takbir dan sujud maka takbir dan sujudlah, sebab imam itu sujud dan rukuk sebelum kalian.\" Nabi shallallahu 'alaihi wasallam kemudian \"Waktu itu (waktu imam) sama dengan waktu itu (makmum). Jika telah duduk, maka jadikanlah pertama kali yang salah seorang dari kalian ucapkan adalah; 'AT TAHIYYAATUTH THAYYIBAATUSH SHALAWAATU LILLAAH, AS SALAAMU, atau SALAAMUN 'ALAIKA AYYUHAN NABIIYU WA RAHMATULLAAHI WA BARAKAATUH. AS SALAAMU 'ALAINAA WA 'ALAA 'IBAADILLAAHISH SHAALIHIIN. ASYHADU AN LAA ILAAHA ILLALLAAHU WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Segala ucapan selamat yang baik dan seluruh shalawat adalah milik Allah, semoga keselamatan, rahmat serta berkah terlimpahkan kepadamu wahai Nabi, semoga keselamatan terlimpahkan kepada kami dan para hamba-hamba Allah yang shalih. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah semata, dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya).\""
            },
            {
                "number": 972,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ هُوَ النَّبِيلُ عَنْ ابْنِ عَجْلَانَ عَنْ الْمَقْبُرِيِّ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يُصَلِّي وَقَدْ حَمَلَ عَلَى عُنُقِهِ أَوْ عَاتِقِهِ أُمَامَةَ بِنْتَ زَيْنَبَ فَإِذَا رَكَعَ وَضَعَهَا وَإِذَا قَامَ حَمَلَهَا",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] -yaitu An Nabil- dari ['Ajlan] dari [Al Maburi] dari ['Amru bin Sulaim] dari [Abu Qatadah], bahwa Rasulullah shallallahu 'alaihi wasallam pernah keluar untuk melaksanakan sholat sementara di pundaknya beliau menggendong Umamah binti Zainab. Apabila rukuk, maka beliau meletakkannya dan apabila berdiri maka beliau menggendongnya.\" "
            },
            {
                "number": 973,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ عَنْ أَبِي قَتَادَةَ الْأَنْصَارِيِّ قَالَ حَمَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمَامَةَ بِنْتَ زَيْنَبَ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الصَّلَاةِ فَإِذَا سَجَدَ وَضَعَهَا وَإِذَا قَامَ حَمَلَهَا",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari ['Amir bin Abdullah bin Az Zubair] dari ['Amru bin Sulaim Az Zuraqi] dari [Abu Qatadah Al Anshari] ia berkata, \"Saat sholat Rasulullah shallallahu 'alaihi wasallam menggendong Umamah binti Zainab binti Rasulullah shallallahu 'alaihi wasallam. Jika sujud, maka beliau meletakkannya dan jika berdiri maka beliau menggendongnya.\" "
            },
            {
                "number": 974,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ أَخْبَرَنِي بُكَيْرٌ هُوَ ابْنُ الْأَشَجِّ عَنْ نَابِلٍ صَاحِبِ الْعَبَاءِ عَنْ ابْنِ عُمَرَ عَنْ صُهَيْبٍ قَالَ مَرَرْتُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ وَهُوَ يُصَلِّي فَرَدَّ إِلَيَّ إِشَارَةً قَالَ لَيْثٌ أَحْسَبُهُ قَالَ بِأُصْبُعِهِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thalisi] telah menceritakan kepada kami [Laits bin Sa'd] telah mengabarkan kepadaku [Bukair] -yaitu Ibnu Al Asyaj- dari [Nabil pemilik Al 'Aba`] dari [Ibnu Umar] dari [Shuhaib] ia berkata, \"Aku melewati Rasulullah shallallahu 'alaihi wasallam yang sedang melaksanakan sholat, lalu aku mengucapkan salam kepada beliau. Maka beliau pun menjawab salamku dengan isyarat.\" Latis berkata, \"Aku mengira ia berkata, \"Menggunakan jari-jari.\""
            },
            {
                "number": 975,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَسْجِدَ بَنِي عَمْرِو بْنِ عَوْفٍ فَدَخَلَ النَّاسُ يُسَلِّمُونَ عَلَيْهِ وَهُوَ فِي الصَّلَاةِ قَالَ فَسَأَلْتُ صُهَيْبًا كَيْفَ كَانَ يَرُدُّ عَلَيْهِمْ قَالَ هَكَذَا وَأَشَارَ بِيَدِهِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Zaid bin Aslam] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam memasuki masjid Bani 'Amru bin 'Auf, kemudian orang-orang masuk dan mengucapkan salam kepada beliau sementara beliau sedang melakukan sholat.\" Ibnu Umar, \"Kemudian aku bertanya kepada Shuhaib, \"Bagaimana beliau menjawab salam mereka?\" Ia menjawab, \"Seperti ini.\" lalu ia berisyarat dengan tangannya.\" "
            },
            {
                "number": 976,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Bertasbih untuk laki-laki dan tepuk tangan untuk untuk wanita.\""
            },
            {
                "number": 977,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَابَكُمْ فِي صَلَاتِكُمْ شَيْءٌ فَلْيُسَبِّحْ الرِّجَالُ وَلْتُصَفِّحْ النِّسَاءُ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْجُمَحِيُّ وَعَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ وَعَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ وَسُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu Hazim] dari [Sahl bin Sa'd], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dalam sholat kalian terjadi sesuatu, maka hendaknya laki-laki bertasbih dan wanita bertepuk tangan.\" Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sa'id? bin Abdurrahman Al Jumahi] dan [Abdul Aziz bin Muhammad] dan [Abdul Aziz bin Abu Hazim] serta [Sufyan bin 'Uyainah] dari [Abu Hazim] dari [Sahl bin Sa'd] dari Nabi shallallahu 'alaihi wasallam seperti hadits tersebut.\" "
            },
            {
                "number": 978,
                "arab": " أَخْبَرَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِي النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَيْكُمْ بِالصَّلَاةِ فِي بُيُوتِكُمْ فَإِنَّ خَيْرَ صَلَاةِ الْمَرْءِ فِي بَيْتِهِ إِلَّا الْجَمَاعَةَ",
                "id": "Telah mengabarkan kepada kami [Makki bin Ibrahim] telah menceritakan kepada kami [Abdullah bin Sa'id bin Abu Hindun] dari [Abu An Nadlr] dari [Busr bin Sa'id] dari [Zaid bin Tsabit], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya kalian melakukan sholat di rumah kalian, sesungguhnya sebaik-baik sholat seseorang adalah di rumahnya kecuali sholat jama'ah.\""
            },
            {
                "number": 979,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ قَالَ سَمِعْتُ جَابِرَ بْنَ يَزِيدَ بْنِ الْأَسْوَدِ السُّوَائِيَّ يُحَدِّثُ عَنْ أَبِيهِ أَنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ قَالَ فَإِذَا رَجُلَانِ حِينَ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاعِدَانِ فِي نَاحِيَةٍ لَمْ يُصَلِّيَا قَالَ فَدَعَا بِهِمَا فَجِيءَ بِهِمَا تُرْعَدُ فَرَائِصُهُمَا قَالَ مَا مَنَعَكُمَا أَنْ تُصَلِّيَا قَالَا صَلَّيْنَا فِي رِحَالِنَا قَالَ فَلَا تَفْعَلَا إِذَا صَلَّيْتُمَا فِي رِحَالِكُمَا ثُمَّ أَدْرَكْتُمَا الْإِمَامَ فَصَلِّيَا فَإِنَّهَا لَكُمَا نَافِلَةٌ قَالَ فَقَامَ النَّاسُ يَأْخُذُونَ بِيَدِهِ يَمْسَحُونَ بِهَا وُجُوهَهُمْ قَالَ فَأَخَذْتُ بِيَدِهِ فَمَسَحْتُ بِهَا وَجْهِي فَإِذَا هِيَ أَبْرَدُ مِنْ الثَّلْجِ وَأَطْيَبُ رِيحًا مِنْ الْمِسْكِ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha`] ia berkata, saya mendengar [Jabir bin Yazid bin Al Aswad As Suwai] menceritakan dari [Ayahnya], bahwa ia pernah sholat subuh bersama Nabi shallallahu 'alaihi wasallam. Ia berkata, \"Tiba-tiba saat Nabi shallallahu 'alaihi wasallam melaksanakan sholat ada dua orang laki-laki yang sedang duduk di pojok masjid, mereka tidak ikut mengerjakan sholat. Maka beliau minta agar keduanya dipanggil, maka dibawalah mereka berdua ke hadapan beliau dengan bergetar. Beliau lantas bertanya: \"Apakah yang menghalangi kalian untuk melakukan sholat?\" Keduanya menjawab, \"Kami telah melakukan sholat di perjalanan kami.\" Beliau berkata: \"Jangan kalian melakukan hal itu, apabila kalian telah melakukan sholat di perjalanan, kemudian mendapati imam maka lakukanlah sholat, karena sholat tersebut bagi kalian sebagai sholat sunah.\" Kemudian orang-orang memegang tangan beliau dan mengusapkannya ke wajah mereka.\" Yazid (perawi) berkata, \"Kemudian aku memegang tangan beliau dan mengusapkan ke wajahku, ternyata tangan beliau lebih dingin daripada salju, dan lebih harum daripada minyak kasturi.\" "
            },
            {
                "number": 980,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا سُلَيْمَانُ الْأَسْوَدُ عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُصَلِّي وَحْدَهُ فَقَالَ أَلَا رَجُلٌ يَتَصَدَّقُ عَلَى هَذَا فَيُصَلِّي مَعَهُ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Sulaiman Al Aswad] dari [Abu Al Mutawakkil An Naji] dari [Abu Sa'id], bahwa Nabi shallallahu 'alaihi wasallam melihat seorang laki-laki melakukan sholat sendirian, kemudian beliau bersabda: \"Tidakkah ada seseorang yang bersedekah kepada orang ini, hingga ia melakukan sholat bersamanya?\""
            },
            {
                "number": 981,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا سُلَيْمَانُ الْأَسْوَدُ عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ وَقَدْ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَا رَجُلٌ يَتَصَدَّقُ عَلَى هَذَا فَيُصَلِّي مَعَهُ قَالَ عَبْد اللَّهِ يُصَلِّي صَلَاةَ الْعَصْرِ وَيُصَلِّي الْمَغْرِبَ وَلَكِنْ يَشْفَعُ",
                "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Sulaiman Al Aswad] dari [Abu Al Mutawakkil An Naji] dari [Abu Sa'id Al Khudri], bahwa seorang laki-laki masuk ke dalam masjid sementara Nabi shallallahu 'alaihi wasallam telah melaksanakan sholat. Kemudian beliau berkata: \"Tidakkah ada seseorang yang bersedekah kepada orang ini sehingga ia melakukan sholat bersamanya?\" Abdullah berkata, \"Ia sholat asar dan maghrib, tetapi harus genap.\" "
            },
            {
                "number": 982,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ هِشَامٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ أَيُصَلِّي الرَّجُلُ فِي الثَّوْبِ الْوَاحِدِ قَالَ أَوَ كُلُّكُمْ يَجِدُ ثَوْبَيْنِ أَوْ لِكُلِّكُمْ ثَوْبَانِ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin 'Amir] dari [Hisyam] dari [Muhammad] dari [Abu Hurairah], bahwa seorang laki-laki berkata, \"Wahai Rasulullah, apakah seorang laki-laki boleh melakukan sholat dengan memakai satu pakaian? Beliau berkata: \"Apakah setiap kalian mendapatkan dua pakaian?\" Atau beliau mengatakan: \"Apakah setiap kalian memiliki dua pakaian?\""
            },
            {
                "number": 983,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى وَمُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّيَنَّ أَحَدُكُمْ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى عَاتِقِهِ مِنْهُ شَيْءٌ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dan [Muhammad bin Yusuf] dari [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkata: \"Janganlah salah seorang di antara kalian melakukan sholat dengan memakai satu pakaian yang tidak ada sesuatu yang menutupi pundaknya! \""
            },
            {
                "number": 984,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لِبْسَتَيْنِ أَنْ يَحْتَبِيَ أَحَدُكُمْ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ بَيْنَ فَرْجِهِ وَبَيْنَ السَّمَاءِ شَيْءٌ وَعَنْ الصَّمَّاءِ اشْتِمَالِ الْيَهُودِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari dua cara berpakaian; salah seorang dari kalian berihtiba` dengan mengenakan satu kain, antara kemaluan dan langit tidak ada yang menutupinya. Dan pakaian shamma` Yahudi (yang tidak ada tempat keluar untuk kedua tangannya).\" "
            },
            {
                "number": 985,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ وَأَبُو الْوَلِيدِ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ مَيْمُونَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي عَلَى الْخُمْرَةِ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin 'Amir] dan [Abu Al Walid] dari [Syu'bah] dari [Sulaiman Asy Syaibani] dari [Abdullah bin Syaddad] dari [Maimunah], bahwa Rasulullah shallallahu 'alaihi wasallam pernah melakukan sholat di atas khumrah (tikar kecil untuk muka).\" "
            },
            {
                "number": 986,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ وَعَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَا حَدَّثَنَا مَالِكٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى حَصِيرٍ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] dan [Abdullah bin Maslamah] mereka berkata; telah menceritakan kepada kami [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas], bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat di atas tikar.\""
            },
            {
                "number": 987,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّهُ سَأَلَ أُمَّ حَبِيبَةَ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي الثَّوْبِ الَّذِي يُضَاجِعُكِ فِيهِ قَالَتْ نَعَمْ إِذَا لَمْ يَرَ فِيهِ أَذًى",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Abdul Hamid bin Ja'far] dari [Yazid bin Abu Habib] dari [Mu'awiyah bin Hudaij] dari [Mu'awiyah bin Abu Sufyan], bahwa ia bertanya kepada [Ummu] Habibah, \"Apakah Rasulullah shallallahu 'alaihi wasallam pernah melakukan sholat dengan memakai pakaian yang beliau gunakan di saat menggaulimu?\" Ia menjawab, \"Ya. Jika beliau tidak melihat najis padanya.\" "
            },
            {
                "number": 988,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُخْتِهِ أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سَأَلَهَا هَلْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي الثَّوْبِ الَّذِي يُجَامِعُهَا فِيهِ قَالَتْ نَعَمْ إِذَا لَمْ يَرَ فِيهِ أَذًى",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Laits bin Sa'd] dari [Yazid bin Abu Habib] dari [Suwaid bin Qais] dari [Mu'awiyah bin Hudaij] dari [Mu'awiyah bin Abu Sufyan] dari saudarinya [Ummu Habibah] isteri Nabi shallallahu 'alaihi wasallam, bahwa ia bertanya kepadanya, \"Apakah Nabi shallallahu 'alaihi wasallam pernah melakukan sholat dengan memakai pakaian yang beliau pakai di saat menggaulinya?\" Ummu Habibah menjawab, \"Ya. Jika tidak melihat najis padanya.\" "
            },
            {
                "number": 989,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا شُعْبَةُ عَنْ أَبِي مَسْلَمَةَ هُوَ سَعِيدُ بْنُ يَزِيدَ الْأَزْدِيُّ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي نَعْلَيْهِ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Syu'bah] dari [Abu Maslamah] -yaitu Sa'id bin Yazid Al Azdi- ia berkata, aku pernah bertanya kepada [Anas bin Malik], \"Apakah Rasulullah shallallahu 'alaihi wasallam pernah sholat dengan memakai kedua sandal beliau?\" Ia menjawab, \"Ya.\" "
            },
            {
                "number": 990,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ وَأَبُو النُّعْمَانِ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي نَعَامَةَ السَّعْدِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِأَصْحَابِهِ إِذْ خَلَعَ نَعْلَيْهِ فَوَضَعَهُمَا عَنْ يَسَارِهِ فَخَلَعُوا نِعَالَهُمْ فَلَمَّا قَضَى صَلَاتَهُ قَالَ مَا حَمَلَكُمْ عَلَى إِلْقَائِكُمْ نِعَالَكُمْ قَالُوا رَأَيْنَاكَ خَلَعْتَ فَخَلَعْنَا قَالَ إِنَّ جِبْرِيلَ أَتَانِي أَوْ آتٍ فَأَخْبَرَنِي أَنَّ فِيهِمَا أَذًى أَوْ قَذَرًا فَإِذَا جَاءَ أَحَدُكُمْ الْمَسْجِدَ فَلْيُقَلِّبْ نَعْلَيْهِ فَإِنْ رَأَى فِيهِمَا أَذًى فَلْيُمِطْ وَلْيُصَلِّ فِيهِمَا",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] dan [Abu An Nu'man] mereka berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu Na'amah As Sa'di] dari [Abu Nadlrah] dari [Abu Sa'id Al Khudri] ia berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam melakukan sholat bersama para sahabatnya tiba-tiba beliau melepas kedua sandalnya dan meletakkannya di samping kirinya. Maka mereka pun ikut melepas sandal mereka. Selesai sholat beliau berkata: \"Apa yang mendorong kalian untuk melepaskan sandal kalian?\" Mereka berkata, \"Kami melihat anda melepas sandal maka kami pun melepas sandal.\" Beliau bersabda: \"Sesungguhnya Jibril telah datang kepadaku dan memberitahuku bahwa pada kedua sandal tersebut terdapat najis atau kotoran, maka apabila salah seorang di antara kalian datang ke masjid hendaknya ia membalikkan kedua sandalnya, jika ia melihat padanya terdapat najis maka hendaknya ia menghilangkannya dan melakukan sholat dengan memakai keduanya.\""
            },
            {
                "number": 991,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ عِسْلٍ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ كَرِهَ السَّدْلَ وَرَفَعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Sa'id? bin 'Amir] dari [Sa'id? bin Abu 'Arubah] dari ['Isl] dari ['Atha`] dari [Abu Hurairah], bahwa ia tidak suka untuk membiarkan kain hingga menyentuh tanah.\" Ia menyandarkan hal tersebut kepada Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 992,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ مِخْوَلٍ عَنْ أَبِي سَعِيدٍ عَنْ أَبِي رَافِعٍ قَالَ رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا سَاجِدٌ وَقَدْ عَقَصْتُ شَعْرِي أَوْ قَالَ عَقَدْتُ فَأَطْلَقَهُ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin 'Amir] dari [Syu'bah] dari [Mikhwal] dari [Abu Sa'id] dari [Abu Rafi'] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melihatku dalam keadaan sujud, sementara aku telah menjalin atau mengikat rambutku, kemudian beliau melepaskannya.\" "
            },
            {
                "number": 993,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي بَكْرٌ هُوَ ابْنُ مُضَرَ عَنْ عَمْرٍو يَعْنِي ابْنَ الْحَارِثِ عَنْ بُكَيْرٍ أَنَّ كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ حَدَّثَهُ أَنَّ ابْنَ عَبَّاسٍ رَأَى عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُصَلِّي وَرَأْسُهُ مَعْقُوصٌ مِنْ وَرَائِهِ فَقَامَ وَرَاءَهُ فَجَعَلَ يَحُلُّهُ وَأَقَرَّ لَهُ الْآخَرُ ثُمَّ انْصَرَفَ إِلَى ابْنِ عَبَّاسٍ فَقَالَ مَا لَكَ وَرَأْسِي قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّمَا مَثَلُ هَذَا كَمَثَلِ الَّذِي يُصَلِّي وَهُوَ مَكْتُوفٌ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Bakr] -yaitu Ibnu Mudlar- dari ['Amru] -yaitu Ibnu Al Harits- dari [Bukair] bahwa [Kuraib mantan budak Ibnu Abbas] menceritakan kepadanya, bahwa [Ibnu Abbas] melihat Abdullah bin Al Harits melakukan sholat sementara rambut kepalanya di jalin pada bagian belakang. Maka Ibnu Abbas berdiri di belakangnya dan melepaskan jalinan tersebut. Sementara orang lain (yang melihatnya) membiarkannya. Kemudian Abdullah bin Al Harits berkata, \"Apa urusanmu dengan rambutku?\" Ibnu Abbas menjawab, \"Sesungguhnya aku telah mendengar Rasulullah shallallahu 'alaihi wasallam berkata: \"Sungguh, permisalan orang yang melakukan ini seperti orang yang sholat sementara tangannya terikat ke pundaknya.\""
            },
            {
                "number": 994,
                "arab": " أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ هُوَ ابْنُ مُحَمَّدٍ عَنْ سُهَيْلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَشُدَّ يَدَهُ فَإِنَّ الشَّيْطَانَ يَدْخُلُ قَالَ أَبُو مُحَمَّد يَعْنِي عَلَى فِيهِ",
                "id": "Telah mengabarkan kepada kami [Nu'aim bin Hammad] telah menceritakan kepada kami [Abdul Aziz] -yaitu Ibnu Muhammad- dari [Suhail] dari [Abdurrahman bin Abu Sa'id] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang di antara kalian menguap hendaknya menutupkan tangannya, karena setan akan masuk.\" Abu Muhammad berkata, \"(Yakni) ke mulutnya.\" "
            },
            {
                "number": 995,
                "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا وَجَدَ أَحَدُكُمْ النَّوْمَ وَهُوَ يُصَلِّي فَلْيَنَمْ حَتَّى يَذْهَبَ نَوْمُهُ فَإِنَّهُ عَسَى يُرِيدُ أَنْ يَسْتَغْفِرَ فَيَسُبَّ نَفْسَهُ",
                "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah di antara kalian mengantuk saat sholat hendaknya ia tidur hingga hilang kantuknya, karena bisa jadi ia hendak beristighfar namun ia mencela dirinya.\""
            },
            {
                "number": 996,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا جَعْفَرٌ هُوَ ابْنُ الْحَارِثِ عَنْ مَنْصُورٍ عَنْ هِلَالٍ عَنْ أَبِي يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ بَلَغَنِي أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الرَّجُلِ جَالِسًا نِصْفُ الصَّلَاةِ قَالَ فَدَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي جَالِسًا فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُ بَلَغَنِي أَنَّكَ قُلْتَ صَلَاةُ الرَّجُلِ جَالِسًا نِصْفُ الصَّلَاةِ وَأَنْتَ تُصَلِّي جَالِسًا قَالَ أَجَلْ وَلَكِنِّي لَسْتُ كَأَحَدٍ مِنْكُمْ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Ja'far] -yaitu Ibnu Al Harits- dari [Manshur] dari [Hilal] dari [Abu Yahya] dari [Abdullah bin 'Amru] ia berkata, \"Telah sampai kepadaku berita bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"sholat seorang laki-laki dengan duduk pahalanya setengah sholat.\" Abdullah berkata, \"Kemudian aku menemui Nabi shallallahu 'alaihi wasallam sementara beliau sholat dalam keadaan duduk. Aku lalu berkata, \"Wahai Rasulullah! Telah sampai kabar kepadaku bahwa tuan mengatakan, 'sholat seorang laki-laki dengan duduk pahalanya setengah sholat', tetapi kenapa tuan sendiri sholat dengan duduk. Beliau lalu menjawab: \"Benar, tetapi aku tidak seperti salah seorang diantara kalian.\""
            },
            {
                "number": 997,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي السَّائِبُ بْنُ يَزِيدَ عَنْ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ أَنَّ حَفْصَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ لَمْ أَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي سُبْحَتِهِ وَهُوَ جَالِسٌ حَتَّى كَانَ قَبْلَ أَنْ يُتَوَفَّى بِعَامٍ وَاحِدٍ أَوْ عَامَيْنِ فَرَأَيْتُهُ يُصَلِّي فِي سُبْحَتِهِ وَهُوَ جَالِسٌ فَيُرَتِّلُ السُّورَةَ حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ عَنْ حَفْصَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [As Sa`ib bin Yazid] dari [Al Muththalib bin Abu Wada'ah] bahwa [Hafshah] isteri Nabi shallallahu 'alaihi wasallam berkata, \"Aku belum pernah melihat Rasulullah shallallahu 'alaihi wasallam melakukan sholat sunah dalam keadaan duduk hingga satu atau dua tahun sebelum beliau meninggal. Kemudian aku melihat beliau melakukan sholat sunah dalam keadaan duduk, beliau membaca surat dengan tartil hingga menjadi surat yang paling panjang daripada surat yang paling panjang.\" Telah mengabarkan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Malik] dari [Az Zuhri] dari [As Saib bin Yazid] dari [Al Muththalib bin Abu Wada'ah] dari [Hafshah] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini.\""
            },
            {
                "number": 998,
                "arab": " حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ حَدَّثَنِي مُعَيْقِيبٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِيلَ لَهُ فِي الْمَسْحِ فِي الْمَسْجِدِ قَالَ إِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَوَاحِدَةً قَالَ هِشَامٌ أُرَاهُ قَالَ مَسْحِ الْحَصَا",
                "id": "Telah mengabarkan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya bin Abu Katsir] dari [Abu Salamah] telah menceritakan kepadaku [Mu'aiqib], bahwa Rasulullah shallallahu 'alaihi wasallam ditanya mengenai mengusap pasir (saat sholat) di masjid. Beliau lalu menjawab: \"Apabila engkau harus melakannya maka lakukanlah satu kali.\" Hisyam berkata, \"Menurutku ia menyebutkan, \"Mengusap pasir.\" "
            },
            {
                "number": 999,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ إِلَى الصَّلَاةِ فَإِنَّ الرَّحْمَةَ تُوَاجِهُهُ فَلَا يَمْسَحْ الْحَصَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Abu Al Ahwash] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian berdiri untuk melakukan sholat maka sesungguhnya rahmat berhadapan dengannya, maka janganlah ia mengusap pasir.\""
            },
            {
                "number": 1000,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا سَيَّارٌ قَالَ سَمِعْتُ يَزِيدَ الْفَقِيرَ يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُعْطِيتُ خَمْسًا لَمْ يُعْطَهُنَّ نَبِيٌّ قَبْلِي كَانَ النَّبِيُّ يُبْعَثُ إِلَى قَوْمِهِ خَاصَّةً وَبُعِثْتُ إِلَى النَّاسِ كَافَّةً وَأُحِلَّتْ لِيَ الْمَغَانِمُ وَحُرِّمَتْ عَلَى مَنْ كَانَ قَبْلِي وَجُعِلَتْ لِيَ الْأَرْضُ طَيِّبَةً مَسْجِدًا وَطَهُورًا وَيَرْعَبُ مِنَّا عَدُوُّنَا مَسِيرَةَ شَهْرٍ وَأُعْطِيتُ الشَّفَاعَةَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Sayyar] ia berkata, saya mendengar [Yazid Al Faqir] berkata, saya mendengar [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku diberi lima perkara yang tidak diberikan kepada seorang nabi pun sebelumnya; setiap nabi diutus khusus kepada kaumnya dan aku diutus untuk manusia secara menyeluruh, dihalalkan bagiku harta rampasan perang dan diharamkan atas orang sebelumku, bumi dijadikan bagiku sebagai tempat sujud dan bersuci, musuh merasa takut kepada kami sejauh perjalanan satu bulan, dan aku diberi syafa'at.\""
            },
            {
                "number": 1001,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ أَنَا سَأَلْتُهُ عَنْهُ قَالَ أَخْبَرَنِي عَمْرُو بْنُ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَرْضُ كُلُّهَا مَسْجِدٌ إِلَّا الْمَقْبَرَةَ وَالْحَمَّامَ قِيلَ لِأَبِي مُحَمَّدٍ تُجْزِئُ الصَّلَاةُ فِي الْمَقْبَرَةِ قَالَ إِذَا لَمْ تَكُنْ عَلَى الْقَبْرِ فَنَعَمْ وَقَالَ الْحَدِيثُ أَكْثَرُهُمْ أَرْسَلُوهُ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin Manshur] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] -aku bertanya kepadanya tentangnya- ia berkata; telah mengabarkan kepadaku ['Amru bin Yahya] dari [Ayahnya] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seluruh bumi adalah masjid, kecuali kuburan dan kamar mandi.\" Abu Muhammad ditanya, \"Apakah sholat di kuburan sah?\" Ia menjawab, \"Selama tidak di atas kuburan maka sholatnya sah.\" Dan ia berkata, \"Kebanyakan ahli hadits telah memursalkan hadits tersebut.\" "
            },
            {
                "number": 1002,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ مِنْهَالٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَضَرَتْ الصَّلَاةُ فَلَمْ تَجِدُوا إِلَّا مَرَابِضَ الْغَنَمِ وَأَعْطَانَ الْإِبِلِ فَصَلُّوا فِي مَرَابِضِ الْغَنَمِ وَلَا تُصَلُّوا فِي أَعْطَانِ الْإِبِلِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Minhal] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Hisyam bin Hassan] dari [Muhammad] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila telah masuk waktu sholat dan kalian tidak mendapatkan tempat kecuali kandang kambing dan kandang unta, maka sholatlah di kandang kambing dan jangan kalian melakukan sholat di kandang unta.\" "
            },
            {
                "number": 1003,
                "arab": " حَدَّثَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ حَدَّثَنِي أَبِي عَنْ مَحْمُودِ بْنِ لَبِيدٍ أَنَّ عُثْمَانَ لَمَّا أَرَادَ أَنْ يَبْنِيَ الْمَسْجِدَ كَرِهَ النَّاسُ ذَلِكَ فَقَالَ عُثْمَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَنَى لِلَّهِ مَسْجِدًا بَنَى اللَّهُ لَهُ فِي الْجَنَّةِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Abdul Hamid bin Ja'far] telah menceritakan kepadaku [Ayahku] dari [Mahmud bin Labid], bahwa saat Utsman akan membangun masjid, maka orang-orang merasa tidak menyukai hal tersebut. Kemudian [Utsman] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membangun masjid maka Allah akan membangunkan baginya seperti itu di Surga.\""
            },
            {
                "number": 1004,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ وَفُلَيْحُ بْنُ سُلَيْمَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَاءَ أَحَدُكُمْ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Malik bin Anas] dan [Fulaih bin Sulaiman] dari ['Amir bin Abdullah bin Az Zubair] dari ['Amru bin Sulaim] dari [Abu Qatadah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang di antara kalian datang ke masjid, maka hendaknya ia sholat dua rakaat sebelum duduk.\""
            },
            {
                "number": 1005,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ سُوَيْدٍ قَالَ سَمِعْتُ أَبَا حُمَيْدٍ أَوْ أَبَا أُسَيْدٍ الْأَنْصَارِيَّ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلْيُسَلِّمْ عَلَى النَّبِيِّ ثُمَّ لِيَقُلْ اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَإِذَا خَرَجَ فَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah mengabarkan kepada kami [Abdul 'Aziz bin Muhammad] dari [Rabi'ah bin Abu Abdurrahman] dari [Abdul Malik bin Sa'id bin Suwaid] ia berkata, saya mendengar [Abu Humaid] atau [Abu Usaid Al Anshari] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian memasuki masjid maka hendaknya ia mengucapkan salam kepada Nabi kemudian mengucapkan: 'ALLAAHUMMAFTAH LII ABWAABA RAHMATIKA (Ya Allah, bukakanlah untukku pintu-pintu rahmat-Mu).' Dan jika akan keluar hendaknya mengucapkan: 'ALLAAHUMMA INNII AS-ALUKA MIN FADLLIK (Ya Allah, sesungguhnya aku memohon karunia-Mu).\" "
            },
            {
                "number": 1006,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ قَالَ قُلْتُ لِقَتَادَةَ أَسَمِعْتَ أَنَسًا يَقُولُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبُزَاقُ فِي الْمَسْجِدِ خَطِيئَةٌ قَالَ نَعَمْ وَكَفَّارَتُهَا دَفْنُهَا",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] ia berkata, \"Aku katakan kepada [Qatadah], \"Apakah engkau pernah mendengar [Anas] berkata dari Nabi shallallahu 'alaihi wasallam: \"Meludah di masjid adalah sebuah kesalahan?\" Ia menjawab, \"Ya. Dan kafarahnya adalah dengan memendamnya.\" "
            },
            {
                "number": 1007,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حُمَيْدٌ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْعَبْدَ إِذَا صَلَّى فَإِنَّمَا يُنَاجِي رَبَّهُ أَوْ رَبُّهُ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ فَإِذَا بَزَقَ أَحَدُكُمْ فَلْيَبْصُقْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ أَوْ يَقُولُ هَكَذَا وَبَزَقَ فِي ثَوْبِهِ وَدَلَكَ بَعْضَهُ بِبَعْضٍ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Humaid] dari [Anas], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang hamba melaksanakan sholat maka sesungguhnya ia sedang berdialog dengan Tuhannya, atau Tuhannya berada di antara dirinya dan Kiblat. Kemudian apabila salah seorang di antara kalian meludah, maka hendaknya ia meludah ke samping kirinya atau di bawah kakinya.\" Atau beliau mengatakan: \"Meludah di pakaiannya dan menggosok sebagian kainnya dengan sebagian yang lain.\" "
            },
            {
                "number": 1008,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ إِذْ رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ فَتَغَيَّظَ عَلَى أَهْلِ الْمَسْجِدِ وَقَالَ إِنَّ اللَّهَ قِبَلَ أَحَدِكُمْ إِذَا كَانَ فِي صَلَاتِهِ فَلَا يَبْزُقَنَّ أَوْ قَالَ لَا يَتَنَخَّعَنَّ ثُمَّ أَمَرَ بِهَا فَحُكَّ مَكَانُهَا وَأَمَرَ بِهَا فَلُطِخَتْ قَالَ حَمَّادٌ لَا أَعْلَمُهُ إِلَّا قَالَ بِزَعْفَرَانٍ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Ketika Nabi shallallahu 'alaihi wasallam berkhutbah, tiba-tiba beliau melihat ludah di kiblat masjid. Maka beliau marah kepada penghuni masjid seraya bersabda: \"Sesungguhnya Allah berada di hadapan salah seorang dari kalian saat ia sedang sholat, maka janganlah ia meludah atau membuang ingus! \" Kemudian beliau memerintahkan agar dibersihkan, maka ludah itu pun dikerik dan beliau memerintahkan agar ludah tersebut dilumuri (timbun dengan debu).\" Hammad berkata, \"Aku tidak mengetahuinya kecuali ia berkata, \"Dengan Za'faran.\" "
            },
            {
                "number": 1009,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا سَعِيدٍ وَأَبَا هُرَيْرَةَ أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى نُخَامَةً فِي جِدَارِ الْمَسْجِدِ فَتَنَاوَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَصَاةً وَحَتَّهَا ثُمَّ قَالَ إِذَا تَنَخَّمَ أَحَدُكُمْ فَلَا يَتَنَخَّمَنَّ قِبَلَ وَجْهِهِ وَلَا عَنْ يَمِينِهِ وَلْيَبْصُقْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Az Zuhri] dari [Humaid bin Abdurrahman] bahwa [Abu Sa'id] dan [Abu Hurairah] telah mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam melihat ingus di dinding masjid, kemudian Rasulullah shallallahu 'alaihi wasallam mengambil pasir dan menggosoknya. Setelah itu beliau bersabda: \"Apabila salah seorang di antara kalian membuang dahak, maka janganlah ia membuangnya ke arah depan atau samping kanannya. Hendaklah ia meludah ke samping kirinya atau ke bawah kakinya.\""
            },
            {
                "number": 1010,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ حَدَّثَنَا مُعْتَمِرٌ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ أَبِي حَرْبِ بْنِ أَبِي الْأَسْوَدِ الدِّيلِيِّ عَنْ عَمِّهِ عَنْ أَبِي ذَرٍّ قَالَ أَتَانِي نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا نَائِمٌ فِي الْمَسْجِدِ فَضَرَبَنِي بِرِجْلِهِ قَالَ أَلَا أَرَاكَ نَائِمًا فِيهِ قُلْتُ يَا نَبِيَّ اللَّهِ غَلَبَتْنِي عَيْنِي",
                "id": "Telah menceritakan kepada kami [Sa'id? bin Al Mughirah] telah menceritakan kepada kami [Mu'tamir] dari [Daud bin Abu Hindun] dari [Abu Harb bin Abu Asad Ad Dili] dari [Pamannya] dari [Abu Dzar] ia berkata, \"Nabi shallallahu 'alaihi wasallam datang kepadaku sementara saya sedang tidur di masjid, kemudian beliau mengoyang-goyangku menggunakan kakinya. Beliau berkata: \"Kenapa aku melihat kamu tidur dalam masjid?\" Aku lalu menjawab, \"Aku terkalahkan oleh rasa kantuk.\" "
            },
            {
                "number": 1011,
                "arab": " حَدَّثَنَا مُوسَى بْنُ خَالِدٍ عَنْ أَبِي إِسْحَقَ الْفَزَارِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كُنْتُ أَبِيتُ فِي الْمَسْجِدِ وَلَمْ يَكُنْ لِي أَهْلٌ فَرَأَيْتُ فِي الْمَنَامِ كَأَنَّمَا انْطُلِقَ بِي إِلَى بِئْرٍ فِيهَا رِجَالٌ مُعَلَّقُونَ فَقِيلَ انْطَلِقُوا بِهِ إِلَى ذَاتِ الْيَمِينِ فَذَكَرْتُ الرُّؤْيَا لِحَفْصَةَ فَقُلْتُ قُصِّيهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَصَّتْهَا عَلَيْهِ فَقَالَ مَنْ رَأَى هَذِهِ قَالَتْ ابْنُ عُمَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِعْمَ الْفَتَى أَوْ قَالَ نِعْمَ الرَّجُلُ لَوْ كَانَ يُصَلِّي مِنْ اللَّيْلِ قَالَ وَكُنْتُ إِذَا نِمْتُ لَمْ أَقُمْ حَتَّى أُصْبِحَ قَالَ فَكَانَ ابْنُ عُمَرَ يُصَلِّي اللَّيْلَ",
                "id": "Telah menceritakan kepada kami [Musa bin Khalid] dari [Abu Ishaq Al Fazari] dari ['ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Aku pernah bermalam di masjid, dan aku tidak memiliki keluarga. Kemudian dalam tidur aku bermimpi seolah-olah aku dibawa ke sebuah sumur yang padanya terdapat beberapa orang laki-laki yang bergantungan. Kemudian dikatakan, 'Bawalah ia pergi ke Dzatul yamin.' Kemudian aku menceritakan mimpi tersebut kepada Hafshah, aku katakan, \"Ceritakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam! \" Kemudian ia menceritakannya kepada Rasulullah shallallahu 'alaihi wasallam. Maka beliau pun bersabda: \"Siapa yang mimpi seperti ini?\" Hafshah menjawab, \"Ibnu Umar.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ia adalah sebaik-baik pemuda.\" Atau beliau mengatakan: \"Ia adalah sebaik-baik laki-laki seandainya mau sholat malam.\" Ibnu Umar berkata, \"Jika aku tidur maka aku tidak akan bangun kecuali telah datang subuh.\" Nafi' berkata, \"Setelah itu Ibnu Umar selalu sholat malam.\" "
            },
            {
                "number": 1012,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ أَبِي زَيْدٍ الْكُوفِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ أَخْبَرَنِي يَزِيدُ بْنُ خُصَيْفَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَأَيْتُمْ مَنْ يَبِيعُ أَوْ يَبْتَاعُ فِي الْمَسْجِدِ فَقُولُوا لَا أَرْبَحَ اللَّهُ تِجَارَتَكَ وَإِذَا رَأَيْتُمْ مَنْ يَنْشُدُ فِيهِ الضَّالَّةَ فَقُولُوا لَا أَدَّى اللَّهُ عَلَيْكَ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Abu Zaid Al Kufi] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] telah mengabarkan kepadaku [Yazid bin Khushaifah] dari [Muhammad bin Abdurrahman bin Tsauban] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian melihat orang yang berjualan atau membeli di masjid maka katakan, 'Semoga Allah tidak memberikan keuntungan kepada perniagaanmu.' Dan apabila kalian melihat orang yang mengumumkan di masjid barang hilang, maka katakan, 'Semoga Allah tidak mengembalikannya kepadamu'.\""
            },
            {
                "number": 1013,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ قُلْتُ لِعَمْرِو بْنِ دِينَارٍ أَسَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ مَرَّ رَجُلٌ فِي الْمَسْجِدِ يَحْمِلُ نَبْلًا فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ نُصُولَهَا قَالَ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mubarak] telah menceritakan kepada kami [Sufyan bin 'Uyainah] ia berkata; aku katakan kepada ['Amru bin Dinar], \"Apakah engkau pernah mendengar [Jabir bin Abdullah] berkata, \"Ada seorang laki-laki lewat di masjid membawa anak panah, kemudian Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Peganglah mata panahnya?\" Jabir menjawab, \"Ya.\""
            },
            {
                "number": 1014,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ أَنَّ ابْنَ عَبَّاسٍ وَعَائِشَةَ قَالَا لَمَّا نُزِلَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ فَقَالَ وَهُوَ كَذَلِكَ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ يُحَذِّرُ مِثْلَ مَا صَنَعُوا",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku ['ubaidhullah bin Abdullah] bahwa [Ibnu Abbas] dan [Aisyah] berkata, \"Tatkala Nabi shallallahu 'alaihi wasallam mengalami sakaratul maut beliau menutupkan kainnya ke wajah, dan saat beliau terasa sesak nafasnya beliau membukanya kembali. Lalu beliau bersabda: \"Semoga Allah melaknat orang-orang Yahudi dan Nasrani, mereka telah menjadikan kuburan para nabi mereka sebagai masjid.\" Beliau memberikan peringatan terhadap perbuatan yang sama dengan apa yang mereka lakukan.\""
            },
            {
                "number": 1015,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا دَاوُدُ بْنُ قَيْسٍ الْفَرَّاءُ عَنْ سَعْدِ بْنِ إِسْحَقَ عَنْ أَبِي ثُمَامَةَ الْحَنَّاطِ قَالَ أَدْرَكَنِي كَعْبُ بْنُ عُجْرَةَ بِالْبَلَاطِ وَأَنَا مُشَبِّكٌ بَيْنَ أَصَابِعِي فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَوَضَّأَ أَحَدُكُمْ ثُمَّ خَرَجَ عَامِدًا إِلَى الصَّلَاةِ فَلَا يُشَبِّكُ بَيْنَ أَصَابِعِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Daud bin Qais Al Farra`] dari [Sa'd bin Ishaq] dari [Abu Tsumamah Al Hannath] ia berkata, \" [Ka'b bin 'Ujrah] mendapatiku di Balath (tempat yang padanya terhampar bebatuan di samping masjid Rasulullah shallallahu 'alaihi wasallam) sementara aku dalam keadaan menjalin jari-jariku. Maka ia pun berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam berkata: \"Apabila salah seorang di antara kalian berwudlu kemudian keluar untuk melaksanakan sholat, maka tidak boleh ia menjalin jari-jarinya.\""
            },
            {
                "number": 1016,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ الْمَقْبُرِيِّ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأْتَ فَعَمَدْتَ إِلَى الْمَسْجِدِ فَلَا تُشَبِّكَنَّ بَيْنَ أَصَابِعِكَ فَإِنَّكَ فِي صَلَاةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin 'Ajlan] dari [Al Maqburi] dari [Ka'b bin 'Ujrah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau berwudlu kemudian menuju masjid maka janganlah engkau menjalin jari-jarimu, karena sesungguhnya engkau ada dalam sholat.\""
            },
            {
                "number": 1017,
                "arab": " أَخْبَرَنَا الْهَيْثَمُ بْنُ جَمِيلٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ ثُمَّ خَرَجَ يُرِيدُ الصَّلَاةَ فَهُوَ فِي صَلَاةٍ حَتَّى يَرْجِعَ إِلَى بَيْتِهِ فَلَا تَقُولُوا هَكَذَا يَعْنِي يُشَبِّكُ بَيْنَ أَصَابِعِهِ",
                "id": "Telah mengabarkan kepada kami [Al Haitsam bin Jamil] dari [Muhammad bin Muslim] dari [Isma'il bin Umayyah] dari [Al Maqburi] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berwudlu kemudian keluar untuk melaksanakan sholat, maka ia dalam hitungan sholat hingga ia kembali ke rumahnya. Maka janganlah kalian melakukan demikian, yaitu menjalin jari-jari.\""
            },
            {
                "number": 1018,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَزَالُ الْمَلَائِكَةُ تُصَلِّي عَلَى الْعَبْدِ مَا دَامَ فِي مُصَلَّاهُ الَّذِي يُصَلِّي فِيهِ مَا لَمْ يَقُمْ أَوْ يُحْدِثْ تَقُولُ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Malaikat senantiasa mendo'akan seorang hamba selama ia berada di tempat sholat yang ia gunakan untuk sholat, selama belum berdiri atau berhadats. Malaikat berdo'a: 'ALLAAHUMMAGHFIR LAHU, ALLAAHUMMARHAMHU (Ya Allah ampunilah dia. Ya Allah rahmatilah dia).\" "
            },
            {
                "number": 1019,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَتَبَاهَى النَّاسُ فِي الْمَسَاجِدِ",
                "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah terjadi Hari Kiamat hingga orang-orang saling membangga-banggakan masjid.\""
            },
            {
                "number": 1020,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ يَقُولُ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْبَطْحَاءِ بِالْهَاجِرَةِ فَصَلَّى الظُّهْرَ رَكْعَتَيْنِ وَالْعَصْرَ رَكْعَتَيْنِ وَبَيْنَ يَدَيْهِ عَنَزَةٌ وَإِنَّ الظُّعُنَ لَتَمُرُّ بَيْنَ يَدَيْهِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam bin 'Utaibah] ia berkata, saya mendengar [Abu Juhaifah] berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar di Bathha` pada saat siang terik, kemudian beliau melakukan sholat zhuhur dua rakaat dan sholat asar dua rakaat sementara di depan beliau terdapat sebuah tombak. Dan sungguh seekor kambing lewat di hadapan beliau.\""
            },
            {
                "number": 1021,
                "arab": " أَخْبَرَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ تُرْكَزُ لَهُ الْعَنَزَةُ يُصَلِّي إِلَيْهَا",
                "id": "Telah mengabarkan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar], bahwa pernah ditancapkan sebuah tombak di hadapan Rasulullah shallallahu 'alaihi wasallam, lalu beliau sholat menghadap ke arahnya.\" "
            },
            {
                "number": 1022,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّمَا هُوَ شَيْطَانٌ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Zaid bin Aslam] dari [Abdurrahman bin Abu Sa'id] dari [Abu Sa'id Al Khudri], bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Jika salah seorang di antara kalian sholat janganlah membiarkan seseorang lewat di hadapannya, jika menolak maka hendaklah ia memeranginya. Sebab itu adalah setan.\" "
            },
            {
                "number": 1023,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ أَبِي خَالِدٍ الْأَحْمَرِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي إِلَى رَاحِلَتِهِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] dan [Abdullah bin Sa'id] dari [Abu Khalid Al Ahmar] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam pernah melakukan sholat menghadap ke kendaraannya.\""
            },
            {
                "number": 1024,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي وَهِيَ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ عَلَى فِرَاشِ أَهْلِهِ اعْتِرَاضَ الْجَنَازَةِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepada kami [Al Laits] telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] telah menceritakan kepadaku ['Urwah bin Az Zubair] bahwa [Aisyah] telah mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam pernah sholat sementara dirinya ada di antara beliau dan arah kiblat, tidur di seperti melintangnya jenazah.\" "
            },
            {
                "number": 1025,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ وَحَجَّاجٌ قَالَا حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي حُمَيْدُ بْنُ هِلَالٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الصَّامِتِ عَنْ أَبِي ذَرٍّ أَنَّهُ قَالَ يَقْطَعُ صَلَاةَ الرَّجُلِ إِذَا لَمْ يَكُنْ بَيْنَ يَدَيْهِ كَآخِرَةِ الرَّحْلِ الْحِمَارُ وَالْكَلْبُ الْأَسْوَدُ وَالْمَرْأَةُ قَالَ قُلْتُ فَمَا بَالُ الْأَسْوَدِ مِنْ الْأَحْمَرِ مِنْ الْأَصْفَرِ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا سَأَلْتَنِي فَقَالَ الْأَسْوَدُ شَيْطَانٌ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid] dan [Hajjaj] mereka berkata; telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Humaid bin Hilal] ia berkata, saya mendengar [Abdullah bin Ash Shamit] dari [Abu Dzar] bahwa ia berkata, \"sholat seorang laki-laki bisa terputus (batal) oleh keledai, anjing hitam dan wanita jika antara dirinya dengan arah depannya tidak ada (pembatas) seperti bagian belakang pelana.\" Abdullah berkata, \"Aku bertanya, \"Apa bedanya antara hitam dan merah serta kuning?\" Abu Dzar menjawab, \"Aku pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam sebagaimana yang engkau tanyakan kepadaku, kemudian beliau menjawab: \"Anjing hitam adalah setan.\" "
            },
            {
                "number": 1026,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ جِئْتُ أَنَا وَالْفَضْلُ يَعْنِي عَلَى أَتَانٍ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِمِنًى أَوْ بِعَرَفَةَ فَمَرَرْتُ عَلَى بَعْضِ الصَّفِّ فَنَزَلْتُ عَنْهَا وَتَرَكْتُهَا تَرْعَى وَدَخَلْتُ فِي الصَّفِّ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] ia berkata, \"Aku dan Al Fadll datang dengan mengendarai keledai, sementara Nabi shallallahu 'alaihi wasallam sedang melaksanakan sholat di Mina, atau Arafah. Aku lalu melintasi sebagian shaf, aku lalu turun dan membiarkan keledai itu merumput. Setelah itu aku masuk ke dalam shaf.\""
            },
            {
                "number": 1027,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ أَخْبَرَنَا ابْنُ عُيَيْنَةَ عَنْ سَالِمٍ أَبِي النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍ قَالَ أَرْسَلَنِي أَبُو جُهَيْمٍ الْأَنْصَارِيُّ إِلَى زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَسْأَلُهُ مَا سَمِعَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يَمُرُّ بَيْنَ يَدَيْ الْمُصَلِّي فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ يَقُومَ أَحَدُكُمْ أَرْبَعِينَ خَيْرٌ لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْ الْمُصَلِّي قَالَ فَلَا أَدْرِي سَنَةً أَوْ شَهْرًا أَوْ يَوْمًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah mengabarkan kepada kami [Ibnu 'Uyainah] dari [Salim Abu An Nadlr] dari [Busr bin Sa'id] ia berkata; Abu Juhaim Al Anshari mengutusku datang kepada [Zaid bin Khalid Al Juhani] untuk bertanya kepadanya apa yang pernah ia dengar dari Nabi shallallahu 'alaihi wasallam, tentang setatus orang yang lewat di hadapan orang yang melakukan sholat. Kemudian ia menjawab, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, salah seorang di antara kalian berdiri selama empat puluh, adalah lebih baik baginya daripada lewat di hadapan orang yang sedang melakukan sholat.\" Zaid bin Khalid Al Juhani berkata, \"Aku tidak tahu apakah tahun, atau bulan, atau hari.\""
            },
            {
                "number": 1028,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ أَنَّ بُسْرَ بْنَ سَعِيدٍ أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَرْسَلَهُ إِلَى أَبِي جُهَيْمٍ يَسْأَلُهُ مَاذَا سَمِعَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي الْمَارِّ بَيْنَ يَدَيْ الْمُصَلِّي فَقَالَ أَبُو جُهَيْمٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَيْ الْمُصَلِّي مَاذَا عَلَيْهِ فِي ذَلِكَ لَكَانَ أَنْ يَقِفَ أَرْبَعِينَ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ قَالَ أَبُو النَّضْرِ لَا أَدْرِي أَرْبَعِينَ يَوْمًا أَوْ شَهْرًا أَوْ سَنَةً",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Abu An Nadlr] mantan budak Umar bin 'ubaidhullah bin Ma'mar, bahwa [Busr bin Sa'id] mengabarkan kepadanya, bahwa Zaid bin Khalid Al Juhani telah mengutusnya menemui Abu Juhaim untuk bertanya kepadanya apa yang ia dengar dari Rasulullah shallallahu 'alaihi wasallam mengenai orang yang lewat di hadapan orang yang sedang sholat? Kemudian [Abu Juhaim] menjawab, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila orang yang lewat (di hadapan orang yang sedang sholat) mengetahui dosa apa yang akan ditimpakan kepadanya karenanya, niscaya ia berdiri selama empat puluh adalah lebih baik baginya daripada lewat di hadapannya.\" Abu An Nadlr berkata, \"Aku tidak tahu apakah itu empat puluh hari, atau bulan, atau tahun.\" "
            },
            {
                "number": 1029,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا أَفْلَحُ هُوَ ابْنُ حُمَيْدٍ حَدَّثَنِي أَبُو بَكْرِ بْنُ مُحَمَّدٍ حَدَّثَنِي سَلْمَانُ الْأَغَرُّ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةٌ فِي مَسْجِدِي هَذَا كَأَلْفِ صَلَاةٍ فِيمَا سِوَاهُ مِنْ الْمَسَاجِدِ إِلَّا الْمَسْجِدَ الْحَرَامَ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Aflah] -yaitu Ibnu Humaid- telah menceritakan kepadaku [Abu Bakr bin Muhammad] telah menceritakan kepadaku [Salman Al Aghar] ia berkata, saya mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat di masjidku ini seperti seribu sholat di masjid-masjid yang lain, kecuali Masjid Al Haram.\" "
            }
        ]
    }
}