{
    "status": true,
    "data": {
        "start": 2206,
        "end": 2352,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 2206,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَنْبَأَنَا إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ عَنْ طَلِيقِ بْنِ عِمْرَانَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فَرَّقَ بَيْنَ الْوَالِدَةِ وَوَلَدِهَا وَبَيْنَ الْأَخِ وَبَيْنَ أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Umar bin Hayyaj] berkata, telah menceritakan kepada kami [ubaidhullah bin Musa] berkata, telah memberitakan kepada kami [Ibrahim bin Isma'il] dari [Thaliq bin Imran] dari [Abu Burdah] dari [Abu Musa] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat orang yang memisahkan antara ibu dan anaknya, dan antara saudara dan saudaranya.\""
            },
            {
                "number": 2207,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبَّادُ بْنُ لَيْثٍ صَاحِبُ الْكَرَابِيسِيِّ حَدَّثَنَا عَبْدُ الْمَجِيدِ بْنُ وَهْبٍ قَالَ قَالَ لِي الْعَدَّاءُ بْنُ خَالِدِ بْنِ هَوْذَةَأَلَا نُقْرِئُكَ كِتَابًا كَتَبَهُ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ بَلَى فَأَخْرَجَ لِي كِتَابًا فَإِذَا فِيهِ هَذَا مَا اشْتَرَى الْعَدَّاءُ بْنُ خَالِدِ بْنِ هَوْذَةَ مِنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى مِنْهُ عَبْدًا أَوْ أَمَةً لَا دَاءَ وَلَا غَائِلَةَ وَلَا خِبْثَةَ بَيْعَ الْمُسْلِمِ لِلْمُسْلِمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] berkata, telah menceritakan kepada kami [Abbad bin Laits] teman Al Karabisi berkata, telah menceritakan kepada kami [Abdul Majid bin Wahb] ia berkata; [Al 'Adda bin Khalid bin Haudzah] berkata, \"Maukah kamu aku bacakan sebuah kitab yang ditulis oleh Rasulullah shallallahu 'alaihi wasallam untukku?\" Abdul Majid bin Wahb berkata, \"Aku menjawab, \"Tentu.\" Lalu ia mengeluarkan sebuah kitab kepadaku, dan ternyata di dalamnya terdapat tulisan: \"Ini adalah apa yang telah dibeli Al 'Adda bin Khalid bin Haudzah, dari Muhammad Rasulullah shallallahu 'alaihi wasallam. Dia telah membeli darinya seorang budak lelaki atau budak perempuan yang bebas dari penyakit, tidak jelek dan tidak buruk. Jual beli muslim untuk muslim.\""
            },
            {
                "number": 2208,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَرَى أَحَدُكُمْ الْجَارِيَةَ فَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ وَلْيَدْعُ بِالْبَرَكَةِ وَإِذَا اشْتَرَى أَحَدُكُمْ بَعِيرًا فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَدْعُ بِالْبَرَكَةِ وَلْيَقُلْ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Ibnu 'Ajlan] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian membeli seorang budak perempuan, hendaklah ia mengucapkan; \"ALLAHUMMA INNII AS`ALUKA KHAIRAHAA WA KHAIRA MAA JABALTAHAA 'ALAIHI WA A'UUDZUBIKA MIN SYARRIHAA WA SYARRI MAA JABALTAHAA 'ALAIHI (Ya Allah, sesungguhnya aku meminta kepada-Mu kebaikannya dan kebaikan yang Engkau berikan kepadanya, dan aku berlindung kepada-Mu dari keburukannya dan keburukan yang Engkau berikan kepadanya). Dan hendaklah ia berdo'a meminta berkah. Dan jika salah seorang dari kalian membeli seekor unta hendaklah ia pegang punuk untanya dan berdo'a meminta berkah sebagaimana do`a tersebut.\""
            },
            {
                "number": 2209,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ وَهِشَامُ بْنُ عَمَّارٍ وَنَصْرُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالذَّهَبِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلَّا هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلَّا هَاءَ وَهَاءَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] dan [Hisyam bin Ammar] dan [Nashr bin Ali] dan [Muhammad bin Ash Shabbah] mereka berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Malik bin Aus bin Al Hadatsani An Nashr] ia berkata, \"Aku mendengar [Umar Ibnul Khaththab] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan emas riba kecuali dengan tunai, biji gandum dengan biji gandum riba kecuali dengan tunai, tepung gandum dengan tepung gandum riba kecuali dengan tunai dan kurma dengan kurma riba kecuali dengan tunai.\""
            },
            {
                "number": 2210,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خِدَاشٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ قَالَا حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ التَّمِيمِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ أَنَّ مُسْلِمَ بْنَ يَسَارٍ وَعَبْدَ اللَّهِ بْنَ عُبَيْدٍ حَدَّثَاهُ قَالَاجَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَمُعَاوِيَةَ إِمَّا فِي كَنِيسَةٍ وَإِمَّا فِي بِيعَةٍ فَحَدَّثَهُمْ عُبَادَةُ بْنُ الصَّامِتِ فَقَالَ قَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَرِقِ بِالْوَرِقِ وَالذَّهَبِ بِالذَّهَبِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ وَالتَّمْرِ بِالتَّمْرِ قَالَ أَحَدُهُمَا وَالْمِلْحِ بِالْمِلْحِ وَلَمْ يَقُلْهُ الْآخَرُ وَأَمَرَنَا أَنْ نَبِيعَ الْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَا",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] berkata, telah menceritakan kepada kami [Yazid bin Zurai']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Khalid bin Khidasy] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] keduanya berkata; telah menceritakan kepada kami [Salamah bin Alqamah At Taimi] berkata, telah menceritakan kepada kami [Muhammad bin Sirin] bahwa [Muslim bin Yasar] dan [Abdullah bin Ubaid] menceritakan kepadanya, keduanya berkata; Ubadah bin Ash Shamit dan Mu'awiyah berkumpul dalan sebuah rumah, yaitu dalam sebuah gereja, atau sinagog. [Ubadah bin Ash Shamit] menceritakan kepada mereka, ia mengatakan, \"Rasulullah shallallahu 'alaihi wasallam melarang kami untuk menjual perak dengan perak, emas dengan emas, biji gandum dengan biji gandum, tepung gandum dengan tepung gandum, dan kurma dengan kurma. Salah seorang dari keduanya berkata, \"Garam dengan garam -ini tidak disebutkan oleh yang lain- dan beliau memerintahkan kepada kami untuk biji gandum dengan tepung gandum, atau tepung gandum dengan biji gandum secara tunai berapa pun yang kami mau.\""
            },
            {
                "number": 2211,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ عَنْ ابْنِ أَبِي نُعْمٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفِضَّةَ بِالْفِضَّةِ وَالذَّهَبَ بِالذَّهَبِ وَالشَّعِيرَ بِالشَّعِيرِ وَالْحِنْطَةَ بِالْحِنْطَةِ مِثْلًا بِمِثْلٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ya'la bin Ubaid] berkata, telah menceritakan kepada kami [Fudlail bin Ghazwan] dari [Ibnu Abu Nu'm] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Perak dengan perak, emas dengan emas, gandum dengan gandum, tepung dengan tepung sebanding.\""
            },
            {
                "number": 2212,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْزُقُنَا تَمْرًا مِنْ تَمْرِ الْجَمْعِ فَنَسْتَبْدِلُ بِهِ تَمْرًا هُوَ أَطْيَبُ مِنْهُ وَنَزِيدُ فِي السِّعْرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَصْلُحُ صَاعُ تَمْرٍ بِصَاعَيْنِ وَلَا دِرْهَمٌ بِدِرْهَمَيْنِ وَالدِّرْهَمُ بِالدِّرْهَمِ وَالدِّينَارُ بِالدِّينَارِ لَا فَضْلَ بَيْنَهُمَا إِلَّا وَزْنًا",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Sa'id] ia berkata, \"Nabi shallallahu 'alaihi wasallam memberi kami kurma dari kurma zakat, lalu kami mengantinya dengan yang lebih baik dengan menambah harga. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Tidak boleh menukar kurma satu sha' dengan dua sha', dan satu dirham dengan dua dirham. Hendaklah satu dirham dengan satu dirham, dan satu dinar dengan satu dinar, tidak ada penambahan antara keduanya kecuali seimbang.\""
            },
            {
                "number": 2213,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُالدِّرْهَمُ بِالدِّرْهَمِ وَالدِّينَارُ بِالدِّينَارِ فَقُلْتُ إِنِّي سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ غَيْرَ ذَلِكَ قَالَ أَمَا إِنِّي لَقِيتُ ابْنَ عَبَّاسٍ فَقُلْتُ أَخْبِرْنِي عَنْ هَذَا الَّذِي تَقُولُ فِي الصَّرْفِ أَشَيْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْ شَيْءٌ وَجَدْتَهُ فِي كِتَابِ اللَّهِ فَقَالَ مَا وَجَدْتُهُ فِي كِتَابِ اللَّهِ وَلَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا الرِّبَا فِي النَّسِيئَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] dari [Abu Shalih] dari [Abu Hurairah], ia berkata, \"Aku mendengar [Abu Sa'id Al Khudri] berkata, \"Satu dirham dengan satu dirham dan satu dinar dengan satu dinar.\" Aku (Abu Hurairah) berkata, \"(Namun) aku pernah mendengar Ibnu Abbas mengatakan dengan sesuatu yang berbeda! Abu Sa'id berkata, \"Aku pernah bertemu dengan Ibnu Abbas, lalu aku berkata kepadanya, \"Kabarkanlah kepadaku bagaimana pendapatmu tentang Sharf, apakah itu sesuatu yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam, atau sesuatu yang engkau dapatkan dari kitabullah?\" [Ibnu Abbas] lantas menjawab, \"Aku tidak mendapatkannya dari kitabullah ataupun sunnah Rasulullah shallallahu 'alaihi wasallam, akan tetapi yang mengabariku seperti itu adalah [Usamah bin Zaid], bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Hanyasanya riba itu ada pada penundaan.\""
            },
            {
                "number": 2214,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ سُلَيْمَانَ بْنِ عَلِيٍّ الرِّبْعِيِّ عَنْ أَبِي الْجَوْزَاءِ قَالَسَمِعْتُهُ يَأْمُرُ بِالصَّرْفِ يَعْنِي ابْنَ عَبَّاسٍ وَيُحَدَّثُ ذَلِكَ عَنْهُ ثُمَّ بَلَغَنِي أَنَّهُ رَجَعَ عَنْ ذَلِكَ فَلَقِيتُهُ بِمَكَّةَ فَقُلْتُ إِنَّهُ بَلَغَنِي أَنَّكَ رَجَعْتَ قَالَ نَعَمْ إِنَّمَا كَانَ ذَلِكَ رَأْيًا مِنِّي وَهَذَا أَبُو سَعِيدٍ يُحَدِّثُ عَنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ الصَّرْفِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah memberitakan kepada kami [Hammad bin Zaid] dari [Sulaiman bin Ali Ar Rib'i] dari [Abu Al Jauza] ia berkata, \"Aku mendengarnya -maksudnya [Ibnu Abbas] - memerintahkan Sharf. Berita itu diriwayatkan darinya (Ibnu Abbas), dan telah sampai kabar kepadaku bahwa ia telah menarik kembali pendapatnya tersebut. Maka aku menemuinya di Makkah dan bertanya kepadanya, \"Telah sampai kepadaku bahwa engkau telah menarik pendapatmu?\" Ibnu Abbas menjawab, \"Benar, hal itu hanya pendapatku saja. Dan ini ada [Abu Sa'id] yang telah meriwayatkan dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau melarang Sharf.\""
            },
            {
                "number": 2215,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ سَمِعَ مَالِكَ بْنَ أَوْسِ بْنِ الْحَدَثَانِ يَقُولُ سَمِعْتُ عُمَرَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالْوَرِقِ رِبًا إِلَّا هَاءَ وَهَاءَقَالَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ سَمِعْتُ سُفْيَانَ يَقُولُ الذَّهَبُ بِالْوَرِقِ احْفَظُوا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] ia mendengar [Malik bin Aus bin Al Hadatsan] berkata; Aku mendengar [Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan perak riba kecuali dengan tunai.\" Abu Bakr bin Abu Syaibah berkata, \"Aku mendengar Sufyan mengatakan, \"Emas dengan perak, ingatlah oleh kalian semua.\""
            },
            {
                "number": 2216,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ قَالَأَقْبَلْتُ أَقُولُ مَنْ يَصْطَرِفُ الدَّرَاهِمَ فَقَالَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ وَهُوَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ أَرِنَا ذَهَبَكَ ثُمَّ ائْتِنَا إِذَا جَاءَ خَازِنُنَا نُعْطِكَ وَرِقَكَ فَقَالَ عُمَرُ كَلَّا وَاللَّهِ لَتُعْطِيَنَّهُ وَرِقَهُ أَوْ لَتَرُدَّنَّ إِلَيْهِ ذَهَبَهُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَرِقُ بِالذَّهَبِ رِبًا إِلَّا هَاءَ وَهَاءَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Ibnu Syihab] dari [Malik bin Aus bin Al Hadatsan] berkata, \"Aku mulai bertanya, \"Siapa yang mau menukar dirham?\" Maka Thalhah bin ubaidhullah -waktu itu ia berada di sisi Umar Ibnul Khaththab- berkata, \"Perlihatkan dan berikanlah kepada kami emas milikmu. Jika pengawalmu datang maka akan kami berikan perak milik kami kepadamu.\" [Umar] lalu berkata, \"Tidak, demi Allah, engkau berikan perak milik kepadanya atau engkau kembalikan emas miliknya! Sungguh, Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Perak dengan emas riba kecuali dengan tunai.\""
            },
            {
                "number": 2217,
                "arab": "حَدَّثَنَا أَبُو إِسْحَقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنِي أَبِي عَنْ أَبِيهِ الْعَبَّاسِ بْنِ عُثْمَانَ بْنِ شَافِعٍ عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لَا فَضْلَ بَيْنَهُمَا فَمَنْ كَانَتْ لَهُ حَاجَةٌ بِوَرِقٍ فَلْيَصْطَرِفْهَا بِذَهَبٍ وَمَنْ كَانَتْ لَهُ حَاجَةٌ بِذَهَبٍ فَلْيَصْطَرِفْهَا بِالْوَرِقِ وَالصَّرْفُ هَاءَ وَهَاءَ",
                "id": "Telah menceritakan kepada kami [Abu Ishaq Asy Syafi'I Ibrahim bin Muhammad bin Al Abbas] berkata, telah menceritakan kepadaku [Bapakku] dari bapaknya [Al Abbas bin Utsman bin Syafi'] dari [Umar bin Muhammad bin Ali bin Abu Thalib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dinar dengan dinar, dirham dengan dirham tidak boleh ada lebih di antara keduanya. Barangsiapa membutuhkan perak, hendaklah ia menukarnya dengan emas. Dan barangsiapa membutuhkan emas, hendaklah dia menukarnya dengan perak. Dan penukaran itu harus dengan tunai.\""
            },
            {
                "number": 2218,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ وَسُفْيَانُ بْنُ وَكِيعٍ وَمُحَمَّدُ بْنُ عُبَيْدِ بْنِ ثَعْلَبَةَ الْحِمَّانِيُّ قَالُوا حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ أَوْ سِمَاكٌ وَلَا أَعْلَمُهُ إِلَّا سِمَاكًا عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَكُنْتُ أَبِيعُ الْإِبِلَ فَكُنْتُ آخُذُ الذَّهَبَ مِنْ الْفِضَّةِ وَالْفِضَّةَ مِنْ الذَّهَبِ وَالدَّنَانِيرَ مِنْ الدَّرَاهِمِ وَالدَّرَاهِمَ مِنْ الدَّنَانِيرِ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِذَا أَخَذْتَ أَحَدَهُمَا وَأَعْطَيْتَ الْآخَرَ فَلَا تُفَارِقْ صَاحِبَكَ وَبَيْنَكَ وَبَيْنَهُ لَبْسٌحَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَقَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim bin Habib] dan [Sufyan bin Waki'] dan [Muhammad bin Ubaid bin Tsa'labah Al Himmani] mereka berkata; telah menceritakan kepada kami [Umar bin Ubaid Ath Thanafisi] berkata, telah menceritakan kepada kami ['Atha bin As Sa`ib] atau [Simak] -aku tidak mengetahuinya kecuali Simak- dari [Sa'id bin Jubair] dari [Ibnu Umar] ia berkata, \"Aku menjual unta, lalu aku mengambil emas senilai perak, dan perak senilai emas, dan dinar senilai dirham, dan dirham senilai dinar. Kemudian hal itu aku tanyakan kepada Nabi shallallahu 'alaihi wasallam, beliau menjawab: \"Jika engkau ambil salah satunya dan engkau berikan yang lain, maka janganlah engkau berpisah dengan saudaramu, sementara antaramu dengannya masih terdapat sisa (percampuran antara emas dengan perak).\" Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Ya'qub bin Ishaq] berkata, telah memberitakan kepada kami [Hammad bin Salamah] dari [Simak bin Harb] dari [Sa'id bin Jubair] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits.\""
            },
            {
                "number": 2219,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَسُوَيْدُ بْنُ سَعِيدٍ وَهَارُونُ بْنُ إِسْحَقَ قَالُوا حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ فَضَاءٍ عَنْ أَبِيهِ عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْرِ سِكَّةِ الْمُسْلِمِينَ الْجَائِزَةِ بَيْنَهُمْ إِلَّا مِنْ بَأْسٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Suwaid bin Sa'id] dan [Harun bin Ishaq] mereka berkata; telah menceritakan kepada kami [Al Mu'tamir bin Sulaiman] dari [Muhammad bin Fadla] dari [Bapaknya] dari [Alqamah bin Abdullah] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang memecah mata uang kaum muslimin yang tersedia di antara mereka kecuali karena bahaya.\""
            },
            {
                "number": 2220,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ وَإِسْحَقُ بْنُ سُلَيْمَانَ قَالَا حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ مَوْلَى الْأَسْوَدِ بْنِ سُفْيَانَ أَنَّ زَيْدًا أَبَا عَيَّاشٍ مَوْلًى لِبَنِي زُهْرَةَ أَخْبَرَهُأَنَّهُ سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنْ اشْتِرَاءِ الْبَيْضَاءِ بِالسُّلْتِ فَقَالَ لَهُ سَعْدٌ أَيَّتُهُمَا أَفْضَلُ قَالَ الْبَيْضَاءُ فَنَهَانِي عَنْهُ وَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ اشْتِرَاءِ الرُّطَبِ بِالتَّمْرِ فَقَالَ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ قَالُوا نَعَمْ فَنَهَى عَنْ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dan [Ishaq bin Sulaiman] keduanya berkata; telah menceritakan kepada kami [Malik bin Anas] dari [Abdullah bin Yazid] -mantan budak Al Aswad bin Sufyan- bahwa [Zaid Abu Ayyasy] -mantan budak bani Zuhrah- mengabarkan kepadanya, bahwa ia bertanya [Sa'd bin Abu Waqash] tentang hukum membeli Baidla (sejenis gandum) dengan alat tukar Sult (sejenis gandum). Sa'd pun ganti bertanya kepadanya, \"Mana yang lebih bagus dari keduanya?\" Zaid menjawab, \"Lebih bagus Baidla.\" Maka Sa'd pun melarang kami dari hal itu. Setelah itu ia berkata, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam saat ditanya tentang hukum membeli kurma muda dengan kurma matang, beliau bersabda: \"Apakah kurma muda akan berkurang jika kering?\" para sahabat menjawab, \"Ya, \" maka beliau pun melarangnya.\""
            },
            {
                "number": 2221,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ أَنْ يَبِيعَ الرَّجُلُ تَمْرَ حَائِطِهِ إِنْ كَانَتْ نَخْلًا بِتَمْرٍ كَيْلًا وَإِنْ كَانَتْ كَرْمًا أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلًا وَإِنْ كَانَتْ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ نَهَى عَنْ ذَلِكَ كُلِّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang jual beli dengan sistem Muzabanah. Muzabanah adalah, seseorang menjual buah yang masih ada dikebun jika itu berupa kurma, dengan kurma dalam takaran. Jika itu berupa anggur, maka ia menjualnya dengan anggur kering dalam takaran. Dan jika itu berupa tanaman, maka ia menjualnya dengan makanan dalam takaran. Dan beliau melarang dari semua itu.\""
            },
            {
                "number": 2222,
                "arab": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ وَسَعِيدُ بْنُ مِينَاءَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ",
                "id": "Telah menceritakan kepada kami [Azhar bin Marwan] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Az Zubair] dari [Sa'id bin Mina] dari [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang jual beli dengan sistem Muhaqalah dan Muzabanah.\" "
            },
            {
                "number": 2223,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ طَارِقِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Thariq bin 'Abdurrahman] dari [Sa'id Ibnul Musayyab] dari [Rafi' bin Khadij] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang jual beli dengan sistem Muhaqalah dan Muzabanah.\" "
            },
            {
                "number": 2224,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الْعَرَايَا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Muhammad bin Ash Shabbah] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Salim] dari [Bapaknya] ia berkata, \" [Zaid bin Tsabit] menceritakan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam memberi keringanan dalam jual beli dengan kurma muda.\""
            },
            {
                "number": 2225,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْخَصَ فِي بَيْعِ الْعَرِيَّةِ بِخَرْصِهَا تَمْرًاقَالَ يَحْيَى الْعَرِيَّةُ أَنْ يَشْتَرِيَ الرَّجُلُ ثَمَرَ النَّخَلَاتِ بِطَعَامِ أَهْلِهِ رُطَبًا بِخَرْصِهَا تَمْرًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Yahya bin Sa'id] dari [Nafi'] dari [Abdullah bin Umar] Bahwasanya ia berkata; telah menceritakan kepadaku [Zaid bin Tsabit] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi keringanan jual-beli kurma muda yang masih dalam pohon dengan ditukar kurma matang (siap santap). Yahya berkomentar, \"Maksud 'Ariyah ialah, seseorang membeli kurma matang (siap santap) dengan alat tukar kurma mentah yang masih dalam pohonnya dengan taksiran yang sepadan, karena kurma itulah makanan keseharian keluarganya."
            },
            {
                "number": 2226,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Sa'id bin Abu Arubah] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundab] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang menjual hewan dengan hewan dengan sistem tempo.\""
            },
            {
                "number": 2227,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ وَأَبُو خَالِدٍ عَنْ حَجَّاجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا بَأْسَ بِالْحَيَوَانِ وَاحِدًا بِاثْنَيْنِ يَدًا بِيَدٍ وَكَرِهَهُ نَسِيئَةً",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dan [Abu Khalid] dari [Hajjaj] dari [Abu Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak apa-apa menukar satu binatang dengan dua binatang secara kontan, dan makruh jika dengan sistem tempo.\""
            },
            {
                "number": 2228,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا الْحُسَيْنُ بْنُ عُرْوَةَ ح و حَدَّثَنَا أَبُو عُمَرَ حَفْصُ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى صَفِيَّةَ بِسَبْعَةِ أَرْؤُسٍ قَالَ عَبْدُ الرَّحْمَنِ مِنْ دِحْيَةَ الْكَلْبِيِّ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Al Husain bin Urwah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Umar Hafsh bin Umar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] keduanya berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] berkata, \"Rasulullah shallallahu 'alaihi wasallam membeli Shafiah dengan menukar tujuh ekor hewan.\" 'Abdurrahman berkata, \"Beliau membeli dari Dihyah Al Kalbi.\""
            },
            {
                "number": 2229,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَبِي الصَّلْتِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَيْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى قَوْمٍ بُطُونُهُمْ كَالْبُيُوتِ فِيهَا الْحَيَّاتُ تُرَى مِنْ خَارِجِ بُطُونِهِمْ فَقُلْتُ مَنْ هَؤُلَاءِ يَا جِبْرَائِيلُ قَالَ هَؤُلَاءِ أَكَلَةُ الرِّبَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Al Hasan bin Musa] dari [Hammad bin Salamah] dari [Ali bin Zaid] dari [Abu Shalt] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkata: \"Pada malam Isra mi'raj aku mendatangi suatu kaum, perut mereka seperti rumah-rumah yang dihuni oleh ular dan dapat dilihat dari luar perut-perut mereka. Aku pun bertanya: \"Wahai Jibril, siapakah mereka itu?\" ia menjawab, \"Mereka adalah pemakan riba.\""
            },
            {
                "number": 2230,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ أَبِي مَعْشَرٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرِّبَا سَبْعُونَ حُوبًا أَيْسَرُهَا أَنْ يَنْكِحَ الرَّجُلُ أُمَّهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Abu Ma'syar] dari [Sa'id Al Maqburi] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Riba itu mempunyai tujuh puluh tingkatan, yang paling ringan adalah seperti seseorang yang berzina dengan ibunya.\""
            },
            {
                "number": 2231,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ الصَّيْرَفِيُّ أَبُو حَفْصٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ زُبَيْدٍ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرِّبَا ثَلَاثَةٌ وَسَبْعُونَ بَابًا",
                "id": "Telah menceritakan kepada kami [Amru bin Ali Ash Shairafi Abu Hafsh] berkata, telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Zubaid] dari [Ibrahim] dari [Masruq] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Riba itu memiliki tujuh puluh tiga pintu.\""
            },
            {
                "number": 2232,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَإِنَّ آخِرَ مَا نَزَلَتْ آيَةُ الرِّبَا وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُبِضَ وَلَمْ يُفَسِّرْهَا لَنَا فَدَعُوا الرِّبَا وَالرِّيبَةَ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Khalid Ibnul Harits] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Sa'id Ibnul Musayyab] dari [Umar bin Khaththab] ia berkata, \"Sesungguhnya yang terakhir turun adalah ayat riba, dan ketika Rasulullah shallallahu 'alaihi wasallam meninggal beliau belum sempat menjelaskannya kepada kami. Maka tinggalkanlah riba dan keragu-raguan.\""
            },
            {
                "number": 2233,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ آكِلَ الرِّبَا وَمُؤْكِلَهُ وَشَاهِدِيهِ وَكَاتِبَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepada kami [Simak bin Harb] ia berkata; Aku mendengar ['Abdurrahman bin Abdullah] menceritakan dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat pemakan riba, yang mengambilkannya, yang menyaksikannya dan penulisnya.\""
            },
            {
                "number": 2234,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ سَعِيدِ بْنِ أَبِي خَيْرَةَ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ لَا يَبْقَى مِنْهُمْ أَحَدٌ إِلَّا آكِلُ الرِّبَا فَمَنْ لَمْ يَأْكُلْ أَصَابَهُ مِنْ غُبَارِهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Isma'il bin 'Ulayyah] berkata, telah menceritakan kepada kami [Dawud bin Abu Hind] dari [Sa'id bin Abu Khairah] dari [Al Hasan] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Benar-benar akan datang kepada manusia suatu zaman, tidak seorang pun dari mereka kecuali akan memakan riba. Dan barangsiapa tidak memakannya, maka ia akan terkena debunya.\""
            },
            {
                "number": 2235,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ إِسْرَائِيلَ عَنْ الرُّكَيْنِ بْنِ الرَّبِيعِ بْنِ عُمَيْلَةَ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَحَدٌ أَكْثَرَ مِنْ الرِّبَا إِلَّا كَانَ عَاقِبَةُ أَمْرِهِ إِلَى قِلَّةٍ",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Ja'far] berkata, telah menceritakan kepada kami [Amru bin Aun] berkata, telah menceritakan kepada kami [Yahya bin Abu Zaidah] dari [Isra'il] dari [Ar Rukain bin Ar Rabi' bin 'Umailah] dari [Bapaknya] dari [Ibnu Mas'ud] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah seseorang yang memperbanyak riba, melainkan akhir perkaranya akan merugi.\""
            },
            {
                "number": 2236,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ عَنْ أَبِي الْمِنْهَالِ عَنْ ابْنِ عَبَّاسٍ قَالَقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمْ يُسْلِفُونَ فِي التَّمْرِ السَّنَتَيْنِ وَالثَّلَاثَ فَقَالَ مَنْ أَسْلَفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] berkata, telah menceritakan kepada kami [Ibnu Abu Najih] dari [Abdullah bin Katsir] dari [Abu Al Minhal] dari [Ibnu Abbas] ia berkata, \"Nabi shallallahu 'alaihi wasallam datang sementara para sahabat meminjamkan kurma dalam jangka waktu dua atau tiga tahun. Beliau lalu bersabda: \"Barangsiapa memberi pinjaman kurma hendaklah ia lakukan dalam takaran yang jelas, timbangan yang jelas, dan waktu yang jelas.\""
            },
            {
                "number": 2237,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ حَمْزَةَ بْنِ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ بَنِي فُلَانٍ أَسْلَمُوا لِقَوْمٍ مِنْ الْيَهُودِ وَإِنَّهُمْ قَدْ جَاعُوا فَأَخَافُ أَنْ يَرْتَدُّوا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عِنْدَهُ فَقَالَ رَجُلٌ مِنْ الْيَهُودِ عِنْدِي كَذَا وَكَذَا لِشَيْءٍ قَدْ سَمَّاهُ أُرَاهُ قَالَ ثَلَاثُ مِائَةِ دِينَارٍ بِسِعْرِ كَذَا وَكَذَا مِنْ حَائِطِ بَنِي فُلَانٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسِعْرِ كَذَا وَكَذَا إِلَى أَجَلِ كَذَا وَكَذَا وَلَيْسَ مِنْ حَائِطِ بَنِي فُلَانٍ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] dari [Muhammad bin Hamzah bin Yusuf bin Abdullah bin Salam] dari [Bapaknya] dari kakeknya [Abdullah bin Salam] ia berkata, \"Seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam dan bertanya; \"Bani Fulan telah menyerah kepada orang-orang Yahudi, mereka dalam keadaan kelaparan hingga aku merasa khawatir mereka akan murtad.\" Nabi shallallahu 'alaihi wasallam lantas bersabda: \"Siapa yang mempunyai sesuatu? Seorang yahudi lalu berkata, \"Saya memiliki seperti ini dan seperti ini.\" menurutku ia mengatakan, \"Tiga ratus dinar dengan harga seperti ini dan seperti ini dari kebun kurma Bani fulan.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Dengan harga seperti ini dan seperti ini sampai waktu seperti ini dan seperti ini, dan bukan dari kebun kurma Bani fulan.\""
            },
            {
                "number": 2238,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا شُعْبَةُ قَالَ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْمُجَالِدِ وَقَالَ عَبْدُ الرَّحْمَنِ عَنْ ابْنِ أَبِي الْمُجَالِدِ قَالَامْتَرَى عَبْدُ اللَّهِ بْنُ شَدَّادٍ وَأَبُو بُرْدَةَ فِي السَّلَمِ فَأَرْسَلُونِي إِلَى عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى فَسَأَلْتُهُ فَقَالَ كُنَّا نُسْلِمُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَهْدِ أَبِي بَكْرٍ وَعُمَرَ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ وَالتَّمْرِ عِنْدَ قَوْمٍ مَا عِنْدَهُمْ فَسَأَلْتُ ابْنَ أَبْزَى فَقَالَ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dan ['Abdurrahman bin Mahdi] keduanya berkata; telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) [Yahya] berkata; dari [Abdullah bin Abu Al Mujalid]. (dalam jalur lain disebutkan) ['Abdurrahman] berkata dari [Ibnu Abu Al Mujalid] ia berkata, \"Abdullah bin Syaddad dan Abu Burdah berselisih dalam masalah salam, maka mereka mengutusku menemui [Abdullah bin Abu Aufa]. Lantas aku menanyakan hal itu kepadanya, ia menjawab, \"Kami pernah melakukan salam pada masa Rasulullah shallallahu 'alaihi wasallam, Abu Bakar dan Umar dalam tepung, gandum, anggur dan kurma kepada suatu kaum yang tidak memilikinya. Lalu hal itu aku tanyakan juga kepada [Ibnu Abza], dan ia menjawab dengan hal yang sama.\" "
            },
            {
                "number": 2239,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ حَدَّثَنَا زِيَادُ بْنُ خَيْثَمَةَ عَنْ سَعْدٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَسْلَفْتَ فِي شَيْءٍ فَلَا تَصْرِفْهُ إِلَى غَيْرِهِحَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ عَنْ زِيَادِ بْنِ خَيْثَمَةَ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ وَلَمْ يَذْكُرْ سَعْدًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Syuja' bin Al Walid] berkata, telah menceritakan kepada kami [Ziyad bin Khaitsamah] dari [Sa'd] dari ['Atiyyah] dari [Abu Sa'id] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu meminjamkan sesuatu, maka jangan merubahnya kepada sesuatu yang lain.\" Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Syuja' bin Al Walid] dari [Ziyad bin Khaitsamah] dari ['Atiyyah] dari [Abu Sa'id] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda, lalu ia menyebutkan sebagaimana dalam hadits tersebut, hanya saja ia tidak menyebut nama Sa'd.\""
            },
            {
                "number": 2240,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ النَّجْرَانِيِّ قَالَقُلْتُ لِعَبْدِ اللَّهِ بْنِ عُمَرَ أُسْلِمُ فِي نَخْلٍ قَبْلَ أَنْ يُطْلِعَ قَالَ لَا قُلْتُ لِمَ قَالَ إِنَّ رَجُلًا أَسْلَمَ فِي حَدِيقَةِ نَخْلٍ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يُطْلِعَ النَّخْلُ فَلَمْ يُطْلِعْ النَّخْلُ شَيْئًا ذَلِكَ الْعَامَ فَقَالَ الْمُشْتَرِي هُوَ لِي حَتَّى يُطْلِعَ وَقَالَ الْبَائِعُ إِنَّمَا بِعْتُكَ النَّخْلَ هَذِهِ السَّنَةَ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِلْبَائِعِ أَخَذَ مِنْ نَخْلِكَ شَيْئًا قَالَ لَا قَالَ فَبِمَ تَسْتَحِلُّ مَالَهُ ارْدُدْ عَلَيْهِ مَا أَخَذْتَ مِنْهُ وَلَا تُسْلِمُوا فِي نَخْلٍ حَتَّى يَبْدُوَ صَلَاحُهُ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari [An Najrani] ia berkata; Aku berkata kepada [Abdullah Ibnu Umar], \"Aku melelangkan pohon kurma dengan sistem salam sebelum muncul buahnya! \" Ibnu Umar menjawab, \"Tidak boleh.\" Aku bertanya kepadanya, \"Kenapa?\" ia menjawab, \"Pernah seorang laki-laki melelang kebun kurmanya pada masa Rasulullah shallallahu 'alaihi wasallam sebelum muncul buah kurmanya. Namun pada tahun itu buahnya tidak muncul sama sekali. Kemudian si pembeli berkata, \"Dia tetap menjadi milikku hingga pohon itu berbuah. Tetapi si penjual berkata, \"Aku hanya menjual pohon kurma ini setahun saja.\" Hingga keduanya cekcok dan mengadukannya kepada Rasulullah shallallahu 'alaihi wasallam. Beliau lantas bertanya kepada si penjual: \"Apakah dia mengambil sesuatu dari pohon kurmamu? ia menjawab, \"Tidak.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lalu dengan alasan apa kamu menghalalkan hartanya? Kembalikanlah barang yang telah kamu ambil darinya. Dan janganlah kalian melelang pohon kurma sehingga nampak kematangan buahnya.\""
            },
            {
                "number": 2241,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي رَافِعٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا وَقَالَ إِذَا جَاءَتْ إِبِلُ الصَّدَقَةِ قَضَيْنَاكَ فَلَمَّا قَدِمَتْ قَالَ يَا أَبَا رَافِعٍ اقْضِ هَذَا الرَّجُلَ بَكْرَهُ فَلَمْ أَجِدْ إِلَّا رَبَاعِيًا فَصَاعِدًا فَأَخْبَرْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعْطِهِ فَإِنَّ خَيْرَ النَّاسِ أَحْسَنُهُمْ قَضَاءً",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Muslim bin Khalid] berkata, telah menceritakan kepada kami [Zaid bin Aslam] dari ['Atha bin Yasar] dari [Abu Rafi'] berkata, \"Rasulullah shallallahu 'alaihi wasallam meminjam seekor unta muda dari seorang laki-laki. Beliau bersabda: \"Jika unta zakat telah tiba maka akan kami ganti.\" Ketika unta zakat itu telah tiba, beliau bersabda: \"Wahai Abu Rafi', bayarkanlah unta tersebut kepada laki-laki ini.\" Namun aku tidak mendapatkan kecuali unta yang umurnya di atas tujuh tahun lebih, lalu hal itu aku kabarkan kepada Nabi shallallahu 'alaihi wasallam. Beliau bersabda: \"Berikanlah. Sesungguhnya sebaik-baik orang adalah yang paling baik dalam memberikan pembayaran.\""
            },
            {
                "number": 2242,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ حَدَّثَنِي سَعِيدُ بْنُ هَانِئٍ قَالَ سَمِعْتُ الْعِرْبَاضَ بْنَ سَارِيَةَ يَقُولُكُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعْرَابِيٌّ اقْضِنِي بَكْرِي فَأَعْطَاهُ بَعِيرًا مُسِنًّا فَقَالَ الْأَعْرَابِيُّ يَا رَسُولَ اللَّهِ هَذَا أَسَنُّ مِنْ بَعِيرِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ النَّاسِ خَيْرُهُمْ قَضَاءً",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Zaid bin Al Hubab] berkata, telah menceritakan kepada kami [Mu'awiyah bin Shalih] berkata, telah menceritakan kepadaku [Sa'id bin Hani] ia berkata; Aku mendengar [Al 'Irbadl bin Sariah] ia berkata, \"Aku berada di sisi Nabi shallallahu 'alaihi wasallam, lalu muncullah seorang arab badui dan berkata, \"Bayarlah unta milikku! \" beliau pun memberinya unta yang telah berumur (dewasa), hingga arab badui itu berkata, \"Wahai Rasulullah, unta ini lebih tua dari unta milikku! \" Rasulullah shallallahu 'alaihi wasallam lantas menjawab: \"Sebaik-baik orang adalah yang paling baik dalam memberi pembayarannya.\""
            },
            {
                "number": 2243,
                "arab": "حَدَّثَنَا عُثْمَانُ وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنْ قَائِدِ السَّائِبِ عَنْ السَّائِبِقَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنْتَ شَرِيكِي فِي الْجَاهِلِيَّةِ فَكُنْتَ خَيْرَ شَرِيكٍ لَا تُدَارِينِي وَلَا تُمَارِينِي",
                "id": "Telah menceritakan kepada kami [Utsman] dan [Abu Bakr] -keduanya putra Abu Syaibah-keduanya berkata; telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Sufyan] dari [Ibrahim bin Muhajir] dari [Mujahid] dari [Penuntun As Sa`ib] dari [Sa`ib] ia berkata kepada Nabi shallallahu 'alaihi wasallam, \"Engkau adalah temanku di masa jahiliyyah, dan engkau adalah sebaik-baik teman yang tidak memperdayaiku dan mendebatku.\""
            },
            {
                "number": 2244,
                "arab": "حَدَّثَنَا أَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَاشْتَرَكْتُ أَنَا وَسَعْدٌ وَعَمَّارٌ يَوْمَ بَدْرٍ فِيمَا نُصِيبُ فَلَمْ أَجِئْ أَنَا وَلَا عَمَّارٌ بِشَيْءٍ وَجَاءَ سَعْدٌ بِرَجُلَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Sa`ib Salam bin Junadah] berkata, telah menceritakan kepada kami [Abu Dawud Al Hafari] dari [Sufyan] dari [Abu Ishaq] dari [Abu Ubaidah] dari [Abdullah] ia berkata, \"Aku, Sa'd dan 'Ammar bersekutu pada perang Badar mengenai apa yang kami peroleh. Maka aku dan 'Ammar tidak membawa sesuatu, sedang Sa'd membawa dua lelaki.\""
            },
            {
                "number": 2245,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا بِشْرُ بْنُ ثَابِتٍ الْبَزَّارُ حَدَّثَنَا نَصْرُ بْنُ الْقَاسِمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ دَاوُدَ عَنْ صَالِحِ بْنِ صُهَيْبٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثٌ فِيهِنَّ الْبَرَكَةُ الْبَيْعُ إِلَى أَجَلٍ وَالْمُقَارَضَةُ وَأَخْلَاطُ الْبُرِّ بِالشَّعِيرِ لِلْبَيْتِ لَا لِلْبَيْعِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Bisyr bin Tsabit Al Bazzar] berkata, telah menceritakan kepada kami [Nashr bin Al Qasim] dari ['Abdurrahman bin Dawud] dari [Shalih bin Shuhaib] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga hal yang di dalamnya terdapat barakah; jual beli yang memberi tempo, peminjaman, dan campuran gandum dengan jelai untuk di konsumsi orang-orang rumah bukan untuk dijual.\""
            },
            {
                "number": 2246,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ عَمَّتِهِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَطْيَبَ مَا أَكَلْتُمْ مِنْ كَسْبِكُمْ وَإِنَّ أَوْلَادَكُمْ مِنْ كَسْبِكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Abu Za`idah] dari [Al A'masy] dari [Umarah bin Umair] dari [Pamannya] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang paling baik untuk kalian makan adalah dari hasil usaha kalian, dan anak-anak kalian adalah hasil usaha kalian.\""
            },
            {
                "number": 2247,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا يُوسُفُ بْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالًا وَوَلَدًا وَإِنَّ أَبِي يُرِيدُ أَنْ يَجْتَاحَ مَالِي فَقَالَ أَنْتَ وَمَالُكَ لِأَبِيكَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami [Yusuf bin Ishaq] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] berkata, \"Seseorang lelaki berkata, \"Wahai Rasulullah, aku mempunyai harta dan anak, sementara ayahku juga membutuhkan hartaku.\" Maka beliau bersabda: \"Engkau dan hartamu milik ayahmu.\""
            },
            {
                "number": 2248,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَيَحْيَى بْنُ حَكِيمٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا حَجَّاجٌ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أَبِي اجْتَاحَ مَالِي فَقَالَ أَنْتَ وَمَالُكَ لِأَبِيكَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوْلَادَكُمْ مِنْ أَطْيَبِ كَسْبِكُمْ فَكُلُوا مِنْ أَمْوَالِهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Yahya bin Hakim] keduanya berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Hajjaj] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Bapakku meminta hartaku! \" beliau bersabda: \"Kamu dan hartamu adalah milik bapakmu.\" Rasulullah shallallahu 'alaihi wasallam melanjutkan kembali: \"Sesungguhnya anak-anak kalian adalah dari hasil usaha kalian yang terbaik, maka makanlah dari hasil usaha mereka.\""
            },
            {
                "number": 2249,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ وَأَبُو عُمَرَ الضَّرِيرُ قَالُوا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْجَاءَتْ هِنْدٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ لَا يُعْطِينِي مَا يَكْفِينِي وَوَلَدِي إِلَّا مَا أَخَذْتُ مِنْ مَالِهِ وَهُوَ لَا يَعْلَمُ فَقَالَ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ali bin Muhammad] dan [Abu Umar Adl Dlarir] mereka berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Hindun datang menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, Abu Sufyan adalah seorang laki-laki yang pelit, ia tidak memberi nafkah yang bisa mencukupi aku dan anakku, kecuali dengan sesuatu yang aku ambil dari hartanya tanpa sepengetahuannya! \" beliau lantas bersabda: \"Ambillah uang miliknya yang bisa mencukupi nafkahmu dan juga anakmu dengan ma'ruf.\""
            },
            {
                "number": 2250,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَنْفَقَتْ الْمَرْأَةُ وَقَالَ أَبِي فِي حَدِيثِهِ إِذَا أَطْعَمَتْ الْمَرْأَةُ مِنْ بَيْتِ زَوْجِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا وَلَهُ مِثْلُهُ بِمَا اكْتَسَبَ وَلَهَا بِمَا أَنْفَقَتْ وَلِلْخَازِنِ مِثْلُ ذَلِكَ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Bapakku] dan [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Wail] dari [Masruq] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang wanita berinfak, -Bapakku menyebutkan dalam haditsnya-, \"Jika seorang wanita memberikan makan (nafkah) di rumah suaminya dengan tidak menimbulkan madlarat, maka ia mendapatkan pahala sebagaimana suaminya juga mendapatkan pahala dari usahanya. Isterinya akan mendapatkan pahala dari apa yang ia infakkan, dan bagi penjaga (harta) juga akan mendapatkan pahala tanpa mengurangi dari pahala mereka.\""
            },
            {
                "number": 2251,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنِي شُرَحْبِيلُ بْنُ مُسْلِمٍ الْخَوْلَانِيُّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُنْفِقُ الْمَرْأَةُ مِنْ بَيْتِهَا شَيْئًا إِلَّا بِإِذْنِ زَوْجِهَا قَالُوا يَا رَسُولَ اللَّهِ وَلَا الطَّعَامَ قَالَ ذَلِكَ مِنْ أَفْضَلِ أَمْوَالِنَا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isma'il bin Ayyasy] berkata, telah menceritakan kepadaku [Syurahbil bin Muslim Al Khaulani] ia berkata; aku mendengar [Abu Umamah Al Bahili] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita tidak boleh memberikan infak di dalam rumahnya kecuali dengan izin suaminya.\" Para sahabat berkata, \"Wahai Rasulullah, meskipun itu berupa makanan?\" beliau menjawab: \"Itu adalah seutama-utama harta kami.\""
            },
            {
                "number": 2252,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا جَرِيرٌ عَنْ مُسْلِمٍ الْمُلَائِيِّ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجِيبُ دَعْوَةَ الْمَمْلُوكِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Sufyan]. (Dalam jalur lain disebutkan) Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Jarir] dari [Muslim Al Mullai] ia mendengar [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam senantiasa memenuhi undangan hamba sahaya.\""
            },
            {
                "number": 2253,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ مُحَمَّدِ بْنِ زَيْدٍ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ قَالَكَانَ مَوْلَايَ يُعْطِينِي الشَّيْءَ فَأُطْعِمُ مِنْهُ فَمَنَعَنِي أَوْ قَالَ فَضَرَبَنِي فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ سَأَلَهُ فَقُلْتُ لَا أَنْتَهِي أَوْ لَا أَدَعُهُ فَقَالَ الْأَجْرُ بَيْنَكُمَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Muhammad bin Zaid] dari [Umair] -mantan budak Abu Lahm- ia berkata, \"Majikanku memberiku sesuatu, lalu aku memberi makan orang lain dari pemberian itu, tetapi dia melarangku, atau ia berkata; tetapi dia memukulku. Lantas hal itu aku tanyakan kepada Nabi shallallahu 'alaihi wasallam, atau ia menanyakannya. Aku berkata, \"Aku tidak akan berhenti atau tidak akan meninggalkannya.\" Maka beliau bersabda: \"Kalian berdua akan mendapat pahala.\""
            },
            {
                "number": 2254,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ جَعْفَرِ بْنِ أَبِي إِيَاسٍ قَالَ سَمِعْتُ عَبَّادَ بْنَ شُرَحْبِيلَرَجُلًا مِنْ بَنِي غُبَرَ قَالَ أَصَابَنَا عَامُ مَخْمَصَةٍ فَأَتَيْتُ الْمَدِينَةَ فَأَتَيْتُ حَائِطًا مِنْ حِيطَانِهَا فَأَخَذْتُ سُنْبُلًا فَفَرَكْتُهُ وَأَكَلْتُهُ وَجَعَلْتُهُ فِي كِسَائِي فَجَاءَ صَاحِبُ الْحَائِطِ فَضَرَبَنِي وَأَخَذَ ثَوْبِي فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ لِلرَّجُلِ مَا أَطْعَمْتَهُ إِذْ كَانَ جَائِعًا أَوْ سَاغِبًا وَلَا عَلَّمْتَهُ إِذْ كَانَ جَاهِلًا فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَدَّ إِلَيْهِ ثَوْبَهُ وَأَمَرَ لَهُ بِوَسْقٍ مِنْ طَعَامٍ أَوْ نِصْفِ وَسْقٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syababah bin Sawwar]. (Dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Muhammad Ibnul Walid] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Biysr Ja'far bin Abu Iyas] ia berkata; Aku mendengar [Abbad bin Syurahbil] -seorang laki-laki dari bani Ghubar- berkata, \"Kami mengalami tahun paceklik, aku pun mendatagi salah satu kebun milik kami (penduduk madinah), aku mengambil satu tangkai dan aku keluarkan biji-bijinya. Kemudian aku makan dan aku masukkan ke dalam saku. Namun si pemilik kebun datang, ia memukul dan memegang kain bajuku. Maka, aku mendatangi Nabi shallallahu 'alaihi wasallam dan aku kabarkan hal itu kepada beliau. Beliau lalu berkata kepada pemilik kebun tersebut: \"Engkau tidak memberinya makan disaat lapar, dan engkau tidak memberitahu disaat ia bodoh! \" Nabi shallallahu 'alaihi wasallam pun memerintahkannya, hingga pemilik kebun tersebut mengembalikan kain milik laki-laki itu. Dan beliau juga memerintahkannya untuk memberi makanan satu wasaq atau setengahnya.\" "
            },
            {
                "number": 2255,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ قَالَ سَمِعْتُ ابْنَ أَبِي الْحَكَمِ الْغِفَارِيَّ قَالَ حَدَّثَتْنِي جَدَّتِي عَنْ عَمِّ أَبِيهَا رَافِعِ بْنِ عَمْرٍو الْغِفَارِيِّ قَالَكُنْتُ وَأَنَا غُلَامٌ أَرْمِي نَخْلَنَا أَوْ قَالَ نَخْلَ الْأَنْصَارِ فَأُتِيَ بِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا غُلَامُ وَقَالَ ابْنُ كَاسِبٍ فَقَالَ يَا بُنَيَّ لِمَ تَرْمِي النَّخْلَ قَالَ قُلْتُ آكُلُ قَالَ فَلَا تَرْم النَّخْلَ وَكُلْ مِمَّا يَسْقُطُ فِي أَسَافِلِهَا قَالَ ثُمَّ مَسَحَ رَأْسِي وَقَالَ اللَّهُمَّ أَشْبِعْ بَطْنَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] dan [Ya'qub bin Humaid bin Kasib] keduanya berkata: telah menceritakan kepada kami [Mu'tamir bin Sulaiman] ia berkata; aku mendengar [Ibnu Abul Hakam Al Ghifari] ia berkata; telah menceritakan kepadaku [Nenekku] dari paman ayahnya [Rafi' bin Amru Al Ghifari] ia berkata, \"Saat masih kecil aku melempar pohon kurma milik kami, atau ia mengatakan, \"Pohon kurma kaum Anshar. Lalu aku bawa kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Wahai anak kecil, Ibnu Kasib menyebutkan, \"Wahai anakku, kenapa kamu melempar pohon kurma?\" Rafi' bin Amru Al Ghifari berkata, \"Aku menjawab, \"Untuk aku makan.\" Beliau bersabda: \"Janganlah kamu melempar yang ada di pohon, tetapi makanlah dari apa yang jatuh di bawahnya.\" Rafi' bin Amru Al Ghifari berkata, \"Kemudian beliau mengusap kepalaku dan bersabda: \"Ya Allah, kenyangkanlah perutnya.\""
            },
            {
                "number": 2256,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا الْجُرَيْرِيُّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَتَيْتَ عَلَى رَاعٍ فَنَادِهِ ثَلَاثَ مِرَارٍ فَإِنْ أَجَابَكَ وَإِلَّا فَاشْرَبْ فِي غَيْرِ أَنْ تُفْسِدَ وَإِذَا أَتَيْتَ عَلَى حَائِطِ بُسْتَانٍ فَنَادِ صَاحِبَ الْبُسْتَانِ ثَلَاثَ مَرَّاتٍ فَإِنْ أَجَابَكَ وَإِلَّا فَكُلْ فِي أَنْ لَا تُفْسِدَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Al Jurairi] dari [Abu Nadlrah] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika engkau mendatangi pengembala, serulah ia hingga tiga kali, jika ia menjawab maka mintalah izin. Namun jika tidak, hendaklah engkau minum (susu ternaknya) dengan tidak merusaknya. Dan jika engkau mendatangi sebuah kebun maka serulah pemiliknya hingga tiga kali, jika ia menjawab maka mintalah izin, namun jika tidak maka makanlah dengan tidak menimbulkan kerusakan.\""
            },
            {
                "number": 2257,
                "arab": "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ وَأَيُّوبُ بْنُ حَسَّانَ الْوَاسِطِيُّ وَعَلِيُّ بْنُ سَلَمَةَ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَرَّ أَحَدُكُمْ بِحَائِطٍ فَلْيَأْكُلْ وَلَا يَتَّخِذْ خُبْنَةً",
                "id": "Telah menceritakan kepada kami [Hadiyyah bin Abdul Wahhab] dan [Ayyub bin Hassan Al Wasithi] dan [Ali bin Salamah] mereka berkata; telah menceritakan kepada kami [Yahya bin Sulaim At Thaifi] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian melewati sebuah kebun maka makanlah, namun jangan mengambilnya untuk bekal.\""
            },
            {
                "number": 2258,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَامَ فَقَالَ لَا يَحْتَلِبَنَّ أَحَدُكُمْ مَاشِيَةَ رَجُلٍ بِغَيْرِ إِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَيُكْسَرَ بَابُ خِزَانَتِهِ فَيُنْتَثَلَ طَعَامُهُ فَإِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَاتِهِمْ فَلَا يَحْتَلِبَنَّ أَحَدُكُمْ مَاشِيَةَ امْرِئٍ بِغَيْرِ إِذْنِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] ia berkata; telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Abdullah bin Umar] dari Rasulullah shallallahu 'alaihi wasallam, bahwasanya beliau berdiri dan bersabda: \"Jangan sekali-kali salah seorang dari kalian memerah ternak orang lain tanpa seizinnya. Apakah kalian suka jika gudang penyimpanan makanan kalian dijebol pintunya lalu semua isinya dikeluarkan? Sesungguhnya susu-susu ternak mereka itu adalah gudang penyimpanan makanan mereka, maka janganlah salah seorang dari kalian memerah ternak orang lain tanpa seizinnya.\""
            },
            {
                "number": 2259,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ بِشْرِ بْنِ مَنْصُورٍ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ عَنْ حَجَّاجٍ عَنْ سَلِيطِ بْنِ عَبْدِ اللَّهِ الطُّهَوِيِّ عَنْ ذُهَيْلِ بْنِ عَوْفِ بْنِ شَمَّاخٍ الطُّهَوِيِّ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَبَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ إِذْ رَأَيْنَا إِبِلًا مَصْرُورَةً بِعِضَاهِ الشَّجَرِ فَثُبْنَا إِلَيْهَا فَنَادَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَجَعْنَا إِلَيْهِ فَقَالَ إِنَّ هَذِهِ الْإِبِلَ لِأَهْلِ بَيْتٍ مِنْ الْمُسْلِمِينَ هُوَ قُوتُهُمْ وَيُمْنُهُمْ بَعْدَ اللَّهِ أَيَسُرُّكُمْ لَوْ رَجَعْتُمْ إِلَى مَزَاوِدِكُمْ فَوَجَدْتُمْ مَا فِيهَا قَدْ ذُهِبَ بِهِ أَتُرَوْنَ ذَلِكَ عَدْلًا قَالُوا لَا قَالَ فَإِنَّ هَذَا كَذَلِكَ قُلْنَا أَفَرَأَيْتَ إِنْ احْتَجْنَا إِلَى الطَّعَامِ وَالشَّرَابِ فَقَالَ كُلْ وَلَا تَحْمِلْ وَاشْرَبْ وَلَا تَحْمِلْ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Bisyr bin Manshur] berkata, telah menceritakan kepada kami [Umar bin Ali] dari [Hajjaj] dari [Salith bin Abdullah Ath Thuhawi] dari [Dzuhail bin 'Auf bin Syammakh Ath Thuhawi] berkata, telah menceritakan kepada kami [Abu Hurairah] ia berkata, \"Tatkala kami sedang bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, tiba-tiba kami melihat unta yang terikat di sebatang pohon duri yang besar. Lalu kami mendekatinya, tetapi Rasulullah memanggil kami hingga kami kembali kepadanya. Beliau bersabda: \"Sesungguhnya unta ini adalah milik penduduk daerah kaum muslimin, ia adalah makanan pokok mereka dan keberkahan mereka setelah Allah. Apakah kalian senang jika kalian kembali ke tempat perbekalan kalian, kemudian kalian menemukan apa yang kalian letakkan di sana telah hilang? Apakah ini adil menurut kalian?\" Mereka menjawab, \"Tidak.\" Beliau bersabda: \"Maka demikian pula dengan hal ini.\" Kami lantas bertanya, \"Bagaimana pendapatmu jika kami butuh makan dan minum?\" beliau menjawab: \"Makan dan minumlah, namun jangan membawanya sebagai bekal.\""
            },
            {
                "number": 2260,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ أُمِّ هَانِئٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا اتَّخِذِي غَنَمًا فَإِنَّ فِيهَا بَرَكَةً",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Ummu Hani] bahwa Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Ambilah kambing, sebab di dalamnya terdapat keberkahan.\""
            },
            {
                "number": 2261,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ عَامِرٍ عَنْ عُرْوَةَ الْبَارِقِيِّيَرْفَعُهُ قَالَ الْإِبِلُ عِزٌّ لِأَهْلِهَا وَالْغَنَمُ بَرَكَةٌ وَالْخَيْرُ مَعْقُودٌ فِي نَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Hushain] dari [Amir] dari [Urwah Al Bariqi] dan ia memarfu'kannya, beliau bersabda: \"Unta, bagi pemiliknya adalah kemuliaan, kambing adalah keberkahan, dan pada ubun-ubun kuda telah tertulis kebaikan hingga hari kiamat.\""
            },
            {
                "number": 2262,
                "arab": "حَدَّثَنَا عِصْمَةُ بْنُ الْفَضْلِ النَّيْسَابُورِيُّ وَمُحَمَّدُ بْنُ فِرَاسٍ أَبُو هُرَيْرَةَ الصَّيْرَفِيُّ قَالَا حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ حَدَّثَنَا زَرْبِيٌّ إِمَامُ مَسْجِدِ هِشَامِ بْنِ حَسَّانَ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّاةُ مِنْ دَوَابِّ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami ['Ishmah bin Fadll An Naisaburi] dan [Muhammad bin Firas Abu Hurairah Ash Shairafi] keduanya berkata: telah menceritakan kepada kami [Harami bin Umarah] berkata, telah menceritakan kepada kami [Zarbi] -Imam Masjid Hisyam bin Hassan- berkata, telah menceritakan kepada kami [Muhammad bin Sirin] dari [Ibnu Umar radliallahu 'anhu] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kambing termasuk binatang surga.\""
            },
            {
                "number": 2263,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عَلِيُّ بْنُ عُرْوَةَ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَغْنِيَاءَ بِاتِّخَاذِ الْغَنَمِ وَأَمَرَ الْفُقَرَاءَ بِاتِّخَاذِ الدَّجَاجِ وَقَالَ عِنْدَ اتِّخَاذِ الْأَغْنِيَاءِ الدَّجَاجَ يَأْذَنُ اللَّهُ بِهَلَاكِ الْقُرَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] berkata, telah menceritakan kepada kami [Utsman bin 'Abdurrahman] berkata, telah menceritakan kepada kami [Ali bin Urwah] dari [Al Maqburi] dari [Abu Hurairah radliallahu 'anhu] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan orang-orang kaya mengerluarkan kambing (sebagai zakat) dan memerintah orang-orang miskin mengeluarkan ayam. Ketika melihat orang-orang kaya mengeluarkan ayam beliau bersabda: \"Allah telah mengizinkan kehancuran negeri itu.\""
            },
            {
                "number": 2264,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ عَنْ الْمَقْبُريِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Mu'alla bin Manshur] dari [Abdullah bin Ja'far] dari [Utsman bin Muhammad] dari [Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa dijadikan hakim di antara manusia, sesungguhnya ia telah disembelih tanpa menggunakan pisau.\""
            },
            {
                "number": 2265,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْرَائِيلُ عَنْ عَبْدِ الْأَعْلَى عَنْ بِلَالِ بْنِ أَبِي مُوسَى عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ الْقَضَاءَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ جُبِرَ عَلَيْهِ نَزَلَ إِلَيْهِ آلِكْ فَسَدَّدَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Isra'il] dari [Abdul A'la] dari [Bilal bin Abu Musa] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminta untuk diangkat sebagai hakim maka ia akan ditelantarkan, dan barangsiapa dipaksa menjadi hakim maka malaikat akan turun untuk membantunya.\""
            },
            {
                "number": 2266,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا يَعْلَى وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ عَلِيٍّ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَقُلْتُ يَا رَسُولَ اللَّهِ تَبْعَثُنِي وَأَنَا شَابٌّ أَقْضِي بَيْنَهُمْ وَلَا أَدْرِي مَا الْقَضَاءُ قَالَ فَضَرَبَ بِيَدِهِ فِي صَدْرِي ثُمَّ قَالَ اللَّهُمَّ اهْدِ قَلْبَهُ وَثَبِّتْ لِسَانَهُ قَالَ فَمَا شَكَكْتُ بَعْدُ فِي قَضَاءٍ بَيْنَ اثْنَيْنِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Ya'la] dan [Abu Mu'awiyah] dari [Al A'masy] dari [Amru bin Murrah] dari [Abu Al Bakhtari] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman, maka aku berkata, \"Wahai Rasulullah, engkau mengutusku untuk menjadi hakim di tengah manusia sementara aku seorang pemuda dan tidak mengerti bagaimana memberi putusan! \" Ali berkata, \"Beliau lalu meletakkan tangannya ke dadaku seraya berdoa: \"Ya Allah, tunjukilah hatinya dan teguhkanlah lisannya.\" Ali berkata, \"Setelah itu aku tidak ragu-ragu dalam memutuskan antara dua perkara.\""
            },
            {
                "number": 2267,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا مُجَالِدٌ عَنْ عَامِرٍ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ حَاكِمٍ يَحْكُمُ بَيْنَ النَّاسِ إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَمَلَكٌ آخِذٌ بِقَفَاهُ ثُمَّ يَرْفَعُ رَأْسَهُ إِلَى السَّمَاءِ فَإِنْ قَالَ أَلْقِهِ أَلْقَاهُ فِي مَهْوَاةٍ أَرْبَعِينَ خَرِيفًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] berkata, telah menceritakan kepada kami [Mujalid] dari [Amir] dari [Masruq] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hakim yang mengadili manusia kecuali pada hari kiamat ia akan datang dalam keadaan tengkuknya dipegang oleh malaikat. Kemudian kepalanya akan diangkat ke langit, jika Allah berfirman, 'Lemparkanlah ia' maka malaikat akan melemparnya ke dalam neraka yang dalamnya seperti perjalanan selama tujuh puluh musim.\""
            },
            {
                "number": 2268,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانَ حَدَّثَنَا مُحَمَّدُ بْنُ بِلَالٍ عَنْ عِمْرَانَ الْقَطَّانِ عَنْ حُسَيْنٍ يَعْنِي ابْنَ عِمْرَانَ عَنْ أَبِي إِسْحَقَ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ مَعَ الْقَاضِي مَا لَمْ يَجُرْ فَإِذَا جَارَ وَكَّلَهُ إِلَى نَفْسِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] berkata, telah menceritakan kepada kami [Muhammad bin Bilal] dari [Imran Al Qaththan] dari [Husain yaitu Ibnu Imran] dari [Abu Ishaq Asy Syaibani] dari [Abdullah bin Abu Aufa] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah akan bersama seorang hakim selama ia tidak berbuat curang. Apabila berbuat curang maka akan dibebankan kepada dirinya sendiri.\""
            },
            {
                "number": 2269,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعْنَةُ اللَّهِ عَلَى الرَّاشِي وَالْمُرْتَشِي",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari pamannya [Al Harits bin 'Abdurrahman] dari [Abu Salamah] dari [Abdullah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah melaknat penyuap dan penerima suap.\""
            },
            {
                "number": 2270,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌقَالَ يَزِيدُ فَحَدَّثْتُ بِهِ أَبَا بَكْرِ بْنَ عَمْرِو بْنِ حَزْمٍ فَقَالَ هَكَذَا حَدَّثَنِيهِ أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad Ad Darawardi] berkata, telah menceritakan kepada kami [Yazid bin Abdullah Ibnul Had] dari [Muhammad bin Ibrahim At Taimi] dari [Busr bin Sa'id] dari [Abu Qais] -mantan budak Amru bin Al Ash- dari [Amru bin Al Ash] Bahwasanya ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang hakim berijtihad dan benar maka ia mendapatkan dua pahala, dan jika ia berijtihad kemudian salah maka ia mendapat satu pahala.\" [Yazid] berkata, \"Aku ceritakan hal itu kepada [Abu Bakr bin Amru bin Hazm], lalu ia berkata, \"Seperti inilah [Abu Salamah] menceritakan kepadaku dari [Abu Hurairah].\""
            },
            {
                "number": 2271,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ تَوْبَةَ حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ حَدَّثَنَا أَبُو هَاشِمٍ قَالَ لَوْلَا حَدِيثُ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْقُضَاةُ ثَلَاثَةٌ اثْنَانِ فِي النَّارِ وَوَاحِدٌ فِي الْجَنَّةِ رَجُلٌ عَلِمَ الْحَقَّ فَقَضَى بِهِ فَهُوَ فِي الْجَنَّةِ وَرَجُلٌ قَضَى لِلنَّاسِ عَلَى جَهْلٍ فَهُوَ فِي النَّارِ وَرَجُلٌ جَارَ فِي الْحُكْمِ فَهُوَ فِي النَّارِ لَقُلْنَا إِنَّ الْقَاضِيَ إِذَا اجْتَهَدَ فَهُوَ فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Taubah] berkata, telah menceritakan kepada kami [Khalaf bin Khalifah] berkata, telah menceritakan kepada kami [Abu Hasyim] ia berkata: \"Kalau bukan karena hadits [Ibnu Buraidah] yang bersumber dari [Bapaknya], dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: 'Hakim itu ada tiga golongan, dua di neraka dan satu di surga; hakim yang mengetahui kebenaran lalu memutuskan perkara tersebut dengan ilmunya, maka ia berada di surga. Hakim yang memberi putusan kepada manusia atas dasar kebodohan, maka ia di neraka. Dan hakim yang berlaku curang saat memberi putusan maka ia di neraka, ' niscaya kami akan mengatakan, 'Sesungguhnya seorang hakim apabila berijtihad dia akan berada di dalam surga.\""
            },
            {
                "number": 2272,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ وَأَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقْضِي الْقَاضِي بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ قَالَ هِشَامٌ فِي حَدِيثِهِ لَا يَنْبَغِي لِلْحَاكِمِ أَنْ يَقْضِيَ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Muhammad bin Abdullah bin Yazid] dan [Ahmad bin Tsabit Al Jahdari] mereka berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abdul Malik bin Umair] bahwa ia mendengar ['Abdurrahman bin Abu Bakrah] dari [Bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang hakim tidak boleh memberi putusan antara dua orang dalam keadaan marah.\" Hisyam menyebutkan dalam haditsnya, \"Tidak selayaknya seorang hakim memberi putusan antara dua orang dalam keadaan marah.\""
            },
            {
                "number": 2273,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ وَإِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ وَإِنَّمَا أَقْضِي لَكُمْ عَلَى نَحْوٍ مِمَّا أَسْمَعُ مِنْكُمْ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا فَلَا يَأْخُذْهُ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنْ النَّارِ يَأْتِي بِهَا يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari [Zainab binti Ummu Salamah] dari [Ummu Salamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian telah mendebatku, padahal aku hanyalah manusia biasa. Bisa jadi sebagian dari kalian lebih mampu bersilat lidah dalam menerangkan pendapatnya dari sebagian yang lain. Aku memberi putusan kalian sebatas yang kudengar dari kalian, maka barangsiapa yang kumenangkan urusannya dengan mencederai hak sudaranya, jangan ia ambil, sebab aku telah membuatkan bara api untuknya pada hari kiamat nanti.\""
            },
            {
                "number": 2274,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَمَنْ قَطَعْتُ لَهُ مِنْ حَقِّ أَخِيهِ قِطْعَةً فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Biysr] berkata, telah menceritakan kepada kami [Muhammad bin Amru] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku hanyalah manusia biasa, bisa jadi sebagian dari kalian lebih mampu bersilat lidah dalam menerangkan pendapatnya dari sebagian yang lain. Barangsiapa yang kuputuskan urusannya dengan mencederai hak saudaranya, maka aku hanya memutuskan bara api neraka.\""
            },
            {
                "number": 2275,
                "arab": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ بْنِ سَعِيدٍ أَبُو عُبَيْدَةَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ حَدَّثَنِي الْحُسَيْنُ بْنُ ذَكْوَانَ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ قَالَ حَدَّثَنِي يَحْيَى بْنُ يَعْمَرَ أَنَّ أَبَا الْأَسْوَدِ الدِّيلِيَّ حَدَّثَهُ عَنْ أَبِي ذَرٍّأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Abdul Warits bin Abdush Shamad bin Abdul Warits bin Sa'id Abu Ubaidah] berkata, telah menceritakan kepadaku [Bapakku] dari [Bapaknya] berkata, telah menceritakan kepadaku [Al Husain bin Dzakwan] dari [Abdullah bin Buraidah] ia berkata; telah menceritakan kepadaku [Yahya bin Ya'mar] bahwa [Abu Al Aswad Ad Daili] ia menceritakan kepadanya dari [Abu Dzar] Bahwasanya ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengaku-ngaku sesuatu yang bukan miliknya maka ia bukan dari golongan kami, dan hendaklah ia menyiapkan tempat duduknya dalam neraka.\""
            },
            {
                "number": 2276,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ ثَعْلَبَةَ بْنِ سَوَاءٍ حَدَّثَنِي عَمِّي مُحَمَّدُ بْنُ سَوَاءٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعَانَ عَلَى خُصُومَةٍ بِظُلْمٍ أَوْ يُعِينُ عَلَى ظُلْمٍ لَمْ يَزَلْ فِي سَخَطِ اللَّهِ حَتَّى يَنْزِعَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Tsa'labah bin Sawa] berkata, telah berkata kepadaku pamanku [Muhammad bin Sawa] dari [Husain Al Mu'allim] dari [Mathar Al Warraq] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membantu sengketa dengan cara zhalim, atau membantu kezhaliman, maka ia akan senantiasa dalam murka Allah hingga ia mencabut (bantuannya).\""
            },
            {
                "number": 2277,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ ادَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ وَلَكِنْ الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah memberitakan kepada kami [Ibnu Juraij] dari [Ibnu Abu Mulaikah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya manusia itu dibebaskan untuk mengklaim, maka mereka akan mengklaim darah dan harta manusia, akan tetapi orang yang diklaim cukuplah bersumpah.\""
            },
            {
                "number": 2278,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ قَالَا حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ الْأَشْعَثِ بْنِ قَيْسٍ قَالَكَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنْ الْيَهُودِ أَرْضٌ فَجَحَدَنِي فَقَدَّمْتُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ لَكَ بَيِّنَةٌ قُلْتُ لَا قَالَ لِلْيَهُودِيِّ احْلِفْ قُلْتُ إِذًا يَحْلِفُ فِيهِ فَيَذْهَبُ بِمَالِي فَأَنْزَلَ اللَّهُ سُبْحَانَهُ{ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا }إِلَخْ الْآيَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] dan [Abu Mu'awiyah] keduanya berkata; telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Al Asy'ats bin Qais] ia berkata, \"Antara aku dengan seorang laki-laki yahudi terjadi perselisihan atas sebidang tanah, dan ia ingin mengingkariku. Maka aku serahkan hal itu kepada Nabi shallallahu 'alaihi wasallam, Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Apakah kamu mempunyai bukti?\" aku menjawab, \"Tidak.\" Beliau lalu bersabda kepada laki-laki yahudi itu, \"Silahkan kamu bersumpah! \" aku berkata, \"Jika demikian, ia akan bersumpah dan hilanglah apa yang menjadi hakku! \" maka Allah Subhaanahu menurunkan ayat: (Sesungguhnya orang-orang yang menukar janji (nya dengan) Allah dan sumpah-sumpah mereka dengan harga yang sedikit) hingga akhir ayat.\""
            },
            {
                "number": 2279,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ قَالَا حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ وَهُوَ فِيهَا فَاجِرٌ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Waki'] dan [Abu Mu'awiyah] keduanya berkata; telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah palsu atas sesuatu, yang dengannya akan merusak harta seorang muslim, maka ia akan berjumpa dengan Allah sementara Ia murka kepadanya.\""
            },
            {
                "number": 2280,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ أَنَّهُ سَمِعَ أَخَاهُ عَبْدَ اللَّهِ بْنَ كَعْبٍ أَنَّ أَبَا أُمَامَةَ الْحَارِثِيَّ حَدَّثَهُأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَقْتَطِعُ رَجُلٌ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ إِلَّا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ وَأَوْجَبَ لَهُ النَّارَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ يَا رَسُولَ اللَّهِ وَإِنْ كَانَ شَيْئًا يَسِيرًا قَالَ وَإِنْ كَانَ سِوَاكًا مِنْ أَرَاكٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir] dari [Muhammad bin Ka'b] bahwa ia pernah mendengar saudaranya [Abdullah bin Ka'b] bahwa [Abu Umamah Al Haritsi] menceritakan kepadanya, bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang laki-laki merusak hak orang lain dengan sumpahnya, kecuali Allah akan mengharamkan surga baginya dan memasukkannya ke dalam neraka.\" Seorang laki-laki lalu berkata, \"Wahai Rasulullah, meskipun itu sesuatu yang remeh?\" beliau menjawab: \"Meskipun itu sebatang kayu siwak.\""
            },
            {
                "number": 2281,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ ح و حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَا حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ عَنْ عَبْدِ اللَّهِ بْنِ نِسْطَاسٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ بِيَمِينٍ آثِمَةٍ عِنْدَ مِنْبَرِي هَذَا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ وَلَوْ عَلَى سِوَاكٍ أَخْضَرَ",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Marwan bin Mu'awiyah]. (Dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Tsabit Al Jahdari] berkata, telah menceritakan kepada kami [Shafwah bin Isa] keduanya berkata; telah menceritakan kepada kami [Hasyim bin Hasyim] dari [Abdullah bin Nisthas] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah palsu di samping mimbarku ini, maka hendaklah ia menyiapkan tempat duduknya di neraka meskipun itu untuk sebatang kayu siwak hijau.\""
            },
            {
                "number": 2282,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَزَيْدُ بْنُ أَخْزَمَ قَالَا حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ حَدَّثَنَا الْحَسَنُ بْنُ يَزِيدَ بْنِ فَرُّوخَ قَالَ مُحَمَّدُ بْنُ يَحْيَى وَهُوَ أَبُو يُونُسَ الْقَوِيُّ قَالَ سَمِعْتُ أَبَا سَلَمَةَ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْلِفُ عِنْدَ هَذَا الْمِنْبَرِ عَبْدٌ وَلَا أَمَةٌ عَلَى يَمِينٍ آثِمَةٍ وَلَوْ عَلَى سِوَاكٍ رَطْبٍ إِلَّا وَجَبَتْ لَهُ النَّارُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Zaid bin Akhzam] keduanya berkata; telah menceritakan kepada kami [Adl Dlahhak bin Makhlad] berkata, telah menceritakan kepada kami [Al Hasan bin Yazid bin Farukh] -Muhammad bin Yahya berkata; dia adalah Abu Yunus Al Qawi-; Aku mendengar [Abu Salamah] berkata; aku mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang budak laki-laki atau perempuan yang bersumpah palsu di sisi mimbar ini meskipun untuk sebuah siwak, kecuali telah wajib baginya masuk neraka.\""
            },
            {
                "number": 2283,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا رَجُلًا مِنْ عُلَمَاءِ الْيَهُودِ فَقَالَ أَنْشُدُكَ بِالَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Al Bara bin 'Azib] berkata, \"Rasulullah shallallahu 'alaihi wasallam memanggil seorang ulama yahudi, beliau mengucapkan: \"Aku bersumpah atas kamu dengan Dzat yang menurunkan Taurat kepada Musa.\""
            },
            {
                "number": 2284,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُجَالِدٍ أَنْبَأَنَا عَامِرٌ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِيَهُودِيَّيْنِ أَنْشَدْتُكُمَا بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى عَلَيْهِ السَّلَام",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Mujalid] berkata, telah mengabarkan kepada kami [Amir] dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada dua orang Yahudi: \"Aku bersumpah atas kalian, demi Allah yang telah menurunkan Taurat kepada Musa 'Alaihis Salaam.\""
            },
            {
                "number": 2285,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّهُ ذَكَرَ أَنَّ رَجُلَيْنِ ادَّعَيَا دَابَّةً وَلَمْ يَكُنْ بَيْنَهُمَا بَيِّنَةٌ فَأَمَرَهُمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Khalid bin Al Harits] berkata, telah menceritakan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dari [Khilas] dari [Abu Rafi'] dari [Abu Hurairah] ia menyebutkan bahwa ada dua orang lelaki yang mengaku memiliki seekor hewan tunggangan, sementara di antara keduanya tidak ada bukti. Maka Nabi shallallahu 'alaihi wasallam memerintahkan keduanya untuk saling mengundi atas dasar sumpah.\""
            },
            {
                "number": 2286,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ وَمُحَمَّدُ بْنُ مَعْمَرٍ وَزُهَيْرُ بْنُ مُحَمَّدٍ قَالُوا حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ أَبِي مُوسَىأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْتَصَمَ إِلَيْهِ رَجُلَانِ بَيْنَهُمَا دَابَّةٌ وَلَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهَا بَيْنَهُمَا نِصْفَيْنِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] dan [Muhammad bin Ma'mar] dan [Zuhair bin Muhammad] mereka berkata; telah menceritakan kepada kami [Rauh bin Ubadah] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Sa'id bin Abu Burdah] dari [Bapaknya] dari [Abu Musa] berkata, \"Ada dua orang laki-laki mengadu kepada Rasulullah shallallahu 'alaihi wasallam tentang kepemilikan hewan sementara keduanya tidak memiliki bukti. Maka beliau membagi hewan tersebut menjadi dua bagian.\""
            },
            {
                "number": 2287,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا حَجَّاجٌ عَنْ سَعِيدِ بْنِ عُبَيْدِ بْنِ زَيْدِ بْنِ عُقْبَةَ عَنْ أَبِيهِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ضَاعَ لِلرَّجُلِ مَتَاعٌ أَوْ سُرِقَ لَهُ مَتَاعٌ فَوَجَدَهُ فِي يَدِ رَجُلٍ يَبِيعُهُ فَهُوَ أَحَقُّ بِهِ وَيَرْجِعُ الْمُشْتَرِي عَلَى الْبَائِعِ بِالثَّمَنِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Hajjaj] dari [Sa'id bin Ubaid bin Zaid bin Uqbah] dari [Bapaknya] dari [Samurah bin Jundab] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika barang seseorang hilang atau dicuri, kemudian ia menemukan barang tersebut di tangan seseorang dan menjualnya, maka ia (yang kehilangan) lebih berhak atas barang itu. Dan bagi pembeli ia boleh mengembalikannya kepada penjual dengan harga.\""
            },
            {
                "number": 2288,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ أَنَّ ابْنَ مُحَيِّصَةَ الْأَنْصَارِيَّ أَخْبَرَهُأَنَّ نَاقَةً لِلْبَرَاءِ كَانَتْ ضَارِيَةً دَخَلَتْ فِي حَائِطِ قَوْمٍ فَأَفْسَدَتْ فِيهِ فَكُلِّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا فَقَضَى أَنَّ حِفْظَ الْأَمْوَالِ عَلَى أَهْلِهَا بِالنَّهَارِ وَعَلَى أَهْلِ الْمَوَاشِي مَا أَصَابَتْ مَوَاشِيهِمْ بِاللَّيْلِحَدَّثَنَا الْحَسَنُ بْنُ عَلِيِّ بْنِ عَفَّانَ حَدَّثَنَا مُعَاوِيَةَ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ الزُّهْرِيِّ عَنْ حَرَامِ بْنِ مُحَيِّصَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ أَنَّ نَاقَةً لِآلِ الْبَرَاءِ أَفْسَدَتْ شَيْئًا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Ibnu Syihab] bahwa [Ibnu Muhayyishah Al Anshari] mengabarkan kepadanya bahwa unta milik Al Barra lepas dan masuk ke kebun orang lain hingga membuat kerusakan. Kejadian tersebut kemudian dilaporkan kepada Rasulullah shallallahu 'alaihi wasallam. Beliau lalu membuat keputusan bahwa bila waktu siang maka yang menjaga tanaman adalah pemilik kebun, sementara pemilik hewan ia berkewajiban mengganti kerusakan jika itu terjadi di waktu malam.\" Telah menceritakan kepada kami [Al Hasan bin Ali bin Affan] berkata, telah menceritakan kepada kami [Mu'awiyah bin Hisyam] dari [Sufyan] dari [Abdullah bin Isa] dari [Az Zuhri] dari [Haram bin Mahayyishah] dari [Al Barra bin 'Azib] bahwa unta milik keluarga Al Barra merusak sesuatu, lalu Rasulullah shallallahu 'alaihi wasallam memberikan putusan sebagaimana dalam hadits tersebut.\""
            },
            {
                "number": 2289,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ عَنْ قَيْسِ بْنِ وَهْبٍ عَنْ رَجُلٍ مِنْ بَنِي سُوءَةَ قَالَقُلْتُ لِعَائِشَةَ أَخْبِرِينِي عَنْ خُلُقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ أَوَ مَا تَقْرَأُ الْقُرْآنَ{ وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ }قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ أَصْحَابِهِ فَصَنَعْتُ لَهُ طَعَامًا وَصَنَعَتْ لَهُ حَفْصَةُ طَعَامًا قَالَتْ فَسَبَقَتْنِي حَفْصَةُ فَقُلْتُ لِلْجَارِيَةِ انْطَلِقِي فَأَكْفِئِي قَصْعَتَهَا فَلَحِقَتْهَا وَقَدْ هَمَّتْ أَنْ تَضَعَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكْفَأَتْهَا فَانْكَسَرَتْ الْقَصْعَةُ وَانْتَشَرَ الطَّعَامُ قَالَتْ فَجَمَعَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا فِيهَا مِنْ الطَّعَامِ عَلَى النِّطَعِ فَأَكَلُوا ثُمَّ بَعَثَ بِقَصْعَتِي فَدَفَعَهَا إِلَى حَفْصَةَ فَقَالَ خُذُوا ظَرْفًا مَكَانَ ظَرْفِكُمْ وَكُلُوا مَا فِيهَا قَالَتْ فَمَا رَأَيْتُ ذَلِكَ فِي وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syarik bin Abdullah] dari [Qais bin Wahb] dari [seorang laki-laki] dari Bani Su`ah, ia berkata, \"Aku berkata kepada ['Aisyah] beritahukanlah kepadaku bagaimana akhlak Rasulullah shallallahu 'alaihi wasallam. 'Aisyah berkata, \"Apakah kamu tidak membaca Al Qur'an? (Dan sesungguhnya kamu benar-benar di atas akhlak yang agung).\" 'Aisyah kembali menuturkan, \"Ketika Rasulullah shallallahu 'alaihi wasallam sedang bersama-sama para sahabatnya, aku membuatkan makanan untuknya, dan ternyata Hafshah juga membuatkan makanan untuk beliau.\" 'Aisyah melanjutkan, \"Ternyata Hafshah lebih dahulu dalam membuat makanan, maka aku berkata kepada budak perempuanku, \"Pergi dan tumpahkanlah mangkuk piringnya! \" Budak itu pun menyusul Hafshah, sementara Hafshah telah siap untuk meletakkan makanan itu di hadapan Rasulullah shallallahu 'alaihi wasallam. Lalu budak perempuan itu menumpahkannya hingga mangkuknya pecah dan makanannya berhamburan.\" 'Aisyah berkata, \"Rasulullah shallallahu 'alaihi wasallam kemudian mengumpulkan pecahan mangkuk dan makanan yang tertumpah di atas tikar dari kulit, hingga para sahabat dapat memakannya. Setelah itu Rasulullah mengambil mangkuk milikku dan memberikannya kepada Hafshah seraya bersabda: \"Ambilah wadah ini sebagai ganti wadah kalian dan makanlah makanan yang ada di dalamnya.\" 'Aisyah berkata, \"Aku tidak melihat tanda emosi itu di wajah Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2290,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ فَأَرْسَلَتْ أُخْرَى بِقَصْعَةٍ فِيهَا طَعَامٌ فَضَرَبَتْ يَدَ الرَّسُولِ فَسَقَطَتْ الْقَصْعَةُ فَانْكَسَرَتْ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكِسْرَتَيْنِ فَضَمَّ إِحْدَاهُمَا إِلَى الْأُخْرَى فَجَعَلَ يَجْمَعُ فِيهَا الطَّعَامَ وَيَقُولُ غَارَتْ أُمُّكُمْ كُلُوا فَأَكَلُوا حَتَّى جَاءَتْ بِقَصْعَتِهَا الَّتِي فِي بَيْتِهَا فَدَفَعَ الْقَصْعَةَ الصَّحِيحَةَ إِلَى الرَّسُولِ وَتَرَكَ الْمَكْسُورَةَ فِي بَيْتِ الَّتِي كَسَرَتْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Khalid Ibnul Warits] berkata, telah menceritakan kepada kami [Humaid] dari [Anas bin Malik] ia berkata, \"Pernah Nabi shallallahu 'alaihi wasallam bersama salah seorang Ummahatul Mukminin. Lalu ada seorang dari isteri beliau yang lain mengirimkan mangkuk berisi makanan. Lalu ia (isteri yang bersama beliau) memukul tangan Rasulullah hingga mangkuk tersebut jatuh dan pecah. Rasulullah shallallahu 'alaihi wasallam kemudian memungut kembali dua belahan mangkuk tersebut seraya menggabungkannya menjadi satu, kemudian beliau meletakkan kembali makanannya di atas mangkuk. Setelah itu beliau bersabda: \"Makanlah, ibu kalian sedang cemburu.\" Para sahabat pun makan, hingga isteri beliau datang dengan membawa mangkuk yang masih utuh dari dalam rumah. Mangkuk yang masih utuh itu lalu ia berikan kepada Rasulullah shallallahu 'alaihi wasallam, sementara mangkuk telah pecah beliau tinggalkan di rumah isterinya yang telah memecahkannya.\""
            },
            {
                "number": 2291,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَأْذَنَ أَحَدَكُمْ جَارُهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ فَلَا يَمْنَعْهُفَلَمَّا حَدَّثَهُمْ أَبُو هُرَيْرَةَ طَأْطَئُوا رُءُوسَهُمْ فَلَمَّا رَآهُمْ قَالَ مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ وَاللَّهِ لَأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Muhammad bin Ash Shabbah] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari ['Abdurrahman Al A'raj] ia berkata; Aku mendengar [Abu Hurairah] dan sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika tetangga salah seorang dari kalian meminta izin untuk menyandarkan kayu pada tembok miliknya, maka janganlah ia larang.\" Ketika Abu Hurairah menyampaikan hadits tersebut orang-orang mengangguk-anggukkan kepala mereka, ketika Abu Hurairah melihat mereka, ia pun berkata, \"Kenapa aku melihat kalian berpaling darinya! Demi Allah, benar-benar akan aku lembarkan kayu tersebut di antara pudak-pundak kalian.\""
            },
            {
                "number": 2292,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ دِينَارٍ أَنَّ هِشَامَ بْنَ يَحْيَى أَخْبَرَهُ أَنَّ عِكْرِمَةَ بْنَ سَلَمَةَ أَخْبَرَهُأَنَّ أَخَوَيْنِ مِنْ بَلْمُغِيرَةِ أَعْتَقَ أَحَدَهُمَا أَنْ لَا يَغْرِزَ خَشَبًا فِي جِدَارِهِ فَأَقْبَلَ مُجَمِّعُ بْنُ يَزِيدَ وَرِجَالٌ كَثِيرٌ مِنْ الْأَنْصَارِ فَقَالُوا نَشْهَدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِفَقَالَ يَا أَخِي إِنَّكَ مَقْضِيٌّ لَكَ عَلَيَّ وَقَدْ حَلَفْتُ فَاجْعَلْ أُسْطُوَانًا دُونَ حَائِطِي أَوْ جِدَارِي فَاجْعَلْ عَلَيْهِ خَشَبَكَ",
                "id": "Telah menceritakan kepada kami [Abu Bisyr Bakr bin Khalaf] berkata, telah menceritakan kepada kami [Abu Ashim] dari [Ibnu Juraij] dari [Amru bin Dinar] bahwa [Hisyam bin Yahya] mengabarkan kepadanya, bahwa [Ikrimah bin Salamah] mengabarkan kepadanya, bahwa salah satu dari dua orang bersaudara bani Mughirah bersumpah kepada salah satunya untuk tidak menancapkan sebatang kayu (tiang) didindingnya. Lalu datanglah [Mujamma' bin Yazid] disertai beberapa orang dari kaum Anshar seraya berkata; kami bersaksi bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian melarang tetangganya untuk menancapkan sebatang kayu di dindingnya, seraya berkata; wahai sahabatku, sesungguhnya Aku tahu bahwa keputusan jatuh ditanganmu, dan aku telah bersumpah, maka buatlah tancapan pada selain dindingku lalu tancapkanlah kayumu atasnya.\""
            },
            {
                "number": 2293,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ أَبِي الْأَسْوَدِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً عَلَى جِدَارِهِ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Ibnu Lahi'ah] dari [Abul Aswad] dari [Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian mencegah tetangganya untuk menyandarkan kayu pada temboknya.\""
            },
            {
                "number": 2294,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مُثَنَّى بْنُ سَعِيدٍ الضُّبَعِيُّ عَنْ قَتَادَةَ عَنْ بُشَيْرِ بْنِ كَعْبٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلُوا الطَّرِيقَ سَبْعَةَ أَذْرُعٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Mutsanna bin Sa'id Adl Dluba'i] dari [Qatadah] dari [Busyair bin Ka'b] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Buatlah tujuh hasta untuk jalan.\""
            },
            {
                "number": 2295,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَمُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ قَالَا حَدَّثَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اخْتَلَفْتُمْ فِي الطَّرِيقِ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Muhammad bin Umar bin Hayyaj] keduanya berkata; telah menceritakan kepada kami [Qabishah] berkata, telah menceritakan kepada kami [Sufyan] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian berselisih pada batas jalan, maka buatlah tujuh hasta.\""
            },
            {
                "number": 2296,
                "arab": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ حَدَّثَنَا إِسْحَقُ بْنُ يَحْيَى بْنِ الْوَلِيدِ عَنْ عُبَادَةَ بْنِ الصَّامِتِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنْ لَا ضَرَرَ وَلَا ضِرَارَ",
                "id": "Telah menceritakan kepada kami [Abdu Rabbih bin Khalid An Numairi Abu Al Mughallis] berkata, telah menceritakan kepada kami [Fudlail bin Sulaiman] berkata, telah menceritakan kepada kami [Musa bin Uqbah] berkata, telah menceritakan kepada kami [Ishaq bin Yahya bin Al Walid] dari [Ubadah bin Ash Shamith] berkata, \"Rasulullah shallallahu 'alaihi wasallam memutuskan bahwa tidak boleh berbuat madlarat dan hal yang menimbulkan madlarat.\""
            },
            {
                "number": 2297,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ جَابِرٍ الْجُعْفِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا ضَرَرَ وَلَا ضِرَارَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Jabir Al Ju'fi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh berbuat madlarat dan hal yang menimbulkan madlarat.\""
            },
            {
                "number": 2298,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ لُؤْلُؤَةَ عَنْ أَبِي صِرْمَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَقَّ اللَّهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Lulu'ah] dari [Abu Shirmah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa berbuat kemadlaratan maka Allah akan memberinya madlarat, dan barangsiapa membuat kesusahan pada orang lain maka Allah memberinya kesusahan.\""
            },
            {
                "number": 2299,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ قَالَا حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ دَهْثَمِ بْنِ قُرَّانٍ عَنْ نِمْرَانَ بْنِ جَارِيَةَ عَنْ أَبِيهِأَنَّ قَوْمًا اخْتَصَمُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خُصٍّ كَانَ بَيْنَهُمْ فَبَعَثَ حُذَيْفَةَ يَقْضِي بَيْنَهُمْ فَقَضَى لِلَّذِينَ يَلِيهِمْ الْقِمْطُ فَلَمَّا رَجَعَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُ فَقَالَ أَصَبْتَ وَأَحْسَنْتَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] dan [Ammar bin Khalid Al Wasithi] keduanya berkata; telah menceritakan kepada kami [Abu Bakr bin Ayyasy] dari [Dahtsam bin Qurran] dari [Nimran bin Jariyah] dari [Bapaknya] berkata; \"Suatu kaum mengadukan kepada Nabi shallallahu 'alaihi wasallam tentang persengketaan mereka atas sebuah gubuk yang terdapat di tengah-tengah mereka. Lalu beliau mengutus Hudzaifah untuk memberikan putusan di antara mereka. Hudzaifah kemudian memberi putusan bahwa gubuk itu adalah milik orang yang ada di sekitar tali pengekang. Ketika Hudzaifah kembali kepada Nabi shallallahu 'alaihi wasallam dan memberitahukan hasil putusan yang ia berikan, beliau lalu bersabda: \"Engkau tepat dan benar.\""
            },
            {
                "number": 2300,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا هَمَّامٌ عَنْ قتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا بِيعَ الْبَيْعُ مِنْ رَجُلَيْنِ فَالْبَيْعُ لِلْأَوَّلِقَالَ أَبُو الْوَلِيدِ فِي هَذَا الْحَدِيثِ إِبْطَالُ الْخَلَاصِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Al Walid] berkata, telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundab] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika suatu barang dijual oleh dua orang yang berbeda, maka yang sah adalah yang pertama.\""
            },
            {
                "number": 2301,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا كَانَ لَهُ سِتَّةُ مَمْلُوكِينَ لَيْسَ لَهُ مَالٌ غَيْرُهُمْ فَأَعْتَقَهُمْ عِنْدَ مَوْتِهِ فَجَزَّأَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] dan [Muhammad Ibnul Mutsanna] keduanya berkata; telah menceritakan kepada kami [Abdul A'la] berkata, telah menceritakan kepada kami [Khalid Al Hadzdza] dari [Abu Qilabah] dari [Abu Al Muhallib] dari [Imran bin Hushain] berkata, \"Ada seorang laki-laki yang memiliki enam orang budak, dan ia tidak memiliki harta apapun selain mereka. Saat akan meninggal ia memerdekakan mereka semua, namun Rasulullah shallallahu 'alaihi wasallam membagi-bagi mereka. Hingga akhirnya ia hanya memerdekakan dua orang dan menyisakan empat orang budak.\""
            },
            {
                "number": 2302,
                "arab": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلَيْنِ تَدَارَءَا فِي بَيْعٍ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَأَمَرَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ أَحَبَّا ذَلِكَ أَمْ كَرِهَا",
                "id": "Telah menceritakan kepada kami [Jamil bin Al Hasan Al 'Ataki] berkata, telah menceritakan kepada kami [Abdul A'la] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Khilas] dari [Abu Rafi'] dari [Abu Hurairah] berkata, \"Ada dua orang berselisih dalam masalah jual beli, dan tidak ada bukti yang dimiliki oleh keduanya. Maka Rasulullah shallallahu 'alaihi wasallam memerintahkan keduanya untuk mengundi atas sumpah, baik keduanya rela maupun tidak.\""
            },
            {
                "number": 2303,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ أَقْرَعَ بَيْنَ نِسَائِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Yaman] dari [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] berkata, \"Jika Nabi shallallahu 'alaihi wasallam akan pergi bersafar, beliau mengundi antara isteri-isterinya.\""
            },
            {
                "number": 2304,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا الثَّوْرِيُّ عَنْ صَالِحٍ الْهَمْدَانِيِّ عَنْ الشَّعْبِيِّ عَنْ عَبْدِ خَيْرٍ الْحَضْرَمِيِّ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَأُتِيَ عَلِيُّ بْنُ أَبِي طَالِبٍ وَهُوَ بِالْيَمَنِ فِي ثَلَاثَةٍ قَدْ وَقَعُوا عَلَى امْرَأَةٍ فِي طُهْرٍ وَاحِدٍ فَسَأَلَ اثْنَيْنِ فَقَالَ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ فَقَالَا لَا ثُمَّ سَأَلَ اثْنَيْنِ فَقَالَ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ فَقَالَا لَا فَجَعَلَ كُلَّمَا سَأَلَ اثْنَيْنِ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ قَالَا لَا فَأَقْرَعَ بَيْنَهُمْ وَأَلْحَقَ الْوَلَدَ بِالَّذِي أَصَابَتْهُ الْقُرْعَةُ وَجَعَلَ عَلَيْهِ ثُلُثَيْ الدِّيَةِ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] berkata, telah memberitakan kepada kami ['Abdurrazaq] berkata, telah memberitakan kepada kami [Ats Tsauri] dari [Shalih Al Hamdani] dari [Asy Sya'bi] dari [Khair Al Hadlrami] dari [Zaid bin Arqam] ia berkata, \"Ketika Ali bin Abu Thalib berada di Yaman, ada tiga orang yang telah mensetubui seorang wanita dihadapkan kepadanya. Ali lalu bertanya kepada dua orang, \"Apakah kalian berdua mengakui bayi ini sebagai anak?\" Keduanya menjawab, \"Tidak.\" Kemudian ia bertanya kepada keduanya lagi, \"Apakah kalian berdua mengakui bayi ini sebagai anak?\" Keduanya menjawab, \"Tidak.\" Ketika ia bertanya kepada keduanya, \"Apakah kalian berdua mengakui bayi ini sebagai anak? dan keduanya memberi jawaban, \"Tidak.\" Maka ia mengadakan undian di antara mereka dan menisbahkan anak kepada orang yang terkena undian, dan membebankan kepadanya dua pertiga diat. Lalu hal itu diceritakan kepada Nabi shallallahu 'alaihi wasallam, hingga Nabi shallallahu 'alaihi wasallam tertawa dan terlihat gigi-gigi gerahamnya.\""
            },
            {
                "number": 2305,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ مَسْرُورًا وَهُوَ يَقُولُ يَا عَائِشَةُ أَلَمْ تَرَيْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ عَلَيَّ فَرَأَى أُسَامَةَ وَزَيْدًا عَلَيْهِمَا قَطِيفَةٌ قَدْ غَطَّيَا رُءُوسَهُمَا وَقَدْ بَدَتْ أَقْدَامُهُمَا فَقَالَ إِنَّ هَذِهِ الْأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Hisyam bin Ammar] dan [Muhammad bin Ash Shabbah] mereka berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] ia berkata, \"Suatu hari Rasulullah shallallahu 'alaihi wasallam menemuiku dalam keadaan berbunga-bunga, beliau bersabda: \"Wahai 'Aisyah, tidakkah engkau tahu, suatu ketika Mujaziz Al Mudliji masuk menemuiku, lalu ia melihat Usamah dan Zaid memakai kain yang menutupi kepala keduanya sementara kedua telapak kaki keduanya terlihat, lantas ia berkata, \"Sungguh, telapak kaki ini adalah bagian dari telapak kaki yang lainnya! \""
            },
            {
                "number": 2306,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا إِسْرَائِيلُ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ قُرَيْشًا أَتَوْا امْرَأَةً كَاهِنَةً فَقَالُوا لَهَا أَخْبِرِينَا أَشْبَهَنَا أَثَرًا بِصَاحِبِ الْمَقَامِ فَقَالَتْ إِنْ أَنْتُمْ جَرَرْتُمْ كِسَاءً عَلَى هَذِهِ السِّهْلَةِ ثُمَّ مَشَيْتُمْ عَلَيْهَا أَنْبَأْتُكُمْ قَالَ فَجَرُّوا كِسَاءً ثُمَّ مَشَى النَّاسُ عَلَيْهَا فَأَبْصَرَتْ أَثَرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ هَذَا أَقْرَبُكُمْ إِلَيْهِ شَبَهًا ثُمَّ مَكَثُوا بَعْدَ ذَلِكَ عِشْرِينَ سَنَةً أَوْ مَا شَاءَ اللَّهُ ثُمَّ بَعَثَ اللَّهُ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Muhammad bin Yusuf] berkata, telah menceritakan kepada kami [Isra'il] dari [Simak bin Harb] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Orang-orang Quraisy mendatangi seorang dukun wanita, mereka bertanya kepada perempuan itu, \"Kabarkanlah kepada kami, siapakah di antara kami yang jejaknya paling mirip dengan pemilik maqam (Ibrahim) ini?\" wanita itu lantas berkata, \"Jika kalian mau membentangkan kain di atas pasir ini, kemudian kalian berjalan di atasnya, maka aku akan beritakan kepada kalian.\" Ibnu Abbas berkata, \"Mereka pun membentangkan kain dan berjalan di atasnya, hingga wanita itu dapat melihat kemiripan Rasulullah shallallahu 'alaihi wasallam (dengan Ibrahim). Wanita itu lalu berkata; \"Orang inilah yang paling mirip dengannya di antara kalian semua.\" Setelah itu, mereka kemudian berdiam diri selama dua puluh tahun, atau sekehendak Allah. Kemudian Allah mengutus Muhammad shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2307,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ أَبِي مَيْمُونَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيَّرَ غُلَامًا بَيْنَ أَبِيهِ وَأُمِّهِ وَقَالَ يَا غُلَامُ هَذِهِ أُمُّكَ وَهَذَا أَبُوكَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ziyad bin Sa'd] dari [Hilal bin Abu Maimunah] dari [Abu Maimunah] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam memberi pilihan kepada seorang anak laki-laki antara bapak dengan ibunya, beliau bersabda: \"Wahai anak kecil, ini ibumu dan ini bapakmu.\""
            },
            {
                "number": 2308,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ عُثْمَانَ الْبَتِّيِّ عَنْ عَبْدِ الْحَمِيدِ بْنِ سَلَمَةَ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ أَبَوَيْهِ اخْتَصَمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدُهُمَا كَافِرٌ وَالْآخَرُ مُسْلِمٌ فَخَيَّرَهُ فَتَوَجَّهَ إِلَى الْكَافِرِ فَقَالَ اللَّهُمَّ اهْدِهِ فَتَوَجَّهَ إِلَى الْمُسْلِمِ فَقَضَى لَهُ بِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Utsman Al Batti] dari [Abdul Hamid bin Salamah] dari [Bapaknya] dari [Kakeknya] berkata, \"Kedua orang tuanya mengadukan kepada Nabi shallallahu 'alaihi wasallam, salah satunya kafir dan yang lain muslim. Nabi shallallahu 'alaihi wasallam lalu memberi pilihan kepadanya. (Anak itu) menghadap kepada yang masih kafir, beliau lalu berdoa, \"Ya Allah berilah petunjuk kepadanya (anak itu).\" Kemudian (anak itu) menghadap kepada yang muslim, hingga akhirnya beliau memutuskan bahwa anak itu mengikuti orang tuanya yang muslim.\""
            },
            {
                "number": 2309,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ إِلَّا صُلْحًا حَرَّمَ حَلَالًا أَوْ أَحَلَّ حَرَامًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Khalid bin Makhlad] berkata, telah menceritakan kepada kami [Katsir bin Abdullah bin Amru bin Auf] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berdamai antara kaum muslimin itu boleh, kecuali damai untuk mengharamkan yang halal atau yang menghalalkan yang haram.\""
            },
            {
                "number": 2310,
                "arab": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَجُلًا كَانَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عُقْدَتِهِ ضَعْفٌ وَكَانَ يُبَايِعُ وَأَنَّ أَهْلَهُ أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ احْجُرْ عَلَيْهِ فَدَعَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَاهُ عَنْ ذَلِكَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَا أَصْبِرُ عَنْ الْبَيْعِ فَقَال إِذَا بَايَعْتَ فَقُلْ هَا وَلَا خِلَابَةَ",
                "id": "Telah menceritakan kepada kami [Azhar bin Marwan] berkata, telah menceritakan kepada kami [Abdul A'la] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam ada seorang lelaki yang janjinya tidak bisa dipegang, sementara ia adalah seorang pedagang. Keluarganya kemudian mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, cegahlah dia.\" Lalu nabi shallallahu 'alaihi wasallam memanggil orang itu dan melarangnya dari perbuatannya tersebut. Tetapi ia berkata, \"Wahai Rasulullah, aku tidak bisa menahan dari jual beli.\" Beliau bersabda: \"Apabila kamu berjual beli, maka katakanlah apa adanya dan jangan menipu.\""
            },
            {
                "number": 2311,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانٍ قَالَهُوَ جَدِّي مُنْقِذُ بْنُ عَمْرٍو وَكَانَ رَجُلًا قَدْ أَصَابَتْهُ آمَّةٌ فِي رَأْسِهِ فَكَسَرَتْ لِسَانَهُ وَكَانَ لَا يَدَعُ عَلَى ذَلِكَ التِّجَارَةَ وَكَانَ لَا يَزَالُ يُغْبَنُ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ لَهُ إِذَا أَنْتَ بَايَعْتَ فَقُلْ لَا خِلَابَةَ ثُمَّ أَنْتَ فِي كُلِّ سِلْعَةٍ ابْتَعْتَهَا بِالْخِيَارِ ثَلَاثَ لَيَالٍ فَإِنْ رَضِيتَ فَأَمْسِكْ وَإِنْ سَخِطْتَ فَارْدُدْهَا عَلَى صَاحِبِهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdul A'la] dari [Muhammad bin Ishaq] dari [Muhammad bin Yahya bin Hibban] ia berkata, \"Kakekku, Munqid bin Amru adalah seorang laki-laki yang tertimpa cacat di kepalanya dan lisannya pecah. Ia tidak mau meninggalkan perniagaannya meskipun dalam kondisi seperti itu, bahkan ia sering dibohongi. Maka ia datang menemui Nabi shallallahu 'alaihi wasallam dan menceritakan kondisinya tersebut, beliau lalu berkata kepadanya: \"Apabila kamu menjual maka katakanlah dengan jujur dan jangan menipu. Jika kamu membeli sesuatu maka engkau mempunyai hal pilih selama tiga hari, jika kamu rela maka ambillah, tetapi jika tidak maka kembalikan kepada pemiliknya.\""
            },
            {
                "number": 2312,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَأُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَصَدَّقُوا عَلَيْهِ فَتَصَدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ يَعْنِي الْغُرَمَاءَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syababah] berkata, telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Bukair bin Abdullah Al Asyaj] dari [Iyadl bin Abdullah bin Sa'd] dari [Abu Sa'id Al Khudri] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam ada seorang laki-laki yang bangkrut karena buah-buahan yang ia jual rusak hingga hutangnya menumpuk. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Bersedekahlah kalian kepadanya.\" Orang-orang pun bersedekah kepadanya, namun itu semua belum cukup untuk menutup semua hutangnya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Ambillah apa yang kalian dapatkan, dan kalian tidak punya hak apapun selain itu.' (Yakni kepada para pemilik modal).\""
            },
            {
                "number": 2313,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُسْلِمِ بْنِ هُرْمُزٍ عَنْ سَلَمَةَ الْمَكِّيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلَعَ مُعَاذَ بْنَ جَبَلٍ مِنْ غُرَمَائِهِ ثُمَّ اسْتَعْمَلَهُ عَلَى الْيَمَنِفَقَالَ مُعَاذٌ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَخْلَصَنِي بِمَالِي ثُمَّ اسْتَعْمَلَنِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abu 'Ashim] berkata, telah menceritakan kepada kami [Abdullah bin Muslim bin Hurmuz] dari [Salamah Al Makki] dari [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam membebaskan Mu'adz bin Jabal dari orang-orang yang menghutanginya, kemudian beliau memperkerjakannya di Yaman. [Mu'adz] berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam membebaskanku dengan hartaku, kemudian beliau memperkerjakanku.\""
            },
            {
                "number": 2314,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ جَمِيعًا عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدَ مَتَاعَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ",
                "id": "telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah]. (Dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] semuanya dari [Yahya bin Sa'id] dari [Abu Bakr bin Muhammad bin Amru bin Hazm] dari [Umar bin Abdul Aziz] dari [Abu Bakr bin 'Abdurrahman Ibnul Harits dari Hisyam] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapatkan hartanya ada pada seorang laki-laki yang jatuh bangkrut, maka ia (pemilik modal) yang paling berhak atas harta tersebut dari selainnya.\""
            },
            {
                "number": 2315,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا رَجُلٍ بَاعَ سِلْعَةً فَأَدْرَكَ سِلْعَتَهُ بِعَيْنِهَا عِنْدَ رَجُلٍ وَقَدْ أَفْلَسَ وَلَمْ يَكُنْ قَبَضَ مِنْ ثَمَنِهَا شَيْئًا فَهِيَ لَهُ وَإِنْ كَانَ قَبَضَ مِنْ ثَمَنِهَا شَيْئًا فَهُوَ أُسْوَةٌ لِلْغُرَمَاءِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isma'il bin Ayyasy] dari [Musa bin Uqbah] dari [Az Zuhri] dari [Abu Bakr bin 'Abdurrahman Ibnul Harits bin Hisyam] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Lelaki mana saja yang menjual barang kemudian ia mendapati barangnya masih ada pada seseorang yang bangkrut, sementara ia belum menerima uang pembayarannya, maka barang tersebut menjadi haknya. Jika ia telah memegang uang pembayarannya maka ia seperti pemilik hutang.\""
            },
            {
                "number": 2316,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ أَبِي الْمُعْتَمِرِ بْنِ عَمْرِو بْنِ رَافِعٍ عَنْ ابْنِ خَلْدَةَ الزُّرَقِيِّ وَكَانَ قَاضِيًا بِالْمَدِينَةِ قَالَجِئْنَا أَبَا هُرَيْرَةَ فِي صَاحِبٍ لَنَا قَدْ أَفْلَسَ فَقَالَ هَذَا الَّذِي قَضَى فِيهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا رَجُلٍ مَاتَ أَوْ أَفْلَسَ فَصَاحِبُ الْمَتَاعِ أَحَقُّ بِمَتَاعِهِ إِذَا وَجَدَهُ بِعَيْنِهِ",
                "id": "Telah menceritakan kepada kami [Ibrahim Ibnul Mundzir Al Hizami] dan ['Abdurrahman bin Ibrahim Ad Dimasyqi] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Ibnu Abu Dzi`b] dari [Abu Al Mu'tamir bin Amru bin Rafi'] dari [Ibnu Khaldah Az Zuraqi] -ia adalah seorang hakim di Madinah- ia berkata, \"Kami mendatangi [Abu Hurairah] untuk mengadukan pengelola harta kami yang bangkrut, maka ia berkata, \"Inilah yang pernah diberi putuskan oleh Nabi shallallahu 'alaihi wasallam, bahwa laki-laki mana saja yang meninggal atau bangkrut, maka pemilik barang lebih berhak dengan barang miliknya jika ia mendapatinya masih ada.\""
            },
            {
                "number": 2317,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا الْيَمَانُ بْنُ عَدِيٍّ حَدَّثَنِي الزُّبَيْدِيُّ مُحَمَّدُ بْنُ الْوَلِيدِ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرِئٍ مَاتَ وَعِنْدَهُ مَالُ امْرِئٍ بِعَيْنِهِ اقْتَضَى مِنْهُ شَيْئًا أَوْ لَمْ يَقْتَضِ فَهُوَ أُسْوَةٌ لِلْغُرَمَاءِ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman bin Sa'id bin Katsir bin Dinar Al Himshi] berkata, telah menceritakan kepada kami [Al Yaman bin Adi] berkata, telah menceritakan kepadaku [Az Zubaidi Muhammad Ibnul Walid] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa pun orangnya yang meninggal sementara ia memegang harta milik orang lain, baik ia telah memberikan sesuatu darinya atau belum, maka dia (pemilik harta) seperti pemilik hutang.\""
            },
            {
                "number": 2318,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَعَمْرُو بْنُ رَافِعٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ السَّلْمَانِيِّ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ النَّاسِ خَيْرٌ قَالَ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَجِيءُ قَوْمٌ تَبْدُرُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ وَيَمِينُهُ شَهَادَتَهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Amru bin Rafi'] keduanya berkata; telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Abidah As Salmani] berkata; [Abdullah bin Mas'ud] berkata; Rasulullah shallallahu 'alaihi wasallam pernah ditanya, \"Siapa manusia yang paling baik?\" beliau menjawab: \"Orang yang hidup dimasaku, kemudian orang-orang setelahnya, kemudian orang-orang setelahnya, kemudian akan datang suatu kaum yang persaksian salah seorang dari mereka mendahului sumpahnya, dan sumpahnya mendahului persaksiannya.\""
            },
            {
                "number": 2319,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بنُ الْجَرَّاحِ حَدَّثَنَا جَرِيرٌ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَخَطَبَنَا عُمَرُ بْنُ الْخَطَّابِ بِالْجَابِيَةِ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا مِثْلَ مُقَامِي فِيكُمْ فَقَالَ احْفَظُونِي فِي أَصْحَابِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَفْشُو الْكَذِبُ حَتَّى يَشْهَدَ الرَّجُلُ وَمَا يُسْتَشْهَدُ وَيَحْلِفَ وَمَا يُسْتَحْلَفُ",
                "id": "Telah menceritakan kepada kami [Abdullah Ibnul Jarrah] berkata, telah menceritakan kepada kami [Jarir] dari [Abdul Malik bin Umair] dari [Jabir bin Samurah] ia berkata; [Umar Ibnul Khtaththab] berkhutbah di Jabiah, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah berdiri di hadapan kami sebagaimana aku berdiri di hadapan kalian, lalu beliau bersabda: \"Jagalah (hak) sahabatku, kemudian orang-orang setelah mereka, kemudian orang-orang setelah mereka. Setelah itu akan menyebar kedustaan, hingga seorang laki-laki bersaksi tanpa diminta untuk bersaksi, dan bersumpah tanpa diminta untuk bersumpah.\""
            },
            {
                "number": 2320,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ عَبدِ الرَّحْمَنِ الْجُعْفِيُّ قَالَا حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ الْعُكْلِيُّ أَخْبَرَنِي أُبَيُّ بْنُ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيُّ حَدَّثَنِي أَبُو بَكْرِ بْنُ عَمْرِو بْنِ حَزْمٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ حَدَّثَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ الْأَنْصَارِيُّ أَنَّهُ سَمِعَ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ يَقُولُإِنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَيْرُ الشُّهُودِ مَنْ أَدَّى شَهَادَتَهُ قَبْلَ أَنْ يُسْأَلَهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin 'Abdurrahman Al Ju'fi] keduanya berkata; telah menceritakan kepada kami [Zaid Ibnul Hubab Al 'Ukli] berkata, telah mengabarkan kepadaku [Ubai bin Abbas bin Sahl bin Sa'd As Sa'idi] berkata, telah menceritakan kepadaku [Abu Bakr bin Amru bin Hazm] berkata, telah menceritakan kepadaku [Muhammad bin Abdullah bin Amru bin Utsman bin Affan] berkata, telah menceritakan kepadaku [Kharijah bin Zaid bin Tsabit] berkata, telah menceritakan kepadaku ['Abdurrahman bin Abu Amrah Al Anshari] bahwasanya ia mendengar [Zaid bin Khalid Al Juhani] ia berkata, \"Bahwasanya ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik pemberi saksi adalah orang yang memberikan persaksiannya sebelum diminta.\""
            },
            {
                "number": 2321,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ يُوسُفَ الْجُبَيْرِيُّ وَجَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ مَرْوَانَ الْعِجْلِيُّ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي نَضْرَةَ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَتَلَا هَذِهِ الْآيَةَ{ يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَدَايَنْتُمْ بِدَيْنٍ إِلَى أَجَلٍ مُسَمًّى حَتَّى بَلَغَ فَإِنْ أَمِنَ بَعْضُكُمْ بَعْضًا }فَقَالَ هَذِهِ نَسَخَتْ مَا قَبْلَهَا",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Yusuf Al Jubairi] dan [Jamil bin Al Hasan Al Atiki] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Marwan Al Ijli] berkata, telah menceritakan kepada kami [Abdul Malik bin An Nadlrah] dari [Bapaknya] dari [Abu Sa'id Al Khudri] ia berkata ketika dia membaca ayat ini: ' Wahai orang-orang yang beriman, apabila kalian berhutang piutang untuk waktu tertentu, hendaklah kalian menuliskannya, hingga ayat: ' Akan tetapi jika sebagian kalian percaya kepada sebagian yang lain', ia mengatakan, \"Ayat ini menghapus ayat yang sebelumnya.\""
            },
            {
                "number": 2322,
                "arab": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ حَدَّثَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجُوزُ شَهَادَةُ خَائِنٍ وَلَا خَائِنَةٍ وَلَا مَحْدُودٍ فِي الْإِسْلَامِ وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Ayyub bin Muhammad Ar Raqqi] berkata, telah menceritakan kepada kami [Ma'mar bin Sulaiman]. (Dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yazid bin Harun] keduanya berkata; telah menceritakan kepada kami [Hajjaj bin Arthah] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak berlaku persaksian orang yang berkhianat baik laki-laki maupun perempuan, tidak ada orang yang dihukum hudud dalam Islam, dan tidak ada permusuhan kepada saudaranya.\""
            },
            {
                "number": 2323,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي نَافِعُ بْنُ يَزِيدَ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Nafi' bin Yazid] dari [Ibnu Al Had] dari [Muhammad bin Amru bin 'Atha] dari ['Atha bin Yasar] dari [Abu Hurairah] bahwasanya ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh persaksian orang badui atas penduduk desa.\""
            },
            {
                "number": 2324,
                "arab": "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدِينِيُّ أَحْمَدُ بْنُ عَبْدِ اللَّهِ الزُّهْرِيُّ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ",
                "id": "Telah menceritakan kepada kami [Abu Mush'ab Al Madini Ahmad bin Abdullah Az Zuhri] dan [Ya'qub bin Ibrahim Ad Dauraqqi] keduanya berkata; telah menceritakan kepada kami [Abdul Aziz bin Muhammad Ad Darawardi] dari [Rabi'ah bin Abu 'Abdurrahman] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam memutuskan bahwa sumpah harus ada saksi.\""
            },
            {
                "number": 2325,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abdul Wahhab] berkata, telah menceritakan kepada kami [Ja'far bin Muhammad] dari [Bapaknya] dari [Jabir] berkata, \"Nabi shallallahu 'alaihi wasallam memutuskan bahwa sumpah harus ada saksi.\""
            },
            {
                "number": 2326,
                "arab": "حَدَّثَنَا أَبُو إِسْحَقَ الْهَرَوِيُّ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ الْمَخْزُومِيُّ حَدَّثَنَا سَيْفُ بْنُ سُلَيْمَانَ الْمَكِّيُّ أَخْبَرَنِي قَيْسُ بْنُ سَعْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشَّاهِدِ وَالْيَمِينِ",
                "id": "Telah menceritakan kepada kami [Abu Ishaq Al Harawi Ibrahim bin Abdullah bin Hatim] berkata, telah menceritakan kepada kami [Abdullah bin Al Harits Al Makhzumi] berkata, telah menceritakan kepada kami [Saif bin Sulaiman Al Makki] berkata, telah mengabarkan kepadaku [Qais bin Sa'd] dari [Amru bn Dinar] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memutuskan (dalam menyelesaikan suatu masalah) dengan adanya saksi dan sumpah.\""
            },
            {
                "number": 2327,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ عَنْ سُرَّقٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجَازَ شَهَادَةَ الرَّجُلِ وَيَمِينَ الطَّالِبِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Juwairiyah bin Asma] berkata, telah menceritakan kepada kami [Abdullah bin Yazid] -mantan budak Al Munba'its- dari [seorang penduduk Mesir] dari [Surraq] berkata, \"Nabi shallallahu 'alaihi wasallam memperbolehkan persaksian seorang lelaki dan sumpah orang yang menuntut.\""
            },
            {
                "number": 2328,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا سُفْيَانُ الْعُصْفُرِيُّ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ النُّعْمَانِ الْأَسَدِيِّ عَنْ خُرَيْمِ بْنِ فَاتِكٍ الْأَسَدِيِّ قَالَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا فَقَالَ عُدِلَتْ شَهَادَةُ الزُّورِ بِالْإِشْرَاكِ بِاللَّهِ ثَلَاثَ مَرَّاتٍ ثُمَّ تَلَا هَذِهِ الْآيَةَ{ وَاجْتَنِبُوا قَوْلَ الزُّورِ حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ }",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Sufyan Al 'Ushfuri] dari [Bapaknya] dari [Habib An Nu'mani Al Asadi] dari [Khuraim bin Fatik Al Asadi] ia berkata, \"Nabi shallallahu 'alaihi wasallam melaksanakan sholat subuh, setelah selesai beliau berdiri dan bersabda: \"Persaksian palsu itu sama dengan syirik kepada Allah.\" Hal itu beliau ucapkan hingga tiga kali, setelah itu beliau membaca ayat: ' maka jauhilah olehmu berhala-berhala yang najis itu dan jauhilah perkataan-perkataan dusta. dengan ikhlas kepada Allah, tidak mempersekutukan sesuatu dengan Dia'. QS. Al Hajj: 30-31.\""
            },
            {
                "number": 2329,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْفُرَاتِ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ تَزُولَ قَدَمَا شَاهِدِ الزُّورِ حَتَّى يُوجِبَ اللَّهُ لَهُ النَّارَ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Muhammad bin Al Furat] dari [Muharib bin Ditsar] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekali-kali kedua kaki orang yang bersumpah palsu tidak akan bergeser hingga Allah memasukannya ke dalam neraka.\""
            },
            {
                "number": 2330,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ مُجَالِدٍ عَنْ عَامِرٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجَازَ شَهَادَةَ أَهْلِ الْكِتَابِ بَعْضِهِمْ عَلَى بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Tharif] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Mujalid] dari [Amir] dari [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam memperbolehkan persaksian ahli kitab sebagian mereka atas sebagian yang lain.\""
            },
            {
                "number": 2331,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَانْطَلَقَ بِهِ أَبُوهُ يَحْمِلُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اشْهَدْ أَنِّي قَدْ نَحَلْتُ النُّعْمَانَ مِنْ مَالِي كَذَا وَكَذَا قَالَ فَكُلَّ بَنِيكَ نَحَلْتَ مِثْلَ الَّذِي نَحَلْتَ النُّعْمَانَ قَالَ لَا قَالَ فَأَشْهِدْ عَلَى هَذَا غَيْرِي قَالَ أَلَيْسَ يَسُرُّكَ أَنْ يَكُونُوا لَكَ فِي الْبِرِّ سَوَاءً قَالَ بَلَى قَالَ فَلَا إِذًا",
                "id": "Telah menceritakan kepada kami [Abu Bisyr Bakr bin Khalaf] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] dari [Dawud bin Abu Hind] dari [Asy Sya'bi] dari [An Nu'man bin Basyir] mengatakan bahwa bapaknya pernah mengajaknya menghadap Nabi shallallahu 'alaihi wasallam dan berkata, \"Saksikanlah, sesungguhnya aku telah memberi An Nu'man dari uangku sekian dan sekian! \" beliau bersabda: \"Apakah ini juga engkau lakukan untuk anakmu yang lain, sebagaimana yang engkau lakukan terhadap Nu'man?\" ia menjawab, \"Tidak.\" Beliau bersabda: \"Carilah orang lain untuk menjadi saksi.\" Kemudian beliau melanjutkan: \"Tidakkah engkau suka, jika kebaikan mereka untukmu juga sama?\" ia menjawab, \"Tentu.\" Beliau bersabda: \"Maka janganlah engkau lakukan hal itu.\""
            },
            {
                "number": 2332,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ وَمُحَمَّدِ بْنِ النُّعْمَانِ بْنِ بَشِيرٍ أَخْبَرَاهُ عَنْ النُّعْمَانِ بْنِ بَشِيرٍأَنَّ أَبَاهُ نَحَلَهُ غُلَامًا وَأَنَّهُ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشْهِدُهُ فَقَالَ أَكُلَّ وَلَدِكَ نَحَلْتَهُ قَالَ لَا قَالَ فَارْدُدْهُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Humaid bin 'Abdurrahman] dan [Muhammad bin An Nu'man bin Basyir] keduanya telah mengabarkan kepadanya dari [An Nu'man bin Basyir] bahwa bapaknya memberikan seorang budak kepadanya, lalu bapaknya mengajak menemui Nabi shallallahu 'alaihi wasallam untuk menjadi saksi. Beliau lalu bersabda: \"Apakah semua anakmu engkau beri?\" ia menjawab, \"Tidak.\" Beliau bersabda: \"Kembalikanlah budak itu.\""
            },
            {
                "number": 2333,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ وَابْنِ عُمَرَيَرْفَعَانِ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِلرَّجُلِ أَنْ يُعْطِيَ الْعَطِيَّةَ ثُمَّ يَرْجِعَ فِيهَا إِلَّا الْوَالِدَ فِيمَا يُعْطِي وَلَدَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Abu Bakr bin Khallad Al Bahili] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Adi] dari [Husain Al Mu'allim] dari [Amru bin Syu'aib] dari [Thawus] dari [Ibnu Abbas] dan [Ibnu Umar] keduanya memarfu'kan hadits tersebut kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal seorang laki-laki memberikan suatu pemberian kemudian diminta kembali, kecuali orang tua terhadap sesuatu yang ia berikan kepada anaknya.\""
            },
            {
                "number": 2334,
                "arab": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرْجِعْ أَحَدُكُمْ فِي هِبَتِهِ إِلَّا الْوَالِدَ مِنْ وَلَدِهِ",
                "id": "Telah menceritakan kepada kami [Jamil bin Al Hasan] berkata, telah menceritakan kepada kami [Abdul A'la] Telah menceritakan kepada kami [Sa'id] dari [Amir Al Ahwal] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian mengambil kembali barang yang telah ia berikan, kecuali orang tua kepada anaknya.\""
            },
            {
                "number": 2335,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عُمْرَى فَمَنْ أُعْمِرَ شَيْئًا فَهُوَ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Zakaria bin Abu Za`idah] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada umra, maka barangsiapa diberi umra atas sesuatu maka ia (sesuatu) menjadi miliknya.\" "
            },
            {
                "number": 2336,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَعْمَرَ رَجُلًا عُمْرَى لَهُ وَلِعَقِبِهِ فَقَدْ قَطَعَ قَوْلُهُ حَقَّهُ فِيهَا فَهِيَ لِمَنْ أُعْمِرَ وَلِعَقِبِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Ibnu Syihab] dari [Abu Salamah] dari [Jabir] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memberikan umra untuk seseorang dan keturunannya, sungguh ucapannya tersebut memutus haknya untuk mendapatkan umra itu kembali. Maka umra tersebut akan menjadi milik seseorang yang telah diserahi dan keturunannya.\""
            },
            {
                "number": 2337,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ حُجْرٍ الْمَدَرِيِّ عَنْ زَيْدِ بْنِ ثَابِتٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ الْعُمْرَى لِلْوَارِثِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan] dari [Amru bin Dinar] dari [Thawus] dari [Hujr Al Madari] dari [Zaid bin Tsabit] berkata, \"Nabi shallallahu 'alaihi wasallam menetapkan bahwa umra bisa dimiliki oleh ahli warits.\""
            },
            {
                "number": 2338,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا رُقْبَى فَمَنْ أُرْقِبَ شَيْئًا فَهُوَ لَهُ حَيَاتَهُ وَمَمَاتَهُقَالَ وَالرُّقْبَى أَنْ يَقُولَ هُوَ لِلْآخَرِ مِنِّي وَمِنْكَ مَوْتًا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] berkata, telah mengabarkan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ibnu Juraij] dari ['Atha] dari [Habib bin Abu Tsabit] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada ruqba, barangsiapa diberi ruqba maka ia berhak memilikinya baik dimasa hidup dan setelah matinya.\" Ibnu Umar menjelaskan: \"Ruqba adalah Seseorang mengatakan, 'Ia akan menjadi milik orang lain yang telah meninggal antara aku dan kamu'.\""
            },
            {
                "number": 2339,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا هُشَيْمٌ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَا حَدَّثَنَا دَاوُدُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعُمْرَى جَائِزَةٌ لِمَنْ أُعْمِرَهَا وَالرُّقْبَى جَائِزَةٌ لِمَنْ أُرْقِبَهَا",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Husyaim]. (Dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] keduanya berkata; telah menceritakan kepada kami [Dawud] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Umra boleh bagi orang yang diberi, dan ruqba boleh bagi orang yang diberi.\" "
            },
            {
                "number": 2340,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَوْفٍ عَنْ خِلَاسٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مَثَلَ الَّذِي يَعُودُ فِي عَطِيَّتِهِ كَمَثَلِ الْكَلْبِ أَكَلَ حَتَّى إِذَا شَبِعَ قَاءَ ثُمَّ عَادَ فِي قَيْئِهِ فَأَكَلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Auf] dari [Khilas] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Permisalan orang yang meminta kembali sesuatu yang telah ia berikan seperti seekor anjing yang makan, jika kenyang ia memuntahkannya kemudian kembali memakannya.\""
            },
            {
                "number": 2341,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Muhammad bin Al Mutsanna] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] ia berkata; Aku mendengar [Qatadah] menceritakan dari [Sa'id bin Al Musayyab] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang kembali meminta pemberiannya seperti orang yang memakan kembali muntahannya.\""
            },
            {
                "number": 2342,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُوسُفَ الْعَرْعَرِيُّ حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَكِيمٍ حَدَّثَنَا الْعُمَرِيُّ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah bin Yusuf Al 'Ar'ari] berkata, telah menceritakan kepada kami [Yazid bin Abu Hakim] berkata, telah menceritakan kepada kami [Al 'Umari] dari [Zaid bin Aslam] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang meminta kembali pemberiannya bagaikan anjing yang mengambil kembali muntahannya.\""
            },
            {
                "number": 2343,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ بْنِ مُجَمِّعِ بْنِ جَارِيَةَ الْأَنْصَارِيُّ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي هُرَيْرَةَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلُ أَحَقُّ بِهِبَتِهِ مَا لَمْ يُثَبْ مِنْهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Ismai] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Ibrahim bin Isma'il bin Mujammi' bin Jariyah Al Anshar] dari [Amru bin Dinar] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seseorang lebih berhak atas pemberiannya selagi ia menguasainya (belum memberikannya kepada yang lain).\""
            },
            {
                "number": 2344,
                "arab": "حَدَّثَنَا أَبُو يُوسُفَ الرَّقِّيُّ مُحَمَّدُ بْنُ أَحْمَدَ الصَّيْدَلَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ الْمُثَنَّى بْنِ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي خُطْبَةٍ خَطَبَهَا لَا يَجُوزُ لِامْرَأَةٍ فِي مَالِهَا إِلَّا بِإِذْنِ زَوْجِهَا إِذَا هُوَ مَلَكَ عِصْمَتَهَا",
                "id": "Telah menceritakan kepada kami [Abu Yusuf Ar Raqqi Muhammad bin Ahmad Ash Shaidalani] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Al Mutsanna bin Ash Shabbah] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda dalam khutbahnya: \"Seorang wanita tidak boleh menggunakan uang miliknya tanpa izin suaminya, jika suaminya telah sah menikahinya.\""
            },
            {
                "number": 2345,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي اللَّيْثُ بْنُ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى رَجُلٌ مِنْ وَلَدِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ جَدَّتَهُ خَيْرَةَ امْرَأَةَ كَعْبِ بْنِ مَالِكٍ أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحُلِيٍّ لَهَا فَقَالَتْ إِنِّي تَصَدَّقْتُ بِهَذَا فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجُوزُ لِلْمَرْأَةِ فِي مَالِهَا إِلَّا بِإِذْنِ زَوْجِهَا فَهَلْ اسْتَأْذَنْتِ كَعْبًا قَالَتْ نَعَمْ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى كَعْبِ بْنِ مَالِكٍ زَوْجِهَا فَقَالَ هَلْ أَذِنْتَ لِخَيْرَةَ أَنْ تَتَصَدَّقَ بِحُلِيِّهَا فَقَال نَعَمْ فَقَبِلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا",
                "id": "Telah menceritakan kepada kami [Harmalah bi Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Al Laits bin Sa'd] dari [Abdullah bin Yahya] -seorang lelaki anak dari Ka'b bin Malik- dari [Bapaknya] dari [Kakeknya] bahwa neneknya Khairah -istri Ka'b bin Malik- datang menemui Rasulullah shallallahu 'alaihi wasallam dengan membawa perhiasannya, lalu ia berkata, \"Aku ingin mensedekahkan perhiasan ini.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepadanya: \"Seorang istri tidak boleh mensedekahkan hartanya kecuali atas izin suaminya. Apakah kamu sudah meminta izin kepada Ka'b?\" ia menjawab: \"Ya.\" Rasulullah shallallahu 'alaihi wasallam kemudian mengutus seseorang menemui Ka'b bin Malik suaminya untuk menanyakan: \"Apakah kamu sudah mengizinkan Khairah untuk bersedekah dengan perhiasan miliknya?\" Ka'b menjawab, \"Ya.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam pun menerima sedekahnya.\""
            },
            {
                "number": 2346,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ الْخَطَّابِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَعُدْ فِي صَدَقَتِكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Hisyam bin Sa'd] dari [Zaid bin Aslam] dari [Bapaknya] dari [Umar bin Al Khaththab] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah engkau minta kembali sedekahmu.\""
            },
            {
                "number": 2347,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيٍّ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْعَبَّاسِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الَّذِي يَتَصَدَّقُ ثُمَّ يَرْجِعُ فِي صَدَقَتِهِ مَثَلُ الْكَلْبِ يَقِيءُ ثُمَّ يَرْجِعُ فَيَأْكُلُ قَيْئَهُ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] berkata, telah menceritakan kepadaku [Abu Ja'far Muhammad bin Ali] berkata, telah menceritakan kepadaku [Sa'id Ibnul Musayyab] berkata, telah menceritakan kepadaku [Abdullah bin Al Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Permisalah orang yang bersedekah kemudian memintanya kembali seperti anjing yang muntah kemudian memakannya kembali.\""
            },
            {
                "number": 2348,
                "arab": "حَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ الْوَاسِطِيُّ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ عَنْ شَرِيكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُمَرَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ يَعْنِي عَنْ أَبِيهِ عَنْ جَدِّهِ عُمَرَأَنَّهُ تَصَدَّقَ بِفَرَسٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبْصَرَ صَاحِبَهَا يَبِيعُهَا بِكَسْرٍ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَا تَبْتَعْ صَدَقَتَكَ",
                "id": "Telah menceritakan kepada kami [Tamim bin Al Muntashir Al Wasithi] berkata, telah menceritakan kepada kami [Ishaq bin Yusuf] dari [Syarik] dari [Hisyam bin Urwah] dari [Umar bin Abdullah bin Umar] yakni dari [Bapaknya] dari kakeknya [Umar] bahwa pada masa Rasulullah shallallahu 'alaihi wasallam, ia pernah bersedekah seekor kuda (kepad seseorang), lalu pemiliknya menjualnya kembali dengan harga murah. Maka ia mendatangi Nabi shallallahu 'alaihi wasallam dan menanyakan tentang hal itu, beliau lalu menjawab: \"Jangan engkau beli kembali sedekahmu.\""
            },
            {
                "number": 2349,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ الزُّبَيْرِ بْنِ الْعَوَّامِأَنَّهُ حَمَلَ عَلَى فَرَسٍ يُقَالُ لَهُ غَمْرٌ أَوْ غَمْرَةٌ فَرَأَى مُهْرًا أَوْ مُهْرَةً مِنْ أَفْلَائِهَا يُبَاعُ يُنْسَبُ إِلَى فَرَسِهِ فَنَهَى عَنْهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Sualaiman At Taimi] dari [Abu Utsman An Nahdi] dari [Abdullah bin Amir] dari [Zubair bin Awwam] bahwa dia menaiki seekor kuda yang diberi nama Ghamrun atau Ghamrah, kemudian dia melihat seekor anak kuda jantan atau betina dari beberapa anak kuda yang dijual dan dinisbahkan kepada kudanya, maka dia melarangnya.\""
            },
            {
                "number": 2350,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَجَاءَتْ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي تَصَدَّقْتُ عَلَى أُمِّي بِجَارِيَةٍ وَإِنَّهَا مَاتَتْ فَقَالَ آجَرَكِ اللَّهُ وَرَدَّ عَلَيْكِ الْمِيرَاثَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abdullah bin 'Atha] dari [Abdullah bin Buraidah] dari [Bapaknya] ia berkata, \"Seorang wanita datang menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, aku bersedekah kepada ibuku dengan memberikan seorang budak wanita, tetapi ibuku meninggal?\" beliau menjawab: \"Semoga Allah memberimu pahala, dan Allah akan mengembalikannya kepadamu sebagai warisan.\""
            },
            {
                "number": 2351,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ عَبْدِ الْكَرِيمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أَعْطَيْتُ أُمِّي حَدِيقَةً لِي وَإِنَّهَا مَاتَتْ وَلَمْ تَتْرُكْ وَارِثًا غَيْرِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَبَتْ صَدَقَتُكَ وَرَجَعَتْ إِلَيْكَ حَدِيقَتُكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Ja'far Ar Raqqi] berkata, telah menceritakan kepada kami [ubaidhullah] dari [Abdul Karim] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam dan bertanya, \"Aku memberikan kebun milikku kepada ibuku, namun ia meninggal. Dan ibuku tidak meninggalkan ahli waris kecuali aku?\" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sedekahmu telah diterima, dan kebun itu akan kembali kepadamu (sebagai warisan).\""
            },
            {
                "number": 2352,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَأَصَابَ عُمَرُ بْنُ الْخَطَّابِ أَرْضًا بِخَيْبَرَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْمَرَهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ مَالًا بِخَيْبَرَ لَمْ أُصِبْ مَالًا قَطُّ هُوَ أَنْفَسُ عِنْدِي مِنْهُ فَمَا تَأْمُرُنِي بِهِ فَقَالَ إِنْ شِئْتَ حَبَّسْتَ أَصْلَهَا وَتَصَدَّقْتَ بِهَاقَالَ فَعَمِلَ بِهَا عُمَرُ عَلَى أَنْ لَا يُبَاعَ أَصْلُهَا وَلَا يُوهَبَ وَلَا يُورَثَ تَصَدَّقَ بِهَا لِلْفُقَرَاءِ وَفِي الْقُرْبَى وَفِي الرِّقَابِ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ وَالضَّيْفِ لَا جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَهَا بِالْمَعْرُوفِ أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Mu'tamir bin Sulaiman] dari [Ibnu Aun] dari [Nafi'] dari [Ibnu Umar] ia berkata; Umar bin Al Khaththab mendapatkan bagian sebidang tanah di khaibar, lalu ia mendatangi Nabi shallallahu 'alaihi wasallam meminta solusi. Ia lalu berkata, \"Wahai Rasulullah, aku mendapatkan harta berupa sebidang tanah di khaibar, dan aku tidak memiliki harta yang paling aku sukai selain itu, lalu apa yang engkau perintahkan kepadaku?\" beliau bersabda: \"Jika engkau mau, tetaplah engkau pegang tanah itu dan silahkan engkau bersedekah darinya.\" Ibnu Umar berkata, \"Lalu Umar melakukan hal itu, ia tidak menjual, tidak menghibahkan, dan tidak mewariskan tanah tersebut. Ia sedekahkah harta tersebut kepada orang-orang fakir, kerabat, fi sabilillah, Ibnu Sabil, dan tamu. Dan bagi orang-orang yang mengurusinya ia boleh memakannya dengan ma'ruf, atau menjamu temannya tanpa mengkomersilkannya.\""
            }
        ]
    }
}