{
    "status": true,
    "data": {
        "start": 1324,
        "end": 1470,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 1324,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رِفَاعَةَ الْجُهَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يُمْهِلُ حَتَّى إِذَا ذَهَبَ مِنْ اللَّيْلِ نِصْفُهُ أَوْ ثُلُثَاهُ قَالَ لَا يَسْأَلَنَّ عِبَادِي غَيْرِي مَنْ يَدْعُنِي أَسْتَجِبْ لَهُ مَنْ يَسْأَلْنِي أُعْطِهِ مَنْ يَسْتَغْفِرْنِي أَغْفِرْ لَهُ حَتَّى يَطْلُعَ الْفَجْرُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Mush'ab] dari [Al Auza'i] dari [Yahya bin Abu katsir] dari [Hilal bin Abu Maimunah] dari ['Atho` bin Yasar] dari [Rifa'ah Al Juhani] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah memperlambat hingga berlalu setengah atau dua pertiga malam, Allah berfirman: \"Jangan sekali-kali para hamba-Ku meminta kepada selain Aku! Barangsiapa berdo`a kepada-Ku maka akan Aku kabulkan, barangsiapa meminta kepada-Ku maka akan Aku beri dan barangsiapa meminta ampun kepada-Ku maka akan Aku ampuni hingga terbit fajar. \""
            },
            {
                "number": 1325,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ وَأَسْبَاطُ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَلْقَمَةَ عَنْ أَبِي مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْآيَتَانِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ مَنْ قَرَأَهُمَا فِي لَيْلَةٍ كَفَتَاهُقَالَ حَفْصٌ فِي حَدِيثِهِ قَالَ عَبْدُ الرَّحْمَنِ فَلَقِيتُ أَبَا مَسْعُودٍ وَهُوَ يَطُوفُ فَحَدَّثَنِي بِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dan [Asbath bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari ['Abdurrahman bin Yazid] dari [Alqamah] dari [Abu Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca dua ayat terakhir dari surat Al Baqarah pada suatu malam, maka itu telah mencukupi. \" Hafsh menyebutkan dalam haditsnya, \"'Abdurrahman berkata, \"Aku bertemu Abu Mas'ud ketika thawaf, lalu ia menceritakan hadits itu kepadaku. \""
            },
            {
                "number": 1326,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَرَأَ الْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari ['Abdurrahman bin Yazid] dari [Abu Mas'ud] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca dua ayat terakhir dari surat Al Baqarah dalam satu malam, maka itu telah cukup. \""
            },
            {
                "number": 1327,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَعَسَ أَحَدُكُمْ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ فَإِنَّهُ لَا يَدْرِي إِذَا صَلَّى وَهُوَ نَاعِسٌ لَعَلَّهُ يَذْهَبُ فَيَسْتَغْفِرُ فَيَسُبُّ نَفْسَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Marwan Muhammad bin Utsman Al Utsmani] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] semuanya dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian mengantuk hendaklah tidur hingga rasa kantuknya hilang, sebab jika sholat dalam kondisi mengantuk ia tidak tahu, ia meminta ampun tetapi justru menghina dirinya. \""
            },
            {
                "number": 1328,
                "arab": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى اللَّيْثِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْمَسْجِدَ فَرَأَى حَبْلًا مَمْدُودًا بَيْنَ سَارِيَتَيْنِ فَقَالَ مَا هَذَا الْحَبْلُ قَالُوا لِزَيْنَبَ تُصَلِّي فِيهِ فَإِذَا فَتَرَتْ تَعَلَّقَتْ بِهِ فَقَالَ حُلُّوهُ حُلُّوهُ لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ فَإِذَا فَتَرَ فَلْيَقْعُدْ",
                "id": "Telah menceritakan kepada kami [Imran bin Musa Al Laits] berkata, telah menceritakan kepada kami [Abdul Warits bin Sa'id] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam masuk ke dalam masjid dan melihat seutas tali yang terbentang antara dua tiang, beliau bersabda: \"Ini tali apa?\" para sahabat, \"Ini tali milik Zainab yang ia gunakan untuk sholat, jika lelah ia mengikatkan talinya pada tiang tersebut. \" Maka beliau pun bersabda: \"Lepaskanlah, lepaskanlah, hendaklah kalian sholat ketika dalam kondisi kuat, jika lelah hendaklah duduk. \""
            },
            {
                "number": 1329,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ أَبِي بَكْرِ بْنِ يَحْيَى بْنِ النَّضْرِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَامَ أَحَدُكُمْ مِنْ اللَّيْلِ فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ فَلَمْ يَدْرِ مَا يَقُولُ اضْطَجَعَ",
                "id": "Telah menceritakan kepada kami [Ya`qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Hatim bin Isma'il] dari [Abu Bakr bin Yahya bin An Nadlr] dari [Bapaknya] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian sholat malam dan terasa berat lisannya dalam melantunkan ayat Al Qur`an hingga tidak tahu apa yang ia ucapkan, hendaklah ia tidur. \""
            },
            {
                "number": 1330,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَعْقُوبُ بْنُ الْوَلِيدِ الْمَدَنِيُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ عِشْرِينَ رَكْعَةً بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Ya'qub bin Al Walid Al Madani] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa sholat antara maghrib dan isya sebanyak dua puluh raka'at, maka Allah akan membangunkan baginya rumah di surga. \""
            },
            {
                "number": 1331,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَأَبُو عُمَرَ حَفْصُ بْنُ عُمَرَ قَالَا حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنِي عُمَرُ بْنُ أَبِي خَثْعَمٍ الْيَمَامِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى سِتَّ رَكَعَاتٍ بَعْدَ الْمَغْرِبِ لَمْ يَتَكَلَّمْ بَيْنَهُنَّ بِسُوءٍ عُدِلَتْ لَهُ عِبَادَةَ اثْنَتَيْ عَشْرَةَ سَنَةً",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Abu Umar Hafsh bin Umar] keduanya berkata; telah menceritakan kepada kami [Zaid Ibnul Hubab] berkata, telah menceritakan kepadaku [Umar bin Abu Khats'am Al Yamami] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa sholat enam raka'at setelah maghrib, tidak mengucapkan ucapan-ucapan buruk antara raka'at tersebut, maka akan dituliskan baginya pahala sholat dua belas raka'at. \""
            },
            {
                "number": 1332,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ طَارِقٍ عَنْ عَاصِمِ بْنِ عَمْرٍو قَالَخَرَجَ نَفَرٌ مِنْ أَهْلِ الْعِرَاقِ إِلَى عُمَرَ فَلَمَّا قَدِمُوا عَلَيْهِ قَالَ لَهُمْ مِمَّنْ أَنْتُمْ قَالُوا مِنْ أَهْلِ الْعِرَاقِ قَالَ فَبِإِذْنٍ جِئْتُمْ قَالُوا نَعَمْ قَالَ فَسَأَلُوهُ عَنْ صَلَاةِ الرَّجُلِ فِي بَيْتِهِ فَقَالَ عُمَرُ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَمَّا صَلَاةُ الرَّجُلِ فِي بَيْتِهِ فَنُورٌ فَنَوِّرُوا بُيُوتَكُمْحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْحُسَيْنِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ عَمْرٍو عَنْ عُمَيْرٍ مَوْلَى عُمَرَ بْنِ الْخَطَّابِ عَنْ عُمَرَ بْنِ الْخَطَّابِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Thariq] dari [Ashim bin Amru] berkata, \"Sekelompok orang dari Irak mendatangi Umar, ketika mereka telah sampai di hadapannya, Umar berkata, \"Dari mana kamu?\" mereka menjawab, \"Dari penduduk Irak. \" Umar bertanya, \"Apakah kalian datang dengan izin?\" mereka menjawab, \"Ya. \" Ashim berkata, \"Lalu mereka bertanya kepada Umar tentang sholatnya seorang laki-laki yang dilakukan di dalam rumah, [Umar] pun menjawab, \"Aku pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Adapun sholatnya seorang laki-laki di dalam rumah adalah cahaya, maka terangilah rumah kalian dengan cahaya. \" Telah menceritakan kepada kami [Muhammad bin Abu Al Husain] berkata, telah menceritakan kepada kami [Abdullah bin Ja'far] berkata; telah menceritakan kepada kami [Abdullah bin Amru] dari [Zaid bin Abu Unaisah] dari [Abu Ishaq] dari [Ashim bin Amru] dari [Umair] -mantan budak Umar Ibnul Khaththab- dari [Umar Ibnul Khaththab] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. \""
            },
            {
                "number": 1333,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَضَى أَحَدُكُمْ صَلَاتَهُ فَلْيَجْعَلْ لِبَيْتِهِ مِنْهَا نَصِيبًا فَإِنَّ اللَّهَ جَاعِلٌ فِي بَيْتِهِ مِنْ صَلَاتِهِ خَيْرًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Muhammad bin Yahya] keduanya berkata; telah menceritakan kepada kami ['Abdurrahman bin mahdi] berkata, telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir bin Abdullah] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang dari kalian selesai dari sholatnya, hendaklah memberikan bagian dari sholatnya bagi rumahnya, sebab Allah menjadikan kebaikan bagi rumahnya dengan sholatnya tersebut. \""
            },
            {
                "number": 1334,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ وَعَبْدُ الرَّحْمَنِ بْنُ عُمَرَ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَتَّخِذُوا بُيُوتَكُمْ قُبُورًا",
                "id": "Telah menceritakan kepada kami [Zaid bin Akhzam] dan ['Abdurrahman bin Umar] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian jadikan rumah kalian sebagai kuburan. \""
            },
            {
                "number": 1335,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ حَرَامِ بْنِ مُعَاوِيَةَ عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ سَعْدٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا أَفْضَلُ الصَّلَاةُ فِي بَيْتِي أَوْ الصَّلَاةُ فِي الْمَسْجِدِ قَالَ أَلَا تَرَى إِلَى بَيْتِي مَا أَقْرَبَهُ مِنْ الْمَسْجِدِ فَلَأَنْ أُصَلِّيَ فِي بَيْتِي أَحَبُّ إِلَيَّ مِنْ أَنْ أُصَلِّيَ فِي الْمَسْجِدِ إِلَّا أَنْ تَكُونَ صَلَاةً مَكْتُوبَةً",
                "id": "Telah menceritakan kepada kami [Abu Bisyr Bakr bin Khalaf] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Mu'awiyah bin Shalih] dari [Al 'Ala Ibnul Harits] dari [Haram bin Mu'awiyah] dari pamannya [Abdullah bin Sa'd] ia berkata, \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam; lebih utama mana sholat di rumahku atau sholat di masjid?\" beliau bersabda: \"Tidakkah engkau lihat betapa dekatnya rumahku dengan masjid? Sungguh, sekiranya aku sholat di rumahku, maka itu lebih aku sukai daripada sholat di masjid, kecuali sholat wajib. \""
            },
            {
                "number": 1336,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ قَالَسَأَلْتُ فِي زَمَنِ عُثْمَانَ بْنِ عَفَّانَ وَالنَّاسُ مُتَوَافِرُونَ أَوْ مُتَوَافُونَ عَنْ صَلَاةِ الضُّحَى فَلَمْ أَجِدْ أَحَدًا يُخْبِرُنِي أَنَّهُ صَلَّاهَا يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ أُمِّ هَانِئٍ فَأَخْبَرَتْنِي أَنَّهُ صَلَّاهَا ثَمَانَ رَكَعَاتٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Yazid bin Abu Ziyad] dari [Abdullah Ibnul Harits] ia berkata, \"Pada masa pemerintahan Utsman bin Affan aku bertanya, banyak orang-orang yang meninggalkan sholat dluha hingga aku tidak mendapatkan seseorang yang memberitahuku bahwasanya ia -yakni Nabi shallallahu 'alaihi wasallam- melaksanakannya (sholat dluha) selain [Ummu Hani`]. Ia mengabarkan kepadaku bahwa Nabi shallallahu 'alaihi wasallam melaksanakannya dengan mengerjakan delapan raka'at. \""
            },
            {
                "number": 1337,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ مُوسَى بْنِ أَنَسٍ عَنْ ثُمَامَةَ بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَلَّى الضُّحَى ثِنْتَيْ عَشْرَةَ رَكْعَةً بَنَى اللَّهُ لَهُ قَصْرًا مِنْ ذَهَبٍ فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] dan [Abu Kuraib] keduanya berkata; telah menceritakan kepada kami [Yunus bin Bukair] berkata, telah menceritakan kepada kami [Muhamad bin Ishaq] dari [Musa bin Anas] dari [Tsumamah bin Anas] dari [Anas bin Malik] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa sholat dluha dua belas raka'at, maka Allah akan membangunkan baginya sebuah istana dari emas. \" "
            },
            {
                "number": 1338,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ الرِّشْكِ عَنْ مُعَاذَةَ الْعَدَوِيَّةِ قَالَتْ سَأَلْتُ عَائِشَةَأَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى قَالَتْ نَعَمْ أَرْبَعًا وَيَزِيدُ مَا شَاءَ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syababah] berkata, telah menceritakan kepada kami [Syu'bah] dari [Yazid Ar Risk] dari [Mu'adzah Al 'Adawiyah] ia berkata, \"Aku bertanya kepada ['Aisyah]; \"Apakah Nabi shallallahu 'alaihi wasallam melaksanakan sholat dluha? ia menjawab: \"Ya, empat raka'at. Beliau menambahnya atas sekehendak Allah. \""
            },
            {
                "number": 1339,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ النَّهَّاسِ بْنِ قَهْمٍ عَنْ شَدَّادٍ أَبِي عَمَّارٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَافَظَ عَلَى شُفْعَةِ الضُّحَى غُفِرَتْ لَهُ ذُنُوبُهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [An Nuhas bin Qahm] dari [Syaddad bin Abu Ammar] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjaga dua raka'at dluha maka dosa-dosa yang telah lalu akan diampuni meskipun sebanyak buih di laut. \""
            },
            {
                "number": 1340,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ السُّلَمِيُّ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا الِاسْتِخَارَةَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنْ الْقُرْآنِ يَقُولُ إِذَا هَمَّ أَحَدُكُمْ بِالْأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ ثُمَّ لِيَقُلْ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ وَتَعْلَمُ وَلَا أَعْلَمُ وَأَنْتَ عَلَّامُ الْغُيُوبِ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ هَذَا الْأَمْرَ فَيُسَمِّيهِ مَا كَانَ مِنْ شَيْءٍ خَيْرًا لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ خَيْرًا لِي فِي عَاجِلِ أَمْرِي وَآجِلِهِ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي وَبَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ يَقُولُ مِثْلَ مَا قَالَ فِي الْمَرَّةِ الْأُولَى وَإِنْ كَانَ شَرًّا لِي فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِي الْخَيْرَ حَيْثُمَا كَانَ ثُمَّ رَضِّنِي بِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yusuf As Sulami] berkata, telah menceritakan kepada kami [Khalid bin Makhlad] berkata, telah menceritakan kepada kami ['Abdurrahman bin Abu Al Mawali] berkata; aku mendengar [Muhammad Ibnul Munkadir] menceritakan dari [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengajari kami do`a istikharah sebagaimana beliau mengajari kami surat Al Qur`an. Beliau bersabda: \"Jika salah seorang dari kalian menginginkan sesuatu hendaklah sholat sunnah dua raka'at, setelah itu ucapkanlah; \"ALLAHUMMA INNI ASTAKHIIRUKA BI 'ILMIKA WA ASTAQDIRUKA BI QURATIKA WA AS`ALUKA MIN FADLIKAL 'AZHIIM FA INNAKA TAQDIRU WA LAA AQDIRU WA TA'LAMU WA LAA A'LAMU WA ANTA ALLAAMUL GHUYUUB ALLAHUMMA IN KUNTA TA'LAMU HADZAL AMRA KHAIRAN LI FII DIINI WA MA'AASYII WA 'AAQIBATI AMRII AU KHAIRAN LII FII 'AAJILI AMRII WA AAJILIHI FAQDURHULII WA YASSIRHULII WA BAARIKLII FIIHI WA IN KUNTA TA'LAMU SYARRAN LII FASHRIFHU 'ANNII WASHRIFNII 'ANHU WAQDURHULIL KHAIRA HAISTUMAA KAANA TSUMMA RADLDLINII BIHI (Ya Allah, sesungguhnya aku meminta pilihan yang tepat kepada-Mu dengan ilmu pengetahuan-Mu dan aku memohon kekuasaan-Mu (untuk mengatasi persoalanku) dengan kemahakuasaan-Mu. Aku mohon kepada-Mu sesuatu dari anugerah-Mu Yang Maha Agung, sesungguhnya Engkau Maha Agung, sesungguhnya Engkau Maha kuasa, sedang aku tidak kuasa, Engkau mengetahui sedang aku tidak mengetahui, dan Engkau adalah Maha Mengetahui hal yang ghaib. Ya Allah, apabila Engkau mengetahui bahwa urusan ini -menyebutkan apa yang menjadi persoalannya- lebih baik dalam agama dan kehidupanku, dan akibat terhadap diriku, atau beliau mengatakan: \"baik bagiku di dunia dan di akhirat, maka takdirkanlah untukku, mudahkan, dan berkahilah. Akan tetapi jika Engkau tahu bahwa perkara ini -ia menyebutkan kembali persoalan yang ia sebutkan di muka- berakibat buruk bagiku, maka singkirkanlah persoalan tersebut dan jauhkan aku darinya. Takdirkanlah untukku di mana pun kebaikan itu berada, kemudian ridlailah aku dengannya. \""
            },
            {
                "number": 1341,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَاصِمٍ الْعَبَّادَانِيُّ عَنْ فَائِدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى الْأَسْلَمِيِّ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ كَانَتْ لَهُ حَاجَةٌ إِلَى اللَّهِ أَوْ إِلَى أَحَدٍ مِنْ خَلْقِهِ فَلْيَتَوَضَّأْ وَلْيُصَلِّ رَكْعَتَيْنِ ثُمَّ لِيَقُلْ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ أَسْأَلُكَ أَلَّا تَدَعَ لِي ذَنْبًا إِلَّا غَفَرْتَهُ وَلَا هَمًّا إِلَّا فَرَّجْتَهُ وَلَا حَاجَةً هِيَ لَكَ رِضًا إِلَّا قَضَيْتَهَا لِي ثُمَّ يَسْأَلُ اللَّهَ مِنْ أَمْرِ الدُّنْيَا وَالْآخِرَةِ مَا شَاءَ فَإِنَّهُ يُقَدَّرُ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Abu 'Ashim Al 'Abbadani] dari [Fa`id bin 'Abdurrahman] dari [Abdullah bin Abu Aufa Al Aslami] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar mengunjungi kami seraya bersabda: \"Barangsiapa memiliki hajat kepada Allah, atau kepada salah seorang dari makhluk-Nya, maka hendaklah ia berwudlu dan sholat dua raka'at, kemudian berdo'a \"LAA ILAAHA ILLA ALLAHU AL HALIIMUL KARIIMU SUBHAANAALLAHU RABBAL 'ARSYIL AZHIIMI AL HAMDULILLAHI RABBIL 'AALAMIIN ALLAHUMMA INNI AS`ALUKA MUUJIBAATI RAHMATIKA WA 'AZAA`IMI MAGHFIRATIKA WA GHANIIMATI MIN KULLI BIRRIN WAS SALAAMATA MIN KULLI ITSMIN AS`ALUKA ALLA TADA'A LII ILLA GHAFARTA WA LAA HAMMAN ILLA FARRAJTA WA LAA HAAJATAN HIYA LAKA RIDLAN ILLA QADLAITA LII (Tidak ada Tuhan yang berhak diibadahi kecuali Allah Yang Maha Lembut dan Maha Pemberi. Maha Suci Allah, pemilik 'Arsy yang agung, segala puji bagi Allah Rabb semesta alam. Ya Allah, sesungguhnya aku memohon kepada-Mu sesuatu yang mewajibkan datangnya rahmat-Mu dan hal-hal yang menguatkan datangnya ampunan-Mu, mendapatkan semua kebaikan, bersih dari segala dosa. Aku memohon kepada-Mu agar tidak meninggalkan dosa bagiku kecuali Engkau ampuni, dan kesedihan kecuali Engkau hapuskan, dan hajat yang Engkau ridlai kecuali engkau penuhi). \" Kemudian ia memohon kepada Allah dari urusan dunia dan akhirat apa yang dia inginkan. Sesungguhnya setiap orang telah ditentukan. \""
            },
            {
                "number": 1342,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنْصُورِ بْنِ سَيَّارٍ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي جَعْفَرٍ الْمَدَنِيِّ عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ عُثْمَانَ بْنِ حُنَيْفٍأَنَّ رَجُلًا ضَرِيرَ الْبَصَرِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ادْعُ اللَّهَ لِي أَنْ يُعَافِيَنِي فَقَالَ إِنْ شِئْتَ أَخَّرْتُ لَكَ وَهُوَ خَيْرٌ وَإِنْ شِئْتَ دَعَوْتُ فَقَالَ ادْعُهْ فَأَمَرَهُ أَنْ يَتَوَضَّأَ فَيُحْسِنَ وُضُوءَهُ وَيُصَلِّيَ رَكْعَتَيْنِ وَيَدْعُوَ بِهَذَا الدُّعَاءِ اللَّهُمَّ إِنِّي أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِمُحَمَّدٍ نَبِيِّ الرَّحْمَةِ يَا مُحَمَّدُ إِنِّي قَدْ تَوَجَّهْتُ بِكَ إِلَى رَبِّي فِي حَاجَتِي هَذِهِ لِتُقْضَى اللَّهُمَّ شَفِّعْهُ فِيَّقَالَ أَبُو إِسْحَقَ هَذَا حَدِيثٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Manshur bin Sayyar] berkata, telah menceritakan kepada kami [Utsman bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Ja'far Al Madani] dari ['Umarah bin Khuzaimah bin Tsabit] dari [Utsman bin Hunaif] berkata, \"Seorang lelaki buta datang kepada Nabi shallallahu 'alaihi wasallam seraya berkata, \"Do'akanlah aku agar Allah menyembuhkanku. \" Beliau bersabda: \"Jika kamu mau maka aku tangguhkan bagimu dan itu lebih baik, dan jika kamu mau maka aku akan do'akan kamu, \" ia berkata, \"Do'akanlah. \" Maka beliau menyuruhnya agar berwudlu dan membaguskan wudlunya, kemudian sholat dua raka'at dan berdo'a, \"Ya Allah, sesungguhnya aku meminta dan menghadap kepada-Mu dengan perantaraan Muhammad, Nabi pembawa rahmat. Ya Muhammad, aku telah menghadap dengan perantaraanmu kepada Rabbku di dalam hajatku ini agar terpenuhi. Ya Allah, berilah syafa'at kepadanya bagi diriku. \" Abu Ishaq berkata, \"Ini hadits shahih. \""
            },
            {
                "number": 1343,
                "arab": "حَدَّثَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ أَبُو عِيسَى الْمَسْرُوقِيُّ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ مَوْلَى أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِي رَافِعٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْعَبَّاسِ يَا عَمِّ أَلَا أَحْبُوكَ أَلَا أَنْفَعُكَ أَلَا أَصِلُكَ قَالَ بَلَى يَا رَسُولَ اللَّهِ قَالَ فَصَلِّ أَرْبَعَ رَكَعَاتٍ تَقْرَأُ فِي كُلِّ رَكْعَةٍ بِفَاتِحَةِ الْكِتَابِ وَسُورَةٍ فَإِذَا انْقَضَتْ الْقِرَاءَةُ فَقُلْ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ خَمْسَ عَشْرَةَ مَرَّةً قَبْلَ أَنْ تَرْكَعَ ثُمَّ ارْكَعْ فَقُلْهَا عَشْرًا ثُمَّ ارْفَعْ رَأْسَكَ فَقُلْهَا عَشْرًا ثُمَّ اسْجُدْ فَقُلْهَا عَشْرًا ثُمَّ ارْفَعْ رَأْسَك فَقُلْهَا عَشْرًا ثُمَّ اسْجُدْ فَقُلْهَا عَشْرًا ثُمَّ ارْفَعْ رَأْسَكَ فَقُلْهَا عَشْرًا قَبْلَ أَنْ تَقُومَ فَتِلْكَ خَمْسٌ وَسَبْعُونَ فِي كُلِّ رَكْعَةٍ وَهِيَ ثَلَاثُ مِائَةٍ فِي أَرْبَعِ رَكَعَاتٍ فَلَوْ كَانَتْ ذُنُوبُكَ مِثْلَ رَمْلِ عَالِجٍ غَفَرَهَا اللَّهُ لَكَ قَالَ يَا رَسُولَ اللَّهِ وَمَنْ لَمْ يَسْتَطِعْ يَقُولُهَا فِي يَوْمٍ قَالَ قُلْهَا فِي جُمُعَةٍ فَإِنْ لَمْ تَسْتَطِعْ فَقُلْهَا فِي شَهْرٍ حَتَّى قَالَ فَقُلْهَا فِي سَنَةٍ",
                "id": "Telah menceritakan kepada kami [Musa bin 'Abdurrahman Abu Isa Al Masruqi] berkata, telah menceritakan kepada kami [Zaid Al Hubab] berkata, telah menceritakan kepada kami [Musa bin Ubaidah] berkata, telah menceritakan kepadaku [Sa'id bin Abu Sa'id] -mantan budak Abu Bakr bin Amru bin Hazm- dari [Abu Rafi'] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abbas: \"Wahai paman, maukah jika aku memberimu hadiah, maukah jika aku memberikan manfaat kepadamu, maukah jika aku menyambung silaturahmi kepadamu?\" ia menjawab, \"Tentu, ya Rasulullah. \" Beliau bersabda: \"sholatlah empat raka'at, di setiap raka'at engkau membaca Fatihatul kitab (surat Al Fatihah) dan satu surat. Apabila selesai membaca, maka ucapkanlah; \"SUBHAANALLAHU WAL HAMDULILLAH WA LAA ILAAHA ILLA ALLAHU WALLAHU AKBAR (Maha Suci Allah dan Segala Puji bagi Allah, tidak ada Tuhan Yang berhak disembah kecuali Allah, Allah Maha Besar) sebanyak lima belas kali sebelum rukuk. Kemudian rukuk dan ucapkanlah bacaan itu lagi sepuluh kali. Kemudian angkatlah kepalamu dan ucapkanlah lagi sepuluh kali, kemudian sujud dan ucapkanlah lagi sepuluh kali, kemudian angkatlah kepalamu dan ucapkanlah lagi sepuluh kali, kemudian sujud dan ucapkanlah lagi sepuluh kali, kemudian angkatlah kepalamu dan ucapkanlah lagi sepuluh kali sebelum engkau bangun. Semua itu genap berjumlah tujuh puluh lima dalam setiap raka'at, dan berjumlah tiga ratus dalam empat raka'at. Sekiranya dosa-dosamu seperti pasir yang menggunung, Allah akan mengampuninya. \" Abbas berkata, \"Wahai Rasulullah, bagaimana dengan orang yang tidak mampu mengucapkan itu dalam sehari?\" Beliau bersabda: \"Lakukanlah sekali dalam seminggu, jika tidak mampu maka lakukanlah sekali dalam sebulan, \" hingga beliau bersabda: \"Maka Lakukanlah sekali dalam setahun. \" "
            },
            {
                "number": 1344,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ النَّيْسَابُورِيُّ حَدَّثَنَا مُوسَى بْنُ عَبْدِ الْعَزِيزِ حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ يَا عَبَّاسُ يَا عَمَّاهُ أَلَا أُعْطِيكَ أَلَا أَمْنَحُكَ أَلَا أَحْبُوكَ أَلَا أَفْعَلُ لَكَ عَشْرَ خِصَالٍ إِذَا أَنْتَ فَعَلْتَ ذَلِكَ غَفَرَ اللَّهُ لَكَ ذَنْبَكَ أَوَّلَهُ وَآخِرَهُ وَقَدِيمَهُ وَحَدِيثَهُ وَخَطَأَهُ وَعَمْدَهُ وَصَغِيرَهُ وَكَبِيرَهُ وَسِرَّهُ وَعَلَانِيَتَهُ عَشْرُ خِصَالٍ أَنْ تُصَلِّيَ أَرْبَعَ رَكَعَاتٍ تَقْرَأُ فِي كُلِّ رَكْعَةٍ بِفَاتِحَةِ الْكِتَابِ وَسُورَةٍ فَإِذَا فَرَغْتَ مِنْ الْقِرَاءَةِ فِي أَوَّلِ رَكْعَةٍ قُلْتَ وَأَنْتَ قَائِمٌ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ خَمْسَ عَشْرَةَ مَرَّةً ثُمَّ تَرْكَعُ فَتَقُولُ وَأَنْتَ رَاكِعٌ عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ مِنْ الرُّكُوعِ فَتَقُولُهَا عَشْرًا ثُمَّ تَهْوِي سَاجِدًا فَتَقُولُهَا وَأَنْتَ سَاجِدٌ عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ مِنْ السُّجُودِ فَتَقُولُهَا عَشْرًا ثُمَّ تَسْجُدُ فَتَقُولُهَا عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ مِنْ السُّجُودِ فَتَقُولُهَا عَشْرًا فَذَلِكَ خَمْسَةٌ وَسَبْعُونَ فِي كُلِّ رَكْعَةٍ تَفْعَلُ فِي أَرْبَعِ رَكَعَاتٍ إِنْ اسْتَطَعْتَ أَنْ تُصَلِّيَهَا فِي كُلِّ يَوْمٍ مَرَّةً فَافْعَلْ فَإِنْ لَمْ تَسْتَطِعْ فَفِي كُلِّ جُمُعَةٍ مَرَّةً فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ شَهْرٍ مَرَّةً فَإِنْ لَمْ تَفْعَلْ فَفِي عُمُرِكَ مَرَّةً",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Bisyr bin Al Hakam] berkata, telah menceritakan kepada kami [Musa bin Abdul Aziz] berkata, telah menceritakan kepada kami [Al Hakam bin Aban] berkata, telah menceritakan kepada kami [Ikrimah] dari [Ibnu Abbas] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abbas bin Abdul Muththalib: \"Wahai Abbas, wahai paman, maukah jika aku menganugerahimu, maukah jika aku memberimu hadiah dan maukah jika aku berbuat untukmu sepuluh perbuatan terpuji? Jika kamu melakukannya, Allah akan mengampuni dosa-dosamu baik yang pertama atau yang terakhir, yang telah lalu atau yang baru, yang salah atau yang sengaja, yang kecil atau yang besar, yang tersembunyi atau yang nampak. Sepuluh hal itu adalah; engkau laksanakan sholat empat raka'at, pada setiap raka'atnya engkau baca Fatihatul kitab (surat al Fatihah) dan satu surat. Jika engkau selesai dari membaca di raka'at pertama, maka ucapkan dalam keadaan berdiri; \"SUBHAANALLAHU WAL HAMDULILLAH WA LAA ILAAHA ILLA ALLAHU WALLAHU AKBAR (Maha Suci Allah dan Segala Puji bagi Allah, tidak ada Tuhan Yang berhak disembah kecuali Allah, Allah Maha Besar) sebanyak lima belas kali. Kemudian engkau rukuk dan engkau baca sepuluh kali dalam kondisi seperti itu, lalu angkat kepalamu dari rukuk dan engkau ucapkan sebanyak sepuluh kali, kemudian engkau sujud dan engkau ucapkan sebanyak sepuluh kali ketika sujud. Kemudian engkau angkat kepalamu dari sujud dan engkau ucapkan sebanyak sepuluh kali. Kemudian engkau sujud dan engkau ucapkan sepuluh kali. Kemudian engkau angkat kepalamu dari sujud dan engkau ucapkan sepuluh kali. Maka semua itu berjumlah tujuh puluh lima dalam satu raka'at, dan lakukanlah hal itu di empat raka'at, jika engkau mampu melakukan sholat seperti itu sekali dalam setiap harinya maka lakukanlah. Jika tidak mampu maka lakukanlah sekali dalam tiap jum'atnya. Jika tidak mampu melakukannya maka lakukanlah sebulan sekali, jika tidak mampu melakukannya maka lakukanlah sekali seumur hidup. \""
            },
            {
                "number": 1345,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا ابْنُ أَبِي سَبْرَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ عَنْ مُعَاوِيَةَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَتْ لَيْلَةُ النِّصْفِ مِنْ شَعْبَانَ فَقُومُوا لَيْلَهَا وَصُومُوا نَهَارَهَا فَإِنَّ اللَّهَ يَنْزِلُ فِيهَا لِغُرُوبِ الشَّمْسِ إِلَى سَمَاءِ الدُّنْيَا فَيَقُولُ أَلَا مِنْ مُسْتَغْفِرٍ لِي فَأَغْفِرَ لَهُ أَلَا مُسْتَرْزِقٌ فَأَرْزُقَهُ أَلَا مُبْتَلًى فَأُعَافِيَهُ أَلَا كَذَا أَلَا كَذَا حَتَّى يَطْلُعَ الْفَجْرُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ibnu Abu Sabrah] dari [Ibrahim bin Muhammad] dari [Mu'awiyah bin Abdullah bin Ja'far] dari [Bapaknya] dari [Ali bin Abu Thalib] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila malam nisfu Sya'ban (pertengahan bulan Sya'ban), maka sholatlah di malam harinya dan berpuasalah di siang harinya. Sesungguhnya Allah turun ke langit bumi pada saat itu ketika matahari terbenam, kemudian Dia berfirman: \"Adakah orang yang meminta ampun kepada-Ku, maka Aku akan mengampuninya? Adakah orang yang meminta rizki maka Aku akan memberinya rizki? Adakah orang yang mendapat cobaan maka Aku akan menyembuhkannya? Adakah yang begini, dan adakah yang begini…hingga terbit fajar. \""
            },
            {
                "number": 1346,
                "arab": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ أَبُو بَكْرٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا حَجَّاجٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْفَقَدْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَخَرَجْتُ أَطْلُبُهُ فَإِذَا هُوَ بِالْبَقِيعِ رَافِعٌ رَأْسَهُ إِلَى السَّمَاءِ فَقَالَ يَا عَائِشَةُ أَكُنْتِ تَخَافِينَ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ قَالَتْ قَدْ قُلْتُ وَمَا بِي ذَلِكَ وَلَكِنِّي ظَنَنْتُ أَنَّكَ أَتَيْتَ بَعْضَ نِسَائِكَ فَقَالَ إِنَّ اللَّهَ تَعَالَى يَنْزِلُ لَيْلَةَ النِّصْفِ مِنْ شَعْبَانَ إِلَى السَّمَاءِ الدُّنْيَا فَيَغْفِرُ لِأَكْثَرَ مِنْ عَدَدِ شَعَرِ غَنَمِ كَلْبٍ",
                "id": "Telah menceritakan kepada kami [Abdah bin Abdullah Al Khuza'i] dan [Muhammad bin Abdul Malik Abu Bakr] keduanya berkata; telah menceritakan kepada kami [Yazin bin Harun] berkata, telah memberitakan kepada kami [Hajjaj] dari [Yahya bin Abu Katsir] dari [Urwah] dari ['Aisyah] ia berkata, \"Suatu malam aku kehilangan Nabi shallallahu 'alaihi wasallam, aku pun mencarinya, dan ternyata beliau berada di Baqi' menengadahkan kepalanya ke langit, beliau lalu bersabda: \"Wahai 'Aisyah, apakah engkau takut Allah dan Rasul-Nya akan mengurangi (haknya) atasmu?\" ia menjawab, \"Aku telah mengatakan tidak, hanya saja aku khawatir engkau mendatangi salah seorang dari isterimu. \" Maka beliau pun bersabda: \"Sesungguhnya pada pertengahan malam Sya'ban Allah turun ke langit dunia lalu mengampuni orang-orang yang jumlahnya lebih banyak dari jumlah bulu kambing. \""
            },
            {
                "number": 1347,
                "arab": "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدِ بْنِ رَاشِدٍ الرَّمْلِيُّ حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ لَهِيعَةَ عَنْ الضَّحَّاكِ بْنِ أَيْمَنَ عَنْ الضَّحَّاكِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَرْزَبٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ لَيَطَّلِعُ فِي لَيْلَةِ النِّصْفِ مِنْ شَعْبَانَ فَيَغْفِرُ لِجَمِيعِ خَلْقِهِ إِلَّا لِمُشْرِكٍ أَوْ مُشَاحِنٍحَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ حَدَّثَنَا أَبُو الْأَسْوَدِ النَّضْرُ بْنُ عَبْدِ الْجَبَّارِ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ الزُّبَيْرِ بْنِ سُلَيْمٍ عَنْ الضَّحَّاكِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبَا مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Rasyid bin Sa'id bin Rasyid Ar Ramli] berkata, telah menceritakan [Al Walid] dari [Ibnu Lahi'ah] dari [Adl Dlahhak bin Aiman] dari [Adl Dlahhak bin 'Abdurrahman bin 'Arzab] dari [Abu Musa Al Asy'ari] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah akan muncul di malam nishfu Sya'ban kemudian mengampuni semua makhluk-Nya kecuali orang musyrik atau orang yang meninggalkan jama'ah (murtad). \" Telah menceritakan kepada kami [Muhammad bin Ishaq] berkata, telah menceritakan kepada kami [Abul Aswad An Nadlr bin Abdul Jabbar] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Az Zubair bin Sualim] dari [Adl Dlahhak bin 'Abdurrahman] dari [Bapaknya] ia berkata; aku mendengar [Abu Musa] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. \""
            },
            {
                "number": 1348,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا سَلَمَةُ بْنُ رَجَاءٍ حَدَّثَتْنِي شَعْثَاءُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَىأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ بُشِّرَ بِرَأْسِ أَبِي جَهْلٍ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Bisyr Bakr bin Khalaf] berkata, telah menceritakan kepada kami [Salamah bin Raja`] berkata, telah menceritakan kepadaku [Sya'tsa`] dari [Abdullah bin Abu Aufa] berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat dua raka'at ketika mendapat kabar gembira terpenggalnya kepala Abu Jahal. \" "
            },
            {
                "number": 1349,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ صَالِحٍ الْمِصْرِيُّ أَنْبَأَنَا أَبِي أَنْبَأَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَمْرِو بْنِ الْوَلِيدِ بْنِ عَبْدَةَ السَّهْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُشِّرَ بِحَاجَةٍ فَخَرَّ سَاجِدًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Utsman bin Shalih Al Mishri] berkata, telah memberitakan kepada kami [Bapakku] berkata, telah memberitakan kepada kami [Ibnu Lahi'ah] dari [Yazid bin Abu Habib] dari [Amru bin Al Walid bin 'Abdah As Sahmi] dari [Anas bin Malik] berkata, \"Nabi shallallahu 'alaihi wasallam diberi kabar gembira dengan satu perkara, beliau pun sujud. \" "
            },
            {
                "number": 1350,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَلَمَّا تَابَ اللَّهُ عَلَيْهِ خَرَّ سَاجِدًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] dari ['Abdurrahman bin Ka'b bin Malik] dari [Bapaknya] ia berkata, \"Ketika Allah menerima taubatnya beliau sujud tersungkur. \""
            },
            {
                "number": 1351,
                "arab": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ وَأَحْمَدُ بْنُ يُوسُفَ السُّلَمِيُّ قَالَا حَدَّثَنَا أَبُو عَاصِمٍ عَنْ بَكَّارِ بْنِ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَتَاهُ أَمْرٌ يَسُرُّهُ أَوْ بُشِّرَ بِهِ خَرَّ سَاجِدًا شُكْرًا لِلَّهِ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami ['Abdah bin Abdullah Al Khuza'i] dan [Ahmad bin Yusuf As Sulami] keduanya berkata; telah menceritakan kepada kami [Abu 'Ashim] dari [Bakkar bin Abdul Aziz bin Abdullah bin Abu Bakrah] dari [Bapaknya] dari [Abu Bakrah] berkata, \"Nabi shallallahu 'alaihi wasallam apabila didatangi oleh urusan yang menyenangkan atau diberi kabar gembira, beliau tersungkur sujud sebagai tanda syukur kepada Allah Tabaraka wa Ta'ala. \""
            },
            {
                "number": 1352,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَنَصْرُ بْنُ عَلِيٍّ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مِسْعَرٌ وَسُفْيَانُ عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ الثَّقَفِيِّ عَنْ عَلِيِّ بْنِ رَبِيعَةَ الْوَالِبِيِّ عَنْ أَسْمَاءَ بْنِ الْحَكَمِ الْفَزَارِيِّ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَكُنْتُ إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا يَنْفَعُنِي اللَّهُ بِمَا شَاءَ مِنْهُ وَإِذَا حَدَّثَنِي عَنْهُ غَيْرُهُ اسْتَحْلَفْتُهُ فَإِذَا حَلَفَ صَدَّقْتُهُ وَإِنَّ أَبَا بَكْرٍ حَدَّثَنِي وَصَدَقَ أَبُو بَكْرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ رَجُلٍ يُذْنِبُ ذَنْبًا فَيَتَوَضَّأُ فَيُحْسِنُ الْوُضُوءَ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَقَالَ مِسْعَرٌ ثُمَّ يُصَلِّي وَيَسْتَغْفِرُ اللَّهَ إِلَّا غَفَرَ اللَّهُ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Nashr bin Ali] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Mis'ar] dan [Sufyan] dari [Utsman Ibnul Mughirah Ats Tsaqafi] dari [Ali bin Rabi'ah Al Walibi] dari [Asma Ibnul Hakam Al Fazari] dari [Ali bin Abu Thalib] ia berkata, \"Jika aku mendengar sebuah hadits dari Rasulullah shallallahu 'alaihi wasallam, Allah selalu memberiku manfaat darinya sesuai dengan kehendak-Nya, jika aku mendengar hadits beliau dari orang lain, maka aku memintanya bersumpah, jika ia telah bersumpah maka aku akan membenarkannya. [Abu Bakar] telah menceritakan kepadaku, dan benarlah Abu Bakar, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang laki-laki melakukan sebuah dosa lalu berwudlu dan membaguskan wudlunya, kemudian sholat dua raka'at, Mis'ar menyebutkan, \"Kemudian sholat dan meminta ampun kepada Allah, kecuali pasti Allah akan mengampuninya. \""
            },
            {
                "number": 1353,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ أَظُنُّهُ عَنْ عَاصِمِ بْنِ سُفْيَانَ الثَّقَفِيِّأَنَّهُمْ غَزَوْا غَزْوَةَ السُّلَاسِلِ فَفَاتَهُمْ الْغَزْوُ فَرَابَطُوا ثُمَّ رَجَعُوا إِلَى مُعَاوِيَةَ وَعِنْدَهُ أَبُو أَيُّوبَ وَعُقْبَةُ بْنُ عَامِرٍ فَقَالَ عَاصِمٌ يَا أَبَا أَيُّوبَ فَاتَنَا الْغَزْوُ الْعَامَ وَقَدْ أُخْبِرْنَا أَنَّهُ مَنْ صَلَّى فِي الْمَسَاجِدِ الْأَرْبَعَةِ غُفِرَ لَهُ ذَنْبُهُ فَقَالَ يَا ابْنَ أَخِي أَدُلُّكَ عَلَى أَيْسَرَ مِنْ ذَلِكَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ كَمَا أُمِرَ وَصَلَّى كَمَا أُمِرَ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ عَمَلٍأَكَذَلِكَ يَا عُقْبَةُ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitahukan kepada kami [Al Laits bin Sa'ad] dari [Abu Zubair] dari [Sufyan bin Abdullah] aku mengira dari ['Ashim bin Sufyan Ats Tsaqafi] bahwasanya mereka pergi dalam peperangan As-Sulasil, hanya saja mereka ketinggalan (tidak ikut perang). Maka mereka pun ribath (berjaga-jaga di perbatasan), kemudian mereka menemui Mu'awiyah sementara di sampingnya ada Abu Ayyub dan 'Uqbah bin Amir. 'Ashim bertanya, \"Wahai Abu Ayyub, tahun ini kami ketinggalan perang, dan telah sampai berita kepada kami bahwasanya barangsiapa sholat di empat masjid maka dosanya akan diampuni! \" [Abu Ayyub] berkata, \"Wahai anak saudaraku, aku akan tunjukkan kepadamu sesuatu yang lebih mudah dari itu, aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berwudlu dan sholat sebagaimana diperintahkan maka dosanya yang telah lalu akan diampuni, \" bukankah seperti itu wahai 'Uqbah? [Uqbah] menjawab, \"Benar. \""
            },
            {
                "number": 1354,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنِي ابْنُ أَخِي ابْنِ شِهَابٍ عَنْ عَمِّهِ حَدَّثَنِي صَالِحُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ أَنَّ عَامِرَ بْنَ سَعْدٍ أَخْبَرَهُ قَالَ سَمِعْتُ أَبَانَ بْنَ عُثْمَانَ يَقُولَ قَالَ عُثْمَانُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَرَأَيْتَ لَوْ كَانَ بِفِنَاءِ أَحَدِكُمْ نَهْرٌ يَجْرِي يَغْتَسِلُ فِيهِ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ مَا كَانَ يَبْقَى مِنْ دَرَنِهِ قَالَ لَا شَيْءَ قَالَ فَإِنَّ الصَّلَاةَ تُذْهِبُ الذُّنُوبَ كَمَا يُذْهِبُ الْمَاءُ الدَّرَنَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abu Ziyad] berkata, telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] berkata, telah menceritakan kepadaku [Ibnu Akhi Ibnu Syihab] dari [Pamannya] berkata, telah menceritakan kepadaku [Shalih bin Abdullah bin Abu Farwah] bahwa [Amir bin Sa'd] mengabarkan kepadanya, ia berkata, \"Aku mendengar [Aban bin Utsman] berkata, \" [Utsman] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana pendapatmu jika di depan rumah salah seorang dari kalian terdapat sungai yang mengalir hingga ia bisa mandi lima kali dalam sehari, apakah masih ada kotoran daki pada tubuhnya?\" ia menjawab, \"Tidak, \" beliau bersabda: \"Sesungguhnya sholat dapat membersihkan dosa sebagaimana air dapat membersihkan kotoran daki. \""
            },
            {
                "number": 1355,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍأَنَّ رَجُلًا أَصَابَ مِنْ امْرَأَةٍ يَعْنِي مَا دُونَ الْفَاحِشَةِ فَلَا أَدْرِي مَا بَلَغَ غَيْرَ أَنَّهُ دُونَ الزِّنَا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ{ أَقِمْ الصَّلَاةَ طَرَفَيْ النَّهَارِ وَزُلَفًا مِنْ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ }فَقَالَ يَا رَسُولَ اللَّهِ أَلِي هَذِهِ قَالَ لِمَنْ أَخَذَ بِهَا",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Sualiman At Taimi] dari [Abu Utsman An Nahdi] dari [Abdullah bin Mas'ud] berkata, \"Seorang laki-laki terkena fitnah wanita, aku tidak tahu apa yang telah ia lakukan, hanya saja ia memang belum sampai zina. Lalu ia mendatangi Nabi shallallahu 'alaihi wasallam dan menyebutkan semua yang telah ia lakukan, maka Allah menurunkan ayat: \" (Dan dirikanlah sembahyang itu pada kedua tepi siang (pagi dan petang) dan pada bahagian permulaan daripada malam. Sesungguhnya perbuatan-perbuatan yang baik itu menghapuskan (dosa) perbuatan-perbuatan yang buruk. Itulah peringatan bagi orang-orang yang ingat). \""
            },
            {
                "number": 1356,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَضَ اللَّهُ عَلَى أُمَّتِي خَمْسِينَ صَلَاةً فَرَجَعْتُ بِذَلِكَ حَتَّى آتِيَ عَلَى مُوسَى فَقَالَ مُوسَى مَاذَا افْتَرَضَ رَبُّكَ عَلَى أُمَّتِكَ قُلْتُ فَرَضَ عَلَيَّ خَمْسِينَ صَلَاةً قَالَ فَارْجِعْ إِلَى رَبِّكَ فَإِنَّ أُمَّتَكَ لَا تُطِيقُ ذَلِكَ فَرَاجَعْتُ رَبِّي فَوَضَعَ عَنِّي شَطْرَهَا فَرَجَعْتُ إِلَى مُوسَى فَأَخْبَرْتُهُ فَقَالَ ارْجِعْ إِلَى رَبِّكَ فَإِنَّ أُمَّتَكَ لَا تُطِيقُ ذَلِكَ فَرَاجَعْتُ رَبِّي فَقَالَ هِيَ خَمْسٌ وَهِيَ خَمْسُونَ لَا يُبَدَّلُ الْقَوْلُ لَدَيَّ فَرَجَعْتُ إِلَى مُوسَى فَقَالَ ارْجِعْ إِلَى رَبِّكَ فَقُلْتُ قَدْ اسْتَحْيَيْتُ مِنْ رَبِّي",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah mewajibkan umatku sholat sebanyak lima puluh kali, maka aku meminta keringan dari hal itu hingga aku mendatangi Musa, ia berkata kepadaku, \"Apa yang telah diwajibkan oleh Rabbmu kepada umatmu?\" aku menjawab, \"Ia telah mewajibkan kepadaku sholat sebanyak lima puluh kali. \" Musa berkata, \"Kembalilah menemui Rabbmu, karena umatmu tidak akan mampu mengerjakan kewajiban itu, \" aku pun kembali menemui Rabbku hingga Ia memberikan keringanan hingga setengahnya. Aku kembali menemui Musa dan aku kabarkan hal itu padanya, ia berkata, \"Kembalilah menemui Rabbmu, karena umatmu tidak akan mampu melakukan kewajiban itu, \" aku pun kembali menemui Rabbku, Ia berfirman: \" (sholat) Lima kali itu akan menyamai (sholat) lima puluh kali, dan tidak ada lagi perubahan di sisi-Ku. \" Maka aku kembali menemui Musa, lalu aku katakan kepadanya: \"Aku sudah malu kepada Rabbku. \""
            },
            {
                "number": 1357,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شَرِيكٌ عَنْ عَبْدِ اللَّهِ بْنِ عُصْمٍ أَبِي عُلْوَانَ عَنْ ابْنِ عَبَّاسٍ قَالَأُمِرَ نَبِيُّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخَمْسِينَ صَلَاةً فَنَازَلَ رَبَّكُمْ أَنْ يَجْعَلَهَا خَمْسَ صَلَوَاتٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Abu Al Walid] berkata, telah menceritakan kepada kami [Syarik] dari [Abdullah bin Ushm Abu Ulwan] dari [Ibnu Abbas] ia berkata, \"Nabi kalian shallallahu 'alaihi wasallam diperintahkan sholat sebanyak lima puluh kali, lalu ia meminta kepada Rabbnya agar menjadikan lima kali. \""
            },
            {
                "number": 1358,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ ابْنِ مُحَيْرِيزٍ عَنْ الْمُخْدِجِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَمْسُ صَلَوَاتٍ افْتَرَضَهُنَّ اللَّهُ عَلَى عِبَادِهِ فَمَنْ جَاءَ بِهِنَّ لَمْ يَنْتَقِصْ مِنْهُنَّ شَيْئًا اسْتِخْفَافًا بِحَقِّهِنَّ فَإِنَّ اللَّهَ جَاعِلٌ لَهُ يَوْمَ الْقِيَامَةِ عَهْدًا أَنْ يُدْخِلَهُ الْجَنَّةَ وَمَنْ جَاءَ بِهِنَّ قَدْ انْتَقَصَ مِنْهُنَّ شَيْئًا اسْتِخْفَافًا بِحَقِّهِنَّ لَمْ يَكُنْ لَهُ عِنْدَ اللَّهِ عَهْدٌ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Ibnu Abu Adi] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abdu Rabbih bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz] dari [Al Mukhdiji] dari [Ubadah bin Ash Shamit] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lima waktu sholat telah Allah wajibkan atas hamba-hamba-Nya, barangsiapa melaksanakannya dengan tidak mengurangi sesuatu darinya sedikitpun karena meremehkan hak-haknya, maka Allah akan membuat satu janji bahwa Ia akan memasukkannya ke dalam surga pada hari kiamat. Dan barangsiapa mengurangi sesuatu darinya karena meremehkan hak-haknya, maka Allah tidak mempunyai janji dengannya, jika mau Allah akan menyiksanya dan jika mau akan mengampuninya. \""
            },
            {
                "number": 1359,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُبَيْنَمَا نَحْنُ جُلُوسٌ فِي الْمَسْجِدِ دَخَلَ رَجُلٌ عَلَى جَمَلٍ فَأَنَاخَهُ فِي الْمَسْجِدِ ثُمَّ عَقَلَهُ ثُمَّ قَالَ لَهُمْ أَيُّكُمْ مُحَمَّدٌ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئٌ بَيْنَ ظَهْرَانَيْهِمْ قَالَ فَقَالُوا هَذَا الرَّجُلُ الْأَبْيَضُ الْمُتَّكِئُ فَقَالَ لَهُ الرَّجُلُ يَا ابْنَ عَبْدِ الْمُطَّلِبِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَجَبْتُكَ فَقَالَ لَهُ الرَّجُلُ يَا مُحَمَّدُ إِنِّي سَائِلُكَ وَمُشَدِّدٌ عَلَيْكَ فِي الْمَسْأَلَةِ فَلَا تَجِدَنَّ عَلَيَّ فِي نَفْسِكَ فَقَالَ سَلْ مَا بَدَا لَكَ قَالَ لَهُ الرَّجُلُ نَشَدْتُكَ بِرَبِّكَ وَرَبِّ مَنْ قَبْلَكَ آللَّهُ أَرْسَلَكَ إِلَى النَّاسِ كُلِّهِمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ نَعَمْ قَالَ فَأَنْشُدُكَ بِاللَّهِ آللَّهُ أَمَرَكَ أَنْ تُصَلِّيَ الصَّلَوَاتِ الْخَمْسَ فِي الْيَوْمِ وَاللَّيْلَةِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ نَعَمْ قَالَ فَأَنْشُدُكَ بِاللَّهِ آللَّهُ أَمَرَكَ أَنْ تَصُومَ هَذَا الشَّهْرَ مِنْ السَّنَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ نَعَمْ قَالَ فَأَنْشُدُكَ بِاللَّهِ آللَّهُ أَمَرَكَ أَنْ تَأْخُذَ هَذِهِ الصَّدَقَةَ مِنْ أَغْنِيَائِنَا فَتَقْسِمَهَا عَلَى فُقَرَائِنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ نَعَمْ فَقَالَ الرَّجُلُ آمَنْتُ بِمَا جِئْتَ بِهِ وَأَنَا رَسُولُ مَنْ وَرَائِي مِنْ قَوْمِي وَأَنَا ضِمَامُ بْنُ ثَعْلَبَةَ أَخُو بَنِي سَعْدِ بْنِ بَكْرٍ",
                "id": "Telah menceritakan kepada kami [Isa bin Hammad Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Sa'id Al Maqburi] dari [Syarik bin Abdullah bin Abu Namir] bahwa ia mendengar [Anas bin Malik] ia berkata, \"Ketika kami sedang duduk-duduk di masjid seorang laki-laki masuk ke dalam masjid dengan mengendarai unta, lalu ia derumkan untanya dan ia ikat dalam masjid. Setelah itu ia berkata kepada orang-orang, \"Manakah dari kalian yang bernama Muhammad! \" padahal Rasulullah shallallahu 'alaihi wasallam sedang duduk bersandar di antara mereka. \" Anas berkata, \"Para sahabat pun menjawab, \"Laki-laki berkulit putih yang duduk bersandar inilah orangnya, \" laki-laki itu lalu berkata kepada beliau, \"Wahai anak Abdul Muthallib! \" Nabi shallallahu 'alaihi wasallam menjawab, \"Aku telah memenuhi panggilanmu, \" laki-laki itu berkata lagi, \"Wahai Muhammad, aku ingin bertanya kepadamu dan keras dalam bertanya kepadamu, maka janganlah engkau marah kepadaku, \" beliau bersabda: \"Tanyakanlah apa yang engkau inginkan?\" laki-laki itu berkata, \"Aku bersumpah atas Tuhanmu dan Tuhan orang-orang sebelummu, apakah Allah mengutusmu untuk seluruh manusia?\" beliau menjawab: \"Ya Allah, itu benar, \" laki-laki itu berkata, \"Aku persaksikan dirimu atas Allah, apakah Allah yang memerintahkan kepadamu kewajiban sholat lima waktu dalam sehari semalam?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ya Allah, itu benar, \" laki-laki itu berkata, \"Aku persaksikan dirimu atas Allah, apakah Allah yang memerintahkan kamu puasa di bulan ini dalam setahunnya?\" beliau menjawab: \"Ya Allah, itu benar, \" laki-laki itu berkata, \"Aku persaksikan dirimu atas Allah, apakah Allah yang memerintahkan kamu mengambil sedekah ini dari orang-orang kaya kami lalu membagikannya kepada orang-orang miskin kami?\" beliau menjawab, \"Ya Allah, itu benar, \" lalu laki-laki itu berkata, \"Aku beriman dengan apa yang engkau bawa, aku adalah utusan dari kaumku, aku Dlimam bin Tsa'labah, saudara bani Sa'd bin Bakr. \""
            },
            {
                "number": 1360,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ حَدَّثَنَا ضُبَارَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي السُّلَيْكِ أَخْبَرَنِي دُوَيْدُ بْنُ نَافِعٍ عَنْ الزُّهْرِيِّ قَالَ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ إِنَّ أَبَا قَتَادَةَ بْنَ رِبْعِيٍّ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ افْتَرَضْتُ عَلَى أُمَّتِكَ خَمْسَ صَلَوَاتٍ وَعَهِدْتُ عِنْدِي عَهْدًا أَنَّهُ مَنْ حَافَظَ عَلَيْهِنَّ لِوَقْتِهِنَّ أَدْخَلْتُهُ الْجَنَّةَ وَمَنْ لَمْ يُحَافِظْ عَلَيْهِنَّ فَلَا عَهْدَ لَهُ عِنْدِي",
                "id": "Telah menceritakan kepada kami [Yahya bin Utsman bin Sa'id bin Katsir bin Dinar Al Himshi] berkata, telah menceritakan kepada kami [Baqiyyah bin Al Walid] [Dlubarah bin Abdullah bin Abu Salik] berkata, telah mengabarkan kepadaku [Duwaid bin Nafi'] dari [Az Zuhri] berkata; [Sa'id bin Musayyab] berkata; [Abu Qatadah bin Rib'i] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Azza Wa Jalla berfirman: \"Aku telah mewajibkan umatmu sholat lima waktu, dan Aku telah menetapkan sebuah perjanjian di sisi-Ku, bahwa barangsiapa menjaganya sesuai waktunya Aku akan memasukkannya ke dalam surga. Dan barangsiapa tidak menjaganya, maka tidak ada perjanjian di sisi-Ku. \""
            },
            {
                "number": 1361,
                "arab": "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدَنِيُّ أَحْمَدُ بْنُ أَبِي بَكْرٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ زَيْدِ بْنِ رَبَاحٍ وَعُبَيْدِ اللَّهِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا الْمَسْجِدَ الْحَرَامَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abu Mush'ab Al Madani Ahmad bin Abu Katsir bin Abu Bakr] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Zaid bin Rabah] dan [ubaidhullah bin Abu Abdullah] dari [Abu Abdullah Al Aghar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat di masjidku ini lebih utama seribu kali dari sholat di tempat lain kecuali masjidil haram. \" Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. \""
            },
            {
                "number": 1362,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ مِنْ الْمَسَاجِدِ إِلَّا الْمَسْجِدَ الْحَرَامَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat di masjidku ini lebih utama seribu kali dari sholat di masjid selainnya kecuali masjidil haram. \""
            },
            {
                "number": 1363,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ أَسَدٍ حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ أَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ عَبْدِ الْكَرِيمِ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةٌ فِي مَسْجِدِي أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا الْمَسْجِدَ الْحَرَامَ وَصَلَاةٌ فِي الْمَسْجِدِ الْحَرَامِ أَفْضَلُ مِنْ مِائَةِ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Asad] berkata, telah menceritakan kepada kami [Zakaria bin Adi] berkata, telah memberitakan kepada kami [ubaidhullah bin Amru] dari [Abdul Karim] dari ['Atho`] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat di masjidku lebih utama seribu kali dari sholat di masjid selainnya, kecuali masjidil haram. Dan sholat di masjidil haram lebih utama seratus ribu kali dari sholat di tempat selainnya. \""
            },
            {
                "number": 1364,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ عَنْ زِيَادِ بْنِ أَبِي سَوْدَةَ عَنْ أَخِيهِ عُثْمَانَ بْنِ أَبِي سَوْدَةَ عَنْ مَيْمُونَةَ مَوْلَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ أَفْتِنَا فِي بَيْتِ الْمَقْدِسِ قَالَ أَرْضُ الْمَحْشَرِ وَالْمَنْشَرِ ائْتُوهُ فَصَلُّوا فِيهِ فَإِنَّ صَلَاةً فِيهِ كَأَلْفِ صَلَاةٍ فِي غَيْرِهِ قُلْتُ أَرَأَيْتَ إِنْ لَمْ أَسْتَطِعْ أَنْ أَتَحَمَّلَ إِلَيْهِ قَالَ فَتُهْدِي لَهُ زَيْتًا يُسْرَجُ فِيهِ فَمَنْ فَعَلَ ذَلِكَ فَهُوَ كَمَنْ أَتَاهُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Abdullah Ar Raqqi] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami [Tsaur bin Yazid] dari [Ziyad bin Abu Saudah] dari saudaranya [Utsman bin Abu Saudah] dari [Maimunah] mantan budak Nabi shallallahu 'alaihi wasallam, ia berkata, \"Wahai Rasulullah, berilah kami fatwa berkenaan dengan Baitul Maqdis, \" beliau bersabda: \"Ia adalah bumi Al Muntasyar dan Al Muntasyar (tempat dikumpulkannya manusia pada hari kiamat), datangi dan sholatlah kalian di sana, sebab sholat di dalamnya seperti sholat seribu kali di tempat lainnya. \" Aku bertanya, \"Bagaimana pendapat tuan jika saya tidak bisa ke sana?\" beliau menjawab: \"Memberi minyak yang dengannya lampu bisa dinyalakan di dalamnya, barangsiapa melakukan itu, maka ia seperti telah mendatanginya. \""
            },
            {
                "number": 1365,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْجَهْمِ الْأَنْمَاطِيُّ حَدَّثَنَا أَيُّوبُ بْنُ سُوَيْدٍ عَنْ أَبِي زُرْعَةَ السَّيْبَانِيِّ يَحْيَى بْنِ أَبِي عَمْرٍو حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الدَّيْلَمِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمَّا فَرَغَ سُلَيْمَانُ بْنُ دَاوُدَ مِنْ بِنَاءِ بَيْتِ الْمَقْدِسِ سَأَلَ اللَّهَ ثَلَاثًا حُكْمًا يُصَادِفُ حُكْمَهُ وَمُلْكًا لَا يَنْبَغِي لَأَحَدٍ مِنْ بَعْدِهِ وَأَلَّا يَأْتِيَ هَذَا الْمَسْجِدَ أَحَدٌ لَا يُرِيدُ إِلَّا الصَّلَاةَ فِيهِ إِلَّا خَرَجَ مِنْ ذُنُوبِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا اثْنَتَانِ فَقَدْ أُعْطِيَهُمَا وَأَرْجُو أَنْ يَكُونَ قَدْ أُعْطِيَ الثَّالِثَةَ",
                "id": "Telah menceritakan kepada kami [ubaidhullah Ibnul Jahm Al Anmathi] berkata, telah menceritakan kepada kami [Ayyub bin Suwaid] dari [Abu Zur'ah As Saibani Yahya bin Abu Amru] berkata, telah menceritakan kepada kami [Abdullah bin Ad Daili] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Ketika Sulaiman bin Dawud selesai membangun Baitul Maqdis ia meminta Allah tiga hal; hukum yang sesuai dengan hukum-Nya, kerajaan yang tidak dimiliki oleh orang-orang setelahnya, dan tidak ada seorang pun yang mendatangi masjid ini kecuali untuk sholat, melainkan akan keluar semua dosanya sebagaimana bayi yang dilahirkan ibunya. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Dua perkara pertama telah dikabulkan, dan aku berharap yang ketiga juga telah diberikan. \""
            },
            {
                "number": 1366,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ وَمَسْجِدِي هَذَا وَالْمَسْجِدِ الْأَقْصَى",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh bersusah payah melakukan perjalanan kecuali pada masjid; masjidil haram, masjidku ini dan masjidil aqsha. \""
            },
            {
                "number": 1367,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ حَدَّثَنَا يَزِيدُ بْنُ أَبِي مَرْيَمَ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ وَعَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ إِلَى الْمَسْجِدِ الْحَرَامِ وَإِلَى الْمَسْجِدِ الْأَقْصَى وَإِلَى مَسْجِدِي هَذَا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Muhammad bin Syu'aib] berkata, telah menceritakan kepada kami [Yazid bin Abu Maryam] dari [Qaza'ah] dari [Abu Sa'id] dan [Abdullah bin Amr bin Al 'Ash] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh bersusah payah melakukan perjalanan kecuali pada masjid; masjidil haram, masjidil aqsha dan masjidku ini. \""
            },
            {
                "number": 1368,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ حَدَّثَنَا أَبُو الْأَبْرَدِ مَوْلَى بَنِي خَطْمَةَ أَنَّهُ سَمِعَ أُسَيْدَ بْنَ ظُهَيْرٍ الْأَنْصَارِيَّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ صَلَاةٌ فِي مَسْجِدِ قُبَاءَ كَعُمْرَةٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Abdul Hamid bin Ja'far] berkata, telah menceritakan kepada kami [Abul Abrad] mantan budak bani Khathmah, ia mendengar [Usaid bin Zhuhair Al Anshari] -ia termasuk sahabat Nabi shallallahu 'alaihi wasallam- ia menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat di masjid Quba seperti melakukan Umrah. \""
            },
            {
                "number": 1369,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ وَعِيسَى بْنُ يُونُسَ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْكَرْمَانِيُّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ يَقُولَ قَالَ سَهْلُ بْنُ حُنَيْفٍقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَطَهَّرَ فِي بَيْتِهِ ثُمَّ أَتَى مَسْجِدَ قُبَاءَ فَصَلَّى فِيهِ صَلَاةً كَانَ لَهُ كَأَجْرِ عُمْرَةٍ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Hatim bin Isma'il] dan [Isa bin Yunus] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Sulaiman Al Karmani] berkata; aku mendengar [Abu Umamah bin Sahl bin Hunaif] berkata; [Sahl bin Hunaif] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersuci di rumahnya kemudian mendatangi masjid Quba dan sholat di dalamnya, maka ia akan mendapatkan pahala umrah. \""
            },
            {
                "number": 1370,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا أَبُو الْخَطَّابِ الدِّمَشْقِيُّ حَدَّثَنَا رُزَيْقٌ أَبُو عَبْدِ اللَّهِ الْأَلْهَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ الرَّجُلِ فِي بَيْتِهِ بِصَلَاةٍ وَصَلَاتُهُ فِي مَسْجِدِ الْقَبَائِلِ بِخَمْسٍ وَعِشْرِينَ صَلَاةً وَصَلَاتُهُ فِي الْمَسْجِدِ الَّذِي يُجَمَّعُ فِيهِ بِخَمْسِ مِائَةِ صَلَاةٍ وَصَلَاتُهُ فِي الْمَسْجِدِ الْأَقْصَى بِخَمْسِينَ أَلْفِ صَلَاةٍ وَصَلَاتُهُ فِي مَسْجِدِي بِخَمْسِينَ أَلْفِ صَلَاةٍ وَصَلَاةٌ فِي الْمَسْجِدِ الْحَرَامِ بِمِائَةِ أَلْفِ صَلَاةٍ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Abu Khaththab Ad Dimasyqi] berkata, telah menceritakan kepada kami [Ruzaiq Abu Abdullah Al Alhani] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat seorang laki-laki di rumahnya sebanding dengan satu sholat, sholatnya di masjid kabilahnya sebanding dengan dua puluh lima sholat, sholatnya di masjid jami' sebanding dengan seratus sholat, sholatnya di masjid Al Aqsha sebanding dengan seribu sholat, sholatnya di masjidku sebanding dengan lima puluh ribu sholat, dan sholat di Masjidil Haram sebanding dengan seratus ribu sholat. \""
            },
            {
                "number": 1371,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو الرَّقِّيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الطُّفَيْلِ بْنِ أُبَيِّ بْنِ كَعْبٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي إِلَى جِذْعٍ إِذْ كَانَ الْمَسْجِدُ عَرِيشًا وَكَانَ يَخْطُبُ إِلَى ذَلِكَ الْجِذْعِ فَقَالَ رَجُلٌ مِنْ أَصْحَابِهِ هَلْ لَكَ أَنْ نَجْعَلَ لَكَ شَيْئًا تَقُومُ عَلَيْهِ يَوْمَ الْجُمُعَةِ حَتَّى يَرَاكَ النَّاسُ وَتُسْمِعَهُمْ خُطْبَتَكَ قَالَ نَعَمْ فَصَنَعَ لَهُ ثَلَاثَ دَرَجَاتٍ فَهِيَ الَّتِي أَعْلَى الْمِنْبَرِ فَلَمَّا وُضِعَ الْمِنْبَرُ وَضَعُوهُ فِي مَوْضِعِهِ الَّذِي هُوَ فِيهِ فَلَمَّا أَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقُومَ إِلَى الْمِنْبَرِ مَرَّ إِلَى الْجِذْعِ الَّذِي كَانَ يَخْطُبُ إِلَيْهِ فَلَمَّا جَاوَزَ الْجِذْعَ خَارَ حَتَّى تَصَدَّعَ وَانْشَقَّ فَنَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا سَمِعَ صَوْتَ الْجِذْعِ فَمَسَحَهُ بِيَدِهِ حَتَّى سَكَنَ ثُمَّ رَجَعَ إِلَى الْمِنْبَرِ فَكَانَ إِذَا صَلَّى صَلَّى إِلَيْهِفَلَمَّا هُدِمَ الْمَسْجِدُ وَغُيِّرَ أَخَذَ ذَلِكَ الْجِذْعَ أُبَيُّ بْنُ كَعْبٍ وَكَانَ عِنْدَهُ فِي بَيْتِهِ حَتَّى بَلِيَ فَأَكَلَتْهُ الْأَرَضَةُ وَعَادَ رُفَاتًا",
                "id": "Telah menceritakan kepada kami [Isma'il bin Abdullah Ar Raqqi] berkata, telah menceritakan kepada kami [ubaidhullah bin Amru Ar Raqqi] dari [Abdullah bin Muhammad bin Aqil] dari [Ath Thufail bin Abu Ubai bin Ka'b] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat menghadap ke arah sebatang kayu kurma, sebab masjid pada masa itu tidak mempunyai dinding, dan beliau juga berkhutbah di atas kayu tersebut. Seorang laki-laki dari sahabatnya berkata, \"Bagaimana jika kami buatkan sesuatu (mimbar) yang dapat engkau gunakan berdiri di hari jum'at, hingga orang-orang dapat melihatmu dan mendengar khutbahmu?\" beliau menjawab: \"Ya, \" maka sahabat itu membuatkan Rasulullah mimbar yang mempunyai tiga undakan, ketika para sahabat meletakkan mimbar tersebut pada tempat yang biasa beliau gunakan khutbah, dan Rasulullah shallallahu 'alaihi wasallam ingin berdiri di atasnya, beliau melintasi batang kayu yang biasa beliau gunakan untuk berkhutbah. Ketika melintas, batang kayu tersebut mengeluarkan suara dan terbelah. Rasulullah shallallahu 'alaihi wasallam pun turun, ketika beliau mendengar suara kayu itu beliau mengusapnya dengan tangan hingga ia menjadi tenang, setelah itu beliau kembali lagi ke atas mimbar. Jika sholat beliau selalu menghadap ke arah batang kayu tersebut, maka ketika masjid dirombak dan di ubah, Ubai bin Ka'b mengambil batang kayu tersebut. Batang kayu tersebut tetap di rumahnya hingga lapuk dan di makan rayap dan menjadi remukan-remukan kecil. \""
            },
            {
                "number": 1372,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ عَنْ ابْنِ عَبَّاسٍ وَعَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ إِلَى جِذْعٍ فَلَمَّا اتَّخَذَ الْمِنْبَرَ ذَهَبَ إِلَى الْمِنْبَرِ فَحَنَّ الْجِذْعُ فَأَتَاهُ فَاحْتَضَنَهُ فَسَكَنَ فَقَالَ لَوْ لَمْ أَحْتَضِنْهُ لَحَنَّ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Bahz bin Asad] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Ammar bin Abu Ammar] dari [Ibnu Abbas] dan dari [Tsabit] dari [Anas] berkata, \"Nabi shallallahu 'alaihi wasallam berkhutbah di atas batang kayu kurma, ketika mimbar telah dibuat beliau pindah ke mimbar hingga batang kayu tersebut bersuara. Maka beliau pun mendatangi dan mendekapnya hingga ia menjadi tenang. Beliau lalu bersabda: \"Sekiranya tidak aku peluk (menenangkan), sungguh ia akan bersuara hingga hari kiamat. \""
            },
            {
                "number": 1373,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي حَازِمٍ قَالَاخْتَلَفَ النَّاسُ فِي مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَيِّ شَيْءٍ هُوَ فَأَتَوْا سَهْلَ بْنَ سَعْدٍ فَسَأَلُوهُ فَقَالَ مَا بَقِيَ أَحَدٌ مِنْ النَّاسِ أَعْلَمُ بِهِ مِنِّي هُوَ مِنْ أَثْلِ الغَابَةِ عَمِلَهُ فُلَانٌ مَوْلَى فُلَانَةَ نَجَّارٌ فَجَاءَ بِهِ فَقَامَ عَلَيْهِ حِينَمَا وُضِعَ فَاسْتَقْبَلَ وَقَامَ النَّاسُ خَلْفَهُ فَقَرَأَ ثُمَّ رَكَعَ ثُمَّ رَفَعَ رَأْسَهُ فَرَجَعَ الْقَهْقَرَى حَتَّى سَجَدَ بِالْأَرْضِ ثُمَّ عَادَ إِلَى الْمِنْبَرِ فَقَرَأَ ثُمَّ رَكَعَ فَقَامَ ثُمَّ رَجَعَ الْقَهْقَرَى حَتَّى سَجَدَ بِالْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Tsabit Al Jahdari] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abu Hazim] berkata, \"Orang-orang saling berselisih mengenai mimbar Rasulullah shallallahu 'alaihi wasallam, yakni dibuat dari apa mimbar tersebut. Mereka kemudian mendatangi Sahl bin Sa'd dan menanyakan hal itu kepadanya. [Sahl bin Sa'd] lalu berkata, \"Tidak seorang (sahabat) pun yang tersisa, yang lebih tahu tentang mimbar itu selain aku, mimbar itu dibuat dari kayu hutan, ia dibuat oleh Fulan mantan budak Fulanah. Tukang kayu itu membawakan mimbar tersebut, ketika diletakkan beliau berdiri di atasnya dan menghadap ke arah kiblat, dan orang-orang berdiri di belakangnya. Beliau membaca surat lalu rukuk, kemudian mengangkat kepalanya seraya mundur ke belakang hingga beliau dapat sujud. Setelah itu beliau kembali lagi ke atas mimbar dan membaca surat, kemudian rukuk dan berdiri, kemudian mundur ke belakang lagi hingga beliau dapat sujud. \""
            },
            {
                "number": 1374,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي نَضْرَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُومُ إِلَى أَصْلِ شَجَرَةٍ أَوْ قَالَ إِلَى جِذْعٍ ثُمَّ اتَّخَذَ مِنْبَرًا قَالَ فَحَنَّ الْجِذْعُ قَالَ جَابِرٌ حَتَّى سَمِعَهُ أَهْلُ الْمَسْجِدِ حَتَّى أَتَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَسَحَهُ فَسَكَنَفَقَالَ بَعْضُهُمْ لَوْ لَمْ يَأْتِهِ لَحَنَّ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bisyr bin Khalaf] berkata, telah menceritakan kepada kami [Ibnu Abu Adi] dari [Sulaiman At Taimi] dari [Abu Nadlrah] dari [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam berdiri di atas batang pohon, atau ia mengatakan, \"di atas batang kurma hingga kayu itu dijadikan sebagai mimbar. \" Abu Nadlrah berkata, \"Batang kurma itu bersuara. \" Jabir berkata, \"Orang-orang yang di masjid sampai mendengar suaranya, hingga Rasulullah shallallahu 'alaihi wasallam datang dan mengusapnya, batang kayu itu pun diam. Sebagian sahabat berkata, \"Sekiranya beliau tidak mengusapnya, maka ia akan bersuara hingga hari kiamat. \""
            },
            {
                "number": 1375,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ وَسُوَيْدُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَصَلَّيْتُ ذَاتَ لَيْلَةٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزَلْ قَائِمًا حَتَّى هَمَمْتُ بِأَمْرِ سَوْءٍ قُلْتُ وَمَا ذَاكَ الْأَمْرُ قَالَ هَمَمْتُ أَنْ أَجْلِسَ وَأَتْرُكَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Amir bin Zurarah] dan [Suwaid bin Sa'id] keduanya berkata; telah menceritakan kepada kami [Ali bin Mushir] dari [Al A'masy] dari [Abu Wa`il] dari [Abdullah] berkata, \"Pada suatu malam aku sholat bersama Rasulullah shallallahu 'alaihi wasallam, beliau masih saja berdiri hingga muncul pikiran jelek dalam diriku. \" Aku bertanya, \"Perkara apa itu?\" Abdullah menjawab, \"Aku ingin duduk, namun tidak aku teruskan. \""
            },
            {
                "number": 1376,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ زِيَادِ بْنِ عِلَاقَةَ سَمِعَ الْمُغِيرَةَ يَقُولُقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَوَرَّمَتْ قَدَمَاهُ فَقِيلَ يَا رَسُولَ اللَّهِ قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ قَالَ أَفَلَا أَكُونُ عَبْدًا شَكُورًا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ziyad bin Ilaqah] ia mendengar [Al Mughirah] berkata, \"Rasulullah shallallahu 'alaihi wasallam berdiri (sholat) hingga bengkak kedua kakinya, dikatakan kepada beliau, \"Wahai Rasulullah, dosamu telah diampuni baik yang lalu atau yang akan datang! \" beliau menjawab: \"Tidak bolehkah aku menjadi hamba yang bersyukur. \""
            },
            {
                "number": 1377,
                "arab": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ مُحَمَّدُ بْنُ يَزِيدَ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي حَتَّى تَوَرَّمَتْ قَدَمَاهُ فَقِيلَ لَهُ إِنَّ اللَّهَ قَدْ غَفَرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ قَالَ أَفَلَا أَكُونُ عَبْدًا شَكُورًا",
                "id": "Telah menceritakan kepada kami [Abu Hisyam Ar Rifa'I Muhammad bin Yazid] berkata, telah menceritakan kepada kami [Yahya bin Yaman] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam selalu melaksanakan sholat (tahajjud) sehingga kedua kakinya bengkak. Dikatakan kepadanya, \"Sesungguhnya Allah telah mengampuni dosamu baik yang lalu maupun yang akan datang! \" Beliau bersabda: \"Tidak bolehkah aku menjadi hamba yang senantiasa bersyukur?\""
            },
            {
                "number": 1378,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الصَّلَاةِ أَفْضَلُ قَالَ طُولُ الْقُنُوتِ",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf Abu Bisyr] berkata, telah menceritakan kepada kami [Abu Ashim] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir bin Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam ditanya; sholat yang bagaimana yang paling utama?\" beliau menjawab: \"Yang panjang berdirinya. \""
            },
            {
                "number": 1379,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيَّانِ قَالَا حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ ثَابِتِ بْنِ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ عَنْ كَثِيرِ بْنِ مُرَّةَ أَنَّ أَبَا فَاطِمَةَ حَدَّثَهُ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَخْبِرْنِي بِعَمَلٍ أَسْتَقِيمُ عَلَيْهِ وَأَعْمَلُهُ قَالَ عَلَيْكَ بِالسُّجُودِ فَإِنَّكَ لَا تَسْجُدُ لِلَّهِ سَجْدَةً إِلَّا رَفَعَكَ اللَّهُ بِهَا دَرَجَةً وَحَطَّ بِهَا عَنْكَ خَطِيئَةً",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan ['Abdurrahman bin Ibrahim Ad Dimasyqiyani] keduanya berkata; telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami ['Abdurrahman bin Tsabit bin Tsauban] dari [Bapaknya] dari [Makhul] dari [Katsir min Murrah] bahwa [Abu Fathimah] menceritakan kepadanya, ia berkata, \"Aku berkata, \"Wahai Rasulullah, kabarkanlah kepadaku suatu amalan yang aku bisa istiqamah dan mampu melaksanakannya, \" beliau bersabda: \"Sujudlah kepada Allah, sebab tidaklah engkau sujud kepada-Nya sekali saja, kecuali dengannya Allah akan mengangkat satu derajat dan menghapus satu kesalahan darimu. \""
            },
            {
                "number": 1380,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو أَبُو عَمْرٍو الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ هِشَامٍ الْمُعَيْطِيُّ حَدَّثَهُ مَعْدَانُ بْنُ أَبِي طَلْحَةَ الْيَعْمُرِيُّ قَالَلَقِيتُ ثَوْبَانَ فَقُلْتُ لَهُ حَدِّثْنِي حَدِيثًا عَسَى اللَّهُ أَنْ يَنْفَعَنِي بِهِ قَالَ فَسَكَتَ ثُمَّ عُدْتُ فَقُلْتُ مِثْلَهَا فَسَكَتَ ثَلَاثَ مَرَّاتٍ فَقَالَ لِي عَلَيْكَ بِالسُّجُودِ لِلَّهِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ يَسْجُدُ لِلَّهِ سَجْدَةً إِلَّا رَفَعَهُ اللَّهُ بِهَا دَرَجَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةًقَالَ مَعْدَانُ ثُمَّ لَقِيتُ أَبَا الدَّرْدَاءِ فَسَأَلْتُهُ فَقَالَ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami ['Abdurrahman bin Amru Abu Al Auza'i] berkata; telah menceritakan kepadaku [Al Walid bin Hisyam Al Mu'aithi] berkata, telah menceritakan kepadanya [Ma'dan bin Abu Thalhah Al Ya'muri] berkata, \"Aku pernah bertemu [Tsauban], lalu aku katakan kepadanya, \"Bacakanlah satu hadits kepadaku, mudah-mudahan dengan hadits tersebut Allah memberiku manfaat. \" Ma'dan berkata, \"Tsauban diam, lalu aku ulangi lagi dan kukatakan seperti itu. Namun ia tetap diam, aku ulangi lagi hingga tiga kali. Setelah itu ia berkata kepadaku, \"Sujudlah engkau kepada Allah, sungguh aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba sujud kepada Allah kecuali dengannya Allah akan menaikkan satu derajat dan menghapus darinya satu kesalahan. \" Ma'dan berkata, \"Setelah itu aku bertemu [Abu Darda] dan aku tanyakan kepadanya, dan ia pun menjawab memberi jawaban seperti itu. \""
            },
            {
                "number": 1381,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ خَالِدِ بْنِ يَزِيدَ الْمُرِّيِّ عَنْ يُونُسَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ عَنْ الصُّنَابِحِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ يَسْجُدُ لِلَّهِ سَجْدَةً إِلَّا كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً وَمَحَا عَنْهُ بِهَا سَيِّئَةً وَرَفَعَ لَهُ بِهَا دَرَجَةً فَاسْتَكْثِرُوا مِنْ السُّجُودِ",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Utsman Ad-Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] dari [Khalid bin Yazid Al Murri] dari [Yunus bin Maisarah bin Jals] dari [As Shunabi] dari [Ubadah bin Shamit] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba melakukan sujud sekali kepada Allah, kecuali Allah akan menuliskan baginya satu kebaikan, menghapus satu keburukan, dan mengangkatnya satu derajat. Oleh sebab itu perbanyaklah melakukan sujud. \""
            },
            {
                "number": 1382,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ حَكِيمٍ الضَّبِّيِّ قَالَقَالَ لِي أَبُو هُرَيْرَةَ إِذَا أَتَيْتَ أَهْلَ مِصْرِكَ فَأَخْبِرْهُمْ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَوَّلَ مَا يُحَاسَبُ بِهِ الْعَبْدُ الْمُسْلِمُ يَوْمَ الْقِيَامَةِ الصَّلَاةُ الْمَكْتُوبَةُ فَإِنْ أَتَمَّهَا وَإِلَّا قِيلَ انْظُرُوا هَلْ لَهُ مِنْ تَطَوُّعٍ فَإِنْ كَانَ لَهُ تَطَوُّعٌ أُكْمِلَتْ الْفَرِيضَةُ مِنْ تَطَوُّعِهِ ثُمَّ يُفْعَلُ بِسَائِرِ الْأَعْمَالِ الْمَفْرُوضَةِ مِثْلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Muhammad bin Basyar] keduanya berkata; telah menceritakan kepada kami [Yazid bin Harun] dari [Sufyan bin Husain] dari [Ali bin Zaid] dari [Anas bin Hakim Adl Dlabbi] berkata; [Abu Hurairah] berkata kepadaku, \"Jika engkau datang kepada warga kampungmu maka kabarkanlah kepada mereka bahwa aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pertama kali yang akan dihitung atas seorang muslim pada hari kiamat adalah sholat wajibnya, jika ia menyempurnakannya (akan diterima), jika tidak menyempurnakannya maka akan dikatakan, \"Lihatlah, apakah ia mempunyai ibadah thathawu'? jika ia mempunyai ibadah thathawu' maka sempurnakanlah ibadah wajib dengan ibadah tathawu'nya, \" kemudian semua amalan wajib akan dilakukan seperti itu. \""
            },
            {
                "number": 1383,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ تَمِيمٍ الدَّارِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ أَنْبَأَنَا حُمَيْدٌ عَنْ الْحَسَنِ عَنْ رَجُلٍ عَنْ أَبِي هُرَيْرَةَ وَدَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ تَمِيمٍ الدَّارِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَوَّلُ مَا يُحَاسَبُ بِهِ الْعَبْدُ يَوْمَ الْقِيَامَةِ صَلَاتُهُ فَإِنْ أَكْمَلَهَا كُتِبَتْ لَهُ نَافِلَةً فَإِنْ لَمْ يَكُنْ أَكْمَلَهَا قَالَ اللَّهُ سُبْحَانَهُ لِمَلَائِكَتِهِ انْظُرُوا هَلْ تَجِدُونَ لِعَبْدِي مِنْ تَطَوُّعٍ فَأَكْمِلُوا بِهَا مَا ضَيَّعَ مِنْ فَرِيضَتِهِ ثُمَّ تُؤْخَذُ الْأَعْمَالُ عَلَى حَسَبِ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi] berkata, telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Dawud bin Abu Hind] dari [Zurarah bin Aufa] dari [Tamim Ad Dari] dari Nabi shallallahu 'alaihi wasallam. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Al Hasan bin Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Affan] berkata, telah memberitakan kepada kami [Humaid] dari [Al Hasan] dari [seorang laki-laki] dari [Abu Hurairah] dan [Dawud bin Abu Hind] dari [Zurarah bin Aufa] dari [Tamim Ad Dari] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pertama yang akan dihisab atas seorang hamba pada hari kiamat adalah sholatnya, jika ia menyempurnakannya maka akan ditulis baginya pahala nafilah. Jika tidak menyempurnakannya, Allah Subhaanahu kepada malaikat-Nya, \"Lihatlah, apakah kalian mendapati ia mempunyai ibadah thathawu'? dengannya sempurnakanlah ibadah wajibnya yang kurang, \" kemudian semua amalan akan diperlakukan seperti itu. \""
            },
            {
                "number": 1384,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ لَيْثٍ عَنْ حَجَّاجِ بْنِ عُبَيْدٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْمَعِيلَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيَعْجِزُ أَحَدُكُمْ إِذَا صَلَّى أَنْ يَتَقَدَّمَ أَوْ يَتَأَخَّرَ أَوْ عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ يَعْنِي السُّبْحَةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Laits] dari [Hajjaj bin Ubaid] dari [Ibrahim bin Isma'il] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak mampukah salah seorang dari kalian jika sholat untuk maju ke depan, atau ke belakang, atau ke kanan, atau ke kiri. Yakni dalam sholat sunnah. \""
            },
            {
                "number": 1385,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عُثْمَانَ بْنِ عَطَاءٍ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُصَلِّي الْإِمَامُ فِي مُقَامِهِ الَّذِي صَلَّى فِيهِ الْمَكْتُوبَةَ حَتَّى يَتَنَحَّى عَنْهُحَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ أَبِي عَبْدِ الرَّحْمَنِ التَّمِيمِيِّ عَنْ عُثْمَانَ بْنِ عَطَاءٍ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Utsman bin 'Atho`] dari [Bapaknya] dari [Mughirah bin Syu'bah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang imam sholat (sunnah) di tempat yang telah ia gunakan untuk sholat wajib, hingga ia bergeser dari tempatnya tersebut. \" Telah menceritakan kepada kami [Katsir bin Ubaid Al Himshi] berkata, telah menceritakan kepada kami [Baqiyyah] dari [Abu 'Abdurrahman At Tamimi] dari [Utsman bin 'Atho`] dari [Bapaknya] dari [Al Mughirah] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. \""
            },
            {
                "number": 1386,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَا حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ أَبِيهِ عَنْ تَمِيمِ بْنِ مَحْمُودٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِبْلٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَلَاثٍ عَنْ نَقْرَةِ الْغُرَابِ وَعَنْ فِرْشَةِ السَّبُعِ وَأَنْ يُوطِنَ الرَّجُلُ الْمَكَانَ الَّذِي يُصَلِّي فِيهِ كَمَا يُوطِنُ الْبَعِيرُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bisyir Bakr bin Khalaf] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] keduanya berkata; telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Bapaknya] dari [Tamim bin Mahmud] dari ['Abdurrahman bin Syibl] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari tiga hal; mematuk sebagaimana seperti burung gagak, membentangkan tangan seperti binatang buas dan seorang laki-laki sholat di tempat yang telah ia gunakan sholat, sebagaimana unta (yang menempati tempatnya kembali). \" "
            },
            {
                "number": 1387,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِأَنَّهُ كَانَ يَأْتِي إِلَى سُبْحَةِ الضُّحَى فَيَعْمِدُ إِلَى الْأُسْطُوَانَةِ دُونَ الْمُصْحَفِ فَيُصَلِّ قَرِيبًا مِنْهَا فَأَقُولُ لَهُ أَلَا تُصَلِّي هَا هُنَا وَأُشِيرُ إِلَى بَعْضِ نَوَاحِي الْمَسْجِدِ فَيَقُولُ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَرَّى هَذَا الْمُقَامَ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Al Mughirah bin 'Abdurrahman Al Makhzumi] dari [Yazid bin Abu Ubaid] dari [Salamah Ibnul Akwa'] bahwa ia pernah sholat sunnah dluha. Ia menuju tiang, tidak ke mushhaf Utsmani, lalu ia sholat di dekatnya. Aku tanyakan kepadanya, \"Kenapa kamu tidak sholat di sini? Lalu aku menunjuk pada salah satu sujud masjid. Ia menjawab, \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam menghindari tempat ini. \""
            },
            {
                "number": 1388,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ عَنْ مُحَمَّدِ بْنِ عَبَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ الْفَتْحِ فَجَعَلَ نَعْلَيْهِ عَنْ يَسَارِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] dari [Muhammad bin 'Abbad] dari [Abdullah bin Sufyan] dari [Abdullah bin As Sa`ib] ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam sholat di hari penaklukan kota Makkah, beliau meletakkan kedua sandalnya di samping kirinya. \""
            },
            {
                "number": 1389,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلْزِمْ نَعْلَيْكَ قَدَمَيْكَ فَإِنْ خَلَعْتَهُمَا فَاجْعَلْهُمَا بَيْنَ رِجْلَيْكَ وَلَا تَجْعَلْهُمَا عَنْ يَمِينِكَ وَلَا عَنْ يَمِينِ صَاحِبِكَ وَلَا وَرَاءَكَ فَتُؤْذِيَ مَنْ خَلْفَكَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim bin Habib] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami ['Abdurrahman Al Muharibi] dari [Abdullah bin Sa'id bin Abu Sa'id] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tetaplah engkau pakai kedua sandalmu, Jika kamu lepas maka letakkanlah di antara kedua kakimu dan jangan kamu letakkan di sebelah kananmu, atau di sebelah kanan temanmu, atau di belakangmu, karena akan mengganggu orang yang ada di belakangmu. \" "
            },
            {
                "number": 1390,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتَّةٌ بِالْمَعْرُوفِ يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَعُودُهُ إِذَا مَرِضَ وَيَتْبَعُ جِنَازَتَهُ إِذَا مَاتَ وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari [Al Harits] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Antara muslim dengan muslim yang lain ada enam kewajiban untuk berbuat baik; memberi salam jika bertemu, memenuhi undangannya jika diundang, menjawabnya jika bersin, menjenguknya jika sakit, mengantar jenazahnya jika meninggal dan menyukainya sebagaimana ia menyukai dirinya. \""
            },
            {
                "number": 1391,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ أَبِيهِ عَنْ حَكِيمِ بْنِ أَفْلَحَ عَنْ أَبِي مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ أَرْبَعُ خِلَالٍ يُشَمِّتُهُ إِذَا عَطَسَ وَيُجِيبُهُ إِذَا دَعَاهُ وَيَشْهَدُهُ إِذَا مَاتَ وَيَعُودُهُ إِذَا مَرِضَ",
                "id": "Telah menceritakan kepada kami [Abu Bisyr bin Khalaf] dan [Muhammad bin Basysyar] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Bapaknya] dari [Hakim bin Aflah] dari [Abu Mas'ud] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Antara muslim satu dengan muslim lainnya ada empat kewajiban; menjawabnya jika bersin, memenuhi undangannya jika mengundang, berta'ziyah jika meninggal dan menjenguknya jika sakit. \""
            },
            {
                "number": 1392,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ حَقِّ الْمُسْلِمِ عَلَى الْمُسْلِمِ رَدُّ التَّحِيَّةِ وَإِجَابَةُ الدَّعْوَةِ وَشُهُودُ الْجِنَازَةِ وَعِيَادَةُ الْمَرِيضِ وَتَشْمِيتُ الْعَاطِسِ إِذَا حَمِدَ اللَّهَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lima hak seorang muslim atas muslim lainnya; menjawab salam, memenuhi undangan, mengiringi jenazah, menjenguk di kala sakit, dan menjawab bersin jika ia bertahmid (mengucapkan Al Hamdulillah). \""
            },
            {
                "number": 1393,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الصَّنْعَانِيُّ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُعَادَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاشِيًا وَأَبُو بَكْرٍ وَأَنَا فِي بَنِي سَلَمَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Ash Shan'ani] berkata, telah menceritakan kepada kami [Sufyan] berkata; Aku mendengar [Muhammad bin Al Munkadir] berkata; aku mendengar [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam menjengukku dengan berjalan kaki, sementara aku dan Abu Bakar berada di bani Salamah. \""
            },
            {
                "number": 1394,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مَسْلَمَةُ بْنُ عَلِيٍّ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَعُودُ مَرِيضًا إِلَّا بَعْدَ ثَلَاثٍ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Maslamah bin Ali] berkata, telah menceritakan kepada kami [Ibnu Juraij] dari [Humaid Ath Thawil] dari [Anas bin Malik] ia berkata, \"Nabi shallallahu 'alaihi wasallam tidak menjenguk orang sakit kecuali setelah tiga hari. \""
            },
            {
                "number": 1395,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلْتُمْ عَلَى الْمَرِيضِ فَنَفِّسُوا لَهُ فِي الْأَجَلِ فَإِنَّ ذَلِكَ لَا يَرُدُّ شَيْئًا وَهُوَ يَطِيبُ بِنَفْسِ الْمَرِيضِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Uqbah bin Khalid As Sakuni] dari [Musa bin Muhammad bin Ibrahim At Taimi] dari [Bapaknya] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian menjenguk orang sakit maka berilah ia semangat dalam menghadapi ajal, meskipun itu tidak dapat menolak sesuatu tetapi akan membuat jiwa yang sakit menjadi baik. \""
            },
            {
                "number": 1396,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا صَفْوَانُ بْنُ هُبَيْرَةَ حَدَّثَنَا أَبُو مَكِينٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَادَ رَجُلًا فَقَالَ مَا تَشْتَهِي قَالَ أَشْتَهِي خُبْزَ بُرٍّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ عِنْدَهُ خُبْزُ بُرٍّ فَلْيَبْعَثْ إِلَى أَخِيهِ ثُمَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَهَى مَرِيضُ أَحَدِكُمْ شَيْئًا فَلْيُطْعِمْهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Shafwan bin Hubair] berkata, telah menceritakan kepada kami [Abu Makin] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam seorang yang sakit, beliau lalu bertanya: \"Apa yang kamu inginkan?\" ia menjawab, \"Aku ingin roti gandum. \" Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mempunyai roti gandum hendaklah mengirimkannya pada saudaranya. \" Kemudian beliau bersabda lagi: \"Apabila di antara kalian ada yang sakit dan menginginkan sesuatu, maka berikanlah. \""
            },
            {
                "number": 1397,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ عَنْ الْأَعْمَشِ عَنْ يَزِيدَ الرَّقَاشِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَرِيضٍ يَعُودُهُ فَقَالَ أَتَشْتَهِي شَيْئًا أَتَشْتَهِي كَعْكًا قَالَ نَعَمْ فَطَلَبُوا لَهُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] berkata, telah menceritakan kepada kami [Abu Yahya Al Himmani] dari [Al A'masy] dari [Yazid Ar Raqqasyi] dari [Anas bin Malik] ia berkata, \"Nabi shallallahu 'alaihi wasallam menjenguk orang sakit, lalu beliau bertanya: \"Apakah kamu menginginkan sesuatu? Apakah kamu ingin roti?\" ia menjawab, \"Ya, \" lalu para sahabat pun mencarikan roti untuknya. \" "
            },
            {
                "number": 1398,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنِي كَثِيرُ بْنُ هِشَامٍ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلْتَ عَلَى مَرِيضٍ فَمُرْهُ أَنْ يَدْعُوَ لَكَ فَإِنَّ دُعَاءَهُ كَدُعَاءِ الْمَلَائِكَةِ",
                "id": "Telah menceritakan kepada kami [Ja'far bin Musafir] berkata, telah menceritakan kepadaku [Katsir bin Hisyam] berkata, telah menceritakan kepada kami [Ja'far bin Burqan] dari [Maimun bin Mihran] dari [Umar bin Khaththab] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda kepadaku: \"Jika kamu mengunjungi orang sakit maka mintalah agar ia mendo'akanmu. Sebab do`anya seperti do`a para malaikat. \""
            },
            {
                "number": 1399,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَتَى أَخَاهُ الْمُسْلِمَ عَائِدًا مَشَى فِي خَرَافَةِ الْجَنَّةِ حَتَّى يَجْلِسَ فَإِذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ فَإِنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُمْسِيَ وَإِنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُصْبِحَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Al Hakam] dari ['Abdurrahman bin Abu Laila] dari [Ali] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengunjungi saudaranya sesama muslim maka seakan ia berjalan di bawah pepohonan surga hingga ia duduk, jika telah duduk maka rahmat akan melingkupinya. Jika mengunjunginya di waktu pagi, maka tujuh puluh ribu malaikat akan bershalawat kepadanya hingga sore hari, dan jika ia mengunjunginya di waktu sore, maka tujuh puluh ribu malaikat akan bershalawat kepadanya hingga pagi hari. \""
            },
            {
                "number": 1400,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ حَدَّثَنَا أَبُو سِنَانٍ الْقَسْمَلِيُّ عَنْ عُثْمَانَ بْنِ أَبِي سَوْدَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عَادَ مَرِيضًا نَادَى مُنَادٍ مِنْ السَّمَاءِ طِبْتَ وَطَابَ مَمْشَاكَ وَتَبَوَّأْتَ مِنْ الْجَنَّةِ مَنْزِلًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yusuf bin Ya'qub] berkata, telah menceritakan kepada kami [Abu Sinan Al Qasmali] dari [Utsman bin Abu Saudah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjenguk orang sakit, maka akan ada penyeru dari langit yang menyeru, \"Kamu telah baik, baik pula perjalananmu, dan kamu akan menempati tempat tinggal di surga. \""
            },
            {
                "number": 1401,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ يَزِيدَ بْنِ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِّنُوا مَوْتَاكُمْ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Talqinlah orang yang akan meninggal di antara kamu dengan LAA ILAAHA ILLA ALLAH. \""
            },
            {
                "number": 1402,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِّنُوا مَوْتَاكُمْ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Sulaiman bin Bilal] dari [Umarah bin Ghaziah] dari [Yahya bin Umarah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Talqinlah orang yang akan meninggal di antara kamu dengan LAA ILAAHA ILLA ALLAH. \""
            },
            {
                "number": 1403,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا كَثِيرُ بْنُ زَيْدٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِّنُوا مَوْتَاكُمْ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ لِلْأَحْيَاءِ قَالَ أَجْوَدُ وَأَجْوَدُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abu Amir] berkata, telah menceritakan kepada kami [Katsir bin Yazid] dari [Ishaq bin Abdullah bin Ja'far] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lakukanlah talqin kepada orang-orang yang akan meninggal di antara kalian dengan; LAA ILAAHA ILLA ALLAH AL HALIIMU AL KARIIMU SUBHAANA ALLAH RABBUl 'ARSYIl 'AZHIIM AL HAMDULILLAAHI RABBIL 'AALAMIIN (Tidak ada Tuhan yang berhak disembah kecuali Allah yang Maha Lembut lagi Maha Pemurah. Maha Suci Allah Rabb 'Arsy yang agung. Segala puji bagi Allah Rabb sekalian alam). \" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana jika untuk orang-orang yang masih hidup?\" beliau menjawab: \"Itu akan lebih baik. \" "
            },
            {
                "number": 1404,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ أُمِّ سَلَمَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَضَرْتُمْ الْمَرِيضَ أَوْ الْمَيِّتَ فَقُولُوا خَيْرًا فَإِنَّ الْمَلَائِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ فَلَمَّا مَاتَ أَبُو سَلَمَةَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سَلَمَةَ قَدْ مَاتَ قَالَ قُولِي اللَّهُمَّ اغْفِرْ لِي وَلَهُ وَأَعْقِبْنِي مِنْهُ عُقْبًى حَسَنَةًقَالَتْ فَفَعَلْتُ فَأَعْقَبَنِي اللَّهُ مَنْ هُوَ خَيْرٌ مِنْهُ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] dari [Ummu Salamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian menghadiri orang sakit atau orang meninggal maka ucapkanlah yang baik-baik, sebab para malaikat mengamini atas apa yang kalian ucapkan. \" Ketika Abu Salamah meninggal aku mendatangi Nabi shallallahu 'alaihi wasallam, aku berkata, \"Wahai Rasulullah, Abu Salamah telah meninggal! \" beliau bersabda: \"Berdo`alah; Ya Allah, ampunilah aku dan dia, dan berilah pengganti untukku yang lebih baik darinya. \" Ummu Salamah berkata, \"Lalu aku melakukannya, dan ternyata Allah memberi ganti yang lebih baik darinya, Muhammad Rasulullah shallallahu 'alaihi wasallam. \""
            },
            {
                "number": 1405,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ عَنْ ابْنِ الْمُبَارَكِ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ وَلَيْسَ بِالنَّهْدِيِّ عَنْ أَبِيهِ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَءُوهَا عِنْدَ مَوْتَاكُمْ يَعْنِي يس",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ali Ibnul Hasan bin Syaqiq] dari [Ibnul Mubarak] dari [Sulaiman At Taimi] dari [Abu Utsman] -bukan An Nahdi- dari [Bapaknya] dari [Ma'qil bin Yasar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bacakanlah ia untuk orang-orang akan meninggal dari kalian, yakni YASIIN. \""
            },
            {
                "number": 1406,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا الْمُحَارِبِيُّ جَمِيعًا عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الْحَارِثِ بْنِ فُضَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَلَمَّا حَضَرَتْ كَعْبًا الْوَفَاةُ أَتَتْهُ أُمُّ بِشْرٍ بِنْتُ الْبَرَاءِ بْنِ مَعْرُورٍ فَقَالَتْ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنْ لَقِيتَ فُلَانًا فَاقْرَأْ عَلَيْهِ مِنِّي السَّلَامَ قَالَ غَفَرَ اللَّهُ لَكِ يَا أُمَّ بِشْرٍ نَحْنُ أَشْغَلُ مِنْ ذَلِكَ قَالَتْ يَا أَبَا عَبْدِ الرَّحْمَنِ أَمَا سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَرْوَاحَ الْمُؤْمِنِينَ فِي طَيْرٍ خُضْرٍ تَعْلُقُ بِشَجَرِ الْجَنَّةِ قَالَ بَلَى قَالَتْ فَهُوَ ذَاكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yazid bin Harun]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Isma'il] berkata, telah menceritakan kepada kami [Al Muharibi] semuanya dari [Muhammad bin Ishaq] dari [Al Harits bin Fudlail] dari [Az Zuhri] dari ['Abdurrahman bin Ka'b bin Malik] dari [Bapaknya] berkata, \"Ketika ajal akan menjemput Ka'b, Ummu Bisyr binti Al Bara bin Ma'ruf datang kepadanya dan berkata, \"Wahai Abu 'Abdurrahman, jika engkau bertemu dengan si fulan, maka sampaikanlah salam dariku, \" Ka'b berkata, \"Semoga Allah mengampunimu wahai Ummu Bisyr, kami lebih sibuk dari hal itu. \" Ummu Bisyr berkata, \"Wahai Abu 'Abdurrahman, tidakkah engkau dengar sabda Rasulullah shallallahu 'alaihi wasallam: \"Sesungguhnya arwah kaum mukminin berada bersama burung-burung hijau yang bergelantungan di pepohonan surga, \" Ka'b menjawab, \"Benar, \" Ummu Bisyr berkata, \" Itulah (yang aku maksud). \""
            },
            {
                "number": 1407,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا يُوسُفُ بْنُ الْمَاجِشُونِ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ قَالَدَخَلْتُ عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ وَهُوَ يَمُوتُ فَقُلْتُ اقْرَأْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّلَامَ",
                "id": "Telah menceritakan kepada kami [Ahmad Ibnul Azhar] berkata, telah menceritakan kepada kami [Muhammad bin Isa] berkata, telah menceritakan kepada kami [Yusuf Ibnul Majisyun] berkata, telah menceritakan kepada kami [Muhammad Ibnul Munkadir] ia berkata, \"Aku menemui Jabir bin Abdullah ketika ia telah wafat, aku berkata, \"Sampaikan salam kepada Rasulullah shallallahu 'alaihi wasallam. \""
            },
            {
                "number": 1408,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ عَطَاءٍ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا حَمِيمٌ لَهَا يَخْنُقُهُ الْمَوْتُ فَلَمَّا رَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بِهَا قَالَ لَهَا لَا تَبْتَئِسِي عَلَى حَمِيمِكِ فَإِنَّ ذَلِكَ مِنْ حَسَنَاتِهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'I] dari ['Atho`] dari ['Aisyah] Bahwasanya Rasulullah shallallahu 'alaihi wasallam menjenguknya, sementara di sampingnya ada saudara iparnya yang sedang meregang nyawa. Ketika Nabi shallallahu 'alaihi wasallam melihat apa yang terjadi dengannya 'Aisyah, beliau bersabda kepadanya: \"Janganlah bersedih hati atas saudara iparmu, karena itu bagian dari amal baiknya. \" "
            },
            {
                "number": 1409,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ الْمُثَنَّى بْنِ سَعِيدٍ عَنْ قَتَادَةَ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُؤْمِنُ يَمُوتُ بِعَرَقِ الْجَبِينِ",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf Abu Biysr] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Al Mutsanna bin Sa'id] dari [Qatadah] dari [Ibnu Buraidah] dari [Bapaknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Orang mukmin jika meninggal dahinya berkeringat. \" "
            },
            {
                "number": 1410,
                "arab": "حَدَّثَنَا رَوْحُ بْنُ الْفَرَجِ حَدَّثَنَا نَصْرُ بْنُ حَمَّادٍ حَدَّثَنَا مُوسَى بْنُ كَرْدَمٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَتَى تَنْقَطِعُ مَعْرِفَةُ الْعَبْدِ مِنْ النَّاسِ قَالَ إِذَا عَايَنَ",
                "id": "Telah menceritakan kepada kami [Rauh bin Al Faraj] berkata, telah menceritakan kepada kami [Nashr bin Hammad] berkata, telah menceritakan kepada kami [Musa bin Kardam] dari [Muhammad bin Qais] dari [Abu Burdah] dari [Abu Musa] dia berkata, \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Kapan terputusnya pengetahuan seorang hamba dari manusia?\" beliau menjawab: \"Jika ia melihat dengan matanya (melihat malaikat saat sekarat). \" "
            },
            {
                "number": 1411,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ أَسَدٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ عَنْ أُمِّ سَلَمَةَ قَالَتْدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَبِي سَلَمَةَ وَقَدْ شَقَّ بَصَرُهُ فَأَغْمَضَهُ ثُمَّ قَالَ إِنَّ الرُّوحَ إِذَا قُبِضَ تَبِعَهُ الْبَصَرُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Asad] berkata, telah menceritakan kepada kami [Mu'awiyah bin Amru] berkata, telah menceritakan kepada kami [Abu Ishaq Al Fazari] dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Qabishah bin Dzu'aib] dari [Ummu Salamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemui Abu Salamah, sementara matanya membuka. Maka beliau pun menutupnya dan bersabda: \"Jika ruh diambil maka akan diikuti oleh mata. \""
            },
            {
                "number": 1412,
                "arab": "حَدَّثَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ تَوْبَةَ حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ حَدَّثَنَا قَزَعَةُ بْنُ سُوَيْدٍ عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ الزُّهْرِيِّ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ شَدَّادِ بْنِ أَوْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَضَرْتُمْ مَوْتَاكُمْ فَأَغْمِضُوا الْبَصَرَ فَإِنَّ الْبَصَرَ يَتْبَعُ الرُّوحَ وَقُولُوا خَيْرًا فَإِنَّ الْمَلَائِكَةَ تُؤَمِّنُ عَلَى مَا قَالَ أَهْلُ الْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Abu Dawud bin Taubah] berkata, telah menceritakan kepada kami [Ashim bin Ali] berkata, telah menceritakan kepada kami [Qaza'ah bin Suwaid] dari [Humaid Al A'raj] dari [Az Zuhri] dari [Mahmud bin Labid] dari [Syaddad bin Aus] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian menghadiri orang-orang yang telah meninggal dari kalian maka rapatkanlah mata mereka, sebab mata mengikuti perginya ruh. Dan ucapkanlah hal-hal baik, sebab para malaikat mengamini apa yang dikatakan oleh ahli bait. \""
            },
            {
                "number": 1413,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْقَبَّلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ فَكَأَنِّي أَنْظُرُ إِلَى دُمُوعِهِ تَسِيلُ عَلَى خَدَّيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ashim bin ubaidhullah] dari [Al Qasim bin Muhammad] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mencium Utsman bin Mazh'un, padahal ia telah menjadi mayat. Seakan-akan aku melihat air mata beliau mengalir pada kedua pipinya. \""
            },
            {
                "number": 1414,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ وَسَهْلُ بْنُ أَبِي سَهْلٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ وَعَائِشَةَأَنَّ أَبَا بَكْرٍ قَبَّلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مَيِّتٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] dan [Al Abbas bin Abdul Azhim] dan [Sahl bin Abu Sahl] mereka berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dari [Musa bin Abu 'Aisyah] dari [ubaidhullah] dari [Ibnu Abbas] dan ['Aisyah] berkata, \"Abu Bakar mencium Nabi shallallahu 'alaihi wasallam sementara beliau sudah menjadi mayat. \""
            },
            {
                "number": 1415,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نُغَسِّلُ ابْنَتَهُ أُمَّ كُلْثُومٍ فَقَالَ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حَقْوَهُ وَقَالَ أَشْعِرْنَهَا إِيَّاهُحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ عَنْ أَيُّوبَ حَدَّثَتْنِي حَفْصَةُ عَنْ أُمِّ عَطِيَّةَ بِمِثْلِ حَدِيثِ مُحَمَّدٍ وَكَانَ فِي حَدِيثِ حَفْصَةَ اغْسِلْنَهَا وِتْرًا وَكَانَ فِيهِ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا وَكَانَ فِيهِ ابْدَءُوا بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا وَكَانَ فِيهِ أَنَّ أُمَّ عَطِيَّةَ قَالَتْ وَمَشَطْنَاهَا ثَلَاثَةَ قُرُونٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdul Wahhab Ats Tsaqafi] dari [Ayyub] dari [Muhammad bin Sirin] dari [Ummu Athiah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemui kami ketika kami sedang memandikan putrinya, Ummu Kultsum. Beliau bersabda: \"Mandikanlah ia tiga kali, atau lima kali, atau lebih dari itu. Jika kalian memandikannya dengan air bidara maka bilaslah di akhir kalinya dengan air kapur barus, atau sesuatu darinya, dan jika kalian telah selesai kabarilah aku. \" Ketika selesai kami memberitahu Rasulullah, beliau lalu memberikan haqwah (kain sejenis semacam sarung) miliknya dan bersabda: \"Pakaikan itu padanya. \" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdul Wahhab Ats Tsaqafi] dari [Ayyub] berkata, telah menceritakan kepadaku [Hafshah] dari [Ummu Athiah] sebagaimana hadits Muhammad. Dalam hadits Hafshah disebutkan, \"mandikanlah ia dengan bilangan ganjil, \" dalam hadits itu disebutkan, \"Mandikanlah ia tiga kali atau lima kali, \" juga dengan lafadz, \"mulailah dari sebelah kanan dan tempat-tempat wudlu. \" Dalam hadits itu juga disebutkan bahwa Ummu Athiah berkata, \"dan kami menyisir rambutnya dalam tiga ekor kuda. \""
            },
            {
                "number": 1416,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ عَنْ ابْنِ جُرَيْجٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ قَالَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُبْرِزْ فَخِذَكَ وَلَا تَنْظُرْ إِلَى فَخِذِ حَيٍّ وَلَا مَيِّتٍ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Adam] berkata, telah menceritakan kepada kami [Rauh bin Ubadah] dari [Ibnu Juraij] dari [Habib bin Abu Tsabit] dari [Ashim bin Dlamrah] dari [Ali] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda kepadaku: \"Jangan engkau perlihatkan pahamu, dan janganlah engkau lihat paha orang yang masih hidup atau yang telah meninggal. \""
            },
            {
                "number": 1417,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ مُبَشِّرِ بْنِ عُبَيْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُغَسِّلْ مَوْتَاكُمْ الْمَأْمُونُونَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa Al Himshi] berkata, telah menceritakan kepada kami [Baqiyyah bin Al Walid] dari [Mubasysyir bin Ubaid] dari [Zaid bin Aslam] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang memandikan mayat hendaknya orang-orang yang dapat dipercaya. \""
            },
            {
                "number": 1418,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ حَدَّثَنَا عَبَّادُ بْنُ كَثِيرٍ عَنْ عَمْرِو بْنِ خَالِدٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ غَسَّلَ مَيِّتًا وَكَفَّنَهُ وَحَنَّطَهُ وَحَمَلَهُ وَصَلَّى عَلَيْهِ وَلَمْ يُفْشِ عَلَيْهِ مَا رَأَى خَرَجَ مِنْ خَطِيئَتِهِ مِثْلَ يَوْمِ وَلَدَتْهُ أُمُّهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami ['Abdurrahman Al Muharibi] berkata, telah menceritakan kepada kami ['Abbad bin Katsir] dari [Amru bin Khalid] dari [Habib bin Abu Tsabit] dari ['Ashim bin Dlamrah] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memandikan mayit, mengafani, memberinya minyak, memanggul dan mensholatkannya, dan ia tidak menyebarkan apa yang dilihatnya, maka semua dosanya akan keluar sebagaimana hari ia dilahirkan oleh ibunya. \" "
            },
            {
                "number": 1419,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ غَسَّلَ مَيِّتًا فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] berkata, telah menceritakan kepada kami [Abdul Aziz Ibnul Mukhtar] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memandikan mayat hendaklah ia mandi. \""
            },
            {
                "number": 1420,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ الذَّهَبِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْلَوْ كُنْتُ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا غَسَّلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ نِسَائِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Ahmad bin Khalid Adz Dzahabi] berkata, telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yahya bin 'Abbad bin Abdullah bin Zubair] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Jika aku berhadapan dengan urusanku maka aku tidak akan berpaling. Dan tidak akan ada yang memandikan Nabi shallallahu 'alaihi wasallam selain dari isteri-isterinya. \""
            },
            {
                "number": 1421,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَائِشَةَ قَالَتْرَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْبَقِيعِ فَوَجَدَنِي وَأَنَا أَجِدُ صُدَاعًا فِي رَأْسِي وَأَنَا أَقُولُ وَا رَأْسَاهُ فَقَالَ بَلْ أَنَا يَا عَائِشَةُ وَا رَأْسَاهُ ثُمَّ قَالَ مَا ضَرَّكِ لَوْ مِتِّ قَبْلِي فَقُمْتُ عَلَيْكِ فَغَسَّلْتُكِ وَكَفَّنْتُكِ وَصَلَّيْتُ عَلَيْكِ وَدَفَنْتُكِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Ya'qub bin Utbah] dari [Az Zuhri] dari [ubaidhullah bin Abdullah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam kembali dari Baqi' dan mendapatiku sakit kepala, aku bergumam, \"Duh.. kepalaku! \" Beliau pun bersabda: \"Wahai 'Aisyah, aku juga merasakannya. \" kemudian beliau bersabda: \"Tidak ada bahaya sekiranya kamu meninggal sebelumku, aku akan mengurusimu, memandikan, mengafani, mensholatkan dan menguburkanmu. \""
            },
            {
                "number": 1422,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ الْأَزْهَرِ الْوَاسِطِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا أَبُو بُرْدَةَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَلَمَّا أَخَذُوا فِي غُسْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَادَاهُمْ مُنَادٍ مِنْ الدَّاخِلِ لَا تَنْزِعُوا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَمِيصَهُ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Yahya bin Al Azhar Al Wasithi] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Abu Burdah] dari [Alqamah bin Martsad] dari [Ibnu Buraidah] dari [Bapaknya] ia berkata, \"Ketika mereka akan memandikan Nabi shallallahu 'alaihi wasallam, tiba-tiba dari dalam ada seseorang yang berseru: \"Jangan kalian lepas gamis Rasulullah shallallahu 'alaihi wasallam. \" "
            },
            {
                "number": 1423,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خِذَامٍ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَلَمَّا غَسَّلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ يَلْتَمِسُ مِنْهُ مَا يَلْتَمِسُ مِنْ الْمَيِّتِ فَلَمْ يَجِدْهُ فَقَالَ بِأَبِي الطَّيِّبُ طِبْتَ حَيًّا وَطِبْتَ مَيِّتًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Khidzam] berkata, telah menceritakan kepada kami [Shafwan bin Isa] berkata, telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Ali bin Abu Thalib] ia berkata, \"Ketika Ali memandikan Nabi shallallahu 'alaihi wasallam, ia mencari sesuatu yang biasa di cari pada mayit yang lain (kotoran), tetapi ia tidak mendapatinya. Ia lantas berkata, \"Demi ayahku, engkau baik dalam di masa hidup dan matimu. \" "
            },
            {
                "number": 1424,
                "arab": "حَدَّثَنَا عَبَّادُ بْنُ يَعْقُوبَ حَدَّثَنَا الْحُسَيْنُ بْنُ زَيْدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيٍّ عَنْ إِسْمَعِيلَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَنَا مُتُّ فَاغْسِلُونِي بِسَبْعِ قِرَبٍ مِنْ بِئْرِي بِئْرِ غَرْسٍ",
                "id": "Telah menceritakan kepada kami ['Abbad bin Ya'qub] berkata, telah menceritakan kepada kami [Al Husain bin Zaid bin Ali bin Al Husain bin Ali] dari [Isma'il bin Abdullah bin Ja'far] dari [Bapaknya] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika aku meninggal, maka mandikanlah aku dengan tujuh geriba dari air sumurku, sumur Ghars. \""
            },
            {
                "number": 1425,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُفِّنَ فِي ثَلَاثَةِ أَثْوَابٍ بِيضٍ يَمَانِيَةٍ لَيْسَ فِيهَا قَمِيصٌ وَلَا عِمَامَةٌ فَقِيلَ لِعَائِشَةَ إِنَّهُمْ كَانُوا يَزْعُمُونَ أَنَّهُ قَدْ كَانَ كُفِّنَ فِي حِبَرَةٍ فَقَالَتْ عَائِشَةُ قَدْ جَاءُوا بِبُرْدِ حِبَرَةٍ فَلَمْ يُكَفِّنُوهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam dikafani dengan tiga lapis kain putih dari Yaman, tanpa gamis dan imamah (semacam surban yang dililitkan pada kepala). \" Dikatakan kepada 'Aisyah, \"Mereka mengklaim bahwa beliau dikafani dengan kain hibrah (kain yang direnda dengan benang sutera)! \" 'Aisyah berkata, \"Mereka memang datang dengan membawa selendang hibrah, namun mereka tidak mengafani dengannya. \""
            },
            {
                "number": 1426,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ قَالَ هَذَا مَا سَمِعْتُ مِنْ أَبِي مُعَيْدٍ حَفْصِ بْنِ غَيْلَانَ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَكُفِّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثِ رِيَاطٍ بِيضٍ سُحُولِيَّةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Khalaf Al 'Asqalani] berkata, telah menceritakan kepada kami [Amru bin Abu Salamah] ia berkata; inilah yang aku dengar dari [Abu Mu'aid Hafsh bin Ghailan] dari [Sulaiman bin Musa] dari [Nafi'] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam dikafani dengan tiga lapis kain putih yang ditenun dari kapas. \" "
            },
            {
                "number": 1427,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَكُفِّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثَةِ أَثْوَابٍ قَمِيصُهُ الَّذِي قُبِضَ فِيهِ وَحُلَّةٌ نَجْرَانِيَّةٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Yazid bin Abu Ziyad] dari [Al Hakam] dari [Miqsam] dari [Ibnu Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam dikafani dengan tiga lapis kain, kain yang beliau kenakan ketika meninggal dan kain dari Najran. \""
            },
            {
                "number": 1428,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ ثِيَابِكُمْ الْبَيَاضُ فَكَفِّنُوا فِيهَا مَوْتَاكُمْ وَالْبَسُوهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Abdullah bin Raja` Al Makki] dari [Abdullah bin Utsman bin Khutsaim] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik pakaian kalian adalah putih, kafanilah mayat kalian dengan warna itu, dan kenakanlah. \" "
            },
            {
                "number": 1429,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا ابْنُ وَهْبٍ أَنْبَأَنَا هِشَامُ بْنُ سَعْدٍ عَنْ حَاتِمِ بْنِ أَبِي نَصْرٍ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ أَبِيهِ عَنْ عُبَادَةَ بْنِ الصَّامِتِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ الْكَفَنِ الْحُلَّةُ",
                "id": "Telah menceritakan kepada kami [Yunus bin Abdul A'la] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah memberitakan kepada kami [Hisyam bin Sa'd] dari [Hatim bin Abu Nashr] dari [Ubadah bin Nusai] dari [Bapaknya] dari [Ubadah bin Ash Shamit] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sebaik-baik kafan adalah pakaian. \""
            },
            {
                "number": 1430,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي قَتَادَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَلِيَ أَحَدُكُمْ أَخَاهُ فَلْيُحْسِنْ كَفَنَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Umar bin Yunus] berkata, telah menceritakan kepada kami [Ikrimah bin Ammar] dari [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Abu Qatadah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian dipercaya mengurusi kafan saudaranya, maka hendaklah ia perbagus. \" "
            },
            {
                "number": 1431,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ سَمُرَةَ حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ حَدَّثَنَا أَبُو شَيْبَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا قُبِضَ إِبْرَاهِيمُ ابْنُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُدْرِجُوهُ فِي أَكْفَانِهِ حَتَّى أَنْظُرَ إِلَيْهِ فَأَتَاهُ فَانْكَبَّ عَلَيْهِ وَبَكَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il bin Samurah] berkata, telah menceritakan kepada kami [Muhammad bin Al Hasan] berkata, telah menceritakan kepada kami [Abu Syaibah] dari [Anas bin Malik] ia berkata, \"Ketika Ibrahim putra Nabi shallallahu 'alaihi wasallam wafat, beliau bersabda kepada para sahabatnya: \"Jangan kalian bungkus dengan kafan hingga aku melihatnya. \" Kemudian beliau mendatanginya dan memeluk sambil menangis. \""
            },
            {
                "number": 1432,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ حَبِيبِ بْنِ سُلَيْمٍ عَنْ بِلَالِ بْنِ يَحْيَى قَالَكَانَ حُذَيْفَةُ إِذَا مَاتَ لَهُ الْمَيِّتُ قَالَ لَا تُؤْذِنُوا بِهِ أَحَدًا إِنِّي أَخَافُ أَنْ يَكُونَ نَعْيًا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأُذُنَيَّ هَاتَيْنِ يَنْهَى عَنْ النَّعْيِ",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Abdullah Ibnul Mubarak] dari [Habib bin Sulaim] dari [Bilal bin Yahya] berkata, [Hudzifah] berkata, \"Jika ada yang meninggal dunia jangan kalian sebarkan kepada seorang pun, aku khawatir itu akan menjadi ni'ayah (ratapan). Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda dengan kedua telingaku ini bahwa beliau melarang ni'ayah. \""
            },
            {
                "number": 1433,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْرِعُوا بِالْجِنَازَةِ فَإِنْ تَكُنْ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ وَإِنْ تَكُنْ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Hisyam bin Ammar] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersegeralah dalam membawa jenazah, jika ia orang shalih maka engkau telah menyegerakan suatu kebaikan. Jika ia bukan orang shalih, maka kalian telah meletakkan keburukan dari pundak kalian. \""
            },
            {
                "number": 1434,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ مَنْصُورٍ عَنْ عُبَيْدِ بْنِ نِسْطَاسٍ عَنْ أَبِي عُبَيْدَةَ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍمَنْ اتَّبَعَ جِنَازَةً فَلْيَحْمِلْ بِجَوَانِبِ السَّرِيرِ كُلِّهَا فَإِنَّهُ مِنْ السُّنَّةِ ثُمَّ إِنْ شَاءَ فَلْيَتَطَوَّعْ وَإِنْ شَاءَ فَلْيَدَعْ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Manshur] dari [Ubaid bin Nisthas] dari [Abu Ubaidah] ia berkata; [Abdullah bin Mas'ud] berkata, \"Barangsiapa mengiring jenazah hendaklah ia panggul pada setiap sisinya karena hal itu termasuk sunnah, Barangsiapa mau memanggulnya hendaklah ia lakukan, dan jika tidak ia boleh meninggalkannya. \" "
            },
            {
                "number": 1435,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ عَقِيلٍ حَدَّثَنَا بِشْرُ بْنُ ثَابِتٍ حَدَّثَنَا شُعْبَةُ عَنْ لَيْثٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ رَأَى جِنَازَةً يُسْرِعُونَ بِهَا قَالَ لِتَكُنْ عَلَيْكُمْ السَّكِينَةُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid bin Aqil] berkata, telah menceritakan kepada kami [Bisyr bin Tsabit] berkata, telah menceritakan kepada kami [Syu'bah] dari [Laits] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau melihat orang-orang membawa jenazah dengan tergesa-gesa, maka beliau bersabda: \"Hendaklah kalian tenang dalam membawa. \" "
            },
            {
                "number": 1436,
                "arab": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنْ رَاشِدِ بْنِ سَعْدٍ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَرَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاسًا رُكْبَانًا عَلَى دَوَابِّهِمْ فِي جِنَازَةٍ فَقَالَ أَلَا تَسْتَحْيُونَ أَنَّ مَلَائِكَةَ اللَّهِ يَمْشُونَ عَلَى أَقْدَامِهِمْ وَأَنْتُمْ رُكْبَانٌ",
                "id": "Telah menceritakan kepada kami [Katsir bin Ubaid Al Himshi], telah menceritakan kepada kami [Baqiyah bin Al Walid] dari [Abu Bakr bin Abu Maryam] dari [Rasyid bin Sa'd] dari [Tsauban] mantan budak Rasulullah shallallahu 'alaihi wasallam, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melihat orang-orang mengendarai kendaraan ketika mengantar jenazah, maka beliau bersabda: \"Apakah kalian tidak malu, Malaikat Allah berjalan dengan kaki sementara kalian berkendaraan. \""
            },
            {
                "number": 1437,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ بْنِ جُبَيْرِ بْنِ حَيَّةَ حَدَّثَنِي زِيَادُ بْنُ جُبَيْرِ بْنِ حَيَّةَ سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرَّاكِبُ خَلْفَ الْجِنَازَةِ وَالْمَاشِي مِنْهَا حَيْثُ شَاءَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Rauh bin Ubadah] berkata, telah menceritakan kepada kami [Sa'id bin ubaidhullah bin Jubair bin Hayyah] berkata, telah menceritakan kepada kami [Ziyad bin Jubair bin Hayyah] bahwa ia mendengar [Al Mughirah bin Syu'bah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah yang berkendaraan di belakang jenazah, adapun yang berjalan kaki bisa sekehendaknya. \""
            },
            {
                "number": 1438,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَهِشَامُ بْنُ عَمَّارٍ وَسَهْلُ بْنُ أَبِي سَهْلٍ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجِنَازَةِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Hisyam bin Ammar] dan [Sahl bin Abu Sahl] mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [Bapaknya] ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam, Abu Bakar dan Umar berjalan di depan jenazah. \""
            },
            {
                "number": 1439,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ أَنْبَأَنَا يُونُسُ بْنُ يَزِيدَ الْأَيْلِيُّ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ يَمْشُونَ أَمَامَ الْجِنَازَةِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] dan [Harun bin Abdullah Al Hammal] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Bakr Al Bursani] berkata, telah memberitakan kepada kami [Yunus bin Yazid Al Aili] dari [Az-Zuhri] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, Umar dan Utsman selalu berjalan di depan jenazah. \""
            },
            {
                "number": 1440,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ التَّيْمِيِّ عَنْ أَبِي مَاجِدَةَ الْحَنَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجِنَازَةُ مَتْبُوعَةٌ وَلَيْسَتْ بِتَابِعَةٍ لَيْسَ مِنْهَا مَنْ تَقَدَّمَهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] berkata, telah memberitakan kepada kami [Abdul Wahid bin Ziyad] dari [Yahya bin Abdullah At Taimi] dari [Abu Majidah Al Hanafi] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam: \"Jenazah itu diikuti dan tidak mengikuti. Maka tidak boleh ada yang mendahuluinya. \""
            },
            {
                "number": 1441,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَخْبَرَنِي عَمْرُو بْنُ النُّعْمَانِ حَدَّثَنَا عَلِيُّ بْنُ الْحَزَوَّرِ عَنْ نُفَيْعٍ عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ وَأَبِي بَرْزَةَ قَالَاخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جِنَازَةٍ فَرَأَى قَوْمًا قَدْ طَرَحُوا أَرْدِيَتَهُمْ يَمْشُونَ فِي قُمُصٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبِفِعْلِ الْجَاهِلِيَّةِ تَأْخُذُونَ أَوْ بِصُنْعِ الْجَاهِلِيَّةِ تَشَبَّهُونَ لَقَدْ هَمَمْتُ أَنْ أَدْعُوَ عَلَيْكُمْ دَعْوَةً تَرْجِعُونَ فِي غَيْرِ صُوَرِكُمْ قَالَ فَأَخَذُوا أَرْدِيَتَهُمْ وَلَمْ يَعُودُوا لِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah memberitakan kepada kami [Amru bin An Nu'man] berkata, telah menceritakan kepada kami [Ali bin Al Hazawwar] dari [Nufai'] dari [Imran bin Hushain] dan [Abu Barzah] keduanya berkata; \"Kami bersama Rasulullah shallallahu 'alaihi wasallam mengantar jenazah. Lalu Beliau melihat sekelompok orang yang melepaskan mantel-mantel mereka dan berjalan dengan gamis, beliau bersabda: \"Apakah tingkah laku jahiliyyah yang kalian praktikkan atau kalian meniru perbuatan jahiliyah? Sungguh, aku berkeinginan sekali mendo'akan kalian (laknat) hingga kalian kembali bukan dengan wajah-wajah kalian. \" Imran berkata, \"Kemudian mereka mengambil kembali mantel-mantel mereka dan tidak mengulanginya lagi. \""
            },
            {
                "number": 1442,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي سَعِيدُ بْنُ عَبْدِ اللَّهِ الْجُهَنِيُّ أَنَّ مُحَمَّدَ بْنَ عُمَرَ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ جَدِّهِ عَلِيِّ بْنِ أَبِي طَالِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُؤَخِّرُوا الْجِنَازَةَ إِذَا حَضَرَتْ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Sa'id bin Abdullah Al Juhani] bahwa [Muhammad bin Umar bin Ali bin Abu Thalib] menceritakan kepadanya dari [Bapaknya] dari kakeknya [Ali bin Abu Thalib] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian akhirkan jenazah jika telah tiba. \""
            },
            {
                "number": 1443,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ أَنْبَأَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ قَالَ قَرَأْتُ عَلَى الْفُضَيْلِ بْنِ مَيْسَرَةَ عَنْ أَبِي حَرِيزٍ أَنَّ أَبَا بُرْدَةَ حَدَّثَهُ قَالَأَوْصَى أَبُو مُوسَى الْأَشْعَرِيُّ حِينَ حَضَرَهُ الْمَوْتُ فَقَالَ لَا تُتْبِعُونِي بِمِجْمَرٍ قَالُوا لَهُ أَوَ سَمِعْتَ فِيهِ شَيْئًا قَالَ نَعَمْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul A'la Ash Shan'ani] berkata, telah memberitakan kepada kami [Mu'tamar bin Sulaiman] ia berkata; aku telah membacakan di hadapan [Al Fudlail bin Maisarah] dari [Abu Hariz] bahwa [Abu Burdah] menceritakan kepadanya, ia berkata; \"Menjelang kematiannya [Abu Musa Al Asy'ari] berwasiat, \"Janganlah kalian mengiringi aku dengan dupa api. \" Orang-orang bertanya: \"Apakah engkau mendengar sesuatu (hadits) tentang itu?\" ia menjawab, \"Ya, dari Rasulullah shallallahu 'alaihi wasallam. \" "
            },
            {
                "number": 1444,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ أَنْبَأَنَا شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى عَلَيْهِ مِائَةٌ مِنْ الْمُسْلِمِينَ غُفِرَ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [ubaidhullah] berkata, telah memberitakan kepada kami [Syaiban] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa seratus orang kaum muslimin mensholatkan jenazahnya, maka ia akan diampuni. \""
            },
            {
                "number": 1445,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا بَكْرُ بْنُ سُلَيْمٍ حَدَّثَنِي حُمَيْدُ بْنُ زِيَادٍ الْخَرَّاطُ حَدَّثَنَا شَرِيكٌ عَنْ كُرَيْبٍ مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَهَلَكَ ابْنٌ لِعَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقَالَ لِي يَا كُرَيْبُ قُمْ فَانْظُرْ هَلْ اجْتَمَعَ لِابْنِي أَحَدٌ فَقُلْتُ نَعَمْ فَقَالَ وَيْحَكَ كَمْ تَرَاهُمْ أَرْبَعِينَ قُلْتُ لَا بَلْ هُمْ أَكْثَرُ قَالَ فَاخْرُجُوا بِابْنِي فَأَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ أَرْبَعِينَ مِنْ مُؤْمِنٍ يَشْفَعُونَ لِمُؤْمِنٍ إِلَّا شَفَّعَهُمْ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Ibrahim Ibnul Mundzir Al Hizami] berkata, telah menceritakan kepada kami [Bakr bin Muslim] berkata, telah menceritakan kepadaku [Humaid bin Ziyad Al Kharrath] berkata, telah menceritakan kepada kami [Syarik] dari [Kuraib] mantan budak Abdullah bin Abbas, ia berkata, \"Anak Abdullah bin Abbas meninggal, lalu ia ([Abdullah bin Abbas]) berkata kepadaku, \"Wahai Kuraib, berdiri dan lihatlah, apakah sudah ada yang berkumpul untuk (mensholati) anakku meskipun hanya seorang?\" aku menjawab, \"Ya, \" ia berkata, \"Celaka kamu, berapa orang yang kami lihat, empat puluh orang?\" aku menjawab, \"Tidak, bahkan jumlah mereka lebih banyak. \" Ia berkata, \"kalau begitu keluarlah dengan (jenazah) anakku, aku bersaksi bahwa aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah empat puluh orang mukmin memintakan syafa'at untuk seorang mukmin, kecuali Allah akan memberi syafa'at kepada mereka. \""
            },
            {
                "number": 1446,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ عَنْ مَالِكِ بْنِ هُبَيْرَةَ الشَّامِيِّ وَكَانَتْ لَهُ صُحْبَةٌ قَالَكَانَ إِذَا أُتِيَ بِجِنَازَةٍ فَتَقَالَّ مَنْ تَبِعَهَا جَزَّأَهُمْ ثَلَاثَةَ صُفُوفٍ ثُمَّ صَلَّى عَلَيْهَا وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا صَفَّ صُفُوفٌ ثَلَاثَةٌ مِنْ الْمُسْلِمِينَ عَلَى مَيِّتٍ إِلَّا أَوْجَبَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Numair] dari [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari [Martsad bin Abdullah Al Yazani] dari [Malik bin Hubairah Asy Syami] -ia adalah seorang sahabat- berkata, \"Jika Malik bin Hubairah didatangkan jenazah kepadanya dan hanya sedikit orang yang akan mensholatkannya, maka ia membagi shaf menjadi tiga baris kemudian sholat. Setelah itu ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Tidaklah tiga shaf kaum muslimin berjajar mensholati jenazah, kecuali telah wajib (pengampunan Allah atas mayit). \""
            },
            {
                "number": 1447,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَمُرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجِنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا فَقَالَ وَجَبَتْ ثُمَّ مُرَّ عَلَيْهِ بِجِنَازَةٍ فَأُثْنِيَ عَلَيْهَا شَرًّا فَقَالَ وَجَبَتْ فَقِيلَ يَا رَسُولَ اللَّهِ قُلْتَ لِهَذِهِ وَجَبَتْ وَلِهَذِهِ وَجَبَتْ فَقَالَ شَهَادَةُ الْقَوْمِ وَالْمُؤْمِنُونَ شُهُودُ اللَّهِ فِي الْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas bin Malik] berkata; Ada satu jenazah yang melintas di hadapan Nabi shallallahu 'alaihi wasallam, lalu jenazah itu dipuji dengan suatu kebaikan, maka beliau pun bersabda: \"Telah wajib (baginya surga). \" Setelah itu ada lagi jenazah lain yang lewat di hadapannya, lalu jenazah tersebut dipuji dengan suatu keburukan, maka beliau pun bersabda: \"Telah wajib (baginya neraka). \" lalu ditanyakan kepada beliau, \"Wahai Rasulullah, engkau katakan untuk jenazah ini, \"Telah wajib, \" dan untuk jenazah ini, \"Telah wajib! \" beliau menjawab: \"Persaksian orang-orang dan kaum muslimin adalah persaksian Allah di muka bumi. \""
            },
            {
                "number": 1448,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَمُرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجِنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا فِي مَنَاقِبِ الْخَيْرِ فَقَالَ وَجَبَتْ ثُمَّ مَرُّوا عَلَيْهِ بِأُخْرَى فَأُثْنِيَ عَلَيْهَا شَرًّا فِي مَنَاقِبِ الشَّرِّ فَقَالَ وَجَبَتْ إِنَّكُمْ شُهَدَاءُ اللَّهِ فِي الْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ali bin Mushir] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Ada satu jenazah lewat di hadapan Nabi shallallahu 'alaihi wasallam, lalu jenazah tersebut dipuji dengan suatu kebaikan, maka beliau pun bersabda: \"Telah wajib (baginya surga). \" Setelah itu ada lagi jenazah lain yang lewat di hadapannya, lalu jenazah tersebut dipuji dengan suatu keburukan, maka beliau pun bersabda: \"Telah wajib (baginya neraka). Sesungguhnya kalian adalah para saksi Allah di muka bumi. \""
            },
            {
                "number": 1449,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ الْحُسَيْنُ بْنُ ذَكْوَانَ أَخْبَرَنِي عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ الْأَسْلَمِيِّ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ الْفَزَارِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ وَسَطَهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Usamah] berkata, telah mengabarkan kepadaku [Al Husain bin Dzakwan] dari [Abdullah bin Buraidah Al Aslami] dari [Samurah bin Jundub Al Fazari] berkata, \"Rasulullah shallallahu 'alaihi wasallam mensholati seorang wanita yang meninggal di saat nifas, lalu beliau berdiri di tengah-tengahnya. \""
            },
            {
                "number": 1450,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ هَمَّامٍ عَنْ أَبِي غَالِبٍ قَالَرَأَيْتُ أَنَسَ بْنَ مَالِكٍ صَلَّى عَلَى جِنَازَةِ رَجُلٍ فَقَامَ حِيَالَ رَأْسِهِ فَجِيءَ بِجِنَازَةٍ أُخْرَى بِامْرَأَةٍ فَقَالُوا يَا أَبَا حَمْزَةَ صَلِّ عَلَيْهَا فَقَامَ حِيَالَ وَسَطِ السَّرِيرِ فَقَالَ الْعَلَاءُ بْنُ زِيَادٍ يَا أَبَا حَمْزَةَ هَكَذَا رَأَيْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ مِنْ الْجِنَازَةِ مُقَامَكَ مِنْ الرَّجُلِ وَقَامَ مِنْ الْمَرْأَةِ مُقَامَكَ مِنْ الْمَرْأَةِ قَالَ نَعَمْ فَأَقْبَلَ عَلَيْنَا فَقَالَ احْفَظُوا",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Sa'id bin Amir] dari [Hammam] dari [Abu Ghalib] ia berkata, \"Aku pernah melihat [Anas bin Malik] mensholati jenazah laki-laki. Lalu berdiri di sisi kepalanya. Kemudian di datangkan jenazah perempuan, orang-orang berkata, \"Wahai Abu Hamzah, sholatlah untuknya. \" Lalu ia berdiri di bagian tengah keranda. \" Al 'Ala bin Ziyad berkata, \"Wahai Abu Hamzah, seperti posisimu inikah engkau melihat Rasulullah shallallahu 'alaihi wasallam mensholati jenazah laki-laki dan jenazah perempuan?\" ia menjawab, \"Benar. \" Kemudian ia menghadap ke arah kami seraya berkata, \"Jagalah. \""
            },
            {
                "number": 1451,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ عَلَى الْجِنَازَةِ بِفَاتِحَةِ الْكِتَابِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Zaid bin Al Hubab] berkata, telah menceritakan kepada kami [Ibrahim bin Utsman] dari [Al Hakam] dari [Miqsam] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam dalam sholat jenazah membaca Al Fatihah. \""
            },
            {
                "number": 1452,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ أَبِي عَاصِمٍ النَّبِيلُ وَإِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ قَالَا حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا حَمَّادُ بْنُ جَعْفَرٍ الْعَبْدِيُّ حَدَّثَنِي شَهْرُ بْنُ حَوْشَبٍ حَدَّثَتْنِي أُمُّ شَرِيكٍ الْأَنْصَارِيَّةُ قَالَتْأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَقْرَأَ عَلَى الْجِنَازَةِ بِفَاتِحَةِ الْكِتَابِ",
                "id": "Telah menceritakan kepada kami [Amru bin Abu 'Ashim An Nabil] dan [Ibrahim bin Al Mustamir] keduanya berkata; telah menceritakan kepada kami [Abu 'Ashim] berkata, telah menceritakan kepada kami [Hammad bin Ja'far Al 'Abdi] berkata, telah menceritakan kepadaku [Syahr bin Hausyab] berkata, telah menceritakan kepadaku [Ummu Syarik Al Anshariah] ia berkata, \"Ketika sholat jenazah Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk membaca surat Al Fatihah. \" "
            },
            {
                "number": 1453,
                "arab": "حَدَّثَنَا أَبُو عُبَيْدٍ مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ الْمَدِينِيِّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْحَرَّانِيُّ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا صَلَّيْتُمْ عَلَى الْمَيِّتِ فَأَخْلِصُوا لَهُ الدُّعَاءَ",
                "id": "Telah menceritakan kepada kami [Abu Ubaid Muhammad bin Ubaid bin Maimun Al Madini] berkata, telah menceritakan kepada kami [Muhammad bin Salamah Al Harrani] dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim bin Al Harits At Taimi] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian mensholati mayit, maka ikhlaskanlah ketika berdo'a untuknya. \" "
            },
            {
                "number": 1454,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى عَلَى جِنَازَةٍ يَقُولُ اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِسْلَامِ وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الْإِيمَانِ اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ وَلَا تُضِلَّنَا بَعْدَهُ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Ali bin Mushar] dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam jika melakukan sholat jenazah selalu membaca berdo'a: \"ALLAHUMMAGHFIR LIHAYYINAA, WA MAYYITINAA, WA SYAAHIDINAA, WA GHAA`IBINAA, WA SHAGHIIRINAA, WA KABIIRINAA, WA DZAKARINAA, WA UNTSAANAA, ALLAHUMMA MAN AHYAITAHU MINNAA FA AHYIHI 'ALAL ISLAAM, WA MAN TAWAFFAITAHU MINNAA FA TAWAFFAHU 'ALAL IIMAAN, ALLAHUMMA LAA TAHRIMNA AJRAHU, WA LAA TUDLILLANAA BA'DAHU (Ya Allah, ampunilah kami yang masih hidup, yang telah meninggal dari kami, yang masih ada, yang telah tiada, anak kecil kami, orang tua kami, lelaki kami, perempuan kami. Ya Allah, siapa saja yang Engkau hidupkan dari kami, maka hidupkanlah di atas Islam, dan siapa saja yang Engkau wafatkan dari kami, maka wafatkanlah di atas iman. Ya Allah, janganlah Engkau haramkan bagi kami pahalanya, dan janganlah Engkau sesatkan kami sepeninggalnya. \""
            },
            {
                "number": 1455,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا مَرْوَانُ بْنُ جَنَاحٍ حَدَّثَنِي يُونُسُ بْنُ مَيْسَرَةَ بْنِ حَلْبَسٍ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَجُلٍ مِنْ الْمُسْلِمِينَ فَأَسْمَعُهُ يَقُولُ اللَّهُمَّ إِنَّ فُلَانَ بْنَ فُلَانٍ فِي ذِمَّتِكَ وَحَبْلِ جِوَارِكَ فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ فَاغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Marwan bin Janah] berkata, telah menceritakan kepadaku [Yunus bin Maisarah bin Halbas] dari [Watsilah Ibnul Asqa'] berkata; Rasulullah shallallahu 'alaihi wasallam mensholati seorang laki-laki dari kaum muslimin, lalu aku mendengar beliau mengatakan: \"ALLAHUMMA INNA FULAN BIN FULAN FII DZIMMATIKA WA HABLI JIWAARIKA FAQIHI MIN FITNATIL QABRI WA 'ADZAABIN NAAR WA ANTA AHLUL WAFA` WAL HAQ FAGHFIRLAHU WARHAMHU INNAKA ANTAL GHAFUURUR RAHIIM (Ya Allah, sesungguhnya fulan bin fulan berada dalam jaminan dan perjanjian-Mu, maka jagalah ia dari fitnah kubur dan siksa neraka. Engkau Maha menepati janji dan Maha benar, ampuni dan sayangilah ia. Sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang). \""
            },
            {
                "number": 1456,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا فَرَجُ بْنُ الْفَضَالَةِ حَدَّثَنِي عِصْمَةُ بْنُ رَاشِدٍ عَنْ حَبِيبِ بْنِ عُبَيْدٍ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى رَجُلٍ مِنْ الْأَنْصَارِ فَسَمِعْتُهُ يَقُولُ اللَّهُمَّ صَلِّ عَلَيْهِ وَاغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَاغْسِلْهُ بِمَاءٍ وَثَلْجٍ وَبَرَدٍ وَنَقِّهِ مِنْ الذُّنُوبِ وَالْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنْ الدَّنَسِ وَأَبْدِلْهُ بِدَارِهِ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِقَالَ عَوْفٌ فَلَقَدْ رَأَيْتُنِي فِي مُقَامِي ذَلِكَ أَتَمَنَّى أَنْ أَكُونَ مَكَانَ الرَّجُلِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Dawud Ath Thayalisi] berkata, telah menceritakan kepada kami [Faraj Ibnul Fadlalah] berkata, telah menceritakan kepadaku [Ishmah bin Rasyid] dari [Habib bin Ubaid] dari [Auf bin Malik] ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam mensholati seorang laki-laki Anshar, lalu aku mendengar beliau mengucapkan: \"ALLAHUMMA SHALLI 'ALAIHI WAGHFIRLAHU WARHAMHU WA 'AAFIHI WA'FU 'ANHU WAGHSILHU BI MA`IN WA TSALJIN WA BARADIN WA NAQQIHI MINADZ DZUNUUBI WAL KHATHAAYA KAMAA YUNAQQTS TSAUBUL ABYADLU MINAD DANAS WA ABDILHU BI DAARIHI WA AHLAN KHAIRAN MIN AHLIHI WAQIHI FITNATAL QABRI WA 'ADZAABAN NAAR (Ya Allah, bershalawatlah untuknya, ampuni dan rahmatilah dia, selamatkan dan maafkan kesalahannya. Mandikan dia dengan air dan es, bersihkanlah dia dari dosa dan kesalahan sebagaimana baju putih dibersihkan dari noda. Gantilah rumahnya dengan rumah yang lebih baik, dan keluarganya dengan keluarga yang lebih baik. Jagalah dia dari fitnah kubur dan siksa neraka. \" Auf berkata, \"Aku melihat posisiku hingga aku berharap sekiranya laki-laki itu adalah aku. \""
            },
            {
                "number": 1457,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ حَجَّاجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَمَا أَبَاحَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا أَبُو بَكْرٍ وَلَا عُمَرُ فِي شَيْءٍ مَا أَبَاحُوا فِي الصَّلَاةِ عَلَى الْمَيِّتِ يَعْنِي لَمْ يُوَقِّتْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Hajjaj] dari [Abu Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam, Abu Bakar dan Umar tidak pernah memperbolehkan kami dalam suatu perkara sebagaimana pembolehannya dalam sholat jenazah. Maksudnya adalah tidak membatasi waktunya (boleh kapan saja). \" "
            },
            {
                "number": 1458,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا خَالِدُ بْنُ الْإِيَاسِ عَنْ إِسْمَعِيلَ بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَكَمِ بْنِ الْحَارِثِ عَنْ عُثْمَانَ بْنِ عَفَّانَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى عُثْمَانَ بْنِ مَظْعُونٍ وَكَبَّرَ عَلَيْهِ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Al Mughirah bin 'Abdurrahman] berkata, telah menceritakan kepada kami [Khalid bin Ilyas] dari [Isma'il bin Amru bin Sa'id bin Al 'Ash] dari [Utsman bin Abdullah bin Al Hakim bin Harits] dari [Utsman bin Affan] berkata, \"Nabi shallallahu 'alaihi wasallam mensholatkan Utsman bin Mazh'un dan beliau takbir sebanyak empat kali. \""
            },
            {
                "number": 1459,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ حَدَّثَنَا الْهَجَرِيُّ قَالَصَلَّيْتُ مَعَ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى الْأَسْلَمِيِّ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى جِنَازَةِ ابْنَةٍ لَهُ فَكَبَّرَ عَلَيْهَا أَرْبَعًا فَمَكَثَ بَعْدَ الرَّابِعَةِ شَيْئًا قَالَ فَسَمِعْتُ الْقَوْمَ يُسَبِّحُونَ بِهِ مِنْ نَوَاحِي الصُّفُوفِ فَسَلَّمَ ثُمَّ قَالَ أَكُنْتُمْ تَرَوْنَ أَنِّي مُكَبِّرٌ خَمْسًا قَالُوا تَخَوَّفْنَا ذَلِكَ قَالَ لَمْ أَكُنْ لِأَفْعَلَ وَلَكِنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُكَبِّرُ أَرْبَعًا ثُمَّ يَمْكُثُ سَاعَةً فَيَقُولُ مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ يُسَلِّمُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami ['Abdurrahman Al Muharibi] berkata, telah menceritakan kepada kami [Al Hajari] berkata; Aku bersama [Abdullah bin Abu Aufa Al Aslami] - seorang sahabat Rasulullah shallallahu 'alaihi wasallam- mensholati jenazah anak wanitanya. Ia bertakbir sebanyak empat kali kemudian diam sejenak. \" Al Hajari berkata, \"Aku lalu mendengar orang-orang mengucapkan tasbih (mengingatkan imam) dari sudut-sudut shaf, maka Abdullah bin Abu Aufa Al Aslami salam setelah itu berkata, \"Apakah kalian mengira aku akan takbir yang kelima! \" mereka berkata, \"Itulah yang kami khawatirkan. \" Ia berkata, \"Aku tidak akan melakukannya, Rasulullah shallallahu 'alaihi wasallam hanya bertakbir empat kali, lalu diam sesaat. Setelah itu beliau mengatakan atas kehendak Allah apa yang ia katakan, kemudian salam. \""
            },
            {
                "number": 1460,
                "arab": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ وَمُحَمَّدُ بْنُ الصَّبَّاحِ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ عَنْ الْمِنْهَالِ بْنِ خَلِيفَةَ عَنْ حَجَّاجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Abu Hisyam Ar Rifa'I] dan [Muhammad bin Ash Shabbah] dan [Abu Bakr bin Khallad] mereka berkata; telah menceritakan kepada kami [Yahya bin Al Yaman] dari [Al Minhal bin Khalifah] dari [Hajjaj] dari ['Atho`] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam bertakbir sebanyak empat kali. \""
            },
            {
                "number": 1461,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ وَأَبُو دَاوُدَ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَكَانَ زَيْدُ بْنُ أَرْقَمَ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَأَنَّهُ كَبَّرَ عَلَى جِنَازَةٍ خَمْسًا فَسَأَلْتُهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Ibnu Abu 'Adiy] dan [Abu Dawud] dari [Amru bin Murrah] dari ['Abdurrahman bin Abu Laila] ia berkata, \"Ketika mensholati jenazah [Zaid bin Arqam] takbir sebanyak empat kali, dan suatu ketika ia pernah mensholati jenazah lalu bertakbir lima kali, maka aku pun menanyakan hal itu kepadanya, ia menjawab, \"Rasulullah shallallahu 'alaihi wasallam pernah melakukan itu (takbir lima kali). \" "
            },
            {
                "number": 1462,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَلِيٍّ الرَّافِعِيُّ عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ خَمْسًا",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir Al Hizami] berkata, telah menceritakan kepada kami [Ibrahim bin Ali Ar Rafi'I] dari [Katsir bin Abdullah] dari [Bapaknya] dari [Kakeknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam bertakbir sebanyak lima kali. \""
            },
            {
                "number": 1463,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ بْنِ جُبَيْرِ بْنِ حَيَّةَ حَدَّثَنِي عَمِّي زِيَادُ بْنُ جُبَيْرٍ حَدَّثَنِي أَبِي جُبَيْرُ بْنُ حَيَّةَ أَنَّهُ سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الطِّفْلُ يُصَلَّى عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Rauh bin Ubadah] berkata; telah menceritakan kepada kami [Sa'id bin ubaidhullah bin Jubair bin Hayyah] berkata, telah menceritakan kepadaku pamanku [Ziyad bin Jubair] berkata, telah menceritakan kepadaku bapakku [Jubair bin Hayyah] bahwa ia pernah mendengar [Al Mughirah bin Syu'bah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak kecil itu disholatkan. \" "
            },
            {
                "number": 1464,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَهَلَّ الصَّبِيُّ صُلِّيَ عَلَيْهِ وَوُرِثَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Rabi' bin Badr] berkata, telah menceritakan kepada kami [Abu Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika bayi telah menangis, maka ia telah berhak untuk disholatkan dan diwarisi. \" "
            },
            {
                "number": 1465,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْبَخْتَرِيُّ بْنُ عُبَيْدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلُّوا عَلَى أَطْفَالِكُمْ فَإِنَّهُمْ مِنْ أَفْرَاطِكُمْ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Al Bakhtari bin 'Ubaid] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"sholatlah untuk anak-anak kalian, karena mereka telah mendahului kalian. \" "
            },
            {
                "number": 1466,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ قَالَقُلْتُ لِعَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى رَأَيْتَ إِبْرَاهِيمَ ابْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَاتَ وَهُوَ صَغِيرٌ وَلَوْ قُضِيَ أَنْ يَكُونَ بَعْدَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيٌّ لَعَاشَ ابْنُهُ وَلَكِنْ لَا نَبِيَّ بَعْدَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] berkata, telah menceritakan kepada kami [Isma'il bin Abu Khalid] ia berkata; Aku bertanya kepada [Abdullah bin Abu Aufa], \"Apa yang anda ketahui tentang Ibrahim putra Rasulullah shallallahu 'alaihi wasallam?\" ia menjawab: \"Dia meninggal ketika masih kecil. Sekiranya ada Nabi setelah Nabi shallallahu 'alaihi wasallam niscaya puteranya (Ibrahim) akan hidup, tetapi tidak ada Nabi setelahnya. \""
            },
            {
                "number": 1467,
                "arab": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ حَدَّثَنَا دَاوُدُ بْنُ شَبِيبٍ الْبَاهِلِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ حَدَّثَنَا الْحَكَمُ بْنُ عُتَيْبَةَ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا مَاتَ إِبْرَاهِيمُ ابْنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ إِنَّ لَهُ مُرْضِعًا فِي الْجَنَّةِ وَلَوْ عَاشَ لَكَانَ صِدِّيقًا نَبِيًّا وَلَوْ عَاشَ لَعَتَقَتْ أَخْوَالُهُ الْقِبْطُ وَمَا اسْتُرِقَّ قِبْطِيٌّ",
                "id": "Telah menceritakan kepada kami [Abdul Qudus bin Muhammad] berkata, telah menceritakan kepada kami [Dawud bin Syabib Al Bahili] berkata, telah menceritakan kepada kami [Ibrahim bin Utsman] berkata, telah menceritakan kepada kami [Al Hakam bin Utaibah] dari [Miqsam] dari [Ibnu Abbas] ia berkata, \"Tatkala Ibrahim putra Rasulullah shallallahu 'alaihi wasallam meninggal, Rasulullah shallallahu 'alaihi wasallam mensholatkannya, beliau berkata: \"Sesungguhnya dia memiliki orang yang menyusuinya di surga. Kalau saja ia hidup, niscaya akan menjadi seorang yang jujur dan seorang nabi. Kalau saja ia hidup niscaya paman-pamannya dari kalangan Qibti akan merdeka, tetapi Qibti bukanlah seorang budak. \""
            },
            {
                "number": 1468,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا هِشَامُ بْنُ أَبِي الْوَلِيدِ عَنْ أُمِّهِ عَنْ فَاطِمَةَ بِنْتِ الْحُسَيْنِ عَنْ أَبِيهَا الْحُسَيْنِ بْنِ عَلِيٍّ قَالَلَمَّا تُوُفِّيَ الْقَاسِمُ ابْنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ خَدِيجَةُ يَا رَسُولَ اللَّهِ دَرَّتْ لُبَيْنَةُ الْقَاسِمِ فَلَوْ كَانَ اللَّهُ أَبْقَاهُ حَتَّى يَسْتَكْمِلَ رِضَاعَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ إِتْمَامَ رَضَاعِهِ فِي الْجَنَّةِ قَالَتْ لَوْ أَعْلَمُ ذَلِكَ يَا رَسُولَ اللَّهِ لَهَوَّنَ عَلَيَّ أَمْرَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ شِئْتِ دَعَوْتُ اللَّهَ تَعَالَى فَأَسْمَعَكِ صَوْتَهُ قَالَتْ يَا رَسُولَ اللَّهِ بَلْ أُصَدِّقُ اللَّهَ وَرَسُولَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Imran] berkata, telah menceritakan kepada kami [Abu Dawud] berkata, telah menceritakan kepada kami [Hisyam bin Abul Walid] dari [Ibunya] dari [Fatimah binti Al Husain] dari bapaknya [Al Husain bin Ali] ia berkata, \"Tatkala Al Qasim putra Rasulullah shallallahu 'alaihi wasallam wafat, Khadijah berkata, \"Wahai Rasulullah, air susu Al Qasim melimpah, sekiranya saja Allah memberinya kehidupan hingga tuntas penyusuannya. \" Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Sungguh penyusuannya akan disempurnakan di surga. \" Khadijah berkata, \"Wahai Rasulullah, sekiranya aku mengetahui hal itu, pasti urusannya akan menjadi ringan bagiku. \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu mau, aku akan berdo'a kepada Allah Ta'ala agar memperdengarkan suaranya kepadamu. \" Khadijah menjawab, \"Ya Rasulullah, aku percaya Allah dan Rasul-Nya shallallahu 'alaihi wasallam. \" "
            },
            {
                "number": 1469,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَأُتِيَ بِهِمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ فَجَعَلَ يُصَلِّي عَلَى عَشَرَةٍ عَشَرَةٍ وَحَمْزَةُ هُوَ كَمَا هُوَ يُرْفَعُونَ وَهُوَ كَمَا هُوَ مَوْضُوعٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Abu Bakr bin 'Ayyas] dari [Yazid bin Abu Ziyad] dari [Miqsam] dari [Ibnu Abbas] ia berkata, \"Pada perang Uhud, mereka (para sahabat yang mati syahid) dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau mensholatkan mereka sepuluh orang-sepuluh orang, jenazah-jenazah itu diangkat silih berganti, sementara Hamzah masih dalam posisi semula (hingga ia disholati berulang-ulang). \""
            },
            {
                "number": 1470,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ وَالثَّلَاثَةِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمْ قَدَّمَهُ فِي اللَّحْدِ وَقَالَ أَنَا شَهِيدٌ عَلَى هَؤُلَاءِ وَأَمَرَ بِدَفْنِهِمْ فِي دِمَائِهِمْ وَلَمْ يُصَلِّ عَلَيْهِمْ وَلَمْ يُغَسَّلُوا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Ibnu Syihab] dari ['Abdurrahman bin Ka'b bin Malik] dari [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam menggabungkan dua hingga tiga laki-laki yang syahid dalam perang Uhud dalam satu kain kafan. Kemudian beliau bersabda: \"Siapakah di antara mereka yang lebih banyak hafalan Al Qur`annya?\" ketika beliau diberi isyarat pada salah satu dari mereka, beliau pun mendahulukannya ketika memasukkan ke dalam lahad. Beliau bersabda: \"Aku bersaksi atas mereka semua. \" Lalu beliau memerintahkan agar mereka dikubur dalam keadaan masih berlumuran darah, tidak disholatkan dan tidak dimandikan. \""
            }
        ]
    }
}