{
    "status": true,
    "data": {
        "start": 4117,
        "end": 4263,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 4117,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا أَبُو شُعَيْبٍ صَالِحُ بْنُ زُرَيْقٍ الْعَطَّارُ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْجُمَحِيُّ عَنْ مُوسَى بْنِ عُلَيِّ بْنِ رَبَاحٍ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ قَلْبِ ابْنِ آدَمَ بِكُلِّ وَادٍ شُعْبَةً فَمَنْ اتَّبَعَ قَلْبُهُ الشُّعَبَ كُلَّهَا لَمْ يُبَالِ اللَّهُ بِأَيِّ وَادٍ أَهْلَكَهُ وَمَنْ تَوَكَّلَ عَلَى اللَّهِ كَفَاهُ التَّشَعُّبَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah memberitakan kepada kami [Abu Syu'aib Shalih bin Zuraiq Al 'Atthar] telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Jumahi] dari [Musa bin Ali bin Rabah] dari [Ayahnya] dari ['Amru bin Al 'Ash] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya dalam rongga hati seorang anak Adam terdapat kecenderungan untuk mengumpulkan harta kekayaan, barangsiapa yang mengikuti kecenderungan tersebut maka Allah membiarkannya binasa dengan itu, namun siapa yang bertawakkal kepada Allah maka Allah akan mencukupkannya.\""
            },
            {
                "number": 4118,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَمُوتَنَّ أَحَدٌ مِنْكُمْ إِلَّا وَهُوَ يُحْسِنُ الظَّنَّ بِاللَّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Tharif] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian mati melainkan dalam kondisi berbaik sangka terhadap Allah.\""
            },
            {
                "number": 4119,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ عَجْلَانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنْ الْمُؤْمِنِ الضَّعِيفِ وَفِي كُلٍّ خَيْرٌ احْرِصْ عَلَى مَا يَنْفَعُكَ وَلَا تَعْجِزْ فَإِنْ غَلَبَكَ أَمْرٌ فَقُلْ قَدَرُ اللَّهِ وَمَا شَاءَ فَعَلَ وَإِيَّاكَ وَاللَّوْ فَإِنَّ اللَّوْ تَفْتَحُ عَمَلَ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin As Shabah] telah memberitakan kepada kami [Sufyan bin 'Uyainah] dari [Ibnu 'Ajlan] dari [Al A'raj] dari [Abu Hurairah] dan sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang mukmin yang kuat itu lebih baik dari lebih dicintai oleh Allah daripada seorang mukmin yang lemah, dan dalam masing-masing keduanya itu terdapat kebaikan. Bersungguh-sungguhlah terhadap sesuatu yang bermanfaat bagimu dan jangan lemah semangat. Jika suatu perkara mengalahkanmu maka katakanlah, 'Ketentuan Allah telah ditetapkan, dan suatu yang telah Dia kehendaki maka akan terjadi. Dan jauhilah olehmu dari ucapan 'Seandainya', karena sesungguhnya ungkapan 'Seandainya' membuka peluang masuknya setan.\""
            },
            {
                "number": 4120,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَلِمَةُ الْحِكْمَةُ ضَالَّةُ الْمُؤْمِنِ حَيْثُمَا وَجَدَهَا فَهُوَ أَحَقُّ بِهَا",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Abdul Wahhab] telah menceritakan kepada kami [Abdullah bin Numair] dari [Ibrahim bin Al Fadll] dari [Sa'id Al Maqburi] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalimat hikmah adalah barang seorang mukmin yang hilang, maka dimana saja ia menemukannya ia lebih berhak untuk mengambilnya.\""
            },
            {
                "number": 4121,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنْ النَّاسِ الصِّحَّةُ وَالْفَرَاغُ",
                "id": "Telah menceritakan kepada kami [Al 'Abbas bin Abdul 'Azhim Al 'Anbari] telah menceritakan kepada kami [Shafwan bin Isa] dari [Abdullah bin Sa'id bin Abu Hind] dari [Ayahnya] dia berkata; saya mendengar [Ibnu Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua kenikmatan yang sering dilupakan oleh kebanyakan manusia adalah kesehatan dan waktu luang.\""
            },
            {
                "number": 4122,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ حَدَّثَنِي عُثْمَانُ بْنُ جُبَيْرٍ مَوْلَى أَبِي أَيُّوبَ عَنْ أَبِي أَيُّوبَ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي وَأَوْجِزْ قَالَ إِذَا قُمْتَ فِي صَلَاتِكَ فَصَلِّ صَلَاةَ مُوَدِّعٍ وَلَا تَكَلَّمْ بِكَلَامٍ تَعْتَذِرُ مِنْهُ وَأَجْمِعْ الْيَأْسَ عَمَّا فِي أَيْدِي النَّاسِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ziyad] telah menceritakan kepada kami [Al Fudlail bin Sulaiman] telah menceritakan kepada kami [Abdullah bin Utsman bin Haitsam] telah menceritakan kepadaku [Utsman bin Jubair] bekas budak Abu Ayyub, dari [Abu Ayyub] dia berkata, \"Seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, ajarkanlah kepadaku (ilmu) yang singkat padat.\" Beliau bersabda: \"Apabila kamu (hendak) mendirikan sholat maka sholatlah seperti sholatnya orang yang hendak berpisah. Janganlah kamu mengatakan suatu perkataan yang akan kamu sesali. Dan kumpulkan rasa keputus asaan dari apa yang di miliki orang lain.\""
            },
            {
                "number": 4123,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَوْسِ بْنِ خَالِدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الَّذِي يَجْلِسُ يَسْمَعُ الْحِكْمَةَ ثُمَّ لَا يُحَدِّثُ عَنْ صَاحِبِهِ إِلَّا بِشَرِّ مَا يَسْمَعُ كَمَثَلِ رَجُلٍ أَتَى رَاعِيًا فَقَالَ يَا رَاعِي أَجْزِرْنِي شَاةً مِنْ غَنَمِكَ قَالَ اذْهَبْ فَخُذْ بِأُذُنِ خَيْرِهَا فَذَهَبَ فَأَخَذَ بِأُذُنِ كَلْبِ الْغَنَمِقَالَ أَبُو الْحَسَنِ بْنُ سَلَمَةَ حَدَّثَنَاهُ إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا مُوسَى حَدَّثَنَا حَمَّادٌ فَذَكَرَ نَحْوَهُ وَقَالَ فِيهِ بِأُذُنِ خَيْرِهَا شَاةً",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Al Hasan bin Musa] dari [Hammad bin Salamah] dari [Ali bin Zaid] dari [Aus bin Khalid] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Permisalan orang yang duduk dan mendengarkan hikmah kemudian ia tidak berbicara tentang sahabatnya kecuali yang jelek dari apa yang ia dengar, seperti seorang laki-laki yang datang kepada penggembala dan berkata, 'Hai pengembala sembelihkan untukku satu kambingmu.' Maka si pengembala berkata, 'Pergi dan ambillah dengan kambing yang paling bagus, ' namun ia pergi dengan membawa kambing yang paling jelek.\" Abu Al Hasan bin Salamah berkata, \"Telah menceritakan kepada kami Isma'il bin Ibrahim, telah menceritakan kepada kami Musa, telah menceritakan kepada kami Hammad, kemudian ia menyebutkan hadits seperti di atas, namun dia menyebutkan, \"(Ambillah) kambing yang paling bagus.\""
            },
            {
                "number": 4124,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ جَمِيعًا عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ كِبْرٍ وَلَا يَدْخُلُ النَّارَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] telah menceritakan kepada kami [Ali bin Mushir]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ali bin Maimun Ar Raqi] telah menceritakan kepada kami [Sa'id bin Maslamah] semuanya dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan masuk surga orang yang dalam hatinya terdapat kesombongan (walau) sebiji sawi, dan tidak akan masuk neraka seorang yang di dalam hatinya terdapat keimanan (walau) sebiji sawi.\""
            },
            {
                "number": 4125,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ الْأَغَرِّ أَبِي مُسْلِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُ سُبْحَانَهُ الْكِبْرِيَاءُ رِدَائِي وَالْعَظَمَةُ إِزَارِي مَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا أَلْقَيْتُهُ فِي جَهَنَّمَ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] telah menceritakan kepada kami [Abu Al Ahwash] dari ['Atha bin As Saib] dari [Al Aghar Abu Muslim] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Subhanahu berfirman: 'Kesombongan adalah pakaian-Ku, dan kebesaran adalah selendang-Ku, siapa saja yang mencabut salah satu dari keduanya dari-Ku, maka akan Aku lemparkan ia ke neraka Jahannam.\""
            },
            {
                "number": 4126,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ وَهَارُونُ بْنُ إِسْحَقَ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُ سُبْحَانَهُ الْكِبْرِيَاءُ رِدَائِي وَالْعَظَمَةُ إِزَارِي فَمَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا أَلْقَيْتُهُ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] dan [Harun bin Ishaq] keduanya berkata; telah menceritakan kepada kami [Abdurrahman Al Muharibi] dari ['Atha bin As Saib] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla berfirman: 'Kesombongan adalah pakaian-Ku, sedangkan kebesaran adalah selendang-Ku, maka siapa saja yang mencabut salah satu dari dua hal, itu maka ia akan Aku lemparkan ke neraka.\""
            },
            {
                "number": 4127,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ دَرَّاجًا حَدَّثَهُ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يَتَوَاضَعُ لِلَّهِ سُبْحَانَهُ دَرَجَةً يَرْفَعُهُ اللَّهُ بِهِ دَرَجَةً وَمَنْ يَتَكَبَّرُ عَلَى اللَّهِ دَرَجَةً يَضَعُهُ اللَّهُ بِهِ دَرَجَةً حَتَّى يَجْعَلَهُ فِي أَسْفَلِ السَّافِلِينَ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru bin Al Harits] bahwa [Darrajan] telah menceritakan kepadanya dari [Abu Al Haitsam] dari [Abu Sa'id] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa tawadlu' (bersikap rendah diri) kepada Allah Subhanah satu derajat, niscaya Allah akan mengangkatnya satu derajat, dan barangsiapa bersikap sombong kepada Allah satu derajat, maka Allah akan merendahkan satu derajat hingga derajat yang paling hina.\""
            },
            {
                "number": 4128,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الصَّمَدِ وَسَلْمُ بْنُ قُتَيْبَةَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَإِنْ كَانَتْ الْأَمَةُ مِنْ أَهْلِ الْمَدِينَةِ لَتَأْخُذُ بِيَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا يَنْزِعُ يَدَهُ مِنْ يَدِهَا حَتَّى تَذْهَبَ بِهِ حَيْثُ شَاءَتْ مِنْ الْمَدِينَةِ فِي حَاجَتِهَا",
                "id": "Telah menceritakan kepada kami [Nahsr bin Ali] telah menceritakan kepada kami [Abdus Shamad] dan [Salm bin Qutaibah] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari ['Ali bin Zaid] dari [Anas bin Malik] dia berkata, \"Sekiranya ada seorang budak wanita dari penduduk Madinah yang menggandeng tangan Rasulullah shallallahu 'alaihi wasallam, maka beliau tidak menarik tangan beliau dari tangan budak tersebut sampai ia membawanya ke manapun yang ia kehendaki di Madinah hingga selesai hajatnya.\""
            },
            {
                "number": 4129,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا جَرِيرٌ عَنْ مُسْلِمٍ الْأَعْوَرِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُ الْمَرِيضَ وَيُشَيِّعُ الْجِنَازَةَ وَيُجِيبُ دَعْوَةَ الْمَمْلُوكِ وَيَرْكَبُ الْحِمَارَ وَكَانَ يَوْمَ قُرَيْظَةَ وَالنَّضِيرِ عَلَى حِمَارٍ وَيَوْمَ خَيْبَرَ عَلَى حِمَارٍ مَخْطُومٍ بِرَسَنٍ مِنْ لِيفٍ وَتَحْتَهُ إِكَافٌ مِنْ لِيفٍ",
                "id": "Telah menceritakan kepada kami ['Amru bin Rafi'] telah menceritakan kepada kami [Jarir] dari [Muslim Al A'war] dari [Anas bin Malik] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam adalah sosok orang yang suka menjenguk orang yang sakit, mengantarkan jenazah, memenuhi ajakan seorang hamba sahaya, dan menaiki seekor keledai. Ketika hari (pengusiran) Bani Quraidlah dan Nadlir beliau menaiki seekor keledai, dan ketika hari (penaklukan) Khaibar, beliau juga menaiki seekor keledai yang tali kekangnya dan pelananya terbuat dari kulit.\""
            },
            {
                "number": 4130,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ حَدَّثَنَا أَبِي عَنْ مَطَرٍ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ عِيَاضِ بْنِ حِمَارٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ خَطَبَهُمْ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا حَتَّى لَا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id] telah menceritakan kepada kami [Ali bin Al Husain bin Waqid] telah menceritakan kepada kami [Ayahku] dari [Mathar] dari [Qatadah] dari [Mutharif] dari ['Iyadl bin Himar] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau berkhutbah di hadapan para sahabat dengan mengatakan: \"Sesungguhnya Allah 'azza wajalla telah mewahyukan kepadaku supaya kalian bersikap rendah diri, sampai tidak ada lagi salah seorang dari kalian saling berbangga diri kepada yang lainnya.\""
            },
            {
                "number": 4131,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عُتْبَةَ مَوْلًى لِأَنَسِ بْنِ مَالِكٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ حَيَاءً مِنْ عَذْرَاءَ فِي خِدْرِهَا وَكَانَ إِذَا كَرِهَ شَيْئًا رُئِيَ ذَلِكَ فِي وَجْهِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Sa'id] dan [Abdurrahman bin Mahdi] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abdullah bin Abu 'Utbah] bekas budak Anas bin Malik, dari [Abu Sa'id Al Khudri] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam adalah seorang yang pemalu, dan lebih malu daripada seorang perawan yang dipingit di kamarnya. Dan jika beliau membenci sesuatu maka itu akan terlihat dari mimik wajahnya.\""
            },
            {
                "number": 4132,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ مُعَاوِيَةَ بْنِ يَحْيَى عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِكُلِّ دِينٍ خُلُقًا وَخُلُقُ الْإِسْلَامِ الْحَيَاءُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Abdullah Ar Raqi] telah menceritakan kepada kami [Isa bin Yunus] dari [Mu'awiyah bin Yahya] dari [Az Zuhri] dari [Anas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setiap agama itu memliki etika, sedangkan akhlak (etika) Islam adalah rasa malu.\""
            },
            {
                "number": 4133,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْوَرَّاقُ حَدَّثَنَا صَالِحُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِكُلِّ دِينٍ خُلُقًا وَإِنَّ خُلُقَ الْإِسْلَامِ الْحَيَاءُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Sa'id bin Muhammad Al Warraq] telah menceritakan kepada kami [Shalih bin Hasan] dari [Muhammad bin Ka'b Al Quradli] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setiap agama itu memliki etika, sedangkan akhlak (etika) Islam adalah rasa malu.\""
            },
            {
                "number": 4134,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عُقْبَةَ بْنِ عَمْرٍو أَبِي مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى إِذَا لَمْ تَسْتَحْيِ فَاصْنَعْ مَا شِئْتَ",
                "id": "Telah menceritakan kepada kami ['Amru bin Rafi'] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Rib'I bin Hirasy] dari ['Uqbah bin 'Amru Abu Mas'ud] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang pertama kali diketahui oleh manusia dari perkara kenabian adalah 'Jika kamu tidak punya rasa malu maka berbuatlah sesukamu'.\""
            },
            {
                "number": 4135,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَيَاءُ مِنْ الْإِيمَانِ وَالْإِيمَانُ فِي الْجَنَّةِ وَالْبَذَاءُ مِنْ الْجَفَاءِ وَالْجَفَاءُ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Musa] telah menceritakan kepada kami [Husyaim] dari [Manshur] dari [Al Hasan] dari [Abu Bakrah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Malu itu sebagian dari iman, dan iman akan berada di surga. Sedangkan perkataan kotor termasuk dari perangai buruk, dan perangai buruk akan berada di neraka.\""
            },
            {
                "number": 4136,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا كَانَ الْفُحْشُ فِي شَيْءٍ قَطُّ إِلَّا شَانَهُ وَلَا كَانَ الْحَيَاءُ فِي شَيْءٍ قَطُّ إِلَّا زَانَهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Ma'mar] dari [Tsabit] dari [Anas], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah kekejian terhadap sesuatu apapun kecuali ia akan membuatnya buruk. Dan tidaklah malu kepada sesuatu apapun kecuali ia akan menghiasinya.\""
            },
            {
                "number": 4137,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ أَبِي مَرْحُومٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَظَمَ غَيْظًا وَهُوَ قَادِرٌ عَلَى أَنْ يُنْفِذَهُ دَعَاهُ اللَّهُ عَلَى رُءُوسِ الْخَلَائِقِ يَوْمَ الْقِيَامَةِ حَتَّى يُخَيِّرَهُ فِي أَيِّ الْحُورِ شَاءَ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] telah menceritakan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Sa'id bin Abu Ayyub] dari [Abu Marhum] dari [Sahl bin Mu'adz bin Anas] dari [Ayahnya], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mampu menahan amarahnya sedangkan ia mampu melampiaskannya, maka Allah akan memanggilnya di hadapan seluruh makhluk pada hari Kiamat hingga Dia memberinya (kebebasan) memilih bidadari yang ia suka.\""
            },
            {
                "number": 4138,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ حَدَّثَنَا خَالِدُ بْنُ دِينَارٍ الشَّيْبَانِيُّ عَنْ عُمَارَةَ الْعَبْدِيِّ حَدَّثَنَا أَبُو سَعِيدٍ الْخُدْرِيُّ قَالَكُنَّا جُلُوسًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَتَتْكُمْ وُفُودُ عَبْدِ الْقَيْسِ وَمَا يَرَى أَحَدٌ فِينَا نَحْنُ كَذَلِكَ إِذْ جَاءُوا فَنَزَلُوا فَأَتَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَقِيَ الْأَشَجُّ الْعَصَرِيُّ فَجَاءَ بَعْدُ فَنَزَلَ مَنْزِلًا فَأَنَاخَ رَاحِلَتَهُ وَوَضَعَ ثِيَابَهُ جَانِبًا ثُمَّ جَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَشَجُّ إِنَّ فِيكَ لَخَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ الْحِلْمَ وَالتُّؤَدَةَ قَالَ يَا رَسُولَ اللَّهِ أَشَيْءٌ جُبِلْتُ عَلَيْهِ أَمْ شَيْءٌ حَدَثَ لِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلْ شَيْءٌ جُبِلْتَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala Al Hamdani] telah menceritakan kepada kami [Yunus bin Bukair] telah menceritakan kepada kami [Khalid bin Dinar As Syaibani] dari ['Umarah Al 'Abdi] telah menceritakan kepada kami [Abu Sa'id Al Khudri] dia berkata, \"Kami pernah duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam, beliau lalu bersabda: \"Delegasi Abdul Qais telah datang kepada kalian.\" Namun tidak seorang pun dari kami yang melihatnya, ketika kami masih seperti itu tiba-tiba mereka datang dan datang menemui Rasulullah shallallahu 'alaihi wasallam, kecuali Al Asyaj Al 'Ashri yang masih di belakang (tertinggal). Lalu ia pun datang, setelah menambatkan unta dan meletakkan pakaiannya ia datang menemui Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepadanya: \"Wahai Asyaj, sesungguhnya dalam dirimu terdapat dua sikap yang dicintai Allah; sikap santun dan tidak tergesa-gesa.\" Asyaj berkata, \"Wahai Rasulullah, itu sifat yang telah ditetapkan untukku, atau sesuatu yang bermula dariku?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu sifat yang ditetapkan untukmu.\""
            },
            {
                "number": 4139,
                "arab": "حَدَّثَنَا أَبُو إِسْحَقَ الْهَرَوِيُّ حَدَّثَنَا الْعَبَّاسُ بْنُ الْفَضْلِ الْأَنْصَارِيُّ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو جَمْرَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْأَشَجِّ الْعَصَرِيِّ إِنَّ فِيكَ خَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ الْحِلْمَ وَالْحَيَاءَ",
                "id": "Telah menceritakan kepada kami [Abu Ishaq Al Harawi] telah menceritakan kepada kami [Al 'Abbas bin Al Fadl Al Anshari] telah menceritakan kepada kami [Qurrah bin Khalid] telah menceritakan kepada kami [Abu Jamrah] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada Al Asyaj Al 'Ashri: \"Sesungguhnya dalam dirimu terdapat dua sikap yang dicintai oleh Allah; sifat santun dan malu.\""
            },
            {
                "number": 4140,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ الْحَسَنِ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ جُرْعَةٍ أَعْظَمُ أَجْرًا عِنْدَ اللَّهِ مِنْ جُرْعَةِ غَيْظٍ كَظَمَهَا عَبْدٌ ابْتِغَاءَ وَجْهِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Zaid bin Akhzam] telah menceritakan kepada kami [Bisyr bin Umar] telah menceritakan kepada kami [Hammad bin Salamah] dari [Yunus bin 'Ubaid] dari [Al Hasan] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada tegukan yang lebih besar pahalanya di sisi Allah daripada tegukan amarah yang ditahan dari seorang hamba karena mencari keridlaan Allah.\""
            },
            {
                "number": 4141,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ أَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَنْبَأَنَا إِسْرَائِيلُ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنْ مُوَرِّقٍ الْعِجْلِيِّ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَرَى مَا لَا تَرَوْنَ وَأَسْمَعُ مَا لَا تَسْمَعُونَ إِنَّ السَّمَاءَ أَطَّتْ وَحَقَّ لَهَا أَنْ تَئِطَّ مَا فِيهَا مَوْضِعُ أَرْبَعِ أَصَابِعَ إِلَّا وَمَلَكٌ وَاضِعٌ جَبْهَتَهُ سَاجِدًا لِلَّهِ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا وَلَبَكَيْتُمْ كَثِيرًا وَمَا تَلَذَّذْتُمْ بِالنِّسَاءِ عَلَى الْفُرُشَاتِ وَلَخَرَجْتُمْ إِلَى الصُّعُدَاتِ تَجْأَرُونَ إِلَى اللَّهِ وَاللَّهِ لَوَدِدْتُ أَنِّي كُنْتُ شَجَرَةً تُعْضَدُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah memberitakan kepada kami ['ubaidhullah bin Musa] telah memberitakan kepada kami [Israil] dari [Ibrahim bin Muhajir] dari [Mujahid] dari [Muwariq Al 'Ijli] dari [Abu Dzar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saya mengetahui sesuatu yang tidak kalian ketahui, dan mendengar apa yang tidak kalian dengar. Sesungguhnya langit merintih dan diberikan kepadanya hak untuk merintih. Karena tidaklah dalam posisi empat jari kecuali ada Malaikat yang meletakkan keningnya bersujud kepada Allah. Demi Allah, seandainya kalian mengetahui apa yang aku ketahui, niscaya kalian akan sedikit tertawa dan banyak menangis, dan kalian tidak akan merasakan enaknya di atas kasur bersama isteri, dan kalian akan keluar menuju bukit-bukit untuk berdo'a dengan suara keras kepada Allah. Demi Allah, aku sangat ingin seandainya aku menjadi sebatang pohon yang ditebang.\""
            },
            {
                "number": 4142,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا وَلَبَكَيْتُمْ كَثِيرًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdus Shamad bin Abdul Warits] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas bin Malik] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya kalian mengetahui apa yang aku ketahui, sungguh kalian akan sedikit tertawa dan banyak menangis.\""
            },
            {
                "number": 4143,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي فُدَيْكٍ عَنْ مُوسَى بْنِ يَعْقُوبَ الزَّمْعِيِّ عَنْ أَبِي حَازِمٍ أَنَّ عَامِرَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَخْبَرَهُ أَنَّ أَبَاهُ أَخْبَرَهُأَنَّهُ لَمْ يَكُنْ بَيْنَ إِسْلَامِهِمْ وَبَيْنَ أَنْ نَزَلَتْ هَذِهِ الْآيَةُ يُعَاتِبُهُمْ اللَّهُ بِهَا إِلَّا أَرْبَعُ سِنِينَ{ وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلُ فَطَالَ عَلَيْهِمْ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ }",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim] telah menceritakan kepada kami [Muhammad bin Abu Fudaik] dari [Musa bin Ya'qub Az Zam'i] dari [Abu Hazim] bahwa ['Amir bin Abdullah bin Az Zubair] mengabarkan kepadanya, bahwa [Ayahnya] telah mengabarkan kepadanya, bahwa jarak antara keIslaman mereka dan turunnya ayat yang dengannya Allah mencela mereka kecuali hanya empat tahun, yaitu: '(…dan janganlah mereka seperti orang-orang yang sebelumnya telah diturunkan Al Kitab kepadanya, Kemudian berlalulah masa yang panjang atas mereka lalu hati mereka menjadi keras. dan kebanyakan di antara mereka adalah orang-orang yang fasik) ' (Qs. Al Hadiid: 16)."
            },
            {
                "number": 4144,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُكْثِرُوا الضَّحِكَ فَإِنَّ كَثْرَةَ الضَّحِكِ تُمِيتُ الْقَلْبَ",
                "id": "Telah menceritakan kepada kami [Bakar bin Khalaf] telah menceritakan kepada kami [Abu Bakar Al Hanafi] telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Ibrahim bin Abdullah bin Hunain] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian banyak tertawa, karena banyak tertawa akan mematikan hati.\""
            },
            {
                "number": 4145,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ عَلَيَّ فَقَرَأْتُ عَلَيْهِ بِسُورَةِ النِّسَاءِ حَتَّى إِذَا بَلَغْتُ{ فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدًا }فَنَظَرْتُ إِلَيْهِ فَإِذَا عَيْنَاهُ تَدْمَعَانِ",
                "id": "Telah menceritakan kepada kami [Al Hannad bin As Sarri] telah menceritakan kepada kami [Abu Al Ahwash] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] dia berkata, \"Nabi shallallahu 'alaihi wasallam pernah bersabda kepadaku: \"Bacakanlah (ayat) untukku! \" Maka saya membaca surat An Nisaa, ketika sampai ayat: '(Maka bagaimanakah (halnya orang kafir nanti), apabila kami mendatangkan seseorang saksi (rasul) dari tiap-tiap umat dan kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu) ' (Qs. An Nisaa: 41), maka saya melihat kedua air mata beliau meneteskan air mata.\""
            },
            {
                "number": 4146,
                "arab": "حَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو رَجَاءٍ الْخُرَاسَانِيُّ عَنْ مُحَمَّدِ بْنِ مَالِكٍ عَنْ الْبَرَاءِ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جِنَازَةٍ فَجَلَسَ عَلَى شَفِيرِ الْقَبْرِ فَبَكَى حَتَّى بَلَّ الثَّرَى ثُمَّ قَالَ يَا إِخْوَانِي لِمِثْلِ هَذَا فَأَعِدُّوا",
                "id": "Telah menceritakan kepada kami [Al Qasim bin Zakaria bin Dinar] telah menceritakan kepada kami [Ishaq bin Manshur] telah menceritakan kepada kami [Abu Raja Al Khurasani] dari [Muhammad bin Malik] dari [Al Barra] dia berkata, \"Kami pernah mengantar jenazah bersama Rasulullah shallallahu 'alaihi wasallam, kemudian beliau duduk di sisi kuburan dan menangis hingga membasahi tanah. Beliau bersabda: \"Wahai saudaraku, bersiap-siaplah untuk hal seperti ini.\""
            },
            {
                "number": 4147,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ بَشِيرِ بْنِ ذَكْوَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبُو رَافِعٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ السَّائِبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْكُوا فَإِنْ لَمْ تَبْكُوا فَتَبَاكَوْا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ahmad bin Basyir bin Dzakwan Ad Dimasyqi] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Abu Rafi'] dari [Ibnu Abu Mulaikah] dari [Abdurrahman bin As Saib] dari [Sa'd bin Abu Waqash] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menagislah kalian, jika tidak bisa menangis maka berusalah untuk menangis.\""
            },
            {
                "number": 4148,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ وَإِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ حَدَّثَنِي حَمَّادُ بْنُ أَبِي حُمَيْدٍ الزُّرَقِيُّ عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ عَبْدٍ مُؤْمِنٍ يَخْرُجُ مِنْ عَيْنَيْهِ دُمُوعٌ وَإِنْ كَانَ مِثْلَ رَأْسِ الذُّبَابِ مِنْ خَشْيَةِ اللَّهِ ثُمَّ تُصِيبُ شَيْئًا مِنْ حُرِّ وَجْهِهِ إِلَّا حَرَّمَهُ اللَّهُ عَلَى النَّارِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi] dan [Ibrahim bin Al Mundzir] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Fudaik] telah menceritakan kepadaku [Hammad bin Abu Humaid Az Zuraqi] dari ['Aun bin Abdullah bin 'Utbah bin Mas'ud] dari [Ayahnya] dari [Abdullah bin Mas'ud] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang mukmin mengeluarkan air mata dari kedua matanya walaupun sebesar kepala ekor lalat karena takut kepada Allah, kemudian ia mengenai wajahnya melainkan Allah akan membaskannya dari neraka.\""
            },
            {
                "number": 4149,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدٍ الْهَمْدَانِيِّ عَنْ عَائِشَةَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ{ وَالَّذِينَ يُؤْتُونَ مَا آتَوْا وَقُلُوبُهُمْ وَجِلَةٌ }أَهُوَ الَّذِي يَزْنِي وَيَسْرِقُ وَيَشْرَبُ الْخَمْرَ قَالَ لَا يَا بِنْتَ أَبِي بَكْرٍ أَوْ يَا بِنْتَ الصِّدِّيقِ وَلَكِنَّهُ الرَّجُلُ يَصُومُ وَيَتَصَدَّقُ وَيُصَلِّي وَهُوَ يَخَافُ أَنْ لَا يُتَقَبَّلَ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Malik bin Mighwal] dari [Abdurrahman bin Sa'id Al Hamdani] dari ['Aisyah] dia berkata, \"Saya bertanya, \"Wahai Rasulullah, apakah firman Allah: '(Dan orang-orang yang memberikan apa yang telah mereka berikan, dengan hati yang takut…) ' (Qs. Al Mukminuun: 60), ditujukan kepada orang-orang berzina, mencuri dan minum minuman keras saja?\" Beliau menjawab: \"Tidak wahai puteri Abu Bakar -atau wahai puteri As Shiddiq-, tetapi (ayat tersebut) ditujukan kepada seseorang yang berpuasa, bersedekah dan sholat, sedangkan ia takut jika amalannya tidak di terima.\""
            },
            {
                "number": 4150,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ إِسْمَعِيلَ بْنِ عِمْرَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ حَدَّثَنِي أَبُو عَبْدِ رَبٍّ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّمَا الْأَعْمَالُ كَالْوِعَاءِ إِذَا طَابَ أَسْفَلُهُ طَابَ أَعْلَاهُ وَإِذَا فَسَدَ أَسْفَلُهُ فَسَدَ أَعْلَاهُ",
                "id": "Telah menceritakan kepada kami ['Utsman bin Isma'il bin 'Imran Ad Dimasyqi] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Abdurrahman bin Yazid bin Jabir] telah menceritakan kepadaku [Abu 'Abd Rabb] dia berkata; saya mendengar [Mu'awiyah bin Abu Sufyan] berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya amalan seseorang itu bagaikan tempat minum, jika bawahnya jernih maka atasnya pun ikut jernih, namun jika bawahnya keruh maka permukaannya pun ikut keruh.\""
            },
            {
                "number": 4151,
                "arab": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ وَرْقَاءَ بْنِ عُمَرَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ ذَكْوَانَ أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْعَبْدَ إِذَا صَلَّى فِي الْعَلَانِيَةِ فَأَحْسَنَ وَصَلَّى فِي السِّرِّ فَأَحْسَنَ قَالَ اللَّهُ عَزَّ وَجَلَّ هَذَا عَبْدِي حَقًّا",
                "id": "Telah menceritakan kepada kami [Katsir bin 'Ubaid Al Himshi] telah menceritakan kepada kami [Baqiyah] dari [Warqa bin 'Umar] telah menceritakan kepada kami [Abdullah bin Dzakwan Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya jika ada seorang hamba yang sholat dalam kondisi terang-terangan kemudian ia membaguskan sholatnya, begitu juga ketika ia sholat dalam kondisi sembunyi-sembunyi dan membaguskan sholatnya, maka Allah 'azza wajalla akan berfirman, 'Ini benar-benar hamba-Ku'.\""
            },
            {
                "number": 4152,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ وَإِسْمَعِيلُ بْنُ مُوسَى قَالَا حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَارِبُوا وَسَدِّدُوا فَإِنَّهُ لَيْسَ أَحَدٌ مِنْكُمْ بِمُنْجِيهِ عَمَلُهُ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِي اللَّهُ بِرَحْمَةٍ مِنْهُ وَفَضْلٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin 'Amir bin Zurarah] dan [Isma'il bin Musa] keduanya berkata; telah menceritakan kepada kami [Syarik bin Abdullah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bertaqarublah kalian dan bersungguh-sungguhlah (dalam beribadah), sebab sesungguhnya tidak ada seorangpun dari kalian yang selamat karena amalnya.\" Mereka berkata, \"Begitu juga dengan anda wahai Rasulullah! \" Beliau menjawab: \"Begitu juga dengan saya, hanya saja Allah meliputiku dengan rahmat dan kemuliaan-Nya.\""
            },
            {
                "number": 4153,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ أَنَا أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ فَمَنْ عَمِلَ لِي عَمَلًا أَشْرَكَ فِيهِ غَيْرِي فَأَنَا مِنْهُ بَرِيءٌ وَهُوَ لِلَّذِي أَشْرَكَ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Al 'Utsmani] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Al 'Ala bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla berfirman; 'Aku adalah dzat yang tidak membutuhkan sekutu, maka barangsiapa mengerjakan suatu amalan dengan menyertakan sekutu selain diri-Ku, maka Aku berlepas diri darinya, dan ia milik sekutu yang disertakannya itu.\""
            },
            {
                "number": 4154,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ وَإِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ أَنْبَأَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ أَخْبَرَنِي أَبِي عَنْ زِيَادِ بْنِ مِينَاءَ عَنْ أَبِي سَعْدِ بْنِ أَبِي فَضَالَةَ الْأَنْصَارِيِّ وَكَانَ مِنْ الصَّحَابَةِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَمَعَ اللَّهُ الْأَوَّلِينَ وَالْآخِرِينَ يَوْمَ الْقِيَامَةِ لِيَوْمٍ لَا رَيْبَ فِيهِ نَادَى مُنَادٍ مَنْ كَانَ أَشْرَكَ فِي عَمَلٍ عَمِلَهُ لِلَّهِ فَلْيَطْلُبْ ثَوَابَهُ مِنْ عِنْدِ غَيْرِ اللَّهِ فَإِنَّ اللَّهَ أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Harun bin Abdullah Al Hammal] serta [Ishaq bin Manshur] telah menceritakan kepada kami [Muhammad bin Bakar Al Bursani] telah memberitakan kepada kami [Abdul Hamid bin Ja'far] telah mengabarkan kepadaku [Ayahku] dari [Ziyad bin Mina] dari [Abu Sa'd bin Abu Fadlalah Al Anshari] salah seorang sahabat Nabi, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila Allah mengumpulkan orang-orang yang terdahulu dan orang-orang yang terakhir pada hari Kiamat -di hari yang tidak ada keraguan dalamnya-, maka akan ada seorang penyeru yang menyeru, \"Barangsiapa berbuat syirik yang ia kerjakan untuk selain Allah, hendaknya ia meminta balasan kepada selain Allah tersebut, sesungguhnya Allah tidak membutuhkan sekutu.\""
            },
            {
                "number": 4155,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ كَثِيرِ بْنِ زَيْدٍ عَنْ رُبَيْحِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَتَذَاكَرُ الْمَسِيحَ الدَّجَّالَ فَقَالَ أَلَا أُخْبِرُكُمْ بِمَا هُوَ أَخْوَفُ عَلَيْكُمْ عِنْدِي مِنْ الْمَسِيحِ الدَّجَّالِ قَالَ قُلْنَا بَلَى فَقَالَ الشِّرْكُ الْخَفِيُّ أَنْ يَقُومَ الرَّجُلُ يُصَلِّي فَيُزَيِّنُ صَلَاتَهُ لِمَا يَرَى مِنْ نَظَرِ رَجُلٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Katsir bin Zaid] dari [Rubaih bin Abdurrahman bi Abu Sa'id Al Khudri] dari [Ayahnya] dari [Abu Sa'id] dia berkata, 'Rasulullah shallallahu 'alaihi wasallam pernah keluar bersama kami, sementara kami saling mengingatkan tentang Al Masih Ad Dajjal, maka beliau bersabda: \"Maukah aku beritahukan kepada kalian tentang sesuatu yang lebih aku khawatirkan terhadap diri kalian daripada Al Masih Ad Dajjal?\" Abu Sa'id berkata, \"Kami menjawab, \"Tentu.\" Beliau bersabda: \"Syirik yang tersembunyi, yaitu seseorang mengerjakan sholat dan membaguskan sholatnya dengan harapan agar ada seseorang yang memperhatikannya.\""
            },
            {
                "number": 4156,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ حَدَّثَنَا رَوَّادُ بْنُ الْجَرَّاحِ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ عَنْ الْحَسَنِ بْنِ ذَكْوَانَ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ شَدَّادِ بْنِ أَوْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخْوَفَ مَا أَتَخَوَّفُ عَلَى أُمَّتِي الْإِشْرَاكُ بِاللَّهِ أَمَا إِنِّي لَسْتُ أَقُولُ يَعْبُدُونَ شَمْسًا وَلَا قَمَرًا وَلَا وَثَنًا وَلَكِنْ أَعْمَالًا لِغَيْرِ اللَّهِ وَشَهْوَةً خَفِيَّةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Khalaf Al 'Asqalani] telah menceritakan kepada kami [Rawwad bin Al Jarrah] dari ['Amir bin Abdullah] dari [Al Hasan bin Dzakwan] dari ['Ubadah bin Nusai] dari [Syaddad bin Aus] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sesuatu yang paling saya khawatirkan atas ummatku adalah syirik kepada Allah, saya tidak mengatakan bahwa mereka menyembah matahari dan juga rembulan, tidak pula menyembah berhala, akan tetapi mereka beramal untuk selain Allah dan syahwat yang tersembunyi.\""
            },
            {
                "number": 4157,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عِيسَى بْنُ الْمُخْتَارِ عَنْ مُحَمَّدِ بْنِ أَبِي لَيْلَى عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يُسَمِّعْ يُسَمِّعْ اللَّهُ بِهِ وَمَنْ يُرَاءِ يُرَاءِ اللَّهُ بِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; telah menceritakan kepada kami [Bakr bin Abdurrahman] telah menceritakan kepada kami [Isa bin Al Mukhtar] dari [Muhammad bin Abu Laila] dari ['Athiyah Al 'Aufi] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa ingin didengar (orang lain) maka Allah akan memperdengarkannya (untuk orang lain), dan barangsiapa ingin dilihat (orang lain) maka Allah akan memperlihatkannya.\""
            },
            {
                "number": 4158,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْوَهَّابِ عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ جُنْدَبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يُرَاءِ يُرَاءِ اللَّهُ بِهِ وَمَنْ يُسَمِّعْ يُسَمِّعْ اللَّهُ بِهِ",
                "id": "Telah menceritakan kepada kami [Harun bin Ishaq] telah menceritakan kepadaku [Muhammad bin Abdul Wahhab] dari [Sufyan] dari [Salamah bin Kuhail] dari [Jundab] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melakukan riya' niscaya Allah akan mengabulkannya, dan barangsiapa melakukan sum'ah (ingin di dengar) niscaya Allah akan mengabulkannya (akan didengar orang).\""
            },
            {
                "number": 4159,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَمُحَمَّدُ ابْنُ بِشْرٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالًا فَسَلَّطَهُ عَلَى هَلَكَتِهِ فِي الْحَقِّ وَرَجُلٌ آتَاهُ اللَّهُ حِكْمَةً فَهُوَ يَقْضِي بِهَا وَيُعَلِّمُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Ayahku] dan [Muhammad bin Bisyr] keduanya berkata; telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Qais bin Abu Hazim] dari [Abdullah bin Mas'ud] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada kedengkian kecuali dalam dua perkara; seseorang yang dikaruniai Allah harta kekayaan kemudian ia habiskan dalam jalan kebenaran, dan seseorang yang dikaruniai Allah Al Hikmah (ilmu) lalu ia mengamalkannya.\""
            },
            {
                "number": 4160,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهُوَ يَقُومُ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَهُوَ يُنْفِقُهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] dan [Muhammad bin Abdullah bin Yazid] keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [Ayahnya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hasad (dengki) kecuali dalam dua perkara; seseorang yang diberi Allah al-qur'an (Hikmah) kemudian ia mengamalkannya sepanjang siang dan malam, dan seseorang yang diberi Allah harta kekayaan, lalu ia menginfakkannya sepanjang siang dan malam.\""
            },
            {
                "number": 4161,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ وَأَحْمَدُ بْنُ الْأَزْهَر قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ عِيسَى بْنِ أَبِي عِيسَى الْحَنَّاطِ عَنْ أَبِي الزِّنَادِ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحَسَدُ يَأْكُلُ الْحَسَنَاتِ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ وَالصَّلَاةُ نُورُ الْمُؤْمِنِ وَالصِّيَامُ جُنَّةٌ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah Al Hammal] dan [Ahmad bin Al Azhar] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Isa bin Abu Isa Al Hannath] dari [Abu Az Zinad] dari [Anas], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kedengkian akan memakan kebaikan sebagaimana api memakan kayu bakar, dan sedekah akan menghapus kesalahan sebagaimana air dapat mematikan api. sholat adalah cahaya seorang mukmin, sedangkan puasa adalah perisai dari api neraka.\""
            },
            {
                "number": 4162,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ وَابْنُ عُلَيَّةَ عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ ذَنْبٍ أَجْدَرُ أَنْ يُعَجِّلَ اللَّهُ لِصَاحِبِهِ الْعُقُوبَةَ فِي الدُّنْيَا مَعَ مَا يَدَّخِرُ لَهُ فِي الْآخِرَةِ مِنْ الْبَغْيِ وَقَطِيعَةِ الرَّحِمِ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Al Hasan Al Mawarzi] telah memberitakan kepada kami [Abdullah bin Mubarak] dan [Ibnu 'Ulayyah] dari ['Uyainah bin Abdurrahman] dari [ayahnya] dari [Abu Bakrah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada perbuatan dosa yang akan di segerakan siksanya bagi pelakunya oleh Allah di dunia dan di sisakan baginya di akhirat melainkan berbuat aniaya dan memutuskan tali silaturrahmi.\""
            },
            {
                "number": 4163,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا صَالِحُ بْنُ مُوسَى عَنْ مُعَاوِيَةَ بْنِ إِسْحَقَ عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْرَعُ الْخَيْرِ ثَوَابًا الْبِرُّ وَصِلَةُ الرَّحِمِ وَأَسْرَعُ الشَّرِّ عُقُوبَةً الْبَغْيُ وَقَطِيعَةُ الرَّحِمِ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] telah menceritakan kepada kami [Shalih bin Musa] dari [Mu'awiyah bin Ishaq] dari ['Aisyah binti Thalhah] dari ['Aisyah Ummul Mukminin] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perbuatan baik yang akan di segerakan pahalanya adalah berbuat baik dan menyambung silaturrahim, sedangkan perbuatan dosa yang akan di segerakan siksanya adalah kezhaliman dan memutus tali silaturrahim.\""
            },
            {
                "number": 4164,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدٍ الْمَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ دَاوُدَ بْنِ قَيْسٍ عَنْ أَبِي سَعِيدٍ مَوْلَى بَنِي عَامِرٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَسْبُ امْرِئٍ مِنْ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid Al Madani] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Daud bin Qais] dari [Abu Sa'id bekas budak 'Amir] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Cukuplah seseorang dikatakan telah berbuat jahat jika ia merendahkan saudaranya muslim.\""
            },
            {
                "number": 4165,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سِنَانِ بْنِ سَعْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا وَلَا يَبْغِي بَعْضُكُمْ عَلَى بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] telah menceritakan kepada kami [Abdullah bin Wahb] telah memberitakan kepada kami ['Amru bin Al Harit] dari [Yazid bin Abu Habib] dari [Sinan bin Sa'd] dari [Anas bin Malik] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah mewahyukan kepadaku supaya kalian bersikap rendah hati, dan janganlah sebagian kalian berbuat aniaya terhadap sebagian yang lain.\""
            },
            {
                "number": 4166,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا أَبُو عَقِيلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ وَعَطِيَّةُ بْنُ قَيْسٍ عَنْ عَطِيَّةَ السَّعْدِيِّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبْلُغُ الْعَبْدُ أَنْ يَكُونَ مِنْ الْمُتَّقِينَ حَتَّى يَدَعَ مَا لَا بَأْسَ بِهِ حَذَرًا لِمَا بِهِ الْبَأْسُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Abu 'Aqil] telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepadaku [Rabi'ah bin Yazid] dan ['Athiyah bin Qais] dari ['Athiyah As Sa'di] -dan dia termasuk dari salah seorang sahabat Nabi shallallahu 'alaihi wasallam- dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang hamba belum mencapai derajat taqwa sehingga ia meninggalkan sesuatu yang mubah (boleh) sebagai bentuk kehati-hatian dari sesuatu yang dilarang.\""
            },
            {
                "number": 4167,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ حَدَّثَنَا مُغِيثُ بْنُ سُمَيٍّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقِيلَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ النَّاسِ أَفْضَلُ قَالَ كُلُّ مَخْمُومِ الْقَلْبِ صَدُوقِ اللِّسَانِ قَالُوا صَدُوقُ اللِّسَانِ نَعْرِفُهُ فَمَا مَخْمُومُ الْقَلْبِ قَالَ هُوَ التَّقِيُّ النَّقِيُّ لَا إِثْمَ فِيهِ وَلَا بَغْيَ وَلَا غِلَّ وَلَا حَسَدَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Yahya bin Hamzah] telah menceritakan kepada kami [Zaid bin Waqid] telah menceritakan kepada kami [Mughits bin Sumay] dari [Abdullah bin 'Amru] dia berkata; Ditanyakan kepada Rasulullah shallallahu 'alaihi wasallam; \"Manusia bagaimanakah yang paling mulia?\" Beliau menjawab: \"Senua (orang) yang hatinya bersedih dan lisan (ucapannya) benar.\" Mereka berkata; \"Perkataannya yang benar telah kami ketahui, lantas apakah maksud dari hati yang bersedirh?\" Beliau bersabda: \"Hati yang bertaqwa dan bersih, tidak ada kedurhakaan dan kelaliman padanya, serta kedengkian dan hasad.\""
            },
            {
                "number": 4168,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ أَبِي رَجَاءٍ عَنْ بُرْدِ بْنِ سِنَانٍ عَنْ مَكْحُولٍ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا هُرَيْرَةَ كُنْ وَرِعًا تَكُنْ أَعْبَدَ النَّاسِ وَكُنْ قَنِعًا تَكُنْ أَشْكَرَ النَّاسِ وَأَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ تَكُنْ مُؤْمِنًا وَأَحْسِنْ جِوَارَ مَنْ جَاوَرَكَ تَكُنْ مُسْلِمًا وَأَقِلَّ الضَّحِكَ فَإِنَّ كَثْرَةَ الضَّحِكِ تُمِيتُ الْقَلْبَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Abu Raja`] dari [Burd bin Sinan] dari [Makhul] dari [Watsilah bin Al Asqa'] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Hurairah, Jadilah kamu seorang yang wara`, niscaya kamu menjadi manusia yang paling beriabadah. Jadilah kamu menjadi seorang yang merasa kecukupan, niscaya kamu menjadi manusia yang paling bersyukur. Cintailah mmanusia seperti kamu mencintai dirimu sendiri, niscaya kamu akan menja di seorang mukmin. Perbaikilah hubungan dalam bertetangga dengan tetanggamu, niscaya kamu akan menjadi seorang yang berserah diri. Dan sedikitkanlah tertawa, karena banyak tertawa akan mematikan hati.\""
            },
            {
                "number": 4169,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ رُمْحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ الْمَاضِي بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ سُلَيْمَانَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَقْلَ كَالتَّدْبِيرِ وَلَا وَرَعَ كَالْكَفِّ وَلَا حَسَبَ كَحُسْنِ الْخُلُقِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Rumh] telah menceritakan kepada kami [Abdullah bin Wahb] dari [Al Madli bin Muhammad] dari ['Ali bin Sulaiman] dari [Al Qasim bin Muhammad] dari [Abu Idris Al Khaulani] dari [Abu Dzar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bahwasanya kesederhanaan itu bagian dari iman, dikatakan bahwa al-badzadzah itu adalah sikap sederhana."
            },
            {
                "number": 4170,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا سَلَّامُ بْنُ أَبِي مُطِيعٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَسَبُ الْمَالُ وَالْكَرَمُ التَّقْوَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Khalaf Al 'Asqalani] telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Sallam bin Abu Muthi'] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundab] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kehormatan adalah (dengan) harta sedangkan kemuliaan adalah (dengan) ketaqwaan.\""
            },
            {
                "number": 4171,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ كَهْمَسِ بْنِ الْحَسَنِ عَنْ أَبِي السَّلِيلِ ضُرَيْبِ بْنِ نُفَيْرٍ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَعْرِفُ كَلِمَةً وَقَالَ عُثْمَانُ آيَةً لَوْ أَخَذَ النَّاسُ كُلُّهُمْ بِهَا لَكَفَتْهُمْ قَالُوا يَا رَسُولَ اللَّهِ أَيَّةُ آيَةٍ قَالَ{ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا }",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] dan [Utsman bin Abu Syaibah] keduanya berkata; telah menceritakan kepada kami [Al Mu'tamir bin Sulaiman] dari [Kahmas bin Al Hasan] dari [Abu As Salil Dluraib bin Nufair] dari [Abu Dzar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saya mengetahui satu kalimat. \" sedangkan Utsman mengatakan; \"Satu ayat, sekiranya semua manusia mengambilnya niscaya ayat tersebut dapat menncukupi mereka.\" Mereka bertanya; \"Wahai Rasulullah, ayat apakah itu?\" Beliau menjawab: \"Barangsiapa bertaqwa kepada Allah, niscaya Dia akan memberikan jalan keluar baginya.\""
            },
            {
                "number": 4172,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ عَنْ أُمَيَّةَ بْنِ صَفْوَانَ عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ الثَّقَفِيِّ عَنْ أَبِيهِ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّبَاوَةِ أَوْ الْبَنَاوَةِ قَالَ وَالنَّبَاوَةُ مِنْ الطَّائِفِ قَالَ يُوشِكُ أَنْ تَعْرِفُوا أَهْلَ الْجَنَّةِ مِنْ أَهْلِ النَّارِ قَالُوا بِمَ ذَاكَ يَا رَسُولَ اللَّهِ قَالَ بِالثَّنَاءِ الْحَسَنِ وَالثَّنَاءِ السَّيِّئِ أَنْتُمْ شُهَدَاءُ اللَّهِ بَعْضُكُمْ عَلَى بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] telah memberitakan kepada kami [Nafi' bin Umar Al Jumahi] dari [Umayyah bin Shafwan] dari [Abu Bakar bin Abu Zuhair At Tsaqafi] dari [ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam berkhotbah di hadapan kami ketika berada di Nabwah atau Banawah -Abu Zuhair mengatakan; \"Nabawah adalah bagian dati daerah Tha`if.\"- sabdanya: 'Hampir-hampir saja kalian dapat mengetahui (beda antara) ahli surga dan ahli neraka.\" Mereka bertanya; \"Wahai Rasulullah, bagaimanakah hal itu dapat di ketahui?\" beliau menjawab: \"Dengan pujian yang baik dan caci maki yang buruk. Kalian adalah para saksi Allah (yang akan mempersaksikan) antara sebagian dengan sebagian yang lain.\""
            },
            {
                "number": 4173,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ جَامِعِ بْنِ شَدَّادٍ عَنْ كُلْثُومٍ الْخُزَاعِيِّ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ لِي أَنْ أَعْلَمَ إِذَا أَحْسَنْتُ أَنِّي قَدْ أَحْسَنْتُ وَإِذَا أَسَأْتُ أَنِّي قَدْ أَسَأْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَالَ جِيرَانُكَ قَدْ أَحْسَنْتَ فَقَدْ أَحْسَنْتَ وَإِذَا قَالُوا إِنَّكَ قَدْ أَسَأْتَ فَقَدْ أَسَأْتَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dari [All A'masy] dari [Jami' bin Syaddad] dari [Kultsum Al Khuza'i] dia berkata; \"Nabi shallallahu 'alaihi wasallam pernah di datangi seorang laki-laki seraya berkata; \"Wahai Rasulullah, bagaimanakah saya bisa mengetahui diriku jika telah berbuat baik atau berbuat jahat?\" maka beliau menjawab: \"Jika tetanggamu mengatakan bahwa kamu telah berbuat baik, berarti kamu telah berbuat baik. Namun jika tetanggamu mengatakan bahwa kamu berbuat jahat, berarti kamu telah berbuat jahat.\""
            },
            {
                "number": 4174,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَجُلٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ لِي أَنْ أَعْلَمَ إِذَا أَحْسَنْتُ وَإِذَا أَسَأْتُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَمِعْتَ جِيرَانَكَ يَقُولُونَ أَنْ قَدْ أَحْسَنْتَ فَقَدْ أَحْسَنْتَ وَإِذَا سَمِعْتَهُمْ يَقُولُونَ قَدْ أَسَأْتَ فَقَدْ أَسَأْتَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Ma'mar] dari [Manshur] dari [Abu Wa`il] dari [Abdullah] dia berkata; seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Bagaimanakah seharusnya aku dapat mengetahui bahwa aku telah berbuat baik dan telah berbuat jahat?\" Beliau menjawab: \"Apabila kamu mendengar bahwa tetanggamu mengatakan bahwa kamu telah berbuat baik, maka kamu adalah orang baik. Namun jika kamu mendengar tetanggamu mengatakan bahwa kamu telah berbuat jahat, maka kamu adalah orang jahat.\""
            },
            {
                "number": 4175,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَزَيْدُ بْنُ أَخْزَمَ قَالَا حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو هِلَالٍ حَدَّثَنَا عُقْبَةُ بْنُ أَبِي ثُبَيْتٍ عَنْ أَبِي الْجَوْزَاءِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْلُ الْجَنَّةِ مَنْ مَلَأَ اللَّهَ أُذُنَيْهِ مِنْ ثَنَاءِ النَّاسِ خَيْرًا وَهُوَ يَسْمَعُ وَأَهْلُ النَّارِ مَنْ مَلَأَ أُذُنَيْهِ مِنْ ثَنَاءِ النَّاسِ شَرًّا وَهُوَ يَسْمَعُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Ziad bin Ahzam] keduanya berkata; telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Abu Hilal] telah menceritakan kepada kami ['Uqbah bin Abu Tsubait] dari [Abu Al Jauzza`] dari [Ibnu Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penghuni surga adalah orang yang di penuhi kedua telinganya oleh Allah dengan pujian yang baik dari manusia, dan ia pun mendengarnya. Sedangkan penghuni neraka adalah orang yang kedua telionganya di penuhi oleh Allah dengan cacian yang buruk dari manusia dan dia pun mendengarnya.\""
            },
            {
                "number": 4176,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ لَهُ الرَّجُلُ يَعْمَلُ الْعَمَلَ لِلَّهِ فَيُحِبُّهُ النَّاسُ عَلَيْهِ قَالَ ذَلِكَ عَاجِلُ بُشْرَى الْمُؤْمِنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu 'Imran Al Jauni] dari [Abdullah bin As Shamit] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, Abu Dzar berkata; saya bertanya kepada beliau; \"Seorang laki-laki beramal karena Allah, maka manusia menjadi cinta dengan amalan laki-laki tersebut.\" Beliau bersabda: \"Itu adalah kabar gembira yang di segerakan untuk orang Mukmin.\""
            },
            {
                "number": 4177,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا سَعِيدُ بْنُ سِنَانٍ أَبُو سِنَانٍ الشَّيْبَانِيُّ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي أَعْمَلُ الْعَمَلَ فَيُطَّلَعُ عَلَيْهِ فَيُعْجِبُنِي قَالَ لَكَ أَجْرَانِ أَجْرُ السِّرِّ وَأَجْرُ الْعَلَانِيَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Sa'id bin Sinan Abu Sinan As Syaibani] dari [Habib bin Abu Tsabit] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; seorang laki-laki bertanya; \"Wahai Rasulullah, sesungguhnya saya telah melakukan suatu amalan, lantas amalan tersebut di perlihatkan kepadaku hingga saya kagum dengan amalan tersebut.\" Beliau bersabda: \"Bagimu dua pahala, pahala ketika sembunyi-sembunyi dan ketika di tampakkan.\""
            },
            {
                "number": 4178,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ قَالَا أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ التَّيْمِيَّ أَخْبَرَهُ أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِ وَهُوَ يَخْطُبُ النَّاسَ فَقَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ وَلِكُلِّ امْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Rumh] telah memberitakan kepada kami [Al Laits bin Sa'd] keduanya berkata; telah memberitakan kepada kami [Yahya bin Sa'id] bahwa [Muhammad bin Ibrahim At Taimi] telah mengabarkan bahwa dia pernah mendengar ['Alqamah bin Waqash] bahwa dia mendengar [Umar bin Khatthab] sedang berkhotbah di hadapan manusia, katanya;; \"saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setiap amalan sesuai dengan niat, dan balasan bagi seseorang itu sesuai dengan apa yang di niatkannya. Maka barangsiapa hijrahnya untuk Allah dan Rasul-Nya maka pahala hijrahnya karena Allah dan Rasul-Nya, dan barangsiapa hijrahnya untuk dunia atau wanita yang akan di nikahinya, maka balasan hijrahnya sesuai dengan tujuan hijrahnya tersebut.\""
            },
            {
                "number": 4179,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ أَبِي كَبْشَةَ الْأَنْمَارِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ هَذِهِ الْأُمَّةِ كَمَثَلِ أَرْبَعَةِ نَفَرٍ رَجُلٌ آتَاهُ اللَّهُ مَالًا وَعِلْمًا فَهُوَ يَعْمَلُ بِعِلْمِهِ فِي مَالِهِ يُنْفِقُهُ فِي حَقِّهِ وَرَجُلٌ آتَاهُ اللَّهُ عِلْمًا وَلَمْ يُؤْتِهِ مَالًا فَهُوَ يَقُولُ لَوْ كَانَ لِي مِثْلُ هَذَا عَمِلْتُ فِيهِ مِثْلَ الَّذِي يَعْمَلُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُمَا فِي الْأَجْرِ سَوَاءٌ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا وَلَمْ يُؤْتِهِ عِلْمًا فَهُوَ يَخْبِطُ فِي مَالِهِ يُنْفِقُهُ فِي غَيْرِ حَقِّهِ وَرَجُلٌ لَمْ يُؤْتِهِ اللَّهُ عِلْمًا وَلَا مَالًا فَهُوَ يَقُولُ لَوْ كَانَ لِي مِثْلُ هَذَا عَمِلْتُ فِيهِ مِثْلَ الَّذِي يَعْمَلُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُمَا فِي الْوِزْرِ سَوَاءٌحَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ الْمَرْوَزِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ ابْنِ أَبِي كَبْشَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ سَمُرَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُفَضَّلٍ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ ابْنِ أَبِي كَبْشَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dari [Salim bin Abu Ja'd] dari [Abu Kabsyah Al Anmari] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Permisalan ummat ini bagaikan empat orang laki-laki, yaitu; seorang laki-laki yang di berikan oleh Allah berupa harta dan ilmu, kemudian dia membelanjakan hartanya sesuai dengan ilmunya. Seseorang yang diberi oleh Allah berupa ilmu dan tidak di berikan harta, lalu dia berkata; \"Seandainya saya memiliki seperti yang di miliki orang ini, niscaya saya akan berbuat seperti yang ia perbuat.\" Maka dalam urusan pahala, mereka berdua sama. Dan seorang laki-laki yang diberi oleh Allah berupa harta dan tidak diberi ilmu, maka ia menyia-nyiakan hartanya dan tidak membelanjakannya bukan kepada jalan yang benar. Serta seorang laki-laki yang tidak di beri oleh Allah berupa harta dan juga ilmu, lalu dia berkata; \"Seandainya aku memiliki seperti yang di miliki orang ini, niscaya aku akan berbuat seperti yang ia perbuat.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maka dalam urusan dosa, mereka berdua sama.\" Telah menceritakan kepada kami [Ishaq bin Manshur Al Mawarzi] telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Ma'mar] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [Ibnu Abu Kabsyah] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam. Dan dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Isma'il bin Samurah] telah menceritakan kepada kami [Abu Usamah] dari [Mufadlal] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [Ibnu Abu Kabsyah] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
            },
            {
                "number": 4180,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَمُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ شَرِيكٍ عَنْ لَيْثٍ عَنْ طَاوُسٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا يُبْعَثُ النَّاسُ عَلَى نِيَّاتِهِمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] dan [Muhammad bin Yahya] keduanya berkata; telah menceritakan kepada kami [Yazid bin Harun] dari [Syarik] dari [Laits] dari [Thawus] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hanyasanya manusia akan dikumpulkan sesuai dengan niat mereka masing-masing.\""
            },
            {
                "number": 4181,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ أَنْبَأَنَا زَكَرِيَّا بْنُ عَدِيٍّ أَنْبَأَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحْشَرُ النَّاسُ عَلَى نِيَّاتِهِمْ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Muhammad] telah memberitakan kepada kami [Zakariya bin 'Adi] telah memberitakan kepada kami [Syarik] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia akan di kumpulkan sesuai dengan niat mereka masing-masing.\""
            },
            {
                "number": 4182,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ وَأَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي أَبِي عَنْ أَبِي يَعْلَى عَنْ الرَّبِيعِ بْنِ خُثَيْمٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ خَطَّ خَطًّا مُرَبَّعًا وَخَطًّا وَسَطَ الْخَطِّ الْمُرَبَّعِ وَخُطُوطًا إِلَى جَانِبِ الْخَطِّ الَّذِي وَسَطَ الْخَطِّ الْمُرَبَّعِ وَخَطًّا خَارِجًا مِنْ الْخَطِّ الْمُرَبَّعِ فَقَالَ أَتَدْرُونَ مَا هَذَا قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ هَذَا الْإِنْسَانُ الْخَطُّ الْأَوْسَطُ وَهَذِهِ الْخُطُوطُ إِلَى جَنْبِهِ الْأَعْرَاضُ تَنْهَشُهُ أَوْ تَنْهَسُهُ مِنْ كُلِّ مَكَانٍ فَإِنْ أَخْطَأَهُ هَذَا أَصَابَهُ هَذَا وَالْخَطُّ الْمُرَبَّعُ الْأَجَلُ الْمُحِيطُ وَالْخَطُّ الْخَارِجُ الْأَمَلُ",
                "id": "Telah menceritakan kepada kami [Abu Bisyir Bakar bin Khalaf] dan [Abu Bakar bin Khallad Al Bahili] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Sufyan] telah menceritakan kepadaku [ayahku] dari [Abu Ya'la] dari [Ar Rabi' bin Hutsaim] dari [Abdullah bin Mas'ud] dari Nabi shallallahu 'alaihi wasallam bahwa beliau membuat garis persegi empat dan menggaris tengah di persegi empat tersebut, dan membuat beberapa garis pada sisi garis tengah dari tengah garis tersebut serta satu garis di luar garis segi empat tersebut. Lalu beliau bersabda: \"Tahukah kalian apakah ini?\" para sahabat menjawab; \"Allah dan Rasul-Nya yang lebih mengetahui.\" Beliau bersabda: \"Ini adalah manusia berada di garis tengah, sementara garis-garis ini (yang berada di sisinya) adalah rintangan-rintangan yang menghimpit -atau yang menggigitnya- dari segala tempat. Jika ia berbuat salah, maka ia akan terkena garis ini. Adapun garis segi empat yang mengitarinya adalah ajal yang mengelilinya. Dan garis yang berada di luar adalah cita-citanya.\""
            },
            {
                "number": 4183,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا ابْنُ آدَمَ وَهَذَا أَجَلُهُ عِنْدَ قَفَاهُ وَبَسَطَ يَدَهُ أَمَامَهُ ثُمَّ قَالَ وَثَمَّ أَمَلُهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah menceritakan kepada kami [An Nadlr bin Syumail] telah memberitakan kepada kami [Hammad bin Salamah] dari ['Ubaidillah bin Abu Bakar] dia berkata; saya mendengar [Anas bin Malik] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ini adalah anak Adam dan ini adalah ajalnya terletak di tengkuknya.\" Sambil merentangkan tangan beliau di hadapannya sambil bersabda: \"Dan kemudian (ini) adalah cita-citanya.\""
            },
            {
                "number": 4184,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَلْبُ الشَّيْخِ شَابٌّ فِي حُبِّ اثْنَتَيْنِ فِي حُبِّ الْحَيَاةِ وَكَثْرَةِ الْمَالِ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Muhammad bin Utsman Al 'Utsmani] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Al 'Ala` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] dia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hati orang tua masih akan tetap muda dalam mencintai dua perkara, yaitu; cinta dunia dan banyaknya harta kekayaan.\""
            },
            {
                "number": 4185,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَهْرَمُ ابْنُ آدَمَ وَيَشِبُّ مِنْهُ اثْنَتَانِ الْحِرْصُ عَلَى الْمَالِ وَالْحِرْصُ عَلَى الْعُمُرِ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Mu'adz Ad Dlarir] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak Adam akan menua, namun ia masih tetap berjiwa muda dalam dua hal, yaitu; rakus terhadap harta kekayaan dan umur yang panjang.\""
            },
            {
                "number": 4186,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ لِابْنِ آدَمَ وَادِيَيْنِ مِنْ مَالٍ لَأَحَبَّ أَنْ يَكُونَ مَعَهُمَا ثَالِثٌ وَلَا يَمْلَأُ نَفْسَهُ إِلَّا التُّرَابُ وَيَتُوبُ اللَّهُ عَلَى مَنْ تَابَ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Al 'Utsmani] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Al 'Ala` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya anak adam memiliki dua lembah yang berisikan harta kekayaan, niscaya ia akan sangat berharap memiliki lembah ketiganya. Dan tidaklah ia memenuhi dirinya melainkan hanya dengan debu, dan Allah hanya mengampuni orang-orang yang bertaubat.\""
            },
            {
                "number": 4187,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الْمُحَارِبِيُّ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَعْمَارُ أُمَّتِي مَا بَيْنَ السِّتِّينَ إِلَى السَّبْعِينَ وَأَقَلُّهُمْ مَنْ يَجُوزُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin 'Arafah] telah menceritakan kepadaku [Abdurrahman bin Muhammad Al Muharibi] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Usia ummatku berkisar antara enam puluh sampai tujuh puluh tahun, dan sedikit sekali mereka yang melebihi (usia) tersebut.\""
            },
            {
                "number": 4188,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْوَالَّذِي ذَهَبَ بِنَفْسِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَاتَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ وَهُوَ جَالِسٌ وَكَانَ أَحَبَّ الْأَعْمَالِ إِلَيْهِ الْعَمَلُ الصَّالِحُ الَّذِي يَدُومُ عَلَيْهِ الْعَبْدُ وَإِنْ كَانَ يَسِيرًا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Abu Salamah] dari [Ummu Salamah] dia berkata; \"Demi dzat yang telah mengambil jiwa beliau shallallahu 'alaihi wasallam, tidaklah beliau meninggal dunia hingga kebanyakan sholat yang di kerjakannya dengan posisi duduk, dan amalan yang paling di cintai oleh beliau adalah amal Shalih yang di kerjakan seorang hamba secara terus menerus walaupun sedikit.\""
            },
            {
                "number": 4189,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَتْ عِنْدِي امْرَأَةٌ فَدَخَلَ عَلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ هَذِهِ قُلْتُ فُلَانَةُ لَا تَنَامُ تَذْكُرُ مِنْ صَلَاتِهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَهْ عَلَيْكُمْ بِمَا تُطِيقُونَ فَوَاللَّهِ لَا يَمَلُّ اللَّهُ حَتَّى تَمَلُّوا قَالَتْ وَكَانَ أَحَبَّ الدِّينَ إِلَيْهِ الَّذِي يَدُومُ عَلَيْهِ صَاحِبُهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin 'Urwah] dari [ayahnya] dari ['Aisyah] dia berkata; seorang wanita tengah bersamaku, lalu Nabi shallallahu 'alaihi wasallam menemuiku seraya bertanya: \"Siapakah wanita ini?\" Jawabku; \"Fulanah. Yang tidak pernah tidur. -'Aisyah menyebutkan tentang kebiasaan sholatnya- Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Tinggalkanlah (perbuatan itu), kerjakanlah amalan semampu kalian, demi Allah, Allah tidak akan merasa bosan hingga kalian sendirilah yang merasa bosan.\" 'Aisyah berkata; \"Sesungguhnya (pelaksanaan) agama yang paling beliau cintai adalah yang selalu di kerjakan terus menerus oleh pelakunya.\""
            },
            {
                "number": 4190,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ عَنْ سُفْيَانَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي عُثْمَانَ عَنْ حَنْظَلَةَ الْكَاتِبِ التَّمِيمِيِّ الْأُسَيِّدِيِّ قَالَكُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا الْجَنَّةَ وَالنَّارَ حَتَّى كَأَنَّا رَأْيَ الْعَيْنِ فَقُمْتُ إِلَى أَهْلِي وَوَلَدِي فَضَحِكْتُ وَلَعِبْتُ قَالَ فَذَكَرْتُ الَّذِي كُنَّا فِيهِ فَخَرَجْتُ فَلَقِيتُ أَبَا بَكْرٍ فَقُلْتُ نَافَقْتُ نَافَقْتُ فَقَالَ أَبُو بَكْرٍ إِنَّا لَنَفْعَلُهُ فَذَهَبَ حَنْظَلَةُ فَذَكَرَهُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا حَنْظَلَةُ لَوْ كُنْتُمْ كَمَا تَكُونُونَ عِنْدِي لَصَافَحَتْكُمْ الْمَلَائِكَةُ عَلَى فُرُشِكُمْ أَوْ عَلَى طُرُقِكُمْ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Al Fadl bin Dukain] dari [Sufyan] dari [Al Jurairi] dari [Abu 'Utsman] dari [Handlalah Al Katib At Tamimi Al Usaiyidi] dia berkata; \"Kami pernah berada di sisi Rasulullah shallallahu 'alaihi wasallam, beliau pun menceritakan kepada kami tentang surga dan neraka sehingga seakan-akan kamui melihatnya dengan mata kepala saya sendiri. Namun setelah kami menemui istri dan anak-anakku, maka akupun kembali tertawa dan bercanda.\" Handlalah berkata; Lalu kuingat suasana ketika kami bersama Nabi shallallahu 'alaihi wasallam, lantas aku segera keluar dan bertemu dengan Abu Bakar, saya berkata; \"Aku telah berbuat kemunafikan, aku telah berbuat kemunafikan.\" Abu Bakar berkata; \"Sungguh kita memang pernah melakukannya.\" Kemudian Handlalah pergi dan menceritakan hal itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Wahai Handlalah, seandainya kamu dapat terus berada pada kondisimu seperti saat kamu berada di sisiku, niscara para Malaikat akan selalu menyalamimu di setiap jalanmu -atau di setiap jalan-jalanmu- wahai Handlalah, sedikit demi sedikitlah (dalam beramal).\""
            },
            {
                "number": 4191,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْأَعْرَجُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اكْلَفُوا مِنْ الْعَمَلِ مَا تُطِيقُونَ فَإِنَّ خَيْرَ الْعَمَلِ أَدْوَمُهُ وَإِنْ قَلَّ",
                "id": "Telah menceritakan kepada kami [Al 'Abbas bin 'Ustman Ad Dimasyqi] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abdurrahman Al A'raj] saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Laksanakanlah oleh kalian amalan semampu kalian, sesungguhnya sebaik-baik amalan adalah yang di kerjakan secara terus menerus walaupun sedikit.\""
            },
            {
                "number": 4192,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ اللَّهِ الْأَشْعَرِيُّ عَنْ عِيسَى بْنِ جَارِيَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَجُلٍ يُصَلِّي عَلَى صَخْرَةٍ فَأَتَى نَاحِيَةَ مَكَّةَ فَمَكَثَ مَلِيًّا ثُمَّ انْصَرَفَ فَوَجَدَ الرَّجُلَ يُصَلِّي عَلَى حَالِهِ فَقَامَ فَجَمَعَ يَدَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ عَلَيْكُمْ بِالْقَصْدِ ثَلَاثًا فَإِنَّ اللَّهَ لَا يَمَلُّ حَتَّى تَمَلُّوا",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] telah menceritakan kepada kami [Ya'qub bin Abdullah Al Asy'ari] dari [Isa bin Jariyah] dari [Jabir bin Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam melewati seseorang yang sedang sholat di atas batu, lalu beliau pergi ke arah Makkah dan berdiam diri cukup lama di sana, lalu beliau kembali dan mendapatkan laki-laki tersebut masih sholat seperti sebelumnya, maka beliau bangkit dan menggabungkan kedua tangannya seraya bersabda: \"Wahai sekalian manusia, bersikaplah pertengahan -beliau mengatakannya hingga tiga kali- sesungguhnya Allah tidak akan merasa bosan, sampai kalian sendiri yang merasa bosan.\""
            },
            {
                "number": 4193,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ وَأَبِي عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَقُلْنَا يَا رَسُولَ اللَّهِ أَنُؤَاخَذُ بِمَا كُنَّا نَعْمَلُ فِي الْجَاهِلِيَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَحْسَنَ فِي الْإِسْلَامِ لَمْ يُؤَاخَذْ بِمَا كَانَ فِي الْجَاهِلِيَّةِ وَمَنْ أَسَاءَ أُخِذَ بِالْأَوَّلِ وَالْآخِرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Waki'] dan [ayahku] dari [Al A'masy] dari [Syaqiq] dari [Abdullah] dia berkata; kami bertanya; \"Wahai Rasulullah, apakah kami juga akan di siksa atas apa yang pernah kami lakukan di masa Jahiliyah?\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berbuat kebaikan setelah masuk Islam, maka ia tidak akan disiksa atas apa yang pernah di perbuatnya di masa Jahiliyah, namun jika di berbuat kejelekan (setelah masuk Islam), maka ia akan disiksa baik sebelumnya dan juga sesudahnya.\""
            },
            {
                "number": 4194,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِي سَعِيدُ بْنُ مُسْلِمِ بْنِ بَانَكَ سَمِعْتُ عَامِرَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ يَقُولُ حَدَّثَنِي عَوْفُ بْنُ الْحَارِثِ عَنْ عَائِشَةَ قَالَتْقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَائِشَةُ إِيَّاكِ وَمُحَقَّرَاتِ الْأَعْمَالِ فَإِنَّ لَهَا مِنْ اللَّهِ طَالِبًا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepadaku [Sa'id bin Muslim bin Banak] saya mendengar ['Amir bin Abdullah bin Az Zubair] berkata; telah menceritakan kepadaku ['Auf bin Al Harits] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: Wahai 'Aisyah, jauhilah olehmu perbuatan-pebuatan tercela, karena sesungguhnya perbuatan-perbuatan itu akan di tuntut oleh Allah.\""
            },
            {
                "number": 4195,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ وَالْوَلِيدُ بْنُ مُسْلِمٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمُؤْمِنَ إِذَا أَذْنَبَ كَانَتْ نُكْتَةٌ سَوْدَاءُ فِي قَلْبِهِ فَإِنْ تَابَ وَنَزَعَ وَاسْتَغْفَرَ صُقِلَ قَلْبُهُ فَإِنْ زَادَ زَادَتْ فَذَلِكَ الرَّانُ الَّذِي ذَكَرَهُ اللَّهُ فِي كِتَابِهِ{ كَلَّا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ }",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Hatim bin Isma'il] dan [Walid bin Muslim] keduanya berkata; telah menceritakan kepada kami [Muhammad bin 'Ajlan] dari [Al Qa'qa' bin Hakim] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya apabila seorang mukmin berbuat dosa, maka akan ada titik hitam di dalam hatinya, jika ia bertaubat, meninggalkannya serta meminta ampun naka hatinya akan kembali putih, namun jika ia menambah (dosanya) maka akan bertambah (titik hitam), maka itulah penutup (hati) yang di sebutkan dalam firman Allah dalam kitab-Nya; \"Sekali-kali tidak (demikian), Sebenarnya apa yang selalu mereka usahakan itu menutupi hati mereka.\" (QS Al Muthafifin; 14)."
            },
            {
                "number": 4196,
                "arab": "حَدَّثَنَا عِيسَى بْنُ يُونُسَ الرَّمْلِيُّ حَدَّثَنَا عُقْبَةُ بْنُ عَلْقَمَةَ بْنِ خَدِيجٍ الْمَعَافِرِيُّ عَنْ أَرْطَاةَ بْنِ الْمُنْذِرِ عَنْ أَبِي عَامِرٍ الْأَلْهَانِيِّ عَنْ ثَوْبَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَأَعْلَمَنَّ أَقْوَامًا مِنْ أُمَّتِي يَأْتُونَ يَوْمَ الْقِيَامَةِ بِحَسَنَاتٍ أَمْثَالِ جِبَالِ تِهَامَةَ بِيضًا فَيَجْعَلُهَا اللَّهُ عَزَّ وَجَلَّ هَبَاءً مَنْثُورًا قَالَ ثَوْبَانُ يَا رَسُولَ اللَّهِ صِفْهُمْ لَنَا جَلِّهِمْ لَنَا أَنْ لَا نَكُونَ مِنْهُمْ وَنَحْنُ لَا نَعْلَمُ قَالَ أَمَا إِنَّهُمْ إِخْوَانُكُمْ وَمِنْ جِلْدَتِكُمْ وَيَأْخُذُونَ مِنْ اللَّيْلِ كَمَا تَأْخُذُونَ وَلَكِنَّهُمْ أَقْوَامٌ إِذَا خَلَوْا بِمَحَارِمِ اللَّهِ انْتَهَكُوهَا",
                "id": "Telah menceritakan kepada kami [Isa bin Yunus Ar Ramli] telah menceritakan kepada kami ['Uqbah bin 'Alqamah bin Khadij Al Mu'afiri] dari [Arthah bin Al Mundzir] dari [Abu 'Amir Al Hani] dari [Tsauban] dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Sungguh saya telah mengetahui bahwa ada suatu kaum dari ummatku yang datang pada hari Kiamat dengan membawa kebaikan sebesar gunung Tihamah yang putih, lantas Allah menjadikannya sia-sia.\" Tsauban berkata; \"Wahai Rasulullah, sebutkanlah ciri-ciri mereka kepada kami, dan jelaskanlah tentang mereka kepada kami, supaya kami tidak menjadi seperti mereka sementara kami tidak mengetahuinya.\" Beliau bersabda: \"Sesungguhnya mereka adalah saudara-saudara kalian dan dari golongan kalian, mereka sholat malam sebagaimana kalian mengerjakannya, tetapi mereka adalah kaum yang jika kembali kepada apa yang di haramkan Allah, maka mereka terus mengerjakannya.\""
            },
            {
                "number": 4197,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ أَبِيهِ وَعَمِّهِ عَنْ جَدِّهِ عَنْ أَبِي هُرَيْرَةَ قَالَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَكْثَرُ مَا يُدْخِلُ الْجَنَّةَ قَالَ التَّقْوَى وَحُسْنُ الْخُلُقِ وَسُئِلَ مَا أَكْثَرُ مَا يُدْخِلُ النَّارَ قَالَ الْأَجْوَفَانِ الْفَمُ وَالْفَرْجُ",
                "id": "Telah menceritakan kepada kami [Harun bin Ishaq] dan [Abdullah bin Sa'id] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Idris] dari [ayahnya] dan [pamannya] dari [kakeknya] dari [Abu Hurairah] dia berkata; Nabi shallallahu 'alaihi wasallam pernah di tanya; \"perkara apa yang banyak menyebabkan masuk surga?\" beliau menjawab: \"taqwa kepada Allah dan akhlak yang mulia.\" Dan beliau di tanya; \"Perkara apa yang banyak menyebabkan masuk neraka?\" beliau menjawab: \"Dua rongga yang terbuka yaitu mulut dan kemaluan.\""
            },
            {
                "number": 4198,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا وَرْقَاءُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَفْرَحُ بِتَوْبَةِ أَحَدِكُمْ مِنْهُ بِضَالَّتِهِ إِذَا وَجَدَهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Syababah] telah menceritakan kepada kami [Warqa`] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya Allah 'azza wajalla lebih bergembira dengan taubat salah seorang dari kalian, daripada seseorang dari kalian menemukan barang bawaannya yang telah lama hilang.\""
            },
            {
                "number": 4199,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ الْمَدِينِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَخْطَأْتُمْ حَتَّى تَبْلُغَ خَطَايَاكُمْ السَّمَاءَ ثُمَّ تُبْتُمْ لَتَابَ عَلَيْكُمْ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib Al Madini] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Ja'far bin Burqan] dari [Yazid bin Al Asham] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sekiranya kalian melakukan kesalahan hingga kesalahan kalian mencapai langit dan bumi, kemudian kalian bertaubat, niscaya taubat kalian akan di terima.\""
            },
            {
                "number": 4200,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَلَّهُ أَفْرَحُ بِتَوْبَةِ عَبْدِهِ مِنْ رَجُلٍ أَضَلَّ رَاحِلَتَهُ بِفَلَاةٍ مِنْ الْأَرْضِ فَالْتَمَسَهَا حَتَّى إِذَا أَعْيَى تَسَجَّى بِثَوْبِهِ فَبَيْنَا هُوَ كَذَلِكَ إِذْ سَمِعَ وَجْبَةَ الرَّاحِلَةِ حَيْثُ فَقَدَهَا فَكَشَفَ الثَّوْبَ عَنْ وَجْهِهِ فَإِذَا هُوَ بِرَاحِلَتِهِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [ayahku] dari [Fudlail bin Marzuq] dari ['Athiyah] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah lebih berbahagia dengan taubat hamba-Nya dari bahagianya seseorang yang kehilangan kendaraan (unta) yang membawa seluruh kebutuhan hidupnya dalam perjalanan di padang pasir yang sangat luas, ketika dia sudah berusaha mencari kemana-mana, dan berhenti dengan menutup pakaiannya, tiba-tiba dia mendengar suara, setelah menyingkap pakaiannya tiba-tiba ia mendapatkan kendaraannya berada di hadapannya.\""
            },
            {
                "number": 4201,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ حَدَّثَنَا مَعْمَرٌ عَنْ عَبْدِ الْكَرِيمِ عَنْ أَبِي عُبَيْدَةَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّائِبُ مِنْ الذَّنْبِ كَمَنْ لَا ذَنْبَ لَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi] telah menceritakan kepada kami [Muhammad bin Abdullah Ar Raqasy] telah menceritakan kepada kami [Wuhaib bin Khalid] telah menceritakan kepada kami [Ma'mar] dari [Abdul Karim] dari [Abu 'Ubaidah bin Abdullah] dari [ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang bertaubat dari dosa, bagaikan seorang yang tidak berdosa.\""
            },
            {
                "number": 4202,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا عَلِيُّ بْنُ مَسْعَدَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَنِي آدَمَ خَطَّاءٌ وَخَيْرُ الْخَطَّائِينَ التَّوَّابُونَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Zaid bin Hubab] telah menceritakan kepada kami [Ali bin Mas'adah] dari [Qatadah] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semua bani Adam pernah melakukan kesalahan, dan sebaik-baik orang yang salah adalah yang segera bertaubat.\""
            },
            {
                "number": 4203,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ زِيَادِ بْنِ أَبِي مَرْيَمَ عَنْ ابْنِ مَعْقِلٍ قَالَ دَخَلْتُ مَعَ أَبِي عَلَى عَبْدِ اللَّهِ فَسَمِعْتُهُ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّدَمُ تَوْبَةٌ فَقَالَ لَهُ أَبِي أَنْتَ سَمِعْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ النَّدَمُ تَوْبَةٌ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Sufyan] dari [Abdul Karim Al Jazari] dari [Ziyad bin Abu Maryam] dari [Ibnu Ma'qil] dia berkata; saya bersama ayahku menemui [Abdullah], maka saya mendengar dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penyesalan adalah bentuk taubat.\" Maka ayahku bertanya kepadanya; \"Apakah kamu mendengarnya dari Rasulullah shallallahu 'alaihi wasallam bahwa penyesalan adalah taubat?\" dia menjawab; \"Ya.\""
            },
            {
                "number": 4204,
                "arab": "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ أَنْبَأَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ ابْنِ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ",
                "id": "Telah menceritakan kepada kami [Rasyid bin Sa'id Ar Ramli] telah memberitakan kepada kami [Al Walid bin Muslim] dari [Ibnu Tsauban] dari [ayahnya] dari [Makhul] dari [Jubair bin Nufair] dari [Abdullah bin Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya Allah 'azza wajalla akan menerima taubat seorang hamba, selagi ia belum sakaratul maut.\""
            },
            {
                "number": 4205,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ قَالَ قَالَ الزُّهْرِيُّ أَلَا أُحَدِّثُكَ بِحَدِيثَيْنِ عَجِيبَيْنِ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَسْرَفَ رَجُلٌ عَلَى نَفْسِهِ فَلَمَّا حَضَرَهُ الْمَوْتُ أَوْصَى بَنِيهِ فَقَالَ إِذَا أَنَا مِتُّ فَأَحْرِقُونِي ثُمَّ اسْحَقُونِي ثُمَّ ذَرُّونِي فِي الرِّيحِ فِي الْبَحْرِ فَوَاللَّهِ لَئِنْ قَدَرَ عَلَيَّ رَبِّي لَيُعَذِّبُنِي عَذَابًا مَا عَذَّبَهُ أَحَدًا قَالَ فَفَعَلُوا بِهِ ذَلِكَ فَقَالَ لِلْأَرْضِ أَدِّي مَا أَخَذْتِ فَإِذَا هُوَ قَائِمٌ فَقَالَ لَهُ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ قَالَ خَشْيَتُكَ أَوْ مَخَافَتُكَ يَا رَبِّ فَغَفَرَ لَهُ لِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Ishaq bin Manshur] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Ma'mar] dia berkata; [Az Zuhri] berkata; \"Maukah aku ceritakan kepadamu dua hadits yang menakjubkan? Telah mengabarkan kepadaku [Humaid bin Abdurrahman] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Seorang laki-laki telah berbuat aniaya terhadap dirinya sendiri, ketika kematian telah tiba, ia berwasiat kepada anaknya seraya berkata; \"Apabila aku mati, maka bakarlah jasadku, kemudian jadikanlah aku debu, dan tebarkanlah debu itu biar di terpa angin laut. Demi Allah, seandainya Rabbku telah menentukan adzabku, tidaklah akan ada yang dapat mengadzabku.\" Beliau kembali bersabda: \"Kemudian mereka melaksanakannya, lantas di katakanlah kepada bumi; \"Kembalikanlah apa yang telah kamu ambil.\" Maka tiba-tiba orang tersebut telah berdiri, lalu di tanyakan kepadanya; \"Apa yang mendorongmu melakukan perbuatan itu?\" lelaki itu menjawab; \"Karena takut kepada-Mu wahai Rabbku.\" Maka ia pun di ampuni.\""
            },
            {
                "number": 4206,
                "arab": "قَالَ الزُّهْرِيُّ وَحَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دَخَلَتْ امْرَأَةٌ النَّارَ فِي هِرَّةٍ رَبَطَتْهَا فَلَا هِيَ أَطْعَمَتْهَا وَلَا هِيَ أَرْسَلَتْهَا تَأْكُلُ مِنْ خَشَاشِ الْأَرْضِ حَتَّى مَاتَتْقَالَ الزُّهْرِيُّ لِئَلَّا يَتَّكِلَ رَجُلٌ وَلَا يَيْئَسَ رَجُلٌ",
                "id": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya) [Az Zuhri] berkata; dan telah menceritakan kepadaku [Humaid bin Abdurrahman] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Seorang wanita masuk neraka karena seekor kucing yang di karungnya, ia tidak memberinya makan dan tidak juga melepasnya hingga ia dapat mencari makan dari hewan bumi sampai mati.\" Az Zuhri berkata; \"Supaya seseorang itu tidak hanya bertawakkal dan tidak berputus asa.\""
            },
            {
                "number": 4207,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُوسَى بْنِ الْمُسَيَّبِ الثَّقَفِيِّ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ يَا عِبَادِي كُلُّكُمْ مُذْنِبٌ إِلَّا مَنْ عَافَيْتُ فَسَلُونِي الْمَغْفِرَةَ فَأَغْفِرَ لَكُمْ وَمَنْ عَلِمَ مِنْكُمْ أَنِّي ذُو قُدْرَةٍ عَلَى الْمَغْفِرَةِ فَاسْتَغْفَرَنِي بِقُدْرَتِي غَفَرْتُ لَهُ وَكُلُّكُمْ ضَالٌّ إِلَّا مَنْ هَدَيْتُ فَسَلُونِي الْهُدَى أَهْدِكُمْ وَكُلُّكُمْ فَقِيرٌ إِلَّا مَنْ أَغْنَيْتُ فَسَلُونِي أَرْزُقْكُمْ وَلَوْ أَنَّ حَيَّكُمْ وَمَيِّتَكُمْ وَأَوَّلَكُمْ وَآخِرَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمْ اجْتَمَعُوا فَكَانُوا عَلَى قَلْبِ أَتْقَى عَبْدٍ مِنْ عِبَادِي لَمْ يَزِدْ فِي مُلْكِي جَنَاحُ بَعُوضَةٍ وَلَوْ اجْتَمَعُوا فَكَانُوا عَلَى قَلْبِ أَشْقَى عَبْدٍ مِنْ عِبَادِي لَمْ يَنْقُصْ مِنْ مُلْكِي جَنَاحُ بَعُوضَةٍ وَلَوْ أَنَّ حَيَّكُمْ وَمَيِّتَكُمْ وَأَوَّلَكُمْ وَآخِرَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمْ اجْتَمَعُوا فَسَأَلَ كُلُّ سَائِلٍ مِنْهُمْ مَا بَلَغَتْ أُمْنِيَّتُهُ مَا نَقَصَ مِنْ مُلْكِي إِلَّا كَمَا لَوْ أَنَّ أَحَدَكُمْ مَرَّ بِشَفَةِ الْبَحْرِ فَغَمَسَ فِيهَا إِبْرَةً ثُمَّ نَزَعَهَا ذَلِكَ بِأَنِّي جَوَادٌ مَاجِدٌ عَطَائِي كَلَامٌ إِذَا أَرَدْتُ شَيْئًا فَإِنَّمَا أَقُولُ لَهُ كُنْ فَيَكُونُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Musa bin Al Musayyab At Tsaqafi] dari [Shar bin Hausyab] dari [Abdurrahman bin Ghanmin] dari [Abu Dzar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah Tabaraka wa Ta'ala berfriman: \"Wahai hamba-Ku, sesungguhnya kalian bersalah kecuali orang yang Aku maafkan maka mintalah kepadaKu ampunan niscaya Aku akan mengampuni kalian semua dan barang siapa yang mengetahui bahwasanya Aku mempunyai kemampuan untuk mengampuni lalu dia memohon ampunan dengan kekuasaanKu itu maka Aku akan mengampuninya, kalian semuanya sesat kecuali orang yang Aku berikan hidayah maka mintalah hidayah kepadaku niscaya Aku akan memberikan hidayah kalian, setiap kalian adalah fakir kecuali orang yang Aku cukupkan maka mintalah kepadaKu niscaya Aku akan melimpahkan rizki kalian, seandainya orang yang hidup dan yang mati diantara kalian, juga orang yang pertama dan terakhir diantara kalian baik yang di laut atau yang di darat mereka semua berkumpul di atas seorang yang paling bertaqwa diantara hambaKu maka hal itu tidak akan menambah dalam kekuasaanKu meskipun sebesar sayap nyamuk demikian pula kalau mereka berkumpul atas seorang yang paling jahat diantara hambaKu maka hal itu tidak akan mengurangi sedikitpun dari kekuasaanKu seandainya orang yang hidup dan yang mati diantara kalian, juga orang yang pertama dan terakhir diantara kalian baik yang di laut atau yang di darat semua berkumpul lalu setiap orang meminta apa yang dia inginkan maka hal itu tidak akan mengurangi dari kekuasaanKu kecuali bagaikan orang yang mencelupkan jarum ke lautan kemudian mengangkat jarum itu kembali (tidak berpengaruh) hal itu karena Aku adalah Maha dermawan dan Maha mulia terhadap pemberianKu dan apabila Aku menginginkan sesuatu maka Aku akan mengatakan: \"Jadilah\" maka hal itu akan terjadi."
            },
            {
                "number": 4208,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثِرُوا ذِكْرَ هَاذِمِ اللَّذَّاتِ يَعْنِي الْمَوْتَ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Al Fadl bin Musa] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perbanyaklah mengingat sesuatu yang dapat menghancurkan kenikmatan, yaitu kematian.\""
            },
            {
                "number": 4209,
                "arab": "حَدَّثَنَا الزُّبَيْرُ بْنُ بَكَّارٍ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ حَدَّثَنَا نَافِعُ بْنُ عَبْدِ اللَّهِ عَنْ فَرْوَةَ بْنِ قَيْسٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ ابْنِ عُمَرَ أَنَّهُ قَالَكُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَهُ رَجُلٌ مِنْ الْأَنْصَارِ فَسَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ أَيُّ الْمُؤْمِنِينَ أَفْضَلُ قَالَ أَحْسَنُهُمْ خُلُقًا قَالَ فَأَيُّ الْمُؤْمِنِينَ أَكْيَسُ قَالَ أَكْثَرُهُمْ لِلْمَوْتِ ذِكْرًا وَأَحْسَنُهُمْ لِمَا بَعْدَهُ اسْتِعْدَادًا أُولَئِكَ الْأَكْيَاسُ",
                "id": "Telah mengabarkan kepada kami [Az Zubair bin Bakkar] telah mengabarkan kepada kami [Anas bin 'Iyadl] telah mengabarkan kepada kami [Nafi' bin Abdullah] dari [Farwah bin Qais] dari ['Atha` bin Abu Rabah] dari [Ibnu Umar] bahwa dia berkata; Saya bersama dengan Rasulullah shallallahu 'alaihi wasallam, tiba-tiba datang seorang laki-laki Anshar kepada beliau, lalu dia mengucapkan salam kepada Nabi shallallahu 'alaihi wasallam dan bertanya; \"Ya Rasulullah, bagaimanakah orang mukmin yang utama?\" beliau menjawab: \"Orang yang paling baik akhlaknya.\" Dia bertanya lagi; \"Orang mukmin yang bagaimanakah yang paling bijak?\" beliau menjawab: \"Orang yang paling banyak mengingat kematian, dan yang paling baik persiapannya setelah kematian, merekalah orang-orang yang bijak.\""
            },
            {
                "number": 4210,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ حَدَّثَنِي ابْنُ أَبِي مَرْيَمَ عَنْ ضَمْرَةَ بْنِ حَبِيبٍ عَنْ أَبِي يَعْلَى شَدَّادِ بْنِ أَوْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَيِّسُ مَنْ دَانَ نَفْسَهُ وَعَمِلَ لِمَا بَعْدَ الْمَوْتِ وَالْعَاجِزُ مَنْ أَتْبَعَ نَفْسَهُ هَوَاهَا ثُمَّ تَمَنَّى عَلَى اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin Abdul Malik Al Himshi] telah mengabarkan kepada kami [Baqiyah bin Al Walid] telah mengabarkan kepadaku [Ibnu Abu Maryam] dari [Dlamrah bin Habib] dari [Abu Ya'la Syaddad bin Aus] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang berakal (bijak) adalah orang yang bisa menahan nafsunya dan beramal untuk setelah kematian, dan orang yang lemah adalah orang yang mengikuti hawa nafsunya dan selalu berangan-angan (kosong) atas Allah.\""
            },
            {
                "number": 4211,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَكَمِ بْنِ أَبِي زِيَادٍ حَدَّثَنَا سَيَّارٌ حَدَّثَنَا جَعْفَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى شَابٍّ وَهُوَ فِي الْمَوْتِ فَقَالَ كَيْفَ تَجِدُكَ قَالَ أَرْجُو اللَّهَ يَا رَسُولَ اللَّهِ وَأَخَافُ ذُنُوبِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْتَمِعَانِ فِي قَلْبِ عَبْدٍ فِي مِثْلِ هَذَا الْمَوْطِنِ إِلَّا أَعْطَاهُ اللَّهُ مَا يَرْجُو وَآمَنَهُ مِمَّا يَخَافُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Al Hakam bin Abu Ziyad] telah menceritakan kepada kami [Sayyar] telah menceritakan kepada kami [Ja'far] dari [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam menemui seorang pemuda yang sedang sekaratul maut, beliau bertanya: \"Bagaimana keadaanmu?\" dia menjawab; \"Aku sangat mengharapkan Allah, wahai Rasulullah, dan aku sangat takut akan dosa-dosaku.\" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah berkumpul di dalam hati seorang hamba saat keadaan seperti ini, melainkan Allah akan memberikan kepadanya apa yang di harapkannya, dan akan di berikan rasa aman akan apa yang ia takuti.\""
            },
            {
                "number": 4212,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَيِّتُ تَحْضُرُهُ الْمَلَائِكَةُ فَإِذَا كَانَ الرَّجُلُ صَالِحًا قَالُوا اخْرُجِي أَيَّتُهَا النَّفْسُ الطَّيِّبَةُ كَانَتْ فِي الْجَسَدِ الطَّيِّبِ اخْرُجِي حَمِيدَةً وَأَبْشِرِي بِرَوْحٍ وَرَيْحَانٍ وَرَبٍّ غَيْرِ غَضْبَانَ فَلَا يَزَالُ يُقَالُ لَهَا ذَلِكَ حَتَّى تَخْرُجَ ثُمَّ يُعْرَجُ بِهَا إِلَى السَّمَاءِ فَيُفْتَحُ لَهَا فَيُقَالُ مَنْ هَذَا فَيَقُولُونَ فُلَانٌ فَيُقَالُ مَرْحَبًا بِالنَّفْسِ الطَّيِّبَةِ كَانَتْ فِي الْجَسَدِ الطَّيِّبِ ادْخُلِي حَمِيدَةً وَأَبْشِرِي بِرَوْحٍ وَرَيْحَانٍ وَرَبٍّ غَيْرِ غَضْبَانَ فَلَا يَزَالُ يُقَالُ لَهَا ذَلِكَ حَتَّى يُنْتَهَى بِهَا إِلَى السَّمَاءِ الَّتِي فِيهَا اللَّهُ عَزَّ وَجَلَّ وَإِذَا كَانَ الرَّجُلُ السُّوءُ قَالَ اخْرُجِي أَيَّتُهَا النَّفْسُ الْخَبِيثَةُ كَانَتْ فِي الْجَسَدِ الْخَبِيثِ اخْرُجِي ذَمِيمَةً وَأَبْشِرِي بِحَمِيمٍ وَغَسَّاقٍ وَآخَرَ مِنْ شَكْلِهِ أَزْوَاجٌ فَلَا يَزَالُ يُقَالُ لَهَا ذَلِكَ حَتَّى تَخْرُجَ ثُمَّ يُعْرَجُ بِهَا إِلَى السَّمَاءِ فَلَا يُفْتَحُ لَهَا فَيُقَالُ مَنْ هَذَا فَيُقَالُ فُلَانٌ فَيُقَالُ لَا مَرْحَبًا بِالنَّفْسِ الْخَبِيثَةِ كَانَتْ فِي الْجَسَدِ الْخَبِيثِ ارْجِعِي ذَمِيمَةً فَإِنَّهَا لَا تُفْتَحُ لَكِ أَبْوَابُ السَّمَاءِ فَيُرْسَلُ بِهَا مِنْ السَّمَاءِ ثُمَّ تَصِيرُ إِلَى الْقَبْرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Syababah] dari [Ibnu Abu Dzi`b] dari [Muhammad bin 'Amru bin 'Atha`] dari [Sa'id bin Yasar] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Mayit akan didatangi Malaikat, jika ia seorang yang shalih, maka para Malaikat akan berkata; \"Keluarlah wahai jiwa yang baik yang berada dalam tubuh yang baik. Keluarlah dengan terpuji dan bergembiralah dengan kenyamanan serta wewangian, dan dengan Rabb yang tidak akan murka.\" dan seruan itu terus di serukan kepadanya sampai jiwanya keluar. Kemudian dia akan diangkat ke langit dan ditanya; \"Siapakah orang ini? Mereka (para Malaikat) menjawab; \"Fulan.\" maka di katakan kepadanya; \"Selamat datang wahai jiwa yang baik, yang berada dalam tubuh yang baik Keluarlah dengan terpuji dan bergembiralah dengan kenyamanan serta wewangian, dan dengan Rabb yang tidak akan murka.\" dan seruan itu terus di serukan kepadanya sampai ia tiba di langit yang terdapat Allah 'azza wajalla di sana. Namun jika mayit tersebut dari orang yang jahat, maka akan di katakan (kepadanya); \"Keluarlan wahai jiwa yang jahat yang ada dalam tubuh yang jahat, keluarlah dengan tercela dan terimalah air yang panas dan bau yang busuk, serta siksaan lainnya yang berlipat ganda.\" seruan itu terus saja di serukan sampai jiwanya keluar. Kemudian dia akan di angkat ke langit, maka (pintu langit) tidak akan di bukakan untuknya. Di tanyakan kepadanya; \"Siapakah orang ini?\" di jawab; \"Fulan.\" lalu di katakan; \"Tidak ada ucapan selamat untuk jiwa yang jawat yang terdapat pada tubuh yang jahat, kembalilah dengan tercela, karena tidak akan di bukakan pintu-pintu langit untukmu.\" kemudian dia di turunkan dari langit, maka ia kembali ke dalam kubur.\""
            },
            {
                "number": 4213,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ وَعُمَرُ بْنُ شَبَّةَ بْنِ عَبِيدَةَ قَالَا حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ أَخْبَرَنِي إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ أَجَلُ أَحَدِكُمْ بِأَرْضٍ أَوْثَبَتْهُ إِلَيْهَا الْحَاجَةُ فَإِذَا بَلَغَ أَقْصَى أَثَرِهِ قَبَضَهُ اللَّهُ سُبْحَانَهُ فَتَقُولُ الْأَرْضُ يَوْمَ الْقِيَامَةِ رَبِّ هَذَا مَا اسْتَوْدَعْتَنِي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Tsabit Al Jahdari] dan [Umar bin Syabbah bin 'Abidah] keduanya berkata; telah menceritakan kepada kami ['Umar bin Ali] telah mengabarkanku [Isma'il bin Abu Khalid] dari [Qais bin Abu Hazim] dari [Abdullah bin Mas'ud] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Apabila ajal salah seorang dari kalian telah di tentukan di suatu tempat di muka bumi, maka ia akan di berikan kebutuhannya untuk pergi ke tempat tersebut. Dan jika telah sampai pada batas akhir perjalanannya, maka Allah Subhanahu akan mencabut (nyawanya), dan bumi akan berkata pada hari Kiamat; \"Wahai Rabbku, inilah yang telah Engkau titipkan kepadaku.\""
            },
            {
                "number": 4214,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ أَبُو سَلَمَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ فَقِيلَ يَا رَسُولَ اللَّهِ كَرَاهِيَةُ لِقَاءِ اللَّهِ فِي كَرَاهِيَةِ لِقَاءِ الْمَوْتِ فَكُلُّنَا يَكْرَهُ الْمَوْتَ قَالَ لَا إِنَّمَا ذَاكَ عِنْدَ مَوْتِهِ إِذَا بُشِّرَ بِرَحْمَةِ اللَّهِ وَمَغْفِرَتِهِ أَحَبَّ لِقَاءَ اللَّهِ فَأَحَبَّ اللَّهُ لِقَاءَهُ وَإِذَا بُشِّرَ بِعَذَابِ اللَّهِ كَرِهَ لِقَاءَ اللَّهِ وَكَرِهَ اللَّهُ لِقَاءَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf Abu Salamah] telah menceritakan kepada kami [Abdul A'la] dari [Sa'id] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'id bin Hisyam] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa cinta bertemu Allah, maka Allah pun cinta bertemu dengannya, dan barangsiapa benci bertemu dengan Allah, maka Allah pun benci bertemu dengannya.\" Maka di tanyakan; \"Wahai Rasulullah, kalau begitu kebencian terhadap perjumpaan dengan Allah, berarti benci terhadap kematian? Padahal kami benci terhadap kematian.\" Beliau bersabda: \"Bukan, akan tetapi hal itu saat kematiannya tiba. Jika ia dikabarkan akan mendapatkan rahmat Allah dan ampunan-Nya, lalu ia cinta berjumpa dengan Allah, maka Allah pun cinta berjumpa dengannya, dan jika di kabarkan ia akan mendapatkan adzab Allah, lalu ia benci berjumpa dengan Allah, maka Allah pun benci berjumpa dengannya.\""
            },
            {
                "number": 4215,
                "arab": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَمَنَّى أَحَدُكُمْ الْمَوْتَ لِضُرٍّ نَزَلَ بِهِ فَإِنْ كَانَ لَا بُدَّ مُتَمَنِّيًا الْمَوْتَ فَلْيَقُلْ اللَّهُمَّ أَحْيِنِي مَا كَانَتْ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتْ الْوَفَاةُ خَيْرًا لِي",
                "id": "Telah menceritakan kepada kami ['Imran bin Musa] telah menceritakan kepada kami [Abdul Warits bin Sa'id] telah menceritakan kepada kami [Abdul Aziz bin Shuhaib] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian berangan-angan ingin mati karena musibah yang menimpanya. Namun jika terpaksa berangan-angan kematian, hendaknya ia berdo'a: \"Ya Allah, hidupkkanlah aku selama kehidupan itu baik untukku, dan matikanlah aku selama kematian itu baik untukku.\""
            },
            {
                "number": 4216,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ شَيْءٌ مِنْ الْإِنْسَانِ إِلَّا يَبْلَى إِلَّا عَظْمًا وَاحِدًا وَهُوَ عَجْبُ الذَّنَبِ وَمِنْهُ يُرَكَّبُ الْخَلْقُ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada sesuatu pada diri manusia akan usang dan hanya menyisakan sebatang tulang, yaitu pangkal ekor. Dan darinya pula semua makluk akan disusun kembali kelak di hari Kiamat.\""
            },
            {
                "number": 4217,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ عَنْ عَبْدِ اللَّهِ بْنِ بَحِيرٍ عَنْ هَانِئٍ مَوْلَى عُثْمَانَ قَالَكَانَ عُثْمَانُ بْنُ عَفَّانَ إِذَا وَقَفَ عَلَى قَبْرٍ يَبْكِي حَتَّى يَبُلَّ لِحْيَتَهُ فَقِيلَ لَهُ تَذْكُرُ الْجَنَّةَ وَالنَّارَ وَلَا تَبْكِي وَتَبْكِي مِنْ هَذَا قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْقَبْرَ أَوَّلُ مَنَازِلِ الْآخِرَةِ فَإِنْ نَجَا مِنْهُ فَمَا بَعْدَهُ أَيْسَرُ مِنْهُ وَإِنْ لَمْ يَنْجُ مِنْهُ فَمَا بَعْدَهُ أَشَدُّ مِنْهُ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا رَأَيْتُ مَنْظَرًا قَطُّ إِلَّا وَالْقَبْرُ أَفْظَعُ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ishaq] telah menceritakan kepadaku [Yahya bin Ma'in] telah menceritakan kepada kami [Hisyam bin Yusuf] dari [Abdullah bin Bahir] dari [Hani` bekas budak 'Utsman] dia berkata; \"Jika [Utsman bin 'Affan] berhenti di suatu kuburan, dia menangis sehingga jenggotnya basah. Di tanyakan kepadanya; \"Apakah kamu ingat surga dan neraka?, janganlah kamu menangis, apakah kamu menangis hanya karena ini?\" dia menjawab; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kuburan adalah tempat singgah pertama akhirat. Jika selamat darinya, maka setelahnya pun ia akan lebih mudah (urusannya) namun jika ia tidak selamat darinya, maka sesudahnya pun ia akan lebih sulit lagi.\" Utsman berkata; Rasulullah shallallahu 'alaihi wasallam juga bersabda: \"Aku tidak pernah melihat suatu pemandangan melainkan kuburan itu lebih buruk dari dari segalanya.\""
            },
            {
                "number": 4218,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَيِّتَ يَصِيرُ إِلَى الْقَبْرِ فَيُجْلَسُ الرَّجُلُ الصَّالِحُ فِي قَبْرِهِ غَيْرَ فَزِعٍ وَلَا مَشْعُوفٍ ثُمَّ يُقَالُ لَهُ فِيمَ كُنْتَ فَيَقُولُ كُنْتُ فِي الْإِسْلَامِ فَيُقَالُ لَهُ مَا هَذَا الرَّجُلُ فَيَقُولُ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَنَا بِالْبَيِّنَاتِ مِنْ عِنْدِ اللَّهِ فَصَدَّقْنَاهُ فَيُقَالُ لَهُ هَلْ رَأَيْتَ اللَّهَ فَيَقُولُ مَا يَنْبَغِي لِأَحَدٍ أَنْ يَرَى اللَّهَ فَيُفْرَجُ لَهُ فُرْجَةٌ قِبَلَ النَّارِ فَيَنْظُرُ إِلَيْهَا يَحْطِمُ بَعْضُهَا بَعْضًا فَيُقَالُ لَهُ انْظُرْ إِلَى مَا وَقَاكَ اللَّهُ ثُمَّ يُفْرَجُ لَهُ قِبَلَ الْجَنَّةِ فَيَنْظُرُ إِلَى زَهْرَتِهَا وَمَا فِيهَا فَيُقَالُ لَهُ هَذَا مَقْعَدُكَ وَيُقَالُ لَهُ عَلَى الْيَقِينِ كُنْتَ وَعَلَيْهِ مُتَّ وَعَلَيْهِ تُبْعَثُ إِنْ شَاءَ اللَّهُ وَيُجْلَسُ الرَّجُلُ السُّوءُ فِي قَبْرِهِ فَزِعًا مَشْعُوفًا فَيُقَالُ لَهُ فِيمَ كُنْتَ فَيَقُولُ لَا أَدْرِي فَيُقَالُ لَهُ مَا هَذَا الرَّجُلُ فَيَقُولُ سَمِعْتُ النَّاسَ يَقُولُونَ قَوْلًا فَقُلْتُهُ فَيُفْرَجُ لَهُ قِبَلَ الْجَنَّةِ فَيَنْظُرُ إِلَى زَهْرَتِهَا وَمَا فِيهَا فَيُقَالُ لَهُ انْظُرْ إِلَى مَا صَرَفَ اللَّهُ عَنْكَ ثُمَّ يُفْرَجُ لَهُ فُرْجَةٌ قِبَلَ النَّارِ فَيَنْظُرُ إِلَيْهَا يَحْطِمُ بَعْضُهَا بَعْضًا فَيُقَالُ لَهُ هَذَا مَقْعَدُكَ عَلَى الشَّكِّ كُنْتَ وَعَلَيْهِ مُتَّ وَعَلَيْهِ تُبْعَثُ إِنْ شَاءَ اللَّهُ تَعَالَى",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Syababah] dari [Ibnu Abu Dzi`b] dari [Muhammad bin 'Amru bin Al 'Atha`] dari [Sa'id bin Yasar] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya (ketika) mayit masuk ke dalam kuburnya, maka seorang yang shalih akan di di dudukkan dalam kuburnya tanpa rasa takut dan rasa kekhawatiran. Lalu akan di katakan kepadanya; \"Bagaimana keadaan akhir hayatmu?\" maka ia akan menjawab; \"Aku dalam keadaan Islam (berserah diri).\" kemudian ditanyakan lagi; \"siapakah lelaki ini?\" ia akan menjawab; \"Muhammad Rasulullah shallallahu 'alaihi wasallam, dia telah datang kepada kami dengan membawa keterangan-keterangan dari sisi Allah, lalu kami membenarkannya.\" di tanyakan lagi kepadanya; \"Apakah kamu melihat Allah?\" Ia menjawab; \"Tidak layak bagi seseorang untuk melihat Allah.\" maka di singkapkanlah baginya celah yang membatasi neraka, ia melihat gejolak apinya yang saling menghantam satu sama lainnya. Dan di katakan kepadanya; \"Lihatlah apa yang telah Allah perbuat untuk menyelamatkanmu.\" kemudian di singkapkan baginya celah yang menghalangi surga dan ia melihat hiasan dan seluruh keindahan yang terdapat di dalamnya. Maka di katakan kepadanya; \"Inilah tempatmu.\" dan di katakan kepadanya; \"atas keyakinan yang kamu jalankan, dan karenanya kamu di matikan serta dengannya pula kamu di bangkitkan Insya Allah.\" Dan seorang yang jahat akan didudukkan di dalam kuburnya dengan penuuh rasa takut dan kekhawatiran. Lalu di tanyakan kepadanya; \"Bagaimana keadaan akhir hayatmu?\" ia menjawab; \"Aku tidak tahu.\" di tanyakan kepadanya; \"Siapakah laki-laki ini?\" ia menjawab; \"Aku mendengar orang-orang membicarakan sesuatu dan aku pun mengikutinya.\" lalu di bukakan celah yang membatasi surga, dan ia melihat keindahan yang terdapat di dalamnya, maka di katakan kepadanya; \"Lihatlah kepada orang-orang yang Allah jauhkan dirimu darinya.\" kemudian di bukakan celah yang membatasi neraka dan ia melihat apinya saling menghantam satu sama lain, maka di katakan kepadanya; \"Inilah tempatmu, atas keraguan yang ada pada dirimu. Karenanya pula kamu mati dan dengannya pula kamu di bangkitkan Insya Allah Ta'ala.\""
            },
            {
                "number": 4219,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ{ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ }قَالَ نَزَلَتْ فِي عَذَابِ الْقَبْرِ يُقَالُ لَهُ مَنْ رَبُّكَ فَيَقُولُ رَبِّيَ اللَّهُ وَنَبِيِّي مُحَمَّدٌ فَذَلِكَ قَوْلُهُ{ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari ['Alqamah bin Martsad] dari [Sa'd bin 'Ubaidah] darii [Al Barra` bin 'Azib] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Allah meneguhkan (iman) orang-orang yang beriman dengan Ucapan yang teguh itu dalam kehidupan di dunia dan di akhirat; (QS Ibrahim; 27). Beliau bersabda: \"Ayat ini di turunkan mengenai adzab kubur, di katakan kepada mayit; \"Siapa Rabbmu? Maka ia akan menjawab; \"Rabb adalah Allah, dan Nabiku adalah Muhammad.\" dan itulah maksud dari firman-Nya; \" \"Allah meneguhkan (iman) orang-orang yang beriman dengan Ucapan yang teguh itu dalam kehidupan di dunia dan di akhirat; (QS Ibrahim; 27).\""
            },
            {
                "number": 4220,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَاتَ أَحَدُكُمْ عُرِضَ عَلَى مَقْعَدِهِ بِالْغَدَاةِ وَالْعَشِيِّ إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ يُقَالُ هَذَا مَقْعَدُكَ حَتَّى تُبْعَثَ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] telah menceritakan kepada kami ['ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Jika salah seorang dari kalian meninggal dunia, maka akan di tampakkan tempat tinggalnya pada saat pagi hari dan sore hari. Jika ia termasuk penduduk surga, maka ia akan menjadi penduduk surga, dan jika ia dari penghuni neraka, maka ia akan menjadi penghuni neraka, di katakan; \"Ini adalah tempat tinggalmu, \" sampai dia di bangkitkan pada hari Kiamat.\""
            },
            {
                "number": 4221,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ أَنْبَأَنَا مَالِكُ بْنُ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ الْأَنْصَارِيِّ أَنَّهُ أَخْبَرَهُ أَنَّ أَبَاهُ كَانَ يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا نَسَمَةُ الْمُؤْمِنِ طَائِرٌ يَعْلُقُ فِي شَجَرِ الْجَنَّةِ حَتَّى يَرْجِعَ إِلَى جَسَدِهِ يَوْمَ يُبْعَثُ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] telah memberitakan kepada kami [Mlaik bin Anas] dari [Ibnu Syihab] dari [Abdulla bin Ka'ab Al Anshari] bahwa dirinya telah mengabarkan kepadanya, bahwa [ayahnya] pernah bercerita bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya jiwa seorang mukmin bagaikan burung yang bergelayutan di pohon surga sampai ia kembali ke jasadnya pada hari Kiamat.\""
            },
            {
                "number": 4222,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ حَفْصٍ الْأُبُلِّيُّ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ الْمَيِّتُ الْقَبْرَ مُثِّلَتْ الشَّمْسُ عِنْدَ غُرُوبِهَا فَيَجْلِسُ يَمْسَحُ عَيْنَيْهِ وَيَقُولُ دَعُونِي أُصَلِّي",
                "id": "Telah menceritakan kepada kami [Isma'il bin Hafhs Al Uballi] telah menceritakan kepada kami [Abu Bakar bin 'Ayyasy] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Jika mayit masuk ke dalam kubur, maka di perlihatkannya matahari ketika akan tenggelam, kemudian ia akan mengusap kedua matanya seraya berkata; \"Biarkanlah aku sholat.\""
            },
            {
                "number": 4223,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ حَجَّاجٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ صَاحِبَيْ الصُّورِ بِأَيْدِيهِمَا أَوْ فِي أَيْدِيهِمَا قَرْنَانِ يُلَاحِظَانِ النَّظَرَ مَتَى يُؤْمَرَانِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Abbad bin Al 'Awam] dari [Hajjaj] dari ['Athiyah] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kedua sahabatku (Malaikat) pembawa sangkala selalu membawa sangkakala di kedua tangannya atau di kedua tangannya memegang sangkala, keduanya bersiap-siap kapan saja di perintahkan (meniupkannya).\""
            },
            {
                "number": 4224,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَجُلٌ مِنْ الْيَهُودِ بِسُوقِ الْمَدِينَةِ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْبَشَرِ فَرَفَعَ رَجُلٌ مِنْ الْأَنْصَارِ يَدَهُ فَلَطَمَهُ قَالَ تَقُولُ هَذَا وَفِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ{ وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ ثُمَّ نُفِخَ فِيهِ أُخْرَى فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ }فَأَكُونُ أَوَّلَ مَنْ رَفَعَ رَأْسَهُ فَإِذَا أَنَا بِمُوسَى آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ فَلَا أَدْرِي أَرَفَعَ رَأْسَهُ قَبْلِي أَوْ كَانَ مِمَّنْ اسْتَثْنَى اللَّهُ عَزَّ وَجَلَّ وَمَنْ قَالَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى فَقَدْ كَذَبَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; saat berada di pasar Madinah, seorang laki-laki Yahudi berkata; \"Demi dzat yang telah menyucikan Musa dari seluruh manusia.\" (mendengar itu) seorang laki-laki Anshar mengangkat tangannya dan menamparnya seraya berkata; \"Kamu berani mengatakan ini, sedangkan Rasulullah shallallahu 'alaihi wasallam berada di tengah-tengah kami!.\" kemudian hal itu di beritahukan kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Allah Azza wa Jalla berfirman: \"Dan ditiuplah sangkakala, Maka matilah siapa yang di langit dan di bumi kecuali siapa yang dikehendaki Allah. Kemudian ditiup sangkakala itu sekali lagi Maka tiba-tiba mereka berdiri menunggu (putusannya masing-masing). (QS Az Zumar; 68).\" (beliau bersabda): \"Aku adalah orang yang pertama-tama mengangkat kepala, tiba-tiba saya melihat Musa mengambil tiang dari tiang-tiang 'Arsy, aku tidak tahu apakah ia mengangkat kepalanya sebulumku ataukah ia yang di kecualikan oleh Allah 'azza wajalla, dan barang siapa yang mengatakan Aku lebih baik daripada Yunus bin Matta, maka ia telah berdusta.\""
            },
            {
                "number": 4225,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ حَدَّثَنِي أَبِي عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ يَقُولُ يَأْخُذُ الْجَبَّارُ سَمَاوَاتِهِ وَأَرَضِيهِ بِيَدِهِ وَقَبَضَ يَدَهُ فَجَعَلَ يَقْبِضُهَا وَيَبْسُطُهَا ثُمَّ يَقُولُ أَنَا الْجَبَّارُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ قَالَ وَيَتَمَايَلُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ حَتَّى نَظَرْتُ إِلَى الْمِنْبَرِ يَتَحَرَّكُ مِنْ أَسْفَلِ شَيْءٍ مِنْهُ حَتَّى إِنِّي لَأَقُولُ أَسَاقِطٌ هُوَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] dan [Muhammad bin As Shabah] keduanya berkata; telah menceritakan kepada kami [Abdul Aziz Abu Abu Hazim] telah menceritakan kepadaku [ayahku] dari [Abdullah bin Miqsam] dari [Abdullah bin Umar] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Alla Al Jabbar akan mengambil langit dan bumi-Nya dengan tangan-Nya, Dia menggenggam dan mengepalkannya kemudian melebarkannya, lalu Dia berfirman: \"Aku adalah Al Jabbar (Yang Maha Perkasa), dan Akulah raja. Di manakah orang-orang (yang pernah) mengaku perkasa? Di manaka orang-orang yang sombong?\" Abdullah bin Umar berkata; \"Rasulullah shallallahu 'alaihi wasallam menoleh ke kanan dan ke kiri, hingga ku lihat mimbar itu bawahnya bergoyang, sampai saya berkata apakah ia akan roboh bersama dengan Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 4226,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ حَاتِمِ بْنِ أَبِي صَغِيرَةَ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ الْقَاسِمِ قَالَ قَالَتْ عَائِشَةُقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ قَالَ حُفَاةً عُرَاةً قُلْتُ وَالنِّسَاءُ قَالَ وَالنِّسَاءُ قُلْتُ يَا رَسُولَ اللَّهِ فَمَا يُسْتَحْيَا قَالَ يَا عَائِشَةُ الْأَمْرُ أَهَمُّ مِنْ أَنْ يَنْظُرَ بَعْضُهُمْ إِلَى بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Hatim bin Abu Shaghirah] dari [Ibnu Abu Mulaikah] dari [Qasim] dia berkata; ['Asiyah] berkata; saya bertanya; \"Wahai Rasulullah, bagaimanakah keadaan manusia ketika mereka di padang mahsyar?\" Beliau menjawab: \"Mereka telanjang tanpa pakaian.\" saya bertanya; \"Begitu juga dengan para wanita?\" Beliau menjawab: \"Begitu juga dengan wanita.\" saya bertanya; \"Wahai Rasulullah, apakah mereka tidak merasa malu?\" Beliau menjawab: \"Wahai 'Aisyah, perkara pada hari itu lebih penting daripada saling pandang di antara sesama mereka.\""
            },
            {
                "number": 4227,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ عَلِيِّ بْنِ عَلِيِّ بْنِ رِفَاعَةَ عَنْ الْحَسَنِ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْرَضُ النَّاسُ يَوْمَ الْقِيَامَةِ ثَلَاثَ عَرَضَاتٍ فَأَمَّا عَرْضَتَانِ فَجِدَالٌ وَمَعَاذِيرُ وَأَمَّا الثَّالِثَةُ فَعِنْدَ ذَلِكَ تَطِيرُ الصُّحُفُ فِي الْأَيْدِي فَآخِذٌ بِيَمِينِهِ وَآخِذٌ بِشِمَالِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dia berkata; telah menceritakan kepada kami [Waki'] dari [Ali bin Ali bin Rifa'ah] dari [Al Hasan] dari [Abu Musa Al Asy'ari] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari Kiamat, manusia akan diperlihatkan tiga tontonan, dua tontonan mengenai perdebatan dan alasan-alasan yang dikemukakan adapun tontonan yang ketiga akan dibagikan buku catatan amalan (hamba) dimana ada yang mengambil dengan tangan kanannya ada pula yang mengambil dengan tangan kirinya."
            },
            {
                "number": 4228,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ وَأَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ }قَالَ يَقُومُ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Isa bin Yunus] dan [Abu Khalid Al Ahmar] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam mengenai (firman Allah): (Yaitu) Ketika manusia berdiri menghadap Rabb semesta alam.\" (QS Al Muthafifin; 6). Beliau bersabda: \"Setiap orang dari mereka akan berdiri dengan keringat yang mencapai kedua telinganya.\""
            },
            {
                "number": 4229,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَاوَاتُ }فَأَيْنَ تَكُونُ النَّاسُ يَوْمَئِذٍ قَالَ عَلَى الصِّرَاطِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Daud] dari [Asy Sya'bi] dari [Masruq] dari ['Aisyah] dia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam (mengenai firman Allah): \"(yaitu) pada hari (ketika) bumi diganti dengan bumi yang lain dan (demikian pula) langit, (QS Ibrahim; 49), lantas di manakah manusia ketika itu?\" Beliau menjawab: \"Di atas shirath.\""
            },
            {
                "number": 4230,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ الْمُغِيرَةِ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ عَبْدِ بْنِ الْعُتْوَارِيِّ أَحَدِ بَنِي لَيْثٍ قَالَ وَكَانَ فِي حَجْرِ أَبِي سَعِيدٍ قَالَ سَمِعْتُهُ يَعْنِي أَبَا سَعِيدٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُوضَعُ الصِّرَاطُ بَيْنَ ظَهْرَانَيْ جَهَنَّمَ عَلَى حَسَكٍ كَحَسَكِ السَّعْدَانِ ثُمَّ يَسْتَجِيزُ النَّاسُ فَنَاجٍ مُسَلَّمٌ وَمَخْدُوجٌ بِهِ ثُمَّ نَاجٍ وَمُحْتَبَسٌ بِهِ وَمَنْكُوسٌ فِيهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dia berkata; telah menceritakan kepada kami [Abdul A'la] dari [Muhammad bin Ishaq], telah menceritakan kepadaku ['Ubaidillah bin Mughirah] dari [Sulaiman bin 'Amru bin Abd bin Al 'Utwari] salah seorang dari Bani Laits, dia berkata; -dan dia berada di kamarnya Abu Sa'id- saya mendengar [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Shirath akan di letakkan di punggung Neraka Jahannam di atas pohon berduri seperti pohon sa'dan, kemudian para manusia melintasinya, maka ada di antara manusia ada yang selamat dan ada juga yang selamat sedang ia tertahan dan ada pula yang terbalik.\""
            },
            {
                "number": 4231,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ أُمِّ مُبَشِّرٍ عَنْ حَفْصَةَ قَالَتْقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَرْجُو أَلَّا يَدْخُلَ النَّارَ أَحَدٌ إِنْ شَاءَ اللَّهُ تَعَالَى مِمَّنْ شَهِدَ بَدْرًا وَالْحُدَيْبِيَةَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَلَيْسَ قَدْ قَالَ اللَّهُ{ وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا }قَالَ أَلَمْ تَسْمَعِيهِ يَقُولُ{ ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا }",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Aal A'masy] dari [Sufyan] dari [Jabir] dari [Ummu Mubasyir] dari [Hafshah] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saya berharap tidak ada seorang pun dari kalangan orang-orang yang ikut serta dalam perang Badar dan Hudaibiyyah yang masuk neraka, Insya Allah Ta'ala.\" Hafshah berkata; Saya bertanya; \"Wahai Rasulullah, tidakkah Allah telah berfirman: \"Dan tidak ada seorangpun dari padamu, melainkan mendatangi neraka itu. hal itu bagi Tuhanmu adalah suatu kemestian yang sudah ditetapkan? (QS Maryam; 71).\" beliau bersabda: \"Apakah kamu tidak mendengar bahwa Dia juga berfirman: \"Kemudian kami akan menyelamatkan orang-orang yang bertaqwa dan membiarkan orang-orang yang zalim di dalam neraka dalam keadaan berlutut.\" (QS Maryam; 72)."
            },
            {
                "number": 4232,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرِدُونَ عَلَيَّ غُرًّا مُحَجَّلِينَ مِنْ الْوُضُوءِ سِيمَاءُ أُمَّتِي لَيْسَ لِأَحَدٍ غَيْرِهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dia berkata; telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Za`idah] dari [Abu Malik Al Asyja'i] dari [Abu Hazim] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Di perlihatkan kepadaku muka-muka dan kedua tangan tangan serta kaki yang putih bersinar karena wudlu', sebagai tanda dari ummatku, dan tidak ada yang seperti itu selain dari ummatku.\""
            },
            {
                "number": 4233,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قُبَّةٍ فَقَالَ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ قُلْنَا بَلَى قَالَ أَتَرْضَوْنَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ قُلْنَا نَعَمْ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ وَذَلِكَ أَنَّ الْجَنَّةَ لَا يَدْخُلُهَا إِلَّا نَفْسٌ مُسْلِمَةٌ وَمَا أَنْتُمْ فِي أَهْلِ الشِّرْكِ إِلَّا كَالشَّعَرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الْأَسْوَدِ أَوْ كَالشَّعَرَةِ السَّوْدَاءِ فِي جِلْدِ الثَّوْرِ الْأَحْمَرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari ['Amru bin Maimun] dari [Abdullah] dia berkata; \"Kami pernah bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam di Quba, maka beliau bersabda: \"Maukah kalian menjadi seperempat dari penghuni surga?\" Kami menjawab; \"Tentu.\" Beliau bersabda: \"Maukah kalian menjadi sepertiga dari penduduk surga?\" kami menjawab; \"Ya.\" Beliau bersabda: \"Demi dzat yang jiwaku berada di tangan-Nya sesungguhnya saya berharap kalian menjadi setengah dari penghuni surga, dan yang demikian itu surga tidak akan dimasuki melainkan oleh orang-orang yang muslim, adapun kalian di bandingkan dengan orang-orang Musyrik hanyalah bagaikan bulu putih berada di atas kulit lembu yang hitam, atau begaikan bulu hitam berada di atas kulit lembu yang merah.\""
            },
            {
                "number": 4234,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ وَأَحْمَدُ بْنُ سِنَانٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجِيءُ النَّبِيُّ وَمَعَهُ الرَّجُلَانِ وَيَجِيءُ النَّبِيُّ وَمَعَهُ الثَّلَاثَةُ وَأَكْثَرُ مِنْ ذَلِكَ وَأَقَلُّ فَيُقَالُ لَهُ هَلْ بَلَّغْتَ قَوْمَكَ فَيَقُولُ نَعَمْ فَيُدْعَى قَوْمُهُ فَيُقَالُ هَلْ بَلَّغَكُمْ فَيَقُولُونَ لَا فَيُقَالُ مَنْ يَشْهَدُ لَكَ فَيَقُولُ مُحَمَّدٌ وَأُمَّتُهُ فَتُدْعَى أُمَّةُ مُحَمَّدٍ فَيُقَالُ هَلْ بَلَّغَ هَذَا فَيَقُولُونَ نَعَمْ فَيَقُولُ وَمَا عِلْمُكُمْ بِذَلِكَ فَيَقُولُونَ أَخْبَرَنَا نَبِيُّنَا بِذَلِكَ أَنَّ الرُّسُلَ قَدْ بَلَّغُوا فَصَدَّقْنَاهُ قَالَ فَذَلِكُمْ قَوْلُهُ تَعَالَى{ وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا }",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] dan [Ahmad bin Sinan] keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang Nabi akan datang bersama dengan dua orang laki-laki, dan Nabi yang lain akan datang pula bersama dengan tiga orang, dan ada juga yang lebih banyak dari itu atau lebih sedikit. Kemudian di katakan kepadanya; \"Apakah kamu telah menyampaikan (ajaran Allah) kepada kaummu?\" ia menjawab; \"Ya.\" maka kaumnya di panggil; \"Apakah ia telah menyampaikannya kepada kalian?\" mereka menjawab; \"Tidak.\" maka di tanyakan (kepada Nabi tersebut); \"Siapakah yang menjadi saksi atas pernyataan itu?\" Ia menjawab; \"Muhammad dan ummatnya.\" kemudian ummat Muhammad dipanggil dan ditanya; \"Apakah ia (nabi tersebut) telah menyampaikan?\" mereka (ummat Muhammad) menjawab; \"Ya.\" Penanya bertanya; \"Apa alasanmu tentang hal itu?\" mereka menjawab; \"Nabi kami telah memberitahukan kepada kami bahwa para Rasul telah menyampaikan (risalah Allah), dan kami pun mempercayainya.\" begitulah kondisi kalian yang disebutkan dalam firman Allah: \"Dan demikianlah Kami jadikan kalian ummat yang adil dan pilihan agar kamu menjadi saksi atas (aperbuatan) manusia dan agar rasul (Muhammad) menjadi saksi atas perbuatan kalian.\""
            },
            {
                "number": 4235,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رِفَاعَةَ الْجُهَنِيِّ قَالَصَدَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ مَا مِنْ عَبْدٍ يُؤْمِنُ ثُمَّ يُسَدِّدُ إِلَّا سُلِكَ بِهِ فِي الْجَنَّةِ وَأَرْجُو أَلَّا يَدْخُلُوهَا حَتَّى تَبَوَّءُوا أَنْتُمْ وَمَنْ صَلَحَ مِنْ ذَرَارِيِّكُمْ مَسَاكِنَ فِي الْجَنَّةِ وَلَقَدْ وَعَدَنِي رَبِّي عَزَّ وَجَلَّ أَنْ يُدْخِلَ الْجَنَّةَ مِنْ أُمَّتِي سَبْعِينَ أَلْفًا بِغَيْرِ حِسَابِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Mush'ab] dari [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Hilal bin Abu Maimunah] dari ['Atha` bin Yasar] dari [rifa'ah Al Juhani] dia berkata; Kami berada di hadapan Rasulullah shallallahu 'alaihi wasallam, maka beliau bersabda: \"Demi dzat yang jiwa Muhammad berada di tangan-Nya, tidaklah seorang hamba beriman, lalu ia bersungguh-sungguh (menjalankan keimanannya), melainkan ia akan dimasukkan ke dalam surga. Dan aku berharap tidaklah mereka memasukinya sehingga kalian telah mendudukinya (terlebih dahulu), juga orang-orang shalih dari keturunan kelian akan di sediakan tempat di surga. Rabbku telah menjanjikan kepadaku bahwa ummatku akan masuk surga sebanyak tujuh puluh ribu orang tanpa hisab.\""
            },
            {
                "number": 4236,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ الْأَلْهَانِيُّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَعَدَنِي رَبِّي سُبْحَانَهُ أَنْ يُدْخِلَ الْجَنَّةَ مِنْ أُمَّتِي سَبْعِينَ أَلْفًا لَا حِسَابَ عَلَيْهِمْ وَلَا عَذَابَ مَعَ كُلِّ أَلْفٍ سَبْعُونَ أَلْفًا وَثَلَاثُ حَثَيَاتٍ مِنْ حَثَيَاتِ رَبِّي عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Isma'il bin 'Ayyasy] telah menceritakan kepada kami [Muhammad bin Ziyad Al Hani] dia berkata; saya mendengar [Abu Umamah Al Bahili] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabbku Subhanahu telah menjanjikan kepadaku akan memasukkan tujuh puluh ribu orang dari ummatku ke dalam surga tanpa hisab dan siksa. Dan setiap seribu orang (di sertai) dengan tujuh puluh ribu orang, dan dengan tiga raupan Tangan di antara raupan Tangan Rabbku Yang Maha Agung.\""
            },
            {
                "number": 4237,
                "arab": "حَدَّثَنَا عِيسَى بْنُ مُحَمَّدِ بْنِ النَّحَّاسِ الرَّمْلِيُّ وَأَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ قَالَا حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ عَنْ ابْنِ شَوْذَبٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُكْمِلُ يَوْمَ الْقِيَامَةِ سَبْعِينَ أُمَّةً نَحْنُ آخِرُهَا وَخَيْرُهَا",
                "id": "Telah menceritakan kepada kami [Isa bin Muhammad bin An Nahas Ar ramli] dan [Ayyub bin Muhammad Ar Raqqi] keduanya berkata; telah menceritakan kepada kami [Dlamrah bin Rabi'ah] dari [Ibnu Syaudzab] dari [Bahz bin Hakim] dari [ayahnya] dari [kakeknya] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita akan melengkapai (dengan) tujuh puluh ummat kelak di hari Kiamat, kita adalah ummat yang terakhir dari mereka dan yang terbaik dari mereka.\""
            },
            {
                "number": 4238,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خِدَاشٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّكُمْ وَفَّيْتُمْ سَبْعِينَ أُمَّةً أَنْتُمْ خَيْرُهَا وَأَكْرَمُهَا عَلَى اللَّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Khalid bin Khidasy] telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Bahz bin Hakim] dari [ayahnya] dari [Kakeknya] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kalian telah menyempurnakan tujuh puluh ummat, dan kalian adalah yang terbaik dan yang paling mulian di antara mereka di sisi Allah.\""
            },
            {
                "number": 4239,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِسْحَقَ الْجَوْهَرِيُّ حَدَّثَنَا حُسَيْنُ بْنُ حَفْصٍ الْأَصْبَهَانِيُّ حَدَّثَنَا سُفْيَانُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَهْلُ الْجَنَّةِ عِشْرُونَ وَمِائَةُ صَفٍّ ثَمَانُونَ مِنْ هَذِهِ الْأُمَّةِ وَأَرْبَعُونَ مِنْ سَائِرِ الْأُمَمِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ishaq Al Jauhari] telah menceritakan kepada kami [Husain bin Haffh Al Ashbahani] telah menceritakan kepada kami [Sufyan] dari ['Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Penduduk surga berjumlah seratus dua puluh baris, sembilan puluh baris terdiri dari ummat ini dan yang empat puluh dari berbagai ummat.\""
            },
            {
                "number": 4240,
                "arab": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ أَبِي الْمُسَاوِرِ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَمَعَ اللَّهُ الْخَلَائِقَ يَوْمَ الْقِيَامَةِ أُذِنَ لِأُمَّةِ مُحَمَّدٍ فِي السُّجُودِ فَيَسْجُدُونَ لَهُ طَوِيلًا ثُمَّ يُقَالُ ارْفَعُوا رُءُوسَكُمْ قَدْ جَعَلْنَا عِدَّتَكُمْ فِدَاءَكُمْ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Jubbarah bin Al Mughallas] telah menceritakan kepada kami [Abdul A'la bin Abu Al Musawir] dari [Abu Burdah] dari [ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Allah mengumpulkan para makhluk-Nya di hari Kiamat, maka ummat Muhammad diizinkan untuk bersujud, maka mereka sujud hingga lama, kemudian di katakan kepada mereka: \"Angkatlah kepala kalian, sesungguhnya Kami telah menjadikan tebusan kalian dari api neraka.\""
            },
            {
                "number": 4241,
                "arab": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذِهِ الْأُمَّةَ مَرْحُومَةٌ عَذَابُهَا بِأَيْدِيهَا فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ دُفِعَ إِلَى كُلِّ رَجُلٍ مِنْ الْمُسْلِمِينَ رَجُلٌ مِنْ الْمُشْرِكِينَ فَيُقَالُ هَذَا فِدَاؤُكَ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Jubbarah bin Al Mughallas] telah menceritakan kepada kami [Katsir bin Sulaim] dari [Anas bin Malik] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ummat ini adalah ummat yang dikasihi, Adzab-Nya berada di antara kedua tangan-Nya, jika hari Kiamat tiba, maka seorang muslim akan mendorong seorang dari orang Musyrik seraya di katakan; \"Ini adalah tebusanmu dari api neraka.\""
            },
            {
                "number": 4242,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ لِلَّهِ مِائَةَ رَحْمَةٍ قَسَمَ مِنْهَا رَحْمَةً بَيْنَ جَمِيعِ الْخَلَائِقِ فَبِهَا يَتَرَاحَمُونَ وَبِهَا يَتَعَاطَفُونَ وَبِهَا تَعْطِفُ الْوَحْشُ عَلَى أَوْلَادِهَا وَأَخَّرَ تِسْعَةً وَتِسْعِينَ رَحْمَةً يَرْحَمُ بِهَا عِبَادَهُ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] telah memberitakan kepada kami [Abdul Malik] dari ['Atha`] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya Allah memiliki seratus rahmat dan satu rahmat di baagikan kepada semua makhluk-Nya, yang dengannya mereka saling berkasih sayang, dan dengannya pula mereka saling mengasihi, dengannya binatang buas mengasihi anak-anaknya. Dan Dia menyisakan sembilan puluh sembilan rahmat yang akan di berikan yang akan dikasihkan kepada hamba-Nya kelak di hari Kiamat.\""
            },
            {
                "number": 4243,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ وَأَحْمَدُ بْنُ سِنَانٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلَقَ اللَّهُ عَزَّ وَجَلَّ يَوْمَ خَلَقَ السَّمَوَاتِ وَالْأَرْضَ مِائَةَ رَحْمَةٍ فَجَعَلَ فِي الْأَرْضِ مِنْهَا رَحْمَةً فَبِهَا تَعْطِفُ الْوَالِدَةُ عَلَى وَلَدِهَا وَالْبَهَائِمُ بَعْضُهَا عَلَى بَعْضٍ وَالطَّيْرُ وَأَخَّرَ تِسْعَةً وَتِسْعِينَ إِلَى يَوْمِ الْقِيَامَةِ فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ أَكْمَلَهَا اللَّهُ بِهَذِهِ الرَّحْمَةِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] dan [Ahmad bin Sinan] keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla telah menciptakan seratus rahmat di hari saat Dia menciptakan langit dan bumi. Dan Dia meletakkan satu rahmat di muka bumi, yang dengannya seorang ibu dapat menyayangi anaknya, para binatang saling mengasihi dengan sesamanya, begitu juga dengan burung. Dan Dia menyisakan sembilan puluh sembilan rahmat sampai hari Kiamat. Maka jika hari Kiamat telah tiba, Allah akan menyempurnakan dengan rahmat tersebut.\""
            },
            {
                "number": 4244,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا خَلَقَ الْخَلْقَ كَتَبَ بِيَدِهِ عَلَى نَفْسِهِ إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] dan [Abu Bakar bin Abu Syaibah] keduanya berkata; telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Ibnu Al 'Ajlan] dari [ayahnya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika Allah 'azza wajalla menciptakan makhluk-Nya, Dia berjanji kepada Diri-Nya; Sesungguhnya rahmat-Ku mengalahkan amarah-Ku.\""
            },
            {
                "number": 4245,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا أَبُو عَوَانَةَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَمَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عَلَى حِمَارٍ فَقَالَ يَا مُعَاذُ هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَلَى الْعِبَادِ وَمَا حَقُّ الْعِبَادِ عَلَى اللَّهِ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّ حَقَّ اللَّهِ عَلَى الْعِبَادِ أَنْ يَعْبُدُوهُ وَلَا يُشْرِكُوا بِهِ شَيْئًا وَحَقُّ الْعِبَادِ عَلَى اللَّهِ إِذَا فَعَلُوا ذَلِكَ أَنْ لَا يُعَذِّبَهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu As Syawarib] telah menceritakan kepada kami [Abu 'Awanah] telah menceritakan kepada kami [Abdul Malik bin 'Umair] dari [Ibnu Abu Laila] dari [Mua'dz bin Jabal] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam lewat di dekatku, ketika aku berada di atas keledai, beliau bertanya: \"Wahai Mu'adz, apakah kamu tahu apakah hak Allah terhadap hamba-hamba-Nya? Dan apa hak seorang hamba terhadapa Allah?\" Aku menjawab; \"Allah dan Rasul-Nya yang lebih mengetahui.\" beliau bersabda: \"Sesungguhnya hak Allah terhadap hamba-hamba-Nya ialah supaya mereka menyembah-Nya dan tidak menyekutukan-Nya dengan sesuatu apapun, sedangkan hak seorang hamba terhadap Allah adalah jika mereka melaksanakan hal itu, maka Dia tidak akan mengadzab mereka.\""
            },
            {
                "number": 4246,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَعْيَنَ حَدَّثَنَا إِسْمَعِيلُ بْنُ يَحْيَى الشَّيْبَانِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ حَفْصٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ غَزَوَاتِهِ فَمَرَّ بِقَوْمٍ فَقَالَ مَنْ الْقَوْمُ فَقَالُوا نَحْنُ الْمُسْلِمُونَ وَامْرَأَةٌ تَحْصِبُ تَنُّورَهَا وَمَعَهَا ابْنٌ لَهَا فَإِذَا ارْتَفَعَ وَهَجُ التَّنُّورِ تَنَحَّتْ بِهِ فَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ أَنْتَ رَسُولُ اللَّهِ قَالَ نَعَمْ قَالَتْ بِأَبِي أَنْتَ وَأُمِّي أَلَيْسَ اللَّهُ بِأَرْحَمِ الرَّاحِمِينَ قَالَ بَلَى قَالَتْ أَوَلَيْسَ اللَّهُ بِأَرْحَمَ بِعِبَادِهِ مِنْ الْأُمِّ بِوَلَدِهَا قَالَ بَلَى قَالَتْ فَإِنَّ الْأُمَّ لَا تُلْقِي وَلَدَهَا فِي النَّارِ فَأَكَبَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْكِي ثُمَّ رَفَعَ رَأْسَهُ إِلَيْهَا فَقَالَ إِنَّ اللَّهَ لَا يُعَذِّبُ مِنْ عِبَادِهِ إِلَّا الْمَارِدَ الْمُتَمَرِّدَ الَّذِي يَتَمَرَّدُ عَلَى اللَّهِ وَأَبَى أَنْ يَقُولَ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Ibrahim bin A'yan] telah menceritakan kepada kami [Isma'il bin Yahya As Syaibani] dari [Abdullah bin Umar bin Hafsh] dari [Nafi'] dari [Ibnu Umar] dia berkata; \"Katika kami bersama Nabi shallallahu 'alaihi wasallam di salah satu peperangan, lalu beliau melawti suatu kaum, lantas beliau bertanya: \"Siapakah mereka?\" mereka menjawab; \"Kami adalah orang-orang Muslim\", dan seorang wanita bersama anaknya yang sedang menghidupkan tungku, ketika nyala api tersebut membesar wanita tersebut menjauhkan anaknya, kemudian dia datang kepada Nabi shallallahu ‘alaihi wa sallam dan berkata; “ engkau Rasulullah?” beliau menjawab; “ya” wanita tersebut bertanya; “bapak dan ibuku sebagai tebusanmu. Bukankah Allah maha penyayang dari yang para penyayang?” beliau menjawab; “betul” dia bertanya; “bukankah Allah maha penyayang terhadap hamba-hambaNya melebihi seorang ibu terhadap anaknya?”  wanita tersebut berkata; “sesungguhnya seorang ibu tidak akan melemparkan anaknya kedalam api?” maka Nabi tertelungkup menangis, kemudian mengangkat kepalanya memandang wanita tersebut dan berkata: “sesungguhnya Allah tidak akan mengadzab hamba-hambNya kecuali pembangkang yang bandel yang membangkang Allah dan menolak untuk mengucapkan LAA ILAAHA ILLALLAHU.”"
            },
            {
                "number": 4247,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ حَدَّثَنَا عَمْرُو بْنُ هَاشِمٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ النَّارَ إِلَّا شَقِيٌّ قِيلَ يَا رَسُولَ اللَّهِ وَمَنْ الشَّقِيُّ قَالَ مَنْ لَمْ يَعْمَلْ لِلَّهِ بِطَاعَةٍ وَلَمْ يَتْرُكْ لَهُ مَعْصِيَةً",
                "id": "Telah menceritakan kepada kami [Al 'Abbas bin Al Walid Ad Dimasyqi] telah menceritakan kepada kami ['Amru bin Hasyim] telah menceritakan kepada kami [Ibnu Lahi'ah] dari ['Abd Rabbihi bin Sa'id] dari [Sa'id Al Maqburi] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan masuk neraka kecuali orang yang celaka.\" di katakan; \"Siapakan orang yang celaka wahai Rasulullah?\" beliau menjawab: \"Seseorang yang taat dan juga meninggalkan kemaksiatan tidak karena Allah.\""
            },
            {
                "number": 4248,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا سُهَيْلُ بْنُ عَبْدِ اللَّهِ أَخُو حَزْمٍ الْقُطَعِيِّ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ أَوْ تَلَا هَذِهِ الْآيَةَ{ هُوَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ }فَقَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ أَنَا أَهْلٌ أَنْ أُتَّقَى فَلَا يُجْعَلْ مَعِي إِلَهٌ آخَرُ فَمَنْ اتَّقَى أَنْ يَجْعَلَ مَعِي إِلَهًا آخَرَ فَأَنَا أَهْلٌ أَنْ أَغْفِرَ لَهُقَالَ أَبُو الْحَسَنِ الْقَطَّانُ حَدَّثَنَاهُ إِبْرَاهِيمُ بْنُ نَصْرٍ حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي حَزْمٍ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي هَذِهِ الْآيَةِ{ هُوَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ }قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَبُّكُمْ أَنَا أَهْلٌ أَنْ أُتَّقَى فَلَا يُشْرَكَ بِي غَيْرِي وَأَنَا أَهْلٌ لِمَنْ اتَّقَى أَنْ يُشْرِكَ بِي أَنْ أَغْفِرَ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ziad bin Habab] telah menceritakan kepada kami [Suhail bin Abdullah saudaranya Hazm bin Al Qath'i] telah menceritakan kepada kami [Tsabit Al Bunani] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam membaca ayat ini, yaitu: \"Dia (Allah) adalah Rabb yang patut (kita) bertaqwa kepada-Nya dan berhak memberi ampun.\" (QS Al Mudatsir; 56) Beliau bersabda: \"Allah 'azza wajalla berfirman: \"Saya adalah dzat yang patut untuk ditakuti, maka tidak di jadikan bersamaKu sesembahan yang lain, maka barangsiapa takut menjadikan bersamaku dengan sesembahan yang lain, maka saya berhak untuk memberi ampunan kepadanya.\" Abu Hasan Al Qatthan berkata; telah menceritakan kepada kami Ibrahim bin Nashr telah menceritakan kepada kami Hudbah bin Khalid telah menceritakan kepada kami Suhail bin Abu Hazm dari Tsabit dari Anas bahwa Rasulullah shallallahu 'alaihi wasallam bersabda mengenai ayat ini, yaitu: \": Dia (Allah) adalah Rabb yang patut (kita) bertaqwa kepada-Nya dan berhak memberi ampun.\" (QS Al Mudatsir; 56), Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb kalian berfirman: \"Aku adalah dzat yang berhak untuk di takuti, maka janganlah menyekutukan-Ku dengan sesuatu selainku, dan Aku adalah dzat yang barangsiapa takut menyekutukan-Ku, maka Aku berhak untuk memberi ampunan kepadanya.\""
            },
            {
                "number": 4249,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ حَدَّثَنَا اللَّيْثُ حَدَّثَنِي عَامِرُ بْنُ يَحْيَى عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَاحُ بِرَجُلٍ مِنْ أُمَّتِي يَوْمَ الْقِيَامَةِ عَلَى رُءُوسِ الْخَلَائِقِ فَيُنْشَرُ لَهُ تِسْعَةٌ وَتِسْعُونَ سِجِلًّا كُلُّ سِجِلٍّ مَدَّ الْبَصَرِ ثُمَّ يَقُولُ اللَّهُ عَزَّ وَجَلَّ هَلْ تُنْكِرُ مِنْ هَذَا شَيْئًا فَيَقُولُ لَا يَا رَبِّ فَيَقُولُ أَظَلَمَتْكَ كَتَبَتِي الْحَافِظُونَ ثُمَّ يَقُولُ أَلَكَ عَنْ ذَلِكَ حَسَنَةٌ فَيُهَابُ الرَّجُلُ فَيَقُولُ لَا فَيَقُولُ بَلَى إِنَّ لَكَ عِنْدَنَا حَسَنَاتٍ وَإِنَّهُ لَا ظُلْمَ عَلَيْكَ الْيَوْمَ فَتُخْرَجُ لَهُ بِطَاقَةٌ فِيهَا أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ قَالَ فَيَقُولُ يَا رَبِّ مَا هَذِهِ الْبِطَاقَةُ مَعَ هَذِهِ السِّجِلَّاتِ فَيَقُولُ إِنَّكَ لَا تُظْلَمُ فَتُوضَعُ السِّجِلَّاتُ فِي كِفَّةٍ وَالْبِطَاقَةُ فِي كِفَّةٍ فَطَاشَتْ السِّجِلَّاتُ وَثَقُلَتْ الْبِطَاقَةُقَالَ مُحَمَّدُ بْنُ يَحْيَى الْبِطَاقَةُ الرُّقْعَةُ وَأَهْلُ مِصْرَ يَقُولُونَ لِلرُّقْعَةِ بِطَاقَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Ibnu Abu Maryam] telah menceritakan kepada kami [Laits] telah menceritakan kepadaku ['Amir bin Yahya] dari [Abu Abdurrahman Al Hubuli] dia berkata; saya mendengar [Abdullah bin 'Amru] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari Kiamat akan di teriakan seorang laki-laki dari ummatku di atas kepala seluruh makhluk, maka di sebarkanlah untuknya sembilan puluh sembilan buku catatan, setiap buku catatan yang panjangnya sejauh mata memandang. Kemudian Allah 'azza wajalla berfirman: \"Apakah kamu mengingkari sesuatu dari catatan ini?\" dia menjawab; \"Tidak wahai Rabbku.\" Allah bertanya lagi; \"Apakah Malaikat penulis-Ku mendzalimimu?\" Kemudian Dia berfirman: \"Apakah kamu punya alasan? Apakah kamu punya kebaikan?\" Maka dengan rasa takut, laki-laki itu menjawab; \"Tidak.\" Allah berfirman: \"Ya, sesungguhnya kamu memiliki beberapa kebaikan di sisi Kami. Sesungguhnya pada hari ini tidak ada lagi kezhaliman bagi dirimu.\" Maka di keluarkanlah untuknya kartu yang bertuliskan; \"Laa ilaaha illallah wa anna Muhammadan 'Abduhu wa rasuuluhu (Tidak ada ilah yang berhak di sembah selain Allah dan bahwa Muhammad adalah hamba dan utusan-Nya).\" Beliau bersabda: \"Lelaki itu berkata; \"Wahai Rabbku, apa hubingannya kartu ini dengan buku catatan ini?\" Allah menjawab: \"Sesungguhnya kamu tidak akan dizhalimi.\" Maka di letakkanlah catatan-catatan itu di atas satu bagian (di sisi) timbangan, dan kartu di bagian lain (sisi yang lain) dari timbangan, ternyata catatan-catatan itu lebih ringan dan kartu itu lebih berat.\" Muhammad bin Yahya berkata; \"Kartu adalah suatu lempengan, dan penduduk Mesir biasa mengatakan lempengan tersebut adalah kartu.\""
            },
            {
                "number": 4250,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا زَكَرِيَّا حَدَّثَنَا عَطِيَّةُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ لِي حَوْضًا مَا بَيْنَ الْكَعْبَةِ وَبَيْتِ الْمَقْدِسِ أَبْيَضَ مِثْلَ اللَّبَنِ آنِيَتُهُ عَدَدُ النُّجُومِ وَإِنِّي لَأَكْثَرُ الْأَنْبِيَاءِ تَبَعًا يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Zakariya] telah menceritakan kepada kami ['Athiyah] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saya memiliki telaga (yang luasnya) antara Ka'bah hingga Baitul Maqdis, putihnya seperti putih susu, dan tempat minumnya sejumlah bintang-bintang, dan sesungguhnya aku adalah Nabi yang paling banyak pengikut di antara para Nabi kelak di hari Kiamat.\""
            },
            {
                "number": 4251,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ أَبِي مَالِكٍ سَعْدِ بْنِ طَارِقٍ عَنْ رِبْعِيٍّ عَنْ حُذَيْفَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ حَوْضِي لَأَبْعَدُ مِنْ أَيْلَةَ إِلَى عَدَنَ وَالَّذِي نَفْسِي بِيَدِهِ لَآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ النُّجُومِ وَلَهُوَ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِ وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَذُودُ عَنْهُ الرِّجَالَ كَمَا يَذُودُ الرَّجُلُ الْإِبِلَ الْغَرِيبَةَ عَنْ حَوْضِهِ قِيلَ يَا رَسُولَ اللَّهِ أَتَعْرِفُنَا قَالَ نَعَمْ تَرِدُونَ عَلَيَّ غُرًّا مُحَجَّلِينَ مِنْ أَثَرِ الْوُضُوءِ لَيْسَتْ لِأَحَدٍ غَيْرِكُمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Abu Malik Sa'd bin Thariq] dari [Rib'i] dari [Hudzaifah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya telagaku (luasnya) sejauh dari 'Ailah hingga 'Adn, demi dzat yang jiwaku berada di tangan-Nya, sungguh gelas-gelasnya lebih banyak dari jumlah bintang-bintang (di langit), ia lebihi putih dari putihnya susu dan lebih manis dari manisnya madu. Demi dzat yang jiwaku berada di tangan-Nya, sesungguhnya aku akan mempertahankannya dari orang-orang, sebagaimana seorang laki-laki yang mempertahankan telaganya dari unta asing.\" Lalu di tanyakan kepada beliau; \"Wahai Rasulullah, apakah anda mengenali kami?\" beliau menjawab: \"Ya, kalian di tampakkan kepadaku dengan wajah dan pergelangan tangan serta kaki yang putih bekas wudlu, yang tidak dimiliki oleh seorang pun dari selain kalian.\""
            },
            {
                "number": 4252,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ حَدَّثَنِي الْعَبَّاسُ بْنُ سَالِمٍ الدِّمَشْقِيُّ نُبِّئْتُ عَنْ أَبِي سَلَّامٍ الْحَبَشِيِّ قَالَبَعَثَ إِلَيَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَأَتَيْتُهُ عَلَى بَرِيدٍ فَلَمَّا قَدِمْتُ عَلَيْهِ قَالَ لَقَدْ شَقَقْنَا عَلَيْكَ يَا أَبَا سَلَّامٍ فِي مَرْكَبِكَ قَالَ أَجَلْ وَاللَّهِ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ وَاللَّهِ مَا أَرَدْتُ الْمَشَقَّةَ عَلَيْكَ وَلَكِنْ حَدِيثٌ بَلَغَنِي أَنَّكَ تُحَدِّثُ بِهِ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَوْضِ فَأَحْبَبْتُ أَنْ تُشَافِهَنِي بِهِ قَالَ فَقُلْتُ حَدَّثَنِي ثَوْبَانُ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ حَوْضِي مَا بَيْنَ عَدَنَ إِلَى أَيْلَةَ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِ أَكَاوِيبُهُ كَعَدَدِ نُجُومِ السَّمَاءِ مَنْ شَرِبَ مِنْهُ شَرْبَةً لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا وَأَوَّلُ مَنْ يَرِدُهُ عَلَيَّ فُقَرَاءُ الْمُهَاجِرِينَ الدُّنْسُ ثِيَابًا وَالشُّعْثُ رُءُوسًا الَّذِينَ لَا يَنْكِحُونَ الْمُنَعَّمَاتِ وَلَا يُفْتَحُ لَهُمْ السُّدَدُقَالَ فَبَكَى عُمَرُ حَتَّى اخْضَلَّتْ لِحْيَتُهُ ثُمَّ قَالَ لَكِنِّي قَدْ نَكَحْتُ الْمُنَعَّمَاتِ وَفُتِحَتْ لِي السُّدَدُ لَا جَرَمَ أَنِّي لَا أَغْسِلُ ثَوْبِي الَّذِي عَلَى جَسَدِي حَتَّى يَتَّسِخَ وَلَا أَدْهُنُ رَأْسِي حَتَّى يَشْعَثَ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid Ad Dimasyqi] telah menceritakan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Muhammad bin Muhajir] telah menceritakan kepadaku [Al 'Abbas bin Salim Ad Dimasyqi] telah di beritakan kepadaku dari [Abu Salam Al Habasyi] dia berkata; Umar bin Abdul Aziz memanaggilku, lantas saya mendatanginya sekitar satu Barid, ketika saya telah tiba, ia berkata; \"Sungguh kami telah memberatkanmu dengan kendaraanmu wahai Abu Salam.\" Dia menjawab; \"Tentu, demi Allah wahai Amirul Mukminin.\" Umar bin Abdul Aziz berkata; \"Demi Allah, saya tidak ingin memberatkan dalam perjalananmu ini melainkan karena hadits yang sampai kepadaku bahwa kamu telah bercerita dari Tsauban bekas budak Rasulullah shallallahu 'alaihi wasallam mengenai telaga. Maka saya lebih suka jika kamu sendiri yang mengabarkan kepadaku dengan lisanmu.\" Abu Salam berkata; \"lalu saya berkata; telah menceritakan kepadaku [Tsauban bekas budak Rasulullah shallallahu 'alaihi wasallam] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya telagaku (luasnya) antara 'Adn dan 'Ailah, lebih putih dari susu dan lebih manis dari manisnya madu. Gelas-gelasnya laksana jumlah bintang di langit. Barangsiapa meminum seteguk darinya, niscaya tidak akan merasa dahaga untuk salama-lamanya. Dan orang pertama kali yang di tampakkan kepadaku adalah orang-orang miskin dari kalangan Muhajirin yang berpakaian lusuh dan rambut yang kusut, yang tidak pernah merasakan kesenangan dan tidak pernah pula (merasakan) di bukakan bagi mereka tempat makanan.\""
            },
            {
                "number": 4253,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبِي حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ نَاحِيَتَيْ حَوْضِي كَمَا بَيْنَ صَنْعَاءَ وَالْمَدِينَةِ أَوْ كَمَا بَيْنَ الْمَدِينَةِ وَعُمَانَ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jarak antara dua sisi telagaku bagaikan jarak antara Shan'a dan Madinah atau bagaikan jarak antara Madinah dan Yaman.\""
            },
            {
                "number": 4254,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ قَالَ قَالَ أَنَسُ بْنُ مَالِكٍقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرَى فِيهِ أَبَارِيقُ الذَّهَبِ وَالْفِضَّةِ كَعَدَدِ نُجُومِ السَّمَاءِ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dia berkata; [Anas bin Malik] berkata; Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Di perlihatkan di dalamnya tempat minum yang terbuat dari emas dan perak, jumlahnya bagaikan bintang-bintang di langit.\""
            },
            {
                "number": 4255,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَتَى الْمَقْبَرَةَ فَسَلَّمَ عَلَى الْمَقْبَرَةِ فَقَالَ السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ تَعَالَى بِكُمْ لَاحِقُونَ ثُمَّ قَالَ لَوَدِدْنَا أَنَّا قَدْ رَأَيْنَا إِخْوَانَنَا قَالُوا يَا رَسُولَ اللَّهِ أَوَلَسْنَا إِخْوَانَكَ قَالَ أَنْتُمْ أَصْحَابِي وَإِخْوَانِي الَّذِينَ يَأْتُونَ مِنْ بَعْدِي وَأَنَا فَرَطُكُمْ عَلَى الْحَوْضِ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ تَعْرِفُ مَنْ لَمْ يَأْتِ مِنْ أُمَّتِكَ قَالَ أَرَأَيْتُمْ لَوْ أَنَّ رَجُلًا لَهُ خَيْلٌ غُرٌّ مُحَجَّلَةٌ بَيْنَ ظَهْرَانَيْ خَيْلٍ دُهْمٍ بُهْمٍ أَلَمْ يَكُنْ يَعْرِفُهَا قَالُوا بَلَى قَالَ فَإِنَّهُمْ يَأْتُونَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ أَثَرِ الْوُضُوءِ قَالَ أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ ثُمَّ قَالَ لَيُذَادَنَّ رِجَالٌ عَنْ حَوْضِي كَمَا يُذَادُ الْبَعِيرُ الضَّالُّ فَأُنَادِيهِمْ أَلَا هَلُمُّوا فَيُقَالُ إِنَّهُمْ قَدْ بَدَّلُوا بَعْدَكَ وَلَمْ يَزَالُوا يَرْجِعُونَ عَلَى أَعْقَابِهِمْ فَأَقُولُ أَلَا سُحْقًا سُحْقًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Al 'Ala` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau pernah mendatangi pemakaman dan beliau mengucapkan salam kepada ahli kubur, beliau mengucapkan: \"Semoga keselamatan senantiasa tercurah bagimu, rumah bagi kaum Muslimin, dan Insya Allah Ta'ala kami akan menyusulmu.\" Lalu beliau bersabda: \"Sungguh kami berharap untuk dapat berjumpa dengan saudara-saudara kami ini.\" Para sahabat bertanya; \"Wahai Rasulullah, apakah kami bukan saudara-saudaramu?\" beliau menjawab: \"Kalian adalah para sahabatku dan saudara-saudaraku yang datang setelahku, sesungguhnya aku menunggu kalian di telagaku.\" Mereka bertanya; \"Wahai Rasulullah, bagaimana anda bisa mengenali orang-orang yang tidak anda ketahui dari umatmu?\" beliau menjawab: \"Bagaimana menurut kalian jika seseorang memiliki kuda berbulu putih di muka dan di kedua pergelangan kakinya, di tengah-tengah gerombolan kuda hitam pekat? Bukankah ia dapat dikenali?\" Mereka menjawab; \"Tentu.\" Beliau bersabda: \"Sesungguhnya mereka datang pada hari Kiamat dengan muka dan kedua pergelangan tangan dan kaki mereka yang putih bekas air wudlu.\" Beliau bersabda: \"Aku menunggu kalian di tepi telaga.\" Lalu beliau melanjutkan: \"Ketahuilah bahwa telagaku akan dijaga sebagaimana di jaganya telaga dari unta yang tersesat. Kemudian aku akan memanggil mereka; \"Mari datanglah.\" Maka di katakan; \"Sesungguhnya mereka telah merubahnya setelahmu, serta mereka masih terus membalikkan badannya, maka aku berkata; \"Majulah, majulah.\""
            },
            {
                "number": 4256,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِكُلِّ نَبِيٍّ دَعْوَةٌ مُسْتَجَابَةٌ فَتَعَجَّلَ كُلُّ نَبِيٍّ دَعْوَتَهُ وَإِنِّي اخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي فَهِيَ نَائِلَةٌ مَنْ مَاتَ مِنْهُمْ لَا يُشْرِكُ بِاللَّهِ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap Nabi do'anya adalah mustajab (dikabulkan), maka semua Nabi tergesa-gesa mempergunakan do'anya. Sesungguhnya aku menyimpan do'aku untuk memberi syafa'at kepada ummatku (kelak), maka itu akan di dapat oleh orang yang mati di antara mereka dalam keadaan tidak menyekutukan Allah dengan sesuatupun.\""
            },
            {
                "number": 4257,
                "arab": "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى وَأَبُو إِسْحَقَ الْهَرَوِيُّ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ قَالَا حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جُدْعَانَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا سَيِّدُ وَلَدِ آدَمَ وَلَا فَخْرَ وَأَنَا أَوَّلُ مَنْ تَنْشَقُّ الْأَرْضُ عَنْهُ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ وَأَنَا أَوَّلُ شَافِعٍ وَأَوَّلُ مُشَفَّعٍ وَلَا فَخْرَ وَلِوَاءُ الْحَمْدِ بِيَدِي يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ",
                "id": "Telah menceritakan kepada kami [Mujahid bin Musa] dan [Abu Ishaq Al Harawi Ibrahim bin Abdullah bin Hatim] keduanya berkata; telah menceritakan kepada kami [Husyaim] telah memberitakan kepada kami [Ali bin Zaid bin Jud'an] dari [Abu Nadlrah] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya adalah pemuka anak Adam dan tidak sombong. Aku adalah orang yang pertama kali di bukakan bumi (di bangkitkan) pada hari Kiamat, dan tidak sombong. Aku adalah orang yang pertama kali memberi syafa'at dan di mintai syafa'at dan tidak sombong. Bendera pujian ada di tanganku pada hari Kiamat dan tidak sombong.\""
            },
            {
                "number": 4258,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ قَالَا حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا سَعِيدُ بْنُ يَزِيدَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَهْلُ النَّارِ الَّذِينَ هُمْ أَهْلُهَا فَلَا يَمُوتُونَ فِيهَا وَلَا يَحْيَوْنَ وَلَكِنْ نَاسٌ أَصَابَتْهُمْ نَارٌ بِذُنُوبِهِمْ أَوْ بِخَطَايَاهُمْ فَأَمَاتَتْهُمْ إِمَاتَةً حَتَّى إِذَا كَانُوا فَحْمًا أُذِنَ لَهُمْ فِي الشَّفَاعَةِ فَجِيءَ بِهِمْ ضَبَائِرَ ضَبَائِرَ فَبُثُّوا عَلَى أَنْهَارِ الْجَنَّةِ فَقِيلَ يَا أَهْلَ الْجَنَّةِ أَفِيضُوا عَلَيْهِمْ فَيَنْبُتُونَ نَبَاتَ الْحِبَّةِ تَكُونُ فِي حَمِيلِ السَّيْلِ قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ كَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ كَانَ فِي الْبَادِيَةِ",
                "id": "Telah menceritakan kepada kami [Nashr bin 'Ali] dan [Ishaq bin Ibrahim bin Habib] keduanya berkata; telah menceritakan kepada kami [Bisyr bin Al Mufadlal] telah menceritakan kepada kami [Sa'id bin Yazid] dari [Abu Nadlrah] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penghuni neraka yang mereka benar-benar penghuninya, mereka tidak akan merasakan kematian dan juga tidak hidup di dalamnya. Akan tetapi mereka adalah orang-orang yang terkena api neraka karena dosa-dosa dan kesalahan-kesalahan mereka, maka mereka akan di matikan sesaat. Dan ketika mereka telah menjadi arang, maka mereka di izinkan untuk mendapatkan syafa'at. Lalu mereka di datangkan secara berkelompok-kelompok, kemudian mereka di mandikan di sungai-sungai surga. Maka di katakan; \"Wahai penghuni surga, berilah mereka minuman.\" Maka mereka menumbuhkan tumbuhan hibbah (biji-bijian) yang ada di arus sungai.\" Perawi berkata; \"Maka berkatalah seseorang dari mereka; \"Seakan-akan Rasulullah shallallahu 'alaihi wasallam baru tiba dari pedalaman.\""
            },
            {
                "number": 4259,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ شَفَاعَتِي يَوْمَ الْقِيَامَةِ لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِي",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Zuhair bin Muhammad] dari [Ja'far bin Muhammad] dari [ayahnya] dari [Jabir] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya syafa'atku pada hari Kiamat adalah untuk para pelaku dosa besar dari ummatku.\""
            },
            {
                "number": 4260,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ أَسَدٍ حَدَّثَنَا أَبُو بَدْرٍ حَدَّثَنَا زِيَادُ بْنُ خَيْثَمَةَ عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُيِّرْتُ بَيْنَ الشَّفَاعَةِ وَبَيْنَ أَنْ يَدْخُلَ نِصْفُ أُمَّتِي الْجَنَّةَ فَاخْتَرْتُ الشَّفَاعَةَ لِأَنَّهَا أَعَمُّ وَأَكْفَى أَتُرَوْنَهَا لِلْمُتَّقِينَ لَا وَلَكِنَّهَا لِلْمُذْنِبِينَ الْخَطَّائِينَ الْمُتَلَوِّثِينَ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Asad] telah menceritakan kepada kami [Abu Badr] telah menceritakan kepada kami [Ziyad bin Khaitsamah] dari [Nu'aim bin Abu Hind] dari [Rib'I bin Hirasy] dari [Abu Musa Al Asy'ari] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya di suruh memilih antara setengah ummatku akan di masukkan ke surga dengan di beri syafa'at, maka saya memilih syafa'at, karena sesungguhnya syafa'at lebih mencakup dan lebih mencukupi, bagaimana pendapat kalian, apakah ia hanya di berikan kepada orang-orang yang bertaqwa saja? Tidak, akan tetapi ia di berikan juga terhadap orang-orang yang berdosa dan orang-orang yang banyak kesalahan.\""
            },
            {
                "number": 4261,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَجْتَمِعُ الْمُؤْمِنُونَ يَوْمَ الْقِيَامَةِ يُلْهَمُونَ أَوْ يَهُمُّونَ شَكَّ سَعِيدٌ فَيَقُولُونَ لَوْ تَشَفَّعْنَا إِلَى رَبِّنَا فَأَرَاحَنَا مِنْ مَكَانِنَا فَيَأْتُونَ آدَمَ فَيَقُولُونَ أَنْتَ آدَمُ أَبُو النَّاسِ خَلَقَكَ اللَّهُ بِيَدِهِ وَأَسْجَدَ لَكَ مَلَائِكَتَهُ فَاشْفَعْ لَنَا عِنْدَ رَبِّكَ يُرِحْنَا مِنْ مَكَانِنَا هَذَا فَيَقُولُ لَسْتُ هُنَاكُمْ وَيَذْكُرُ وَيَشْكُو إِلَيْهِمْ ذَنْبَهُ الَّذِي أَصَابَ فَيَسْتَحْيِي مِنْ ذَلِكَ وَلَكِنْ ائْتُوا نُوحًا فَإِنَّهُ أَوَّلُ رَسُولٍ بَعَثَهُ اللَّهُ إِلَى أَهْلِ الْأَرْضِ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ وَيَذْكُرُ سُؤَالَهُ رَبَّهُ مَا لَيْسَ لَهُ بِهِ عِلْمٌ وَيَسْتَحْيِي مِنْ ذَلِكَ وَلَكِنْ ائْتُوا خَلِيلَ الرَّحْمَنِ إِبْرَاهِيمَ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ وَلَكِنْ ائْتُوا مُوسَى عَبْدًا كَلَّمَهُ اللَّهُ وَأَعْطَاهُ التَّوْرَاةَ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ وَيَذْكُرُ قَتْلَهُ النَّفْسَ بِغَيْرِ النَّفْسِ وَلَكِنْ ائْتُوا عِيسَى عَبْدَ اللَّهِ وَرَسُولَهُ وَكَلِمَةَ اللَّهِ وَرُوحَهُ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ وَلَكِنْ ائْتُوا مُحَمَّدًا عَبْدًا غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ قَالَ فَيَأْتُونِي فَأَنْطَلِقُ قَالَ فَذَكَرَ هَذَا الْحَرْفَ عَنْ الْحَسَنِ قَالَ فَأَمْشِي بَيْنَ السِّمَاطَيْنِ مِنْ الْمُؤْمِنِينَ قَالَ ثُمَّ عَادَ إِلَى حَدِيثِ أَنَسٍ قَالَ فَأَسْتَأْذِنُ عَلَى رَبِّي فَيُؤْذَنُ لِي فَإِذَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ ارْفَعْ يَا مُحَمَّدُ وَقُلْ تُسْمَعْ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَحْمَدُهُ بِتَحْمِيدٍ يُعَلِّمُنِيهِ ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَيُدْخِلُهُمْ الْجَنَّةَ ثُمَّ أَعُودُ الثَّانِيَةَ فَإِذَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ لِي ارْفَعْ مُحَمَّدُ قُلْ تُسْمَعْ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَرْفَعُ رَأْسِي فَأَحْمَدُهُ بِتَحْمِيدٍ يُعَلِّمُنِيهِ ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَيُدْخِلُهُمْ الْجَنَّةَ ثُمَّ أَعُودُ الثَّالِثَةَ فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ ارْفَعْ مُحَمَّدُ قُلْ تُسْمَعْ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَرْفَعُ رَأْسِي فَأَحْمَدُهُ بِتَحْمِيدٍ يُعَلِّمُنِيهِ ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَيُدْخِلُهُمْ الْجَنَّةَ ثُمَّ أَعُودُ الرَّابِعَةَ فَأَقُولُ يَا رَبِّ مَا بَقِيَ إِلَّا مَنْ حَبَسَهُ الْقُرْآنُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat kelak, orang-orang beriman berkumpul dan mereka diberi ilham -atau di beri naluri (Sa'id ragu) - sehingga mengatakan; \"Sebaiknya kita meminta syafa'at kepada Rabb kita 'azza wajalla sehingga kita dapat pindah dari tempat kita sekarang juga.' Lalu mereka mendatangi Adam 'Alaihis Salam seraya mengatakan; 'Wahai Adam, engkau adalah bapaknya manusia, Allah menciptakanmu dengan tangan-Nya sendiri dan menjadikan malaikat-malaikat-Nya sujud kepadamu, serta diajarkan pula kepadamu nama-nama segala sesuatu, maka mintakanlah syafa'at kepada Rabbmu agar Dia memindahkan kami dari tempat kami ini! \" Maka Adam berkata; \"Bukan aku yang kalian maksud\" kemudian Adam menyebutkan dosa yang pernah ia lakukan, hingga dosa tersebut membuatnya malu kepada Allah, (Adam berkata); Akan tetapi datanglah kalian kepada Nuh karena ia adalah rasul pertama kali yang Allah utus ke muka bumi, ' kemudian mereka pun mendatangi Nuh, namun dia berkata; \"Bukan aku yang kalian maksud, \" lalu ia menyebutkan kesalahan dan permintaannya kepada Rabbnya dengan tanpa ilmu, hingga membuatnya malu; \"Akan tetapi datangilah Ibrahim kekasih Ar Rahman, \" maka mereka pun mendatanginya, namun dia juga mengatakan; \"Bukan aku yang kalian maksud, tapi datanglah kalian kepada Musa, seorang hamba yang Allah ajak bicara secara langsung dan diberikan Taurat.\" Maka merekapun mendatangi Musa, dan Musa juga berkata; \"Bukan aku yang kalian maksud, \" seraya menyebutkan seseorang yang dia bunuh tanpa alasan yang benar; \"akan tetapi datanglah kalian kepada Isa, hamba Allah dan Rasul-Nya, kalimat serta ruh-Nya.\" Maka merekapun mendatangi Isa, kemudian Isa juga mengatakan; \"Bukan aku yang kalian maksud, akan tetapi datanglah kalian kepada Muhammad, seorang hamba yang dosanya telah diampuni Allah, baik yang lalu atau yang akan datang.\" Beliau bersabda: \"Maka mereka pun mendatangiku, lalu saya pun bertolak.\" Perawi berkata; \"Kemudian ia menyebutkan kalimat tersebut dari Al Hasan beliau bersabda: Maka aku berjalan di antara barisan manusia dari kaum Mukminin.\" Perawi berkata; Kemudian kembali kepada hadits Anas; beliau bersabda: \"Maka aku meminta izin kepada Rabbku, lalu aku pun diizinkan. Ketika aku melihat Rabbku, aku langsung jatuh sujud, kemudian Dia membiarkanku bersujud sekehendak-Nya, Kemudian dikatakan; \"Bangunlah ya Muhammad! berkatalah maka kamu akan didengarkan! memintalah maka kamu akan diberikan! dan mintalah syafa'at maka kamu akan diberi (hak memberi syafa'at).\" Maka aku memuji-Nya dengan pujian yang Dia ajarkan kepadaku, kemudian aku memberikan syafa'at dan Dia memberikan aku batasan, lalu aku memasukkan orang-orang ke dalam surga. Kemudian aku kembali (kepada Rabbku) untuk yang kedua kalinya, ketika aku melihat Rabbku aku langsung jatuh sujud, kemudian Dia membiarkanku bersujud sekehendak-Nya. Lalu dikatakan; 'Bangunlah ya Muhammad! berkatalah maka engkau akan didengarkan! memintalah maka engkau akan diberikan! dan mintalah syafa'at maka engkau akan diberi (hak memberi syafa'at).\" Maka aku mengangkat kepalaku dan memuji-Nya dengan pujian yang Dia ajarkan kepadaku, kemudian aku memberikan syafa'at dan Dia memberikan aku batasan, lalu aku memasukkan orang-orang ke dalam surga.\" Kemudian aku kembali (kepada Rabbku) untuk yang ketiga kalinya, dan ketika aku melihat Rabbku aku langsung tersungkur sujud kepada Rabbku, kemudian Dia membiarkanku bersujud sekehendak-Nya. Kemudian dikatakan; \"Bangunlah ya Muhammad! berkatalah maka engkau akan didengarkan! memintalah maka engkau akan diberikan! dan mintalah syafa'at maka engkau akan diberi (hak memberi syafa'at).\" Maka aku mengangkat kepalaku dan memuji-Nya dengan pujian yang Dia ajarkan kepadaku, kemudian aku memberikan syafa'at dan Dia memberikan aku batasan, lalu aku memasukkan orang-orang ke dalam surga.\" Kemudian aku kembali (kepada Rabbku) untuk yang keempat kalinya, lalu aku berkata: 'Wahai Rabb, tidak ada yang tersisa kecuali orang yang terhalang oleh Al Qur`an.\""
            },
            {
                "number": 4262,
                "arab": "قَالَ يَقُولُ قَتَادَةُ عَلَى أَثَرِ هَذَا الْحَدِيثِ وَحَدَّثَنَا أَنَسُ بْنُ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَخْرُجُ مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِثْقَالُ شَعِيرَةٍ مِنْ خَيْرٍ وَيَخْرُجُ مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِثْقَالُ بُرَّةٍ مِنْ خَيْرٍ وَيَخْرُجُ مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ خَيْرٍ",
                "id": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya) perawi berkata; [Qatadah] berkata mengenai atsar hadits ini, dan telah menceritakan kepada kami [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan keluar dari neraka orang yang berkata LA ILAHA ILLA AllAH (tidak ada ilah kecuali Allah) jika dalam hatinya terdapat kebaikan walau sebiji gandum, dan akan keluar dari neraka orang yang berkata LA ILAHA ILLA AllAH jika dalam hatinya terdapat kebaikan walau sebiji sawi\""
            },
            {
                "number": 4263,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الطُّفَيْلِ بْنِ أُبَيِّ بْنِ كَعْبٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ كُنْتُ إِمَامَ النَّبِيِّينَ وَخَطِيبَهُمْ وَصَاحِبَ شَفَاعَتِهِمْ غَيْرَ فَخْرٍ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Abdullah Ar Raqqi] telah menceritakan kepada kami ['ubaidhullah bin 'Amru] dari [Abdullah bin Muhammad bin 'Aqil] dari [At Thufail bin Abu Ubay bin Ka'ab] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika datang hari Kimat, maka aku akan menjadi pemimpin para Nabi dan juru bicara mereka, Pemilik syafa'at mereka yang tidak sombong.\""
            }
        ]
    }
}