{
    "status": true,
    "data": {
        "start": 1765,
        "end": 1911,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 1765,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْمِصْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ مُوسَى بْنَ جُبَيْرٍ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحُبَابِ الْأَنْصَارِيَّ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ أُنَيْسٍ حَدَّثَهُأَنَّهُ تَذَاكَرَ هُوَ وَعُمَرُ بْنُ الْخَطَّابِ يَوْمًا الصَّدَقَةَ فَقَالَ عُمَرُ أَلَمْ تَسْمَعْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ يَذْكُرُ غُلُولَ الصَّدَقَةِ أَنَّهُ مَنْ غَلَّ مِنْهَا بَعِيرًا أَوْ شَاةً أُتِيَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُقَالَ فَقَالَ عَبْدُ اللَّهِ بْنُ أُنَيْسٍ بَلَى",
                "id": "Telah menceritakan kepada kami [Amru bin Sawwad Al Mishri] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Amru bin Al Harits] bahwa [Musa bin Jubair] telah menceritakan kepadanya, bahwa [Abdullah bin Abdurrahman bin Al Hubab Al Anshary] telah menceritakan kepadanya, bahwa [Abdullah bin Unais] telah menceritakan kepadanya, bahwasanya pada suatu hari dirinya dengan Umar bin Khaththab sedang berbincang-bincang seputar masalah zakat. [Umar] berkata, \"Apakah kamu tidak mendengar ketika Rasulullah shallallahu 'alaihi wasallam tentang ghulul (mencuri) dalam masalah zakat, \"Barangsiapa mencuri harta zakat baik unta ataupun kambing, maka pada hari kiamat ia akan didatangkan kepadanya dan diperintahkan untuk membawanya. \" Maka Abdullah bin Unais menjawab, \"Benar. \""
            },
            {
                "number": 1766,
                "arab": "حَدَّثَنَا أَبُو بَدْرٍ عَبَّادُ بْنُ الْوَلِيدِ حَدَّثَنَا أَبُو عَتَّابٍ حَدَّثَنِي إِبْرَاهِيمُ بْنُ عَطَاءٍ مَوْلَى عِمْرَانَ حَدَّثَنِي أَبِي أَنَّ عِمْرَانَ بْنَ الْحُصَيْنِاسْتُعْمِلَ عَلَى الصَّدَقَةِ فَلَمَّا رَجَعَ قِيلَ لَهُ أَيْنَ الْمَالُ قَالَ وَلِلْمَالِ أَرْسَلْتَنِي أَخَذْنَاهُ مِنْ حَيْثُ كُنَّا نَأْخُذُهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوَضَعْنَاهُ حَيْثُ كُنَّا نَضَعُهُ",
                "id": "Telah menceritakan kepada kami [Abu Badr Abbad bin Al Walid] berkata, telah menceritakan kepada kami [Abu 'Attab] berkata, telah menceritakan kepadaku [Ibrahim bin 'Atha] -mantan budak Imran- berkata, telah menceritakan kepada kami kepadaku [Bapakku] bahwa [Imran bin Al Hushain] dipekerjakan untuk menjaga harta zakat. Ketika ia kembali, ia ditanya, \"Di mana harta zakat itu?\" ia menjawab; \"Adapun harta zakat yang karenanya engkau mengutusku, maka kami mengambilnya sesuai di mana kami mengambilnya pada masa Rasulullah, dan kami meletakkannya sesuai di mana kami meletakkannya.\""
            },
            {
                "number": 1767,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abdullah bin Dinar] dari [Sulaiman bin Yasar] dari [Irak bin Malik] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang muslim tidak ada kewajiban untuk mengeluarkan zakat kuda dan budaknya.\""
            },
            {
                "number": 1768,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَجَوَّزْتُ لَكُمْ عَنْ صَدَقَةِ الْخَيْلِ وَالرَّقِيقِ",
                "id": "Telah menceritakan kepada kami [Sahl bin Abu Sahl] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abu Ishaq] dari [Al Harits] dari [Ali] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Aku membebaskan kalian dari zakat kuda dan budak.\""
            },
            {
                "number": 1769,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ إِلَى الْيَمَنِ وَقَالَ لَهُ خُذْ الْحَبَّ مِنْ الْحَبِّ وَالشَّاةَ مِنْ الْغَنَمِ وَالْبَعِيرَ مِنْ الْإِبِلِ وَالْبَقَرَةَ مِنْ الْبَقَرِ",
                "id": "Telah menceritakan kepada kami [Amru bin Sawwad Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Sulaiman bin Bilal] dari [Syarik bin Abu Namir] dari ['Atha bin Yasar] dari [Mu'adz bin Jabal] bahwa Rasulullah shallallahu 'alaihi wasallam mengutusnya ke Yaman dan bersabda kepadanya: \"Ambillah biji dari biji, domba dari kambing, unta dari unta dan sapi dari sapi.\""
            },
            {
                "number": 1770,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَإِنَّمَا سَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الزَّكَاةَ فِي هَذِهِ الْخَمْسَةِ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالتَّمْرِ وَالزَّبِيبِ وَالذُّرَةِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isma'il bin Ayyasy] dari [Muhammad bin ubaidhullah] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah menetapkan zakat pada lima bentuk makanan; tepung gandum, gandum, kurma, anggur kering dan jagung.\""
            },
            {
                "number": 1771,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى أَبُو مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا عَاصِمُ بْنُ عَبْدِ الْعَزِيزِ بْنِ عَاصِمٍ حَدَّثَنَا الْحَارِثُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي ذُبَابٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ وَعَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا سَقَتْ السَّمَاءُ وَالْعُيُونُ الْعُشْرُ وَفِيمَا سُقِيَ بِالنَّضْحِ نِصْفُ الْعُشْرِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Musa Abu Musa Al Anshari] berkata, telah menceritakan kepada kami ['Ashim bin Abdul Aziz bin 'Ashim] berkata, telah menceritakan kepada kami [Al Harits bin 'Abdurrahman bin Abdullah bin Sa'd bin Abu Dubab] dari [Sulaiman bin Yasar] dan [Busr bin Sa'id] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tanaman yang disiram langit (air hujan) dan mata air, zakatnya adalah seper sepuluh. Sementara yang diairi oleh tenaga zakatnya adalah dari seper dua puluh.\""
            },
            {
                "number": 1772,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْمِصْرِيُّ أَبُو جَعْفَرٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِيمَا سَقَتْ السَّمَاءُ وَالْأَنْهَارُ وَالْعُيُونُ أَوْ كَانَ بَعْلًا الْعُشْرُ وَفِيمَا سُقِيَ بِالسَّوَانِي نِصْفُ الْعُشْرِ",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Mishri Abu Ja'far] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim] dari [Bapaknya] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa-apa yang diairi oleh langit, sungai serta mata air, atau tadah hujan adalah seper sepuluh. Sementara yang diairi dengan tenaga sendiri adalah seper dua puluh.\""
            },
            {
                "number": 1773,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيِّ بْنِ عَفَّانَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ عَنْ أَبِي وَائِلٍ عَنْ مَسْرُوقٍ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ وَأَمَرَنِي أَنْ آخُذَ مِمَّا سَقَتْ السَّمَاءُ وَمَا سُقِيَ بَعْلًا الْعُشْرَ وَمَا سُقِيَ بِالدَّوَالِي نِصْفَ الْعُشْرِقَالَ يَحْيَى بْنُ آدَمَ الْبَعْلُ وَالْعَثَرِيُّ وَالْعَذْيُ هُوَ الَّذِي يُسْقَى بِمَاءِ السَّمَاءِ وَالْعَثَرِيُّ مَا يُزْرَعُ بِالسَّحَابِ وَالْمَطَرِ خَاصَّةً لَيْسَ يُصِيبُهُ إِلَّا مَاءُ الْمَطَرِ وَالْبَعْلُ مَا كَانَ مِنْ الْكُرُومِ قَدْ ذَهَبَتْ عُرُوقُهُ فِي الْأَرْضِ إِلَى الْمَاءِ فَلَا يَحْتَاجُ إِلَى السَّقْيِ الْخَمْسَ سِنِينَ وَالسِّتَّ يَحْتَمِلُ تَرْكَ السَّقْيِ فَهَذَا الْبَعْلُ وَالسَّيْلُ مَاءُ الْوَادِي إِذَا سَالَ وَالْغَيْلُ سَيْلٌ دُونَ سَيْلٍ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali bin Affan] berkata, telah menceritakan kepada kami [Yahya bin Adam] berkata, telah menceritakan kepada kami [Abu Bakr bin Ayyasy] dari [Ashim bin Abu An Najud] dari [Abu Wa`il] dari [Masruq] dari [Mu'adz bin Jabal] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman dan memerintahkan agar aku mengambil zakat tanaman yang diairi oleh langit atau tanah tadah hujan sebesar sepersepuluh. Sementara yang diairi dengan ember zakatnya adalah seper dua puluh.\" Yahya bin Adam berkata, \"Al Ba'lu, Al 'Atsari dan Al 'Adzyyu adalah sesuatu yang diairi oleh langit.? Lebih khusus, bahwa Al 'Atsari adalah tanaman yang ditanam karena bantuan mendung dan hujan, ia tidak diairi kecuali dengan air hujan. Sementara Al Ba'lu adalah pepohonan yang akarnya menancap jauh ke dasar bumi menembus air, hingga ia tidak butuh disiram meski dalam waktu lima atau enam tahun. Inilah Al ba'lu. Sedangkan As Sail adalah air lembah yang mengalir jika terjadi banjir. Dan ghail adalah air yang selalu mengalir."
            },
            {
                "number": 1774,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ وَالزُّبَيْرُ بْنُ بَكَّارٍ قَالَا حَدَّثَنَا ابْنُ نَافِعٍ حَدَّثَنَا مُحَمَّدُ بْنُ صَالِحٍ التَّمَّارُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَتَّابِ بْنِ أَسِيدٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَبْعَثُ عَلَى النَّاسِ مَنْ يَخْرُصُ عَلَيْهِمْ كُرُومَهُمْ وَثِمَارَهُمْ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] dan [Zubair bin Bakkar] keduanya berkata; telah menceritakan kepada kami [Ibnu Nafi'] berkata, telah menceritakan kepada kami [Muhammad bin Shalih At Tammar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari ['Attab bin Usaid] berkata; \"Nabi shallallahu 'alaihi wasallam mengutus seseorang untuk menghitung takaran buah atau anggur yang ada di pohon milik orang-orang.\""
            },
            {
                "number": 1775,
                "arab": "حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ الرَّقِّيُّ حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ عَنْ جَعْفَرِ بْنِ بُرْقَانَ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ افْتَتَحَ خَيْبَرَ اشْتَرَطَ عَلَيْهِمْ أَنَّ لَهُ الْأَرْضَ وَكُلَّ صَفْرَاءَ وَبَيْضَاءَ يَعْنِي الذَّهَبَ وَالْفِضَّةَ وَقَالَ لَهُ أَهْلُ خَيْبَرَ نَحْنُ أَعْلَمُ بِالْأَرْضِ فَأَعْطِنَاهَا عَلَى أَنْ نَعْمَلَهَا وَيَكُونَ لَنَا نِصْفُ الثَّمَرَةِ وَلَكُمْ نِصْفُهَا فَزَعَمَ أَنَّهُ أَعْطَاهُمْ عَلَى ذَلِكَ فَلَمَّا كَانَ حِينَ يُصْرَمُ النَّخْلُ بَعَثَ إِلَيْهِمْ ابْنَ رَوَاحَةَ فَحَزَرَ النَّخْلَ وَهُوَ الَّذِي يَدْعُونَهُ أَهْلُ الْمَدِينَةِ الْخَرْصَ فَقَالَ فِي ذَا كَذَا وَكَذَا فَقَالُوا أَكْثَرْتَ عَلَيْنَا يَا ابْنَ رَوَاحَةَ فَقَالَ فَأَنَا أَحْزِرُ النَّخْلَ وَأُعْطِيكُمْ نِصْفَ الَّذِي قُلْتُ قَالَ فَقَالُوا هَذَا الْحَقُّ وَبِهِ تَقُومُ السَّمَاءُ وَالْأَرْضُ فَقَالُوا قَدْ رَضِينَا أَنْ نَأْخُذَ بِالَّذِي قُلْتَ",
                "id": "Telah menceritakan kepada kami [Musa bin Marwan Ar Raqqi] berkata, telah menceritakan kepada kami [Umar bin Ayyub] dari [Ja'far bin Burqan] dari [Maimun bin Mihran] dari [Miqsam] dari [Ibnu Abbas] berkata; \"Ketika Nabi shallallahu 'alaihi wasallam mengalahkan Khaibar, beliau memberi persyaratan kepada mereka (Yahudi), bahwa semua tanah, yang kuning dan yang putih -yakni emas dan perak- menjadi milik beliau. Penduduk Khaibar berkata, \"Kami lebih mengetahui dengan tanah ini, maka berikanlah kepada kami tanah hingga kami menggarapnya. Kami mendapatkan setengah dan kalian juga mendapatkan setengah dari hasil buah yang didapat.\" Ia mengira bahwa Nabi memberikannya kepada mereka. Maka ketika tiba saatnya pohon kurma untuk ditebang, beliau mengutus Ibnu Rawahah kepada mereka. Ibnu Rawahah menerka-nerka pohon kurma -yang disebut oleh penduduk Madinah dengan Al Kharsh (terkaan) -, lalu Ibnu Rawahah berkata, \"Yang di sini seperti ini dan seperti ini.\" Maka mereka berkata, \"Wahai Ibnu Rawahah, kamu telah memperbanyak dirimu atas kami.\" Ibnu Rawahah menjawab, \"Aku hanya menerka-nerka pohon kurma dan memberikan kepada kalian setengah dari yang aku katakan.\" Mereka berkata; \"Inilah kebenaran yang dengannya langit dan bumi berdiri\". Lalu mereka berkata lagi; \"Kami telah rela mengambil bagian sesuai yang kamu katakan.\""
            },
            {
                "number": 1776,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ حَدَّثَنِي صَالِحُ بْنُ أَبِي عَرِيبٍ عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ عَلَّقَ رَجُلٌ أَقْنَاءً أَوْ قِنْوًا وَبِيَدِهِ عَصًا فَجَعَلَ يَطْعَنُ يُدَقْدِقُ فِي ذَلِكَ الْقِنْوِ وَيَقُولُ لَوْ شَاءَ رَبُّ هَذِهِ الصَّدَقَةِ تَصَدَّقَ بِأَطْيَبَ مِنْهَا إِنَّ رَبَّ هَذِهِ الصَّدَقَةِ يَأْكُلُ الْحَشَفَ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bisyr Bakr bin Khalaf] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Abdul Hamid bin Ja'far] berkata, telah menceritakan kepada kami [Shalih bin Abu Arib] dari [Katsir bin Murrah Al Hadlrami] dari [Auf bin Malik Al Asyja'i] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar menuju masjid sementara di tangannya terdapat sebuah tongkat, lalu seorang laki-laki menggantungkan tandan yang masih terdapat kurmanya. Beliau mengoyang-goyang tandan tersebut dengan tongkatnya, lalu bersabda: \"Sekiranya pemilik sedekah ini bersedekah dengan yang lebih baik. Sungguh, pemilik sedekah ini pada hari kiamat akan makan kurma yang telah rusak.\""
            },
            {
                "number": 1777,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ الْعَنْقَزِيُّ حَدَّثَنَا أَسْبَاطُ بْنُ نَصْرٍ عَنْ السُّدِّيِّ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍفِي قَوْلِهِ سُبْحَانَهُ{ وَمِمَّا أَخْرَجْنَا لَكُمْ مِنْ الْأَرْضِ وَلَا تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنْفِقُونَ }قَالَ نَزَلَتْ فِي الْأَنْصَارِ كَانَتْ الْأَنْصَارُ تُخْرِجُ إِذَا كَانَ جِدَادُ النَّخْلِ مِنْ حِيطَانِهَا أَقْنَاءَ الْبُسْرِ فَيُعَلِّقُونَهُ عَلَى حَبْلٍ بَيْنَ أُسْطُوَانَتَيْنِ فِي مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَأْكُلُ مِنْهُ فُقَرَاءُ الْمُهَاجِرِينَ فَيَعْمِدُ أَحَدُهُمْ فَيُدْخِلُ قِنْوًا فِيهِ الْحَشَفُ يَظُنُّ أَنَّهُ جَائِزٌ فِي كَثْرَةِ مَا يُوضَعُ مِنْ الْأَقْنَاءِ فَنَزَلَ فِيمَنْ فَعَلَ ذَلِكَ{ وَلَا تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنْفِقُونَ }يَقُولُ لَا تَعْمِدُوا لِلْحَشَفِ مِنْهُ تُنْفِقُونَ{ وَلَسْتُمْ بِآخِذِيهِ إِلَّا أَنْ تُغْمِضُوا فِيهِ }يَقُولُ لَوْ أُهْدِيَ لَكُمْ مَا قَبِلْتُمُوهُ إِلَّا عَلَى اسْتِحْيَاءٍ مِنْ صَاحِبِهِ غَيْظًا أَنَّهُ بَعَثَ إِلَيْكُمْ مَا لَمْ يَكُنْ لَكُمْ فِيهِ حَاجَةٌ وَاعْلَمُوا أَنَّ اللَّهَ غَنِيٌّ عَنْ صَدَقَاتِكُمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Yahya bin Sa'id Al Qaththan] berkata; telah menceritakan kepada kami [Amru bin Muhammad Al 'Anqazi] berkata, telah menceritakan kepada kami [Asbath bin Nashr] dari [As Suddi] dari ['Adi bin Tsabit] dari [Al Barra bin 'Azib] tentang firman Allah Subhaanahu: \"(Dan sebagian dari apa yang kami keluarkan dari bumi untuk kamu. Dan janganlah kamu memilih yang buruk-buruk lalu kamu nafkahkan darinya) \", ia berkata, \"Ayat ini turun kepada sahabat Anshar. Orang-orang Anshar biasa memberikan jika tandan kurma dari kebunnya masih berupa kurma muda, mereka menggantungkannya pada sebuah tali antara dua tiang masjid Rasulullah shallallahu 'alaihi wasallam. Sehingga orang-orang miskin dari kalangan Muhajirin dapat memakannya. Salah seorang dari mereka sengaja memasukkan tandan yang berisi kurma jelek. Dia mengira hal demikian adalah diperbolehkan karena banyaknya kurma yang diletakkan di dalam tandan-tandan. Maka turunlah ayat kepada orang-orang yang melakukan seperti itu: \"(Dan janganlah kamu memilih yang buruk-buruk lalu kamu nafkahkan darinya, padahal kamu sendiri tidak mau mengambilnya) \". Al Barra mengatakan, \"Janganlah kalian sengaja menginfakan kurma yang paling buruk, sementara kamu sendiri tidak mau mengambilnya. 'Melainkan dengan memicingkan mata terhadapnya', Al Barra berkata, \"Sekiranya itu dikirimkan kepada kalian, maka kalian tidak ingin menerimanya kecuali karena malu dengan pemiliknya. Dan kalian kecewa karena ia mengirimkan sesuatu yang kalian tidak butuh. Ketahuilah, bahwa Allah Maha Kaya terhadap apa yang kalian sedekahkan.\""
            },
            {
                "number": 1778,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ وَسَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ أَبِي سَيَّارَةَ الْمُتَعِيُّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي نَحْلًا قَالَ أَدِّ الْعُشْرَ قُلْتُ يَا رَسُولَ اللَّهِ احْمِهَا لِي فَحَمَاهَا لِي",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] dan [Sa'id bin Abdul Aziz] dari [Sulaiman bin Musa] dari [Abu Sayyarah Al Mutta'i] ia berkata, \"Aku berkata, \"Wahai Rasulullah, aku memiliki pohon kurma, \" beliau bersabda: \"Berikanlah sepersepuluhnya.\" Aku berkata, \"Wahai Rasulullah, jagalah ia untukku. sehingga tidak seorangpun mengambilnya.\" Maka Rasulullah shallallahu 'alaihi wasallam menjaganya untukku."
            },
            {
                "number": 1779,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَخَذَ مِنْ الْعَسَلِ الْعُشْرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Nu'aim bin Hammad] berkata, telah menceritakan kepada kami [Ibnul Mubarak] berkata, telah menceritakan kepada kami [Usamah bin Zaid] dari [Amru bin Syu'aib] dari [Bapaknya] dari kakeknya [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau menetapkan sepersepuluh pada zakat madu.\""
            },
            {
                "number": 1780,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِزَكَاةِ الْفِطْرِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍقَالَ عَبْدُ اللَّهِ فَجَعَلَ النَّاسُ عِدْلَهُ مُدَّيْنِ مِنْ حِنْطَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan agar zakat fitrah dikeluarkan dengan satu sha' kurma, atau satu sha' biji gandum.\" Abdullah berkata; \"Lalu orang-orang mengeluarkannya dengan perbandingan dua mud tepung gandum.\""
            },
            {
                "number": 1781,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَةَ الْفِطْرِ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنْ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Amru] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah dengan satu sha' biji gandum atau satu sha' kurma, baik merdeka ataupun budak, laki-laki ataupun perempuan dari kaum muslimin.\""
            },
            {
                "number": 1782,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ بَشِيرِ بْنِ ذَكْوَانَ وَأَحْمَدُ بْنُ الْأَزْهَرِ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو يَزِيدَ الْخَوْلَانِيُّ عَنْ سَيَّارِ بْنِ عَبْدِ الرَّحْمَنِ الصَّدَفِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ طُهْرَةً لِلصَّائِمِ مِنْ اللَّغْوِ وَالرَّفَثِ وَطُعْمَةً لِلْمَسَاكِينِ فَمَنْ أَدَّاهَا قَبْلَ الصَّلَاةِ فَهِيَ زَكَاةٌ مَقْبُولَةٌ وَمَنْ أَدَّاهَا بَعْدَ الصَّلَاةِ فَهِيَ صَدَقَةٌ مِنْ الصَّدَقَاتِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ahmad bin Basyir bin Dzakwan] dan [Ahmad bin Al Azhar] keduanya berkata; telah menceritakan kepada kami [Marwan bin Muhammad] berkata, telah menceritakan kepada kami [Abu Yazid Al Khaulani] dari [Sayyar bin 'Abdurrahman Ash Shadafi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah, ia sebagai pensuci dari perbuatan sia-sia dan perkataan kotor orang yang berpuasa, dan sebagai pemberian makan kepada orang-orang miskin. Barangsiapa menunaikannya sebelum sholat 'ied maka zakatnya diterima, dan barangsiapa menunaikannya setelah sholat, maka ia hanyalah salah satu bentuk sedekah.\""
            },
            {
                "number": 1783,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ أَبِي عَمَّارٍ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَدَقَةِ الْفِطْرِ قَبْلَ أَنْ تُنْزَلَ الزَّكَاةُ فَلَمَّا نَزَلَتْ الزَّكَاةُ لَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا وَنَحْنُ نَفْعَلُهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Salamah bin Kuhail] dari [Al Qasim bin Mukhaimirah] dari [Abu Ammar] dari [Qais bin Sa'd] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menunaikan zakat fitrah sebelum turunnya ayat zakat, maka ketika ayat zakat telah turun beliau tidak memerintahkan ataupun melarang kami, sementara kami tetap melakukannya.\""
            },
            {
                "number": 1784,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ دَاوُدَ بْنِ قَيْسٍ الْفَرَّاءِ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعًا مِنْ طَعَامٍ صَاعًا مِنْ تَمْرٍ صَاعًا مِنْ شَعِيرٍ صَاعًا مِنْ أَقِطٍ صَاعًا مِنْ زَبِيبٍ فَلَمْ نَزَلْ كَذَلِكَ حَتَّى قَدِمَ عَلَيْنَا مُعَاوِيَةُ الْمَدِينَةَ فَكَانَ فِيمَا كَلَّمَ بِهِ النَّاسَ أَنْ قَالَ لَا أُرَى مُدَّيْنِ مِنْ سَمْرَاءِ الشَّامِ إِلَّا تَعْدِلُ صَاعًا مِنْ هَذَا فَأَخَذَ النَّاسُ بِذَلِكَقَالَ أَبُو سَعِيدٍ لَا أَزَالُ أُخْرِجُهُ كَمَا كُنْتُ أُخْرِجُهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَدًا مَا عِشْتُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata; telah menceritakan kepada kami [Waki'] dari [Dawud bin Qais Al Farra] dari [Iyadl bin Abdullah bin Abu Sarh] dari [Abu Sa'id Al Khudri] ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam masih bersama kami, kami mengeluarkan zakat fitrah sebanyak satu sha' makanan, satu sha' kurma, satu sha' biji gandum, satu sha' aqith (susu kering), dan satu sha' anggur kering. Kami tetap melakukan seperti itu hingga Mu'awiyah datang kepada kami di Madinah. Pidato yang ia sampaikan kepada manusia adalah, 'Aku tidak melihat kecuali, bahwa dua mud gandum Syam sebanding dengan satu sha' ini', akhirnya orang-orang pun mengambil pendapatnya.\" Abu Sa'id berkata; Aku tetap mengeluarkan zakat sesuai pada masa Rasulullah shallallahu 'alaihi wasallam, selama aku masih hidup."
            },
            {
                "number": 1785,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارٍ الْمُؤَذِّنِ حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ عَنْ عُمَرَ بْنِ سَعْدٍ مُؤَذِّنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِصَدَقَةِ الْفِطْرِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ سُلْتٍ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Sa'd bin Ammar Al Muadzdzin] berkata, telah menceritakan kepada kami [Umar bin Hafsh] dari [Umar bin Sa'd] -mu`adzin Rasulullah shallallahu 'alaihi wasallam- berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan mengeluarkan zakat fitrah dengan satu sha' kurma, atau satu sha' biji gandum, atau satu sha' salt (semacam gandum).\""
            },
            {
                "number": 1786,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ جُنَيْدٍ الدَّامَغَانِيُّ حَدَّثَنَا عَتَّابُ بْنُ زِيَادٍ الْمُرْوَزِيُّ حَدَّثَنَا أَبُو حَمْزَةَ قَالَ سَمِعْتُ مُغِيرَةَ الْأَزْدِيَّ يُحَدِّثُ عَنْ مُحَمَّدِ بْنِ زَيْدٍ عَنْ حَيَّانَ الْأَعْرَجِ عَنْ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْبَحْرَيْنِ أَوْ إِلَى هَجَرَ فَكُنْتُ آتِي الْحَائِطَ يَكُونُ بَيْنَ الْإِخْوَةِ يُسْلِمُ أَحَدُهُمْ فَآخُذُ مِنْ الْمُسْلِمِ الْعُشْرَ وَمِنْ الْمُشْرِكِ الْخَرَاجَ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Junaid Ad Damaghani] berkata, telah menceritakan kepada kami [Attab bin Ziyad Al Murwazi] berkata, telah menceritakan kepada kami [Abu Hamzah] ia berkata; aku mendengar [Mughirah Al Azdi] menceritakan dari [Muhammad bin Zaid] dari [Hayyan Al A'raj] dari [Al 'Ala Ibnul Hadlrami] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Bahrain, atau ke Hajar. Lalu aku mendatangi kebun milik beberapa orang yang bersaudara yang salah seorang dari mereka masuk Islam. Maka aku mengambil sepersepuluh dari orang yang telah masuk Islam dan mengambil pajak dari mereka yang masih musyrik.\""
            },
            {
                "number": 1787,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ عَنْ إِدْرِيسَ الْأَوْدِيِّ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ أَبِي سَعِيدٍرَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَسْقُ سِتُّونَ صَاعًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id Al Kindi] berkata, telah menceritakan kepada kami [Muhammad bin Ubaid Ath Thanafisi] dari [Idris Al Audi] dari [Amru bin Murrah] dari [Abu Al Bakhtari] dari [Abu Sa'id] ia memarfu'kannya (menyandarkan) kepada Nabi shallallahu 'alaihi wasallam, beliau mengatakan: \"Satu wasaq adalah enam puluh sha'.\""
            },
            {
                "number": 1788,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ وَأَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَسْقُ سِتُّونَ صَاعًا",
                "id": "Telah menceritakan kepada kami [Ali bin Al Mundzir] berkata, telah menceritakan kepada kami [Muhammad bin Fudlail] berkata, telah menceritakan kepada kami [Muhammad bin ubaidhullah] dari ['Atha bin Abu Rabah] dan [Abu Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu wasaq adalah enam puluh sha'.\""
            },
            {
                "number": 1789,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ الْمُصْطَلِقِ ابْنِ أَخِي زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُجْزِئُ عَنِّي مِنْ الصَّدَقَةِ النَّفَقَةُ عَلَى زَوْجِي وَأَيْتَامٍ فِي حِجْرِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهَا أَجْرَانِ أَجْرُ الصَّدَقَةِ وَأَجْرُ الْقَرَابَةِحَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ عَمْرِو بْنِ الْحَارِثِ ابْن أَخِي زَيْنَبَ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] dari [Amru Ibnul Harits Ibnul Mushthaliq] -anak saudara laki-laki Zainab, isteri Abdullah- dari [Zainab] -isteri Abdullah- ia berkata, \"Aku pernah bertanya Rasulullah shallallahu 'alaihi wasallam, \"Apakah zakatku sah jika aku berikan kepada suamiku dan anak yatim yang ada dalam pengasuhanku?\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Baginya dua pahala; pahala zakat dan pahala karena menyambung kekerabatan.\" Telah menceritakan kepada kami [Al Hasan bin Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Amru bin Al Harits] -anak saudara laki-laki Zainab- dari [Zainab] -isteri Abdullah- dari Nabi shallallahu 'alaihi wasallam sebagaimana Hadits di atas.\""
            },
            {
                "number": 1790,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّدَقَةِ فَقَالَتْ زَيْنَبُ امْرَأَةُ عَبْدِ اللَّهِ أَيُجْزِينِي مِنْ الصَّدَقَةِ أَنْ أَتَصَدَّقَ عَلَى زَوْجِي وَهُوَ فَقِيرٌ وَبَنِي أَخٍ لِي أَيْتَامٍ وَأَنَا أُنْفِقُ عَلَيْهِمْ هَكَذَا وَهَكَذَا وَعَلَى كُلِّ حَالٍ قَالَ نَعَمْ قَالَ وَكَانَتْ صَنَاعَ الْيَدَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Adam] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Zainab binti Ummu Salamah] dari [Ummu Salamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk membayar zakat, lalu Zainab isteri Abdullah bertanya; \"Apakah zakatku sah jika aku berikan kepada suamiku yang fakir dan anak saudaraku yang yatim, aku selalu bersedekah kepada mereka seperti ini dan seperti ini dalam setiap tahun?\" beliau menjawab: \"Ya.\" Ia berkata, \"Zainab adalah wanita yang banyak beramal.\""
            },
            {
                "number": 1791,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ الْأَوْدِيُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَأْخُذَ أَحَدُكُمْ أَحْبُلَهُ فَيَأْتِيَ الْجَبَلَ فَيَجِئَ بِحُزْمَةِ حَطَبٍ عَلَى ظَهْرِهِ فَيَبِيعَهَا فَيَسْتَغْنِيَ بِثَمَنِهَا خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ النَّاسَ أَعْطَوْهُ أَوْ مَنَعُوهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Amru bin Abdullah Al Audi] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Hisyam bin Urwah] dari [bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya salah seorang dari kalian mengambil tali dan membawanya ke gunung, lalu ia datang dengan membawa satu ikat kayu di atas punggungnya, kemudian menjualnya hingga dapat memenuhi kebutuhannya adalah lebih baik daripada meminta-minta manusia, baik mereka memberi ataupun tidak.\""
            },
            {
                "number": 1792,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ ثَوْبَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَتَقَبَّلُ لِي بِوَاحِدَةٍ وَأَتَقَبَّلُ لَهُ بِالْجَنَّةِ قُلْتُ أَنَا قَالَ لَا تَسْأَلْ النَّاسَ شَيْئًاقَالَ فَكَانَ ثَوْبَانُ يَقَعُ سَوْطُهُ وَهُوَ رَاكِبٌ فَلَا يَقُولُ لِأَحَدٍ نَاوِلْنِيهِ حَتَّى يَنْزِلَ فَيَأْخُذَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Ibnu Abu Dzi`b] dari [Muhammad bin Qais] dari ['Abdurrahman bin Yazid] dari [Tsauban] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bisa menjamin untukku satu hal, maka aku akan menjaminnya dengan surga! \" Aku menjawab, \"Saya.\" Beliau melanjutkan: \"Janganlah engkau meminta sesuatu kepada manusia! \" 'Abdurrahman berkata, \"Suatu ketika cambuk Tsauban jatuh saat ia mengendarai kendaraan, maka ia tidak berkata kepada seorangpun, 'Tolong ambilkan untukku', sehingga ia turun dan mengambilnya sendiri.\""
            },
            {
                "number": 1793,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ النَّاسَ أَمْوَالَهُمْ تَكَثُّرًا فَإِنَّمَا يَسْأَلُ جَمْرَ جَهَنَّمَ فَلْيَسْتَقِلَّ مِنْهُ أَوْ لِيُكْثِرْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Umarah Ibnul Qa'qa'] dari [Abu Zur'ah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminta harta manusia untuk bermegah-megah, sebenarnya ia meminta bara api neraka. Maka silahkan ia cukup dengan yang sedikit atau berbanyak-banyak! \""
            },
            {
                "number": 1794,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي حُصَيْنٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Abu Bakr bin 'Ayyasy] dari [Abu Hushain] dari [Salim bin Abu Al Ja'd] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sedekah tidak layak diberikan kepada orang kaya dan sehat dan mempunyai kemampuan.\""
            },
            {
                "number": 1795,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا سُفْيَانُ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ وَلَهُ مَا يُغْنِيهِ جَاءَتْ مَسْأَلَتُهُ يَوْمَ الْقِيَامَةِ خُدُوشًا أَوْ خُمُوشًا أَوْ كُدُوحًا فِي وَجْهِهِ قِيلَ يَا رَسُولَ اللَّهِ وَمَا يُغْنِيهِ قَالَ خَمْسُونَ دِرْهَمًا أَوْ قِيمَتُهَا مِنْ الذَّهَبِفَقَالَ رَجُلٌ لِسُفْيَانَ إِنَّ شُعْبَةَ لَا يُحَدِّثُ عَنْ حَكِيمِ بْنِ جُبَيْرٍ فَقَالَ سُفْيَانُ قَدْ حَدَّثَنَاهُ زُبَيْدٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Yahya bin Adam] berkata, telah menceritakan kepada kami [Sufyan] dari [Hakim bin Jubair] dari [Muhammad bin 'Abdurrahman bin Yazid] dari [Bapaknya] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminta-minta padahal ia dalam keadaan kecukupan, maka pada hari kiamat apa yang ia minta akan berubah menjadi bekas-bekas cakaran di wajahnya.\" Dikatakan, \"Wahai Rasulullah, kecukupan apa yang telah ia punyai?\" beliau menjawab: \"Lima puluh dirham, atau emas yang senilai dengannya.\" Lalu seorang laki-laki berkata kepada Sufyan, \"Sesungguhnya Syu'bah tidak meriwayatkan dari Hakim bin Jubair! \" [Sufyan] berkata; \"Namun [Zubaid] telah meriwayatkannya kepada kami, dari [Muhammad bin 'Abdurrahman bin Yazid].\""
            },
            {
                "number": 1796,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ إِلَّا لِخَمْسَةٍ لِعَامِلٍ عَلَيْهَا أَوْ لِغَازٍ فِي سَبِيلِ اللَّهِ أَوْ لِغَنِيٍّ اشْتَرَاهَا بِمَالِهِ أَوْ فَقِيرٍ تُصُدِّقَ عَلَيْهِ فَأَهْدَاهَا لِغَنِيٍّ أَوْ غَارِمٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Zaid bin Aslam] dari ['Atha bin Yasar] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sedekah tidak halal untuk dimiliki oleh orang yang berkecukupan kecuali untuk lima orang; amilnya, orang yang berjihad di jalan Allah, orang kaya tapi ia dapat dengan jalur lain (membeli\/hadiah, seperti mahar dll), orang miskin yang mendapatkan sedekah kemudian diberikan kepada orang kaya, dan orang yang terlilit hutang.\""
            },
            {
                "number": 1797,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ سَعِيدِ بْنِ يَسَارٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَصَدَّقَ أَحَدٌ بِصَدَقَةٍ مِنْ طَيِّبٍ وَلَا يَقْبَلُ اللَّهُ إِلَّا الطَّيِّبَ إِلَّا أَخَذَهَا الرَّحْمَنُ بِيَمِينِهِ وَإِنْ كَانَتْ تَمْرَةً فَتَرْبُو فِي كَفِّ الرَّحْمَنِ تَبَارَكَ وَتَعَالَى حَتَّى تَكُونَ أَعْظَمَ مِنْ الْجَبَلِ وَيُرَبِّيهَا لَهُ كَمَا يُرَبِّي أَحَدُكُمْ فُلُوَّهُ أَوْ فَصِيلَهُ",
                "id": "Telah menceritakan kepada kami [Isa bin Hammad Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Sa'id bin Yasar] bahwa ia mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang bersedekah dengan sesuatu yang baik -dan Allah tidak menerima kecuali yang baik- melainkan Allah akan mengambilnya dengan tangan kanan-Nya. Bila itu sebutir kurma, maka ia akan diperlihara dalam genggaman Ar Rahman Tabaaraka wa Ta'ala hingga menjadi lebih besar dari sebuah gunung. Allah akan memeliharanya untuk kalian sebagaimana kalian memelihara anak unta.\""
            },
            {
                "number": 1798,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ خَيْثَمَةَ عَنْ عَدِيِّ ابْنِ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا سَيُكَلِّمُهُ رَبُّهُ لَيْسَ بَيْنَهُ وَبَيْنَهُ تُرْجُمَانٌ فَيَنْظُرُ أَمَامَهُ فَتَسْتَقْبِلُهُ النَّارُ وَيَنْظُرُ عَنْ أَيْمَنَ مِنْهُ فَلَا يَرَى إِلَّا شَيْئًا قَدَّمَهُ وَيَنْظُرُ عَنْ أَشْأَمَ مِنْهُ فَلَا يَرَى إِلَّا شَيْئًا قَدَّمَهُ فَمَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَتَّقِيَ النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَلْيَفْعَلْ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Al A'masy] dari [Khaitsamah] dari [Adi bin Hatim] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak seorangpun dari kalian kecuali akan diajak bicara oleh Rabbnya, tidak ada penerjemah antara keduanya. Ia melihat ke arah depan tetapi neraka yang nampak, ia melihat ke sisi kanannya tapi tidak melihat sesuatu selain amal yang telah ia lakukan, dan ia melihat ke sisi kirinya tapi tidak melihat sesuatu selain amal yang pernah ia lakukan. Maka barangsiapa salah seorang dari kalian mampu menyelamatkan dirinya dari neraka meskipun dengan setengah butir kurma hendaklah ia lakukan.\""
            },
            {
                "number": 1799,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ عَوْنٍ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ أُمِّ الرَّائِحِ بِنْتِ صُلَيْعٍ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّدَقَةُ عَلَى الْمِسْكِينِ صَدَقَةٌ وَعَلَى ذِي الْقَرَابَةِ اثْنَتَانِ صَدَقَةٌ وَصِلَةٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Ibnu Aun] dari [Hafshah binti Sirin] dari [Ar Rabab Ummu Ar Ra`ih binti Shulai'] dari [Salman bin Amir Adl Dlabbi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersedekah untuk orang miskin nilainya satu sedekah, sedangkan bersedekah untuk kerabat nilainya dua; sedekah dan menyambung hubungan kekerabatan.\""
            },
            {
                "number": 1800,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ بْنِ قَيْسٍ قَالَكُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ بِمِنًى فَخَلَا بِهِ عُثْمَانُ فَجَلَسْتُ قَرِيبًا مِنْهُ فَقَالَ لَهُ عُثْمَانُ هَلْ لَكَ أَنْ أُزَوِّجَكَ جَارِيَةً بِكْرًا تُذَكِّرُكَ مِنْ نَفْسِكَ بَعْضَ مَا قَدْ مَضَى فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنَّهُ لَيْسَ لَهُ حَاجَةٌ سِوَى هَذِهِ أَشَارَ إِلَيَّ بِيَدِهِ فَجِئْتُ وَهُوَ يَقُولُ لَئِنْ قُلْتَ ذَلِكَ لَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مَعْشَرَ الشَّبَابِ مَنْ اسْتَطَاعَ مِنْكُمْ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Amir bin Zurarah] berkata, telah menceritakan kepada kami [Ali bin Mushir] dari [Al A'masy] dari [Ibrahim] dari [Al Qamah bin Qais] ia berkata, \"Aku Pernah bersama [Abdullah bin Mas'ud] di Mina, lalu ia menyepi bersama Utsman bin Affan, maka aku ikut duduk dekat dengannya. Utsman berkata kepada Abdullah bin Mas'ud, \"Sediakah jika aku nikahkan engkau dengan seorang budak yang masih gadis, ia akan mengingatkanmu terhadap apa yang telah engkau lupakan?\" ketika Abdullah bin Mas'ud melihat bahwa dirinya tidak ada alasan kecuali menerimanya, maka ia berisyarat kepadaku dengan tangannya, hingga akupun mendekat. Ia mengatakan, \"Jika itu yang engkau katakan, sungguh Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Wahai para pemuda, siapa di antara kalian yang telah memiliki ba`ah (kemampuan) hendaklah menikah, sebab itu lebih dapat menjaga pandangan dan kemaluan. Barangsiapa belum mampu hendaklah berpuasa, sebab ia bisa menjadi tameng baginya.\""
            },
            {
                "number": 1801,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ حَدَّثَنَا آدَمُ حَدَّثَنَا عِيسَى بْنُ مَيْمُونٍ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النِّكَاحُ مِنْ سُنَّتِي فَمَنْ لَمْ يَعْمَلْ بِسُنَّتِي فَلَيْسَ مِنِّي وَتَزَوَّجُوا فَإِنِّي مُكَاثِرٌ بِكُمْ الْأُمَمَ وَمَنْ كَانَ ذَا طَوْلٍ فَلْيَنْكِحْ وَمَنْ لَمْ يَجِدْ فَعَلَيْهِ بِالصِّيَامِ فَإِنَّ الصَّوْمَ لَهُ وِجَاءٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Al Azhar] berkata, telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Isa bin Maimun] dari [Al Qasim] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menikah adalah sunnahku, barangsiapa tidak mengamalkan sunnahku berarti bukan dari golonganku. Hendaklah kalian menikah, sungguh dengan jumlah kalian aku akan berbanyak-banyakkan umat. Siapa memiliki kemampuan harta hendaklah menikah, dan siapa yang tidak hendaknya berpuasa, karena puasa itu merupakan tameng.\""
            },
            {
                "number": 1802,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَيْسَرَةَ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ نَرَ لِلْمُتَحَابَّيْنِ مِثْلَ النِّكَاحِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Sa'id bin Sulaiman] berkata, telah menceritakan kepada kami [Muhammad bin Muslim] berkata, telah menceritakan kepada kami [Ibrahim bin Maisarah] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kami belum pernah melihat dua orang yang memadu cinta sebagaimana orang yang menikah.\""
            },
            {
                "number": 1803,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدٍ قَالَلَقَدْ رَدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ وَلَوْ أَذِنَ لَهُ لَاخْتَصَيْنَا",
                "id": "Telah menceritakan kepada kami [Abu Marwan Muhammad bin Utsman Al Utsmani] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Sa'd] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah mematahkan pendapat Utsman bin Mazh'un untuk At Tabattul (menjauhi wanita sebagaimana pendeta), sekiranya boleh maka kami akan melakukannya.\""
            },
            {
                "number": 1804,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ وَزَيْدُ بْنُ أَخْزَمَ قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّبَتُّلِ زَادَ زَيْدُ بْنُ أَخْزَمَ وَقَرَأَ قَتَادَةُ{ وَلَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً }",
                "id": "Telah menceritakan kepada kami [Bisyr bin Adam] dan [Zaid bin Akhzam] keduanya berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepada kami [Bapakku] dari [Qatadah] dari [Al Hasan] dari [Samurah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang At Tabattul (hidup membujang).\" Zaid bin Akhzam menambahkan, \"Qatadah membaca ayat: \" Dan telah Kami utus rasul-rasul sebelum kamu, dan Kami jadikan bagi mereka isteri-isteri dan keturunan.\" QS. Ar Ra'ad: 38."
            },
            {
                "number": 1805,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ شُعْبَةَ عَنْ أَبِي قَزْعَةَ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِأَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا حَقُّ الْمَرْأَةِ عَلَى الزَّوْجِ قَالَ أَنْ يُطْعِمَهَا إِذَا طَعِمَ وَأَنْ يَكْسُوَهَا إِذَا اكْتَسَى وَلَا يَضْرِبْ الْوَجْهَ وَلَا يُقَبِّحْ وَلَا يَهْجُرْ إِلَّا فِي الْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] dari [Syu'bah] dari [Abu Qaz'ah] dari [Hakim bin Mu'awiyah] dari [Bapaknya] berkata, \"Seorang laki-laki bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Apa hak seorang wanita atas suaminya?\" beliau menjawab: \"Memberi makan kepadanya apabila dia makan, memberi pakaian apabila ia berpakaian, tidak memukul wajah, tidak menjelek-jelekkannya dan tidak boleh mendiamkannya kecuali di dalam rumah.\""
            },
            {
                "number": 1806,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ شَبِيبِ بْنِ غَرْقَدَةَ الْبَارِقِيِّ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ حَدَّثَنِي أَبِيأَنَّهُ شَهِدَ حَجَّةَ الْوَدَاعِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَذَكَّرَ وَوَعَظَ ثُمَّ قَالَ اسْتَوْصُوا بِالنِّسَاءِ خَيْرًا فَإِنَّهُنَّ عِنْدَكُمْ عَوَانٍ لَيْسَ تَمْلِكُونَ مِنْهُنَّ شَيْئًا غَيْرَ ذَلِكَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ فَإِنْ فَعَلْنَ فَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا إِنَّ لَكُمْ مِنْ نِسَائِكُمْ حَقًّا وَلِنِسَائِكُمْ عَلَيْكُمْ حَقًّا فَأَمَّا حَقُّكُمْ عَلَى نِسَائِكُمْ فَلَا يُوَطِّئَنَّ فُرُشَكُمْ مَنْ تَكْرَهُونَ وَلَا يَأْذَنَّ فِي بُيُوتِكُمْ لِمَنْ تَكْرَهُونَ أَلَا وَحَقُّهُنَّ عَلَيْكُمْ أَنْ تُحْسِنُوا إِلَيْهِنَّ فِي كِسْوَتِهِنَّ وَطَعَامِهِنَّ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Al Husain bin Ali] dari [Za`idah] dari [Syabib bin Gharqadah Al Bariqi] dari [Sulaiman bin Amru bin Al Ahwash] berkata, telah menceritakan kepadaku [Bapakku] bahwasanya ia pernah menghadiri haji wada' bersama Rasulullah shallallahu 'alaihi wasallam. Beliau memuji Allah dan mengagungkan-Nya, mengingatkan dan memberi wejangan. Setelah itu beliau bersabda: \"Perlakukanlah isteri-isteri kalian dengan baik, karena mereka adalah teman di sisi kalian. Kalian tidak memiliki suatu apapun dari mereka selain itu. Kecuali jika mereka berbuat zina dengan terang-terangan. Jika mereka melakukannya maka tinggalkan mereka di tempat tidur dan pukullah dengan pukulan yang tidak melukai. Apabila mereka mentaati kalian maka janganlah berbuat sewenang-wenang terhadap mereka. Sungguh, kalian mempunyai hak dari isteri-isteri kalian dan isteri-isteri kalian mempunyai dari kalian. Adapun hak kalian terhadap isteri kalian; jangan menginjakkan di tempat tidur kalian orang yang kalian benci dan jangan diizinkan masuk rumah-rumah kalian terhadap orang yang kalian benci. Dan sungguh hak mereka atas kalian; hendaknya memperlakukan mereka dengan baik dalam masalah pakaian dan makanan.\""
            },
            {
                "number": 1807,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَمَرْتُ أَحَدًا أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ الْمَرْأَةَ أَنْ تَسْجُدَ لِزَوْجِهَا وَلَوْ أَنَّ رَجُلًا أَمَرَ امْرَأَتَهُ أَنْ تَنْقُلَ مِنْ جَبَلٍ أَحْمَرَ إِلَى جَبَلٍ أَسْوَدَ وَمِنْ جَبَلٍ أَسْوَدَ إِلَى جَبَلٍ أَحْمَرَ لَكَانَ نَوْلُهَا أَنْ تَفْعَلَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] berkata, telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Ali bin Zaid bin Jud'an] dari [Sa'id Ibnul Musayyab] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya aku boleh memerintahkan seseorang sujud kepada orang lain, maka akan aku perintahkan seorang isteri sujud kepada suaminya. Sekiranya seorang suami memerintahkan isterinya untuk pindah dari gunung ahmar menuju gunjung aswad, atau dari gunung aswad menuju gunung ahmar, maka ia wajib untuk melakukannya.\""
            },
            {
                "number": 1808,
                "arab": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ الْقَاسِمِ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَلَمَّا قَدِمَ مُعَاذٌ مِنْ الشَّامِ سَجَدَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا هَذَا يَا مُعَاذُ قَالَ أَتَيْتُ الشَّامَ فَوَافَقْتُهُمْ يَسْجُدُونَ لِأَسَاقِفَتِهِمْ وَبَطَارِقَتِهِمْ فَوَدِدْتُ فِي نَفْسِي أَنْ نَفْعَلَ ذَلِكَ بِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا تَفْعَلُوا فَإِنِّي لَوْ كُنْتُ آمِرًا أَحَدًا أَنْ يَسْجُدَ لِغَيْرِ اللَّهِ لَأَمَرْتُ الْمَرْأَةَ أَنْ تَسْجُدَ لِزَوْجِهَا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا تُؤَدِّي الْمَرْأَةُ حَقَّ رَبِّهَا حَتَّى تُؤَدِّيَ حَقَّ زَوْجِهَا وَلَوْ سَأَلَهَا نَفْسَهَا وَهِيَ عَلَى قَتَبٍ لَمْ تَمْنَعْهُ",
                "id": "Telah menceritakan kepada kami [Azhar bin Marwan] ia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Al Qasim Asy Syaibani] dari [Abdullah bin Abu Aufa] ia berkata, \"Tatkala Mu'adz datang dari Syam, ia bersujud kepada Nabi shallallahu 'alaihi wasallam hingga beliau bersabda: \"Apa-apaan ini ya Mu'adz! Mu'adz menjawab, \"Aku pernah mendatangi Syam, aku mendapatkan mereka sujud kepada para uskup dan komandan mereka. Maka, aku ingin melakukannya terhadapmu.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melakukannya, kalau saja aku diperbolehkan memerintahkan seseorang untuk bersujud kepada selain Allah, niscaya aku akan perintahkan seorang isteri bersujud kepada suaminya. Demi Dzat yang jiwa Muhammad di Tangan-Nya, sungguh seorang isteri itu tidak dikatakan menunaikan hak Rabb-nya hingga ia menunaikan hak suaminya. Kalau saja suami memintanya untuk dilayani, sementara ia sedang berada di atas pelana kendaraan, maka ia tidak boleh menolaknya.\""
            },
            {
                "number": 1809,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِي نَصْرٍ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُسَاوِرٍ الْحِمْيَرِيِّ عَنْ أُمِّهِ قَالَتْ سَمِعْتُ أُمَّ سَلَمَةَ تَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَيُّمَا امْرَأَةٍ مَاتَتْ وَزَوْجُهَا عَنْهَا رَاضٍ دَخَلَتْ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Abu Nashr Abdullah bin 'Abdurrahman] dari [Musawir Al Himyari] dari [Ibunya] ia berkata; aku mendengar [Ummu Salamah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam: \"Wanita mana saja yang meninggal sementara suaminya ridla kepadanya, maka ia akan masuk surga.\""
            },
            {
                "number": 1810,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا الدُّنْيَا مَتَاعٌ وَلَيْسَ مِنْ مَتَاعِ الدُّنْيَا شَيْءٌ أَفْضَلَ مِنْ الْمَرْأَةِ الصَّالِحَةِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami ['Abdurrahman bin Ziyad bin An'am] dari [Abdullah bin Yazid] dari [Abdullah bin Amru] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dunia itu adalah hiasan, dan tidak ada hiasan dunia yang lebih indah selain wanita yang shalihah.\""
            },
            {
                "number": 1811,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ سَمُرَةَ حَدَّثَنَا وَكِيعٌ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِيهِ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ ثَوْبَانَ قَالَلَمَّا نَزَلَ فِي الْفِضَّةِ وَالذَّهَبِ مَا نَزَلَ قَالُوا فَأَيَّ الْمَالِ نَتَّخِذُ قَالَ عُمَرُ فَأَنَا أَعْلَمُ لَكُمْ ذَلِكَ فَأَوْضَعَ عَلَى بَعِيرِهِ فَأَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا فِي أَثَرِهِ فَقَالَ يَا رَسُولَ اللَّهِ أَيَّ الْمَالِ نَتَّخِذُ فَقَالَ لِيَتَّخِذْ أَحَدُكُمْ قَلْبًا شَاكِرًا وَلِسَانًا ذَاكِرًا وَزَوْجَةً مُؤْمِنَةً تُعِينُ أَحَدَكُمْ عَلَى أَمْرِ الْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il bin Samurah] berkata, telah menceritakan kepada kami [Waki'] dari [Abdullah bin Amru bin Murrah] dari [Bapaknya] dari [Salim bin Abul Ja'd] dari [Tsauban] ia berkata, \"Tatkala turun ayat yang berkaitan dengan masalah perak dan emas, para sahabat bertanya, \"Lantas harta apa yang kita ambil?\" Umar berkata, \"Aku akan memberitahukan kepada kalian masalah itu.\" Umar lantas naik ke atas untanya dan menemui Nabi shallallahu 'alaihi wasallam, sementara aku mengikuti di belakangnya. Umar bertanya; \"Ya Rasulullah, harta apa yang boleh kita ambil?\" Beliau menjawab: \"Hendaknya salah seorang dari kalian menjadikan hati yang bersyukur, lisan yang berdzikir dan isteri mukminah yang menolong salah seorang dari kalian dalam urusan akhiratnya.\""
            },
            {
                "number": 1812,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي الْعَاتِكَةِ عَنْ عَلِيِّ بْنِ يَزِيدَ عَنْ الْقَاسِمِ عَنْ أَبِي أُمَامَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ مَا اسْتَفَادَ الْمُؤْمِنُ بَعْدَ تَقْوَى اللَّهِ خَيْرًا لَهُ مِنْ زَوْجَةٍ صَالِحَةٍ إِنْ أَمَرَهَا أَطَاعَتْهُ وَإِنْ نَظَرَ إِلَيْهَا سَرَّتْهُ وَإِنْ أَقْسَمَ عَلَيْهَا أَبَرَّتْهُ وَإِنْ غَابَ عَنْهَا نَصَحَتْهُ فِي نَفْسِهَا وَمَالِهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Shadaqah bin Khalid] berkata, telah menceritakan kepada kami [Utsman bin Abu Al 'Atikah] dari [Ali bin Yazid] dari [Al Qasim] dari [Abu Umamah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada sesuatu yang bermanfaat bagi seorang mukmin setelah taqwa kepada Allah selain isteri yang shalihah. Jika suami memerintahnya ia akan taat, jika dipandang menyenangkan, jika dia membagi (giliran) untuknya ia menerima, dan jika suami tidak ada ia menjaga kehormatan diri dan hartanya.\""
            },
            {
                "number": 1813,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُنْكَحُ النِّسَاءُ لِأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [ubaidhullah bin Umar] dari [Sa'id bin Abu Sa'id] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita dinikahi karena empat hal; hartanya, nasabnya, kecantikannya dan agamanya. Peganglah perkara agamanya maka engkau akan beruntung.\""
            },
            {
                "number": 1814,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبيُّ وَجَعْفَرُ بْنُ عَوْنٍ عَنْ الْإِفْرِيقِيِّ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَزَوَّجُوا النِّسَاءَ لِحُسْنِهِنَّ فَعَسَى حُسْنُهُنَّ أَنْ يُرْدِيَهُنَّ وَلَا تَزَوَّجُوهُنَّ لِأَمْوَالِهِنَّ فَعَسَى أَمْوَالُهُنَّ أَنْ تُطْغِيَهُنَّ وَلَكِنْ تَزَوَّجُوهُنَّ عَلَى الدِّينِ وَلَأَمَةٌ خَرْمَاءُ سَوْدَاءُ ذَاتُ دِينٍ أَفْضَلُ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami ['Abdurrahman Al Muharibi] dan [Ja'far bin Aun] dari [Al Ifriqi] dari [Abdullah bin Yazid] dari [Abdullah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menikahi wanita karena kecantikannya, bisa jadi kecantikannya itu merusak mereka. Janganlah menikahi mereka karena harta-harta mereka, bisa jadi harta-harta mereka itu membuat mereka sesat. Akan tetapi nikahilah mereka berdasarkan agamanya. Seorang budak wanita berkulit hitam yang telinganya sobek tetapi memiliki agama adalah lebih utama.\""
            },
            {
                "number": 1815,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ عَبْدِ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَتَزَوَّجْتُ امْرَأَةً عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَقِيتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَتَزَوَّجْتَ يَا جَابِرُ قُلْتُ نَعَمْ قَالَ أَبِكْرًا أَوْ ثَيِّبًا قُلْتُ ثَيِّبًا قَالَ فَهَلَّا بِكْرًا تُلَاعِبُهَا قُلْتُ كُنَّ لِي أَخَوَاتٌ فَخَشِيتُ أَنْ تَدْخُلَ بَيْنِي وَبَيْنَهُنَّ قَالَ فَذَاكَ إِذَنْ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Abdul Malik] dari ['Atha] dari [Jabir bin Abdullah] ia berkata, \"Aku menikahi seorang wanita pada masa Rasulullah shallallahu 'alaihi wasallam, lalu aku berjumpa Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Wahai Jabir, apakah engkau telah menikah?\" aku menjawab, \"Sudah, \" beliau bertanya lagi: \"Gadis atau janda?\" aku menjawab, \"Janda.\" Beliau bersabda: \"Kenapa tidak gadis saja, hingga engkau bisa bermain-main dengannya?\" aku menjawab, \"Aku mempunyai banyak adik perempuan, aku kawatir ia menjadi penghalang antara aku dengan mereka.\" Beliau bersabda: \"Silahkan kalau begitu.\""
            },
            {
                "number": 1816,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ التَّيْمِيُّ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَالِمِ بْنِ عُتْبَةَ بْنِ عُوَيْمِ بْنِ سَاعِدَةَ الْأَنْصَارِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكُمْ بِالْأَبْكَارِ فَإِنَّهُنَّ أَعْذَبُ أَفْوَاهًا وَأَنْتَقُ أَرْحَامًا وَأَرْضَى بِالْيَسِيرِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir Al Hizami] berkata, telah menceritakan kepada kami [Muhamamad bin Thalhah At Taimi] berkata, telah menceritakan kepadaku ['Abdurrahman bin Salim bin Utbah bin Uwaim bin Sa'idah Al Anshari] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah kalian memilih yang masih perawan. Sungguh, mulut mereka lebih segar, rahimnya lebih luas (banyak anak), dan lebih menerima dengan yang sedikit.\""
            },
            {
                "number": 1817,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سَلَّامُ بْنُ سَوَّارٍ حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ عَنْ الضَّحَّاكِ بْنِ مُزَاحِمٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَرَادَ أَنْ يَلْقَى اللَّهَ طَاهِرًا مُطَهَّرًا فَلْيَتَزَوَّجْ الْحَرَائِرَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sallam bin Sawwar] berkata, telah menceritakan kepada kami [Katsir bin Sulaim] dari [Adl Dlahhak bin Muzahim] ia berkata; aku mendengar [Anas bin Malik] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ingin berjumpa dengan Allah dalam keadaan suci lagi disucikan maka nikahlah dengan wanita-wanita merdeka.\""
            },
            {
                "number": 1818,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ الْمَخْزُومِيُّ عَنْ طَلْحَةَ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْكِحُوا فَإِنِّي مُكَاثِرٌ بِكُمْ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Abdullah bin Al Harits Al Makhzumi] dari [Thalhah] dari ['Atha] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah kalian menikah! Karena aku akan berbanyak-banyakan umat dengan (adanya) kalian.\""
            },
            {
                "number": 1819,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ حَجَّاجٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ عَمِّهِ سَهْلِ بْنِ أَبِي حَثْمَةَ عَنْ مُحَمَّدِ بْنِ مَسْلَمَةَ قَالَخَطَبْتُ امْرَأَةً فَجَعَلْتُ أَتَخَبَّأُ لَهَا حَتَّى نَظَرْتُ إِلَيْهَا فِي نَخْلٍ لَهَا فَقِيلَ لَهُ أَتَفْعَلُ هَذَا وَأَنْتَ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَلْقَى اللَّهُ فِي قَلْبِ امْرِئٍ خِطْبَةَ امْرَأَةٍ فَلَا بَأْسَ أَنْ يَنْظُرَ إِلَيْهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Hajjaj] dari [Muhammad bin Sulaiman] dari pamannya [Sahl bin Abu Hatsmah] dari [Muhammad bin Maslamah] ia berkata, \"Aku telah meminang seorang wanita, lalu aku bersembunyi di kebun kurma miliknya hingga aku dapat melihatnya.\" Maka dikatakan kepadanya, \"Kenapa kamu lakukan ini, padahal engkau adalah sahabat Rasulullah shallallahu 'alaihi wasallam! \" Ia pun menjawab, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Allah telah memantapkan pada hati seseorang untuk meminang, maka tidak apa-apa ia melihatnya.\""
            },
            {
                "number": 1820,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ وَزُهَيْرُ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ ثابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَرَادَ أَنْ يَتَزَوَّجَ امْرَأَةً فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ فَانْظُرْ إِلَيْهَا فَإِنَّهُ أَحْرَى أَنْ يُؤْدَمَ بَيْنَكُمَا فَفَعَلَ فَتَزَوَّجَهَا فَذَكَرَ مِنْ مُوَافَقَتِهَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] dan [Zuhair bin Muhammad] dan [Muhammad bin Abdul Malik] mereka berkata; telah menceritakan kepada kami ['Abdurrazaq] dari [Ma'mar] dari [Tsabit] dari [Anas bin Malik] bahwa Mughirah bin Syu'bah ingin menikahi seorang wanita, lalu Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Pergi dan lihatlah ia, karena hal itu bisa membuat kekal rumah tangga kalian berdua.\" Ia pun melakukannya dan menikahinya, serta menyebutkan persetujuannya.\""
            },
            {
                "number": 1821,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ أَبِي الرَّبِيعِ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ لَهُ امْرَأَةً أَخْطُبُهَا فَقَالَ اذْهَبْ فَانْظُرْ إِلَيْهَا فَإِنَّهُ أَجْدَرُ أَنْ يُؤْدَمَ بَيْنَكُمَا فَأَتَيْتُ امْرَأَةً مِنْ الْأَنْصَارِ فَخَطَبْتُهَا إِلَى أَبَوَيْهَا وَأَخْبَرْتُهُمَا بِقَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَأَنَّهُمَا كَرِهَا ذَلِكَ قَالَ فَسَمِعَتْ ذَلِكَ الْمَرْأَةُ وَهِيَ فِي خِدْرِهَا فَقَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَكَ أَنْ تَنْظُرَ فَانْظُرْ وَإِلَّا فَأَنْشُدُكَ كَأَنَّهَا أَعْظَمَتْ ذَلِكَ قَالَ فَنَظَرْتُ إِلَيْهَا فَتَزَوَّجْتُهَا فَذَكَرَ مِنْ مُوَافَقَتِهَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Abu Ar Rabi'] berkata, telah memberitakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Tsabit Al Bunani] dari [Bakr bin Abdullah Al Muzani] dari [Al Mughirah bin Syu'bah] ia berkata, \"Aku menemui Nabi shallallahu 'alaihi wasallam, lalu aku sebutkan perihal wanita yang akan aku pinang. Beliau bersabda: \"Pergi dan lihatlah ia, sebab itu akan membuat rumah tanggamu kekal.\" Setelah itu aku mendatangi dan meminangnya melalui kedua orang tuanya, dan aku sampaikan kepada keduanya tentang sabda Nabi shallallahu 'alaihi wasallam. Namun sepertinya mereka berdua kurang menyukainya.\" Al Mughirah berkata, \"Percakapan itu didengar oleh anak wanitanya yang ada di balik satir, hingga ia berkata, \"Jika memang Rasulullah shallallahu 'alaihi wasallam memerintahkanmu untuk melihat, maka lihatlah. Namun jika tidak, maka aku akan menyumpahimu! \" seakan wanita itu benar-benar mengaggap besar perkara tersebut. Al Mughirah berkata, \"Maka aku pun melihat dan menikahinya.\" Al Mughirah lalu menyebutkan persetujuannya.\""
            },
            {
                "number": 1822,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَسَهْلُ بْنُ أَبِي سَهْلٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْطُبْ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Sahl bin Abu Sahl] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Sa'id Ibnul Mughirah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang laki-laki meminang pinangan saudaranya.\""
            },
            {
                "number": 1823,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْطُبْ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang laki-laki meminang pinangan saudaranya.\""
            },
            {
                "number": 1824,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ بْنِ صُخَيْرٍ الْعَدَوِيِّ قَالَ سَمِعْتُ فَاطِمَةَ بِنْتَ قَيْسٍ تَقُولُقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَلْتِ فَآذِنِينِي فَآذَنَتْهُ فَخَطَبَهَا مُعَاوِيَةُ وَأَبُو الْجَهْمِ بْنُ صُخَيْرٍ وَأُسَامَةُ بْنُ زَيْدٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا مُعَاوِيَةُ فَرَجُلٌ تَرِبٌ لَا مَالَ لَهُ وَأَمَّا أَبُو الْجَهْمِ فَرَجُلٌ ضَرَّابٌ لِلنِّسَاءِ وَلَكِنْ أُسَامَةُ فَقَالَتْ بِيَدِهَا هَكَذَا أُسَامَةُ أُسَامَةُ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَاعَةُ اللَّهِ وَطَاعَةُ رَسُولِهِ خَيْرٌ لَكِ قَالَتْ فَتَزَوَّجْتُهُ فَاغْتَبَطْتُ بِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Abu Bakr bin Abu Al Jahm bin Shukhair Al 'Adawi] ia berkata; Aku mendengar [Fatimah binti Qais] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Jika engkau telah halal maka berilah aku kabar, \" lalu Fatimah bin Qais pun mengabarkan kepada beliau. Setelah itu, Mu'awiyah, Abul Jahm bin Shukhair dan Usamah bin Zaid meminangnya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mu'awiyah itu seorang laki-laki yang miskin dan tidak berharta, Abul Jahm bin Shukhair seorang laki-laki yang mudah memukul wanita, sedangkan Usamah, -Fatimah bin Qais- berkata dengan tangannya seperti ini, \"Usamah lagi, Usamah lagi.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepada Fatimah bin Qais: \"Orang yang taat kepada Allah dan Rasul-Nya itu lebih baik bagimu.\" Fatimah berkata, \"Maka aku pun menikah dengan Usamah, dan aku merasa senang dengannya.\""
            },
            {
                "number": 1825,
                "arab": "حَدَّثَنِي إِسْمَعِيلُ بْنُ مُوسَى السُّدِّيُّ حَدَّثَنَا مَالِكُ بْنُ أَنسٍ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ الْهَاشِمِيِّ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَيِّمُ أَوْلَى بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْمَرُ فِي نَفْسِهَا قِيلَ يَا رَسُولَ اللَّهِ إِنَّ الْبِكْرَ تَسْتَحْيِي أَنْ تَتَكَلَّمَ قَالَ إِذْنُهَا سُكُوتُهَا",
                "id": "Telah menceritakan kepadaku [Isma'il bin Musa As Suddi] telah menceritakan kepada kami [Malik bin Anas] dari [Abdullah Ibnul Fadl Al Hasyimi] dari [Nafi' bin Jubair bin Muth'im] dari [Ibnu Abbas] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janda lebih berhak atas dirinya daripada walinya, sementara gadis hendaknya dimintai pendapatnya.\" Dikatakan, \"Wahai Rasulullah, seorang gadis itu malu untuk berbicara! \" beliau bersabda: \"Diamnya itu adalah wujud persetujuannya.\""
            },
            {
                "number": 1826,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُنْكَحُ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ وَلَا الْبِكْرُ حَتَّى تُسْتَأْذَنَ وَإِذْنُهَا الصُّمُوتُ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim bin Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Al Auza'i], Telah menceritakan kepadaku [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang janda tidak boleh dinikahkah hingga dimintai pendapatnya, juga seorang gadis tidak boleh dinikahkan hingga dimintai izinnya. Dan izinnya adalah diam.\""
            },
            {
                "number": 1827,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ عَنْ عَدِيِّ بْنِ عَدِيٍّ الْكِنْدِيِّ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثَّيِّبُ تُعْرِبُ عَنْ نَفْسِهَا وَالْبِكْرُ رِضَاهَا صَمْتُهَا",
                "id": "Telah menceritakan kepada kami [Isa bin Hammad Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Abdullah bin 'Abdurrahman bin Abu Husain] dari [Adi bin Adi Al Kindi] dari [Bapaknya] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang janda akan mengungkapkan tentang dirinya, sementara seorang gaids persetujuan adalah dengan diam.\""
            },
            {
                "number": 1828,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يزِيدُ بْنُ هَارُونَ عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ وَمُجَمِّعَ بْنَ يَزِيدَ الْأَنْصَارِيَّيْنِ أَخْبَرَاهُأَنَّ رَجُلًا مِنْهُمْ يُدْعَى خِذَامًا أَنْكَحَ ابْنَةً لَهُ فَكَرِهَتْ نِكَاحَ أَبِيهَا فَأَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ لَهُ فَرَدَّ عَلَيْهَا نِكَاحَ أَبِيهَا فَنَكَحَتْ أَبَا لُبَابَةَ بْنَ عَبْدِ الْمُنْذِرِوَذَكَرَ يَحْيَى أَنَّهَا كَانَتْ ثَيِّبًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] dari [Yahya bin Sa'id] bahwa [Al Qasim bin Muhammad] mengabarkan kepadanya, bahwa ['Abdurrahman bin Yazid] dan [Mujami' bin Yazid Al Anshari] mengabarkan kepadanya, bahwa seorang laki-laki dari kaumnya yang bernama Khidzam menikahkan anak wanitanya, namun anaknya tidak setuju dengan putusan bapaknya. Maka, ia mendatangi Rasulullah shallallahu 'alaihi wasallam dan menceritakan kepada beliau, hingga beliau membatalkan pilihan bapaknya. Akhirnya wanita itu menikah dengan Abu Lubabah bin Abdul Mundzir.\" Yahya menyebutkan bahwa wanita itu adalah seorang janda.\""
            },
            {
                "number": 1829,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا وَكِيعٌ عَنْ كَهْمَسِ بْنِ الْحَسَنِ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَجَاءَتْ فَتَاةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّ أَبِي زَوَّجَنِي ابْنَ أَخِيهِ لِيَرْفَعَ بِي خَسِيسَتَهُ قَالَ فَجَعَلَ الْأَمْرَ إِلَيْهَا فَقَالَتْ قَدْ أَجَزْتُ مَا صَنَعَ أَبِي وَلَكِنْ أَرَدْتُ أَنْ تَعْلَمَ النِّسَاءُ أَنْ لَيْسَ إِلَى الْآبَاءِ مِنْ الْأَمْرِ شَيْءٌ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] berkata, telah menceritakan kepada kami [Waki'] dari [Kahmas bin Al Hasan] dari [Ibnu Buraidah] dari [Bapaknya] ia berkata; \"Ada seorang gadis datang kepada Nabi shallallahu 'alaihi wasallam dan berkata, \"Sesungguhnya ayahku menikahkan aku dengan keponakannya dengan tujuan agar mengangkatnya dari kehinaan.\" Buraidah berkata, \"Maka Beliau menyerahkan urusan itu kepada gadis tersebut. Lalu ia berkata, \"Aku telah menerima putusan bapakku, hanya saja aku ingin agar kaum wanita mengetahui, bahwa keputusan bukan ada pada bapak-bapak mereka.\""
            },
            {
                "number": 1830,
                "arab": "حَدَّثَنَا أَبُو السَّقْرِ يَحْيَى بْنُ يَزْدَادَ الْعَسْكَرِيُّ حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ الْمَرْوَرُوذِيُّ حَدَّثَنِي جَرِيرُ بْنُ حَازِمٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ جَارِيَةً بِكْرًا أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ لَهُ أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ كَارِهَةٌ فَخَيَّرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ الرَّقِّيُّ عَنْ زَيْدِ بْنِ حِبَّانَ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu As Saqr Yahya bin Yazdad Al Askari] berkata, telah menceritakan kepada kami [Al Husain bin Muhammad Al Marwarudzi] berkata, telah menceritakan kepadaku [Jarir bin Hazim] dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Seorang budak wanita yang masih gadis mendatangi Nabi shallallahu 'alaihi wasallam, ia mengabarkan bahwa ayahnya telah menikahkannya dengan seseorang yang tidak ia sukai, hingga Rasulullah shallallahu 'alaihi wasallam memberikan pilihan untuknya.\" Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Ma'mar bin Sulaiman Ar Raqqi] dari [Zaid bin Hibban] dari [Ayyub As Sakhtiyani] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits.\""
            },
            {
                "number": 1831,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْتَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سِتِّ سِنِينَ فَقَدِمْنَا الْمَدِينَةَ فَنَزَلْنَا فِي بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ فَوُعِكْتُ فَتَمَرَّقَ شَعَرِي حَتَّى وَفَى لَهُ جُمَيْمَةٌ فَأَتَتْنِي أُمِّي أُمُّ رُومَانَ وَإِنِّي لَفِي أُرْجُوحَةٍ وَمَعِي صَوَاحِبَاتٌ لِي فَصَرَخَتْ بِي فَأَتَيْتُهَا وَمَا أَدْرِي مَا تُرِيدُ فَأَخَذَتْ بِيَدِي فَأَوْقَفَتْنِي عَلَى بَابِ الدَّارِ وَإِنِّي لَأَنْهَجُ حَتَّى سَكَنَ بَعْضُ نَفَسِي ثُمَّ أَخَذَتْ شَيْئًا مِنْ مَاءٍ فَمَسَحَتْ بِهِ عَلَى وَجْهِي وَرَأْسِي ثُمَّ أَدْخَلَتْنِي الدَّارَ فَإِذَا نِسْوَةٌ مِنْ الْأَنْصَارِ فِي بَيْتٍ فَقُلْنَ عَلَى الْخَيْرِ وَالْبَرَكَةِ وَعَلَى خَيْرِ طَائِرٍ فَأَسْلَمَتْنِي إِلَيْهِنَّ فَأَصْلَحْنَ مِنْ شَأْنِي فَلَمْ يَرُعْنِي إِلَّا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضُحًى فَأَسْلَمَتْنِي إِلَيْهِ وَأَنَا يَوْمَئِذٍ بِنْتُ تِسْعِ سِنِينَ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Ali bin Mushir] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menikahiku di saat umurku enam tahun. Lalu kami datang ke Madinah dan singgah di bani Al Harits Ibnul Khazraj. Namun aku terkena demam hingga rambutku berguguran. Ketika sembuh dan panjang rambutku telah sampai sepundak, ibuku yang bernama Ummu Rumman mendatangiku, waktu itu aku sedang bermain Urjuhah bersama dengan sahabat-sahabatku. Ia memanggilku hingga aku pun mendatanginya, namun aku tidak tahu ada apa. Ibuku memegang tanganku dan mengajakku pada pintu rumah, sementara nafasku masih terengah-engah. Lantas ibuku mengambil air dan membasuh muka dan rambutku. Setelah itu, ia memasukkan aku ke dalam rumah, dan ternyata di dalamnya telah berkumpul wanita-wanita Anshar, mereka mengatakan; \"Semoga dalam kebaikan dan keberkahan atas keberuntungan yang besar.\" Ibuku menyerahkan aku kepada mereka, hingga mereka membenahi kondisiku (hingga menjadi segar dan cantik). Namun aku belum juga tersadar hingga Rasulullah shallallahu 'alaihi wasallam mendatangiku di waktu dluha. Ibuku lantas menyerahkan aku kepada beliau, sementara umurku waktu itu masih sembilan tahun.\" "
            },
            {
                "number": 1832,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَتَزَوَّجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَائِشَةَ وَهِيَ بِنْتُ سَبْعٍ وَبَنَى بِهَا وَهِيَ بِنْتُ تِسْعٍ وَتُوُفِّيَ عَنْهَا وَهِيَ بِنْتُ ثَمَانِي عَشْرَةَ سَنَةً",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] berkata, telah menceritakan kepada kami [Abu Ahmad] berkata, telah menceritakan kepada kami [Isra`il] dari [Abu Ishaq] dari [Abu 'Ubaidah] dari [Abdullah] ia berkata, \"Nabi shallallahu 'alaihi wasallam menikahi 'Aisyah ketika ia masih berumur tujuh tahun. Nabi shallallahu 'alaihi wasallam tinggal bersamanya ketika usianya sembilan tahun, dan beliau meninggal disaat Aisyah berumur delapan belas tahun.\""
            },
            {
                "number": 1833,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ الصَّائِغُ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ نَافِعٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَأَنَّهُ حِينَ هَلَكَ عُثْمَانُ بْنُ مَظْعُونٍ تَرَكَ ابْنَةً لَهُ قَالَ ابْنُ عُمَرَ فَزَوَّجَنِيهَا خَالِي قُدَامَةُ وَهُوَ عَمُّهَا وَلَمْ يُشَاوِرْهَا وَذَلِكَ بَعْدَ مَا هَلَكَ أَبُوهَا فَكَرِهَتْ نِكَاحَهُ وَأَحَبَّتْ الْجَارِيَةُ أَنْ يُزَوِّجَهَا الْمُغِيرَةَ بْنَ شُعْبَةَ فَزَوَّجَهَا إِيَّاهُ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Abdullah bin Nafi' Ash Sha`igh] berkata, telah menceritakan kepadaku [Abdullah bin Nafi'] dari [Bapaknya] dari [Ibnu Umar] bahwasanya ketika Utsman bin Mazh'un meninggal, ia meninggalkan seorang puteri. Ibnu Umar berkata, \"Lalu pamanku, Qudamah, menikahkan aku dengannya tanpa bermusyawarah terlebih dahulu hingga ia tidak mau untuk menikah. Qudamah adalah paman gadis itu. Hal itu terjadi ketika bapaknya meninggal. Wanita itu ingin agar pamannya menikahkan dirinya dengan Al Mughirah bin Syu'bah, maka pamannya menikahkannya dengan Al Mughirah.\""
            },
            {
                "number": 1834,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ لَمْ يُنْكِحْهَا الْوَلِيُّ فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَإِنْ أَصَابَهَا فَلَهَا مَهْرُهَا بِمَا أَصَابَ مِنْهَا فَإِنْ اشْتَجَرُوا فَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Mu'adz bin Mu'adz] berkata, telah menceritakan kepada kami [Ibnu Juraij] dari [Sulaiman bin Musa] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita mana saja yang tidak dinikahkan oleh walinya, maka nikahnya adalah batil. Nikahnya adalah batil. Jika suaminya telah menyetubuhinya, ia berhak mendapatkan maharnya karena persetubuhan tersebut. Jika mereka berselisih, maka penguasa adalah wali bagi yang tidak mempunyai wali.\""
            },
            {
                "number": 1835,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ حَجَّاجٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نِكَاحَ إِلَّا بِوَلِيٍّ وَفِي حَدِيثِ عَائِشَةَ وَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abdullah Ibnul Mubarak] dari [Hajjaj] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam. (dalam jalur lain) dari [Ikrimah] dari [Ibnu Abbas] keduanya berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada nikah tanpa adanya wali.\" Dalam hadits 'Aisyah disebutkan; \"Penguasa adalah wali bagi orang yang tidak mempunyai wali.\""
            },
            {
                "number": 1836,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا أَبُو عَوَانَةَ حَدَّثَنَا أَبُو إِسْحَقَ الْهَمْدَانِيُّ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نِكَاحَ إِلَّا بِوَلِيٍّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] berkata, telah menceritakan kepada kami [Abu 'Awanah] telah menceritakan kepada kami [Abu Ishaq Al Hamdani] dari [Abu Burdah] dari [Abu Musa] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada nikah kecuali dengan adanya wali.\""
            },
            {
                "number": 1837,
                "arab": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ مَرْوَانَ الْعُقَيْلِيُّ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُزَوِّجُ الْمَرْأَةُ الْمَرْأَةَ وَلَا تُزَوِّجُ الْمَرْأَةُ نَفْسَهَا فَإِنَّ الزَّانِيَةَ هِيَ الَّتِي تُزَوِّجُ نَفْسَهَا",
                "id": "Telah menceritakan kepada kami [Jamil bin Al Hasan Al 'Ataki] berkata, telah menceritakan kepada kami [Muhammad bin Marwan Al 'Uqaili] berkata, telah menceritakan kepada kami [Hisyam bin Hassan] dari [Muhamamad bin Sirin] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perempuan tidak boleh menikahkan perempuan dan tidak boleh seorang perempuan menikahkan dirinya sendiri, karena sesungguhnya wanita pezina itu adalah wanita yang menikahkan dirinya sendiri.\""
            },
            {
                "number": 1838,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الشِّغَارِ وَالشِّغَارُ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ زَوِّجْنِي ابْنَتَكَ أَوْ أُخْتَكَ عَلَى أَنْ أُزَوِّجَكَ ابْنَتِي أَوْ أُخْتِي وَلَيْسَ بَيْنَهُمَا صَدَاقٌ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang nikah syighar. Syighar adalah jika seseorang mengatakan, 'Nikahkanlah aku dengan anakmu atau saudara perempuanmu, maka aku akan nikahkan kamu dengan anakku atau saudara perempuanku. Dan tidak ada mahar antara keduanya'.\""
            },
            {
                "number": 1839,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الشِّغَارِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dan [Abu Usamah] dari [ubaidhullah] dari [Abu Az Zannad] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang pernikahan syighar.\" "
            },
            {
                "number": 1840,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ مَهْدِيٍّ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا شِغَارَ فِي الْإِسْلَامِ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Mahdi] ia berkata; telah memberitakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Tsabit] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada nikah syighar dalam Islam.\""
            },
            {
                "number": 1841,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ قَالَسَأَلْتُ عَائِشَةَ كَمْ كَانَ صَدَاقُ نِسَاءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ صَدَاقُهُ فِي أَزْوَاجِهِ اثْنَتَيْ عَشْرَةَ أُوقِيَّةً وَنَشًّا هَلْ تَدْرِي مَا النَّشُّ هُوَ نِصْفُ أُوقِيَّةٍ وَذَلِكَ خَمْسُ مِائَةِ دِرْهَمٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata; telah memberitakan kepada kami [Abdul Aziz Ad Darawardi] dari [Yazid bin Abdullah bin Al Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah] ia berkata; \"Aku bertanya kepada ['Aisyah], \"Berapa jumlah mahar isteri-isteri Nabi shallallahu 'alaihi wasallam?\" Ia menjawab, \"Mahar beliau untuk isteri-isterinya seebsar dua belas Uqiyah dan satu Nassy, apakah kamu tahu, berapa satu Nassy itu? Satu Nassy adalah setengah Uqiyah. Dan jumlah keseluruhannya adalah lima ratus dirham.\" "
            },
            {
                "number": 1842,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ عَوْنٍ ح و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي الْعَجْفَاءِ السُّلَمِيِّ قَالَقَالَ عُمَرُ بْنُ الْخَطَّابِ لَا تُغَالُوا صَدَاقَ النِّسَاءِ فَإِنَّهَا لَوْ كَانَتْ مَكْرُمَةً فِي الدُّنْيَا أَوْ تَقْوًى عِنْدَ اللَّهِ كَانَ أَوْلَاكُمْ وَأَحَقَّكُمْ بِهَا مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَصْدَقَ امْرَأَةً مِنْ نِسَائِهِ وَلَا أُصْدِقَتْ امْرَأَةٌ مِنْ بَنَاتِهِ أَكْثَرَ مِنْ اثْنَتَيْ عَشْرَةَ أُوقِيَّةً وَإِنَّ الرَّجُلَ لَيُثَقِّلُ صَدَقَةَ امْرَأَتِهِ حَتَّى يَكُونَ لَهَا عَدَاوَةٌ فِي نَفْسِهِ وَيَقُولُ قَدْ كَلِفْتُ إِلَيْكِ عَلَقَ الْقِرْبَةِ أَوْ عَرَقَ الْقِرْبَةِ وَكُنْتُ رَجُلًا عَرَبِيًّا مَوْلِدًا مَا أَدْرِي مَا عَلَقُ الْقِرْبَةِ أَوْ عَرَقُ الْقِرْبَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata; telah menceritakan kepada kami [Yazid bin Harun] dari [Ibnu Aun]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] berkata, telah menceritakan kepada kami [Ibnu Aun] dari [Muhammd bin Sirin] dari [Abu Al 'Ajfa As Sulami] ia berkata, \" [Umar Ibnul Khaththab] berkata; \"Janganlah kalian berlebih-lebihan dalam masalah mahar wanita, karena jika perbuatan itu terhormat di dunia atau merupakan ketaqwaan kepada Allah, maka orang yang lebih patut dalam hal itu adalah Nabi shallallahu 'alaihi wasallam, sementara Rasulullah shallallahu 'alaihi wasallam tidak memberikan mahar kepada istri-istrinya dan juga tidak meminta mahar untuk anak-anak perempuannya melebihi dari dua belas uqiyah, sesungguhnya seorang lelaki pasti akan merasa berat dengan mahar istrinya hingga hal itu menjadi musuh bagi dirinya dan akan berkata; 'aku terbebani untuk mengalungi qirbah (bejana dari kulit) ini karena kamu.\" (Abul 'Auja`) berkata; \"saat itu aku seorang anak Arab yang masih kecil, aku tidak tahu apa itu mengalungi bejana.\""
            },
            {
                "number": 1843,
                "arab": "حَدَّثَنَا أَبُو عُمَرَ الضَّرِيرُ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ عَنْ أَبِيهِأَنَّ رَجُلًا مِنْ بَنِي فَزَارَةَ تَزَوَّجَ عَلَى نَعْلَيْنِ فَأَجَازَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِكَاحَهُ",
                "id": "Telah menceritakan kepada kami [Abu Umar Adl Dlarir] dan [Hannad bin As Sari] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ashim bin ubaidhullah] dari [Abdullah bin Amir bin Rabi'ah] dari [Bapaknya] bahwa seorang laki-laki dari bani Fazarah menikah dengan mahar dua sandal, lalu Nabi shallallahu 'alaihi wasallam membolehkan pernikahannya.\""
            },
            {
                "number": 1844,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَجَاءَتْ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يَتَزَوَّجُهَا فَقَالَ رَجُلٌ أَنَا فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهَا وَلَوْ خَاتَمًا مِنْ حَدِيدٍ فَقَالَ لَيْسَ مَعِي قَالَ قَدْ زَوَّجْتُكَهَا عَلَى مَا مَعَكَ مِنْ الْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Amru] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Sufyan] dari [Abu Hazim] dari [Sahl bin Sa'd] berkata, \"Seorang wanita datang kepada Nabi shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Siapa yang ingin menikah dengannya?\" seorang laki-laki kemudian berkata, \"Saya, \" lalu Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Berilah ia meskipun hanya cincin dari besi.\" Laki-laki itu berkata, \"Aku tidak punya, \" beliau bersabda: \"Aku nikahkah kamu dengan apa yang kamu hafal dari al-qur'an.\""
            },
            {
                "number": 1845,
                "arab": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ مُحَمَّدُ بْنُ يَزِيدَ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ حَدَّثَنَا الْأَغَرُّ الرَّقَاشِيُّ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَ عَائِشَةَ عَلَى مَتَاعِ بَيْتٍ قِيمَتُهُ خَمْسُونَ دِرْهَمًا",
                "id": "Telah menceritakan kepada kami [Abu Hisyam Ar Rifa'i Muhammad bin Yazid] berkata, telah menceritakan kepada kami [Yahya bin Yaman] telah menceritakan kepada kami [Al Aghar Ar Raqqasyi] dari ['Atiyah Al 'Aufi] dari [Abu Sa'id Al Khudri] berkata, \"Nabi shallallahu 'alaihi wasallam menikahi 'Aisyah dengan mahar perabot rumah, nilainya lima puluh dirham.\""
            },
            {
                "number": 1846,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ فِرَاسٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِأَنَّهُ سُئِلَ عَنْ رَجُلٍ تَزَوَّجَ امْرَأَةً فَمَاتَ عَنْهَا وَلَمْ يَدْخُلْ بِهَا وَلَمْ يَفْرِضْ لَهَا قَالَ فَقَالَ عَبْدُ اللَّهِ لَهَا الصَّدَاقُ وَلَهَا الْمِيرَاثُ وَعَلَيْهَا الْعِدَّةُ فَقَالَمَعْقِلُ بْنُ سِنَانٍ الْأَشْجَعِيُّ شَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي بِرْوَعَ بِنْتِ وَاشِقٍ بِمِثْلِ ذَلِكَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Sufyan] dari [Firas] dari [Asy Sya'bi] dari [Masruq] dari [Abdullah] bahwasanya ia pernah ditanya tentang seorang lelaki yang menikahi wanita kemudian ia meninggal sebelum menggauli dan membayar maharnya. Masruq melanjutkan; \" Abdullah menjawab; \"Wanita itu berhak mendapatkan mahar, warisan, dan melakukan Iddah.\" Maka [Ma'qil bin Sinan Al Asyja'i] berkata; \"Aku menyaksikan Rasulullah shallallahu 'alaihi wasallam membuat putusan dalam perkara Birwa' binti Washiq seperti itu juga.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata; telah menceritakan kepada kami ['Abdurrahman Mahdi] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari [Alqamah] dari [Abdullah] sebagaimana dalam hadits.\""
            },
            {
                "number": 1847,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنِي أَبِي عَنْ جَدِّي أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَأُوتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَوَامِعَ الْخَيْرِ وَخَوَاتِمَهُ أَوْ قَالَ فَوَاتِحَ الْخَيْرِ فَعَلَّمَنَا خُطْبَةَ الصَّلَاةِ وَخُطْبَةَ الْحَاجَةِ خُطْبَةُ الصَّلَاةِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَخُطْبَةُ الْحَاجَةِ أَنْ الْحَمْدُ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَمِنْ سَيِّئَاتِ أَعْمَالِنَا مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ تَصِلُ خُطْبَتَكَ بِثَلَاثِ آيَاتٍ مِنْ كِتَابِ اللَّهِ{ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ }{ وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا }{ اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا }",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepadaku [Bapakku] dari kakekku [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah diberi semua kebaikan dan penutupnya, atau ia mengatakan, \"Pintu-pintu kebaikan. Beliau lalu mengajari kami khuthbah sholat dan khuthbah hajat, khuthbah sholat seperti; 'AT TAHIYYAATULILLAH WASH SHALAAWATU WATH THAYYIBAAT AS SALAAMU 'ALAIKA AYYUHANNABIYYU WA RAHMATULLAH WA BARAKAATUH. AS SALAAMU 'ALAINAA WA 'ALAA 'IBAADILLAHISH SHAALIHIIN ASYHADU ANLAA ILAAHA ILLAALLAHU WA ASYAHDU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Segala pernghormatan bagi Allah. (Demikan juga) segala rahmat dan kebaikan. Semoga kesejahteraan dilimpahkan kepadamu wahai Nabi, dan juga berkah dan rahmat Allah. Semoga kesejahteraan dilimpahkan kepadakami dan kepada hamba-hamba Allah yang shalih. Aku bersaksi tidak ada Tuhan yang berhak untuk disembah selain Allah, dan aku bersaksi bahwa Muhamad adalah hamba dan utusan-Nya). Dan khuthbah hajat seperti: 'AL HAMDULILLAHI NAHMADUHU WA NASTA'IINUHU WANASTAGHFIIRUHUU WA NA'UUDZUBILLAHI MIN SYURUURI ANFUSINAA WA MIN SAYYIAATI A'MAALINAA MAN YAHDIHILLAHU FALAA MUDLILLALAH WA MAN YUDLLILHU FALAA HAADIALAH. WA ASYHADU ANLAA ILAAHA ILLAALLAHU WAHDAHUU LAA SYARIIKALAH WA ANNA MUHAMMADAN 'ABDUHU WA RASUULUHU (Segala puji bagi Allah, kami memuji, meminta tolong dan meminta ampunan kepada-Nya. Kami berlindung kepada Allah dari keburukan jiwa dan amalan buruk kami. Barangsiapa diberi petunjuk oleh Allah tidak ada kesesatan baginya dan barangsiapa diberi kesesatan oleh Allah tidak akan ada petunjuk baginya. Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah semata yang tidak ada sekutu bagi-Nya. Dan aku juga bersaksi bahwa Muhammad adalah hamba dan utusan-Nya). Lalu sambunglah dengan tiga ayat dari Kitabullah, \" YAA AYYUHALLADZIINA AAMANUUTTAQULLAH HAQQA TUQAATIHI WA LAA TAMUUTUNNA ILLA WA ANTUM MUSLIMUUN. WATTAQULLAHALLADZII TASAA`ALUUNA BIHII WAL ARHAAM INNAALLAHA KAANA 'ALAIKUM RAQIIBAA. ITTAQUULLAHA WA QUULUU QAULAN SADIIDAN YUSHLIH LAKUM A'MAALAKUM WA YAGHFIRU DZUNUUBAKUM WA MAN YUTHI'ILLAHA WA RASUULAHU FAQAD FAAZA FAUZAN ADZIIMAA (Hai orang-orang yang beriman, bertaqwalah kepada Allah sebenar-benar taqwa kepada-Nya; dan janganlah sekali-kali kamu mati melainkan dalam keadaan beragama Islam. Dan bertaqwalah kepada Allah yang dengan (mempergunakan) nama-Nya kamu saling meminta satu sama lain, dan (peliharalah) hubungan silaturrahim. Sesungguhnya Allah selalu menjaga dan mengawasi kamu. bertaqwalah kamu kepada Allah dan katakanlah perkataan yang benar, niscaya Allah memperbaiki bagimu amalan-amalanmu dan mengampuni bagimu dosa-dosamu. Dan barangsiapa mentaati Allah dan Rasul-Nya, maka sesungguhnya ia telah mendapat kemenangan yang besar).\""
            },
            {
                "number": 1848,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ حَدَّثَنِي عَمْرُو بْنُ سَعِيدٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحَمْدُ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَمِنْ سَيِّئَاتِ أَعْمَالِنَا مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَمَّا بَعْدُ",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf Abu Bisyr] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] berkata, telah menceritakan kepada kami [Dawud bin Abu Hind] berkata, telah menceritakan kepadaku [Amru bin Sa'id] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"AL HAMDULILLAH NAHMADUHUU WA NASTA'IINUHU WA NA'UUDZU BILLAHI MIN SYURUURI ANFUSINAA WA MIN SAYYIAATI A'MAALINAA MAN YAHDIHILLAHU FALAA MUDLILLALAH WA MAN YUDLLILHU FALAA HAADIALAH WA ASYHADU AN LAA ILAAHA ILLA ALLAH WAHDAHUU LAA SYARIIKALAH WA ASYHADU ANNA MUHAMMADAN 'ABDUHUU WA RASUULUHU, AMMA BA'DU (Segala puji bagi Allah, kami memuji dan meminta tolong kepada-Nya. Kami berlindung kepada Allah dari keburukan jiwa dan amalan buruk kami. Barangsiapa diberi petunjuk oleh Allah tidak ada kesesatan baginya dan barangsiapa diberi kesesatan oleh Allah tidak akan ada petunjuk baginya. Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah semata yang tidak ada sekutu bagi-Nya. Dan aku juga bersaksi bahwa Muhammad adalah hamba dan utusan-Nya. Amma Ba'du).\""
            },
            {
                "number": 1849,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ يَحْيَى وَمُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ قَالُوا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ الْأَوْزَاعِيِّ عَنْ قُرَّةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ أَمْرٍ ذِي بَالٍ لَا يُبْدَأُ فِيهِ بِالْحَمْدِ أَقْطَعُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Muhammad bin Yahya] serta [Muhammad bin Khalaf Al 'Asqalani] mereka berkata; telah menceritakan kepada kami [ubaidhullah bin Musa] dari [Al Auza'i] dari [Qurrah] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semua perkara penting yang tidak dimulai dengan hamdalah adalah sia-sia.\""
            },
            {
                "number": 1850,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَالْخَلِيلُ بْنُ عَمْرٍو قَالَا حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ خَالِدِ بْنِ إِلْيَاسَ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَعْلِنُوا هَذَا النِّكَاحَ وَاضْرِبُوا عَلَيْهِ بِالْغِرْبَالِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] dan [Al Khalil bin Amru] keduanya berkata; telah menceritakan kepada kami [Isa bin Yunus] dari [Khalid bin Ilyas] dari [Rabi'ah bin Abu 'Abdurrahman] dari [Al Qasim] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Umumkanlah pernikahan ini, dan tabuhlah rebana.\""
            },
            {
                "number": 1851,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي بَلْجٍ عَنْ مُحَمَّدِ بْنِ حَاطِبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصْلُ مَا بَيْنَ الْحَلَالِ وَالْحَرَامِ الدُّفُّ وَالصَّوْتُ فِي النِّكَاحِ",
                "id": "Telah menceritakan kepada kami ['Amru bin Rafi'] berkata; telah menceritakan kepada kami [Husyaim] dari [Abu Balj] dari [Muhammad bin Hathib] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Pembatas antara yang halal dan haram adalah rebana dan suara dalam pernikahan.\""
            },
            {
                "number": 1852,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْحُسَيْنِ اسْمُهُ خَالِدٌ الْمَدَنِيُّ قَالَكُنَّا بِالْمَدِينَةِ يَوْمَ عَاشُورَاءَ وَالْجَوَارِي يَضْرِبْنَ بِالدُّفِّ وَيَتَغَنَّيْنَ فَدَخَلْنَا عَلَى الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ فَذَكَرْنَا ذَلِكَ لَهَا فَقَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَبِيحَةَ عُرْسِي وَعِنْدِي جَارِيَتَانِ يَتَغَنَّيَتَانِ وَتَنْدُبَانِ آبَائِي الَّذِينَ قُتِلُوا يَوْمَ بَدْرٍ وَتَقُولَانِ فِيمَا تَقُولَانِ وَفِينَا نَبِيٌّ يَعْلَمُ مَا فِي غَدٍ فَقَالَ أَمَّا هَذَا فَلَا تَقُولُوهُ مَا يَعْلَمُ مَا فِي غَدٍ إِلَّا اللَّهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu Al Husain] -namanya adalah Khalid Al Madani- ia berkata; \"Pada hari Asyura kami berada di Madinah sementara para budak wanita memukul-mukul rebana dan bernyanyi. Kami lalu menemui [Ar Rubai' binti Mu'awwidz] dan menyebutkan hal itu kepadanya, ia menjawab; \"Di hari pernikahanku Rasulullah shallallahu 'alaihi wasallam masuk ke rumahku di saat hari masih pagi, sementara di sisiku ada dua orang budak wanita yang sedang memukul rebana dan bernyanyi memuji bapak-bapak kami yang gugur pada perang badar, hingga mereka mengucapkan apa yang mereka ucapkan, padahal di sisi kami ada Nabi yang mengetahui apa yang akan terjadi di masa yang akan datang. Maka beliau pun bersabda: 'Jangan kalian ucapkan, sebab tidak ada yang tahu apa yang terjadi di masa datang selain Allah.\""
            },
            {
                "number": 1853,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْدَخَلَ عَلَيَّ أَبُو بَكْرٍ وَعِنْدِي جَارِيَتَانِ مِنْ جَوَارِي الْأَنْصَارِ تُغَنِّيَانِ بِمَا تَقَاوَلَتْ بِهِ الْأَنْصَارُ فِي يَوْمِ بُعَاثٍ قَالَتْ وَلَيْسَتَا بِمُغَنِّيَتَيْنِ فَقَالَ أَبُو بَكْرٍ أَبِمَزْمُورِ الشَّيْطَانِ فِي بَيْتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَلِكَ فِي يَوْمِ عِيدِ الْفِطْرِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا بَكْرٍ إِنَّ لِكُلِّ قَوْمٍ عِيدًا وَهَذَا عِيدُنَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata; telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata; \"Abu Bakar masuk ke dalam rumahku sementara di sisiku ada dua anak gadis Anshar. Keduanya melagukan nyanyian yang biasa dinyanyikan kaum Anshar pada hari raya Bu'ats.\" 'Aisyah melanjutkan; 'Dan keduanya bukanlah penyanyi.' Abu Bakar berkata; 'Apakah ada seruling setan di rumah Nabi shallallahu 'alaihi wasallam! ' Waktu itu sedang hari raya 'idul Fitri, hingga Nabi shallallahu 'alaihi wasallam bersabda: 'Wahai Abu Bakar, sesungguhnya setiap kaum memiliki hari raya, dan hari ini adalah hari raya kita.'"
            },
            {
                "number": 1854,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا عَوْفٌ عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِبَعْضِ الْمَدِينَةِ فَإِذَا هُوَ بِجَوَارٍ يَضْرِبْنَ بِدُفِّهِنَّ وَيَتَغَنَّيْنَ وَيَقُلْنَ نَحْنُ جَوَارٍ مِنْ بَنِي النَّجَّارِيَا حَبَّذَا مُحَمَّدٌ مِنْ جَارِفَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْلَمُ اللَّهُ إِنِّي لَأُحِبُّكُنَّ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata; telah menceritakan kepada kami [Isa bin Yunus] berkata; telah menceritakan kepada kami ['Auf] dari [Tsumamah bin Abdullah] dari [Anas bin Malik] berkata; \"Nabi shallallahu 'alaihi wasallam melewati sebagian kota Madinah dan menemukan gadis-gadis yang sedang menabuh rebana sambil bernyanyi dan bersenandung, 'Kami gadis-gadis Bani Najjar, alangkah indahnya punya tetangga Muhammad'.\" Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Allah mengetahui, sungguh aku mencintai mereka.\""
            },
            {
                "number": 1855,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا جَعْفَرُ بْنُ عَوْنٍ أَنْبَأَنَا الْأَجْلَحُ عَنْ أَبِي الزُّبَيْرِ عَنْ ابْنِ عَبَّاسٍ قَالَأَنْكَحَتْ عَائِشَةُ ذَاتَ قَرَابَةٍ لَهَا مِنْ الْأَنْصَارِ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَهْدَيْتُمْ الْفَتَاةَ قَالُوا نَعَمْ قَالَ أَرْسَلْتُمْ مَعَهَا مَنْ يُغَنِّي قَالَتْ لَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْأَنْصَارَ قَوْمٌ فِيهِمْ غَزَلٌ فَلَوْ بَعَثْتُمْ مَعَهَا مَنْ يَقُولُ أَتَيْنَاكُمْ أَتَيْنَاكُمْفَحَيَّانَا وَحَيَّاكُمْ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] berkata, telah memberitakan kepada kami [Ja'far bin Aun] berkata, telah memberitakan kepada kami [Al Ajlah] dari [Abu Zubair] dari [Ibnu Abbas] ia berkata, \"Aisyah menikahkan kerabat dekatnya yang berasal dari kaum Anshar, lalu Rasulullah shallallahu 'alaihi wasallam datang seraya bersabda: \"Apakah kalian menghadiahkan seorang gadis?\" Mereka menjawab, \"Benar.\" Beliau bertanya: \"Apakah kalian mengutus bersamanya orang yang bernyanyi?\" 'Aisyah menjawab, \"Tidak.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kaum Anshar itu kaum yang memiliki sya'ir, kalau seandainya kalian mengutus bersamanya orang yang mendendangkan: 'Kami datang kepada kalian, kami datang kepada kalian, maka mudah-mudahan kami diberi umur panjang, dan mudah-mudahan kalian diberi umur panjang'.\""
            },
            {
                "number": 1856,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْفِرْيَابِيُّ عَنْ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ التَّمِيمِيِّ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ قَالَكُنْتُ مَعَ ابْنِ عُمَرَ فَسَمِعَ صَوْتَ طَبْلٍ فَأَدْخَلَ إِصْبَعَيْهِ فِي أُذُنَيْهِ ثُمَّ تَنَحَّى حَتَّى فَعَلَ ذَلِكَ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ هَكَذَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Al Firyabi] dari [Tsa'labah bin Abu Malik At Tamimi] dari [Al Laits] dari [Mujahid] ia berkata, \"Aku pernah bersama [Ibnu Umar], tiba-tiba ia mendengar suara dentuman gendang, maka ia pun memasukkan kedua jarinya ke dalam telinganya dan menjauh. Ia lakukan hal itu sebanyak tiga kali, kemudian ia berkata, \"Demikianlah yang Rasulullah shallallahu 'alaihi wasallam lakukan.\""
            },
            {
                "number": 1857,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ زيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَسَمِعَ مُخَنَّثًا وَهُوَ يَقُولُ لِعَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ إِنْ يَفْتَحْ اللَّهُ الطَّائِفَ غَدًا دَلَلْتُكَ عَلَى امْرَأَةٍ تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْرِجُوهُ مِنْ بُيُوتِكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Zainab binti Ummu Salamah] dari [Ummu Salamah] bahwa ketika Nabi shallallahu 'alaihi wasallam masuk menemuinya, beliau mendengar seorang laki-laki yang menyerupai wanita berkata kepada Abdullah bin Abu Umayyah; 'Jika besok Allah membuka kota Tha`if, sungguh akan aku tunjukkan kepadamu seorang wanita yang jika ia menghadap ke arah depan ia memiliki empat leher, dan jika menghadap ke belakang maka ia memiliki depalan leher.' Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Keluarkanlah dia dari rumah kalian.\""
            },
            {
                "number": 1858,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ الْمَرْأَةَ تَتَشَبَّهُ بِالرِّجَالِ وَالرَّجُلَ يَتَشَبَّهُ بِالنِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat wanita yang menyerupai kaum laki-laki, dan laki-laki yang menyerupai kaum wanita.\""
            },
            {
                "number": 1859,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ الْمُتَشَبِّهِينَ مِنْ الرِّجَالِ بِالنِّسَاءِ وَلَعَنَ الْمُتَشَبِّهَاتِ مِنْ النِّسَاءِ بِالرِّجَالِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Khalid Ibnul Harits] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam melaknat kaum laki-laki yang menyerupai wanita dan kaum wanita yang menyerupai laki-laki.\""
            },
            {
                "number": 1860,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَّأَ قَالَ بَارَكَ اللَّهُ لَكُمْ وَبَارَكَ عَلَيْكُمْ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad bin Ad Darawardi] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] berkata, \"Jika Nabi shallallahu 'alaihi wasallam memberikan ucapan selamat, beliau mengucapkan: \"BAARAKALLAHU LAKUM WA WABAARAKA 'ALAIKUM WA JAMA'A BAINAKUMA FI KHAIR (Semoga Allah memberi berkah kepada kalian disaat senang dan susah, serta mengumpulkan kalian dalam kebaikan.\""
            },
            {
                "number": 1861,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ عَقِيلِ بْنِ أَبِي طَالِبٍأَنَّهُ تَزَوَّجَ امْرَأَةً مِنْ بَنِي جُشَمَ فَقَالُوا بِالرَّفَاءِ وَالْبَنِينَ فَقَالَ لَا تَقُولُوا هَكَذَا وَلَكِنْ قُولُوا كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَارِكْ لَهُمْ وَبَارِكْ عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah] berkata, telah menceritakan kepada kami [Asy'ats] dari [Al Hasan] dari ['Aqil bin Abu Thalib] bahwasanya ia menikah dengan seorang wanita dari bani Jusyam. Para sahabat berkata, \"Semoga harmonis dan banyak anak.\" Ia lalu berkata, \"Janganlah kalian mengatakan begitu, tetapi ucapkanlah sebagaimana yang diucapkan Rasulullah shallallahu 'alaihi wasallam: 'Ya Allah, berilah berkah kepada mereka dan atas mereka'.\""
            },
            {
                "number": 1862,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ فَقَالَ مَا هَذَا أَوْ مَهْ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ فَقَالَ بَارَكَ اللَّهُ لَكَ أَوْلِمْ وَلَوْ بِشَاةٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Tsabit Al Bunani] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam melihat pada diri 'Abdurrahman bin Auf ada sisa wewangian, beliau lantas bertanya: \"Apa ini?\" 'Abdurrahman lalu menjawab; \"Wahai Rasulullah, aku baru saja menikahi seorang wanita dengan mahar satu nawah emas, \" beliau bersabda: \"Semoga Allah memberimu berkah, buatlah walimahan meskipun dengan seekor kambing.\" "
            },
            {
                "number": 1863,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى شَيْءٍ مِنْ نِسَائِهِ مَا أَوْلَمَ عَلَى زَيْنَبَ فَإِنَّهُ ذَبَحَ شَاةً",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit Al Bunani] dari [Anas bin Malik] ia berkata, \"Aku belum pernah melihat Rasulullah shallallahu 'alaihi wasallam melaksanakan walimah untuk isteri-isterinya dengan sesuatu sebagaimana melaksanakan walimah untuk Zainab. Sesungguhnya Beliau menyembelih seekor kambing.\""
            },
            {
                "number": 1864,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ وَغِيَاثُ بْنُ جَعْفَرٍ الرَّحَبِيُّ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا وَائِلُ بْنُ دَاوُدَ عَنْ ابْنِهِ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى صَفِيَّةَ بِسَوِيقٍ وَتَمْرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Umar Al Adani] dan [Ghiyats bin Ja'far Ar Rahabi] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] berkata, telah menceritakan kepada kami [Wa`il bin Dawud] dari [Anaknya] dari [Az Zuhri] dari [Anas bin Malik] berkata, \"Nabi shallallahu 'alaihi wasallam mengadakan walimah ketika menikah dengan Shafiah dengan sawiq (makanan yang dibuat khusus untuk acara walimah) dan kurma.\""
            },
            {
                "number": 1865,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ أَبُو خَيْثَمَةَ حَدَّثَنَا سُفْيَانُ عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَشَهِدْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِيمَةً مَا فِيهَا لَحْمٌ وَلَا خُبْزٌقَالَ ابْن مَاجَةَ لَمْ يُحَدِّثْ بِهِ إِلَّا ابْنُ عُيَيْنَةَ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb Abu Khaitsamah] berkata, telah menceritakan kepada kami [Sufyan] dari [Ali bin Zaid bin Jud'an] dari [Anas bin Malik] ia berkata, \"Aku menyaksikan walimah Nabi shallallahu 'alaihi wasallam, tanpa ada daging dan roti.\" Ibnu Majah berkata; \"Tidak ada yang meriwayatkan hadits ini kecuali Ibnu 'Uyainah.\""
            },
            {
                "number": 1866,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُفَضَّلُ بْنُ عَبْدِ اللَّهِ عَنْ جَابِرٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ وَأُمِّ سَلَمَةَ قَالَتَاأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُجَهِّزَ فَاطِمَةَ حَتَّى نُدْخِلَهَا عَلَى عَلِيٍّ فَعَمَدْنَا إِلَى الْبَيْتِ فَفَرَشْنَاهُ تُرَابًا لَيِّنًا مِنْ أَعْرَاضِ الْبَطْحَاءِ ثُمَّ حَشَوْنَا مِرْفَقَتَيْنِ لِيفًا فَنَفَشْنَاهُ بِأَيْدِينَا ثُمَّ أَطْعَمْنَا تَمْرًا وَزَبِيبًا وَسَقَيْنَا مَاءً عَذْبًا وَعَمَدْنَا إِلَى عُودٍ فَعَرَضْنَاهُ فِي جَانِبِ الْبَيْتِ لِيُلْقَى عَلَيْهِ الثَّوْبُ وَيُعَلَّقَ عَلَيْهِ السِّقَاءُ فَمَا رَأَيْنَا عُرْسًا أَحْسَنَ مِنْ عُرْسِ فَاطِمَةَ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Al Mufadldlal bin Abdullah] dari [Jabir] dari [Asy Sya'bi] dari [Masruq] dari ['Aisyah] dan [Ummu Salamah] keduanya berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintah kami untuk mempersiapkan Fathimah hingga kami mempertemukannya dengan Ali. Kami pergi ke rumah dan membentangkan tanah lunak dari sisi saluran air, kemudian kami mengisi dua bantal dengan serabut dan kami ratakan dengan tangan-tangan kami. Setelah itu kami hidangkan kurma dan kismis, kami beri minum dengan air yang segar, lalu kami mengambil sebatang kayu dan kami pasang di sisi rumah untuk mencantelkan baju dan menggantungkan tempat air minum. Kami tidak pernah melihat pesta pernikahan yang seindah dari pesta pernikahan Fathimah.\""
            },
            {
                "number": 1867,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ حَدَّثَنِي أَبِي عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ قَالَدَعَا أَبُو أُسَيْدٍ السَّاعِدِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى عُرْسِهِ فَكَانَتْ خَادِمَهُمْ الْعَرُوسُ قَالَتْ تَدْرِي مَا سَقَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ أَنْقَعْتُ تَمَرَاتٍ مِنْ اللَّيْلِ فَلَمَّا أَصْبَحْتُ صَفَّيْتُهُنَّ فَأَسْقَيْتُهُنَّ إِيَّاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Abdul Aziz bin Abu Hazim] berkata, telah menceritakan kepadaku [Bapakku] dari [Sahl bin Sa'd As Sa'idi] ia berkata, \"Abu Usaid As Sa'idi mengundang Rasulullah shallallahu 'alaihi wasallam ke acara walimahannya, sementara Al 'Arus (ibunya) membantu memasak untuk mereka, ia berkata, \"Apakah engkau tahu, minuman apa yang aku berikan untuk Rasulullah shallallahu 'alaihi wasallam? ia melanjutkan, \"Aku telah endapkan kurma-kurma itu sejak tadi malam, ketika pagi aku tuang dan aku berikan kepada beliau.\""
            },
            {
                "number": 1868,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَشَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الْأَغْنِيَاءُ وَيُتْرَكُ الْفُقَرَاءُ وَمَنْ لَمْ يُجِبْ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari ['Abdurrahman Al A'raj] dari [Abu Hurairah] ia berkata, \"Makanan yang paling buruk adalah makanan walimah, orang-orang kaya diundang sementara orang-orang miskin ditinggalkan. Dan barangsiapa tidak memenuhi undangan maka ia telah bermaksiat kepada Allah dan rasul-Nya.\""
            },
            {
                "number": 1869,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةِ عُرْسٍ فَلْيُجِبْ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] berkata, telah memberitakan kepada kami [Abdullah bin Numair] berkata, telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian diundang untuk menghadiri acara walimah hendaklah ia penuhi.\""
            },
            {
                "number": 1870,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ الْوَاسِطِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ حُسَيْنٍ أَبُو مَالِكٍ النَّخَعِيُّ عَنْ مَنْصُورٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَلِيمَةُ أَوَّلَ يَوْمٍ حَقٌّ وَالثَّانِيَ مَعْرُوفٌ وَالثَّالِثَ رِيَاءٌ وَسُمْعَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Abadah Al Wasithi] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Abdul Malik bin Husain Abu Malik An Nakha'i] dari [Manshur] dari [Abu Hazim] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Walimah yang diadakan pada hari pertama itu benar, pada hari kedua itu baik, sementara pada hari ketiga adalah riya dan sum'ah (pingin dipuji).\""
            },
            {
                "number": 1871,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِلثَّيِّبِ ثَلَاثًا وَلِلْبِكْرِ سَبْعًا",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] berkata, telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Muhammad bin Ishaq] dari [Ayyub] dari [Abu Qilabah] dari [Anas] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya bagi janda itu tiga hari dan bagi gadis tujuh hari.\""
            },
            {
                "number": 1872,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ سُفْيَانَ عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا تَزَوَّجَ أُمَّ سَلَمَةَ أَقَامَ عِنْدَهَا ثَلَاثًا وَقَالَ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ لَكِ وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِي",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] dari [Sufyan] dari [Muhammad bin Abu Bakr] dari [Abdul Malik bin Abu Bakr Ibnul Harits bin Hisyam] dari [Bapaknya] dari [Ummu Salamah] Bahwasanya ketika Rasulullah shallallahu 'alaihi wasallam menikah dengan Ummu Salamah, beliau menginap di sisinya selama tiga hari. Beliau bersabda: \"Bukannya aku meremehkan keluargamu, jika kamu mau maka aku akan menginap selama tujuh hari, dan jika aku menginap tujuh hari (di sisimu), maka aku juga harus menginap tujuh hari untuk isteri-isteriku yang lain.\""
            },
            {
                "number": 1873,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَصَالِحُ بْنُ مُحَمَّدِ بْنِ يَحْيَى الْقَطَّانُ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَفَادَ أَحَدُكُمْ امْرَأَةً أَوْ خَادِمًا أَوْ دَابَّةً فَلْيَأْخُذْ بِنَاصِيَتِهَا وَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهَا وَخَيْرِ مَا جُبِلَتْ عَلَيْهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جُبِلَتْ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Shalih bin Muhammad bin Yahya Al Qaththan] keduanya berkata; telah menceritakan kepada kami [ubaidhullah bin Musa] berkata, telah menceritakan kepada kami [Sufyan] dari [Muhammad bin 'Ajlan] dari ['Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya], -Abdullah bin Amru- dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seorang dari kalian hendak mengambil manfaat dari seorang isteri (bersetubuh), atau pembantu, atau hewan, hendaklah ia pegang ubun-ubunnya sambil mengucapkan, 'ALLAHUMMA INNI AS`ALUKA MIN KHAIRIHAA WA KHAIRI MAA JUBILAT 'ALAIHI WA A'UUDZU BIKA MIN SYARRIHAA WA SYARRI MAA JUBILAT 'LAIHI' (Ya Allah, sesungguhnya aku memohon kepada Mu dari kebaikannya dan kebaikan yang telah Engkau berikan kepadanya, dan aku berlindung kepada-Mu dari keburukannya dan keburukan yang Engkau berikan kepadanya).\""
            },
            {
                "number": 1874,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ أَحَدَكُمْ إِذَا أَتَى امْرَأَتَهُ قَالَ اللَّهُمَّ جَنِّبْنِي الشَّيْطَانَ وَجَنِّبْ الشَّيْطَانَ مَا رَزَقْتَنِي ثُمَّ كَانَ بَيْنَهُمَا وَلَدٌ لَمْ يُسَلِّطْ اللَّهُ عَلَيْهِ الشَّيْطَانَ أَوْ لَمْ يَضُرَّهُ",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [Kuraib] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sekiranya salah seorang dari kalian ketika mendatangi isterinya mengucapkan, 'ALLAHUMMA JANNIBNII ASY SYAITHANA WA JANNIBISY SYAITHANA MAA RAZAQTANII (Ya Allah, jauhkanlah aku dari setan dan jauhkanlah setan dari apa yang telah Engkau rizkikan kepadaku), kemudian mempunyai anak, maka syetan tidak akan mengganggu atau membahayakannya.\""
            },
            {
                "number": 1875,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ وَأَبُو أُسَامَةَ قَالَا حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ احْفَظْ عَوْرَتَكَ إِلَّا مِنْ زَوْجَتِكَ أَوْ مَا مَلَكَتْ يَمِينُكَ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ كَانَ الْقَوْمُ بَعْضُهُمْ فِي بَعْضٍ قَالَ فَإِنْ اسْتَطَعْتَ أَنْ لَا تُرِيَهَا أَحَدًا فَلَا تُرِيَنَّهَا قُلْتُ يَا رَسُولَ اللَّهِ فَإِنْ كَانَ أَحَدُنَا خَالِيًا قَالَ فَاللَّهُ أَحَقُّ أَنْ يُسْتَحْيَا مِنْهُ مِنْ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] dan [Abu Usamah] keduanya berkata; telah menceritakan kepada kami [Bahz bin Hakim] dari [Bapaknya] dari [Kakeknya] ia berkata; \"Aku bertanya, \"Ya Rasulullah, bagaimana dengan aurat kami, apa yang harus kami lakukan dan apa yang harus kami hindarkan?\" beliau bersabda: \"Jaga aurat kamu kecuali kepada isterimu atau budak yang kamu miliki.\" Aku bertanya, \"Ya Rasulullah, bagaimana jika itu dilakukan oleh sebagian kaum dengan kaum yang lain?\" beliau menjawab: \"Jika kamu bisa untuk tidak memperlihatkannya kepada seorang pun, maka jangan engkau perlihatkan.\" Aku bertanya, \"Ya Rasulullah, bagaimana jika salah seorang dari kami sedang sendirian?\" beliau menjawab: \"Hendaklah engkau lebih malu kepada Allah dari pada terhadap manusia.\""
            },
            {
                "number": 1876,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ وَهْبٍ الْوَاسِطِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ الْقَاسِمِ الْهَمْدَانِيُّ حَدَّثَنَا الْأَحْوَصُ بْنُ حَكِيمٍ عَنْ أَبِيهِ وَرَاشِدُ بْنُ سَعْدٍ وَعَبْدُ الْأَعْلَى بْنُ عَدِيٍّ عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ فَلْيَسْتَتِرْ وَلَا يَتَجَرَّدْ تَجَرُّدَ الْعَيْرَيْنِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Wahb Al Wasith] berkata, telah menceritakan kepada kami [Al Walid bin Al Qasim Al Hamdani] berkata, telah menceritakan kepada kami [Al Ahwash bin Hakim] dari [Bapaknya] dan [Rasyid bin Sa'd] dan [Abdul A'la bin 'Adi] dari [Utbah bin Abdu As Sulami] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam: \"Jika salah seorang dari kalian mendatangi isterinya hendaklah dengan penutup, dan jangan telanjang bulat.\""
            },
            {
                "number": 1877,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ مَوْلًى لِعَائِشَةَ عَنْ عَائِشَةَ قَالَتْمَا نَظَرْتُ أَوْ مَا رَأَيْتُ فَرْجَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطُّقَالَ أَبُو بَكْرٍ قَالَ أَبُو نُعَيْمٍ عَنْ مَوْلَاةٍ لِعَائِشَةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Manshur] dari [Musa bin Abdullah bin Yazid] dari [mantan budak 'Aisyah] dari ['Aisyah] ia berkata, \"Aku tidak pernah melihat kemaluan Rasulullah shallallahu 'alaihi wasallam sama sekali.\" [Abu Bakr] berkata, \" [Abu Nu'aim] berkata; dari [mantan budak 'Aisyah].\""
            },
            {
                "number": 1878,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ الْحَارِثِ بْنِ مُخَلَّدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْظُرُ اللَّهُ عَزَّ وَجَلَّ إِلَى رَجُلٍ جَامَعَ امْرَأَتَهُ فِي دُبُرِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] berkata, telah menceritakan kepada kami [Abdul Aziz Ibnul Mukhtar] dari [Suhail bin Abu Shalih] dari [Ibnul Harits bin Makhlad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Allah Azza Wa Jalla tidak akan melihat seorang laki-laki yang menggauli dubur isterinya.\""
            },
            {
                "number": 1879,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ عَبْدِ اللَّهِ بْنِ هَرَمِيٍّ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَا يَسْتَحْيِي مِنْ الْحَقِّ ثَلَاثَ مَرَّاتٍ لَا تَأْتُوا النِّسَاءَ فِي أَدْبَارِهِنَّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah memberitakan kepada kami [Abdul Wahid bin Ziyad] dari [Hajjaj bin Arthah] dari [Amru bin Syu'aib] dari [Abdullah bin Harami] dari [Khuzaimah bin Tsabit] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah tidak malu dari kebenaran-beliau ucapkan tiga kali-, janganlah kalian mendatangi isteri-isterinya lewat dubur.\""
            },
            {
                "number": 1880,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ وَجَمِيلُ بْنُ الْحَسَنِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُكَانَتْ يَهُودُ تَقُولُ مَنْ أَتَى امْرَأَتَهُ فِي قُبُلِهَا مِنْ دُبُرِهَا كَانَ الْوَلَدُ أَحْوَلَ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ{ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ }",
                "id": "Telah menceritakan kepada kami [Sahl bin Abu Sahl] dan [Jamil bin Al Hasan] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Muhammad bin Al Munkadir] bahwa ia mendengar [Jabir bin Abdullah] berkata, \"Orang-orang Yahudi berkata, 'barang siapa mensetubuhi kemaluan isterinya melalui belakang, maka mata anaknya akan menjadi juling'. Lalu Allah Subhaanahu menurunkan ayat \"(Isteri-isteri kalian adalah ladang kalian, maka datangilah ladang kalian dari mana engkau kehendaki).\""
            },
            {
                "number": 1881,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَسَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَزْلِ فَقَالَ أَوَ تَفْعَلُونَ لَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا فَإِنَّهُ لَيْسَ مِنْ نَسَمَةٍ قَضَى اللَّهُ لَهَا أَنْ تَكُونَ إِلَّا هِيَ كَائِنَةٌ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Muhammad bin Utsman Al Utsmani] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah] dari [Abu Sa'id Al Khudri] ia berkata, \"Seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang 'azl, beliau lalu menjawab: \"Kenapa kalian tidak melakukannya, tidaklah mengapa jika kalian melakukannya, sebab tidak ada jiwa yang Allah takdirkan terjadi kecuali ia akan terjadi.\""
            },
            {
                "number": 1882,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَكُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْقُرْآنُ يَنْزِلُ",
                "id": "Telah menceritakan kepada kami [Harun bin Ishaq Al Hamdani] berkata, telah menceritakan kepada kami [Sufyan] dari [Amru] dari ['Atha] dari [Jabir] ia berkata, \"Kami pernah melakukan 'azl pada masa Rasulullah shallallahu 'alaihi wasallam, sementara Al Qur`an masih turun.\""
            },
            {
                "number": 1883,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا إِسْحَقُ بْنُ عِيسَى حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ عَنْ الزُّهْرِيِّ عَنْ مُحَرَّرِ بْنِ أَبِي هُرَيْرَةَ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعْزَلَ عَنْ الْحُرَّةِ إِلَّا بِإِذْنِهَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Ishaq bin Isa] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] berkata, telah menceritakan kepadaku [Ja'far bin Rabi'ah] dari [Az Zuhri] dari [Muharrar bin Abu Hurairah] dari [Bapaknya] dari [Umar bin Khaththab] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang melakukan 'azl terhadap wanita merdeka kecuali atas seizinnya.\""
            },
            {
                "number": 1884,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلَا عَلَى خَالَتِهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak boleh menikahi wanita dengan memadu bibinya, baik dari pihak bapak atau dari pihak ibu.\""
            },
            {
                "number": 1885,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ نِكَاحَيْنِ أَنْ يَجْمَعَ الرَّجُلُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَبَيْنَ الْمَرْأَةِ وَخَالَتِهَا",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Muhammad bin Ishaq] dari [Ya'qub bin 'Utbah] dari [Sulaiman bin Yasar] dari [Abu Sa'id Al Khudlri] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari dua bentuk pernikahan; seorang laki-laki menikahi wanita dan menikahi bibi (isteri) nya dari pihak ayah, dan seorang laki-laki menikahi wanita dan menikahi bibinya dari pihak ibu.\""
            },
            {
                "number": 1886,
                "arab": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا أَبُو بَكْرٍ النَّهْشَلِيُّ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي مُوسَى عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُنْكَحُ الْمَرْأَةِ عَلَى عَمَّتِهَا وَلَا عَلَى خَالَتِهَا",
                "id": "Telah menceritakan kepada kami [Jubarah bin Al Mughallis] berkata, telah menceritakan kepada kami [Abu Bakr An Nahsyali] berkata, telah menceritakan kepadaku [Abu Bakr bin Abu Musa] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Isteri itu tidak boleh dimadu dengan bibi perempuannya dari pihak ayah dan tidak boleh juga dimadu dengan bibi perempuannya dari pihak ibu.\""
            },
            {
                "number": 1887,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَأَنَّ امْرَأَةَ رِفَاعَةَ الْقُرَظِيِّ جَاءَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنِّي كُنْتُ عِنْدَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلَاقِي فَتَزَوَّجْتُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ وَإِنَّ مَا مَعَهُ مِثْلُ هُدْبَةِ الثَّوْبِ فَتَبَسَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَتُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لَا حَتَّى تَذُوقِي عُسَيْلَتَهُ وَيَذُوقَ عُسَيْلَتَكِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] berkata, telah mengabarkan kepadaku [Urwah] dari ['Aisyah] berkata; \"Isteri Rifa'ah Al Qurazhi datang menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Sesungguhnya aku pernah menjadi isteri Rifa'ah, lalu ia menceraikan aku dan telah selesai perceraianku. Kemudian aku menikah dengan 'Abdurrahman bin Az Zubair, namun ia tidak punya apa-apa selain seperti sepotong kain! \" maka tersenyumlah Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apakah kamu ingin kembali lagi dengan Rifa'ah? Tidak, hingga engkau merasakan madunya dan ia merasakan madumu.\""
            },
            {
                "number": 1888,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ قَالَ سَمِعْتُ سَالِمَ بْنَ رَزِينٍ يُحَدِّثُ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ تَكُونُ لَهُ الْمَرْأَةُ فَيُطَلِّقُهَا فَيَتَزَوَّجُهَا رَجُلٌ فَيُطَلِّقُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا أَتَرْجِعُ إِلَى الْأَوَّلِ قَالَ لَا حَتَّى يَذُوقَ الْعُسَيْلَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Alqamah bin Martsad] ia berkata; aku mendengar [Salim bin Razin] menceritakan riwayat dari [Salim bin Abdullah] dari [Sa'id bin Al Musayyab] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam; tentang seorang lelaki yang memiliki seorang isteri, lalu menceraikannya. Kemudian datang lelaki lain menikahinya dan mencerainya sebelum menggaulinya. Maka apakah ia boleh kembali kepada yang pertama?\" Beliau menjawab: \"Tidak boleh, hingga dia merasakan madunya (menggaulinya).\""
            },
            {
                "number": 1889,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ عَنْ زَمْعَةَ بْنِ صَالِحٍ عَنْ سَلَمَةَ بْنِ وَهْرَامَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abu Amir] dari [Zam'ah bin Shalih] dari [Salamah bin Wahram] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat muhallil dan Muhallal lahu.\" "
            },
            {
                "number": 1890,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ الْبَخْتَرِيِّ الْوَاسِطِيُّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ ابْنِ عَوْنٍ وَمُجالِدٌ عَنْ الشَّعْبِيِّ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il Ibnul Bakhtari Al Wasithi] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Ibnu Aun] dan [Mujalid] dari [Asy Sya'bi] dari [Al Harits] dari ['Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat Al Muhallil dan muhallal lahu.\" "
            },
            {
                "number": 1891,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ صَالِحٍ الْمِصْرِيُّ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ اللَّيْثَ بْنَ سَعْدٍ يَقُولُ قَالَ لِي أَبُو مُصْعَبٍ مِشْرَحُ بْنُ هَاعَانَ قَالَ عُقْبَةُ بْنُ عَامِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِالتَّيْسِ الْمُسْتَعَارِ قَالُوا بَلَى يَا رَسُولَ اللَّهِ قَالَ هُوَ الْمُحَلِّلُ لَعَنَ اللَّهُ الْمُحَلِّلَ وَالْمُحَلَّلَ لَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Utsman bin Shalih Al Mishri] berkata, telah menceritakan kepada kami [Bapakku] ia berkata; aku mendengar [Al Laits bin Sa'd] berkata; [Abu Mush'ab Misyrah bin Ha'an] berkata kepadaku; [Uqbah bin Amir] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah kalian aku beritahukan mengenai kambing yang dipinjam?\" Para sahabat menjawab, \"Mau ya Rasulullah.\" Beliau bersabda: \"Dia adalah muhallil, Allah melaknat muhallil dan muhallal lahu.\""
            },
            {
                "number": 1892,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ حَجَّاجٍ عَنْ الْحَكَمِ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْرُمُ مِنْ الرَّضَاعِ مَا يَحْرُمُ مِنْ النَّسَبِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [Hajjaj] dari [Al Hakam] dari [Irak bin Malik] dari [Urwah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diharamkan dari persusuan apa yang diharamkan dari nasab.\""
            },
            {
                "number": 1893,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرِيدَ عَلَى بِنْتِ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِ فَقَالَ إِنَّهَا ابْنَةُ أَخِي مِنْ الرَّضَاعَةِ وَإِنَّهُ يَحْرُمُ مِنْ الرَّضَاعَةِ مَا يَحْرُمُ مِنْ النَّسَبِ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] dan [Abu Bakr bin Khallad] keduanya berkata; telah menceritakan kepada kami [Khalid Ibnul Harits] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Jabir bin Zaid] dari [Ibnu Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam ditawari untuk menikahi Binti Hamzah bin Abdul Muthallib, maka beliau pun bersabda: \"Ia adalah anak saudaraku dari persusuan, sesungguhnya telah diharamkan dari persusuan apa yang diharamkan dari nasab.\""
            },
            {
                "number": 1894,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ حَدَّثَتْهُ أَنَّ أُمَّ حَبِيبَةَ حَدَّثَتْهَاأَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْكِحْ أُخْتِي عَزَّةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُحِبِّينَ ذَلِكِ قَالَتْ نَعَمْ يَا رَسُولَ اللَّهِ فَلَسْتُ لَكَ بِمُخْلِيَةٍ وَأَحَقُّ مَنْ شَرِكَنِي فِي خَيْرٍ أُخْتِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّ ذَلِكَ لَا يَحِلُّ لِي قَالَتْ فَإِنَّا نَتَحَدَّثُ أَنَّكَ تُرِيدُ أَنْ تَنْكِحَ دُرَّةَ بِنْتَ أَبِي سَلَمَةَ فَقَالَ بِنْتَ أُمِّ سَلَمَةَ قَالَتْ نَعَمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّهَا لَوْ لَمْ تَكُنْ رَبِيبَتِي فِي حَجْرِي مَا حَلَّتْ لِي إِنَّهَا لَابْنَةُ أَخِي مِنْ الرَّضَاعَةِ أَرْضَعَتْنِي وَأَبَاهَا ثُوَيْبَةُ فَلَا تَعْرِضْنَ عَلَيَّ أَخَوَاتِكُنَّ وَلَا بَنَاتِكُنَّحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ حَبِيبَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Yazid bin Abu Habib] dari [Ibnu Syihab] dari [Urwah bin Az Zubair] bahwa [Zainab binti Ummu Salamah] menceritakan kepadanya bahwa [Ummu Habibah] menceritakan kepadanya, ia pernah berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Nikahilah Azzah, saudara perempuanku, \" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Apakah kamu suka begitu?\" ia menjawab, \"Benar ya Rasulullah, aku tidak suka jika kebaikanmu kunikmati sendiri. Aku sangat berkeinginan jika saudara wanitaku sama-sama memperoleh kebaikanmu.\" Beliau bersabda: \"Maaf, itu tidak halal bagiku.\" Ummu Habibah berkata, \"Pernah kami ngobrol-ngobrol sepertinya engkau akan menikahi Durrah binti Abu Salamah! \" Beliau menjawab setengah kaget: \"Binti Ummu Salamah?! \" Ummu Habibah menjawab, \"Ya.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maaf, kalaulah Durrah binti Salamah itu bukan anak perempuan isteriku yang kuasuh dari suami sebelumku, ia tetap haram bagiku. Sebab Durrah adalah anak perempuan saudaraku sepersusuan. Tsuwaibah dahulu pernah menyusuiku dan juga menyusui ayahnya, Salamah. Maka jangan kalian tawarkan saudara perempuan dan anak perempuanmu kepadaku.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Zainab binti Ummu Salamah] dari [Ummu Habibah] dari Nabi dengan redaksi serupa."
            },
            {
                "number": 1895,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ أَنَّ أُمَّ الْفَضْلِ حَدَّثَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُحَرِّمُ الرَّضْعَةُ وَلَا الرَّضْعَتَانِ أَوْ الْمَصَّةُ وَالْمَصَّتَانِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] berkata, telah menceritakan kepada kami [Ibnu Abu 'Arubah] dari [Qatadah] dari [Abu Al Khalil] dari [Abdullah Ibnul Harits] bahwa [Ummul Fadll] menceritakan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak menjadi haram sekali persusuan atau dua kali, atau satu hisapan dan dua hisapan.\""
            },
            {
                "number": 1896,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خِدَاشٍ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُحَرِّمُ الْمَصَّةُ وَالْمَصَّتَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Khalid bin Khidasy] berkata, telah menceritakan kepada kami [Ibnu Ulayyah] dari [Ayyub] dari [Ibnu Abu Mulaikah] dari [Abdullah bin Az Zubair] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak menjadikan haram satu atau dua hisaban.\""
            },
            {
                "number": 1897,
                "arab": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ حَدَّثَنَا أَبِي حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكَانَ فِيمَا أَنْزَلَ اللَّهُ مِنْ الْقُرْآنِ ثُمَّ سَقَطَ لَا يُحَرِّمُ إِلَّا عَشْرُ رَضَعَاتٍ أَوْ خَمْسٌ مَعْلُومَاتٌ",
                "id": "Telah menceritakan kepada kami [Abdul Warits bin Abdush Shamad bin Abdul Warits] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari ['Abdurrahman bin Al Qasim] dari [Bapaknya] dari [Amrah] dari ['Aisyah] ia berkata, \"Termasuk dari ayat yang diturunkan Allah dari al-qur'an kemudian dimansukh (dihapus) adalah: \"Tidak menjadikan mahram kecuali sepuluh susuan atau lima yang dimaklumi.\""
            },
            {
                "number": 1898,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أَرَى فِي وَجْهِ أَبِي حُذَيْفَةَ الْكَرَاهِيَةَ مِنْ دُخُولِ سَالِمٍ عَلَيَّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْضِعِيهِ قَالَتْ كَيْفَ أُرْضِعُهُ وَهُوَ رَجُلٌ كَبِيرٌ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ قَدْ عَلِمْتُ أَنَّهُ رَجُلٌ كَبِيرٌ فَفَعَلَتْ فَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ مَا رَأَيْتُ فِي وَجْهِ أَبِي حُذَيْفَةَ شَيْئًا أَكْرَهُهُ بَعْدُ وَكَانَ شَهِدَ بَدْرًا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari ['Abdurrahman Ibnul Qasim] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Sahlah binti Suhail datang menemui Nabi shallallahu 'alaihi wasallam dan bertanya, \"Wahai Rasulullah, aku melihat adanya kebencian pada wajah Abu Hudzaifah ketika Salim masuk menemuiku?! Nabi shallallahu 'alaihi wasallam lantas bersabda: \"Susuilah ia.\" Sahlah binti Suhail bertanya, \"Bagaimana aku menyusuinya, padahal ia seorang laki-laki yang telah dewasa! \" Rasulullah shallallahu 'alaihi wasallam tersenyum, kemudian beliau bersabda: \"Aku sudah tahu kalau ia seorang laki-laki yang sudah dewasa.\" Maka Sahlah binti Suhail pun melakukannya, setelah itu ia mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Aku tidak lagi melihat sesuatu yang aku benci pada wajah Abu Hudzaifah setelah itu.\" Abu Hudzifah adalah seorang yang pernah ikut dalam perang Badar.\""
            },
            {
                "number": 1899,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ و عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْلَقَدْ نَزَلَتْ آيَةُ الرَّجْمِ وَرَضَاعَةُ الْكَبِيرِ عَشْرًا وَلَقَدْ كَانَ فِي صَحِيفَةٍ تَحْتَ سَرِيرِي فَلَمَّا مَاتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَشَاغَلْنَا بِمَوْتِهِ دَخَلَ دَاجِنٌ فَأَكَلَهَا",
                "id": "Telah menceritakan kepada kami [Abu Salamah Yahya bin Khalaf] berkata, telah menceritakan kepada kami [Abdul A'la] dari [Muhammad bin Ishaq] dari [Abdullah bin Abu Bakr] dari [Amrah] dari ['Aisyah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami ['Abdurrahman Ibnul Qasim] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Telah turun ayat berkenaan hukum rajam, dan ayat persusuan orang yang telah dewasa itu sebanyak sepuluh kali. Lembaran ayat itu ada di bawah kasurku, ketika Rasulullah shallallahu 'alaihi wasallam wafat kami tersibukkan dengan jasad beliau hingga burung-burung masuk dan memakannya.\""
            },
            {
                "number": 1900,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ فَقَالَ مَنْ هَذَا قَالَتْ هَذَا أَخِي قَالَ انْظُرُوا مَنْ تُدْخِلْنَ عَلَيْكُنَّ فَإِنَّ الرَّضَاعَةَ مِنْ الْمَجَاعَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Asy'ats bin Abu Asy'ats] dari [Bapaknya] dari [Masruq] dari ['Aisyah] Bahwasanya Nabi shallallahu 'alaihi wasallam pernah masuk ke dalam rumahnya, sementara di sampingnya ('Aisyah) ada seorang lelaki. Beliau lantas bertanya: \"Siapa ini?\" 'Aisyah menjawab, \"Ini adalah saudaraku.\" Beliau bersabda: \"Perhatikanlah siapa yang kalian masukkan ke dalam rumah kalian. Karena penyusuan itu karena sebab lapar.\""
            },
            {
                "number": 1901,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا رَضَاعَ إِلَّا مَا فَتَقَ الْأَمْعَاءَ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Ibnu Lahi'ah] dari [Abul Aswad] dari ['Urwah] dari [Abdullah bin Az Zubair] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk penyusuan kecuali yang mengenyangkan.\""
            },
            {
                "number": 1902,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ وَعُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو عُبَيْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ زَمْعَةَ عَنْ أُمِّهِ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ أَنَّهَا أَخْبَرَتْهُأَنَّ أَزْوَاجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلَّهُنَّ خَالَفْنَ عَائِشَةَ وَأَبَيْنَ أَنْ يَدْخُلَ عَلَيْهِنَّ أَحَدٌ بِمِثْلِ رَضَاعَةِ سَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ وَقُلْنَ وَمَا يُدْرِينَا لَعَلَّ ذَلِكَ كَانَتْ رُخْصَةً لِسَالِمٍ وَحْدَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Lahi'ah] dari [Yazid bin Abu Habib] dan [Uqail] dari [Ibnu Syihab] berkata, telah mengabarkan kepadaku [Abu Ubaidah bin Abdullah bin Zam'ah] dari ibunya [Zainab binti Abu Salamah] ia mengabarkan bahwa isteri-isteri Nabi shallallahu 'alaihi wasallam semuanya menyelesihi 'Aisyah, hingga mereka semua enggan memasukkan seorang laki-laki pun untuk menemui mereka sebagaimana persusuan yang terjadi pada Salim, mantan budak Abu Hudzaifah. Mereka berkata, \"Kami tidak tahu, barangkali itu hanya rukhshah buat Salim semata.\""
            },
            {
                "number": 1903,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْأَتَانِي عَمِّي مِنْ الرَّضَاعَةِ أَفْلَحُ بْنُ أَبِي قُعَيْسٍ يَسْتَأْذِنُ عَلَيَّ بَعْدَ مَا ضُرِبَ الْحِجَابُ فَأَبَيْتُ أَنْ آذَنَ لَهُ حَتَّى دَخَلَ عَلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّهُ عَمُّكِ فَأْذَنِي لَهُ فَقُلْتُ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ قَالَ تَرِبَتْ يَدَاكِ أَوْ يَمِينُكِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] ia berkata, \"Paman sepersusuanku, Aflah bin Abu Qu'ais, datang dan minta izin kepadaku untuk masuk setelah diwajibkannya hijab. Namun aku enggan menerimanya hingga Nabi shallallahu 'alaihi wasallam datang menemuiku, beliau bersabda: \"Dia itu pamanmu, berilah izin untuknya.\" Aku menjawab, \"Yang menyusui aku wanita, bukan laki-laki! \" beliau bersabda: \"Tidak, dengannya kamu akan beruntung.\""
            },
            {
                "number": 1904,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْجَاءَ عَمِّي مِنْ الرَّضَاعَةِ يَسْتَأْذِنُ عَلَيَّ فَأَبَيْتُ أَنْ آذَنَ لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيَلِجْ عَلَيْكِ عَمُّكِ فَقُلْتُ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ قَالَ إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Paman sepersusuanku datang dan minta izin untuk masuk menemuiku, namun aku enggan menerimanya hingga Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Berilah izin untuk pamanmu, \" aku berkata, \"Yang menyusuiku wanita, bukan lak-laki! \" beliau bersabda lagi: \"Dia itu pamanmu, berilah izin! \""
            },
            {
                "number": 1905,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ عَنْ أَبِي وَهْبٍ الْجَيْشَانِيِّ عَنْ أَبِي خِرَاشٍ الرُّعَيْنِيِّ عَنْ الدَّيْلَمِيِّ قَالَقَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدِي أُخْتَانِ تَزَوَّجْتُهُمَا فِي الْجَاهِلِيَّةِ فَقَال إِذَا رَجَعْتَ فَطَلِّقْ إِحْدَاهُمَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdus Salam bin Harb] dari [Ishaq bin Abdullah bin Abu Farwah] dari [Abu Wahb Al Jaisyani] dari [Abu Khirasyi Ar Ru'aini] dari [Ad Dailami] ia berkata, \"Aku datang kepada Rasulullah shallallahu 'alaihi wasallam sementara aku mempunyai dua isteri kakak beradik, aku menikahi mereka pada masa jahiliyyah. Beliau lantas bersabda: \"Jika kamu kembali, maka cerai salah satu dari keduanya.\""
            },
            {
                "number": 1906,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ أَبِي وَهْبٍ الْجَيْشَانِيِّ حَدَّثَهُ أَنَّهُ سَمِعَ الضَّحَّاكَ بْنَ فَيْرُوزَ الدَّيْلَمِيَّ يُحَدِّثُ عَنْ أَبِيهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَسْلَمْتُ وَتَحْتِي أُخْتَانِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِي طَلِّقْ أَيَّتَهُمَا شِئْتَ",
                "id": "Telah menceritakan kepada kami [Yunus bin Abdul A'la] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Ibnu Lahi'ah] dari [Abu Wahb Al Jaisyani] ia menceritakan kepadanya, bahwa ia mendengar [Adl Dlahhak bin Fairuz Ad Dailami] menceritakan riwayat dari [Bapaknya] ia berkata, \"Aku mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Ya Rasulullah, sesungguhnya aku telah masuk Islam, dan aku mempunyai dua isteri yang bersaudara. Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Ceraikan salah satu dari keduanya yang kamu kehendaki.\""
            },
            {
                "number": 1907,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنَا هُشَيْمٌ عَنْ ابْنِ أَبِي لَيْلَى عَنْ حُمَيْضَةَ بِنْتِ الشَّمَرْدَلِ عَنْ قَيْسِ بْنِ الْحَارِثِ قَالَأَسْلَمْتُ وَعِنْدِي ثَمَانِ نِسْوَةٍ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ ذَلِكَ لَهُ فَقَالَ اخْتَرْ مِنْهُنَّ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim Ad Dauraqqi] berkata, telah menceritakan kepada kami [Husyaim] dari [Ibnu Abu Laila] dari [Khamaidlah binti Asy Syamardal] dari [Qais bin Al Harits] ia berkata, \"Aku masuk Islam sementara aku mempunyai delapan isteri. Lalu aku mendatangi Nabi shallallahu 'alaihi wasallam dan menuturkan masalah itu. Maka beliau bersabda: \"Pilihlah empat di antara mereka.\""
            },
            {
                "number": 1908,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَأَسْلَمَ غَيْلَانُ بْنُ سَلَمَةَ وَتَحْتَهُ عَشْرُ نِسْوَةٍ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ مِنْهُنَّ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] ia berkata, \"Ghailan bin Salamah masuk Islam sementara ia mempunyai sepuluh isteri. Maka Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Ambillah empat dari mereka.\""
            },
            {
                "number": 1909,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللَّهِ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ عَنْ عُقْبَةَ بْنِ عَامِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحَقَّ الشَّرْطِ أَنْ يُوفَى بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ",
                "id": "Telah menceritakan kepada kami [Amru bin Abdullah] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Abu Usamah] dari [Abdul Hamid bin Ja'far] dari [Yazid bin Abu Habib] dari [Martsad bin Abdullah] dari [Uqbah bin Amir] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya persyaratan yang paling berhak untuk dipenuhi adalah kemaluan yang telah kalian halalkan.\""
            },
            {
                "number": 1910,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو خَالِدٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا كَانَ مِنْ صَدَاقٍ أَوْ حِبَاءٍ أَوْ هِبَةٍ قَبْلَ عِصْمَةِ النِّكَاحِ فَهُوَ لَهَا وَمَا كَانَ بَعْدَ عِصْمَةِ النِّكَاحِ فَهُوَ لِمَنْ أُعْطِيَهُ أَوْ حُبِيَ وَأَحَقُّ مَا يُكْرَمُ الرَّجُلُ بِهِ ابْنَتُهُ أَوْ أُخْتُهُ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Khalid] dari [Ibnu Juraij] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mahar, hadiah atau hibah yang diberikan sebelum akad nikah, maka itu semua adalah miliknya (isteri). Namun jika diberikan setelah akad nikah, maka itu semua adalah milik orang yang diberi, dan yang paling berhak untuk perioritaskan adalah anak perempuan atau saudara perempuannya.\""
            },
            {
                "number": 1911,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ صَالِحِ بْنِ صَالِحِ بْنِ حَيٍّ عَنْ الشَّعْبِيِّ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ جَارِيَةٌ فَأَدَّبَهَا فَأَحْسَنَ أَدَبَهَا وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا ثُمَّ أَعْتَقَهَا وَتَزَوَّجَهَا فَلَهُ أَجْرَانِ وَأَيُّمَا رَجُلٍ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ وَآمَنَ بِمُحَمَّدٍ فَلَهُ أَجْرَانِ وَأَيُّمَا عَبْدٍ مَمْلُوكٍ أَدَّى حَقَّ اللَّهِ عَلَيْهِ وَحَقَّ مَوَالِيهِ فَلَهُ أَجْرَانِقَالَ صَالِحٌ قَالَ الشَّعْبِيُّ قَدْ أَعْطَيْتُكَهَا بِغَيْرِ شَيْءٍ إِنْ كَانَ الرَّاكِبُ لَيَرْكَبُ فِيمَا دُونَهَا إِلَى الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id Abu Sa'id Al Asyaj] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Shalih bin Shalih bin Hay] dari [Asy Sya'bi] dari [Abu Burdah] dari [Abu Musa] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memiliki budak wanita, ia mendidiknya dengan sebaik-baik pendidikan, ia ajari dengan sebaik-baik pengajaran, kemudian ia merdekakan dan nikahkan, maka ia mendapat dua pahala. Laki-laki mana saja dari ahli kitab, ia beriman kepada Nabi-Nya dan juga kepada Nabi Muhammad, maka ia mendapatkan dua pahala. Budak mana saja yang melaksanakan hak Rabbnya dan hak tuannya, maka ia mendapatkan dua pahala.\" Shalih berkata; Asy Sya'bi berkata, \"Aku telah memberikannya kepadamu tanpa adanya imbalan apapun, walaupun yang menyampaikan itu harus pergi ke Madinah untuk mendapatkan Hadits tersebut. (maka jagalah Hadits tersebut)."
            }
        ]
    }
}