{
    "status": true,
    "data": {
        "start": 2059,
        "end": 2205,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 2059,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ بَشَّارِ بْنِ كِدَامٍ عَنْ مُحَمَّدِ بْنِ زَيْدٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْحَلِفُ حِنْثٌ أَوْ نَدَمٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Basysyar bin Kidam] dari [Muhammad bin Zaid] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hanyasanaya sumpah itu adalah dosa atau penyesalan.\""
            },
            {
                "number": 2060,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ فَقَالَ إِنْ شَاءَ اللَّهُ فَلَهُ ثُنْيَاهُ",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Abdul Azhim Al Anbari] berkata, telah menceritakan kepada kami ['Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Thawus] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah lantas mengucapkan 'Jika Allah menghendaki', maka baginya adalah sesuatu yang dikecualikan.\""
            },
            {
                "number": 2061,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ وَاسْتَثْنَى إِنْ شَاءَ رَجَعَ وَإِنْ شَاءَ تَرَكَ غَيْرُ حَانِثٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ziyad] berkata, telah menceritakan kepada kami [Abdul Warits bin Sa'id] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang bersumpah dan mengucapkan 'Insya-Allah', jika berkehendak ia boleh melakukan sumpahnya dan jika berkehendak ia boleh meninggalkannya tanpa berdosa.\""
            },
            {
                "number": 2062,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَرِوَايَةً قَالَ مَنْ حَلَفَ وَاسْتَثْنَى فَلَنْ يَحْنَثْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad Az Zuhri] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] secara riwayat, beliau bersabda: \"Barangsiapa bersumpah dengan memberi pengecualian (insyaallah), maka ia tidak berdosa.\""
            },
            {
                "number": 2063,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا غَيْلَانُ بْنُ جَرِيرٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ أَبِي مُوسَى قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ الْأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ مَا أَحْمِلُكُمْ وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ قَالَ فَلَبِثْنَا مَا شَاءَ اللَّهُ ثُمَّ أُتِيَ بِإِبِلٍ فَأَمَرَ لَنَا بِثَلَاثَةِ ذَوْدٍ غُرِّ الذُّرَى فَلَمَّا انْطَلَقْنَا قَالَ بَعْضُنَا لِبَعْضٍ أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ فَحَلَفَ أَلَّا يَحْمِلَنَا ثُمَّ حَمَلَنَا ارْجِعُوا بِنَا فَأَتَيْنَاهُ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّا أَتَيْنَاكَ نَسْتَحْمِلُكَ فَحَلَفْتَ أَنْ لَا تَحْمِلَنَا ثُمَّ حَمَلْتَنَا فَقَالَ وَاللَّهِ مَا أَنَا حَمَلْتُكُمْ بَلْ اللَّهُ حَمَلَكُمْ إِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لَا أَحْلِفُ عَلَى يَمِينٍ فَأَرَى خَيْرًا مِنْهَا إِلَّا كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ أَوْ قَالَ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَكَفَّرْتُ عَنْ يَمِينِي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah memberitakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Ghailan bin Jarir] dari [Abu Burdah] dari bapaknya [Abu Musa] ia berkata, \"Aku mendatangi Rasulullah shallallahu 'alaihi wasallam dalam sebuah rombongan orang-orang Asy'ari, mengharap agar beliau membawa kami. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Demi Allah, aku tidak akan membawa kalian, dan aku tidak mempunyai sesuatu yang bisa aku gunakan untuk membawa kalian.\" Abu Musa berkata, \"Namun kami tetap tinggal beberapa saat, hingga kemudian didatangkan seekor unta di hadapan beliau. Lalu beliau memerintahkan kepada kami untuk menunggangi tiga ekor unta yang gemuk. Ketika kami telah berangkat, sebagian kami berkata kepada sebagian yang lain, \"Kami mendatangi Rasulullah shallallahu 'alaihi wasallam mengharap agar beliau bersedia membawa kami, namun justru beliau bersumpah dan tidak mau membawa kami. Setelah itu beliau membawa kami dan bersabda: \"Kembalilah bersama kami, \" maka kami mendatangi beliau. Lantas kami berkata, \"Wahai Rasulullah, kami mendatangimu mengharap agar engkau mau membawa kami, namun engkau malah bersumpah untuk tidak membawa kami, dan setelah itu engkau membawa kami! \" beliau menjawab: \"Demi Allah, aku tidak membawa kalian, tetapi Allah lah yang telah membawa kalian. Sesungguhnya aku, demi Allah, insyaallah jika aku bersumpah atas sesuatu, kemudian melihat yang lebih baik darinya, aku akan menebus sumpahku dan kembali kepada yang lebih baik darinya, atau beliau bersabda: \"aku mengambil yang lebih baik darinya dan menebus sumpahku.\""
            },
            {
                "number": 2064,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ قَالَا حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِيِّ ابْنِ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Abdullah bin Amir bin Zurarah] keduanya berkata; telah menceritakan kepada kami [Abu Bakr bin Ayyasy] dari [Abdul Aziz bin Rufai'] dari [Tamim bin Tharafah] dari [Adi bin Hatim] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah atas sesuatu kemudian melihat yang lebih baik darinya, maka hendaklah ia mengambil yang lebih baik dan menebus sumpahnya.\""
            },
            {
                "number": 2065,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَبُو الزَّعْرَاءِ عَمْرُو بْنُ عَمْرٍو عَنْ عَمِّهِ أَبِي الْأَحْوَصِ عَوْفِ بْنِ مَالِكٍ الْجُشَمِيِّ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ يَأْتِينِي ابْنُ عَمِّي فَأَحْلِفُ أَنْ لَا أُعْطِيَهُ وَلَا أَصِلَهُ قَالَ كَفِّرْ عَنْ يَمِينِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Umar Al 'Adani] berkata, telah menceritakan kepada kami [Sufyan bin 'Uyainah] berkata, telah menceritakan kepada kami [Abu Az Za'ra Amru bin Amru] dari pamannya [Abul Ahwash Auf bin Malik Al Jusyami] dari [Bapaknya] ia berkata, \"Wahai Rasulullah, keponakanku datang kepadaku. Lalu aku bersumpah untuk tidak memberinya dan tidak menyambung tali silaturrahim.\" Beliau bersabda: \"Hendaknya kamu membayar kafarat atas sumpahmu itu.\""
            },
            {
                "number": 2066,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ حَارِثَةَ بْنِ أَبِي الرِّجَالِ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ فِي قَطِيعَةِ رَحِمٍ أَوْ فِيمَا لَا يَصْلُحُ فَبِرُّهُ أَنْ لَا يُتِمَّ عَلَى ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [Haritsah bin Abu Rajal] dari [Amrah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah untuk memutus tali silaturrahim atau pada sesuatu yang tidak ada maslahatnya, maka tindakan yang baik adalah tidak melaksanakannya.\""
            },
            {
                "number": 2067,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْمُؤْمِنِ الْوَاسِطِيُّ حَدَّثَنَا عَوْنُ بْنُ عُمَارَةَ حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَتْرُكْهَا فَإِنَّ تَرْكَهَا كَفَّارَتُهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdul Mu'min Al Wasithi] berkata, telah menceritakan kepada kami ['Aun bin Umarah] berkata, telah menceritakan kepada kami [Rauh bin Al Qasim] dari [ubaidhullah bin Umar] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah atas suatu sumpah, kemudian ia melihat sesuatu yang lebih baik darinya, maka hendaklah ia meninggalkannya (sumpah), sebab meninggalkannya adalah sebagai bentuk kafarah.\""
            },
            {
                "number": 2068,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ يَزِيدَ حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ الْبَكَّائِيُّ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ يَعْلَى الثَّقَفِيُّ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَفَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَاعٍ مِنْ تَمْرٍ وَأَمَرَ النَّاسَ بِذَلِكَ فَمَنْ لَمْ يَجِدْ فَنِصْفُ صَاعٍ مِنْ بُرٍّ",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Yazid] berkata, telah menceritakan kepada kami [Ziyad bin Abdullah Al Bakka`i] berkata, telah menceritakan kepada kami [Umar bin Abdullah bin Ya'la Ats Tsaqafi] dari [Minhal bin 'Amru] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membayar kafarat dengan satu gantang kurma, beliau juga memerintahkan orang-orang untuk melakukan seperti itu. Barangsiapa tidak mendapatinya maka setengah gantang dari gandum.\""
            },
            {
                "number": 2069,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ سُلَيْمَانَ بْنِ أَبِي الْمُغِيرَةِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ الرَّجُلُ يَقُوتُ أَهْلَهُ قُوتًا فِيهِ سَعَةٌ وَكَانَ الرَّجُلُ يَقُوتُ أَهْلَهُ قُوتًا فِيهِ شِدَّةٌ فَنَزَلَتْ{ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Sulaiman bin Abul Mughirah] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Seorang lelaki memberi makanan pokok pada keluarganya dengan berlebihan, dan ada juga yang memberi makanan pokok pada keluarganya dengan kekurangan, lalu turunlah ayat: ' Yaitu dari makanan yang biasa kamu berikan kepada keluargamu'.\" (QS. Al Maidah; 89)."
            },
            {
                "number": 2070,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الْمَعْمَرِيُّ عَنْ مَعْمَرٍ عَنْ هَمَّامٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَلَجَّ أَحَدُكُمْ فِي الْيَمِينِ فَإِنَّهُ آثَمُ لَهُ عِنْدَ اللَّهِ مِنْ الْكَفَّارَةِ الَّتِي أُمِرَ بِهَاو حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ الْوَحَاظِىُّ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] berkata, telah menceritakan kepada kami [Muhammad bin Humaid Al Ma'mari] dari [Ma'mar] dari [Hammam] ia berkata, \"Aku mendengar [Abu Hurairah] berkata, \"Abu Qasim shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian meneruskan sumpahnya maka ia akan berdosa. Dan di sisi Allah ia mempunyai kafarah sebagaimana yang telah diperintahkan.\" Telah menceritakan kepada kami [Muhammad bin Yahya] Telah menceritakan kepada kami [Yahya bin Shalih Al Wahazhi] Telah menceritakan kepada kami [Mu'awiyah bin Salam] dari [Yahya bin Abu Katsir] dari [Ikrimah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa."
            },
            {
                "number": 2071,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ عَلِيِّ بْنِ صَالِحٍ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِبْرَارِ الْمُقْسِمِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Ali bin Shalih] dari [Asy'ats bin Abu Asy Sya'tsa] dari [Mu'awiah bin Suwaid bin Muqarrin] dari [Al Bara bin Azib] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menunaikan sumpah.\""
            },
            {
                "number": 2072,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ صَفْوَانَ أَوْ صَفْوَانَ بْنِ عَبْدِ الرَّحْمَنِ الْقُرَشِيِّ قَالَلَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ جَاءَ بِأَبِيهِ فَقَالَ يَا رَسُولَ اللَّهِ اجْعَلْ لِأَبِي نَصِيبًا فِي الْهِجْرَةِ فَقَالَ إِنَّهُ لَا هِجْرَةَ فَانْطَلَقَ فَدَخَلَ عَلَى الْعَبَّاسِ فَقَالَ قَدْ عَرَفْتَنِي قَالَ أَجَلْ فَخَرَجَ الْعَبَّاسُ فِي قَمِيصٍ لَيْسَ عَلَيْهِ رِدَاءٌ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ عَرَفْتَ فُلَانًا وَالَّذِي بَيْنَنَا وَبَيْنَهُ وَجَاءَ بِأَبِيهِ لِتُبَايِعَهُ عَلَى الْهِجْرَةِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ لَا هِجْرَةَ فَقَالَ الْعَبَّاسُ أَقْسَمْتُ عَلَيْكَ فَمَدَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فَمَسَّ يَدَهُ فَقَالَ أَبْرَرْتُ عَمِّي وَلَا هِجْرَةَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ بِإِسْنَادِهِ نَحْوَهُ قَالَ يَزِيدُ بْنُ أَبِي زِيَادٍ يَعْنِي لَا هِجْرَةَ مِنْ دَارٍ قَدْ أَسْلَمَ أَهْلُهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Yazid bin Abu Ziyad] dari [Mujahid] dari ['Abdurrahman bin Shafwan] atau Shafwan bin 'Abdurrahman Al Qurasyi ia berkata, \"Ketika penaklukan kota Makkah ia datang bersama bapaknya, lalu ia berkata, \"Wahai Rasulullah, berilah bapakku pahala hijrah, \" beliau bersabda: \"Sesungguhnya sudah tidak ada hijrah lagi.\" Ia pun pergi dan menemui Al Abbas, ia berkata, \"Engkau kenal dengan aku?\" Al Abbas menjawab, \"Tentu, \" Al Abbas kemudian keluar dengan mengenakan kemeja tanpa selendang, ia lantas berkata, \"Wahai Rasulullah, engkau telah mengenal si fulan dan apa yang terjadi antara kami dengan dia. Ia datang dengan bapaknya agar engkau membai'atnya untuk hijrah.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sudah tidak ada hijrah lagi.\" Al Abbas berkata, \"Aku bersumpah atas engkau.\" Lalu Nabi shallallahu 'alaihi wasallam mengulurkan tangan dan memegang tangan Al Abbas seraya bersabda: \"Aku telah menetapi pamanku, namun tidak ada hijrah lagi.\" Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Al Hasan bin Ar Rabi'] dari [Abdullah bin Idris] dari [Yazid bin Abu Ziyad] dengan sanadnya sebagaimana dalam hadits.\" Yazid bin Abu Ziyad berkata, \"Tidak ada hijrah dari suatu negri yang penghuninya telah masuk Islam.\""
            },
            {
                "number": 2073,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَجْلَحُ الْكِنْدِيُّ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفَ أَحَدُكُمْ فَلَا يَقُلْ مَا شَاءَ اللَّهُ وَشِئْتَ وَلَكِنْ لِيَقُلْ مَا شَاءَ اللَّهُ ثُمَّ شِئْتَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami [Al Ajlah Al Kindi] dari [Yazid bin Al Asham] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian bersumpah, maka jangan mengucapkan 'Jika Allah dan kamu menghendaki'. Akan tetapi ucapkanlah 'Jika Allah menghendaki kemudian kamu'.\""
            },
            {
                "number": 2074,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ بْنِ الْيَمَانِأَنَّ رَجُلًا مِنْ الْمُسْلِمِينَ رَأَى فِي النَّوْمِ أَنَّهُ لَقِيَ رَجُلًا مِنْ أَهْلِ الْكِتَابِ فَقَالَ نِعْمَ الْقَوْمُ أَنْتُمْ لَوْلَا أَنَّكُمْ تُشْرِكُونَ تَقُولُونَ مَا شَاءَ اللَّهُ وَشَاءَ مُحَمَّدٌ وَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَمَا وَاللَّهِ إِنْ كُنْتُ لَأَعْرِفُهَا لَكُمْ قُولُوا مَا شَاءَ اللَّهُ ثُمَّ شَاءَ مُحَمَّدٌحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ الطُّفَيْلِ بْنِ سَخْبَرَةَ أَخِي عَائِشَةَ لِأُمِّهَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abdul Malik bin Umair] dari [Rib'i bin Hirasy] dari [Hudzaifah Ibnul Yaman] berkata; \"Seorang laki-laki muslim bermimpi dalam tidurnya bertemu dengan seorang yahudi, yahudi tersebut berkata, \"Sebaik-baik kaum adalah kalian, jika kalian tidak berbuat syirik. Kalian mengatakan 'Apa yang dikehendaki Allah dan yang dikehendaki Muhammad'.\" Lalu hal itu disebutkan kepada Nabi shallallahu 'alaihi wasallam, beliau pun bersabda: \"Demi Allah, aku lebih tahu dari kalian, maka ucapkanlah 'Apa yang dikehendaki Allah kemudian Muhammad'.\" Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Abdul Malik] dari [Rib'i bin Hirasy] dari [Ath Thufail bin Sakhbarah] -saudara 'Aisyah dari ibu-, dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits.\""
            },
            {
                "number": 2075,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ ح و حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ عَنْ إِسْرَائِيلَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْأَعْلَى عَنْ جَدَّتِهِ عَنْ أَبِيهَا سُوَيْدِ بْنِ حَنْظَلَةَ قَالَخَرَجْنَا نُرِيدُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَنَا وَائِلُ بْنُ حُجْرٍ فَأَخَذَهُ عَدُوٌّ لَهُ فَتَحَرَّجَ النَّاسُ أَنْ يَحْلِفُوا فَحَلَفْتُ أَنَا أَنَّهُ أَخِي فَخَلَّى سَبِيلَهُ فَأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ أَنَّ الْقَوْمَ تَحَرَّجُوا أَنْ يَحْلِفُوا وَحَلَفْتُ أَنَا أَنَّهُ أَخِي فَقَالَ صَدَقْتَ الْمُسْلِمُ أَخُو الْمُسْلِمِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [ubaidhullah bin Musa] dari [Israil]. Telah menceritakan kepada kami [Yahya bin Hakim] dari ['Abdurrahman bin Mahdi] dari [Isra`il] dari [Ibrahim bin Abdul A'la] dari [Neneknya] dari bapaknya [Suwaid bin Hanzhalah] ia berkata; \"Kami berangkat ingin menemui Rasulullah shallallahu 'alaihi wasallam, sementara kami bersama Wail bin Hujr. Kemudian ia diculik musuhnya. Kami (para sahabat) terpaksa harus bersumpah, dan saya bersumpah bahwa Wail bin Hujr saudaraku. Karena sumpahku, musuh pun membebaskan Wail untuk meneruskan perjalanan. Setiba kami di Rasulullah, kami utarakan kasus kami, yaitu para sahabat terpaksa harus bersumpah, dan aku bersumpah bahwa Wail saudaraku. Nabi membenarkan tindakan kami dan berujar 'Engkau benar, sebab seorang muslim saudara muslim lainnya.'"
            },
            {
                "number": 2076,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا هُشَيْمٌ عَنْ عَبَّادِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْيَمِينُ عَلَى نِيَّةِ الْمُسْتَحْلِفِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Husyaim] dari [Abbad bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sumpah itu bergantung dengan niat orang yang bersumpah.\""
            },
            {
                "number": 2077,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمِينُكَ عَلَى مَا يُصَدِّقُكَ بِهِ صَاحِبُكَ",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Husyaim] berkata, telah memberitakan kepada kami [Abdullah bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sumpahmu itu adalah apa yang dibenarkan oleh temanmu.\""
            },
            {
                "number": 2078,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّذْرِ وَقَالَ إِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ اللَّئِيمِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Manshur] dari [Abdullah bin Murrah] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang nadzar. Dan beliau juga bersabda: \"Hanyasanya ia dikeluarkan dari orang yang bahil.\""
            },
            {
                "number": 2079,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ النَّذْرَ لَا يَأْتِي ابْنَ آدَمَ بِشَيْءٍ إِلَّا مَا قُدِّرَ لَهُ وَلَكِنْ يَغْلِبُهُ الْقَدَرُ مَا قُدِّرَ لَهُ فَيُسْتَخْرَجُ بِهِ مِنْ الْبَخِيلِ فَيُيَسَّرُ عَلَيْهِ مَا لَمْ يَكُنْ يُيَسَّرُ عَلَيْهِ مِنْ قَبْلِ ذَلِكَ وَقَدْ قَالَ اللَّهُ أَنْفِقْ أُنْفِقْ عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yusuf] berkata, telah menceritakan kepada kami [ubaidhullah] dari [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya nadzar itu tidaklah datang kepada anak Adam kecuali sesuatu yang telah ditakdirkan atasnya. Akan tetapi sesuatu yang telah ditakdirkan itu terkalahkan oleh ketetapan takdir (yang lain), hingga ia (yang dinadzarkan) dikeluarkan dari seorang yang bakhil. Lalu dimudahkan baginya sesuatu yang sebelumnya sulit. Dan Allah berfirman: \"Berinfaklah, maka Aku akan berifak kepadamu.\""
            },
            {
                "number": 2080,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي سَهْلٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ عَمِّهِ عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَلَا نَذْرَ فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Sahl] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] berkata, telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Pamannya] dari [Imran bin Al Hushain] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada nadzar dalam bermaksiat, dan tidak ada nadzar dalam perkara yang anak Adam tidak mampu melaksanakannya.\""
            },
            {
                "number": 2081,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ أَبُو طَاهِرٍ حَدَّثَنَا ابْنُ وَهْبٍ أَنْبَأَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh Al Mishri Abu Thahir] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah memberitakan kepada kami [Yunus] dari [Ibnu Syihab] dari [Abu Salamah] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada nadzar dalam bermaksiat, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 2082,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Usamah] dari [ubaidhullah] dari [Thalhah bin Abdul Malik] dari [Al Qasim bin Muhammad] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bernadzar untuk taat kepada Allah hendaklah ia mentaati-Nya. Dan barangsiapa bernadzar untuk bermaksiat kepada-Nya, maka janganlah ia lakukan.\""
            },
            {
                "number": 2083,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْمَعِيلُ بْنُ رَافِعٍ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَذَرَ نَذْرًا وَلَمْ يُسَمِّهِ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Isma'il bin Rafi'] dari [Khalid bin Yazid] dari [Uqbah bin Amir Al Juhani] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bernadzar dengan suatu nadzar dan belum menentukan bentuk kafarahnya, maka kafarahnya adalah kafarat sumpah.\""
            },
            {
                "number": 2084,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدٍ الصَّنْعَانِيُّ حَدَّثَنَا خَارِجَةُ بْنُ مُصْعَبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَذَرَ نَذْرًا وَلَمْ يُسَمِّهِ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا لَمْ يُطِقْهُ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا أَطَاقَهُ فَلْيَفِ بِهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Abdul Malik bin Muhammad Ash Shan'ani] berkata, telah menceritakan kepada kami [Kharijah bin Mush'ab] dari [Bukair bin Abdullah bin Al Asyaj] dari [Kuraib] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa bernadzar dengan suatu nadzar dan belum menyebutkan bentuknya (kafarahnya), maka kafaratnya adalah kafarat sumpah. Barangsiapa bernadzar dengan sesuatu yang tidak mampu ia lakukan, maka kafaratnya adalah sama dengan kafarat sumpah. Dan barangsiapa bernadzar dengan suatu nadzar yang dia mampu, maka hendaklah ia tunaikan.\""
            },
            {
                "number": 2085,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَنَذَرْتُ نَذْرًا فِي الْجَاهِلِيَّةِ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَمَا أَسْلَمْتُ فَأَمَرَنِي أَنْ أُوفِيَ بِنَذْرِي",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] dari [Umar Ibnul Khtahthab] ia berkata, \"Di masa Jahiliyah aku pernah bernadzar, setelah aku masuk Islam, aku bertanya kepada Nabi shallallahu 'alaihi wasallam. Beliau memerintahkan aku untuk menunaikan nadzarku tersebut.\""
            },
            {
                "number": 2086,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَعَبْدُ اللَّهِ بْنُ إِسْحَقَ الْجَوْهَرِيُّ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ أَنْبَأَنَا الْمَسْعُودِيُّ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ بِبُوَانَةَ فَقَالَ فِي نَفْسِكَ شَيْءٌ مِنْ أَمْرِ الْجَاهِلِيَّةِ قَالَ لَا قَالَ أَوْفِ بِنَذْرِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Abdullah bin Ishaq Al Jauhari] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Raja] berkata, telah memberitakan kepada kami [Al Mas'udi] dari [Habib bin Abu Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas], \"Bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan bertanya; \"Wahai Rasulullah, sesungguhnya aku pernah bernadzar untuk berkurban di Buwanah!? Beliau bertanya: \"Apakah dalam dirimu masih melekat sesuatu dari perkara jahiliyah?\" ia menjawab, \"Tidak.\" Beliau bersabda: \"Tunaikanlah.\""
            },
            {
                "number": 2087,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الطَّائِفِيِّ عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمٍ الْيَسَارِيَّةِأَنَّ أَبَاهَا لَقِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ رَدِيفَةٌ لَهُ فَقَالَ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ بِبُوَانَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ بِهَا وَثَنٌ قَالَ لَا قَالَ أَوْفِ بِنَذْرِكَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ دُكَيْنٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ يَزِيدَ بْنِ مِقْسَمٍ عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari [Abdullah bin 'Abdurrahman Ath Tha`ifi] dari [Maimunah binti Kardam Al Yasariah] bahwa bapaknya pernah bertemu dengan Nabi shallallahu 'alaihi wasallam, sementara ia ada dibelakang bapaknya. Bapaknya berkata, \"Aku bernadzar untuk berkurban di Buwanah?\" lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah di sana ada patung?\" ia menjawab, \"Tidak.\" Beliau lalu bersabda: \"Laksanakanlah nadzarmu.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Dukain] dari [Abdullah bin 'Abdurrahman] dari [Yazid bin Miqsam] dari [Maimunah binti Kardam] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits.\""
            },
            {
                "number": 2088,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍأَنَّ سَعْدَ بْنَ عُبَادَةَ اسْتَفْتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ تُوُفِّيَتْ وَلَمْ تَقْضِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah] dari [Ibnu Abbas] berkata, \"Sa'd bin Ubadah meminta fatwa Rasulullah shallallahu 'alaihi wasallam tentang nadzar ibunya yang telah meninggal dan belum dilaksanakan, maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Lakukanlah untuknya.\""
            },
            {
                "number": 2089,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّ أُمِّي تُوُفِّيَتْ وَعَلَيْهَا نَذْرُ صِيَامٍ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَصُمْ عَنْهَا الْوَلِيُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] dari ['Amru bin Dinar] dari [Jabir bin Abdullah] berkata, \"Seorang perempuan datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Ibuku meninggal, sementara ia pernah bernadzar untuk melaksanakan puasa namun ia meninggal sebelum melaksanakan nadzarnya?\" Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Hendaklah walinya yang melakukannya.\""
            },
            {
                "number": 2090,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ عَنْ أَبِي سَعِيدٍ الرُّعَيْنِيِّ أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكٍ أَخْبَرَهُ أَنَّ عُقْبَةَ بْنَ عَامِرٍ أَخْبَرَهُأَنَّ أُخْتَهُ نَذَرَتْ أَنْ تَمْشِيَ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ وَأَنَّهُ ذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرْهَا فَلْتَرْكَبْ وَلْتَخْتَمِرْ وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [Yahya bin Sa'id] dari [ubaidhullah bin Zahr] dari [Abu Sa'id Ar Ru'aini] bahwa [Abdullah bin Malik] mengabarkan kepadanya, [Uqbah bin Amir] mengabarkan kepadanya, bahwa saudara perempuannya pernah bernadzar untuk berjalan dengan telanjang kaki dan tidak mengenakan kerudung. lalu ia ceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam hingga beliau bersabda: \"Perintahkanlah ia untuk berkendaraan, berkerudung dan berpuasa selama tiga hari.\""
            },
            {
                "number": 2091,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَرَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْخًا يَمْشِي بَيْنَ ابْنَيْهِ فَقَالَ مَا شَأْنُ هَذَا فَقَالَ ابْنَاهُ نَذْرٌ يَا رَسُولَ اللَّهِ قَالَ ارْكَبْ أَيُّهَا الشَّيْخُ فَإِنَّ اللَّهَ غَنِيٌّ عَنْكَ وَعَنْ نَذْرِكَ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Amru bin Abu Amru] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam melihat orang tua berjalan di antara kedua anaknya, beliau lantas bertanya: \"Ada apa dengan orang ini?\" kedua anaknya menjawab, \"Wahai Rasulullah, ia bernadzar.\" Beliau lalu bersabda: \"Naiklah kendaraan wahai orang tua, sesungguhnya Allah tidak butuh pengorbanan dan nadzarmu.\""
            },
            {
                "number": 2092,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا إِسْحَقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِرَجُلٍ بِمَكَّةَ وَهُوَ قَائِمٌ فِي الشَّمْسِ فَقَالَ مَا هَذَا قَالُوا نَذَرَ أَنْ يَصُومَ وَلَا يَسْتَظِلَّ إِلَى اللَّيْلِ وَلَا يَتَكَلَّمَ وَلَا يَزَالُ قَائِمًا قَالَ لِيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَجْلِسْ وَلْيُتِمَّ صَوْمَهُحَدَّثَنَا الْحُسَيْنُ ابْنُ مُحَمَّدِ بْنِ شَنْبَةَ الْوَاسِطِيُّ حَدَّثَنَا الْعَلَاءُ بْنُ عَبْدِ الْجَبَّارِ عَنْ وُهَيْبٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَاللَّهُ أَعْلَمُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Ishaq bin Muhammad Al Farwi] berkata, telah menceritakan kepada kami [Abdullah bin Umar] dari [ubaidhullah bin Umar] dari ['Atha] dari [Ibnu Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam melewati seorang lelaki di Mekkah yang sedang berdiri di bawah terik matahari. Beliau lalu bertanya: \"Apa yang sedang dilakukan lelaki ini?\" Para sahabat menjawab, \"Dia bernadzar untuk berpuasa, tidak berteduh hingga datang malam, tidak berbicara dan akan terus berdiri.\" Beliau bersabda: \"Suruhlah ia agar berbicara, berteduh, duduk dan menyempurnakan puasanya.\" Telah menceritakan kepada kami [Al Husain bin Muhammad bin Syanbah Al Wasithi] berkata, telah menceritakan kepada kami [Al 'Ala bin Abdul Jabbar] dari [Wuhaib] dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. Waallahu A'lam."
            },
            {
                "number": 2093,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَإِنَّ وَلَدَهُ مِنْ كَسْبِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] dan [Ishaq bin Ibrahim bin Habib] mereka berkata; telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesuatu yang paling baik untuk dimakan oleh seseorang adalah dari jeri payahnya. Dan anak adalah termasuk dari jeri payahnya.\""
            },
            {
                "number": 2094,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ الزُّبَيْدِيِّعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا كَسَبَ الرَّجُلُ كَسْبًا أَطْيَبَ مِنْ عَمَلِ يَدِهِ وَمَا أَنْفَقَ الرَّجُلُ عَلَى نَفْسِهِ وَأَهْلِهِ وَوَلَدِهِ وَخَادِمِهِ فَهُوَ صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Al Miqdam bin Ma'dikarib Az Zubaidi] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada yang lebih baik dari usaha seorang laki-laki kecuali dari hasil tangannya sendiri. Dan apa-apa yang diinfakkan oleh seorang laki-laki kepada diri, isteri, anak dan pembantunya adalah sedekah.\""
            },
            {
                "number": 2095,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ حَدَّثَنَا كُلْثُومُ بْنُ جَوْشَنٍ الْقُشَيْرِيُّ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّاجِرُ الْأَمِينُ الصَّدُوقُ الْمُسْلِمُ مَعَ الشُّهَدَاءِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] berkata, telah menceritakan kepada kami [Katsir bin Hisyam] berkata, telah menceritakan kepada kami [Kultsum bin Jausyan Al Qusyairi] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang pedagang yang dapat dipercaya, jujur dan muslim, maka kelak pada hari kiamat ia akan bersama para syuhada.\""
            },
            {
                "number": 2096,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيْلِيِّ عَنْ أَبِي الْغَيْثِ مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ السَّاعِي عَلَى الْأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ وَكَالَّذِي يَقُومُ اللَّيْلَ وَيَصُومُ النَّهَارَ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Abdul Aziz Ad Darawardi] dari [Tsaur bin Zaid Ad Daili] dari [Abu Al Ghaits] mantan budak Ibnu Muthi', dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang membantu orang janda dan orang miskin seperti mujahid di jalan Allah, atau seperti orang yang sholat malam dan puasa di siang hari.\""
            },
            {
                "number": 2097,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سُلَيْمَانَ عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ عَنْ أَبِيهِ عَنْ عَمِّهِ قَالَكُنَّا فِي مَجْلِسٍ فَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى رَأْسِهِ أَثَرُ مَاءٍ فَقَالَ لَهُ بَعْضُنَا نَرَاكَ الْيَوْمَ طَيِّبَ النَّفْسِ فَقَالَ أَجَلْ وَالْحَمْدُ لِلَّهِ ثُمَّ أَفَاضَ الْقَوْمُ فِي ذِكْرِ الْغِنَى فَقَالَ لَا بَأْسَ بِالْغِنَى لِمَنْ اتَّقَى وَالصِّحَّةُ لِمَنْ اتَّقَى خَيْرٌ مِنْ الْغِنَى وَطِيبُ النَّفْسِ مِنْ النَّعِيمِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Khalid bin Makhlad] berkata, telah menceritakan kepada kami [Abdullah bin Sulaiman] dari [Mu'adz bin Abdullah bin Khubaib] dari [Bapaknya] dari [Pamannya] ia berkata, \"Kami sedang duduk-duduk dalam sebuah majelis, lalu Nabi shallallahu 'alaihi wasallam datang, sementara di kepalanya masih ada sisa air mandi. Sebagian kami berkata kepada beliau, \"Hari ini kami melihatmu tampak bahagia, \" beliau lantas menjawab: \"Benar, segala puji bagi Allah.\" Setelah itu orang-orang hanyut dalam perbincangan masalah kekayaan hingga beliau pun bersabda: \"Tidak apa-apa dengan kaya bagi orang yang bertaqwa. Dan sehat bagi orang yang bertaqwa itu lebih baik dari kaya. Dan bahagia itu bagian dari kenikmatan.\""
            },
            {
                "number": 2098,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ الْأَنْصَارِيِّ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجْمِلُوا فِي طَلَبِ الدُّنْيَا فَإِنَّ كُلًّا مُيَسَّرٌ لِمَا خُلِقَ لَهُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Umarah bin Ghaziyyah] dari [Rabi'ah bin Abu 'Abdurrahman] dari [Abdul Malik bin Sa'id Al Anshari] dari [Abu Humaid As Sa'idi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Carilah yang baik dalam mencari dunia, karena setiap orang telah dipermudah dalam melaksanakan bagiannya.\""
            },
            {
                "number": 2099,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ بِهْرَامٍ حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عُثْمَانَ زَوْجُ بِنْتِ الشَّعْبِيِّ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ يَزِيدَ الرَّقَاشِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْظَمُ النَّاسِ هَمًّا الْمُؤْمِنُ الَّذِي يَهُمُّ بِأَمْرِ دُنْيَاهُ وَآخِرَتِهِقَالَ أَبُو عَبْد اللَّهِ هَذَا حَدِيثٌ غَرِيبٌ تَفَرَّدَ بِهِ إِسْمَعِيلُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Bihram] berkata, telah menceritakan kepada kami [Al Hasan bin Muhammad bin Utsman] -suami putri Asy Sya'bi- berkata, telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Yazid Ar Raqqasyi] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia yang paling besar semangatnya adalah orang mukmin yang punya perhatian terhadap urusan dunia dan akhiratnya.\" Abu Abdullah berkata, \"Ini adalah hadits gharib dan hanya diriwayatkan oleh Isma'il.\""
            },
            {
                "number": 2100,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّهَا النَّاسُ اتَّقُوا اللَّهَ وَأَجْمِلُوا فِي الطَّلَبِ فَإِنَّ نَفْسًا لَنْ تَمُوتَ حَتَّى تَسْتَوْفِيَ رِزْقَهَا وَإِنْ أَبْطَأَ عَنْهَا فَاتَّقُوا اللَّهَ وَأَجْمِلُوا فِي الطَّلَبِ خُذُوا مَا حَلَّ وَدَعُوا مَا حَرُمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa Al Himshi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] dari [Ibnu Juraij] dari [Abu Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai manusia, bertaqwalah kepada Allah dan carilah yang baik dalam mencari dunia. Sesungguhnya sebuah jiwa tidak akan mati hingga terpenuhi rizkinya meski tersendat-sendat. Bertaqwalah kepada Allah, carilah yang baik dalam mencari dunia, ambilah yang halal dan tinggalkan yang haram.\""
            },
            {
                "number": 2101,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا نُسَمَّى فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّمَاسِرَةَ فَمَرَّ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمَّانَا بِاسْمٍ هُوَ أَحْسَنُ مِنْهُ فَقَالَ يَا مَعْشَرَ التُّجَّارِ إِنَّ الْبَيْعَ يَحْضُرُهُ الْحَلِفُ وَاللَّغْوُ فَشُوبُوهُ بِالصَّدَقَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] dari [Qais bin Abu Gharazah] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam kami diberi julukan dengan nama Samasirah (calo), lalu Rasulullah shallallahu 'alaihi wasallam melewati kami dan memberi nama kami dengan nama yang lebih baik. Beliau bersabda: \"Wahai para pedagang, sesungguhnya perdagangan itu selalu disusupi oleh sumpah palsu, maka susupilah dengan sedekah (seakan-akan itu sebagai kafarahnya).\""
            },
            {
                "number": 2102,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ إِسْمَعِيلَ بْنِ عُبَيْدِ بْنِ رِفَاعَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ رِفَاعَةَ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا النَّاسُ يَتَبَايَعُونَ بُكْرَةً فَنَادَاهُمْ يَا مَعْشَرَ التُّجَّارِ فَلَمَّا رَفَعُوا أَبْصَارَهُمْ وَمَدُّوا أَعْنَاقَهُمْ قَالَ إِنَّ التُّجَّارَ يُبْعَثُونَ يَوْمَ الْقِيَامَةِ فُجَّارًا إِلَّا مَنْ اتَّقَى اللَّهَ وَبَرَّ وَصَدَقَ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Yahya bin Sulaim Ath Tha`ifi] dari [Abdullah bin Utsman bin Khutsaim] dari [Isma'il bin Ubaid bin Rifa'ah] dari [Bapaknya] dari Kakeknya [Rifa'ah] ia berkata, \"Saat kami keluar bersama Rasulullah shallallahu 'alaihi wasallam, ternyata ada orang-orang sedang berjual beli di pagi yang masih buta. Beliau lantas menyeru mereka: \"Wahai para pedagang.\" Tatkala mereka mengangkat pandangannya dan memanjangkan leher-leher mereka, beliau bersabda: \"Sesungguhnya para pedagang akan dibangkitkan pada hari kiamat dalam keadaan berdosa, kecuali orang yang bertaqwa kepada Allah, berbuat baik dan jujur.\""
            },
            {
                "number": 2103,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا فَرْوَةُ أَبُو يُونُسَ عَنْ هِلَالِ بْنِ جُبَيْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَصَابَ مِنْ شَيْءٍ فَلْيَلْزَمْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah] berkata, telah menceritakan kepada kami [Farwah Abu Yunus] dari [Hilal bin Jubair] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa diberi sesuatu maka tekunilah ia.\""
            },
            {
                "number": 2104,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو عَاصِمٍ أَخْبَرَنِي أَبِي عَنْ الزُّبَيْرِ بْنِ عُبَيْدٍ عَنْ نَافِعٍ قَالَكُنْتُ أُجَهِّزُ إِلَى الشَّامِ وَإِلَى مِصْرَ فَجَهَّزْتُ إِلَى الْعِرَاقِ فَأَتَيْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ فَقُلْتُ لَهَا يَا أُمَّ الْمُؤْمِنِينَ كُنْتُ أُجَهِّزُ إِلَى الشَّامِ فَجَهَّزْتُ إِلَى الْعِرَاقِ فَقَالَتْ لَا تَفْعَلْ مَا لَكَ وَلِمَتْجَرِكَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَبَّبَ اللَّهُ لِأَحَدِكُمْ رِزْقًا مِنْ وَجْهٍ فَلَا يَدَعْهُ حَتَّى يَتَغَيَّرَ لَهُ أَوْ يَتَنَكَّرَ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abu 'Ashim] berkata, telah mengabarkan kepadaku [Bapakku] dari [Az Zubair bin Ubaid] dari [Nafi'] ia berkata, \"Aku pernah mempersiapkan perbekalan untuk pergi ke Syam dan Mesir, namun aku mempersiapkan diri untuk pergi ke Iraq. Lalu aku mendatangi ['Aisyah Ummul Mukminin] dan berkata kepadanya, \"Wahai ummul mukminin, aku pernah mempersiapkan diri untuk pergi ke Syam, dan sekarang aku akan berangkat ke Iraq.\" Maka dia berkata, \"Jangan kamu lakukan, apa manfaatnya bagimu dan bagi perniagaanmu, sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Allah membuat sebab bagi seseorang tentang rizkinya dari satu arah, maka janganlah ia meninggalkannya hingga dia berubah atau hilang darinya.\""
            },
            {
                "number": 2105,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيُّ عَنْ جَدِّهِ سَعِيدِ بْنِ أَبِي أُحَيْحَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَعَثَ اللَّهُ نَبِيًّا إِلَّا رَاعِيَ غَنَمٍ قَالَ لَهُ أَصْحَابُهُ وَأَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَأَنَا كُنْتُ أَرْعَاهَا لِأَهْلِ مَكَّةَ بِالْقَرَارِيطِقَالَ سُوَيْدٌ يَعْنِي كُلَّ شَاةٍ بِقِيرَاطٍ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami ['Amru bin Yahya bin Sa'id Al Qurasyi] dari kakeknya [Sa'id bin Abu Uhaihah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah Allah mengutus seorang Nabi kecuali sebagai pengembala kambing.\" Para sahabatnya bertanya, \"Engkau sendiri bagaimana?\" Beliau menjawab: \"Aku adalah seorang penggembala kambing bagi penduduk Mekkah dengan upah beberapa qirath.\" Suwaid berkata, \"Yang dimaksudnya adalah setiap satu kambing dengan satu qirath.\""
            },
            {
                "number": 2106,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ وَالْحَجَّاجُ وَالْهَيْثَمُ بْنُ جَمِيلٍ قَالُوا حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ زَكَرِيَّا نَجَّارًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah Al Khuza'i] dan [Al Hajjaj] dan [Al Haitsam bin Jamil] mereka berkata; telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Abu Rabi'] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Zakaria adalah seorang tukang.\""
            },
            {
                "number": 2107,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَصْحَابَ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Al Qasim bin Muhammad] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya para pelukis pada hari kiamat akan disiksa. Dikatakan kepada mereka, \"Hidupkanlah apa yang telah engkau ciptakan.\""
            },
            {
                "number": 2108,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا عُمَرُ بْنُ هَارُونَ عَنْ هَمَّامٍ عَنْ فَرْقَدٍ السَّبَخِيِّ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْذَبُ النَّاسِ الصَّبَّاغُونَ وَالصَّوَّاغُونَ",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Umar bin Harun] dari [Hammam] dari [Farqad As Sabakhi] dari [Yazid bin Abdullah bin Asy Syikhir] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sedusta-dusta manusia adalah para pencelup (pewarna kain) dan orang-orang yang padai berselit lidah.\""
            },
            {
                "number": 2109,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا إِسْرَائِيلُ عَنْ عَلِيِّ بْنِ سَالِمِ بْنِ ثَوْبَانَ عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَالِبُ مَرْزُوقٌ وَالْمُحْتَكِرُ مَلْعُونٌ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] telah menceritakan kepada kami [Abu Ahmad] Telah menceritakan kepada kami [Isra`il] dari [Ali bin Salim bin Tsauban] dari [Ali bin Zaid bin Jud'an] dari [Sa'id bin Al Musayyab] dari [Umar bin Khaththab] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang mencari nafkah itu diberi rizki dan orang yang menimbun itu dilaknat.\""
            },
            {
                "number": 2110,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ بْنِ نَضْلَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْتَكِرُ إِلَّا خَاطِئٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim] dari [Sa'id Ibnul Musayyab] dari [Ma'mar bin Abdullah bin Nadllah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada yang menimbun kecuali orang yang salah.\""
            },
            {
                "number": 2111,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا الْهَيْثَمُ بْنُ رَافِعٍ حَدَّثَنِي أَبُو يَحْيَى الْمَكِّيُّ عَنْ فَرُّوخَ مَوْلَى عُثْمَانَ بْنِ عَفَّانَ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ احْتَكَرَ عَلَى الْمُسْلِمِينَ طَعَامًا ضَرَبَهُ اللَّهُ بِالْجُذَامِ وَالْإِفْلَاسِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Bakr Al Hanafi] berkata, telah menceritakan kepada kami [Al Haitsam bin Rafi'] berkata, telah menceritakan kepadaku [Abu Yahya Al Makki] dari [Farukh] -mantan budak Utsman bin Affan- dari [Umar Ibnul Khaththab] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menimbun makanan atas kaum muslimin, maka Allah akan menghukumnya dengan penyakit dan kerugian.\""
            },
            {
                "number": 2112,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ جَعْفَرِ بْنِ إِيَاسٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثِينَ رَاكِبًا فِي سَرِيَّةٍ فَنَزَلْنَا بِقَوْمٍ فَسَأَلْنَاهُمْ أَنْ يَقْرُونَا فَأَبَوْا فَلُدِغَ سَيِّدُهُمْ فَأَتَوْنَا فَقَالُوا أَفِيكُمْ أَحَدٌ يَرْقِي مِنْ الْعَقْرَبِ فَقُلْتُ نَعَمْ أَنَا وَلَكِنْ لَا أَرْقِيهِ حَتَّى تُعْطُونَا غَنَمًا قَالُوا فَإِنَّا نُعْطِيكُمْ ثَلَاثِينَ شَاةً فَقَبِلْنَاهَا فَقَرَأْتُ عَلَيْهِ الْحَمْدُ سَبْعَ مَرَّاتٍ فَبَرِئَ وَقَبَضْنَا الْغَنَمَ فَعَرَضَ فِي أَنْفُسِنَا مِنْهَا شَيْءٌ فَقُلْنَا لَا تَعْجَلُوا حَتَّى نَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَدِمْنَا ذَكَرْتُ لَهُ الَّذِي صَنَعْتُ فَقَالَ أَوَ مَا عَلِمْتَ أَنَّهَا رُقْيَةٌ اقْتَسِمُوهَا وَاضْرِبُوا لِي مَعَكُمْ سَهْمًاحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا أَبُو بِشْرٍ عَنْ ابْنِ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ قَالَ أَبُو عَبْد اللَّهِ وَالصَّوَابُ هُوَ أَبُو الْمُتَوَكِّلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Ja'far bin Iyas] dari [Abu Nadlrah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutus kami dalam sebuah ekspedisi dengan tiga puluh penunggang kuda. Lalu kami singgah pada suatu kaum, kami meminta agar mereka mau menerima kami sebagai tamu, namun mereka menolak. Kemudian pemimpin mereka disengat oleh binatang hingga mereka mendatangi kami. Mereka berkata, \"Apakah di antara kalian ada seseorang yang bisa meruqyah dari sengatan kalajengking?\" aku menjawab, \"Ya, aku bisa. Namun aku tidak akan meruqyahnya hingga kalian memberi kami kambing.\" Mereka berkata, \"Kami akan memberikan tiga puluh kambing kepada kalian.\" Kami pun sepakat dengan mereka. Kemudian aku bacakan AL HAMDULILLAH sebanyak tujuh kali, dan ia pun sembuh. Lantas kami mengambil kambing tersebut, namun ada sesuatu yang mengganjal dalam hati kami, hingga kami berkata, \"Janganlah kalian terburu-buru sehingga kita mendatangi Nabi shallallahu 'alaihi wasallam.\" Ketika kami tiba (di Madinah), aku ceritakan apa yang telah aku lakukan itu kepada beliau, beliau pun bersabda: \"Tidak tahukan kalian bahwa itu adalah ruqyah? Bagikanlah kambing itu dan berikan bagianku.\" Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Husyaim] berkata, telah menceritakan kepada kami [Abu Bisyr] dari Ibnu Abu Al Mutawakkil dari [Abu Al Mutawakkil] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits.\" (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Abu Al Mutawakkil] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits.\" Abdullah berkata, \"Yang benar, dia adalah Abu Al Mutawakkil.\""
            },
            {
                "number": 2113,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مُغِيرَةُ بْنُ زِيَادٍ الْمَوْصِلِيُّ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ الْأَسْوَدِ بْنِ ثَعْلَبَةَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَعَلَّمْتُ نَاسًا مِنْ أَهْلِ الصُّفَّةِ الْقُرْآنَ وَالْكِتَابَةَ فَأَهْدَى إِلَيَّ رَجُلٌ مِنْهُمْ قَوْسًا فَقُلْتُ لَيْسَتْ بِمَالٍ وَأَرْمِي عَنْهَا فِي سَبِيلِ اللَّهِ فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهَا فَقَالَ إِنْ سَرَّكَ أَنْ تُطَوَّقَ بِهَا طَوْقًا مِنْ نَارٍ فَاقْبَلْهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Mughirah bin Ziyad Al Maushili] dari [Ubadah bin Nusai] dari [Al Aswad bin Tsa'labah] dari [Ubadah bin Ash Shamit] ia berkata, \"Aku mengajari al-qur'an dan menulis kepada beberapa orang dari penghuni Ash Shuffah, lalu seorang dari mereka memberiku hadiah sebuah tombak. Maka aku pun berkata, \"Ini bukanlah termasuk harta, dan aku gunakan di jalan Allah. Lalu aku tanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, beliau menjawab: \"Jika engkau suka untuk dihimpit api neraka, maka terimalah.\""
            },
            {
                "number": 2114,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ثَوْرِ بْنِ يَزِيدَ حَدَّثَنَا خَالِدُ بْنُ مَعْدَانَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَلْمٍ عَنْ عَطِيَّةَ الْكَلَاعِيِّ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَعَلَّمْتُ رَجُلًا الْقُرْآنَ فَأَهْدَى إِلَيَّ قَوْسًا فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ أَخَذْتَهَا أَخَذْتَ قَوْسًا مِنْ نَارٍ فَرَدَدْتُهَا",
                "id": "Telah menceritakan kepada kami [Sahl bin Abu Sahl] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Tsaur bin Yazid] berkata, telah menceritakan kepada kami [Khalid bin Ma'dan] berkata, telah menceritakan kepadaku ['Abdurrahman bin Salm] dari ['Athiyyah Al Kala'i] dari [Ubay bin Ka'b] ia berkata, \"Aku menganjarkan al-qur'an kepada seseorang, kemudian dia memberi hadiah kepadaku satu busur panah. Lalu aku menyampaikan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Jika kamu mengambilnya berarti kamu telah mengambil busur panah dari neraka.\" Maka aku pun mengembalikannya.\""
            },
            {
                "number": 2115,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي مَسْعُودٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Muhammad bin Ash Shabbah] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Abu Bakr bin 'Abdurrahman] dari [Abu Mas'ud] berkata, \"Nabi shallallahu 'alaihi wasallam melarang kami makan hasil penjualan anjing, upah pelacur dan upah dukun.\""
            },
            {
                "number": 2116,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ طَرِيفٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ وَعَسْبِ الْفَحْلِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Tharif] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Fudlail] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Hazim] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang makan dari hasil penjualan anjing dan hasi zina.\""
            },
            {
                "number": 2117,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ أَنْبَأَنَا ابْنُ لَهِيعَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ السِّنَّوْرِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah memberitakan kepada kami [Ibnu Lahi'ah] dari [Abu Az Zubair] dari [Jabir] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang harta penjualan kucing.\""
            },
            {
                "number": 2118,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَأَعْطَاهُ أَجْرَهُتَفَرَّدَ بِهِ ابْنُ أَبِي عُمَرَ وَحْدَهُ قَالَهُ ابْن مَاجَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Umar Al Adani] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibnu Thawus] dari [Bapaknya] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam pernah melakukan bekam dan memberikan upahnya.\" Ibnu Majah berkata, \"Hadits ini hanya diriwayatkan oleh Ibnu Abu Umar.\""
            },
            {
                "number": 2119,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ أَبُو حَفْصٍ الصَّيْرَفِيُّ حَدَّثَنَا أَبُو دَاوُدَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَا حَدَّثَنَا وَرْقَاءُ عَنْ عَبْدِ الْأَعْلَى عَنْ أَبِي جَمِيلَةَ عَنْ عَلِيٍّ قَالَاحْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَنِي فَأَعْطَيْتُ الْحَجَّامَ أَجْرَهُ",
                "id": "Telah menceritakan kepada kami [Amru bin Ali Abu Hafsh Ash Shairafi] berkata, telah menceritakan kepada kami [Abu Dawud]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Ubadah Al Wasithi] berkata, telah menceritakan kepada kami [Yazid bin Harun] keduanya berkata; telah menceritakan kepada kami [Warqa] dari [Abdul A'la] dari [Abu Jamilah] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan bekam, dan beliau memerintahkan aku untuk memberi upah kepada tukang bekamnya.\""
            },
            {
                "number": 2120,
                "arab": "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ يُونُسَ عَنْ ابْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ",
                "id": "Telah menceritakan kepada kami [Abdul Hamid bin Bayan Al Wasithi] berkata, telah menceritakan kepada kami [Khalid bin Abdullah] dari [Yunus] dari [Ibnu Sirin] dari [Anas bin Malik] berkata, \"Nabi shallallahu 'alaihi wasallam melakukan bekam dan memberikan upah kepada tukang bekamnya.\""
            },
            {
                "number": 2121,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنِي الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْبِ الْحَجَّامِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Yahya bin Hamzah] berkata, telah menceritakan kepadaku [Al Auza'I] dari [Az Zuhri] dari [Abu Bakr bin 'Abdurrahman bin Al Harits bin Hisyam] dari [Abu Mas'ud Uqbah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang mengambil upah bekam.\""
            },
            {
                "number": 2122,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ حَرَامِ بْنِ مُحَيِّصَةَ عَنْ أَبِيهِأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْبِ الْحَجَّامِ فَنَهَاهُ عَنْهُ فَذَكَرَ لَهُ الْحَاجَةَ فَقَالَ اعْلِفْهُ نَوَاضِحَكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syababah bin Sawwar] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari [Haram bin Muhayyishah] dari [Bapaknya] bahwa ia pernah bertanya Nabi shallallahu 'alaihi wasallam tentang upah bekam, namun beliau melarangnya. Lalu disebutkan kepada beliau suatu kebutuhan, beliau pun bersabda: \"Berilah untuk makan untamu.\""
            },
            {
                "number": 2123,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ أَنَّهُ قَالَ قَالَ عَطَاءُ بْنُ أَبِي رَبَاحٍ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالْأَصْنَامِ فَقِيلَ لَهُ عِنْدَ ذَلِكَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُدْهَنُ بِهَا السُّفُنُ وَيُدْهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ قَالَ لَا هُنَّ حَرَامٌ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ حَرَّمَ عَلَيْهِمْ الشُّحُومَ فَأَجْمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ",
                "id": "Telah menceritakan kepada kami [Isa bin Hammad Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Yazid bin Abu Habib] Bahwasanya ia berkata; ['Atha bin Abu Rabah] berkata, \"Aku mendengar [Jabir bin Abdullah] berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam berada di Makkah saat pembukaan kota Makkah, beliau bersabda: \"Sesungguhnya Allah dan Rasul-Nya telah mengharamkan penjualan khamer, bangkai, babi dan patung.\" Lalu dikatakan kepada beliau, \"Wahai Rasulullah, bagaimana dengan lemak bangkai? Ia bisa digunakan sebagai pelumas kapal, pelumas kulit dan minyak untuk lampu mereka.\" beliau menjawab: \"Itu tidak haram.\" Kemudian beliau melanjutkan: \"Semoga Allah memerangi orang-orang yahudi, sesungguhnya Allah telah mengharamkan lemak atas mereka. Maka cairkanlah (lemak tersebut hingga keluar minyaknya), kemudian jual dan makanlah dari hasilnya.\""
            },
            {
                "number": 2124,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ عَنْ عَاصِمٍ عَنْ أَبِي الْمُهَلَّبِ عَنْ عُبَيْدِ اللَّهِ الْإِفْرِيقِيِّ عَنْ أَبِي أُمَامَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْمُغَنِّيَاتِ وَعَنْ شِرَائِهِنَّ وَعَنْ كَسْبِهِنَّ وَعَنْ أَكْلِ أَثْمَانِهِنَّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Yahya bin Sa'id Al Qaththan] berkata, telah menceritakan kepada kami [Hasyim bin Al Qasim] berkata, telah menceritakan kepada kami [Abu Ja'far Ar Razi] dari ['Ashim] dari [Abul Muhallab] dari [ubaidhullah Al Ifriqi] dari [Abu Umamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang menjual para wanita penyanyi, membelinya, mengambil keuntungannya dan memakan harganya.\""
            },
            {
                "number": 2125,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Usamah] dari [ubaidhullah bin Umar] dari [Khubaib bin 'Abdurrahman] dari [Hafsh bin Ashim] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari dua model jual beli; Mulamasah dan Munabadzah.\" "
            },
            {
                "number": 2126,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَسَهْلُ بْنُ أَبِي سَهْلٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِزَادَ سَهْلٌ قَالَ سُفْيَانُ الْمُلَامَسَةُ أَنْ يَلْمِسَ الرَّجُلُ بِيَدِهِ الشَّيْءَ وَلَا يَرَاهُ وَالْمُنَابَذَةُ أَنْ يَقُولَ أَلْقِ إِلَيَّ مَا مَعَكَ وَأُلْقِي إِلَيْكَ مَا مَعِي",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Sahl bin Abu Sahl] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari ['Atha bin Yazid Al laitsi] dari [Abu Sa'id Al Khudri] berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang jual beli dengan sistem mulamasah dan menabadzah.\" Sahl menambahkan, \"Sufyan berkata, \"Mulamasah adalah seseorang memegang barang (dagangan) tanpa memperhatikannya. Sedangkan munabadzah, seseorang mengatakan, 'lemparkanlah barang milikmu kepadaku, maka aku akan melempar barang milikku'.\""
            },
            {
                "number": 2127,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian bertrasasaksi atas transaksi saudaranya.\""
            },
            {
                "number": 2128,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلَا يَسُومُ عَلَى سَوْمِ أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah seorang laki-laki melakukan transaksi atas transaksi saudaranya, atau menawar atas tawaran saudaranya.\""
            },
            {
                "number": 2129,
                "arab": "قَرَأْتُ عَلَى مُصْعَبِ بْنِ عَبْدِ اللَّهِ الزُّبَيْرِيِّ عَنْ مَالِكٍ ح و حَدَّثَنَا أَبُو حُذَافَةَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّجْشِ",
                "id": "Aku membaca di hadapan [Mush'ab bin Abdullah Az Zubairi] dari [Malik]. (dan diriwayatkan dari jalur lain) Telah menceritakan kepada kami [Abu Hudzafah] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam melarang jual beli dengan cara Najasy (menambah harga untuk menipu pembeli).\""
            },
            {
                "number": 2130,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَسَهْلُ بْنُ أَبِي سَهْلٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنَاجَشُوا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Sahl bin Abu Sahl] keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian jual beli dengan cara Najasy (menambah harga untuk menipu pembeli).\""
            },
            {
                "number": 2131,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ حَاضِرٌ لِبَادٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah orang kota menjual kepada orang kampung.\""
            },
            {
                "number": 2132,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah orang kota menjual kepada orang kampung. Biarkanlah mereka, Allah akan memberi rizki mereka dengan perantara sesama mereka.\""
            },
            {
                "number": 2133,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعَ حَاضِرٌ لِبَادٍقُلْتُ لِابْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لَا يَكُونُ سِمْسَارًا",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Abdul Azhim Al 'Anbari] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [Bapaknya] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang orang kota menjual kepada orang kampung.\" Aku bertanya Ibnu Abbas, \"Apa maksud sabda beliau 'orang kota menjual kepada orang kampung'?\" ia menjawab, \"Jangan sampai ia menjadi calo.\""
            },
            {
                "number": 2134,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَلَقَّوْا الْأَجْلَابَ فَمَنْ تَلَقَّى مِنْهُ شَيْئًا فَاشْتَرَى فَصَاحِبُهُ بِالْخِيَارِ إِذَا أَتَى السُّوقَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian menghadang kafilah dagang, barangsiapa menghadang dan membeli sesuatu darinya, maka jika tiba di pasar pemiliknya boleh memilih.\""
            },
            {
                "number": 2135,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تَلَقِّي الْجَلَبِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang untuk menghadang kafilah dagang (sebelum sampai pasar).\""
            },
            {
                "number": 2136,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَحَمَّادُ بْنُ مَسْعَدَةَ عَنْ سُلَيْمَانَ التَّيْمِيِّ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبِ بْنِ الشَّهِيدِ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ قَالَ سَمِعْتُ أَبِي قَالَ حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تَلَقِّي الْبُيُوعِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dan [Hammad bin Mas'adah] dari [Sulaiman At Taimi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim bin Habib bin Asy Syahid] berkata, telah menceritakan kepada kami [Mu'tamir bin Sulaiman] ia berkata, \"Aku mendengar [Bapakku] berkata; telah menceritakan kepada kami [Abu Utsman An Nahdi] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang menghadang kafilah dagang.\""
            },
            {
                "number": 2137,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَبَايَعَ الرَّجُلَانِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا وَكَانَا جَمِيعًا أَوْ يُخَيِّرَ أَحَدُهُمَا الْآخَرَ فَإِنْ خَيَّرَ أَحَدُهُمَا الْآخَرَ فَتَبَايَعَا عَلَى ذَلِكَ فَقَدْ وَجَبَ الْبَيْعُ وَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا الْبَيْعَ فَقَدْ وَجَبَ الْبَيْعُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Abdullah bin Umar] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Jika dua orang saling bertransaksi, maka setiap dari keduanya mempunyai hak pilih selama belum berpisah. Keduanya, atau masing-masing di antara keduanya sama-sama mempunyai hak pilih (untuk meneruskan atau membatalkan jual beli). Jika salah satunya memberi tawaran lantas keduanya terjadi kesepakatan, maka jual beli telah berlaku. Jika keduanya berpisah setelah terjadi kesepakatan, dan salah satunya tidak menggagalkan transaksi, jual beli telah berlaku.\""
            },
            {
                "number": 2138,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ وَأَحْمَدُ بْنُ الْمِقْدَامِ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ جَمِيلِ بْنِ مُرَّةَ عَنْ أَبِي الْوَضِيءِ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] dan [Ahmad Ibnul Miqdam] keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Jamil bin Murrah] dari [Abu Al Wadli'i] dari [Abu Barzah Al Aslami] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang melakukan jual beli mempunyai pilihan selama keduanya belum berpisah.\""
            },
            {
                "number": 2139,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Ishaq bin Manshur] keduanya berkata; telah menceritakan kepada kami [Abdu Ash Shamad] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Al Hasan] dari [Samurah] ia berkata, \"Rasululullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang melakukan jual beli mempunyai pilihan selama keduanya belum berpisah.\""
            },
            {
                "number": 2140,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى وَأَحْمَدُ بْنُ عِيسَى الْمِصْرِيَّانِ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَاشْتَرَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ رَجُلٍ مِنْ الْأَعْرَابِ حِمْلَ خَبَطٍ فَلَمَّا وَجَبَ الْبَيْعُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْتَرْ فَقَالَ الْأَعْرَابِيُّ عَمْرَكَ اللَّهَ بَيِّعًا",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] dan [Ahmad bin Isa] keduanya dari Mesir, mereka berkata; telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Ibnu Juraij] dari [Abu Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membeli tempat wadah air susu dari seorang arab dusun. Ketika jual beli telah berlaku, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pilihlah.\" Arab dusun itu berkata, \"Semoga Allah memberimu umur panjang dalam berjual beli.\""
            },
            {
                "number": 2141,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ دَاوُدَ بْنِ صَالِحٍ الْمَدِينِيِّ عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْبَيْعُ عَنْ تَرَاضٍ",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Al Walid Ad Dimasyqi] berkata, telah menceritakan kepada kami [Marwan bin Muhammad] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Dawud bin Shalih Al Madini] dari [Bapaknya] berkata; aku mendengar [Abu Sa'id] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hanyasanya jual beli berlaku dengan saling ridla.\""
            },
            {
                "number": 2142,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا ابْنُ أَبِي لَيْلَى عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِأَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ بَاعَ مِنْ الْأَشْعَثِ بْنِ قَيْسٍ رَقِيقًا مِنْ رَقِيقِ الْإِمَارَةِ فَاخْتَلَفَا فِي الثَّمَنِ فَقَالَ ابْنُ مَسْعُودٍ بِعْتُكَ بِعِشْرِينَ أَلْفًا وَقَالَ الْأَشْعَثُ بْنُ قَيْسٍ إِنَّمَا اشْتَرَيْتُ مِنْكَ بِعَشْرَةِ آلَافٍ فَقَالَ عَبْدُ اللَّهِ إِنْ شِئْتَ حَدَّثْتُكَ بِحَدِيثٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَاتِهِ قَالَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا اخْتَلَفَ الْبَيِّعَانِ وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ وَالْبَيْعُ قَائِمٌ بِعَيْنِهِ فَالْقَوْلُ مَا قَالَ الْبَائِعُ أَوْ يَتَرَادَّانِ الْبَيْعَ قَالَ فَإِنِّي أَرَى أَنْ أَرُدَّ الْبَيْعَ فَرَدَّهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Muhammad bin Ash Shabbah] keduanya berkata; telah menceritakan kepada kami [Husyaim] berkata, telah memberitakan kepada kami [Ibnu Abu Laila] dari [Al Qasim bin 'Abdurrahman] dari [Bapaknya] bahwa Abdullah bin Mas'ud menjual seorang budak kepada Al Asy'ats bin Qais, namun keduanya berselisih dalam menentukan harga. Ibnu Mas'ud berkata, \"Aku menjual ini kepadamu dengan harga dua puluh ribu, \" sementara Al Asy'ats bin Qais berkata, \"Aku membelinya darimu dengan harga sepuluh ribu.\" [Abdullah bin Mas'ud] kemudian berkata, \"Jika engkau mau maka akan aku bacakan sebuah hadits yang aku dengar dari Rasulullah shallallahu 'alaihi wasallam, \" Al Asy'ats berkata, \"Silahkan.\" Abdullah bin Mas'ud berkata, \"Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dalam jual beli terjadi perselisihan antara kedua belah dan tidak ada bukti di antara keduanya padahal transaksi telah terjadi, ucapan yang dijadikan pedoman adalah ucapan penjual, atau pembeli dan penjual sama-sama menarik pembayaran dan barangnya.\" Asy'ats menjawab, \"Aku sependapat untuk mengembalikan barang, \" lalu ia pun melakukannya.\""
            },
            {
                "number": 2143,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ قَالَ سَمِعْتُ يُوسُفَ بْنَ مَاهَكَ يُحَدِّثُ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ الرَّجُلُ يَسْأَلُنِي الْبَيْعَ وَلَيْسَ عِنْدِي أَفَأَبِيعُهُ قَالَ لَا تَبِعْ مَا لَيْسَ عِنْدَكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] ia berkata; aku mendengar [Yusuf bin Mahak] menceritakan dari [Hakim bin Hizam] ia berkata, \"Aku berkata, \"Wahai Rasulullah, seorang laki-laki memintaku untuk menjual, sementara aku tidak mempunyai sesuatu, maka apakah boleh aku menjualnya?\" beliau menjawab: \"Janganlah engkau menjual sesuatu yang bukan milikmu.\""
            },
            {
                "number": 2144,
                "arab": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ قَالَا حَدَّثَنَا أَيُّوبُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ بَيْعُ مَا لَيْسَ عِنْدَكَ وَلَا رِبْحُ مَا لَمْ يُضْمَنْ",
                "id": "Telah menceritakan kepada kami [Azhar bin Marwan] ia berkata; telah menceritakan kepada kami [Hammad bin Zaid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] keduanya berkata; telah menceritakan kepada kami [Ayyub] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal menjual sesuatu yang tidak engkau miliki, dan tidak ada keuntungan pada sesuatu yang belum ada jaminan.\""
            },
            {
                "number": 2145,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ عَنْ لَيْثٍ عَنْ عَطَاءٍ عَنْ عَتَّابِ بْنِ أَسِيدٍ قَالَلَمَّا بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ نَهَاهُ عَنْ شِفِّ مَا لَمْ يُضْمَنْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Al Fudlail] dari [Al Laits] dari ['Atha] dari ['Attab bin Asid] ia berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam mengutusnya ke Makah, beliau melarangnya (membeli) kain apabila belum ada jaminan.\""
            },
            {
                "number": 2146,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَوْ سَمُرَةَ بْنِ جُنْدَبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] berkata, telah menceritakan kepada kami [Khalid Ibnul Harits] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Uqbah bin Amir] atau [Samurah bin Jundab] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Laki-laki mana saja yang menjual barang kepada dua orang, maka yang berhak adalah yang pertama.\""
            },
            {
                "number": 2147,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلَانِيُّ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَاعَ الْمُجِيزَانِ فَهُوَ لِلْأَوَّلِ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Abu Sarri Al 'Asqlani] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sa'id bin Basyir] dari [Qatadah] dari [Al Hasan] dari [Samurah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ada dua orang penawar dalam jual beli, maka yang berhak adalah yang pertama.\""
            },
            {
                "number": 2148,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ قَالَ بَلَغَنِي عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْعُرْبَانِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Malik bin Anas] berkata, telah sampai kepadaku dari ['Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] berkata, \"Nabi shallallahu 'alaihi wasallam melarang jual beli dengan sistem 'Urban (membeli dengan cara panjer, jika gagal uang tidak kembali).\""
            },
            {
                "number": 2149,
                "arab": "حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ الرُّخَامِيُّ حَدَّثَنَا حَبِيبُ بْنُ أَبِي حَبِيبٍ أَبُو مُحَمَّدٍ كَاتِبُ مَالِكِ بْنِ أَنَسٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرٍ الْأَسْلَمِيُّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْعُرْبَانِقَالَ أَبُو عَبْد اللَّهِ الْعُرْبَانُ أَنْ يَشْتَرِيَ الرَّجُلُ دَابَّةً بِمِائَةِ دِينَارٍ فَيُعْطِيَهُ دِينَارَيْنِ عُرْبُونًا فَيَقُولُ إِنْ لَمْ أَشْتَرِ الدَّابَّةَ فَالدِّينَارَانِ لَكَ وَقِيلَ يَعْنِي وَاللَّهُ أَعْلَمُ أَنْ يَشْتَرِيَ الرَّجُلُ الشَّيْءَ فَيَدْفَعَ إِلَى الْبَائِعِ دِرْهَمًا أَوْ أَقَلَّ أَوْ أَكْثَرَ وَيَقُولَ إِنْ أَخَذْتُهُ وَإِلَّا فَالدِّرْهَمُ لَكَ",
                "id": "Telah menceritakan kepada kami [Al Fadll bin Ya'qub Ar Rukhami] berkata, telah menceritakan kepada kami [Habib bin Abu Habib Abu Muhammad] -juru tulis Malik bin Anas- berkata, telah menceritakan kepada kami [Abdullah bin Amir Al Aslami] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] berkata, \"Nabi shallallahu 'alaihi wasallam telah melarang jual beli dengan sistem 'Urban.\" Abu Abdullah berkata, \"'Urban adalah seperti jika seorang laki-laki membeli seekor binatang dengan seratus dinar, lalu ia memberikan dua dinar sebagai panjer. Lalu ia berkata, \"Jika aku tidak jadi beli, maka uang dua dinar tersebut menjadi milikmu.\" Dan dikatakan, \"(Yakni) Allah lebih tahu dengan seorang laki-laki yang membeli sesuatu, lalu kepada sang penjual ia menyerahkan uang satu dirham, atau kurang dari itu, atau lebih banyak dari itu, lalu ia mengatakan, \"Jika aku mengambil barang tersebut maka transaksi jadi, jika tidak maka uang satu dirham itu menjadi milikmu.\""
            },
            {
                "number": 2150,
                "arab": "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْغَرَرِ وَعَنْ بَيْعِ الْحَصَاةِ",
                "id": "Telah menceritakan kepada kami [Muhriz bin Salamah Al 'Adani] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [ubaidhullah] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang jual beli gharar (menimbulkan kerugian bagi orang lain) dan jual beli hashah.\" "
            },
            {
                "number": 2151,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ قَالَا حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا أَيُّوبُ بْنُ عُتْبَةَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْغَرَرِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] dan [Al Abbas bin Abdul Azhim Al Anbari] keduanya berkata; telah menceritakan kepada kami [Aswad bin Amir] berkata, telah menceritakan kepada kami [Ayyub bin Utbah] dari [Yahya bin Abu Katsir] dari ['Atha] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang jual beli gharar (menimbulkan kerugian bagi orang lain).\""
            },
            {
                "number": 2152,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ حَدَّثَنَا جَهْضَمُ بْنُ عَبْدِ اللَّهِ الْيَمَانِيُّ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْبَاهِلِيِّ عَنْ مُحَمَّدِ بْنِ زَيْدٍ الْعَبْدِيِّ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شِرَاءِ مَا فِي بُطُونِ الْأَنْعَامِ حَتَّى تَضَعَ وَعَمَّا فِي ضُرُوعِهَا إِلَّا بِكَيْلٍ وَعَنْ شِرَاءِ الْعَبْدِ وَهُوَ آبِقٌ وَعَنْ شِرَاءِ الْمَغَانِمِ حَتَّى تُقْسَمَ وَعَنْ شِرَاءِ الصَّدَقَاتِ حَتَّى تُقْبَضَ وَعَنْ ضَرْبَةِ الْغَائِصِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Hatim bin Isma'il] berkata, telah menceritakan kepada kami [Jahdlam bin Abdullah Al Yamani] dari [Muhammad bin Ibrahim Al Bahili] dari [Muhammad bin Zaid Al Abdi] dari [Syahr bin Hausyab] dari [Abu Sa'id Al Khudri] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang membeli sesuatu yang masih di dalam perut binatang hingga ia melahirkan, dan apa yang ada dalam kantung susunya kecuali dengan takaran. Dan dari membeli budak yang melarikan diri, membeli harta rampasan perang hingga dibagikan, membeli harta sedekah hingga dibagikan dan dari membeli hasil seorang penyelam (karena belum jelas hasilnya).\""
            },
            {
                "number": 2153,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub] dari [Sa'id bin Jubair] dari [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang menjual anak (binatang) yang masih dalam kandungan.\""
            },
            {
                "number": 2154,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَخْضَرُ بْنُ عَجْلَانَ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَجُلًا مِنْ الْأَنْصَارِ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُهُ فَقَالَ لَكَ فِي بَيْتِكَ شَيْءٌ قَالَ بَلَى حِلْسٌ نَلْبَسُ بَعْضَهُ وَنَبْسُطُ بَعْضَهُ وَقَدَحٌ نَشْرَبُ فِيهِ الْمَاءَ قَالَ ائْتِنِي بِهِمَا قَالَ فَأَتَاهُ بِهِمَا فَأَخَذَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ ثُمَّ قَالَ مَنْ يَشْتَرِي هَذَيْنِ فَقَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمٍ قَالَ مَنْ يَزِيدُ عَلَى دِرْهَمٍ مَرَّتَيْنِ أَوْ ثَلَاثًا قَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمَيْنِ فَأَعْطَاهُمَا إِيَّاهُ وَأَخَذَ الدِّرْهَمَيْنِ فَأَعْطَاهُمَا الْأَنْصَارِيَّ وَقَالَ اشْتَرِ بِأَحَدِهِمَا طَعَامًا فَانْبِذْهُ إِلَى أَهْلِكَ وَاشْتَرِ بِالْآخَرِ قَدُومًا فَأْتِنِي بِهِ فَفَعَلَ فَأَخَذَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَدَّ فِيهِ عُودًا بِيَدِهِ وَقَالَ اذْهَبْ فَاحْتَطِبْ وَلَا أَرَاكَ خَمْسَةَ عَشَرَ يَوْمًا فَجَعَلَ يَحْتَطِبُ وَيَبِيعُ فَجَاءَ وَقَدْ أَصَابَ عَشْرَةَ دَرَاهِمَ فَقَالَ اشْتَرِ بِبَعْضِهَا طَعَامًا وَبِبَعْضِهَا ثَوْبًا ثُمَّ قَالَ هَذَا خَيْرٌ لَكَ مِنْ أَنْ تَجِيءَ وَالْمَسْأَلَةُ نُكْتَةٌ فِي وَجْهِكَ يَوْمَ الْقِيَامَةِ إِنَّ الْمَسْأَلَةَ لَا تَصْلُحُ إِلَّا لِذِي فَقْرٍ مُدْقِعٍ أَوْ لِذِي غُرْمٍ مُفْظِعٍ أَوْ دَمٍ مُوجِعٍ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami [Al Akhdlar bin Ajlan] berkata, telah menceritakan kepada kami [Abu Bakr Al Hanafi] dari [Anas bin Malik] berkata, \"Seorang lelaki Anshar datang kepada Nabi shallallahu 'alaihi wasallam dan meminta kepada Beliau. Maka beliau pun bertanya kepadanya: \"Apakah di rumahmu ada sesuatu?\" Ia menjawab, \"Ya. Sebuah alas pelana yang sebagian kami pakai dan sebagian lagi kami bentangkan, serta sebuah gelas yang kami gunakan untuk minum air.\" Beliau bersabda: \"Berikanlah keduanya itu untukku.\" Anas berkata, \"Orang itu lantas membawa keduanya hingga Rasulullah shallallahu 'alaihi wasallam mengambilnya dengan tangannya, kemudian bersabda: \"Siapa yang mau membeli dua barang ini?\" Seorang laki-laki berkata, \"Saya mau membelinya dengan satu dirham! \" Beliau bertanya lagi: \"Siapa yang mau menambahnya?\" Beliau ulangi pertanyaan itu dua atau tiga kali. Lalu seorang laki-laki berkata, \"Saya akan membelinya dengan dua dirham.\" Lalu Beliau memberikan barang tersebut kepadanya, kemudian meminta uang pembayarannya seraya memberikannya kepada sahabat Anshar tadi. Beliau kemudian bersabda: \"Belilah makanan dengan satu dirham untuk keluargamu, dan sisanya belikanlah sebuah kapak. Setelah itu bawalah kapak itu kepadaku.\" Laki-laki itu pun melakukannya, Rasulullah shallallahu 'alaihi wasallam kemudian mengambil kapak dan memasang kayu sebagai gagangnya. Beliau lalu bersabda: \"Pergi dan carilah kayu bakar, dan selama lima belas hari ini aku tidak ingin melihatmu.\" Setelah itu, laki-laki tersebut pergi mencari kayu bakar dan menjualnya. Kemudian ia datang menemui Nabi setelah menghasilkan sepuluh dirham, beliau lalu bersabda: \"Belilah makanan dengan separuh uangmu dan belilah pakaian dengan separuh yang lain.\" Kemudian beliau bersabda: \"Ini lebih baik bagimu daripada kamu datang dan meminta-minta. Pada hari kiamat kelak meminta-minta akan menjadi titik hitam di wajahmu, maka tidak boleh meminta-minta kecuali bagi orang yang sangat fakir, atau orang yang terlilit hutang, atau darah yang menyakitkan (untuk membayar denda karena membunuh orang).\""
            },
            {
                "number": 2155,
                "arab": "حَدَّثَنَا زِيَادُ بْنُ يَحْيَى أَبُو الْخَطَّابِ حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَقَالَ مُسْلِمًا أَقَالَهُ اللَّهُ عَثْرَتَهُ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Ziyad bin Yahya Abu Al Khaththab] berkata, telah menceritakan kepada kami [Malik bin Su'air] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menerima pembatalan seorang muslim dalam jual beli, maka pada hari kiamat Allah akan mengampuni dosa-dosanya.\""
            },
            {
                "number": 2156,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ وَحُمَيْدٌ وَثَابِتٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَغَلَا السِّعْرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ قَدْ غَلَا السِّعْرُ فَسَعِّرْ لَنَا فَقَالَ إِنَّ اللَّهَ هُوَ الْمُسَعِّرُ الْقَابِضُ الْبَاسِطُ الرَّازِقُ إِنِّي لَأَرْجُو أَنْ أَلْقَى رَبِّي وَلَيْسَ أَحَدٌ يَطْلُبُنِي بِمَظْلَمَةٍ فِي دَمٍ وَلَا مَالٍ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Hajjaj] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Qatadah] dan [Humaid] dan [Tsabit] dari [Anas bin Malik] ia berkata, \"Pernah terjadi kenaikan harga pada masa Rasulullah shallallahu 'alaihi wasallam, maka orang-orang pun berkata, \"Wahai Rasulullah, harga-harga telah melambung tinggi, maka tetapkanlah setandar harga untuk kami.\" Beliau lalu bersabda: \"Sesungguhnya Allah lah yang menentukan harga, yang menyempitkan dan melapangkan, dan Dia yang memberi rizki. Sungguh, aku berharap ketika berjumpa dengan Allah tidak ada seseorang yang meminta pertanggungjawaban dariku dalam hal darah dan harta.\""
            },
            {
                "number": 2157,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَغَلَا السِّعْرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا لَوْ قَوَّمْتَ يَا رَسُولَ اللَّهِ قَالَ إِنِّي لَأَرْجُو أَنْ أُفَارِقَكُمْ وَلَا يَطْلُبَنِي أَحَدٌ مِنْكُمْ بِمَظْلَمَةٍ ظَلَمْتُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ziyad] berkata, telah menceritakan kepada kami [Abdul A'la] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Abu Nadlrah] dari [Abu Sa'id] ia berkata, \"Pernah terjadi kenaikan harga pada masa Rasulullah shallallahu 'alaihi wasallam, orang-orang pun berkata, \"Wahai Rasulullah, andai saja engkau standarkan saja (harganya).\" Beliau bersabda: \"Aku sangat berharap ketika berpisah dengan kalian tidak ada seorang pun dari kalian yang menuntutku karena kezhaliman yang aku lakukan.\""
            },
            {
                "number": 2158,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ أَبُو بَكْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عُلَيَّةَ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ عَطَاءِ بْنِ فَرُّوخَ قَالَ قَالَ عُثْمَانُ بْنُ عَفَّانَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْخَلَ اللَّهُ الْجَنَّةَ رَجُلًا كَانَ سَهْلًا بَائِعًا وَمُشْتَرِيًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Aban Al Balkhi Abu Bakr] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Yunus bin Ubaid] dari ['Atha bin Farukh] ia berkata; [Utsman bin Affan] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah akan memasukkan ke dalam surga seorang laki-laki yang mempermudah saat menjual atau membeli barang.\""
            },
            {
                "number": 2159,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا أَبُو غَسَّانَ مُحَمَّدُ بْنُ مُطَرِّفٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ عَبْدًا سَمْحًا إِذَا بَاعَ سَمْحًا إِذَا اشْتَرَى سَمْحًا إِذَا اقْتَضَى",
                "id": "Telah menceritakan kepada kami ['Amru bin Utsman bin Sa'id bin Katsir bin Dinar Al Himshi] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Abu Ghassan Muhammad bin Mutharrif] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menyayangi seorang hamba yang murah hati jika berjualan, bermurah hati jika membeli dan bermurah hati jika memutuskan.\""
            },
            {
                "number": 2160,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا يَعْلَى بْنُ شَبِيبٍ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ قَيْلَةَ أُمِّ بَنِي أَنْمَارٍ قَالَتْأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ عُمَرِهِ عِنْدَ الْمَرْوَةِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أَبِيعُ وَأَشْتَرِي فَإِذَا أَرَدْتُ أَنْ أَبْتَاعَ الشَّيْءَ سُمْتُ بِهِ أَقَلَّ مِمَّا أُرِيدُ ثُمَّ زِدْتُ ثُمَّ زِدْتُ حَتَّى أَبْلُغَ الَّذِي أُرِيدُ وَإِذَا أَرَدْتُ أَنْ أَبِيعَ الشَّيْءَ سُمْتُ بِهِ أَكْثَرَ مِنْ الَّذِي أُرِيدُ ثُمَّ وَضَعْتُ حَتَّى أَبْلُغَ الَّذِي أُرِيدُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَفْعَلِي يَا قَيْلَةُ إِذَا أَرَدْتِ أَنْ تَبْتَاعِي شَيْئًا فَاسْتَامِي بِهِ الَّذِي تُرِيدِينَ أُعْطِيتِ أَوْ مُنِعْتِ وَإِذَا أَرَدْتِ أَنْ تَبِيعِي شَيْئًا فَاسْتَامِي بِهِ الَّذِي تُرِيدِينَ أَعْطَيْتِ أَوْ مَنَعْتِ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Ya'la bin Syabib] dari [Abdullah bin Utsman bin Khutsaim] dari [Qailah Ummu Bani Anmar] ia berkata, \"Aku pernah mendatangi Rasulullah shallallahu 'alaihi wasallam di Marwa di salah satu umrahnya. Lalu aku berkata kepadanya, \"Ya Rasulullah, aku seorang wanita yang biasa melakukan transaksi jual beli, apabila aku ingin membeli sesuatu aku menawarnya lebih kecil dari yang aku inginkan. Kemudian aku menaikkan tawaran, lalu menaikkannya lagi hingga mencapai harga yang aku inginkan. Apabila aku ingin menjual sesuatu, maka aku tawarkan lebih banyak dari yang aku inginkan, kemudian aku menurunkannya hingga mencapai harga yang aku inginkan?! Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Jangan kamu lakukan wahai Qailah, apabila kamu ingin membeli sesuatu maka tawarlah dengan harga yang kamu inginkan, baik kamu diberi atau tidak, dan jika kamu menjual sesuatu maka tawarkanlah dengan harga yang kamu inginkan, sehingga kamu memberikan atau menahannya.\""
            },
            {
                "number": 2161,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ فَقَالَ لِي أَتَبِيعُ نَاضِحَكَ هَذَا بِدِينَارٍ وَاللَّهُ يَغْفِرُ لَكَ قُلْتُ يَا رَسُولَ اللَّهِ هُوَ نَاضِحُكُمْ إِذَا أَتَيْتُ الْمَدِينَةَ قَالَ فَتَبِيعُهُ بِدِينَارَيْنِ وَاللَّهُ يَغْفِرُ لَكَ قَالَ فَمَا زَالَ يَزِيدُنِي دِينَارًا دِينَارًا وَيَقُولُ مَكَانَ كُلِّ دِينَارٍ وَاللَّهُ يَغْفِرُ لَكَ حَتَّى بَلَغَ عِشْرِينَ دِينَارًا فَلَمَّا أَتَيْتُ الْمَدِينَةَ أَخَذْتُ بِرَأْسِ النَّاضِحِ فَأَتَيْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا بِلَالُ أَعْطِهِ مِنْ الْغَنِيمَةِ عِشْرِينَ دِينَارًا وَقَالَ انْطَلِقْ بِنَاضِحِكَ فَاذْهَبْ بِهِ إِلَى أَهْلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yazid bin Harun] dari [Al Jurairi] dari [Abu Nadlrah] dari [Jabir bin Abdullah] ia berkata, \"Ketika aku bersama Nabi shallallahu 'alaihi wasallam dalam satu peperangan, beliau bertanya kepadaku: \"Apakah kamu bersedia menjual alat penyiram ini dengan satu dinar, dan Allah akan mengampunimu?\" Aku menjawab, \"Wahai Rasulullah, alat itu akan menjadi milikmu jika aku telah sampai Madinah.\" Beliau bersabda: \"Apakah kamu bersedia menjualnya dengan dua dinar, dan Allah akan mengampunimu?\" Jabir berkata, \"Beliau terus saja menambah harga satu dinar demi satu dinar, dan di setiap penambahan satu dinar beliau mengatakan: 'Dan Allah akan mengampunimu', hingga mencapai dua puluh dinar. Ketika aku sampai Madinah, aku mengambil kepala alat penyiram dan membawanya menemui Nabi shallallahu 'alaihi wasallam, beliau lalu bersabda: \"Wahai Bilal, beri dia dua puluh dinar dari harta rampasan perang.\" Kemudian beliau bersabda lagi: \"Ambillah alat penyiram itu, dan bawalah kepada keluargamu.\""
            },
            {
                "number": 2162,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَسَهْلُ بْنُ أَبِي سَهْلٍ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَنْبَأَنَا الرَّبِيعُ بْنُ حَبِيبٍ عَنْ نَوْفَلِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِيهِ عَنْ عَلِيٍّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ السَّوْمِ قَبْلَ طُلُوعِ الشَّمْسِ وَعَنْ ذَبْحِ ذَوَاتِ الدَّرِّ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Sahl bin Abu Sahl] keduanya berkata; telah menceritakan kepada kami [ubaidhullah bin Musa] berkata, telah memberitakan kepada kami [Rabi' bin Habib] dari [Naufal bin Abdul Malik] dari [Bapaknya] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melarang menaikan harga yang telah berlaku sebelum terbitnya matahari, dan menyembelih hewan yang sedang banyak susunya.\""
            },
            {
                "number": 2163,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ وَأَحْمَدُ بْنُ سِنَانٍ قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ وَلَا يَنْظُرُ إِلَيْهِمْ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ عَلَى فَضْلِ مَاءٍ بِالْفَلَاةِ يَمْنَعُهُ ابْنَ السَّبِيلِ وَرَجُلٌ بَايَعَ رَجُلًا سِلْعَةً بَعْدَ الْعَصْرِ فَحَلَفَ بِاللَّهِ لَأَخَذَهَا بِكَذَا وَكَذَا فَصَدَّقَهُ وَهُوَ عَلَى غَيْرِ ذَلِكَ وَرَجُلٌ بَايَعَ إِمَامًا لَا يُبَايِعُهُ إِلَّا لِدُنْيَا فَإِنْ أَعْطَاهُ مِنْهَا وَفَى لَهُ وَإِنْ لَمْ يُعْطِهِ مِنْهَا لَمْ يَفِ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] dan [Ahmad bin Sinan] mereka berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga manusia yang tidak akan diajak bicara oleh Allah pada hari kiamat, tidak akan disucikan dosanya dan bagi mereka siksa yang pedih; orang yang mempunyai kelebihan air pada suatu belahan bumi lalu ia menahannya dari Ibnu sabil. Seorang laki-laki yang menjual dagangannya setelah ashar lalu ia bersumpah bahwa ia membelinya dengan harga sekian dan sekian, hingga sang pembeli percaya padahal ia bohong. Dan seorang laki-laki yang membaiat seorang pemimpin, ia tidak membaiatnya kecuali untuk mendapatkan dunia. Jika sang pemimpin memberi ia penuhi dan jika tidak memberi ia tidak menepati bai'atnya.\""
            },
            {
                "number": 2164,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْمَسْعُودِيِّ عَنْ عَلِيِّ بْنِ مُدْرِكٍ عَنْ خَرَشَةَ بْنِ الْحُرِّ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَلِيِّ بْنِ مُدْرِكٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ خَرَشَةَ بْنِ الْحُرِّ عَنْ أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اللَّهُ يَوْمَ الْقِيَامَةِ وَلَا يَنْظُرُ إِلَيْهِمْ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ فَقُلْتُ مَنْ هُمْ يَا رَسُولَ اللَّهِ فَقَدْ خَابُوا وَخَسِرُوا قَالَ الْمُسْبِلُ إِزَارَهُ وَالْمَنَّانُ عَطَاءَهُ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Al Mas'udi] dari [Ali bin Mudrik] dari [Kharasyah Ibnul Hur] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Ali bin Mudrik] dari [Abu Zur'ah bin Amru bin Jarir] dari [Khasyarah Ibnul Hur] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ada tiga manusia yang tidak akan diajak bicara oleh Allah pada hari kiamat, tidak akan disucikan dosanya dan bagi mereka siksa yang pedih, \" aku bertanya, \"Wahai Rasulullah, siapakah mereka? sungguh sia-sia dan merugilah mereka?\" beliau bersabda: \"Orang yang kain sarungnya melebihi mata kaki, orang yang mengungkit-ungkit dalam pemberian, dan orang yang melariskan dagangan dengan sumpah palsu.\""
            },
            {
                "number": 2165,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الْأَعْلَى ح و حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِي قَتَادَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّاكُمْ وَالْحَلِفَ فِي الْبَيْعِ فَإِنَّهُ يُنَفِّقُ ثُمَّ يَمْحَقُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf] berkata, telah menceritakan kepada kami [Abdul A'la]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isma'il bin Ayyasy] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Ma'bad bin Ka'b bin Malik] dari [Abu Qatadah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jauhilah oleh kalian bersumpah dalam jual beli, sesungguhnya ia mendatangkan keuntungan namun menghilangkan keberkahan.\""
            },
            {
                "number": 2166,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى نَخْلًا قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Malik bin Anas] ia berkata; telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membeli pohon kurma sementara buahnya telah matang maka buahnya untuk sang penjual, kecuali jika sang pembeli memberi syarat.\" Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa.\""
            },
            {
                "number": 2167,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ ح و حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ جَمِيعًا عَنْ ابْنِ شِهَابٍ الزُّهْرِيِّ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَاعَ نَخْلًا قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلَّذِي بَاعَهَا إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَمَنْ ابْتَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلَّذِي بَاعَهُ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibnu Syihab Az Zuhri] dari [Salim bin Abdullah bin Umar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjual pohon kurma sementara buahnya sudah matang maka buahnya bagi yang menjual, kecuali jika sang pembeli membuat persyaratan. Dan barangsiapa menjual seorang budak yang mempunyai harta, maka hartanya untuk yang menjualnya, kecuali jika sang pembeli membuat persyaratan.\""
            },
            {
                "number": 2168,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ بَاعَ نَخْلًا وَبَاعَ عَبْدًا جَمَعَهُمَا جَمِيعًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Walid] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abdu Rabbih bin Sa'id] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa menjual pohon kurma dan menjual budak, maka Allah akan mengumpulkan keduanya.\""
            },
            {
                "number": 2169,
                "arab": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ عَنْ مُوسَى بْنِ عُقْبَةَ حَدَّثَنِي إِسْحَقُ بْنُ يَحْيَى ابْنِ الْوَلِيدِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَمَرِ النَّخْلِ لِمَنْ أَبَّرَهَا إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَأَنَّ مَالَ الْمَمْلُوكِ لِمَنْ بَاعَهُ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ",
                "id": "Telah menceritakan kepada kami [Abdu Rabbih bin Khalid An Numairi Abul Mughallis] berkata, telah menceritakan kepada kami [Al Fudlail bin Sulaiman] dari [Musa bin Uqbah] berkata, telah menceritakan kepadaku [Ishaq bin Yahya bin Al Walid] dari [Ubadah bin Shamit] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah menetapkan buah kurma bagi orang yang mengelolanya kecuali jika pembeli membuat persyaratan. Dan sesungguhnya harta seorang budak itu bagi orang yang menjualnya kecuali pembeli membuat persyaratan.\""
            },
            {
                "number": 2170,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَبِيعُوا الثَّمَرَةَ حَتَّى يَبْدُوَ صَلَاحُهَا نَهَى الْبَائِعَ وَالْمُشْتَرِيَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Ibnu Umar] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: 'Janganlah kalian menjual buah-buahan hingga matang', beliau melarang penjual dan pembeli.\""
            },
            {
                "number": 2171,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Isa Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] dari [Yunus bin Yazid] dari [Ibnu Syihab] berkata, telah menceritakan kepadaku [Sa'id bin Al Musayyab] dan [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah menjual buah-buahan sehingga nampak matangnya.\""
            },
            {
                "number": 2172,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij] dari ['Atha] dari [Jabir] berkata, \"Nabi shallallahu 'alaihi wasallam melarang menjual buah hingga tampak matangnya.\""
            },
            {
                "number": 2173,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرَةِ حَتَّى تَزْهُوَ وَعَنْ بَيْعِ الْعِنَبِ حَتَّى يَسْوَدَّ وَعَنْ بَيْعِ الْحَبِّ حَتَّى يَشْتَدَّ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Hajjaj] berkata, telah menceritakan kepada kami [Hammad] dari [Humaid] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari menjual buah-buahan hingga tampak matangnya, menjual anggur hingga berwarna hitam dan dari menjual biji hingga menjadi keras.\""
            },
            {
                "number": 2174,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ السِّنِينَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Muhammad bin Ash Shabbah] keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Humaid Al A'raj] dari [Sulaiman bin 'Atiq] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang jual beli sinin.\" "
            },
            {
                "number": 2175,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَاعَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلَا يَأْخُذْ مِنْ مَالِ أَخِيهِ شَيْئًا عَلَامَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ الْمُسْلِمِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Yahya bin Hamzah] berkata, telah menceritakan kepada kami [Tsaur bin Yazid] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir bin Abdillah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjual buah-buahan lalu terkena wabah (rusak), maka janganlah mengambil dari harta saudaranya sedikitpun. Atas dasar apa salah seorang dari kalian mengambil harta saudaranya sesama muslim! \""
            },
            {
                "number": 2176,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالُوا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ قَالَجَلَبْتُ أَنَا وَمَخْرَفَةُ الْعَبْدِيُّ بَزًّا مِنْ هَجَرَ فَجَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَاوَمَنَا سَرَاوِيلَ وَعِنْدَنَا وَزَّانٌ يَزِنُ بِالْأَجْرِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا وَزَّانُ زِنْ وَأَرْجِحْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] serta [Muhammad bin Isma'il] mereka berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Simak bin Harb] dari [Suwaid bin Qais] ia berkata, \"Aku dan Makhrafah 'Abdi membawa pakaian dari Hajar, lalu Rasulullah shallallahu 'alaihi wasallam datang menemui kami dan menawar celana panjang, sementara di sisi kami ada seorang tukang timbang yang biasa menimbang untuk mendapat upah. Lalu Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Wahai tukang timbang, timbang dan tentukanlah berapa beratnya.\""
            },
            {
                "number": 2177,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ مَالِكًا أَبَا صَفْوَانَ بْنَ عُمَيْرَةَ قَالَبِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِجْلَ سَرَاوِيلَ قَبْلَ الْهِجْرَةِ فَوَزَنَ لِي فَأَرْجَحَ لِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Muhammad bin Al Walid] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] ia berkata, \"Aku mendengar [Malik Abu Shafwan bin Umairah] berkata, \"Aku membeli celana dari Rasulullah shallallahu 'alaihi wasallam sebelum hijrah, maka beliau menimbang dan menentukan beratnya untukku.\""
            },
            {
                "number": 2178,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَزَنْتُمْ فَأَرْجِحُوا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdush Shamad] berkata, telah menceritakan kepada kami [Syu'bah] dari [Muharib bin Ditsar] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian menimbang maka tentukanlah beratnya (yang sesuai).\""
            },
            {
                "number": 2179,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ وَمُحَمَّدُ بْنُ عَقِيلِ بْنِ خُوَيْلِدٍ قَالَا حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ حَدَّثَنِي أَبِي حَدَّثَنِي يَزِيدُ النَّحْوِيُّ أَنَّ عِكْرِمَةَ حَدَّثَهُ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ كَانُوا مِنْ أَخْبَثِ النَّاسِ كَيْلًا فَأَنْزَلَ اللَّهُ سُبْحَانَهُ{ وَيْلٌ لِلْمُطَفِّفِينَ }فَأَحْسَنُوا الْكَيْلَ بَعْدَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Bisyr bin Al Hakam] dan [Muhammad bin Aqil bin Khuwailid] keduanya berkata; telah menceritakan kepada kami [Ali bin Al Husain bin Waqid] berkata, telah menceritakan kepadaku [Bapakku] berkata, telah menceritakan kepadaku [Yazid An Nahwi] bahwa [Ikrimah] menceritakan kepadanya dari [Ibnu Abbas] ia berkata, \"Tatkala Nabi shallallahu 'alaihi wasallam tiba di Madinah, mereka adalah orang-orang yang paling buruk dalam menimbang. Maka Allah menurunkan ayat: '(Celakalah bagi orang-orang yang curang dalam timbangan) ', Setelah itu mereka berlaku jujur dalam timbangannya.\""
            },
            {
                "number": 2180,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ يَبِيعُ طَعَامًا فَأَدْخَلَ يَدَهُ فِيهِ فَإِذَا هُوَ مَغْشُوشٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنَّا مَنْ غَشَّ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan] dari [Al 'Ala bin 'Abdurrahman] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melewati seorang laki-laki yang sedang menjual makanan, lalu beliau memasukkan tangan ke dalamnya, dan ternyata beliau tertipu (dalam keranjang bagian bawah kosong), maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Bukan dari golongan kami orang yang menipu.\""
            },
            {
                "number": 2181,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِي دَاوُدَ عَنْ أَبِي الْحَمْرَاءِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِجَنَبَاتِ رَجُلٍ عِنْدَهُ طَعَامٌ فِي وِعَاءٍ فَأَدْخَلَ يَدَهُ فِيهِ فَقَالَ لَعَلَّكَ غَشَشْتَ مَنْ غَشَّنَا فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Yunus bin Abu Ishaq] dari [Abu Dawud] dari [Abul Hamra] ia berkata, \"Aku melihat Rasululllah shallallahu 'alaihi wasallam melewati warung seseorang yang mempunyai makanan dalam bejana. Beliau memasukkan tangannya ke dalam bejana itu, lalu beliau bersabda: \"Kenapa kamu menipu? barangsiapa menipu kami, maka dia bukan dari golongan kami.\""
            },
            {
                "number": 2182,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membeli makanan, maka janganlah ia menjualnya kembali hingga ia memegangnya.\""
            },
            {
                "number": 2183,
                "arab": "حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى اللَّيْثِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ح و حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ حَدَّثَنَا أَبُو عَوَانَةَ وَحَمَّادُ بْنُ زَيْدٍ قَالَا حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ قَالَ أَبُو عَوَانَةَ فِي حَدِيثِهِ قَالَ ابْنُ عَبَّاسٍ وَأَحْسِبُ كُلَّ شَيْءٍ مِثْلَ الطَّعَامِ",
                "id": "Telah menceritakan kepada kami [Imran bin Musa Al Laitsi] berkata, telah menceritakan kepada kami [Hammad bin Zaid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Bisyr bin Mu'adz Adl Dlarir] berkata, telah menceritakan kepada kami [Abu 'Awanah] dan [Hammad bin Zaid] keduanya berkata; telah menceritakan kepada kami [Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membeli makanan, maka janganlah ia menjualnya kembali hingga ia memegangnya.\" Abu Awanah menyebutkan dalam haditsnya, \"Ibnu Abbas berkata, \"Aku menganggap bahwa hal itu mencakup segala sesuatu yang seperti makanan.\""
            },
            {
                "number": 2184,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الطَّعَامِ حَتَّى يَجْرِيَ فِيهِ الصَّاعَانِ صَاعُ الْبَائِعِ وَصَاعُ الْمُشْتَرِي",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Ibnu Abu Laila] dari [Abu Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang menjual makanan hingga dilakukan dua penimbangan, penimbangan pertama oleh penjual, penimbangan kedua oleh pembeli.\" "
            },
            {
                "number": 2185,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكُنَّا نَشْتَرِي الطَّعَامَ مِنْ الرُّكْبَانِ جِزَافًا فَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَبِيعَهُ حَتَّى نَنْقُلَهُ مِنْ مَكَانِهِ",
                "id": "Telah menceritakan kepada kami [Sahl bin Abu Sahl] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Kami membeli makanan dari para pedagang dengan cara Jizaf (tanpa ukuran dan takaran), lalu Rasulullah shallallahu 'alaihi wasallam melarang kami untuk menjualnya kembali hingga kami memindahkannya dari tempat semula (dengan ukuran).\""
            },
            {
                "number": 2186,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ عَنْ ابْنِ لَهِيعَةَ عَنْ مُوسَى بْنِ وَرْدَانَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عُثْمَانَ بْنِ عَفَّانَ قَالَكُنْتُ أَبِيعُ التَّمْرَ فِي السُّوقِ فَأَقُولُ كِلْتُ فِي وَسْقِي هَذَا كَذَا فَأَدْفَعُ أَوْسَاقَ التَّمْرِ بِكَيْلِهِ وَآخُذُ شِفِّي فَدَخَلَنِي مِنْ ذَلِكَ شَيْءٌ فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِذَا سَمَّيْتَ الْكَيْلَ فَكِلْهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Maimun Ar Raqqi] berkata, telah menceritakan kepada kami [Abdullah bin Yazid] dari [Ibnu Lahi'ah] dari [Musa bin Wardan] dari [Sa'id Ibnul Musayyab] dari [Utsman bin Affan] ia berkata, \"Aku menjual kurma di pasar, lalu aku katakan, 'Aku menakar dalam wasaqku ini seperti ini', kemudian aku serahkan wasaq yang berisi kurma itu sesuai dengan takarannya, dan aku ambil keuntunganku. Namun ada sesuatu yang mengganjal dalam hatiku, maka aku pun bertanya Rasulullah shallallahu 'alaihi wasallam, beliau lantas menjawab: \"Jika engkau katakan dengan takaran, maka takarlah.\""
            },
            {
                "number": 2187,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْيَحْصُبِيُّ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ الْمَازِنِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كِيلُوا طَعَامَكُمْ يُبَارَكْ لَكُمْ فِيهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isma'il bin 'Ayyasy] berkata, telah menceritakan kepada kami [Muhammad bin 'Abdurrahman Al Yahshubi] dari [Abdullah bin Busr Al Mazini] ia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Timbanglah makanan kalian, maka kalian akan diberkahi.\""
            },
            {
                "number": 2188,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ الْمِقْدَامِ بْنِ مَعْدِ يكَرِبَ عَنْ أَبِي أَيُّوبَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كِيلُوا طَعَامَكُمْ يُبَارَكْ لَكُمْ فِيهِ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman bin Sa'id bin Katsir bin Dinar Al Himshi] berkata, telah menceritakan kepada kami [Baqiyah Ibnul Walid] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Al Miqdam bin Ma'diyakarib] dari [Abu Ayyub] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Timbanglah makanan kalian, maka kalian akan diberkahi.\""
            },
            {
                "number": 2189,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ سَعِيدٍ حَدَّثَنِي صَفْوَانُ بْنُ سُلَيْمٍ حَدَّثَنِي مُحَمَّدٌ وَعَلِيٌّ ابْنَا الْحَسَنِ بْنِ أَبِي الْحَسَنِ الْبَرَّادِ أَنَّ الزُّبَيْرَ بْنَ الْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ السَّاعِدِيَّ حَدَّثَهُمَا أَنَّ أَبَاهُ الْمُنْذِرَ حَدَّثَهُ عَنْ أَبِي أُسَيْدٍأَنَّ أَبَا أُسَيْدٍ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ إِلَى سُوقِ النَّبِيطِ فَنَظَرَ إِلَيْهِ فَقَالَ لَيْسَ هَذَا لَكُمْ بِسُوقٍ ثُمَّ ذَهَبَ إِلَى سُوقٍ فَنَظَرَ إِلَيْهِ فَقَالَ لَيْسَ هَذَا لَكُمْ بِسُوقٍ ثُمَّ رَجَعَ إِلَى هَذَا السُّوقِ فَطَافَ فِيهِ ثُمَّ قَالَ هَذَا سُوقُكُمْ فَلَا يُنْتَقَصَنَّ وَلَا يُضْرَبَنَّ عَلَيْهِ خَرَاجٌ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir Al Hizami] berkata, telah menceritakan kepada kami [Ishaq bin Ibrahim bin Sa'id] berkata, telah menceritakan kepadaku [Shafwan bin Sulaim] berkata, telah menceritakan kepadaku [Muhammad] dan [Ali] berkata, -keduanya putra Al Hasan bin Abu Al Hasan Al Barrad- bahwa [Zubair bin Al Mundzir bin Abu Usaid As Sa'idi] menceritakan kepada keduanya, bahwa bapaknya [Abul Mundzir] menceritakan kepadanya dari [Abu Usaid] bahwa Abu Usaid menceritakan kepadanya, Rasulullah shallallahu 'alaihi wasallam pernah pergi ke pasar Nabith, kemudian beliau melihatnya dan bersabda: \"Bukan seperti ini pasar kalian.\" Kemudian beliau pergi ke pasar lagi dan melihatnya, beliau bersabda: \"Bukan seperti ini pasar kalian.\" Kemudian kembali lagi ke pasar itu, beliau berputar mengelilinginya dan bersabda: \"Ini adalah pasar kalian, janganlah kalian saling mengurangi (takaran) dan jangan mengambil pajak.\""
            },
            {
                "number": 2190,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْعُرُوقِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْسُ بْنُ مَيْمُونٍ حَدَّثَنَا عَوْنٌ الْعُقَيْلِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ سَلْمَانَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ غَدَا إِلَى صَلَاةِ الصُّبْحِ غَدَا بِرَايَةِ الْإِيمَانِ وَمَنْ غَدَا إِلَى السُّوقِ غَدَا بِرَايَةِ إِبْلِيسَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mustamir Al 'Uruqi] berkata, telah menceritakan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Ubais bin Maimun] berkata, telah menceritakan kepada kami [Aun Al Uqaili] dari [Abu Utsman An Nahdi] dari [Salman] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa keluar di pagi hari untuk sholat subuh, maka ia berangkat dengan membawa bendera iman, dan barangsiapa keluar di pagi hari menuju pasar, maka ia berangkat dengan membawa bendera iblis.\""
            },
            {
                "number": 2191,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ مَوْلَى آلِ الزُّبَيْرِ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ حِينَ يَدْخُلُ السُّوقَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ بِيَدِهِ الْخَيْرُ كُلُّهُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ كَتَبَ اللَّهُ لَهُ أَلْفَ أَلْفِ حَسَنَةٍ وَمَحَا عَنْهُ أَلْفَ أَلْفِ سَيِّئَةٍ وَبَنَى لَهُ بَيْتًا فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Mu'adz Adl Dlarir] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Amru bin Dinar] -mantan budak keluarga Az Zubair- dari [Salim bin Abdullah bin Umar] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ketika masuk pasar mengucapkan; \"LAA ILAAHA ILLA AALLAHU WAHDAHUU LAA SYARIIKALAH LAHUL MULKU WA LAHUL HAMDU YUHYII WA YUMIITU WA HUWA HAYYUN LAA YAMUUTU BIYADIHIL KHAIRU WA HUWA 'ALAA KULLI SYAIIN QADIIR (Tidak ada Tuhan yang berhak untuk disembah selain Allah semata, tidak ada serikat bagi-Nya. Bagi-Nya kerajaan dan segala pujian, yang menghidupkan dan mematikan, dan Dia Maha hidup dan tidak akan mati. Di tangan-Nya segala kebaikan, Dia-lah yang berkuasa atas segala sesuatu). Maka Allah akan menuliskan baginya satu juta kebaikan, dihapuskan darinya satu juta keburukan, dan Allah akan membangunkan baginya rumah di surga.\""
            },
            {
                "number": 2192,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمٌ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عُمَارَةَ بْنِ حَدِيدٍ عَنْ صَخْرٍ الْغَامِدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا قَالَ وَكَانَ إِذَا بَعَثَ سَرِيَّةً أَوْ جَيْشًا بَعَثَهُمْ فِي أَوَّلِ النَّهَارِ قَالَ وَكَانَ صَخْرٌ رَجُلًا تَاجِرًا فَكَانَ يَبْعَثُ تِجَارَتَهُ فِي أَوَّلِ النَّهَارِ فَأَثْرَى وَكَثُرَ مَالُهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Husyaim] dari [Ya'la bin 'Atha] dari [Umarah bin Hadid] dari [Shakhr Al Ghamidi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, berkahilah umatku di waktu paginya.\" Shakhr Al Ghamidi berkata, \"Beliau jika mengutus ekspedisi, atau pasukan beliau memberangkatkannya di pagi hari.\" Ia (perawi) berkata, \"Shakhr Al Ghamidi adalah seorang pedagang, ia biasa mengirim barang dagangannya di pagi hari hingga beruntung dan melimpahlah hartanya.\""
            },
            {
                "number": 2193,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَدَنِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا يَوْمَ الْخَمِيسِ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Muhammad bin Utsman Al Utsmani] berkata, telah menceritakan kepada kami [Muhammad bin Maimun Al Madani] dari ['Abdurrahman bin Abu Zinad] dari [Bapaknya] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, berkahilah umatku di waktu paginya, dihari kamis.\""
            },
            {
                "number": 2194,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا إِسْحَقُ بْنُ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الْجَدْعَانِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Ishaq bin Ja'far bin Muhammad bin Ali bin Al Husain] dari ['Abdurrahman bin Abu Bakr Al Jad'ani] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Ya Allah, berkahilah umatku di waktu paginya.\""
            },
            {
                "number": 2195,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ابْتَاعَ مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا صَاعًا مِنْ تَمْرٍ لَا سَمْرَاءَ يَعْنِي الْحِنْطَةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membeli Musharrah, maka ia punya hak pilih selama tiga hari. Jika ingin mengembalikan, hendaklah ia kembalikan dengan menyertakan satu sha' kurma dan bukan samra, yakni gandum.\" "
            },
            {
                "number": 2196,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا صَدَقَةُ بْنُ سَعِيدٍ الْحَنَفِيُّ حَدَّثَنَا جُمَيْعُ بْنُ عُمَيْرٍ التَّيْمِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَيُّهَا النَّاسُ مَنْ بَاعَ مُحَفَّلَةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا مِثْلَيْ لَبَنِهَا أَوْ قَالَ مِثْلَ لَبَنِهَا قَمْحًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Syawarib] berkata, telah menceritakan kepada kami [Abdul Wahid bin Ziyad] berkata, telah menceritakan kepada kami [Shadaqah bin Sa'id Al Hanafi] berkata, telah menceritakan kepada kami [Jumai' bin Umair At Taimi] berkata, telah menceritakan kepada kami [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai manusia barangsiapa menjual Muhaffalah maka ia punya hak pilih selama tiga hari. Apabila ia mengembalikannya, hendaklah ia kembalikan dengan menyertakan dua yang sebanding dengan susunya, atau beliau mengatakan, \"gandum yang sebanding dengan susunya.\" "
            },
            {
                "number": 2197,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ جَابِرٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ قَالَأَشْهَدُ عَلَى الصَّادِقِ الْمَصْدُوقِ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ حَدَّثَنَا قَالَ بَيْعُ الْمُحَفَّلَاتِ خِلَابَةٌ وَلَا تَحِلُّ الْخِلَابَةُ لِمُسْلِمٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Al Mas'udi] dari [Jabir] dari [Abu Adl Dluha] dari [Masruq] dari [Abdullah bin Mas'ud] ia berkata: \"Aku bersaksi atas yang jujur lagi di benarkan, Abul Qasim shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Menjual muhaffalah (hewan ternak yang susunya sengaja tidak diperah hingga kelihatan besar saat akan dijual) adalah penipuan, dan penipuan tidak dihalalkan bagi seorang muslim.\""
            },
            {
                "number": 2198,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ مَخْلَدِ بْنِ خُفَافِ بْنِ إِيمَاءَ بْنِ رَحَضَةَ الْغِفَارِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ خَرَاجَ الْعَبْدِ بِضَمَانِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Ibnu Abu Dzi`b] dari [Makhlad bin Khufaf bin Ima bin Rahadlah Al Ghifari] dari [Urwah bin Az Zubair] dari ['Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam memutuskan cacat yang dimungkinkan terjadi pada budak yang dijual harus memperoleh garansi\""
            },
            {
                "number": 2199,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ الزَّنْجِيُّ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَجُلًا اشْتَرَى عَبْدًا فَاسْتَغَلَّهُ ثُمَّ وَجَدَ بِهِ عَيْبًا فَرَدَّهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ قَدْ اسْتَغَلَّ غُلَامِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَرَاجُ بِالضَّمَانِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Muslim bin Khalid Az Zanji] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] berkata, \"Seorang laki-laki membeli budak dan memanfaatkannya. Setelah itu ia mendapatkan cacat pada budak tersebut hingga ia pun mengembalikannya. Ia berkata, \"Wahai Rasulullah, ia telah memanfaatkan tenaga budakku! \" maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Kekurangan yang ada pada budakmu itu ada jaminannya.\""
            },
            {
                "number": 2200,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ إِنْ شَاءَ اللَّهُ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُهْدَةُ الرَّقِيقِ ثَلَاثَةُ أَيَّامٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Sa'id] dari [Qatadah] dari [Al Hasan] insyaallah dari [Samurah bin Jundub] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jaminan seorang budak adalah tiga hari.\""
            },
            {
                "number": 2201,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا هُشَيْمٌ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ الْحَسَنِ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عُهْدَةَ بَعْدَ أَرْبَعٍ",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Husyaim] dari [Yunus bin Ubaid] dari [Al Hasan] dari [Uqbah bin Amir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada jaminan setelah empat hari.\""
            },
            {
                "number": 2202,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي سَمِعْتُ يَحْيَى بْنَ أَيُّوبَ يُحَدِّثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَحِلُّ لِمُسْلِمٍ بَاعَ مِنْ أَخِيهِ بَيْعًا فِيهِ عَيْبٌ إِلَّا بَيَّنَهُ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Wahb bin Jarir] berkata, telah menceritakan kepada kami [Bapakku] berkata; aku mendengar [Yahya bin Ayyub] menceritakan dari [Yazid bin Abu Habib] dari ['Abdurrahman bin Syumasah] dari [Uqbah bin Amir] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Muslim satu dengan muslin lainnya itu bersaudara, maka seorang muslim tidak boleh menjual barang yang ada cacat kepada saudaranya kecuali menjelaskan kepadanya.\""
            },
            {
                "number": 2203,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الضَّحَّاكِ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ مُعَاوِيَةَ بْنِ يَحْيَى عَنْ مَكْحُولٍ وَسُلَيْمَانَ بْنِ مُوسَى عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَاعَ عَيْبًا لَمْ يُبَيِّنْهُ لَمْ يَزَلْ فِي مَقْتِ اللَّهِ وَلَمْ تَزَلْ الْمَلَائِكَةُ تَلْعَنُهُ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Adl Dlahhak] berkata, telah menceritakan kepada kami [Baqiyyah bin Al Walid] dari [Mu'awiyah bin Yahya] dari [Makhul] dan [Sulaiman bin Musa] dari [Watsilah bin Al Asyqa'] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjual barang jelek dan tidak menjelaskannya, maka ia senantiasa dalam murka Allah dan laknat para malaikat.\""
            },
            {
                "number": 2204,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ جَابِرٍ عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِالسَّبْيِ أَعْطَى أَهْلَ الْبَيْتِ جَمِيعًا كَرَاهِيَةَ أَنْ يُفَرِّقَ بَيْنَهُمْ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Jabir] dari [Al Qasim bin 'Abdurrahman] dari [Bapaknya] dari [Abdullah bin Mas'ud] ia berkata, \"Jika dihadapkan kepada Nabi shallallahu 'alaihi wasallam para tawanan, beliau mengumpulkan (setiap) keluarga besar dalam satu tempat, khawatir jika mereka berpisah.\""
            },
            {
                "number": 2205,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَفَّانُ عَنْ حَمَّادٍ أَنْبَأَنَا الْحَجَّاجُ عَنْ الْحَكَمِ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ عَلِيٍّ قَالَوَهَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُلَامَيْنِ أَخَوَيْنِ فَبِعْتُ أَحَدَهُمَا فَقَالَ مَا فَعَلَ الْغُلَامَانِ قُلْتُ بِعْتُ أَحَدَهُمَا قَالَ رُدَّهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Affan] dari [Hammad] berkata, telah memberitakan kepada kami [Al Hajjaj] dari [Al Hakam] dari [Maimun bin Abu Syabib] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memberiku hadiah dua budak bersaudara. Kemudian aku menjual seorang dari keduanya. Beliau lantas bertanya: \"Apa yang sedang dilakukan oleh kedua budak itu?\" Aku menjawab, \"Aku telah menjual salah seorang dari keduanya.\" Beliau bersabda: \"Kembalikanlah.\""
            }
        ]
    }
}