{
    "status": true,
    "data": {
        "start": 2941,
        "end": 3087,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 2941,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِ عَنْ أَبِي ذَرٍّ قَالَكَانَتْ الْمُتْعَةُ فِي الْحَجِّ لِأَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاصَّةً",
                "id": "Telah menceritakan kepada kami ['Ali bin Muhammad]; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim At Taimi] dari [Ayahnya] dari [Abu Dzar] radliallahu 'anhu, ia berkata; \"Haji tamattu hanya untuk para sahabat Muhammad shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2942,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ أَخْبَرَنِي أَبِي قَالَقُلْتُ لِعَائِشَةَ مَا أَرَى عَلَيَّ جُنَاحًا أَنْ لَا أَطَّوَّفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَتْ إِنَّ اللَّهَ يَقُولُ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا }وَلَوْ كَانَ كَمَا تَقُولُ لَكَانَ فَلَا جُنَاحَ عَلَيْهِ أَنْ لَا يَطَّوَّفَ بِهِمَا إِنَّمَا أُنْزِلَ هَذَا فِي نَاسٍ مِنْ الْأَنْصَارِ كَانُوا إِذَا أَهَلُّوا أَهَلُّوا لِمَنَاةَ فَلَا يَحِلُّ لَهُمْ أَنْ يَطَّوَّفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَلَمَّا قَدِمُوا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَجِّ ذَكَرُوا ذَلِكَ لَهُ فَأَنْزَلَهَا اللَّهُ فَلَعَمْرِي مَا أَتَمَّ اللَّهُ عَزَّ وَجَلَّ حَجَّ مَنْ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin 'Urwah]; telah mengabarkan kepadaku [Ayahku] ia berkata; \"Aku berkata kepada Aisyah; \"Kurasa tidak ada dosa bagiku, (jika aku tidak bersa'i antar Shafa dan Marwa\". [Aisyah] menjawab; \"Allah Subhanahu Wa Ta'ala berfirman: Sesungguhnya Shafa dan Marwa adalah sebagian dari syiar Allah. Maka barang siapa beribadah haji ke Baitullah atau berumrah, maka tidak ada dosa baginya untuk mengerjakan sa'i antara keduanya.\" Seandainya maknanya seperti yang kamu katakan, tentu bunyi firman-Nya (akan menjadi); Maka tidak ada dosa baginya tidak mengerjakan Sa'i di antara keduanya. Ayat ini turun kepada orang-orang Anshar yang biasa mengeraskan suara, mereka melakukannya untuk Manat, maka tidak boleh bagi mereka untuk bersa'i antara Shafa dan Marwa. Dan ketika mereka tiba bersama Nabi shallallahu 'alaihi wasallam pada sebuah musim haji, merekapun menceritakannya kepada beliau, maka Allah Subhanahu Wa Ta'ala menurunkan ayat ini. Aku bersumpah; Allah Subhanahu Wa Ta'ala tidak akan menyempurnakan haji orang yang tidak melakukan sa'i antara Shafa dan Marwa.\""
            },
            {
                "number": 2943,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أُمِّ وَلَدٍ لِشَيْبَةَ قَالَتْرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ وَهُوَ يَقُولُ لَا يُقْطَعُ الْأَبْطَحُ إِلَّا شَدًّا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Hisyam Ad Dastuwa`i] dari [Budail bin Maisarah] dari [Shafiyyah binti Syaibah] dari [Ummu Waladnya Syaibah], ia berkata; \"Aku melihat Rasulullah melakukan sa'i antara Shafa dan Marwa, dan beliau bersabda: 'Jarak (dalam sa'i) tidak terpotong kecuali dengan berlari.'"
            },
            {
                "number": 2944,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أَبِي عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ كَثِيرِ بْنِ جُمْهَانَ عَنْ ابْنِ عُمَرَ قَالَإِنْ أَسْعَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْعَى وَإِنْ أَمْشِ فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي وَأَنَا شَيْخٌ كَبِيرٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Amru bin Abdullah], keduanya berkata; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Ayahku] dari ['Atha` bin As Sa`ib] dari [Katsir bin Jumhan] dari [Ibnu Umar] radliallahu 'anhu, ia berkata; \"Jika aku bersa'i antara Shafa dan Marwa, maka terlihat olehku Rasulullah shallallahu 'alaihi wasallam bersa'i dan jika aku berjalan, maka aku telah melihat Rasulullah shallallahu 'alaihi wasallam berjalan, sedangkan aku adalah orang yang sudah tua.\""
            },
            {
                "number": 2945,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْحَسَنُ بْنُ يَحْيَى الْخُشَنِيُّ حَدَّثَنَا عُمَرُ بْنُ قَيْسٍ أَخْبَرَنِي طَلْحَةُ بْنُ يَحْيَى عَنْ عَمِّهِ إِسْحَقَ بْنِ طَلْحَةَ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْحَجُّ جِهَادٌ وَالْعُمْرَةُ تَطَوُّعٌ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar]; telah menceritakan kepada kami [Al Hasan bin Yahya Al Khusyani]; telah menceritakan kepada kami ['Umar bin Qais]; telah mengabarkan kepadaku [Thalhah bin Yahya] dari Pamannya [Ishaq bin Thalhah] dari [Thalhah bin 'Ubaidillah] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Haji adalah jihad, sedang 'umrah adalah tathawwu (tidak wajib).\""
            },
            {
                "number": 2946,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا يَعْلَى حَدَّثَنَا إِسْمَعِيلُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولُكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ اعْتَمَرَ فَطَافَ وَطُفْنَا مَعَهُ وَصَلَّى وَصَلَّيْنَا مَعَهُ وَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ لَا يُصِيبُهُ أَحَدٌ بِشَيْءٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair]; telah menceritakan kepada kami [Ya'la]; telah menceritakan kepada kami [Isma'il]; Aku mendengar dari [Abdullah bin Abu 'Aufa] berkata; \"Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam ketika beliau tengah mengerjakan sebuah umrah. Beliau melakukan thawaf, kamipun melakukannya bersama beliau. Beliau mengerjakan sholat, kami pun mengerjakannya bersama beliau. Kami melindungi beliau dari pandangan penduduk kota Makkah, agar tidak ada seorangpun (dari mereka) dapat melukai beliau.\""
            },
            {
                "number": 2947,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ بَيَانٍ وَجَابِرٌ عَنْ الشَّعْبِيِّ عَنْ وَهْبِ بْنِ خَنْبَشٍ قَالَقَالَ رَسُول اللَّه صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Sufyan] dari [Bayan] dan [Jabir] dari [Asy Sya'bi] dari [Wahb bin Khanbasy], ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Umrah di bulan Ramadhan menyamai (pahala) haji'.\""
            },
            {
                "number": 2948,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ جَمِيعًا عَنْ دَاوُدَ بْنِ يَزِيدَ الزَّعَافِرِيِّ عَنْ الشَّعْبِيِّ عَنْ هَرِمِ بْنِ خَنْبَشٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah]; telah menceritakan kepada kami [Sufyan]; Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami ['Ali bin Muhammad] dan ['Amru bin Abdullah], keduanya berkata; telah menceritakan kepada kami [Waki'] semuanya dari [Dawud bin Yazid Az Za'afiri] dari [Asy Sya'bi] dari [Harim bin Khanbasy]. Ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Umrah di bulan Ramadhan menyamai (pahala) haji'.\""
            },
            {
                "number": 2949,
                "arab": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ أَبِي مَعْقِلٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً",
                "id": "Telah menceritakan kepada kami [Jubarah bin Mughallis]; telah menceritakan kepada kami [Ibrahim bin 'Utsman] dari [Abu Ishaq] dari [Al Aswad bin Yazid] dari [Abu Maqil], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Umrah di bulan Ramadhan menyamai (pahala) haji.\""
            },
            {
                "number": 2950,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ حَجَّاجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hajjaj] dari ['Atha`] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Umrah di bulan Ramadhan menyamai (pahala) ibadah haji'.\""
            },
            {
                "number": 2951,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ بْنِ وَاقِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ عَبْدِ الْكَرِيمِ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Ahmad bin Abdul Malik bin Waqid]; telah menceritakan kepada kami [ubaidhullah bin 'Amru] dari [Abdul Karim] dari ['Atha`] dari [Jabir] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Umrah di bulan Ramadhan menyamai (pahala) mengerjakan haji.\""
            },
            {
                "number": 2952,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَمْ يَعْتَمِرْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا فِي ذِي الْقَعْدَةِ",
                "id": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah]; telah menceritakan kepada kami [Yahya bin Zakaria bin Abu Zaidah] dari [Ibnu Abu Laila] dari ['Atha`] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam belum pernah umrah kecuali di bulan Dzulqa'dah.\""
            },
            {
                "number": 2953,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ حَبِيبٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْلَمْ يَعْتَمِرْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمْرَةً إِلَّا فِي ذِي الْقَعْدَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Abdullah bin Numair] dari [Al A'masy] dari [Mujahid] dari [Habib] dari ['Urwah] dari [Aisyah] radliallahu 'anha, ia bekata; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah melakukan umrah kecuali di bulan Dzulqa'dah.\""
            },
            {
                "number": 2954,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ حَبِيبٍ يَعْنِي ابْنَ أَبِي ثَابِتٍ عَنْ عُرْوَةَ قَالَسُئِلَ ابْنُ عُمَرَ فِي أَيِّ شَهْرٍ اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي رَجَبٍ فَقَالَتْ عَائِشَةُ مَا اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَجَبٍ قَطُّ وَمَا اعْتَمَرَ إِلَّا وَهُوَ مَعَهُ تَعْنِي ابْنَ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib]; telah menceritakan kepada kami [Yahya bin Adam] dari [Abu Bakar bin 'Ayyasy] dari [Al A'masy] dari [Habib yaitu Ibnu Abu Tsabit] dari ['Urwah], ia berkata; \" [Ibnu Umar] radliallahu 'anhu ditanya; 'Pada bulan apakah Rasulullah shallallahu 'alaihi wasallam melaksanakan Umrah? ' Ia menjawab; 'Pada bulan Rajab.' Maka [Aisyah] radliallahu 'anha berkata; 'Rasulullah tidak pernah sekalipun melakukan umrah pada bulan Rajab, dan tidak pernah melakukannya kecuali ia Ibnu Umar bersama beliau'.\""
            },
            {
                "number": 2955,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو إِسْحَقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ بْنِ عُثْمَانَ بْنِ شَافِعٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ أَخْبَرَنِي عَمْرُو بْنُ أَوْسٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ فَيُعْمِرَهَا مِنْ التَّنْعِيمِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Ishaq Asy Syafi'i Ibrahim bin Muhammad bin Al 'Abbas bin 'Utsman bin Syafi'], keduanya berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru bin Dinar]; telah mengabarkan kepadaku ['Amru bin Aus]; telah menceritakan kepadaku [Abdurrahman bin Abu Bakr] bahwa Nabi shallallahu 'alaihi wasallam memerintahkannya untuk mengiringi Aisyah, lalu membawanya umrah dari Tan'im."
            },
            {
                "number": 2956,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ نُوَافِي هِلَالَ ذِي الْحِجَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَرَادَ مِنْكُمْ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهْلِلْ فَلَوْلَا أَنِّي أَهْدَيْتُ لَأَهْلَلْتُ بِعُمْرَةٍ قَالَتْ فَكَانَ مِنْ الْقَوْمِ مَنْ أَهَلَّ بِعُمْرَةٍ وَمِنْهُمْ مَنْ أَهَلَّ بِحَجٍّ فَكُنْتُ أَنَا مِمَّنْ أَهَلَّ بِعُمْرَةٍ قَالَتْ فَخَرَجْنَا حَتَّى قَدِمْنَا مَكَّةَ فَأَدْرَكَنِي يَوْمُ عَرَفَةَ وَأَنَا حَائِضٌ لَمْ أَحِلَّ مِنْ عُمْرَتِي فَشَكَوْتُ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ دَعِي عُمْرَتَكِ وَانْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ قَالَتْ فَفَعَلْتُ فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ وَقَدْ قَضَى اللَّهُ حَجَّنَا أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَأَرْدَفَنِي وَخَرَجَ إِلَى التَّنْعِيمِ فَأَحْلَلْتُ بِعُمْرَةٍ فَقَضَى اللَّهُ حَجَّنَا وَعُمْرَتَنَا وَلَمْ يَكُنْ فِي ذَلِكَ هَدْيٌ وَلَا صَدَقَةٌ وَلَا صَوْمٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata; \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam dalam haji Wada'. Kami menyempurnakan awal bulan Dzulhijjah, maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barang siapa diantara kalian ingin berniat umrah, maka segera lakukanlah. Seandainya aku tidak membawa Al Hadyu (hewan kurban) niscaya akupun berniat untuk umrah'.\" Aisyah berkata; 'Maka diantara para sahabat ada pula yang berniat umrah, dan diantara mereka ada yang berniat haji. Aku termasuk dikalangan orang yang berniat umrah.' Aisyah berkata lagi; 'Lalu kami berangkat hingga sampai di Makkah. Saat datang hari Arafah, ternyata aku haid, sedangkan belum tiba waktuku untuk bertahallul dari umrahku. Maka kuadukan hal itu kepada Nabi shallallahu 'alaihi wasallam. Lantas beliau bersabda: 'Tinggalkanlah umrahmu. Lerailah (ikatan) rambutmu, dan sisirlah, lalu berniatlah haji'. Aisyah berkata; 'Maka aku melaksanakan perintah beliau. Dan ketika datang malam melempar Jumrah, dan Allah telah menyempurnakan ibadah haji kami, Beliau shallallahu 'alaihi wasallam mengutus Abdurrahman bin Abu Bakar kepadaku, lalu mengiringiku keluar menuju Tan'im, kemudian aku bertahalul untuk umrah. Maka Allah telah menyempurnakan haji dan umrah kami. Dalam pelaksanaan haji tersebut, tidak ada hadyu, sedekah ataupun puasa.'"
            },
            {
                "number": 2957,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي سُلَيْمَانُ بْنُ سُحَيْمٍ عَنْ أُمِّ حَكِيمٍ بِنْتِ أُمَيَّةَ عَنْ أُمِّ سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَهَلَّ بِعُمْرَةٍ مِنْ بَيْتِ الْمَقْدِسِ غُفِرَ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Abdul A'la bin Abdul A'la] dari [Muhammad bin Ishaq]; telah menceritakan kepadaku [Sulaiman bin Suhaim] dari [Ummu Hakim binti Umayyah] dari [Ummu Salamah]; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang berniat 'umrah dari Baitul Maqdis, akan diampuni dosanya.\""
            },
            {
                "number": 2958,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَحْيَى بْنِ أَبِي سُفْيَانَ عَنْ أُمِّهِ أُمِّ حَكِيمٍ بِنْتِ أُمَيَّةَ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَهَلَّ بِعُمْرَةٍ مِنْ بَيْتِ الْمَقْدِسِ كَانَتْ لَهُ كَفَّارَةً لِمَا قَبْلَهَا مِنْ الذُّنُوبِ قَالَتْ فَخَرَجْتُ أَيْ مِنْ بَيْتِ الْمَقْدِسِ بِعُمْرَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa Al Himshi]; telah menceritakan kepada kami [Ahmad bin Khalid]; telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yahya bin Abu Sufyan] dari ibunya [Ummu Hakim binti Umayyah] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang berniat dari Baitul Maqdis, maka akan dihapuskan baginya dosa-dosa yang telah lalu. Ummu Salamah berkata; 'Maka aku keluar dari Baitul Maqdis untuk berumrah.'"
            },
            {
                "number": 2959,
                "arab": "حَدَّثَنَا أَبُو إِسْحَقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدٍ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَاعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ عُمَرٍ عُمْرَةَ الْحُدَيْبِيَةِ وَعُمْرَةَ الْقَضَاءِ مِنْ قَابِلٍ وَالثَّالِثَةَ مِنْ الْجِعْرَانَةِ وَالرَّابِعَةَ الَّتِي مَعَ حَجَّتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Ishaq Asy Syafi'i Ibrahim bin Muhammad]; telah menceritakan kepada kami [Dawud bin Abdurrahman] dari [Amru bin Dinar] dari ['Ikrimah] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melakukan umrah empat kali, (yaitu) umrah selepas perjanjian Hudaibiyah, umrah sebagai Qadha yaitu di tahun berikutnya, umrah yang ketiga adalah yang dikerjakan dari Ji'ranah, dan umrah yang keempat yang dilakukan bersama haji beliau."
            },
            {
                "number": 2960,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ إِسْمَعِيلَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِمِنًى يَوْمَ التَّرْوِيَةِ الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالْفَجْرَ ثُمَّ غَدَا إِلَى عَرَفَةَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Isma'il] dari ['Atha`] dari [Ibnu Abbas] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam berada di Mina pada hari Tarwiyah dan sholat Zhuhur, Ashar, Maghrib, Isya', dan Shubuh di sana. Kemudian (selepas itu) beliau pergi ke Arafah."
            },
            {
                "number": 2961,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّهُ كَانَ يُصَلِّي الصَّلَوَاتِ الْخَمْسَ بِمِنًى ثُمَّ يُخْبِرُهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya]; telah menceritakan kepada kami ['Abdurrazak]; telah memberitakan kepada kami [Abdullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwa ia mengerjakan sholat lima waktu di Mina, kemudian memberitahukan orang-orang bahwa Rasulullah shallallahu 'alaihi wasallam melakukan demikian."
            },
            {
                "number": 2962,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ أَلَا نَبْنِي لَكَ بِمِنًى بَيْتًا قَالَ لَا مِنًى مُنَاخُ مَنْ سَبَقَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Ibrahim bin Muhajir] dari [Yusuf bin Mahak] dari [Ibunya] dari [Aisyah] berkata; Aku bertanya pada Rasulullah shallallahu 'alaihi wasallam; \"Wahai Rasulullah, apakah perlu kami buatkan engkau rumah di Mina?\" Beliau menjawab: 'Tidak, 'Mina adalah tempat peristirahatan orang-orang dahulu.'"
            },
            {
                "number": 2963,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ أُمِّهِ مُسَيْكَةَ عَنْ عَائِشَةَ قَالَتْقُلْنَا يَا رَسُولَ اللَّهِ أَلَا نَبْنِي لَكَ بِمِنًى بَيْتًا يُظِلُّكَ قَالَ لَا مِنًى مُنَاخُ مَنْ سَبَقَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Amru bin Abdullah], keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Ibrahim bin Muhajir] dari [Yusuf bin Mahak] dari [Ummu Musaikah] dari [Aisyah] berkata; Kami bertanya; \"Wahai Rasulullah, bagaimana jika kami membuatkan rumah untukmu di Mina agar engkau bisa berteduh?\" Beliau menjawab: 'Tidak, Mina adalah tempat istirahatnya orang-orang dahulu.'"
            },
            {
                "number": 2964,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ عُقْبَةَ عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ عَنْ أَنَسٍ قَالَغَدَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْيَوْمِ مِنْ مِنًى إِلَى عَرَفَةَ فَمِنَّا مَنْ يُكَبِّرُ وَمِنَّا مَنْ يُهِلُّ فَلَمْ يَعِبْ هَذَا عَلَى هَذَا وَلَا هَذَا عَلَى هَذَا وَرُبَّمَا قَالَ هَؤُلَاءِ عَلَى هَؤُلَاءِ وَلَا هَؤُلَاءِ عَلَى هَؤُلَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Umar Al 'Adani]; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Muhammad bin Uqbah] dari [Muhammad bin Abu Bakar] dari [Anas] radliallahu 'anhu, ia berkata; \"Kami berangkat pagi-pagi bersama Rasulullah dihari ini dari Mina menuju Arafah. (Dalam perjalanan) diantara kami ada yang bertakbir, ada pula yang membaca Talbiyah, dan tidak terjadi kelompok yang bertakbir mencela kelompok yang bertalbiyah, demikian juga kelompok yang bertalbiyah tidak mencela kelompok yang bertakbir.\" Atau Perawi berkata; 'Mereka (kelompok) ini (tidak mencela) kelompok ini, dan kelompok ini (tidak mencela) kelompok ini.'"
            },
            {
                "number": 2965,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ أَنْبَأَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ عَنْ سَعِيدِ بْنِ حَسَّانَ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْزِلُ بِعَرَفَةَ فِي وَادِي نَمِرَةَ قَالَ فَلَمَّا قَتَلَ الْحَجَّاجُ ابْنَ الزُّبَيْرِ أَرْسَلَ إِلَى ابْنِ عُمَرَ أَيَّ سَاعَةٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرُوحُ فِي هَذَا الْيَوْمِ قَالَ إِذَا كَانَ ذَلِكَ رُحْنَا فَأَرْسَلَ الْحَجَّاجُ رَجُلًا يَنْظُرُ أَيَّ سَاعَةٍ يَرْتَحِلُ فَلَمَّا أَرَادَ ابْنُ عُمَرَ أَنْ يَرْتَحِلَ قَالَ أَزَاغَتْ الشَّمْسُ قَالُوا لَمْ تَزِغْ بَعْدُ فَجَلَسَ ثُمَّ قَالَ أَزَاغَتْ الشَّمْسُ قَالُوا لَمْ تَزِغْ بَعْدُ فَجَلَسَ ثُمَّ قَالَ أَزَاغَتْ الشَّمْسُ قَالُوا لَمْ تَزِغْ بَعْدُ فَجَلَسَ ثُمَّ قَالَ أَزَاغَتْ الشَّمْسُ قَالُوا نَعَمْ فَلَمَّا قَالُوا قَدْ زَاغَتْ ارْتَحَلَقَالَ وَكِيعٌ يَعْنِي رَاحَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Amru bin Abdullah], keduanya berkata; telah menceritakan kepada kami [Waki']; telah memberitakan kepada kami [Nafi' bin Umar Al Jumahi] dari [Sa'id bin Hassan] dari [Ibnu Umar] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam singgah di Arafah di lembah Namirah. Ia Perawi berkata; \"Ketika Al Hajjaj membunuh 'Abdullah bin Zubair, ia pernah mengutus seorang (utusan) untuk menemui Ibnu Umar radliallahu 'anhu (untuk melihat) kapankah dulu Rasulullah shallallahu 'alaihi wasallam berangkat ke Arafah pada hari ini? Ia berkata; 'Jika (sudah diketahui waktunya) maka kami akan berangkat.' Maka Al Hajjaj mengutus seseorang untuk melihat kapan Ibnu Umar bergegas berangkat. Ketika Ibnu Umar hendak berangkat, Ibnu Umar radliallahu 'anhu bertanya; 'Apakah matahari sudah tergelincir? ' Mereka menjawab; 'Belum'. Maka ia duduk. (Beberapa saat) kemudian ia bertanya lagi; 'Apakah matahari sudah tergelincir? ' Mereka menjawab; 'Belum'. Maka ia pun duduk kembali. (Beberapa saat) kemudian ia bertanya lagi; 'Apakah matahari sudah tergelincir? ' Mereka menjawab; 'Belum'. Maka ia pun duduk kembali. (Beberapa saat kemudian) ia bertanya lagi; 'Apakah matahari sudah tergelincir? ' Mereka menjawab; 'Ya'. Ketika mereka mengatakan bahwa matahari sudah tergelincir, maka Ibnu Umar segera bergegas berangkat. Waki' berkata; 'Yang dimaksud berangkat adalah berangkat di sore hari.'"
            },
            {
                "number": 2966,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ عَنْ زَيْدِ بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيٍّ قَالَوَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَقَالَ هَذَا الْمَوْقِفُ وَعَرَفَةُ كُلُّهَا مَوْقِفٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Yahya bin Adam] dari [Sufyan] dari [Abdurrahman bin Ayyasy] dari [Zaid bin Ali] dari [Ayahnya] dari [ubaidhullah bin Abu Rafi'] dari [Ali] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam wukuf di Arafah, lalu bersabda: \"Di sinilah tempat Wukuf, dan seluruh Arafah adalah tempat wukuf.\""
            },
            {
                "number": 2967,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ عَنْ يَزِيدَ بْنِ شَيْبَانَ قَالَكُنَّا وُقُوفًا فِي مَكَانٍ تُبَاعِدُهُ مِنْ الْمَوْقِفِ فَأَتَانَا ابْنُ مِرْبَعٍ فَقَالَ إِنِّي رَسُولُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْكُمْ يَقُولُ كُونُوا عَلَى مَشَاعِرِكُمْ فَإِنَّكُمْ الْيَوْمَ عَلَى إِرْثٍ مِنْ إِرْثِ إِبْرَاهِيمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Sufyan bin Uyainah] dari ['Amru bin Dinar] dari [Amru bin Abdullah bin Shafwan] dari [Yazid bin Syaiban] bekata; \"Kami melakukan wukuf di suatu tempat yang berjauhan dari tempat wukuf (yang seharusnya). Lalu Ibnu Mirba' mendatangi kami seraya berkata; 'Sesungguhnya aku adalah utusan dari Rasulullah shallallahu 'alaihi wasallam kepadamu untuk mengatakan: 'Tetaplah kalian untuk berada di tempat syi'ar (masya'ir) kalian. Karena kalian pada hari ini tengah berada pada sebuah warisan Nabi Ibrahim Alaihis Salam.'\""
            },
            {
                "number": 2968,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْقَاسِمُ بْنُ عَبْدِ اللَّهِ الْعُمَرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ عَرَفَةَ مَوْقِفٌ وَارْتَفِعُوا عَنْ بَطْنِ عَرَفَةَ وَكُلُّ الْمُزْدَلِفَةِ مَوْقِفٌ وَارْتَفِعُوا عَنْ بَطْنِ مُحَسِّرٍ وَكُلُّ مِنًى مَنْحَرٌ إِلَّا مَا وَرَاءَ الْعَقَبَةِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar]; telah menceritakan kepada kami [Qasim bin Abdullah Al 'Umari]; telah menceritakan kepada kami [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] radliallahu 'anhu, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Semua lokasi di Arafah adalah tempat wukuf, penuhilah perut lembah Arafah. Dan semua lokasi di Muzdalifah adalah tempat wukuf, penuhilah perut lembah Muhassar. Dan semua lokasi di Mina adalah tempat menyembelih hewan kurban, kecuali lokasi di belakang Aqabah.\""
            },
            {
                "number": 2969,
                "arab": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْهَاشِمِيُّ حَدَّثَنَا عَبْدُ الْقَاهِرِ بْنُ السَّرِيِّ السُّلَمِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ كِنَانَةَ بْنِ عَبَّاسِ بْنِ مِرْدَاسٍ السُّلَمِيُّ أَنَّ أَبَاهُ أَخْبَرَهُ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا لِأُمَّتِهِ عَشِيَّةَ عَرَفَةَ بِالْمَغْفِرَةِ فَأُجِيبَ إِنِّي قَدْ غَفَرْتُ لَهُمْ مَا خَلَا الظَّالِمَ فَإِنِّي آخُذُ لِلْمَظْلُومِ مِنْهُ قَالَ أَيْ رَبِّ إِنْ شِئْتَ أَعْطَيْتَ الْمَظْلُومَ مِنْ الْجَنَّةِ وَغَفَرْتَ لِلظَّالِمِ فَلَمْ يُجَبْ عَشِيَّتَهُ فَلَمَّا أَصْبَحَ بِالْمُزْدَلِفَةِ أَعَادَ الدُّعَاءَ فَأُجِيبَ إِلَى مَا سَأَلَ قَالَ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ تَبَسَّمَ فَقَالَ لَهُ أَبُو بَكْرٍ وَعُمَرُ بِأَبِي أَنْتَ وَأُمِّي إِنَّ هَذِهِ لَسَاعَةٌ مَا كُنْتَ تَضْحَكُ فِيهَا فَمَا الَّذِي أَضْحَكَكَ أَضْحَكَ اللَّهُ سِنَّكَ قَالَ إِنَّ عَدُوَّ اللَّهِ إِبْلِيسَ لَمَّا عَلِمَ أَنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ اسْتَجَابَ دُعَائِي وَغَفَرَ لِأُمَّتِي أَخَذَ التُّرَابَ فَجَعَلَ يَحْثُوهُ عَلَى رَأْسِهِ وَيَدْعُو بِالْوَيْلِ وَالثُّبُورِ فَأَضْحَكَنِي مَا رَأَيْتُ مِنْ جَزَعِهِ",
                "id": "Telah menceritakan kepada kami [Ayyub bin Muhammad Al Hasyimi]; telah menceritakan kepada kami [Abdul Qahir bin Sari As Sulami]; telah menceritakan kepada kami [Abdullah bin Kinanah bin Abbas bin Mirdas As Sulami] bahwa [Ayahnya]; telah mengabarkan kepadanya dari [ayahnya], bahwa Nabi shallallahu 'alaihi wasallam berdoa untuk kebahagiaan dan ampunan, maka Allah menjawab: \"Aku mengampuni mereka kecuali orang yang berbuat kezhaliman maka aku memberikannya kepada yang dizhalimi.\" Beliau bertanya: 'Kenapa wahai Rabbku, bukankah Engkau dapat memasukan yang terzhalimi ke dalam surga dan mengampuni yang berbuat kezhaliman? ' Maka Allah tidak menjawabnya, hingga ketika Nabi berada di Muzdalifah beliau kembali mengulangi doanya, maka dijawab apa yang beliau minta, Maka Rasulullah shallallahu 'alaihi wasallam tertawa atau tersenyum, Abu Bakar dan Umar pun berkata; 'Demi bapak ibuku, sungguh pada saat ini, apa yang membuat engkau tertawa, siapa lagi yang bukan menjadikan tertawa kecuali Allah menjadikanmu tertawa dengan gigi-gigimu.' Beliau menjawab: 'Sesungguhnya musuh Allah, Iblis, ketika mengetahui Allah mengabulkan doaku, dan mengampuni umatku maka ia mengambil tanah dan di letakkan di kepalanya seraya mendoakan dengan kecelakaan dan kebinasaan, maka itu menjadikanku tertawa dari sikapnya itu.'"
            },
            {
                "number": 2970,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْمِصْرِيُّ أَبُو جَعْفَرٍ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ يُونُسَ بْنَ يُوسُفَ يَقُولُ عَنْ ابْنِ الْمُسَيَّبِ قَالَ قَالَتْ عَائِشَةُإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يُعْتِقَ اللَّهُ عَزَّ وَجَلَّ فِيهِ عَبْدًا مِنْ النَّارِ مِنْ يَوْمِ عَرَفَةَ وَإِنَّهُ لَيَدْنُو عَزَّ وَجَلَّ ثُمَّ يُبَاهِي بِهِمْ الْمَلَائِكَةَ فَيَقُولُ مَا أَرَادَ هَؤُلَاءِ",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Mishri Abu Ja'far]; telah memberitakan kepada kami [Abdullah bin Wahab]; telah mengkabarkan kepadaku [Makhramah bin Bukair] dari [Ayahnya] berkata; Aku mendengar [Yunus bin Yusuf] berkata; dari [Ibnu Al Musayyab] berkata; dari [Aisyah] radliallahu 'anha, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hari yang lebih banyak Allah bebaskan hamba dari api neraka dari pada hari Arafah. (Pada hari itu) Allah Subhanahu Wa Ta'ala akan mendekat, kemudian berbangga dengan para hamba-Nya kepada para Malaikat, seraya berfirman: 'Apa gerangan yang mereka inginkan? '\""
            },
            {
                "number": 2971,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ بُكَيْرِ بْنِ عَطَاءٍ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَعْمَرَ الدِّيلِيَّ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ وَاقِفٌ بِعَرَفَةَ وَأَتَاهُ نَاسٌ مِنْ أَهْلِ نَجْدٍ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ الْحَجُّ قَالَ الْحَجُّ عَرَفَةُ فَمَنْ جَاءَ قَبْلَ صَلَاةِ الْفَجْرِ لَيْلَةَ جَمْعٍ فَقَدْ تَمَّ حَجُّهُ أَيَّامُ مِنًى ثَلَاثَةٌ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ ثُمَّ أَرْدَفَ رَجُلًا خَلْفَهُ فَجَعَلَ يُنَادِي بِهِنَّحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا الثَّوْرِيُّ عَنْ بُكَيْرِ بْنِ عَطَاءٍ اللَّيْثِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ الدِّيلِيِّ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَجَاءَهُ نَفَرٌ مِنْ أَهْلِ نَجْدٍ فَذَكَرَ نَحْوَهُ قَالَ مُحَمَّدُ بْنُ يَحْيَى مَا أُرَ لِلثَّوْرِيِّ حَدِيثًا أَشْرَفَ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhamad], keduanya berkata; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Sufyan] dari [Bukair bin Atha`]; Aku mendengar [Abdurahman bin Ya'mar Ad-Dili], ia berkata; \"Aku menyaksikan Rasulullah shallallahu 'alaihi wasallam ketika sedang wukuf di Arafah, dan sekelompok orang dari kalangan penduduk Najd mendatangi beliau, mereka bertanya; 'Wahai Rasulullah, bagaimana (cara melaksanakan) haji? ' Beliau menjawab: ' Haji itu adalah Arafah. Maka barang siapa datang ke Arafah sebelum fajar malam berkumpulnya manusia, maka telah sempurnalah ibadah haji. Hari-hari Mina itu tiga hari, barangsiapa ingin cepat berangkat (dari Mina) sesudah dua hari, maka tidak ada dosa baginya, dan barang siapa ingin menangguhkan (keberangkatannya dari dua hari), maka tidak ada dosa pula baginya.' Kemudian seorang laki-laki di belakang beliau mengiringi ucapannya dan turut menyerukan ucapan tersebut.' Telah menceritakan kepada kami [Muhammad bin Yahya]; telah menceritakan kepada kami [Abdurrazak]; telah memberitakan kepada kami [Ats Tsauri] dari [Bukair bin Atha` Al Laitsi] dari [Abdurrahman bin Ya'mar Ad Dili] berkata; Aku mendatangi Rasulullah shallallahu 'alaihi wasallam di Arafah, lalu datanglah seseorang dari penduduk Najed, lalu ia sebutkan hadits tersebut. [Muhammad bin Yahya] berkata; Aku tidak diperlihatkan dari Ats Tsauri sebuah hadits yang lebih baik dari ini.\""
            },
            {
                "number": 2972,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ عَامِرٍ يَعْنِي الشَّعْبِيَّ عَنْ عُرْوَةَ بْنِ مُضَرِّسٍ الطَّائِيِّأَنَّهُ حَجَّ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُدْرِكْ النَّاسَ إِلَّا وَهُمْ بِجَمْعٍ قَالَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَنْضَيْتُ رَاحِلَتِي وَأَتْعَبْتُ نَفْسِي وَاللَّهِ إِنْ تَرَكْتُ مِنْ حَبْلٍ إِلَّا وَقَفْتُ عَلَيْهِ فَهَلْ لِي مِنْ حَجٍّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَهِدَ مَعَنَا الصَّلَاةَ وَأَفَاضَ مِنْ عَرَفَاتٍ لَيْلًا أَوْ نَهَارًا فَقَدْ قَضَى تَفَثَهُ وَتَمَّ حَجُّهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Amir Asy Sya'bi] dari [Urwah bin Mudharris At-Tha'i], ia pernah berangkat haji pada zaman Nabi shallallahu 'alaihi wasallam, dan tidak dapat mengejar orang-orang kecuali mereka sudah berada di Muzdalifah. Lalu ia berkata; Aku menemui Nabi shallallahu 'alaihi wasallam, maka kukatakan kepada beliau: 'Wahai Rasulullah aku telah membuat kurus untaku, dan melelahkan diriku (karena tergesa-gesa mengejar waktu Arafah). Demi Allah jika aku terlepas dari perjalanan panjang itu, tentu aku dapat turut berwukuf. Lalu apakah aku mendapatkan haji? ' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa menyaksikan sholat bersama kami, dan menemui wukuf di Arafah baik malam maupun siang, maka ia telah melaksanakan tahalullul dan sempurnalah hajinya.'"
            },
            {
                "number": 2973,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ أُسَامَةَ بْنِ زَيْدٍأَنَّهُ سُئِلَ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسِيرُ حِينَ دَفَعَ مِنْ عَرَفَةَ قَالَ كَانَ يَسِيرُ الْعَنَقَ فَإِذَا وَجَدَ فَجْوَةً نَصَّقَالَ وَكِيعٌ وَالنَّصُّ يَعْنِي فَوْقَ الْعَنَقِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Amru bin Abdullah], keduanya berkata; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari [Usamah bin Zaid], bahwa ia pernah ditanya: 'Bagaimana Rasulullah shallallahu 'alaihi wasallam berjalan ketika berangkat dari Arafah? ' Usamah menjawab; 'Beliau berjalan dengan kecepatan sedang. Dan jika beliau menemukan kekosongan (di jalan), maka beliau akan mempercepat jalannya.' Waki' berkata; 'Yang dimaksud adalah kecepatan yang melebihi kecepatan biasa (rata-rata).'"
            },
            {
                "number": 2974,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا الثَّوْرِيُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْقَالَتْ قُرَيْشٌ نَحْنُ قَوَاطِنُ الْبَيْتِ لَا نُجَاوِزُ الْحَرَمَ فَقَالَ اللَّهُ عَزَّ وَجَلَّ{ ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya]; telah menceritakan kepada kami [Abdurrazaq]; telah menceritakan kepada kami [Ats Tsauri] dari [Hisyam bin Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata; \"Seseorang dari kalangan kaum Quraisy berkata; 'Kami adalah penduduk di sekitar Baitullah, dan (tinggal) tidak jauh dari daerah Haram. Allah Subhanahu Wa Ta'ala telah berfirman: 'Kemudian bertolaklah kamu dari tempat bertolaknya orang-orang banyak (Arafah) …'(Qs. Al Baqarah 2: 199) "
            },
            {
                "number": 2975,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَأَفَضْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا بَلَغَ الشِّعْبَ الَّذِي يَنْزِلُ عِنْدَهُ الْأُمَرَاءُ نَزَلَ فَبَالَ فَتَوَضَّأَ قُلْتُ الصَّلَاةَ قَالَ الصَّلَاةُ أَمَامُكَ فَلَمَّا انْتَهَى إِلَى جَمْعٍ أَذَّنَ وَأَقَامَ ثُمَّ صَلَّى الْمَغْرِبَ ثُمَّ لَمْ يَحِلَّ أَحَدٌ مِنْ النَّاسِ حَتَّى قَامَ فَصَلَّى الْعِشَاءَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar]; telah menceritakan kepada kami [Abdurrahman bin Mahdi]; telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Uqbah] dari [Kuraib] dari [Usamah bin Zaid] radliallahu 'anhu, ia berkata; \"Aku bertolak bersama Rasulullah shallallahu 'alaihi wasallam, ketika sampai di lembah tempat para penguasa biasa singgah, beliau turun lalu membuang air kecil dan berwudlu. Aku berkata; 'Waktu sholat sudah masuk? ' Beliau bersabda: 'Sebentar lagi kita akan melaksanakan sholat.' Ketika beliau tiba di Muzdalifah, maka dikumandangkanlah adzan dan Iqamat, lalu beliau mengerjakan sholat Maghrib. Dan tidak seorangpun beranjak sampai beliau berdiri dan mengerjakan sholat Isya'.\""
            },
            {
                "number": 2976,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ الْأَنْصَارِيِّ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الْأَنْصَارِيَّ يَقُولُصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَغْرِبَ وَالْعِشَاءَ فِي حَجَّةِ الْوَدَاعِ بِالْمُزْدَلِفَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh]; telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Yahya bin Sa'id] dari ['Addi bin Tsabit Al Anshari] dari [Abdullah bin Yazid Al Khathmi] bahwa ia mendengar [Abu Ayyub Al Anshari] radliallahu 'anhu, ia berkata; \"Aku mengerjakan sholat Maghrib dan Isya saat melakukan haji Wada' (perpisahan) di Muzdalifah bersama Rasulullah.\""
            },
            {
                "number": 2977,
                "arab": "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْمَغْرِبَ بِالْمُزْدَلِفَةِ فَلَمَّا أَنَخْنَا قَالَ الصَّلَاةُ بِإِقَامَةٍ",
                "id": "Telah menceritakan kepada kami [Muhriz bin Salamah Al 'Adani]; telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [ubaidhullah] dari [Salim] dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam mengerjakan sholat Maghrib di Muzdalifah. Dan ketika kami beristirahat, beliau bersabda: \"sholatlah dengan iqamat.\""
            },
            {
                "number": 2978,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ حَجَّاجٍ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَحَجَجْنَا مَعَ عُمَرَ بْنِ الْخَطَّابِ فَلَمَّا أَرَدْنَا أَنْ نُفِيضَ مِنْ الْمُزْدَلِفَةِ قَالَ إِنَّ الْمُشْرِكِينَ كَانُوا يَقُولُونَ أَشْرِقْ ثَبِيرُ كَيْمَا نُغِيرُ وَكَانُوا لَا يُفِيضُونَ حَتَّى تَطْلُعَ الشَّمْسُ فَخَالَفَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَفَاضَ قَبْلَ طُلُوعِ الشَّمْسِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Hajjaj] dari [Abu Ishaq] dari [Amru bin Maimun] berkata; \"Kami berangkat haji bersama [Umar bin Khaththab], maka ketika kami ingin bertolak dari Muzdalifah, ia berkata; 'Sesungguhnya orang-orang musyrik dahulu berkata; 'Serbulah ketika matahari telah terbit! sebagaimana kita menyerang.' Merekapun tidak bertolak sehingga terbit matahari, maka Rasulullah shallallahu 'alaihi wasallam melakukan hal yang bertentangan dengan mereka, beliau bertolak justru sebelum matahari terbit.'"
            },
            {
                "number": 2979,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ عَنْ الثَّوْرِيِّ قَالَ قَالَ أَبُو الزُّبَيْرِ قَالَ جَابِرٌأَفَاضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ وَعَلَيْهِ السَّكِينَةُ وَأَمَرَهُمْ بِالسَّكِينَةِ وَأَمَرَهُمْ أَنْ يَرْمُوا بِمِثْلِ حَصَى الْخَذْفِ وَأَوْضَعَ فِي وَادِي مُحَسِّرٍ وَقَالَ لِتَأْخُذْ أُمَّتِي نُسُكَهَا فَإِنِّي لَا أَدْرِي لَعَلِّي لَا أَلْقَاهُمْ بَعْدَ عَامِي هَذَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabah]; telah menceritakan kepada kami [Abdullah bin Raja` Al Makki] dari [Ats Tsauri] dia berkata; [Abu Az Zubair] dia berkata; dari [Jabir] radliallahu 'anhu, ia berkata; \"Nabi shallallahu 'alaihi wasallam bertolak saat melaksanakan haji Wada' dalam keadaan tenang. Beliau pun memerintahkan orang-orang (yang bersama beliau) untuk tenang, memerintahkan mereka untuk melontar dengan kerikil sebesar kerikil ketapel, serta mempercepat jalan ke lembah Muhassir. Lalu beliau bersabda: 'Hendaklah umatku mengambil tata cara ibadah haji tersebut. Karena aku tidak tahu, mungkin saja aku tidak akan bertemu lagi dengan mereka setelah tahun ini.'"
            },
            {
                "number": 2980,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ عَنْ أَبِي سَلَمَةَ الْحِمْصِيِّ عَنْ بِلَالِ بْنِ رَبَاحٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ غَدَاةَ جَمْعٍ يَا بِلَالُ أَسْكِتْ النَّاسَ أَوْ أَنْصِتْ النَّاسَ ثُمَّ قَالَ إِنَّ اللَّهَ تَطَوَّلَ عَلَيْكُمْ فِي جَمْعِكُمْ هَذَا فَوَهَبَ مُسِيئَكُمْ لِمُحْسِنِكُمْ وَأَعْطَى مُحْسِنَكُمْ مَا سَأَلَ ادْفَعُوا بِاسْمِ اللَّهِ",
                "id": "Telah menceritakan kepada kami ['Ali bin Muhammad] dan [Amru bin Abdullah], keduanya berkata; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Ibnu Abu Rawwad] dari [Abu Salamah Al Himsha] dari [Bilal bin Rabah] sesungguhnya Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Wahai Bilal. (Perintahkan) orang-orang untuk diam! \" (Atau beliau bersabda: '(Perintahkan) orang untuk mendengarkan), Kemudian bersabda: 'Sesungguhnya Allah menganugerahi kalian di Muzdalifah kalian ini, Dia menganugerahi orang yang berbuat jahat dari kalian untuk yang berbuat baik, dan memberi yang berbuat baik diantara kalian apa yang dia minta. Berangkatlah dengan menyebut nama Allah.\""
            },
            {
                "number": 2981,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مِسْعَرٌ وَسُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَقَدِمْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُغَيْلِمَةَ بَنِي عَبْدِ الْمُطَّلِبِ عَلَى حُمُرَاتٍ لَنَا مِنْ جَمْعٍ فَجَعَلَ يَلْطَحُ أَفْخَاذَنَا وَيَقُولُ أُبَيْنِيَّ لَا تَرْمُوا الْجَمْرَةَ حَتَّى تَطْلُعَ الشَّمْسُ زَادَ سُفْيَانُ فِيهِ وَلَا إِخَالُ أَحَدًا يَرْمِيهَا حَتَّى تَطْلُعَ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan ['Ali bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Mis'ar] dan [Sufyan] dari [Salamah bin Kuhail] dari [Hasan Al Urani] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; Kami mendahulukan anak-anak dari bani Abdul Muththalib yang berada di atas keledai-keledai kami dari pada Rasulullah shallallahu 'alaihi wasallam (ketika berangkat) dari Muzdalifah. Beliau lantas menepuk-nepuk paha kami sambil bersabda: \"Wahai anak-anakku, janganlah kalian melontar jumrah (kecuali) sampai matahari terbit.\""
            },
            {
                "number": 2982,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا عَمْرٌو عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَكُنْتُ فِيمَنْ قَدِمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ضَعَفَةِ أَهْلِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Sufyan]; telah menceritakan kepada kami [Amru] dari [Atha`] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; \"Aku termasuk orang yang mendahului Rasulullah shallallahu 'alaihi wasallam dalam kelompok orang-orang lemah dari kalangan keluarganya.\""
            },
            {
                "number": 2983,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ كَانَتْ امْرَأَةً ثَبْطَةً فَاسْتَأْذَنَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَدْفَعَ مِنْ جَمْعٍ قَبْلَ دَفْعَةِ النَّاسِ فَأَذِنَ لَهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Sufyan] dari [Abdurrahman bin Qasim] dari [Ayahnya] dari [Aisyah] radliallahu 'anhu, bahwa Saudah binti Zam'ah adalah wanita yang berat dan lambat (jalannya), maka ia meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk bertolak ke Muzdalifah mendahului orang-orang, dan beliaupun mengizinkannya."
            },
            {
                "number": 2984,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّهِ قَالَتْرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ عِنْدَ جَمْرَةِ الْعَقَبَةِ وَهُوَ رَاكِبٌ عَلَى بَغْلَةٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِذَا رَمَيْتُمْ الْجَمْرَةَ فَارْمُوا بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Mushir], dari [Yazid bin Abu Ziyad] dari [Sulaiman bin Amru bin Al Ahwash], dari [Ibunya], ia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam pada hari 'Idul Adha ketika melontar jumrah Aqabah dengan mengendarai bahgalnya. Beliau bersabda: 'Wahai manusia sekalian, jika kalian melontar jumrah, maka lontarlah dengan kerikil kecil seperti kerikil ketapel'.\""
            },
            {
                "number": 2985,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَوْفٍ عَنْ زِيَادِ بْنِ الْحُصَيْنِ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدَاةَ الْعَقَبَةِ وَهُوَ عَلَى نَاقَتِهِ الْقُطْ لِي حَصًى فَلَقَطْتُ لَهُ سَبْعَ حَصَيَاتٍ هُنَّ حَصَى الْخَذْفِ فَجَعَلَ يَنْفُضُهُنَّ فِي كَفِّهِ وَيَقُولُ أَمْثَالَ هَؤُلَاءِ فَارْمُوا ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِيَّاكُمْ وَالْغُلُوَّ فِي الدِّينِ فَإِنَّهُ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ الْغُلُوُّ فِي الدِّينِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Abu Usamah] dari [Auf] dari [Ziyad bin Hushain] dari [Abu Aliyah] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda di pagi hari jumrah Aqabah saat beliau berada di atas untanya: 'Tolong ambilkan aku kerikil.' Maka aku ambilkan untuk beliau tujuh kerikil, semuanya sebesar kerikil ketapel. Beliau mengebutkan (membersihkan debunya) di telapak tangan, seraya besabda: 'Dengan kerikil-kerikil seperti inilah hendaknya kalian melempar.' Kemudian beliau bersabda: 'Wahai manusia jauhkanlah kalian berlebih-lebihan dalam agama. Karena orang-orang sebelum kalian telah binasa sebab mereka berlebih-lebihan dalam agama.'"
            },
            {
                "number": 2986,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ الْمَسْعُودِيِّ عَنْ جَامِعِ بْنِ شَدَّادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَلَمَّا أَتَى عَبْدُ اللَّهِ بْنُ مَسْعُودٍ جَمْرَةَ الْعَقَبَةِ اسْتَبْطَنَ الْوَادِيَ وَاسْتَقْبَلَ الْكَعْبَةَ وَجَعَلَ الْجَمْرَةَ عَلَى حَاجِبِهِ الْأَيْمَنِ ثُمَّ رَمَى بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ ثُمَّ قَالَ مِنْ هَاهُنَا وَالَّذِي لَا إِلَهَ غَيْرُهُ رَمَى الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Waki'] dari [Al Mas'udi] dari [Jami' bin Syaddad] dari [Abdurrahman bin Yazid], ia berkata; \"Ketika [Abdullah bin Mas'ud] datang (hendak melontar) jumrah Aqabah, ia masuk ke tengah lembah, menghadap kiblat dan memposisikan tempat jumrah di sebelah kanan. Kemudian ia melontar tujuh kerikil, bertakbir pada tiap lontaran, kemudian ia berkata; 'Demi Dzat yang tidak ada tuhan selain Dia, yang di turunkan kepadanya surat Al Baqarah (Rasulullah shallallahu 'alaihi wasallam), 'dari sebelah sinilah (melontar jumrah Aqabah) beliau melakukannya'.\""
            },
            {
                "number": 2987,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّهِ قَالَتْرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ عِنْدَ جَمْرَةِ الْعَقَبَةِ اسْتَبْطَنَ الْوَادِيَ فَرَمَى الْجَمْرَةَ بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ ثُمَّ انْصَرَفَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّ جُنْدَبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Mushir] dari [Yazid bin Abu Ziyad] dari [Sulaiman bi Amru bin Al Ahwash], dari [ibunya], ia berkata; \"Aku melihat Nabi shallallahu 'alaihi wasallam pada hari 'idul Adha berada di sisi jumrah Aqabah, beliau masuk ke tengah lembah, lalu melontar jumrah dengan tujuh kerikil. Beliau bertakbir setiap kali melempar lontaran lalu pergi.\" Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Yazid bin Abu Ziyad] dari [Sulaiman bin Amru bin Al Ahwash] dari [Ummu Jundab] dari Nabi shallallahu 'alaihi wasallam seperti itu."
            },
            {
                "number": 2988,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّهُ رَمَى جَمْرَةَ الْعَقَبَةِ وَلَمْ يَقِفْ عِنْدَهَا وَذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah]; telah menceritakan kepada kami [Thalhah bin Yahya] dari [Yunus bin Yazid] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] radliallahu 'anhu, bahwa ia melontar jumrah Aqabah tanpa berhenti di tempat jumrah itu. Dan dia menyebutkan bahwa Nabi shallallahu 'alaihi wasallam mengerjakan seperti demikian.\""
            },
            {
                "number": 2989,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْحَجَّاجِ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَمَى جَمَرَ الْعَقَبَةِ مَضَى وَلَمْ يَقِفْ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id]; telah menceritakan kepada kami [Ali bin Mushir] dari [Al Hajjaj] dari [Al Hakam bin Utaibah] dari [Miqsam] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam jika melontar jumrah Aqabah, beliau terus berjalan dan tidak berhenti.\""
            },
            {
                "number": 2990,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ حَجَّاجٍ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى الْجَمْرَةَ عَلَى رَاحِلَتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Hajjaj] dari [Al Hakam] dari [Miqsam] dari [Ibnu Abbas] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam melontar jumrah dari atas kendaraannya."
            },
            {
                "number": 2991,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ أَيْمَنَ بْنِ نَابِلٍ عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ الْعَامِرِيِّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى الْجَمْرَةَ يَوْمَ النَّحْرِ عَلَى نَاقَةٍ لَهُ صَهْبَاءَ لَا ضَرْبَ وَلَا طَرْدَ وَلَا إِلَيْكَ إِلَيْكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Waki'] dari [Aiman bin Nabil] dari [Qudamah bin Abdullah Al Amiri], ia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam melontar jumrah pada hari 'Ied Adha dari atas unta coklat muda beliau, tidak ada pukulan dan tidak pula usiran, serta tidak ada ucapan: 'Kepadamu, kepadamu.\""
            },
            {
                "number": 2992,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلرِّعَاءِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abdullah bin Abu Bakar] dari [Abdul Malik bin Abu Bakar] dari [Abdul Badah bin Ashim] dari [Bapaknya], bahwa Nabi shallallahu 'alaihi wasallam memberikan keringanan kepada para penggembala untuk melontar jumrah dalam sehari, kemudian tidak melontar sehari (berikutnya)."
            },
            {
                "number": 2993,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَالِكُ بْنُ أَنَسٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكِ بْنِ أَنَسٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمٍ عَنْ أَبِيهِ قَالَرَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِرِعَاءِ الْإِبِلِ فِي الْبَيْتُوتَةِ أَنْ يَرْمُوا يَوْمَ النَّحْرِ ثُمَّ يَجْمَعُوا رَمْيَ يَوْمَيْنِ بَعْدَ النَّحْرِ فَيَرْمُونَهُ فِي أَحَدِهِمَا قَالَ مَالِكٌ ظَنَنْتُ أَنَّهُ قَالَ فِي الْأَوَّلِ مِنْهُمَا ثُمَّ يَرْمُونَ يَوْمَ النَّفْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya]; telah menceritakan kepada kami [Abdurrazak]; telah memberitakan kepada kami [Malik bin Anas]; Demikian juga diriwayatkan dari jalur lainnya, telah menceritakan kepada kami [Ahmad bin Sinan]; telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Malik bin Anas]; telah menceritakan kepadaku [Abdullah bin Abu Bakar] dari [Ayahnya] dari [Abul Badah bin Ashim], dari [Ayahnya] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memberikan keringanan pada penggembala unta (yang sibuk mengurus makan gembala) saat mabit di Mina untuk melontar jumrah pada hari 'Ied Adha. Mereka dapat mengumpulkan lontarannya pada dua hari setelah hari 'Ied Adha, mereka (dibolehkan) untuk melontar pada salah satu dari dua hari tersebut. Malik berkata; 'Aku mengira bahwa beliau bersabda: 'Pada hari pertama dari dua hari tersebut'. Kemudian mereka pun melontar pada hari Nafar.\""
            },
            {
                "number": 2994,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ أَشْعَثَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَحَجَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَنَا النِّسَاءُ وَالصِّبْيَانُ فَلَبَّيْنَا عَنْ الصِّبْيَانِ وَرَمَيْنَا عَنْهُمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Abdullah bin Numair] dari [Asy'ats] dari [Abu Zubair] dari [Jabir] berkata; \"Kami melaksanakan haji bersama Rasulullah shallallahu 'alaihi wasallam sedang bersama kami ada wanita dan anak-anak, kami bertalbiyah diikuti anak-anak dan kami melempar bersama mereka.\""
            },
            {
                "number": 2995,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا حَمْزَةُ بْنُ الْحَارِثِ بْنِ عُمَيْرٍ عَنْ أَبِيهِ عَنْ أَيُّوبَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّى حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Khalaf Abu Bisyr]; telah menceritakan kepada kami [Hamzah bin Al Harits bin Umair] dari [Ayahnya] dari [Ayyub] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam bertalbiyah hingga beliau melontar jumrah Aqabah."
            },
            {
                "number": 2996,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ خُصَيْفٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ الْفَضْلُ بْنُ عَبَّاسٍكُنْتُ رِدْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا زِلْتُ أَسْمَعُهُ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ فَلَمَّا رَمَاهَا قَطَعَ التَّلْبِيَةَ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari]; telah menceritakan kepada kami [Abul Ahwash] dari [Khushaif] dari [Mujahid] dari [Ibnu Abbas] berkata; Al Fahdl bin Abbas radliallahu 'anhu, ia berkata; \"Aku berada di belakang Nabi shallallahu 'alaihi wasallam, dan aku masih mendengar beliau bertalbiyah sampai beliau melontar jumrah Aqabah. Selepas melontarnya, beliaupun berhenti bertalbiyah.\""
            },
            {
                "number": 2997,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَوَكِيعٌ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَإِذَا رَمَيْتُمْ الْجَمْرَةَ فَقَدْ حَلَّ لَكُمْ كُلُّ شَيْءٍ إِلَّا النِّسَاءَ فَقَالَ لَهُ رَجُلٌ يَا ابْنَ عَبَّاسٍ وَالطِّيبُ فَقَالَ أَمَّا أَنَا فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُضَمِّخُ رَأْسَهُ بِالْمِسْكِ أَفَطِيبٌ ذَلِكَ أَمْ لَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Waki']; Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Abu Bakar bin Khalad Al Bahili]; telah menceritakan kepada kami [Yahya bin Sa'id] dan [Waki'] serta [Abdurrahman bin Mahdi], semuanya mengatakan; telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Al Hasan Al 'Urani] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; \"Jika kalian telah melontar jumrah (Aqabah), maka telah dihalalkan bagi kalian segala sesuatu (dari larangan Ihram) kecuali menggauli istri.\" Seorang lelaki bertanya kepadanya; 'Wahai Ibnu Abbas radliallahu 'anhu, bagaimana dengan wewangian? ' Ia menjawab; 'Aku telah melihat Rasulullah shallallahu 'alaihi wasallam melumuri kepalanya dengan Kesturi, bukankah (kesturi) itu wangi-wangian atau bukan? '"
            },
            {
                "number": 2998,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا خَالِي مُحَمَّدٌ وَأَبُو مُعَاوِيَةَ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْطَيَّبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِإِحْرَامِهِ حِينَ أَحْرَمَ وَلِإِحْلَالِهِ حِينَ أَحَلَّ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Pamanku Muhammad] dan [Abu Mu'awiyah] serta [Abu Usamah] dari [ubaidhullah] dari [Al Qasim bin Muhammad] dari [Aisyah] radliallahu 'anha, ia berkata; \"Aku memakaikan wewangian kepada Rasulullah shallallahu 'alaihi wasallam ketika beliau berihram dan ketika beliau bertahalul.\""
            },
            {
                "number": 2999,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ قَالُوا يَا رَسُولَ اللَّهِ وَالْمُقَصِّرِينَ قَالَ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ثَلَاثًا قَالُوا يَا رَسُولَ اللَّهِ وَالْمُقَصِّرِينَ قَالَ وَالْمُقَصِّرِينَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Muhammad bin Fudhail]; telah menceritakan kepada kami [Umarah bin Qa'qa'] dari [Abu Zur'ah] dari [Abu Hurairah] radliallahu 'anhu, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berdoa: 'Ya Allah ampunilah orang-orang yang bercukur.'\" Para sahabat berkata; 'Wahai Rasulullah, (bagaimana dengan) orang-orang yang memendekan rambutnya? ' Beliau bersabda: 'Ya Allah ampunilah orang-orang yang bercukur.' Beliau menyebutnya tiga kali. Mereka berkata; 'Wahai Rasulullah, (bagaimana dengan) orang-orang yang memendekkan rambutnya? ' Beliau bersabda: 'Dan orang-orang yang memendekkan rambutnya.'"
            },
            {
                "number": 3000,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَأَحْمَدُ بْنُ أَبِي الْحَوَارِيِّ الدِّمَشْقِيُّ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَحِمَ اللَّهُ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ رَحِمَ اللَّهُ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ رَحِمَ اللَّهُ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ وَالْمُقَصِّرِينَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Ahmad bin Abu Hawari Ad Dimasyqi], keduanya berkata; telah menceritakan kepada kami [Abdullah bin Numair] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah merahmati orang-orang yang bercukur.\" Para sahabat bertanya; 'Dan apakah juga orang-orang yang memendekkan rambut, wahai Rasulullah? ' Beliau bersabda: 'Semoga Allah merahmati orang-orang yang bercukur.' Mereka berkata lagi; 'Dan apakah juga orang-orang yang memendekkan rambut, wahai Rasulullah? ' Beliau bersabda: 'Semoga Allah merahmati orang-orang yang bercukur.' Mereka berkata lagi; 'Dan apakah juga orang-orang yang memendekkan rambut, wahai Rasulullah? ' Beliau pun bersabda: 'Dan orang-orang yang memendekkan rambut.'"
            },
            {
                "number": 3001,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ حَدَّثَنَا ابْنُ إِسْحَقَ حَدَّثَنَا ابْنُ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَقِيلَ يَا رَسُولَ اللَّهِ لِمَ ظَاهَرْتَ لِلْمُحَلِّقِينَ ثَلَاثًا وَلِلْمُقَصِّرِينَ وَاحِدَةً قَالَ إِنَّهُمْ لَمْ يَشُكُّوا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair]; telah menceritakan kepada kami [Yunus bin Bukair]; telah menceritakan kepada kami [Ibnu Ishaq]; telah menceritakan kepada kami [Ibnu Najid] dari [Mujahid] dari [Ibnu Abbas] berkata; dikatakan pada Rasulullah shallallahu 'alaihi wasallam; Kenapa engkau mendo'akan untuk muhalliqin (yang mencukur) sebanyak tiga kali sedangkan untuk muqasshirin (yang memendekan) hanya sekali?\" Beliau bersabda: 'Sesungguhnya mereka adalah orang-orang yang tidak ragu (untuk mencontoh Nabi shallallahu 'alaihi wasallam).'"
            },
            {
                "number": 3002,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ حَفْصَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحِلَّ أَنْتَ مِنْ عُمْرَتِكَ قَالَ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلَا أَحِلُّ حَتَّى أَنْحَرَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Abu Usamah] dari [Ubaidillah bin Umar] dari [Nafi'] dari [Ibnu Umar]; Bahwasanya Hafshah, istri Nabi shallallahu 'alaihi wasallam berkata; \"Aku bertanya; 'Wahai Rasulullah, mengapa orang-orang sudah bertahallul, sedangkan engkau belum juga bertahallul dari umrahmu? ' Beliau menjawab: 'Sesungguhnya aku telah mengempalkan rambut kepalaku dan menggantungkan hewan kurbanku, maka aku tidak akan bertahallul sebelum kusembelih hewan kurban'.\""
            },
            {
                "number": 3003,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَنْبَأَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهِلُّ مُلَبِّدًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh Al Mishri]; telah memberitakan kepada kami [Abdullah bin Wahab]; telah memberitakan kepada kami [Yunus] dari [Ibnu Syihab] dari [Salim] dari [Ayahnya], ia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bertalbiyah sambil mengepang rambut kepalanya.\""
            },
            {
                "number": 3004,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنًى كُلُّهَا مَنْحَرٌ وَكُلُّ فِجَاجِ مَكَّةَ طَرِيقٌ وَمَنْحَرٌ وَكُلُّ عَرَفَةَ مَوْقِفٌ وَكُلُّ الْمُزْدَلِفَةِ مَوْقِفٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Amru bin Abdullah], keduanya berkata; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Usamah bin Zaid] dari [Atha`] dari [Jabir] radliallahu 'anhu, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Mina seluruhnya adalah tempat penyembelihan, dan seluruh pelosok kota Makkah adalah jalan dan tempat penyembelihan. Seluruh Arafah adalah tempat wukuf, dan seluruh Muzdalifah adalah tempat wukuf.\""
            },
            {
                "number": 3005,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَمَا سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّنْ قَدَّمَ شَيْئًا قَبْلَ شَيْءٍ إِلَّا يُلْقِي بِيَدَيْهِ كِلْتَيْهِمَا لَا حَرَجَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam ditanya tentang orang yang mendahulukan sesuatu, (dari rukun haji) sebelum mengerjakan rukun lainnya, kecuali beliau akan menggerakan kedua tangannya, sambil bersabda: 'Tidak mengapa.'"
            },
            {
                "number": 3006,
                "arab": "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْأَلُ يَوْمَ مِنًى فَيَقُولُ لَا حَرَجَ لَا حَرَجَ فَأَتَاهُ رَجُلٌ فَقَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ قَالَ لَا حَرَجَ قَالَ رَمَيْتُ بَعْدَ مَا أَمْسَيْتُ قَالَ لَا حَرَجَ",
                "id": "Telah menceritakan kepada kami [Abu Bisyr Bakar bin Khalaf]; telah menceritakan kepada kami [Yazid bin Zura'i] dari [Khalid Al Hadzdza`] dari [Ikrimah] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam pada hari Mina ditanya, maka beliau menjawab: 'Tidak mengapa, tidak mengapa.' Maka seorang lelaki mendatangi beliau seraya bertanya: 'Aku telah mencukur sebelum menyembelih.' Beliau menjawab: 'Tidak mengapa.' Lalu lelaki itu bertanya lagi; 'Aku telah melontar setelah sore hari.' Beliau menjawab: 'Tidak mengapa.'"
            },
            {
                "number": 3007,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَمَّنْ ذَبَحَ قَبْلَ أَنْ يَحْلِقَ أَوْ حَلَقَ قَبْلَ أَنْ يَذْبَحَ قَالَ لَا حَرَجَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Isa bin Thalhah] dari [Abdullah bin 'Amru] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam ditanya tentang (hukum) siapa saja yang menyembelih sebelum mencukur rambut atau mencukur sebelum menyembelih, maka beliau menjawab: \"Tidak mengapa.\""
            },
            {
                "number": 3008,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُقَعَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى يَوْمَ النَّحْرِ لِلنَّاسِ فَجَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ قَالَ لَا حَرَجَ ثُمَّ جَاءَهُ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ قَالَ لَا حَرَجَ فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَيْءٍ قُدِّمَ قَبْلَ شَيْءٍ إِلَّا قَالَ لَا حَرَجَ",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Mishri]; telah menceritakan kepada kami [Abdullah bin Wahab]; telah mengkabarkan kepadaku [Usamah bin Zaid]; telah menceritakan kepadaku [Atha` bin Abu Rabah] dari [Jabir bin Abdullah] radliallahu 'anhu, ia berkata; \"Rasulullah duduk di hadapan orang-orang di Mina saat 'Ied Adha, lalu seorang laki-laki datang kepadanya seraya berkata; 'Wahai Rasulullah, aku telah mencukur rambut sebelum menyembelih. Beliau bersabda: 'Tidak mengapa.' Kemudian datang lelaki lain dan berkata; 'Wahai Rasulullah, aku telah menyembelih sebelum melontar jumrah.' Beliaupun menjawab: 'Tidak mengapa.' Pada hari itu tidaklah beliau ditanya tentang mendahulukan sesuatu (rukun haji) dari lainnya, kecuali beliau akan menjawab: 'Tidak mengapa'.\""
            },
            {
                "number": 3009,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى جَمْرَةَ الْعَقَبَةِ ضُحًى وَأَمَّا بَعْدَ ذَلِكَ فَبَعْدَ زَوَالِ الشَّمْسِ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya Al Mishri]; telah menceritakan kepada kami [Abdullah bin Wahab]; telah menceritakan kepada kami [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir] radliallahu 'anhu, ia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam melontar jumrah Aqabah pada waktu Dluha. Sedangkan melontar selanjutnya (beliau lakukan) setelah tergelincirnya matahari.\""
            },
            {
                "number": 3010,
                "arab": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ بْنِ أَبِي شَيْبَةَ أَبُو شَيْبَةَ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَرْمِي الْجِمَارَ إِذَا زَالَتْ الشَّمْسُ قَدْرَ مَا إِذَا فَرَغَ مِنْ رَمْيِهِ صَلَّى الظُّهْرَ",
                "id": "Telah menceritakan kepada kami [Jubarah bin Al Mughallas]; telah menceritakan kepada kami [Ibrahim bin Utsman bin Abu Syaibah Abu Syaibah] dari [Al Hakam] dari [Miqsam] dari [Ibnu 'Abbas]; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melempar jumrah apabila matahari telah condong sedikit, apabila selesai dari melemparnya beliau sholat zhuhur."
            },
            {
                "number": 3011,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ شَبِيبِ بْنِ غَرْقَدَةَ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أَبِيهِ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي حَجَّةِ الْوَدَاعِ يَا أَيُّهَا النَّاسُ أَلَا أَيُّ يَوْمٍ أَحْرَمُ ثَلَاثَ مَرَّاتٍ قَالُوا يَوْمُ الْحَجِّ الْأَكْبَرِ قَالَ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ بَيْنَكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلَا لَا يَجْنِي جَانٍ إِلَّا عَلَى نَفْسِهِ وَلَا يَجْنِي وَالِدٌ عَلَى وَلَدِهِ وَلَا مَوْلُودٌ عَلَى وَالِدِهِ أَلَا إِنَّ الشَّيْطَانَ قَدْ أَيِسَ أَنْ يُعْبَدَ فِي بَلَدِكُمْ هَذَا أَبَدًا وَلَكِنْ سَيَكُونُ لَهُ طَاعَةٌ فِي بَعْضِ مَا تَحْتَقِرُونَ مِنْ أَعْمَالِكُمْ فَيَرْضَى بِهَا أَلَا وَكُلُّ دَمٍ مِنْ دِمَاءِ الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ مَا أَضَعُ مِنْهَا دَمُ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ كَانَ مُسْتَرْضِعًا فِي بَنِي لَيْثٍ فَقَتَلَتْهُ هُذَيْلٌ أَلَا وَإِنَّ كُلَّ رِبًا مِنْ رِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ لَكُمْ رُءُوسُ أَمْوَالِكُمْ لَا تَظْلِمُونَ وَلَا تُظْلَمُونَ أَلَا يَا أُمَّتَاهُ هَلْ بَلَّغْتُ ثَلَاثَ مَرَّاتٍ قَالُوا نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ ثَلَاثَ مَرَّاتٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Hannad bin As Sari], keduanya mengatakan; telah menceritakan kepada kami [Abul Ahwash] dari [Syabib bin Gharqadah] dari [Sulaiman bin Amru bin Al Ahwash] dari [Ayahnya], ia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda pada haji Wada': 'Wahai manusia sekalian, hari apa yang paling dihormati (haram)? ' Beliau mengulang ucapannya tiga kali. Mereka (orang-orang) menjawab; 'Pada hari haji Akbar.' Beliau bersabda: 'Sesungguhnya darah, harta dan kehormatan kalian haram diantara kalian, seperti haramnya hari kalian ini, pada bulan kalian ini dan negeri kalian ini. Ingatlah! Tidaklah seorang berbuat (kemaksiatan) kecuali atas dirinya sendiri, maka janganlah orang tua menzhalimi anaknya. Ingatlah! Sesungguhnya syaitan telah berputus asa untuk disembah di negeri kalian ini selamanya. Tetapi ia akan mendapatkan ketaatan pada sebagian amal perbuatan yang kalian hinakan, sehingga ia (setan) ridla dengannya. Ingatlah! Bahwa setiap darah dari darah (yang dicecerkan) Jahiliyyah itu dihinakan, dan darah yang pertama aku hinakan adalah darah Harits bin Abdul muththalib (seseorang yang dulu mencari wanita menyusui dari kalangan bani Laits, lalu ia dibunuh oleh kaum Huzail). Ketahuilah bahwa setiap riba dari riba Jahiliyyah itu dihinakan. Bagi kalian adalah harta pokok kalian, selama kalian tidak menzhalimi dan tidak dizhalimi. Ingatlah! Wahai umatku. Apakah aku telah menyampaikannya? ' Beliau mengulang pertanyaannya tiga kali. Orang-orangpun menjawab; 'Ya'. Lalu beliau bersabda: 'Ya Allah saksikanlah.' Beliau mengulang ucapannya ini tiga kali.\""
            },
            {
                "number": 3012,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ السَّلَامِ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْخَيْفِ مِنْ مِنًى فَقَالَ نَضَّرَ اللَّهُ امْرَأً سَمِعَ مَقَالَتِي فَبَلَّغَهَا فَرُبَّ حَامِلِ فِقْهٍ غَيْرُ فَقِيهٍ وَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ ثَلَاثٌ لَا يُغِلُّ عَلَيْهِنَّ قَلْبُ مُؤْمِنٍ إِخْلَاصُ الْعَمَلِ لِلَّهِ وَالنَّصِيحَةُ لِوُلَاةِ الْمُسْلِمِينَ وَلُزُومُ جَمَاعَتِهِمْ فَإِنَّ دَعْوَتَهُمْ تُحِيطُ مِنْ وَرَائِهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair]; telah menceritakan kepada kami [Ayahku] dari [Muhammad bin Ishaq] dari [Abdussalam] dari [Az Zuhri] dari [Muhammad Jubair bin Muth'im] dari [Bapaknya], ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berdiri di kaki bukit Mina seraya bersabda: 'Semoga Allah menyenangkan seseorang yang mendengarkan perkataanku lalu menyampaikannya. Berapa banyak orang yang membawa berita ilmu tetapi ia bukanlah orang yang berilmu, dan beberapa banyak orang yang membawa ilmu kepada orang yang lebih berilmu darinya.' Tiga perkara dimana hati orang beriman tidak akan berkhianat kepadanya: mengikhlaskan perbuatannya hanya karena Allah, memberi nasehat kepada penguasa kaum muslimin dan bergabung dengan jama'ah (kelompok) mereka. Karena doa mereka akan selalu menyelimuti (meliputi) dibelakang mereka.\""
            },
            {
                "number": 3013,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ تَوْبَةَ حَدَّثَنَا زَافِرُ بْنُ سُلَيْمَانَ عَنْ أَبِي سِنَانٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى نَاقَتِهِ الْمُخَضْرَمَةِ بِعَرَفَاتٍ فَقَالَ أَتَدْرُونَ أَيُّ يَوْمٍ هَذَا وَأَيُّ شَهْرٍ هَذَا وَأَيُّ بَلَدٍ هَذَا قَالُوا هَذَا بَلَدٌ حَرَامٌ وَشَهْرٌ حَرَامٌ وَيَوْمٌ حَرَامٌ قَالَ أَلَا وَإِنَّ أَمْوَالَكُمْ وَدِمَاءَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا فِي يَوْمِكُمْ هَذَا أَلَا وَإِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ وَأُكَاثِرُ بِكُمْ الْأُمَمَ فَلَا تُسَوِّدُوا وَجْهِي أَلَا وَإِنِّي مُسْتَنْقِذٌ أُنَاسًا وَمُسْتَنْقَذٌ مِنِّي أُنَاسٌ فَأَقُولُ يَا رَبِّ أُصَيْحَابِي فَيَقُولُ إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Taubah]; telah menceritakan kepada kami [Zafir bin Sulaiman] dari [Abu Sinan] dari [Amru bin Murrah] dari [Murrah] dari [Abdullah bin Mas'ud] radliallahu 'anhu, ia berkata; \"Rasulullah bersabda saat di Arafah ketika berada di atas untanya yang terpotong ujung telinganya: 'Tahukah kalian hari apakah ini? Bulan apakah ini? Dan negeri apakah ini? ' Mereka menjawab; 'Ini adalah negeri haram, bulan haram, dan hari haram.' Beliau bersabda: 'Ingatlah! Sesungguhnya harta dan darah kalian diharamkan atas kalian, seperti keharaman bulan kalian ini, di negeri kalian ini, dan pada hari kalian ini. Ingatlah! Sesungguhnya aku orang yang mendahului kalian di telaga surga, dan aku akan memperbanyak umat dengan kalian, maka janganlah kalian mencoreng wajahku. Ingatlah! Sesungguhnya aku adalah orang yang menyelamatkan manusia, dan mereka akan meminta bantuan keselamatan dariku.' Aku berkata kepada tuhanku: 'Wahai Tuhan, bagaimana dengan para sahabatku? ' Allah menjawab: 'Sesungguhnya kamu tidak tahu apa yang mereka perbuat (ada-adakan) setelah kamu tiada'.\""
            },
            {
                "number": 3014,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ حَدَّثَنَا هِشَامُ بْنُ الْغَازِ قَالَ سَمِعْتُ نَافِعًا يُحَدِّثُ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَفَ يَوْمَ النَّحْرِ بَيْنَ الْجَمَرَاتِ فِي الْحَجَّةِ الَّتِي حَجَّ فِيهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ يَوْمٍ هَذَا قَالُوا يَوْمُ النَّحْرِ قَالَ فَأَيُّ بَلَدٍ هَذَا قَالُوا هَذَا بَلَدُ اللَّهِ الْحَرَامُ قَالَ فَأَيُّ شَهْرٍ هَذَا قَالُوا شَهْرُ اللَّهِ الْحَرَامُ قَالَ هَذَا يَوْمُ الْحَجِّ الْأَكْبَرِ وَدِمَاؤُكُمْ وَأَمْوَالُكُمْ وَأَعْرَاضُكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ هَذَا الْبَلَدِ فِي هَذَا الشَّهْرِ فِي هَذَا الْيَوْمِ ثُمَّ قَالَ هَلْ بَلَّغْتُ قَالُوا نَعَمْ فَطَفِقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ اشْهَدْ ثُمَّ وَدَّعَ النَّاسَ فَقَالُوا هَذِهِ حَجَّةُ الْوَدَاعِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar]; telah menceritakan kepada kami [Shadaqah bin Khalid]; telah menceritakan kepada kami [Hisyam bin Al Ghaz] berkata; Aku mendengar [Nafi'] menceritakan dari [Ibnu Umar] radliallahu 'anhu, bahwa pada waktu haji, Rasulullah shallallahu 'alaihi wasallam melakukan wukuf diantara jamarat pada hari 'Ied Adha. Lantas beliau bersabda: \"Hari apakah ini?\" Para sahabat menjawab; 'Hari Nahr ('Ied Adha).' Lalu beliau kembali bertanya: 'Negeri apakah ini? ' Mereka menjawab; 'Ini adalah negeri Allah yang haram.' Kemudian beliau bertanya lagi: 'Bulan apakah ini? ' Mereka menjawab bulan Allah yang haram.' Kemudian beliau bersabda: 'Ini adalah haji Akbar. Darah, harta dan kehormatan kalian adalah haram atas diri kalian, seperti keharaman negeri ini, pada bulan ini, dan hari ini.' Kemudian beliau bertanya: 'Apakah aku telah menyampaikannya? ' Mereka menjawab; 'Ya'. Nabi shallallahu 'alaihi wasallam lantas bersabda: 'Ya Allah saksikanlah.' Kemudian beliau menyampaikan salam perpisahan kepada semua orang. Hingga mereka menyebutnya 'Ini adalah haji Wada'.\""
            },
            {
                "number": 3015,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي مُحَمَّدُ بْنُ طَارِقٍ عَنْ طَاوُسٍ وَأَبِي الزُّبَيْرِ عَنْ عَائِشَةَ وَابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَّرَ طَوَافَ الزِّيَارَةِ إِلَى اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Bakar bin Khalaf Abu Bisyr]; telah menceritakan kepada kami [Yahya bin Sa'id]; telah menceritakan kepada kami [Sufyan]; telah menceritakan kepadaku [Muhammad bin Thariq] dari [Thawush] dan [Abu Zubair] dari [Aisyah] dan [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam mengakhirkan thawaf ziyarah hingga malam hari."
            },
            {
                "number": 3016,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ وَهْبٍ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَرْمُلْ فِي السَّبْعِ الَّذِي أَفَاضَ فِيهِ قَالَ عَطَاءٌ وَلَا رَمَلَ فِيهِ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya]; telah menceritakan kepada kami [Ibnu Wahab]; telah memberitakan kepada kami [Ibnu Juraij] dari [Atha`] dari [Abdullah bin Abbas] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam belum pernah berlari kecil pada tujuh putaran dalam thawaf Ifadhah. 'Atha berkata; \"Dan beliau tidak pernah berlari kecil dalam thawaf itu.\""
            },
            {
                "number": 3017,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ عُثْمَانَ بْنِ الْأَسْوَدِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ قَالَكُنْتُ عِنْدَ ابْنِ عَبَّاسٍ جَالِسًا فَجَاءَهُ رَجُلٌ فَقَالَ مِنْ أَيْنَ جِئْتَ قَالَ مِنْ زَمْزَمَ قَالَ فَشَرِبْتَ مِنْهَا كَمَا يَنْبَغِي قَالَ وَكَيْفَ قَالَ إِذَا شَرِبْتَ مِنْهَا فَاسْتَقْبِلْ الْقِبْلَةَ وَاذْكُرْ اسْمَ اللَّهِ وَتَنَفَّسْ ثَلَاثًا وَتَضَلَّعْ مِنْهَا فَإِذَا فَرَغْتَ فَاحْمَدْ اللَّهَ عَزَّ وَجَلَّ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ آيَةَ مَا بَيْنَنَا وَبَيْنَ الْمُنَافِقِينَ إِنَّهُمْ لَا يَتَضَلَّعُونَ مِنْ زَمْزَمَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [ubaidhullah bin Musa] dari [Utsman bin Al Aswad] dari [Muhammad bin Abdurrahman bin Abu Bakar], ia berkata; \"Aku sedang duduk disamping [Ibnu 'Abbas], lalu datanglah seorang lelaki kepadanya, kemudian dia bertanya; 'Dari mana kamu? ' Dia menjawab; 'Dari zamzam.' Dia bertanya lagi; 'Apakah kamu meminum darinya sebagaimana mestinya? ' Dia berkata; 'Bagaimana? ' Dia menjawab: 'Apabila kamu meminumnya, menghadaplah ke Kiblat, bacalah bismillah, bernafas sebanyak tiga kali, dan berpuas-puaslah sampai seperti mau keluar lagi, dan apabila kamu telah selesai, pujilah Allah 'azza wajalla. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya tanda perbedaan diantara kita dan orang-orang munafiq adalah mereka tidak berpuas-puas meminum air zamzam.'"
            },
            {
                "number": 3018,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ الْمُؤَمَّلِ أَنَّهُ سَمِعَ أَبَا الزُّبَيْرِ يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَاءُ زَمْزَمَ لِمَا شُرِبَ لَهُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar]; telah menceritakan kepada kami [Al Walid bin Muslim] berkata; [Abdullah bin Mu`ammal] berkata; bahwa ia mendengar [Abu Az Zubair] berkata; Aku mendengar [Jabir bin Abdullah] radliallahu 'anhu, ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Air Zamzam (berkhasiat) sesuai dengan niat (tujuan) diminum (oleh penggunanya).'"
            },
            {
                "number": 3019,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ عَنْ الْأَوْزَاعِيِّ حَدَّثَنِي حَسَّانُ بْنُ عَطِيَّةَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ الْكَعْبَةَ وَمَعَهُ بِلَالٌ وَعُثْمَانُ بْنُ شَيْبَةَ فَأَغْلَقُوهَا عَلَيْهِمْ مِنْ دَاخِلٍ فَلَمَّا خَرَجُوا سَأَلْتُ بِلَالًا أَيْنَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَنِي أَنَّهُ صَلَّى عَلَى وَجْهِهِ حِينَ دَخَلَ بَيْنَ الْعَمُودَيْنِ عَنْ يَمِينِهِ ثُمَّ لُمْتُ نَفْسِي أَنْ لَا أَكُونَ سَأَلْتُهُ كَمْ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi]; telah menceritakan kepada kami [Umar bin Abdul Wahid] dari [Al Auza'i]; telah menceritakan kepadaku [Hassan bin 'Athiyyah]; telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] radliallahu 'anhu, ia berkata; \"Rasulullah pada hari penaklukan kota Makkah (fathul Makkah) memasuki Ka'bah, dan (ikut masuk) bersama beliau Bilal, Utsman bin Syaibah, lalu mereka menutupnya dari dalam. Dan ketika mereka keluar, aku pun bertanya kepada [Bilal]; 'Di mana Rasulullah shallallahu 'alaihi wasallam sholat? ' Bilal mengabariku bahwa beliau sholat di hadapannya. (Yaitu) ketika masuk diantara dua tiang di sisi kanan. Kemudian kusalahkan diriku sendiri karena tidak menanyakan berapa raka'atkah Rasulullah shallallahu 'alaihi wasallam sholat.'"
            },
            {
                "number": 3020,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ الْمَلِكِ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِي وَهُوَ قَرِيرُ الْعَيْنِ طَيِّبُ النَّفْسِ ثُمَّ رَجَعَ إِلَيَّ وَهُوَ حَزِينٌ فَقُلْتُ يَا رَسُولَ اللَّهِ خَرَجْتَ مِنْ عِنْدِي وَأَنْتَ قَرِيرُ الْعَيْنِ وَرَجَعْتَ وَأَنْتَ حَزِينٌ فَقَالَ إِنِّي دَخَلْتُ الْكَعْبَةَ وَوَدِدْتُ أَنِّي لَمْ أَكُنْ فَعَلْتُ إِنِّي أَخَافُ أَنْ أَكُونَ أَتْعَبْتُ أُمَّتِي مِنْ بَعْدِي",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Isma'il bin Abdul Malik] dari [Ibnu Abu Mulaikah] dari [Aisyah], ia berkata; \"Nabi shallallahu 'alaihi wasallam keluar dari sisiku dalam kondisi matanya sejuk dan jiwanya tenang, kemudian kembali kepadaku dalam kondisi sedih, maka aku bertanya; 'Wahai Rasulullah, engkau keluar dari sisiku sedang engkau dalam kondisi sejuk dipandang, dan engkau kembali dalam keadaan sedih.' Beliau bersabda: 'Aku masuk ke dalam Ka'bah, dan aku berkeinginan sekali untuk tidak melakukannya, aku khawatir jika aku membuat umatku mengikuti setelah kepergianku.'"
            },
            {
                "number": 3021,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَاسْتَأْذَنَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيتَ بِمَكَّةَ أَيَّامَ مِنًى مِنْ أَجْلِ سِقَايَتِهِ فَأَذِنَ لَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Abdullah bin Numair]; telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhu, ia berkata; Abbas bin Abdul Muththalib meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk bermalam di Makkah pada hari-hari mabit di Mina untuk (menjalankan tugas) memberi minum (para jama'ah). Lalu beliau pun mengizinkannya.\""
            },
            {
                "number": 3022,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَمْ يُرَخِّصْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَحَدٍ يَبِيتُ بِمَكَّةَ إِلَّا لِلْعَبَّاسِ مِنْ أَجْلِ السِّقَايَةِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Hannad bin As Sari], keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Isma'il bin Muslim] dari [Atha`] dari [Ibnu Abbas] berkata; Rasulullah shallallahu 'alaihi wasallam tidak meringankan seorang pun bermalam di Makkah kecuali kepada 'Abbas dikarenakan ia memberikan air minum untuk jama'ah haji."
            },
            {
                "number": 3023,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ وَعَبْدَةُ وَوَكِيعٌ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْإِنَّ نُزُولَ الْأَبْطَحِ لَيْسَ بِسُنَّةٍ إِنَّمَا نَزَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَكُونَ أَسْمَحَ لِخُرُوجِهِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari]; telah menceritakan kepada kami [Ibnu Abu Zaidah] dan [Abdah] dan [Waki'] dan [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Waki'] dan [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Hafsh bin Ghiyats] semuanya dari [Hisyam bin Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata; \"Sesungguhnya singgah di padang pasir berkerikil bukanlah sunnah. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam singgah agar lebih mudah keluar (dari sana).\""
            },
            {
                "number": 3024,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ عَمَّارِ بْنِ زُرَيْقٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْادَّلَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ النَّفْرِ مِنْ الْبَطْحَاءِ ادِّلَاجًا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Mu'awiyah bin Hisyam] dari [Ammar bin Zuraiq] dari [Al `A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] radliallahu 'anha, ia berkata; \"Nabi shallallahu 'alaihi wasallam keluar dari Batha pada malam hari saat hari Nafar (pulang dari Mina).\""
            },
            {
                "number": 3025,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ يَنْزِلُونَ بِالْأَبْطَحِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya]; telah menceritakan kepada kami [Abdurrazak]; telah memberitakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] berkata; bahwa Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, Umar dan Utsman berhenti di Batha'."
            },
            {
                "number": 3026,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ سُلَيْمَانَ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّاسُ يَنْصَرِفُونَ كُلَّ وَجْهٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar]; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Sulaiman] dari [Thawush] dari [Ibnu Abbas] berkata; \"Manusia pada bubar dari seluruh penjuru arah, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak ada seorangpun pergi hingga singgah terakhirnya diBaitullah'.\""
            },
            {
                "number": 3027,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَزِيدَ عَنْ طَاوُسٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْفِرَ الرَّجُلُ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Ibrahim bin Yazid] dari [Thawush] dari [Ibnu Umar] radliallahu 'anhu, ia berkata; Rasulullah Shallallahu melarang seorang laki-laki pulang kembali hingga ia sampai di Baitullah."
            },
            {
                "number": 3028,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ وَعُرْوَةَ عَنْ عَائِشَةَ قَالَتْحَاضَتْ صَفِيَّةُ بِنْتُ حُيَيٍّ بَعْدَ مَا أَفَاضَتْ قَالَتْ عَائِشَةُ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَابِسَتُنَا هِيَ فَقُلْتُ إِنَّهَا قَدْ أَفَاضَتْ ثُمَّ حَاضَتْ بَعْدَ ذَلِكَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْتَنْفِرْ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Urwah] dari [Aisyah]; Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Muhammad bin Rumh]; telah memberitakan kepada kami [Al Laits bin Sa'ad] dari [Ibnu Syihab] dari [Abu Salamah] dan [Urwah] dari [Aisyah] berkata; Shafiyyah binti Huyai terkena haid selepas melakukan thawaf ifadhah, hal itu aku sampaikan kepada Rasulullah shallallahu 'alaihi wasallam dan beliau bersabda: 'Apakah ia tengah di kamarnya? ' Aku menjawab; 'Dia telah melakukan thawaf ifadah dan baru mendapatkan haidnya setelah itu.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Baiklah kalau begitu ia boleh pergi.'"
            },
            {
                "number": 3029,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفِيَّةَ فَقُلْنَا قَدْ حَاضَتْ فَقَالَ عَقْرَى حَلْقَى مَا أُرَاهَا إِلَّا حَابِسَتَنَا فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ طَافَتْ يَوْمَ النَّحْرِ قَالَ فَلَا إِذَنْ مُرُوهَا فَلْتَنْفِرْ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah]; telah menceritakan kepada kami [Al `A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] berkata; Rasulullah shallallahu 'alaihi wasallam menyebut Shafiyyah, kami menjawab; \"Ia sedang haid.\" Beliau bertanya: 'Apakah kalian menahannya? ' Aku menajawab; 'Ia telah melakukan thawaf wahai Rasulullah? ' Beliau menjawab: 'Perintahkan agar ia segera pergi'."
            },
            {
                "number": 3030,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ قَالَدَخَلْنَا عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ فَلَمَّا انْتَهَيْنَا إِلَيْهِ سَأَلَ عَنْ الْقَوْمِ حَتَّى انْتَهَى إِلَيَّ فَقُلْتُ أَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ فَأَهْوَى بِيَدِهِ إِلَى رَأْسِي فَحَلَّ زِرِّي الْأَعْلَى ثُمَّ حَلَّ زِرِّي الْأَسْفَلَ ثُمَّ وَضَعَ كَفَّهُ بَيْنَ ثَدْيَيَّ وَأَنَا يَوْمَئِذٍ غُلَامٌ شَابٌّ فَقَالَ مَرْحَبًا بِكَ سَلْ عَمَّا شِئْتَ فَسَأَلْتُهُ وَهُوَ أَعْمَى فَجَاءَ وَقْتُ الصَّلَاةِ فَقَامَ فِي نِسَاجَةٍ مُلْتَحِفًا بِهَا كُلَّمَا وَضَعَهَا عَلَى مَنْكِبَيْهِ رَجَعَ طَرَفَاهَا إِلَيْهِ مِنْ صِغَرِهَا وَرِدَاؤُهُ إِلَى جَانِبِهِ عَلَى الْمِشْجَبِ فَصَلَّى بِنَا فَقُلْتُ أَخْبِرْنَا عَنْ حَجَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بِيَدِهِ فَعَقَدَ تِسْعًا وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَثَ تِسْعَ سِنِينَ لَمْ يَحُجَّ فَأَذَّنَ فِي النَّاسِ فِي الْعَاشِرَةِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجٌّ فَقَدِمَ الْمَدِينَةَ بَشَرٌ كَثِيرٌ كُلُّهُمْ يَلْتَمِسُ أَنْ يَأْتَمَّ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيَعْمَلَ بِمِثْلِ عَمَلِهِ فَخَرَجَ وَخَرَجْنَا مَعَهُ فَأَتَيْنَا ذَا الْحُلَيْفَةِ فَوَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ أَصْنَعُ قَالَ اغْتَسِلِي وَاسْتَثْفِرِي بِثَوْبٍ وَأَحْرِمِي فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى إِذَا اسْتَوَتْ بِهِ نَاقَتُهُ عَلَى الْبَيْدَاءِ قَالَ جَابِرٌ نَظَرْتُ إِلَى مَدِّ بَصَرِي مِنْ بَيْنِ يَدَيْهِ بَيْنَ رَاكِبٍ وَمَاشٍ وَعَنْ يَمِينِهِ مِثْلُ ذَلِكَ وَعَنْ يَسَارِهِ مِثْلُ ذَلِك وَمِنْ خَلْفِهِ مِثْلُ ذَلِكَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِنَا وَعَلَيْهِ يَنْزِلُ الْقُرْآنُ وَهُوَ يَعْرِفُ تَأْوِيلَهُ مَا عَمِلَ بِهِ مِنْ شَيْءٍ عَمِلْنَا بِهِ فَأَهَلَّ بِالتَّوْحِيدِ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لَا شَرِيكَ لَكَ وَأَهَلَّ النَّاسُ بِهَذَا الَّذِي يُهِلُّونَ بِهِ فَلَمْ يَرُدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِمْ شَيْئًا مِنْهُ وَلَزِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَلْبِيَتَهُ قَالَ جَابِرٌ لَسْنَا نَنْوِي إِلَّا الْحَجَّ لَسْنَا نَعْرِفُ الْعُمْرَةَ حَتَّى إِذَا أَتَيْنَا الْبَيْتَ مَعَهُ اسْتَلَمَ الرُّكْنَ فَرَمَلَ ثَلَاثًا وَمَشَى أَرْبَعًا ثُمَّ قَامَ إِلَى مَقَامِ إِبْرَاهِيمَ فَقَالَ{ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى }فَجَعَلَ الْمَقَامَ بَيْنَهُ وَبَيْنَ الْبَيْتِ فَكَانَ أَبِي يَقُولُ وَلَا أَعْلَمُهُ إِلَّا ذَكَرَهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ اللَّهُ أَحَدٌ ثُمَّ رَجَعَ إِلَى الْبَيْتِ فَاسْتَلَمَ الرُّكْنَ ثُمَّ خَرَجَ مِنْ الْبَابِ إِلَى الصَّفَا حَتَّى إِذَا دَنَا مِنْ الصَّفَا قَرَأَ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ }نَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ فَكَبَّرَ اللَّهَ وَهَلَّلَهُ وَحَمِدَهُ وَقَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ ثُمَّ دَعَا بَيْنَ ذَلِكَ وَقَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ ثُمَّ نَزَلَ إِلَى الْمَرْوَةِ فَمَشَى حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ رَمَلَ فِي بَطْنِ الْوَادِي حَتَّى إِذَا صَعِدَتَا يَعْنِي قَدَمَاهُ مَشَى حَتَّى أَتَى الْمَرْوَةَ فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا فَلَمَّا كَانَ آخِرُ طَوَافِهِ عَلَى الْمَرْوَةِ قَالَ لَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمْ أَسُقْ الْهَدْيَ وَجَعَلْتُهَا عُمْرَةً فَمَنْ كَانَ مِنْكُمْ لَيْسَ مَعَهُ هَدْيٌ فَلْيَحْلِلْ وَلْيَجْعَلْهَا عُمْرَةً فَحَلَّ النَّاسُ كُلُّهُمْ وَقَصَّرُوا إِلَّا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ كَانَ مَعَهُ الْهَدْيُ فَقَامَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ فَقَالَ يَا رَسُولَ اللَّهِ أَلِعَامِنَا هَذَا أَمْ لِأَبَدِ الْأَبَدِ قَالَ فَشَبَّكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابِعَهُ فِي الْأُخْرَى وَقَالَ دَخَلَتْ الْعُمْرَةُ فِي الْحَجِّ هَكَذَا مَرَّتَيْنِ لَا بَلْ لِأَبَدِ الْأَبَدِ قَالَ وَقَدِمَ عَلِيٌّ بِبُدْنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَجَدَ فَاطِمَةَ مِمَّنْ حَلَّ وَلَبِسَتْ ثِيَابًا صَبِيغًا وَاكْتَحَلَتْ فَأَنْكَرَ ذَلِكَ عَلَيْهَا عَلِيٌّ فَقَالَتْ أَمَرَنِي أَبِي بِهَذَا فَكَانَ عَلِيٌّ يَقُولُ بِالْعِرَاقِ فَذَهَبْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُحَرِّشًا عَلَى فَاطِمَةَ فِي الَّذِي صَنَعَتْهُ مُسْتَفْتِيًا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي ذَكَرَتْ عَنْهُ وَأَنْكَرْتُ ذَلِكَ عَلَيْهَا فَقَالَ صَدَقَتْ صَدَقَتْ مَاذَا قُلْتُ حِينَ فَرَضْتَ الْحَجَّ قَالَ قُلْتُ اللَّهُمَّ إِنِّي أُهِلُّ بِمَا أَهَلَّ بِهِ رَسُولُكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَإِنَّ مَعِي الْهَدْيَ فَلَا تَحِلَّ قَالَ فَكَانَ جَمَاعَةُ الْهَدْيِ الَّذِي جَاءَ بِهِ عَلِيٌّ مِنْ الْيَمَنِ وَالَّذِي أَتَى بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ مِائَةً ثُمَّ حَلَّ النَّاسُ كُلُّهُمْ وَقَصَّرُوا إِلَّا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ كَانَ مَعَهُ هَدْيٌ فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ وَتَوَجَّهُوا إِلَى مِنًى أَهَلُّوا بِالْحَجِّ فَرَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِمِنًى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالصُّبْحَ ثُمَّ مَكَثَ قَلِيلًا حَتَّى طَلَعَتْ الشَّمْسُ وَأَمَرَ بِقُبَّةٍ مِنْ شَعَرٍ فَضُرِبَتْ لَهُ بِنَمِرَةَ فَسَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَشُكُّ قُرَيْشٌ إِلَّا أَنَّهُ وَاقِفٌ عِنْدَ الْمَشْعَرِ الْحَرَامِ أَوْ الْمُزْدَلِفَةِ كَمَا كَانَتْ قُرَيْشٌ تَصْنَعُ فِي الْجَاهِلِيَّةِ فَأَجَازَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَى عَرَفَةَ فَوَجَدَ الْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ فَنَزَلَ بِهَا حَتَّى إِذَا زَاغَتْ الشَّمْسُ أَمَرَ بِالْقَصْوَاءِ فَرُحِلَتْ لَهُ فَرَكِبَ حَتَّى أَتَى بَطْنَ الْوَادِي فَخَطَبَ النَّاسَ فَقَالَ إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلَا وَإِنَّ كُلَّ شَيْءٍ مِنْ أَمْرِ الْجَاهِلِيَّةِ مَوْضُوعٌ تَحْتَ قَدَمَيَّ هَاتَيْنِ وَدِمَاءُ الْجَاهِلِيَّةِ مَوْضُوعَةٌ وَأَوَّلُ دَمٍ أَضَعُهُ دَمُ رَبِيعَةَ بْنِ الْحَارِثِ كَانَ مُسْتَرْضِعًا فِي بَنِي سَعْدٍ فَقَتَلَتْهُ هُذَيْلٌ وَرِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ رِبًا أَضَعُهُ رِبَانَا رِبَا الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ فَإِنَّهُ مَوْضُوعٌ كُلُّهُ فَاتَّقُوا اللَّهَ فِي النِّسَاءِ فَإِنَّكُمْ أَخَذْتُمُوهُنَّ بِأَمَانَةِ اللَّهِ وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ وَإِنَّ لَكُمْ عَلَيْهِنَّ أَنْ لَا يُوطِئْنَ فُرُشَكُمْ أَحَدًا تَكْرَهُونَهُ فَإِنْ فَعَلْنَ ذَلِكَ فَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ وَلَهُنَّ عَلَيْكُمْ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ وَقَدْ تَرَكْتُ فِيكُمْ مَا لَمْ تَضِلُّوا إِنْ اعْتَصَمْتُمْ بِهِ كِتَابَ اللَّهِ وَأَنْتُمْ مَسْئُولُونَ عَنِّي فَمَا أَنْتُمْ قَائِلُونَ قَالُوا نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَأَدَّيْتَ وَنَصَحْتَ فَقَالَ بِإِصْبَعِهِ السَّبَّابَةِ إِلَى السَّمَاءِ وَيَنْكُبُهَا إِلَى النَّاسِ اللَّهُمَّ اشْهَدْ اللَّهُمَّ اشْهَدْ ثَلَاثَ مَرَّاتٍ ثُمَّ أَذَّنَ بِلَالٌ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا ثُمَّ رَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَى الْمَوْقِفَ فَجَعَلَ بَطْنَ نَاقَتِهِ إِلَى الصَّخَرَاتِ وَجَعَلَ حَبْلَ الْمُشَاةِ بَيْنَ يَدَيْهِ وَاسْتَقْبَلَ الْقِبْلَةَ فَلَمْ يَزَلْ وَاقِفًا حَتَّى غَرَبَتْ الشَّمْسُ وَذَهَبَتْ الصُّفْرَةُ قَلِيلًا حَتَّى غَابَ الْقُرْصُ وَأَرْدَفَ أُسَامَةَ بْنَ زَيْدٍ خَلْفَهُ فَدَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ شَنَقَ الْقَصْوَاءَ بِالزِّمَامِ حَتَّى إِنَّ رَأْسَهَا لَيُصِيبُ مَوْرِكَ رَحْلِهِ وَيَقُولُ بِيَدِهِ الْيُمْنَى أَيُّهَا النَّاسُ السَّكِينَةَ السَّكِينَةَ كُلَّمَا أَتَى حَبْلًا مِنْ الْحِبَالِ أَرْخَى لَهَا قَلِيلًا حَتَّى تَصْعَدَ ثُمَّ أَتَى الْمُزْدَلِفَةَ فَصَلَّى بِهَا الْمَغْرِبَ وَالْعِشَاءَ بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا ثُمَّ اضْطَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى طَلَعَ الْفَجْرُ فَصَلَّى الْفَجْرَ حِينَ تَبَيَّنَ لَهُ الصُّبْحُ بِأَذَانٍ وَإِقَامَةٍ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَرَقِيَ عَلَيْهِ فَحَمِدَ اللَّهَ وَكَبَّرَهُ وَهَلَّلَهُ فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا ثُمَّ دَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ وَأَرْدَفَ ال",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar]; telah menceritakan kepada kami [Hatim bin Isma'il]; telah menceritakan kepada kami [Ja'far bin Muhammad] dari [Ayahnya], ia berkata; \"Aku pernah datang menemui [Jabir bin Abdullah]. Ketika kami menjumpainya, ia bertanya tentang kabar orang-orang, hingga ia bertanya tentang diriku. Maka aku menjawab; 'Aku Muhammad bin Ali bin Husain.' Maka ia letakkan tangannya di atas kepalaku sambil membuka kancing atas dan bawahku, lalu meletakkan pundaknya diantara dadaku dan saat itu aku masih kecil yang menginjak dewasa. Ia berkata; 'Selamat datang, tanyakanlah apa saja yang kamu ingini.' Aku bertanya kepadanya sedang ia seorang yang buta. Hingga tiba waktu sholat sedang ia berdiri di atas sajadahnya, yang apabila ia meletakkan tumitnya pada sisi-sisi sajadah maka akan tertarik karena kecilnya sajadah tersebut, adapun selendangnya menggantung di pundaknya dan ia pun sholat mengimami kami.' Lalu aku bertanya; 'Beritahukan pada kami bagaimana Rasulullah shallallahu 'alaihi wasallam berhaji! ' Maka ia mengisyaratkan dengan tangannya dan ia menjulurkan sembilan (jari jemarinya), dan berkata; 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam berdiam tidak berangkat haji selama sembilan tahun, lalu beliau menyerukan orang-orang untuk menunaikan ibadah haji pada tahun kesepuluh. Rasulullah shallallahu 'alaihi wasallam berangkat haji, lalu datanglah banyak orang ke Madinah, mereka semua ingin berkumpul dengan Nabi shallallahu 'alaihi wasallam dan mengerjakan seperti yang beliau kerjakan. Maka beliaupun berangkat, dan kamipun berangkat bersama beliau. Sesampainya kami di Dzul Hulaifah, Asma' binti Umais melahirkan Muhammad bin Abu Bakar, maka diutuslah kepada beliau untuk menanyakan; 'Apa yang patut aku perbuat? ' Lalu beliau bersabda kepada Asma: 'Mandilah dan ikatlah kencang-kencang dengan kain dan berihramlah.' Kemudian Rasulullah shallallahu 'alaihi wasallam sholat di masjid lalu mengendarai unta Qashwa, dan untanya pun berdiri tegak membawa beliau di atas padang Sahara.' Jabir berkata; 'Aku melihat sejauh pandanganku banyak orang yang berada di depan beliau, antara penunggang kendaraan dan pejalan kaki, juga yang berada di sisi kanan dan kiri serta belakang beliau (terlihat banyak orang). Rasulullah shallallahu 'alaihi wasallam berada di tengah-tengah kami, sedangkan Al Qur'an turun kepada beliau, dan beliau sangat tahu akan takwilnya. Apa saja yang beliau kerjakan, maka kami turut mengerjakannya. Beliau mengeraskan suara tauhid dengan mengucapkan: 'Aku penuhi panggilan-Mu, ya Allah. Aku penuhi panggilan-Mu, aku penuhi panggilan-Mu. Tiada sekutu bagi-Mu, Aku penuhi panggilan-Mu. Sesungguhnya pujian, kenikmatan dan kerajaan hanya milik-Mu, yang tiada sekutu bagi-Mu.' Orang-orang juga mengeraskan suara dengan bacaan yang mereka ucapkan, dan beliau shallallahu 'alaihi wasallam tidak mengatakan apapun atas tindakan mereka itu. Beliau shallallahu 'alaihi wasallam terus membaca talbiyahnya.' Jabir radliallahu 'anhu berkata lagi; 'Kami tidak berniat kecuali menunaikan haji saja, dan kami belum mengenal umrah. Sesampainya kami di Baitullah bersama beliau, beliau segera mengusap (mencium) Rukun (awal Thawaf), lalu berlari kecil tiga putaran dan berjalan biasa pada empat putaran (lainnya). Kemudian beliau pergi menuju maqam Ibrahim, seraya membaca ayat: ' Dan jadikanlah Maqam Ibrahim sebagai tempat sholat.' Beliaupun memposisikan dirinya antara Maqam Ibrahim dengan Baitullah (Ka'bah). -Bapakku berkata; - 'dan aku tidak mengetahui kecuali ia menyebutkannya dari Nabi shallallahu 'alaihi wasallam, bahwa Nabi membaca surah Al Kaafiruun dan Al Ikhlaash dalam sholat dua rakaat (di Maqam Ibrahim). Kemudian beliau kembali ke Baitullah, lalu mengusap (mencium atau menyalami) Rukun (awal thawaf), lantas beliau keluar dari pintu (Ka'bah) menuju bukit Shafa. Dan ketika mendekati Shafa, beliau membaca: ' Sesungguhnya Shafa dan Marwa termasuk syiar-syiar Allah, kita memulai (sa'i) dengan apa yang telah Allah Subhanahu Wa Ta'ala mulai.' Beliau mulai bersa'i dari Shafa, lalu menaiki (bukit itu) hingga dapat melihat Ka'bah, kemudian beliau bertakbir, bertahlil dan bertahmid seraya mengucapkan: 'Tidak ada Tuhan selain Allah semata yang tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya segala pujian. (Dia) yang maha menghidupkan dan maha mematikan, serta Dia maha kuasa atas segala sesuatu. Tidak ada Tuhan selain Allah semata, yang tiada sekutu baginya, yang melaksanakan janji-Nya, menolong hamba-Nya dan mengalahkan seluruh golongan dengan sendirian.' Kemudian beliau berdoa diantara bacaan itu, lalu mengucapkan bacaan seperti itu tiga kali. Beliau lantas turun ke Marwa, sambil berjalan sehingga jika kedua kakinya telah tegak, beliau berlari kecil di tengah lembah. Tatkala kedua kakinya telah mendaki, beliau berjalan sampai tiba di Marwa. Di Marwa beliau melakukan seperti yang beliau lakukan di Shafa. Dan ketika Thawafnya berakhir di Marwa, beliaupun bersabda: 'Seandainya aku menghadap apa yang aku belakangi, maka aku tidak menggiring hewan sembelihan (al hadyu), dan aku menjadikannya umrah. Barang siapa diantara kalian tidak membawa hewan sembelihan, maka bertahllul-lah dan jadikanlah ia sebagai ibadah.' Maka seluruh orangpun bertahallul dan memendekan rambut kecuali Nabi shallallahu 'alaihi wasallam dan orang-orang yang membawa hewan sembelihan. Lalu Suraqah bin Malik bin Ju'syum berdiri seraya berkata; 'Wahai Rasulullah apakah ini berlaku untuk tahun ini, ataukah untuk selamanya'.\" (Perawi) berkata; 'Rasulullah shallallahu 'alaihi wasallam pun merangkai jemarinya dengan jari jemari seraya menjawab: 'Umrah masuk ke dalam haji (haji tamattu') beginilah caranya.' Beliau mengucapkan dua kali lantas bersabda: 'Tidak (ini hanya berlaku untuk tahun ini saja), tetapi untuk selamanya'.' (Perawi) berkata; 'Ali radliallahu 'anhu datang membawa unta (al hadyu) Nabi shallallahu 'alaihi wasallam, maka ia mendapatkan Fathimah termasuk orang yang bertahallul tengah memakai pakaian berwarna dan memakai sipat mata. Ali pun menyalahkannya, maka Fatimah pun berkata; 'Bapakku (Nabi shallallahu 'alaihi wasallam) telah memberitahuku berbuat begini.' Ali radliallahu 'anhu mengatakannya saat di Irak: 'Lalu aku pergi meminta nasehat kepada Rasulullah shallallahu 'alaihi wasallam dan mengeluhkan perbuatan Fatimah yang aku ingkari itu. Maka beliau menjawab: 'Ia (Fatimah) benar, ia benar. Apa yang telah aku katakan ketika kamu ingin melakukan ibadah haji dulu? ' Ali menjawab; 'Aku berkata; 'Ya Allah, aku mengeraskan suara yang dikeraskan oleh Rasul-Mu shallallahu 'alaihi wasallam.' Beliau bersabda: 'Sesungguhnya aku membawa hewan kurban, maka janganlah kamu ikut bertahallul'. (Perawi) berkata; 'Hewan kurban yang dibawa Ali dari Yaman dan yang dibawa Rasulullah shallallahu 'alaihi wasallam dari Madinah berjumlah seratus ekor. Kemudian semua orang bertahallul dan memendekan rambutnya kecuali Nabi shallallahu 'alaihi wasallam dan orang-orang yang membawa hewan kurban. Ketika hari Tarwiyah datang mereka semua menuju Mina dan meneriakkan niat haji. Rasulullah shallallahu 'alaihi wasallam naik kendaraan, dan di sana beliau mengerjakan sholat Dzuhur, Ashar, Maghrib, Isya', dan Subuh. Kemudian menunggu sebentar sampai matahari terbit, lalu memerintahkan untuk mendirikan Kubah di Masy'aril haram maka ditancapkan di Namirah. Rasulullah shallallahu 'alaihi wasallam kemudian berjalan seperti yang biasa kaum Quraisy kerjakan, tetapi beliau berhenti di Masy'aril Haram atau Muzdalifah. Rasulullah shallallahu 'alaihi wasallam membolehkannya sampai tiba di Arafah. Dan ketika mendekati kubah yang telah didirikan di Namirah, beliau singgah di sana. Ketika matahari tergelincir, beliau memerintahkan agar untanya (Qashwa) didatangkan, lalu beliau mengendarainya hingga tiba di perut lembah. Lantas beliau berkhutbah pada khalayak: 'Sesungguhnya darah kalian, harta, kehormatan dan kebahagiaan (kemuliaan) kalian adalah haram sebagaimana keharaman hari kalian ini, dibulan dan negeri kalian ini, camkanlah, sesungguhnya segala perkara jahiliyyah adalah terhina di bawah kakiku ini, darah-darah jahiliyyah telah dihinakan dan darah yang pertama kali aku hinakan adalah darah Rabi'ah bin Harits (yang dahulu meminta susuan dari bani Sa'ad lalu ia dibunuh Hudzail), riba jahiliyyah telah dihapuskan sedang riba yang pertama kali aku hapuskan adalah riba kami, yaitu riba yang dilakukan Abbas bin Abdul Muthallib, semuanya telah dihapuskan. Maka bertaqwalah kepada Allah dari para wanita, karena kalian telah menjadikan mereka isteri dengan amanat Allah dan kalian halalkan farji dengan kalimat Allah. Sesungguhnya hak kalian atas mereka adalah agar mereka tidak membiarkan orang lain yang kalian benci tidur di atas ranjang kalian. Jika isteri-isteri kalian melakukannya, maka pukullah mereka dengan pukulan yang tidak melukai. Dan bagi mereka atas kalian untuk dinafkahi dan diberi pakaian dengan jalan yang baik. Aku tinggalkan untuk kalian dua perkara yang jika kalian berpegang teguh pada keduanya maka kalian tidak akan tersesat yaitu Kitabullah. Dan kalian bertanggung jawab kepadaku. Lalu apa yang ingin kalian katakan? ' Mereka menjawab; 'Kami bersaksi bahwa engkau telah menyampaikan, melaksanakan tugas dan memberikan nasehat. Maka beliau bersabda sambil menunjukan jarinya ke langit: 'Ya Allah, saksikanlah! Ya Allah saksikanlah.' Beliau mengucapkannya sampai tiga kali. Kemudian Bilal mengumandangkan adzan, lalu iqamat, maka beliau mendirikan sholat Zhuhur. (Selepas itu) Bilal kembali beriqamat, lalu beliau mendirikan sholat Ashar dan tidak melakukan sholat apapun diantara keduanya. Kemudian Rasulullah shallallahu 'alaihi wasallam mengendarai kendaraannya sehingga sampai ke tempat wukuf. Lalu beliau mendudukkan untanya (menjadikan perut untanya menyentuh padang) dan menjadikan tali pejalan kaki di depannya, lalu beliau menghadap kiblat. Beliau terus berwukuf sampai terbenamnya matahari dan sinar kekuning-kuningan sedikit sirna serta tenggelamnya bola matahari. Lalu beliau membonceng Usamah bin Said dan bertolak. Beliau pun mengikat Qashwa dengan kendali, hingga kepalanya nyaris menyentuh pangkal kaki kendaraan yang beliau tunggangi. Sambil mengisyaratkan dengan tangan kanannya, beliau bersabda: 'Wahai manusia, tenang, tenang! ' Setiap kali beliau mengulurkan tali kendali untanya, maka beliau menenangkan sedikit sehingga untanya agak naik. Kemudian tibalah beliau di Muzdalifah, lalu mengerjakan sholat Maghrib dan Isya' di sana dengan sekali adzan dan dua kali iqamat. Dan beliau tidak melakukan sholat apapun diantara keduanya. Kemudian beliau shallallahu 'alaihi wasallam berbaring sampai terbit fajar. Beliau mendirikan sholat fajar ketika nampak jelas baginya waktu subuh, dengan sekali adzan dan sekali iqamat. Kemudian beliau mengendarai Qashwa sampai tiba di Masy'aril Haram, lalu beliau menaiki bukitnya lantas memuji Allah (bertahmid), mengagungkan-Nya (bertakbir) dan mengesakan-Nya (bertahlil). Beliau terus melakukan Wukuf sampai matahari benar-benar terang, lalu bertolak sebelum terbit matahari. Beliau membonceng Fadl bin Abbas (seorang laki-laki berambut bagus, putih kulitnya dan ganteng). Ketika Rasulullah shallallahu 'alaihi wasallam bertolak, beliau melintasi para wanita yang sedang berlari, maka beliau memandang kepada mereka lalu meletakkan tangannya ke sisi lain. Sementara Fadl pun memalingkan mukanya ke sisi lain. Sesampainya di Muhassar, beliau bergerak sedikit kemudian mengambil jalan pintas menuju jumrah Kubra (Aqabah), dan langsung sampai di jumrah yang berada di sisi pohon. Lalu beliau melontar tujuh kerikil dengan bertakbir pada setiap lemparan, (dengan) kerikil yang besarnya seperti kerikil ketapel. Dan beliau melontarnya dari perut lembah. Lalu ia bertolak ke tempat menyembelih hewan kurban. Di sana beliau menyembelih sendiri enam puluh tiga ekor hewan kurban, dan menyerahkan kepada Ali sisanya berikut hewan kurbannya. Kemudian beliau memerintahkan dari setiap hewan kurban yang disembelihnya agar sepotong dagingnya disisihkan lalu di letakan di kuali, lantas dimasak. Rasulullah dan Ali pun memakan dan menghirup kuahnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bertolak menuju Ka'bah (untuk mengerjakan Thawaf Ifadhah), lalu beliau mengerjakan sholat Zhuhur di Makkah dan mendatangi Bani Abdul Muththalib yang sedang mengambil air Zamzam. Beliau seraya bersabda: 'Rebutlah wahai Bani Muththalib. Seandainya orang-orang tidak mengungguli kalian dalam pemberian minuman kalian, tentu akan kuperebutkannya bersama kalian.' Lalu mereka pun memberi beliau shallallahu 'alaihi wasallam ember, dan beliau meminum darinya.'"
            },
            {
                "number": 3031,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ عَنْ مُحَمَّدِ بْنِ عَمْرٍو حَدَّثَنِي يَحْيَى بْنُ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ عَنْ عَائِشَةَ قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحَجِّ عَلَى أَنْوَاعٍ ثَلَاثَةٍ فَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ مَعًا وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ مُفْرَدٍ وَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ مُفْرَدَةٍ فَمَنْ كَانَ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ مَعًا لَمْ يَحْلِلْ مِنْ شَيْءٍ مِمَّا حَرُمَ مِنْهُ حَتَّى يَقْضِيَ مَنَاسِكَ الْحَجِّ وَمَنْ أَهَلَّ بِالْحَجِّ مُفْرَدًا لَمْ يَحْلِلْ مِنْ شَيْءٍ مِمَّا حَرُمَ مِنْهُ حَتَّى يَقْضِيَ مَنَاسِكَ الْحَجِّ وَمَنْ أَهَلَّ بِعُمْرَةٍ مُفْرَدَةٍ فَطَافَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ حَلَّ مَا حَرُمَ عَنْهُ حَتَّى يَسْتَقْبِلَ حَجًّا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Muhammad bin Bisyr Al 'Abdi] dari [Muhammad bin Amru]; telah menceritakan kepadaku [Yahya bin Abdurrahman bin Hathib] dari [Aisyah] radliallahu 'anha, ia berkata; \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam untuk menunaikan haji dengan tiga macam cara. Diantara kami ada yang berniat menunaikan haji dan umrah sekaligus, diantara kami ada pula yang berniat mengerjakan haji saja, dan diantara kami ada yang berniat mengerjakan umrah saja. Orang yang berniat mengerjakan haji dan umrah sekaligus, maka ia tidak bertahallul dari suatu yang diharamkan sampai menyelesaikan manasik hajinya. Dan orang yang berniat hanya mengerjakan haji tidak bertahallul dari apa yang diharamkan sampai ia menyelesaikan manasik hajinya. Dan orang yang berniat melaksanakan umrah secara tersendiri, lalu berthawaf di Ka'bah dan mengerjakan Sa'i antara Shafa dan Marwa, (setelah itu) ia dapat bertahallul dari apa yang diharamkan (ketika berihram) sampai datangnya waktu untuk haji.\""
            },
            {
                "number": 3032,
                "arab": "حَدَّثَنَا الْقَاسِمُ بْنُ مُحَمَّدِ بْنِ عَبَّادٍ الْمُهَلَّبِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ حَدَّثَنَا سُفْيَانُ قَالَحَجَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَ حَجَّاتٍ حَجَّتَيْنِ قَبْلَ أَنْ يُهَاجِرَ وَحَجَّةً بَعْدَ مَا هَاجَرَ مِنْ الْمَدِينَةِ وَقَرَنَ مَعَ حَجَّتِهِ عُمْرَةً وَاجْتَمَعَ مَا جَاءَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا جَاءَ بِهِ عَلِيٌّ مِائَةَ بَدَنَةٍ مِنْهَا جَمَلٌ لِأَبِي جَهْلٍ فِي أَنْفِهِ بُرَةٌ مِنْ فِضَّةٍ فَنَحَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ ثَلَاثًا وَسِتِّينَ وَنَحَرَ عَلِيٌّ مَا غَبَرَقِيلَ لَهُ مَنْ ذَكَرَهُ قَالَ جَعْفَرٌ عَنْ أَبِيهِ عَنْ جَابِرٍ وَابْنُ أَبِي لَيْلَى عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Al Qasim bin Muhammad bin Abbad Al Muhallabi]; telah menceritakan kepada kami [Abdullah bin Dawud]; telah menceritakan kepada kami [Sufyan]; ia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah melaksanakan tiga haji, dua haji sebelum hijrah dan sekali haji setelah hijrah, dan beliau berangkat dari Madinah. Beliau menyertakan umrah beserta hajinya (haji Qiran), lalu hewan kurban yang dibawa Nabi shallallahu 'alaihi wasallam dan yang dibawa oleh Ali radliallahu 'anhu dikumpulkan sehingga seratus ekor. Diantara hewan-hewan tersebut terdapat unta jantan milik Abu Jahal yang hidungnya berantaikan perak. Nabi shallallahu 'alaihi wasallam sendiri menyembelih enam puluh tiga ekor, dan Ali menyembelih sisanya.\" [Ja'far] berkata; dari [Ayahnya] dari [Jabir] dan [Ibnu Abu Laila] dari [Al Hakam] dari [Miqsam] dari [Ibnu Abbas]."
            },
            {
                "number": 3033,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَابْنُ عُلَيَّةَ عَنْ حَجَّاجِ بْنِ أَبِي عُثْمَانَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي عِكْرِمَةُ حَدَّثَنِي الْحَجَّاجُ بْنُ عَمْرٍو الْأَنْصَارِيُّ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كُسِرَ أَوْ عَرَجَ فَقَدْ حَلَّ وَعَلَيْهِ حَجَّةٌ أُخْرَىفَحَدَّثْتُ بِهِ ابْنَ عَبَّاسٍ وَأَبَا هُرَيْرَةَ فَقَالَا صَدَقَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah]; telah menceritakan kepada kami [Yahya bin Sa'id] dan [Ibnu Ulayyah] dari [Hajjaj bin Abu Utsman]; Telah menceritakan kepadaku [Yahya bin Abu Katsir]; Telah menceritakan kepadaku ['Ikrimah] dari [Al Hajjaj bin Amru Al Anshari], ia berkata; \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: 'Barang siapa patah (kakinya) atau pincang, maka ia (dianggap) telah bertahallul, dan ia harusmengerjakan haji lainnya.'\" Aku bicarakan hadist ini kepada [Ibnu Abbas] radliallahu 'anhu dan [Abu Hurairah] radliallahu 'anhu, maka keduanya berkata; 'Benar.'"
            },
            {
                "number": 3034,
                "arab": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ قَالَسَأَلْتُ الْحَجَّاجَ بْنَ عَمْرٍو عَنْ حَبْسِ الْمُحْرِمِ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كُسِرَ أَوْ مَرِضَ أَوْ عَرَجَ فَقَدْ حَلَّ وَعَلَيْهِ الْحَجُّ مِنْ قَابِلٍقَالَ عِكْرِمَةُ فَحَدَّثْتُ بِهِ ابْنَ عَبَّاسٍ وَأَبَا هُرَيْرَةَ فَقَالَا صَدَقَ قَالَ عَبْدُ الرَّزَّاقِ فَوَجَدْتُهُ فِي جُزْءِ هِشَامٍ صَاحِبِ الدَّسْتُوَائِيِّ فَأَتَيْتُ بِهِ مَعْمَرًا فَقَرَأَ عَلَيَّ أَوْ قَرَأْتُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Salamah bin Syabib]; telah menceritakan kepada kami [Abdurrazak]; telah memberitakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Ikrimah] dari [Abdullah bin Rafi'] mantan budak Ummu Salamah radliallahu 'anha, ia berkata; Aku menanyai [Al Hajjaj bin Amru] tentang terhalangnya orang yang berihram. Maka ia menjawab; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barang siapa patah (kakinya) atau sakit atau pincang, maka ia (dianggap) telah bertahallul. Dan ia harus mengganti hajinya di lain waktu.'\" [Ikrimah] berkata; 'Aku ceritakan hadist ini kepada [Ibnu Abbas] radliallahu 'anhu dan [Abu Hurairah] radliallahu 'anhu, maka mereka berkata; 'Benar.' Abdurrazak berkata; 'Aku mendapatkannya dibagian Hisyam sahabat Ad Dastuwa`i, lalu aku menemui Ma'mar dan ia membacakan kepadaku atau aku membacakan untuknya.'"
            },
            {
                "number": 3035,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَصْبَهَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ قَالَقَعَدْتُ إِلَى كَعْبِ بْنِ عُجْرَةَ فِي الْمَسْجِدِ فَسَأَلْتُهُ عَنْ هَذِهِ الْآيَةِ{ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ }قَالَ كَعْبٌ فِيَّ أُنْزِلَتْ كَانَ بِي أَذًى مِنْ رَأْسِي فَحُمِلْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ مَا كُنْتُ أُرَى الْجُهْدَ بَلَغَ بِكَ مَا أَرَى أَتَجِدُ شَاةً قُلْتُ لَا قَالَ فَنَزَلَتْ هَذِهِ الْآيَةُ{ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ }قَالَ فَالصَّوْمُ ثَلَاثَةُ أَيَّامٍ وَالصَّدَقَةُ عَلَى سِتَّةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ مِنْ طَعَامٍ وَالنُّسُكُ شَاةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Muhammad bin Al Walid], keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far]; telah menceritakan kepada kami [Syu'bah] dari [Abdurrahman bin Al Ashbahani] dari [Abdullah bin Ma'qil], ia berkata; \"Aku duduk di samping [Ka'ab bin 'Ujrah] di dalam masjid, lalu kutanyai tentang firman Allah; '..maka wajiblah atasnya berfidyah, yaitu berpuasa atau bersedekah atau berkurban…' (Qs Albaqarah 2: 196), Ka'ab pun menjawab; 'Ayat itu diturunkan tentang diriku. Karena dulu aku pernah terserang penyakit di kepalaku, lalu aku dibawa kepada Rasulullah shallallahu 'alaihi wasallam sedang kutu busuk berhamburan di wajahku.' Maka beliau bersabda: 'Aku tidak seharusnya melihat keletihan yang menimpamu seperti yang kulihat ini. Apakah kamu memiliki seekor kambing? ' Aku menjawab; 'Tidak.' (Perawi berkata); 'Maka turunlah ayat ini, '..maka wajiblah atasnya berfidyah, yaitu berpuasa, atau bersedekah atau berkurban..' (Perawi) berkata; 'Puasa tiga hari, sedekah untuk enam orang miskin dan setiap satu orang miskin diberi setengah sha' makanan pokok, serta berkurban dengan seekor kambing.'"
            },
            {
                "number": 3036,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَأَمَرَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ آذَانِي الْقَمْلُ أَنْ أَحْلِقَ رَأْسِي وَأَصُومَ ثَلَاثَةَ أَيَّامٍ أَوْ أُطْعِمَ سِتَّةَ مَسَاكِينَ وَقَدْ عَلِمَ أَنْ لَيْسَ عِنْدِي مَا أَنْسُكُ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim]; telah menceritakan kepada kami [Abdullah bin Nafi'] dari [Usamah bin Zaid] dari [Muhammad bin Ka'ab] dari [Ka'ab bin 'Ujrah], ia berkata; \"Nabi shallallahu 'alaihi wasallam telah memerintahkanku, ketika kutu busuk menyakitiku agar aku mencukur kepalaku, dan berpuasa tiga hari, atau memberi makan enam orang miskin. Karena beliau tahu aku tidak mempunyai hewan yang dapat kukorbankan.\""
            },
            {
                "number": 3037,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ صَائِمٌ مُحْرِمٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabah]; telah memberitakan kepada kami [Sufyan bin 'Uyainah] dari [Yazid bin Abu Ziyad] dari [Miqsam] dari [Ibnu Abbas] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam pernah berbekam, (saat itu) beliau sedang berpuasa dan berihram."
            },
            {
                "number": 3038,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الضَّيْفِ عَنْ ابْنِ خُثَيْمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ عَنْ رَهْصَةٍ أَخَذَتْهُ",
                "id": "Telah menceritakan kepada kami [Bakar bin Khalaf Abu Bisyr]; telah menceritakan kepada kami [Muhammad bin Abu Adl Dlaif] dari [Ibnu Khutsaim] dari [Ibnu Az Zubair] dari [Jabir] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam berbekam sedangkan beliau (saat itu) tengah berihram, karena keletihan yang menimpa beliau."
            },
            {
                "number": 3039,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ فَرْقَدٍ السَّبَخِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدَّهِنُ رَأْسَهُ بِالزَّيْتِ وَهُوَ مُحْرِمٌ غَيْرَ الْمُقَتَّتِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Hammad bin Salamah] dari [Farqad As Sabakhi] dari [Sa'id bin Jubair] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam meminyaki kepala beliau dengan minyak (bukan minyak wangi) sedang beliau berihram."
            },
            {
                "number": 3040,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَجُلًا أَوْقَصَتْهُ رَاحِلَتُهُ وَهُوَ مُحْرِمٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلَا تُخَمِّرُوا وَجْهَهُ وَلَا رَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًاحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ مِثْلَهُ إِلَّا أَنَّهُ قَالَ أَعْقَصَتْهُ رَاحِلَتُهُ وَقَالَ لَا تُقَرِّبُوهُ طِيبًا فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Sufyan] dari [Amru bin Dinar] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhu bahwa seorang lelaki patah lehernya karena terjatuh dari kendaraannya saat ia berihram maka Nabi shallallahu 'alaihi wasallam bersabda: \"Mandikanlah ia dengan air dan bidara dan kafankanlah dia dengan dua kain kafan, serta jangan ditutup wajah dan kepalanya, karena ia akan dibangkitkan pada hari kiamat dalam keadaan bertalbiyah.\" Dan telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] telah mencertikan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] seperti hadits di atas, namun ia mengatakan terpelintir lehernya disebabkan karena kendaraannya dan Rasulullah shallallahu 'alaihi wasallam bersabda: 'Jangan kalian olesi wajahnya dengan wewangian karena ia akan dibangkitkan di hari kiamat dalam keadaan bertalbiyah.'"
            },
            {
                "number": 3041,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمَّارٍ عَنْ جَابِرٍ قَالَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الضَّبُعِ يُصِيبُهُ الْمُحْرِمُ كَبْشًا وَجَعَلَهُ مِنْ الصَّيْدِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Waki']; telah menceritakan kepada kami [Jarir bin Hazim] dari [Abdullah bin Ubaid bin Umair] dari [Abdurrahman bin Abu Ammar] dari [Jabir] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda tentang anjing hutan yang diciderai oleh orang yang berihram maka ganjarannya adalah dengan membayar seekor kambing kibas dan beliau menganggap anjing hutan sebagai hewan buruan.\""
            },
            {
                "number": 3042,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْقَطَّانُ الْوَاسِطِيُّ حَدَّثَنَا يَزِيدُ بْنُ مَوْهَبٍ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ الْعَزِيزِ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ أَبِي الْمُهَزِّمِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي بَيْضِ النَّعَامِ يُصِيبُهُ الْمُحْرِمُ ثَمَنُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Musa Al Qaththan Al Wasithi]; telah menceritakan kepada kami [Yazid bin Mauhab]; telah menceritakan kepada kami [Marwan bin Mu'awiyah Al Fazari]; Telah menceritakan kepada kami [Ali bin Abdul Aziz]; telah menceritakan kepada kami [Husain Al Mu'allim] dari [Abul Muhazzim] dari [Abu Hurairah]; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Telur burung unta yang diambil oleh orang yang sedang ihram maka diganti harganya\"."
            },
            {
                "number": 3043,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسٌ فَوَاسِقُ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ الْحَيَّةُ وَالْغُرَابُ الْأَبْقَعُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ وَالْحِدَأَةُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Muhammad bin Basysyar] dan [Muhammad bin Al Mutsanna] dan [Muhammad bin Al Walid], semuanya mengatakan; telah menceritakan kepada kami [Muhammad bin Ja'far]; telah menceritakan kepada kami [Syu'bah]; Aku mendengar [Qatadah] menceritakan dari [Sa'id bin Al Musayyab] dari [Aisyah] radliallahu 'anha Nabi shallallahu 'alaihi wasallam bersabda: \"Lima binatang yang boleh dibunuh baik saat bertahalul maupun dalam waktu yang ihram: Ular, gagak, tikus, anjing buas dan burung rajawali.\""
            },
            {
                "number": 3044,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الدَّوَابِّ لَا جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ أَوْ قَالَ فِي قَتْلِهِنَّ وَهُوَ حَرَامٌ الْعَقْرَبُ وَالْغُرَابُ وَالْحُدَيَّاةُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad]; telah menceritakan kepada kami [Abdullah bin Numair] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhu ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lima binatang yang tidak berdosa bagi yang membunuhnya sedang ia dalam keadaan ihram; kalajengking, gagak, rajawali, tikus dan anjing buas.\""
            },
            {
                "number": 3045,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ ابْنِ أَبِي نُعْمٍ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ يَقْتُلُ الْمُحْرِمُ الْحَيَّةَ وَالْعَقْرَبَ وَالسَّبُعَ الْعَادِيَ وَالْكَلْبَ الْعَقُورَ وَالْفَأْرَةَ الْفُوَيْسِقَةَ فَقِيلَ لَهُ لِمَ قِيلَ لَهَا الْفُوَيْسِقَةُ قَالَ لِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَيْقَظَ لَهَا وَقَدْ أَخَذَتْ الْفَتِيلَةَ لِتُحْرِقَ بِهَا الْبَيْتَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib]; telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Yazid bin Abu Ziyad] dari [Ibnu Abi Nu'm] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Seorang yang berihram boleh membunuh ular, kalajengking, gagak, anjing buas dan tikus.\" Dikatakan padanya; 'Kenapa tikus yang nakal? ' Ia berkata; 'Karena Rasulullah shallallahu 'alaihi wasallam bangun dan ia telah mengambil sumbu lampu untuk membakar rumah.'"
            },
            {
                "number": 3046,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ جَمِيعًا عَنْ ابْنِ شِهَابٍ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ أَنْبَأَنَا صَعْبُ بْنُ جَثَّامَةَ قَالَمَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِالْأَبْوَاءِ أَوْ بِوَدَّانَ فَأَهْدَيْتُ لَهُ حِمَارَ وَحْشٍ فَرَدَّهُ عَلَيَّ فَلَمَّا رَأَى فِي وَجْهِيَ الْكَرَاهِيَةَ قَالَ إِنَّهُ لَيْسَ بِنَا رَدٌّ عَلَيْكَ وَلَكِنَّا حُرُمٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Hisyam bin 'Ammar] keduanya berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rumh] telah memberitakan kepada kami [Al Laits bin Sa'd] semuanya dari [Ibnu Syihab Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dia berkata; telah memberitakan kepada kami [Sha'b bin Jatstsamah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melewatiku ketika aku berada di Abwa` atau di daerah Waddan, kemudian aku memberinya hadiah seekor keledai liar, namun beliau mengembalikannya kepadaku, tatkala beliau melihat raut mukaku yang menggambarkan ketidaksukaan, maka beliau bersabda: \"Bukannya saya menolak pemberianmu, akan tetapi kami telah mengharamkan (dagingnya).\""
            },
            {
                "number": 3047,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عِمْرَانُ بْنُ مُحَمَّدِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ عَنْ عَبْدِ الْكَرِيمِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ ابْنِ عَبَّاسٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَحْمِ صَيْدٍ وَهُوَ مُحْرِمٌ فَلَمْ يَأْكُلْهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Imran bin Muhammad bin Abu Laila] dari [Ayahnya] dari [Abdul Karim] dari [Abdullah bin Al Harits] dari [Ibnu Abbas] dari [Ali bin Abu Thalib] dia berkata, \"Nabi shallallahu 'alaihi wasallam di beri daging buruan ketika beliau sedang berihram, namun beliau tidak memakannya.\""
            },
            {
                "number": 3048,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ حِمَارَ وَحْشٍ وَأَمَرَهُ أَنْ يُفَرِّقَهُ فِي الرِّفَاقِ وَهُمْ مُحْرِمُونَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim At Taimi] dari [Isa bin Thalhah] dari [Thalhah bin 'Ubaidillah], bahwa Nabi shallallahu 'alaihi wasallam memberinya keledai liar, lalu beliau memerintahkan supaya dia mambagikan (dagingnya) kepada rombongan tersebut, padahal mereka dalam keadaan ihram.\""
            },
            {
                "number": 3049,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَخَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْحُدَيْبِيَةِ فَأَحْرَمَ أَصْحَابُهُ وَلَمْ أُحْرِمْ فَرَأَيْتُ حِمَارًا فَحَمَلْتُ عَلَيْهِ وَاصْطَدْتُهُ فَذَكَرْتُ شَأْنَهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرْتُ أَنِّي لَمْ أَكُنْ أَحْرَمْتُ وَأَنِّي إِنَّمَا اصْطَدْتُهُ لَكَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْحَابَهُ أَنْ يَأْكُلُوهُ وَلَمْ يَأْكُلْ مِنْهُ حِينَ أَخْبَرْتُهُ أَنِّي اصْطَدْتُهُ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] dia berkata, \"Saya keluar bersama Rasulullah shallallahu 'alaihi wasallam pada waktu perjanjian Hudaibiyyah, ketika para sahabat beliau berihram, aku tidak ikut berihram, tiba-tiba aku melihat seekor keledai lantas kuintai dan kuburu keledai tersebut. Kemudian hal itu kuberitahukan kepada Rasulullah shallallahu 'alaihi wasallam, aku sebutkan, 'Sesungguhnya aku tidak dalam berihram, dan aku tangkap ini untuk anda.' Maka Nabi shallallahu 'alaihi wasallam memerintahkan kepada para sahabatnya untuk memakannya, namun beliau tidak memakannya ketika aku beritahukan bahwa aku menangkapnya untuk beliau.\""
            },
            {
                "number": 3050,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهْدِي مِنْ الْمَدِينَةِ فَأَفْتِلُ قَلَائِدَ هَدْيِهِ ثُمَّ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dan ['Amrah binti Abdurrahman] bahwa [Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam membawa hewan kurban dari Madinah, kemudian beliau membuat pintalan dan mengalungkannya pada leher hewan kurbannya, dan beliau tidak menjauhi sesuatu dari hal-hal yang harus di jauhi oleh orang-orang yang berihram.\""
            },
            {
                "number": 3051,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكُنْتُ أَفْتِلُ الْقَلَائِدَ لِهَدْيِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُقَلِّدُ هَدْيَهُ ثُمَّ يَبْعَثُ بِهِ ثُمَّ يُقِيمُ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُهُ الْمُحْرِمُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia berkata, \"Saya membuat beberapa pintalan untuk hewan kurban Nabi shallallahu 'alaihi wasallam, lantas beliau mengalungkan pintalan tersebut pada hewan kurbannya, lalu mengirimnya (untuk kurban). Kemudian beliau bermukim dan tidak menjauhkan diri dari suatu hal yang di hindari oleh orang yang tengah berihram.\""
            },
            {
                "number": 3052,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْأَهْدَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّةً غَنَمًا إِلَى الْبَيْتِ فَقَلَّدَهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] dia berkata, \"Suatu kali Rasulullah shallallahu 'alaihi wasallam mempersembahkan hewan kurban seekor kambing menuju Batiullah, beliau lalu memberi kalung pada leher hewan tersebut.\""
            },
            {
                "number": 3053,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ الدَّسْتُوَائِيِّ عَنْ قَتَادَةَ عَنْ أَبِي حَسَّانَ الْأَعْرَجِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشْعَرَ الْهَدْيَ فِي السَّنَامِ الْأَيْمَنِ وَأَمَاطَ عَنْهُ الدَّمَ وَقَالَ عَلِيٌّ فِي حَدِيثِهِ بِذِي الْحُلَيْفَةِ وَقَلَّدَ نَعْلَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Hisyam Ad Dastuwa`i] dari [Qatadah] dari [Abu Hasan Al A'raj] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam memberi tanda pada hewan kurban yaitu pada pelana sebelah kanan dan menyingkirkan darah darinya.\" Dalam haditsnya Ali menyebutkan, \"Ketika di Dzul Khulaifah, lalu beliau menggantungkan sepasang sandal.\""
            },
            {
                "number": 3054,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ عَنْ أَفْلَحَ عَنْ الْقَاسِمِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَلَّدَ وَأَشْعَرَ وَأَرْسَلَ بِهَا وَلَمْ يَجْتَنِبْ مَا يَجْتَنِبُ الْمُحْرِمُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Hammad bin Khalid] dari [Aflah] dari [Al Qasim] dari [Asiyah], bahwa Nabi shallallahu 'alaihi wasallam memberi kalung pada hewan kurbannya lalu mengirimkannya, dan beliau tidak menghindari sesuatu yang di hindari oleh orang-orang yang tengah berihram.\""
            },
            {
                "number": 3055,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْكَرِيمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُومَ عَلَى بُدْنِهِ وَأَنْ أَقْسِمَ جِلَالَهَا وَجُلُودَهَا وَأَنْ لَا أُعْطِيَ الْجَازِرَ مِنْهَا شَيْئًا وَقَالَ نَحْنُ نُعْطِيهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] telah memberitakan kepada kami [Sufyan bin 'Uyainah] dari [Abdul Karim] dari [Mujahid] dari [Ibnu Abu Laila] dari [Ali bin Abu Thalib] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kepadaku untuk mengatur pembagian hewan kurban dan agar aku membagi-bagikan sesuatu yang ada di punggung dan kulit hewan tersebut, serta tidak memberisesuatu pun darinya kepada penjagalnya. Beliau bersabda; \"Kami sendirilah yang akan memberinya.\""
            },
            {
                "number": 3056,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْدَى فِي بُدْنِهِ جَمَلًا لِأَبِي جَهْلٍ بُرَتُهُ مِنْ فِضَّةٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Laila] dari [Al Hakam] dari [Miqsam] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam menyerahkan hewan kurban berupa unta jantan milik Abu Jahal yang burahnya (gelang pada hidung unta) terbuat dari perak.\""
            },
            {
                "number": 3057,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَنْبَأَنَا مُوسَى بْنُ عُبَيْدَةَ عَنْ إِيَاسِ بْنِ سَلَمَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي بُدْنِهِ جَمَلٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['ubaidhullah bin Musa] telah memberitakan kepada kami [Musa bin 'Ubaidah] dari [Iyas bin Salamah] dari [Ayahnya], bahwa di antara hewan kurbannya Nabi shallallahu 'alaihi wasallam terdapat unta jantan.\""
            },
            {
                "number": 3058,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ عَنْ سُفْيَانَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى هَدْيَهُ مِنْ قُدَيْدٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Yahya bin Yaman] dari [Sufyan] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam membeli hewan kurban dari daerah Qudaid.\""
            },
            {
                "number": 3059,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً فَقَالَ ارْكَبْهَا قَالَ إِنَّهَا بَدَنَةٌ قَالَ ارْكَبْهَا وَيْحَكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Sufyan Ats Tsauri] dari [Abu Az Zinnad] dari [Al A'raj] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam melihat seorang laki-laki sedang menggiring untanya, maka beliau bersabda: \"Naikilah.\" Laki-laki itu berkata, \"Ini unta untuk kurban! \" Beliau bersabda lagi: \"Celaka kamu! Naikilah.\""
            },
            {
                "number": 3060,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ صَاحِبِ الدَّسْتُوَائِيِّ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرَّ عَلَيْهِ بِبَدَنَةٍ فَقَالَ ارْكَبْهَا قَالَ إِنَّهَا بَدَنَةٌ قَالَ ارْكَبْهَا قَالَ فَرَأَيْتُهُ رَاكِبَهَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عُنُقِهَا نَعْلٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Hisyam] sahabat Ad Dastuwa`i, dari [Qatadah] dari [Anas bin Malik], bahwa Nabi shallallahu 'alaihi wasallam di lewati oleh seekor unta, maka beliau bersabda: \"Naikilah ia.\" Orang itu berkata, \"Ini unta untuk kurban! \" Beliau bersabda lagi: \"Naikilah! \" Anas berkata, \"Lalu aku melihat laki-laki itu menaikinya bersama Nabi shallallahu 'alaihi wasallam dan di leher hewan tersebut di gantungi sandal.\""
            },
            {
                "number": 3061,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ سِنَانِ بْنِ سَلَمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ ذُؤَيْبًا الْخُزَاعِيَّ حَدَّثَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَبْعَثُ مَعَهُ بِالْبُدْنِ ثُمَّ يَقُولُ إِذَا عَطِبَ مِنْهَا شَيْءٌ فَخَشِيتَ عَلَيْهِ مَوْتًا فَانْحَرْهَا ثُمَّ اغْمِسْ نَعْلَهَا فِي دَمِهَا ثُمَّ اضْرِبْ صَفْحَتَهَا وَلَا تَطْعَمْ مِنْهَا أَنْتَ وَلَا أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَ",
                "id": "telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Bisyr Al 'Abdi] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Sinan bin Salamah] dari [Ibnu Abbas] bahwa [Dzu`aib Al Khuza'i] menceritakan bahwa Nabi shallallahu 'alaihi wasallam memberinya tugas untuk menjaga unta-unta beliau, kemudian beliau bersabda: \"Apabila di antara ternak tersebut ada yang sakit dan kamu khawatir ia akan mati, maka sembelihlah ia, kemudian rendamlah sepatunya ke dalam darahnya lalu pukulkanlah di sisi lehernya. dan janganlah kamu dan orang-orang yang bersamamu memakannya.\""
            },
            {
                "number": 3062,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ وَعَمْرُو بْنُ عَبْدِ اللَّهِ قَالُوا حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ نَاجِيَةَ الْخُزَاعِيِّ قَالَ عَمْرٌو فِي حَدِيثِهِ وَكَانَ صَاحِبَ بُدْنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنْ الْبُدْنِ قَالَ انْحَرْهُ وَاغْمِسْ نَعْلَهُ فِي دَمِهِ ثُمَّ اضْرِبْ صَفْحَتَهُ وَخَلِّ بَيْنَهُ وَبَيْنَ النَّاسِ فَلْيَأْكُلُوهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad] serta ['Amru bin Abdullah] mereka berkata; telah menceritakan kepada kami [Waki'] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Najiyah Al Khuza'i]. 'Amru menyebutkan dalam haditsnya -salah seorang yang bertugas menjaga hewan kurban milik Nabi shallallahu 'alaihi wasallam- ia berkata, \"Aku bertanya, \"Wahai Rasulullah, apa yang harus aku perbuat jika sebagian hewan kurban terkena penyakit?\" beliau menjawab: \"Sembelihlah ia, rendamlah sepatunya ke dalam darahnya kemudian pukulkankan di sisi lehernya dan biarkanlah orang-orang memakannya.\""
            },
            {
                "number": 3063,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ عَنْ عَلْقَمَةَ بْنِ نَضْلَةَ قَالَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ وَمَا تُدْعَى رِبَاعُ مَكَّةَ إِلَّا السَّوَائِبَ مَنْ احْتَاجَ سَكَنَ وَمَنْ اسْتَغْنَى أَسْكَنَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Isa bin Yunus] dari [Umar bin Sa'id bin Abu Husain] dari [Utsman bin Abu Sulaiman] dari ['Alqamah bin Nadllah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah wafat, begitu juga Abu Bakar dan Umar, dan tidaklah rumah-rumah yang ada di Makkah didatangi, kecuali tempat-tempat itu kosong, siapa yang membutuhkan maka ia berhak untuk menempatinya, namun jika ia tidak membutuhkannya maka ia memberikan tempat tersebut (kepada yang lainnya).\""
            },
            {
                "number": 3064,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ أَخْبَرَنِي عُقَيْلٌ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ أَنَّهُ قَالَ إِنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْحَمْرَاءِ قَالَ لَهُرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى نَاقَتِهِ وَاقِفٌ بِالْحَزْوَرَةِ يَقُولُ وَاللَّهِ إِنَّكِ لَخَيْرُ أَرْضِ اللَّهِ وَأَحَبُّ أَرْضِ اللَّهِ إِلَيَّ وَاللَّهِ لَوْلَا أَنِّي أُخْرِجْتُ مِنْكِ مَا خَرَجْتُ",
                "id": "Telah menceritakan kepada kami [Isa bin Hammad Al Mishri] telah memberitakan kepada kami [Al Laits bin Sa'd] telah mengabarkan kepadaku ['Uqail] dari [Muhammad bin Muslim] bahwa dia berkata; bahwasanya [Abu Salamah bin Abdurrahman bin 'Auf] mengabarkan kepadanya, bahwa [Abdullah bin 'Adi bin Al Hamra`] berkata kepadanya, \"Saya melihat Rasulullah shallallahu 'alaihi wasallam di atas untanya berhenti di dekat Al Hazwarah, beliau bersabda: \"Demi Allah, sungguh kamu adalah sebaik-baik bumi Allah dan bumi Allah yang paling aku cintai. Demi Allah, seandainya aku tidak di keluarkan darimu, tentu aku tidak akan keluar.\""
            },
            {
                "number": 3065,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ حَدَّثَنَا أَبَانُ بْنُ صَالِحٍ عَنْ الْحَسَنِ بْنِ مُسْلِمِ بْنِ يَنَّاقٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ قَالَتْسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَامَ الْفَتْحِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ يَوْمَ خَلَقَ السَّمَوَاتِ وَالْأَرْضَ فَهِيَ حَرَامٌ إِلَى يَوْمِ الْقِيَامَةِ لَا يُعْضَدُ شَجَرُهَا وَلَا يُنَفَّرُ صَيْدُهَا وَلَا يَأْخُذُ لُقْطَتَهَا إِلَّا مُنْشِدٌ فَقَالَ الْعَبَّاسُ إِلَّا الْإِذْخِرَ فَإِنَّهُ لِلْبُيُوتِ وَالْقُبُورِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا الْإِذْخِرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Yunus bin Bukair] telah menceritakan kepada kami [Muhammad bin Ishaq] telah menceritakan kepada kami [Aban bin Shalih] dari [Al Hasan bin Muslim bin Yannaq] dari [Shafiyyah binti Syaibah] dia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam berkhutbah pada saat penaklukan kota Makkah, beliau bersabda: \"Wahai manusia, sesungguhnya Allah telah mengharamkan (mensucikan) Makkah semenjak mencipatakan langit dan bumi, dan dia suci sampai hari kiamat; tidak dicabut pohonnya, tidak diusir hewan buruannya dan tidak diambil barang temuannya kecuali orang yang hendak mengumumkannya.\" 'Abbas berkata, \"Kecuali idzkhir, sesungguhnya ia untuk rumah-rumah dan kuburan.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kecuali idzkhir.\""
            },
            {
                "number": 3066,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ وَابْنُ الْفُضَيْلِ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ سَابِطٍ عَنْ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَزَالُ هَذِهِ الْأُمَّةُ بِخَيْرٍ مَا عَظَّمُوا هَذِهِ الْحُرْمَةَ حَقَّ تَعْظِيمِهَا فَإِذَا ضَيَّعُوا ذَلِكَ هَلَكُوا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dan [Ibnu Al Fudlail] dari [Yazid bin Abu Ziyad] telah memberitakan kepada kami [Abdurrahman bin Sabith] dari ['Ayyasy bin Abu Rabi'ah Al Makhzumi] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ummat ini akan senantiasa dalam kebaikan selama mereka mengagungkan tanah haram ini dengan sebaik-baik pengagungan, dan apabila mereka menyia-nyiakannya maka mereka akan binasa.\""
            },
            {
                "number": 3067,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Usamah] dari ['ubaidhullah bin Umar] dari [Khubaib bin Abdurrahman] dari [Hafsh bin 'Ashim] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya keimanan akan masuk ke dalam kota Madinah seperti seekor ular yang masuk ke dalam sarangnya.\""
            },
            {
                "number": 3068,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَمُوتَ بِالْمَدِينَةِ فَلْيَفْعَلْ فَإِنِّي أَشْهَدُ لِمَنْ مَاتَ بِهَا",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepada kami [Ayahku] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian mampu meninggal dunia di kota Madinah hendaknya ia melaksanakannya, sesungguhnya aku akan bersaksi bagi siapa saja yang meninggal di kota Madinah.\""
            },
            {
                "number": 3069,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ إِنَّ إِبْرَاهِيمَ خَلِيلُكَ وَنَبِيُّكَ وَإِنَّكَ حَرَّمْتَ مَكَّةَ عَلَى لِسَانِ إِبْرَاهِيمَ اللَّهُمَّ وَأَنَا عَبْدُكَ وَنَبِيُّكَ وَإِنِّي أُحَرِّمُ مَا بَيْنَ لَابَتَيْهَاقَالَ أَبُو مَرْوَانَ لَابَتَيْهَا حَرَّتَيْ الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Muhammad bin Utsman Al 'Utsmani] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Al 'Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Ya Allah, sesungguhnya Ibrahim adalah kekasih dan Nabi-Mu, dan Engkau telah mengharamkan kota Makkah melalui lisan Ibrahim. Ya Allah, aku adalah hamba dan Nabi-Mu, dan aku mengharamkan apa-apa yang berada di antara dua lembah berbatu (Madinah).\" Abu Marwan berkata, \"Yang dimaksud dua lembah berbatu adalah kedua sisi kota Madinah.\""
            },
            {
                "number": 3070,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَرَادَ أَهْلَ الْمَدِينَةِ بِسُوءٍ أَذَابَهُ اللَّهُ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ingin berbuat buruk terhadap penduduk kota Madinah, niscaya Allah akan meleburkannya sebagaimana meleburnya garam di dalam air.\""
            },
            {
                "number": 3071,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْدَةُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ مِكْنَفٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أُحُدًا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ وَهُوَ عَلَى تُرْعَةٍ مِنْ تُرَعِ الْجَنَّةِ وَعَيْرٌ عَلَى تُرْعَةٍ مِنْ تُرَعِ النَّارِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] telah menceritakan kepada kami ['Abdah] dari [Muhammad bin Ishaq] dari [Abdullah bin Miknaf] dia berkata; saya mendengar [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Uhud adalah suatu gunung yang mencintai kita dan kita pun mencintainya, dan ia merupakan salah satu pintu dari pintu-pintu surga atau kecelakaan (yang dapat mengantarkan) ke salah satu pintu dari pintu-pintu Neraka.\""
            },
            {
                "number": 3072,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْمُحَارِبِيُّ عَنْ الشَّيْبَانِيِّ عَنْ وَاصِلٍ الْأَحْدَبِ عَنْ شَقِيقٍ قَالَبَعَثَ رَجُلٌ مَعِيَ بِدَرَاهِمَ هَدِيَّةً إِلَى الْبَيْتِ قَالَ فَدَخَلْتُ الْبَيْتَ وَشَيْبَةُ جَالِسٌ عَلَى كُرْسِيٍّ فَنَاوَلْتُهُ إِيَّاهَا فَقَالَ لَهُ أَلَكَ هَذِهِ قُلْتُ لَا وَلَوْ كَانَتْ لِي لَمْ آتِكَ بِهَا قَالَ أَمَا لَئِنْ قُلْتَ ذَلِكَ لَقَدْ جَلَسَ عُمَرُ بْنُ الْخَطَّابِ مَجْلِسَكَ الَّذِي جَلَسْتَ فِيهِ فَقَالَ لَا أَخْرُجُ حَتَّى أَقْسِمَ مَالَ الْكَعْبَةِ بَيْنَ فُقَرَاءِ الْمُسْلِمِينَ قُلْتُ مَا أَنْتَ فَاعِلٌ قَالَ لَأَفْعَلَنَّ قَالَ وَلِمَ ذَاكَ قُلْتُ لِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ رَأَى مَكَانَهُ وَأَبُو بَكْرٍ وَهُمَا أَحْوَجُ مِنْكَ إِلَى الْمَالِ فَلَمْ يُحَرِّكَاهُ فَقَامَ كَمَا هُوَ فَخَرَجَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Al Muharibi] dari [As Syaibani] dari [Washil Al Ahdab] dari [Syaqiq] dia berkata, \"Seorang laki-laki menitipkan dirham kepadaku untuk dihadiahkan kepada Ka'bah, ternyata Syaibah tengah duduk-duduk di atas kursi, lalu kuserahkan uang itu kepadanya, Syaibah pun bertanya, \"Apakah uang ini milikmu?\" aku menjawab, \"Bukan, seandainya itu milikku, niscaya tidak akan kuserahkan kepadamu.\" [Syaibah] berkata, \"Jika kamu mengatakan hal itu, sungguh Umar bin Khatthab pernah duduk di tempat yang engkau duduki, ia mengatakan, 'Aku tidak akan keluar hingga kubagi-bagikan harta Ka'bah kepada orang-orang fakir kaum Muslimin.' Aku (Syu'bah) pun bertanya, \"Kenapa kamu melakukannya?\" Umar menjawab, \"Sungguh aku akan tetap melakukannya.\" Umar melanjutkan, \"Memang ada apa?\" Aku (Syu'bah) menjawab, \"Sesungguhnya Nabi shallallahu 'alaihi wasallam melihat keadaannya, begitu juga Abu Bakar, keduanya lebih membutuhkan uang tersebut daripada kamu, sehingga keduanya tidak melakukannya.\" Lalu Syu'bah berdiri dan pergi keluar.\""
            },
            {
                "number": 3073,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ زَيْدٍ الْعَمِّيُّ عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ رَمَضَانَ بِمَكَّةَ فَصَامَ وَقَامَ مِنْهُ مَا تَيَسَّرَ لَهُ كَتَبَ اللَّهُ لَهُ مِائَةَ أَلْفِ شَهْرِ رَمَضَانَ فِيمَا سِوَاهَا وَكَتَبَ اللَّهُ لَهُ بِكُلِّ يَوْمٍ عِتْقَ رَقَبَةٍ وَكُلِّ لَيْلَةٍ عِتْقَ رَقَبَةٍ وَكُلِّ يَوْمٍ حُمْلَانَ فَرَسٍ فِي سَبِيلِ اللَّهِ وَفِي كُلِّ يَوْمٍ حَسَنَةً وَفِي كُلِّ لَيْلَةٍ حَسَنَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Umar Al 'Adani] telah menceritakan kepada kami [Abdurrahim bin Zaid Al 'Ammi] dari [Ayahnya] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjumpai Ramadan di kota Makkah, kemudian dia berpuasa dan melaksanakan qiyamullail semampunya, maka Allah akan menuliskan baginya seratus ribu bulan Ramadan selainnya, dan Allah akan menuliskan baginya setiap hari sepertimemerdekakan budak, dan setiap malam memerdekakan budak, dan setiap hari menunggang kuda di jalan Allah (perang), dan setiap hari satu kebaikan dan setiap malam satu kebaikan.\""
            },
            {
                "number": 3074,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ حَدَّثَنَا دَاوُدُ بْنُ عَجْلَانَ قَالَ طُفْنَا مَعَ أَبِي عِقَالٍ فِي مَطَرٍ فَلَمَّا قَضَيْنَا طَوَافَنَا أَتَيْنَا خَلْفَ الْمَقَامِ فَقَالَطُفْتُ مَعَ أَنَسِ بْنِ مَالِكٍ فِي مَطَرٍ فَلَمَّا قَضَيْنَا الطَّوَافَ أَتَيْنَا الْمَقَامَ فَصَلَّيْنَا رَكْعَتَيْنِ فَقَالَ لَنَا أَنَسٌ ائْتَنِفُوا الْعَمَلَ فَقَدْ غُفِرَ لَكُمْ هَكَذَا قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَطُفْنَا مَعَهُ فِي مَطَرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Umar Al 'Adani] telah menceritakan kepada kami [Daud bin 'Ajlan] dia berkata, \"Kami pernah thawaf bersama Abu 'Iqal ketika hujan turun, selesai thawaf kami menuju belakang maqam.\" kemudian [Abu 'Iqal] berkata, \"Aku juga pernah thawaf dengan [Anas bin Malik] ketika hujan turun, selesai thawaf kami menuju ke belakang maqam dan sholat dua rakaat, setelah itu Anas berkata kepada kami, \"Mulailah untuk melakukan amalan, sesungguhnya kalian telah diampuni. Seperti inilah Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami dan kami melakukan thawaf di waktu hujan.\""
            },
            {
                "number": 3075,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ حَفْصٍ الْأُبُلِّيُّ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ عَنْ حَمْزَةَ بْنِ حَبِيبٍ الزَّيَّاتِ عَنْ حُمْرَانَ بْنِ أَعْيَنَ عَنْ أَبِي الطُّفَيْلِ عَنْ أَبِي سَعِيدٍ قَالَحَجَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ مُشَاةً مِنْ الْمَدِينَةِ إِلَى مَكَّةَ وَقَالَ ارْبُطُوا أَوْسَاطَكُمْ بِأُزُرِكُمْ وَمَشَى خِلْطَ الْهَرْوَلَةِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Hafsh Al Ubulli] telah menceritakan kepada kami [Yahya bin Yaman] dari [Hamzah bin Habib Az Zayyat] dari [Humran bin A'yan] dari [Abu At Thufail] dari [Abu Sa'id] dia berkata, \"Nabi shallallahu 'alaihi wasallam dan para sahabatnya menunaikan haji dengan berjalan kaki dari Madinah sampai ke Makkah, lalu beliau bersabda: 'Ikatlah tengah-tengah kalian dengan sarung-sarung kalian.' Kemudian beliau berjalan cepat.\""
            },
            {
                "number": 3076,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنِي أَبِي ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُضَحِّي بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ وَيُسَمِّي وَيُكَبِّرُ وَلَقَدْ رَأَيْتُهُ يَذْبَحُ بِيَدِهِ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهِمَا",
                "id": "Telah menceritakan kepada kami [Nahsr bin Ali Al Jahdlami] telah menceritakan kepadaku [Ayahku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] keduanya berkata; telah menceritakan kepada kami [Syu'bah] saya mendengar [Qatadah] menceritakan dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam menyembelih dua ekor kambing belang (putih hitam) dan bertanduk, lalu beliau membaca basmallah dan bertakbir. Sungguh aku telah melihat beliau menyembelih hewan kurbannya dengan tangannya sendiri sambil meletakkan kakinya di atas leher hean kurbannya.\""
            },
            {
                "number": 3077,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي عَيَّاشٍ الزُّرَقِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عِيدٍ بِكَبْشَيْنِ فَقَالَ حِينَ وَجَّهَهُمَا إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالْأَرْضَ حَنِيفًا وَمَا أَنَا مِنْ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ اللَّهُمَّ مِنْكَ وَلَكَ عَنْ مُحَمَّدٍ وَأُمَّتِهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Isma'il bin 'Ayyasy] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari [Abu 'Ayyasy Az Zuraqi] dari [Jabir bin Abdullah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam menyembelih dua ekor kambing kurban pada waktu Idul Kurban. Saat menghadapkan keduanya beliau mengucapkan: \"Sesungguhnya Aku menghadapkan diriku kepada Rabb yang menciptakan langit dan bumi, dengan cenderung kepada agama yang benar, dan aku bukanlah termasuk orang-orang yang mempersekutukan Allah. Sesungguhnya sholatku, ibadatku, hidupku dan matiku hanyalah untuk Allah, Tuhan semesta alam. Tiada sekutu bagi-Nya; dan demikian Itulah yang diperintahkan kepadaku dan aku adalah orang yang pertama-tama menyerahkan diri (kepada Allah). Ya Allah (ini adalah) dari-Mu dan untuk-Mu, dari Muhammad dan ummatnya.\""
            },
            {
                "number": 3078,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ وَعَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يُضَحِّيَ اشْتَرَى كَبْشَيْنِ عَظِيمَيْنِ سَمِينَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ مَوْجُوءَيْنِ فَذَبَحَ أَحَدَهُمَا عَنْ أُمَّتِهِ لِمَنْ شَهِدَ لِلَّهِ بِالتَّوْحِيدِ وَشَهِدَ لَهُ بِالْبَلَاغِ وَذَبَحَ الْآخَرَ عَنْ مُحَمَّدٍ وَعَنْ آلِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Sufyan Ats Tsauri] dari [Abdullah bin Muhammad bin 'Aqil] dari [Abu Salamah] dari [Aisyah] dan dari [Abu Hurairah], bahwa apabila Rasulullah shallallahu 'alaihi wasallam hendak melaksanakan kurban, maka beliau membeli dua ekor domba yang besar, gemuk, bertanduk dan berwarna belang (hitam dan putih). Kemudian beliau menyembelih salah satunya untuk umatnya yang telah bersaksi akan keesaan Allah dan bersaksi atas risalah beliau, lalu menyembelih yang satunya untuk Muhammad dan keluarga Muhammad shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3079,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَيَّاشٍ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ لَهُ سَعَةٌ وَلَمْ يُضَحِّ فَلَا يَقْرَبَنَّ مُصَلَّانَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Zaid bin Al Hubbab] telah menceritakan kepada kami [Abdullah bin 'Ayyasy] dari [Abdurrahman Al A'raj] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memiliki keluasaan (untuk berkorban) namun tidak berkorban, maka janganlah ia mendekati tempat sholat kami.\""
            },
            {
                "number": 3080,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَسَأَلْتُ ابْنَ عُمَرَ عَنْ الضَّحَايَا أَوَاجِبَةٌ هِيَ قَالَ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُسْلِمُونَ مِنْ بَعْدِهِ وَجَرَتْ بِهِ السُّنَّةُحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا الْحَجَّاجُ بْنُ أَرْطَاةَ حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ قَالَ سَأَلْتُ ابْنَ عُمَرَ فَذَكَرَ مِثْلَهُ سَوَاءً",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Isma'il bin 'Ayyasy] telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad bin Sirin] dia berkata, \"Saya bertanya [Ibnu Umar] mengenai kurban, apakah ia wajib?\" Ibnu Umar lalu menjawab, \"Rasulullah shallallahu 'alaihi wasallam dan orang-orang muslim setelahnya melaksanakan kurban, namun mereka memberlakukannya sebagai sunnah.\" Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Isma'il bin 'Ayyasy] telah menceritakan kepada kami [Al Hajjaj bin Arthah] telah menceritakan kepada kami [Jabalah bin Suhaim] dia berkata, \"Saya bertanya [Ibnu Umar] …lalu dia menyebutkan hadits seperti di atas.\""
            },
            {
                "number": 3081,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ عَنْ ابْنِ عَوْنٍ قَالَ أَنْبَأَنَا أَبُو رَمْلَةَ عَنْ مِخْنَفِ بْنِ سُلَيْمٍ قَالَكُنَّا وَقُوفًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَّةً وَعَتِيرَةً أَتَدْرُونَ مَا الْعَتِيرَةُ هِيَ الَّتِي يُسَمِّيهَا النَّاسُ الرَّجَبِيَّةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Mu'adz bin Mu'adz] dari [Ibnu 'Aun] dia berkata; telah memberitakan kepada kami [Abu Ramlah] dari [Mikhnaf bin Sulaim] dia berkata, \"Kami sedang wukuf di Arafah di sisi Nabi shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Wahai manusia, sesungguhnya wajib atas setiap keluarga untuk berkurban dan menyembelih hewan kurban setiap tahunnya, tahukah kalian apa yang dimaksud dengan menyembelih hewan? Itulah yang biasa disebut-sebut oleh orang-orang dengan sebutan Rajabiyah (menyembelih hewan pada bulan Rajab).\""
            },
            {
                "number": 3082,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا عَبْدُ اللَّهِ ابْنُ نَافِعٍ حَدَّثَنِي أَبُو الْمُثَنَّى عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا عَمِلَ ابْنُ آدَمَ يَوْمَ النَّحْرِ عَمَلًا أَحَبَّ إِلَى اللَّهِ عَزَّ وَجَلَّ مِنْ هِرَاقَةِ دَمٍ وَإِنَّهُ لَيَأْتِي يَوْمَ الْقِيَامَةِ بِقُرُونِهَا وَأَظْلَافِهَا وَأَشْعَارِهَا وَإِنَّ الدَّمَ لَيَقَعُ مِنْ اللَّهِ عَزَّ وَجَلَّ بِمَكَانٍ قَبْلَ أَنْ يَقَعَ عَلَى الْأَرْضِ فَطِيبُوا بِهَا نَفْسًا",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi] telah menceritakan kepada kami [Abdullah bin Nafi'] telah menceritakan kepadaku [Abu Al Mutsanna] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada amalan yang dikerjakan anak Adam ketika hari (raya) kurban yang lebih dicintai oleh Allah Azza Wa Jalla dari mengalirkan darah, sesungguhnya pada hari kiamat ia akan datang dengan tanduk-tanduknya, kuku-kukunya dan bulu-bulunya. Dan sesungguhnya darah tersebut akan sampai kepada Allah Azza Wa Jalla sebelum jatuh ke tanah, maka perbaguslah jiwa kalian dengannya.\""
            },
            {
                "number": 3083,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلَانِيُّ حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ حَدَّثَنَا سَلَّامُ بْنُ مِسْكِينٍ حَدَّثَنَا عَائِذُ اللَّهِ عَنْ أَبِي دَاوُدَ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَقَالَ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ مَا هَذِهِ الْأَضَاحِيُّ قَالَ سُنَّةُ أَبِيكُمْ إِبْرَاهِيمَ قَالُوا فَمَا لَنَا فِيهَا يَا رَسُولَ اللَّهِ قَالَ بِكُلِّ شَعَرَةٍ حَسَنَةٌ قَالُوا فَالصُّوفُ يَا رَسُولَ اللَّهِ قَالَ بِكُلِّ شَعَرَةٍ مِنْ الصُّوفِ حَسَنَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Khalaf Al 'Asqalani] telah menceritakan kepada kami [Adam bin Abu Iyas] telah menceritakan kepada kami [Sallam bin Miskin] telah menceritakan kepada kami [A'idzullah] dari [Abu Daud] dari [Zaid bin Arqam] dia berkata, \"Para sahabat Rasulullah shallallahu 'alaihi wasallam bertanya, \"Wahai Rasulullah, apakah maksud dari hewan-hewan kurban seperti ini?\" beliau bersabda: \"Ini merupakan sunnah (ajaran) bapak kalian, Ibrahim.\" Mereka bertanya, \"Wahai Rasulullah, lantas apa yang akan kami dapatkan dengannya?\" beliau menjawab: \"Setiap rambut terdapat kebaikan.\" Mereka berkata, \"Bagaimana dengan bulu-bulunya wahai Rasulullah?\" beliau menjawab: \"Dari setiap rambut pada bulu-bulunya terdapat suatu kebaikan.\""
            },
            {
                "number": 3084,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ قَالَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ يَأْكُلُ فِي سَوَادٍ وَيَمْشِي فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Hafsh bin Ghiyast] dari [Ja'far bin Muhammad] dari [Ayahnya] dari [Abu Sa'id] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkurban dengan seekor kambing kibas pejantan (kuat) yang bertanduk dan sekitar mulutnya berwarna hitam, kaki-kakinya berwarna hitam dan di sekitar matanya juga berwarna hitam.\""
            },
            {
                "number": 3085,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ أَخْبَرَنِي سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ حَدَّثَنَا يُونُسُ بْنُ مَيْسَرَةَ بْنِ حَلْبَسٍ قَالَخَرَجْتُ مَعَ أَبِي سَعِيدٍ الزُّرَقِيِّ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شِرَاءِ الضَّحَايَا قَالَ يُونُسُ فَأَشَارَ أَبُو سَعِيدٍ إِلَى كَبْشٍ أَدْغَمَ لَيْسَ بِالْمُرْتَفِعِ وَلَا الْمُتَّضِعِ فِي جِسْمِهِ فَقَالَ لِي اشْتَرِ لِي هَذَا كَأَنَّهُ شَبَّهَهُ بِكَبْشِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim] telah menceritakan kepada kami [Muhammad bin Syu'aib] telah mengabarkan kepadaku [Sa'id bin Abdul Aziz] telah menceritakan kepada kami [Yunus bin Maisarah bin Halbas] dia berkata, \"Aku pergi bersama [Abu Sa'id Az Zuraqi] seorang sahabat Rasulullah shallallahu 'alaihi wasallam, untuk membeli beberapa hewan kurban.\" Yunus melanjutkan, \"Abu Sa'id lalu menunjuk ke arah seekor kambing kibas yang sedikit warna hitamnya, yang tidak tinggi dan tidak kurus badannya, lalu ia berkata kepadaku, 'Belikanlah saya yang seperti ini.' Sepertinya dia menyamakan dengan kibas Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3086,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبُو عَائِذٍ أَنَّهُ سَمِعَ سُلَيْمَ بْنَ عَامِرٍ يُحَدِّثُ عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ الْكَفَنِ الْحُلَّةُ وَخَيْرُ الضَّحَايَا الْكَبْشُ الْأَقْرَنُ",
                "id": "Telah menceritakan kepada kami [Al 'Abbas bin Utsman Ad Dimasyqi] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Abu A'idz] bahwa dia mendengar [Sulaim bin 'Amir] menceritakan dari [Abu Umamah Al Bahili], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kain kafan adalah hullah (kain yang lembut) dan sebaik-baik kurban adalah kambing kibasyang bertanduk.\""
            },
            {
                "number": 3087,
                "arab": "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى أَنْبَأَنَا الْحُسَيْنُ بْنُ وَاقِدٍ عَنْ عِلْبَاءَ بْنِ أَحْمَرَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَحَضَرَ الْأَضْحَى فَاشْتَرَكْنَا فِي الْجَزُورِ عَنْ عَشَرَةٍ وَالْبَقَرَةِ عَنْ سَبْعَةٍ",
                "id": "Telah menceritakan kepada kami [Hadiyyah bin Abdul Wahhab] telah memberitakan kepada kami [Al Fadl bin Musa] telah memberitakan kepada kami [Al Husain bin Waqid] dari ['Ilba` bin Ahmar] dari [Ikrimah] dari [Ibnu Abbas] dia berkata, \"Kami bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, kemudian beliau mendatangi hewan kurban (menyembelih). Maka kami turut berkurban dengan seekor unta betina untuk sepuluh orang dan seekor sapi untuk tujuh orang.\""
            }
        ]
    }
}