{
    "status": true,
    "data": {
        "start": 1297,
        "end": 1440,
        "total": 144,
        "book": "malik",
        "hadits": [
            {
                "number": 1297,
                "arab": "حَدَّثَنِي مَالِك عَنْ أَبِي الزِّنَادِ أَنَّهُ قَالَ جَلَدَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ عَبْدًا فِي فِرْيَةٍ ثَمَانِينَ قَالَ أَبُو الزِّنَادِ فَسَأَلْتُ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ عَنْ ذَلِكَ فَقَالَ أَدْرَكْتُ عُمَرَ بْنَ الْخَطَّابِ وَعُثْمَانَ بْنَ عَفَّانَ وَالْخُلَفَاءَ هَلُمَّ جَرًّا فَمَا رَأَيْتُ أَحَدًا جَلَدَ عَبْدًا فِي فِرْيَةٍ أَكْثَرَ مِنْ أَرْبَعِينَ",
                "id": "Telah menceritakan kepadaku Malik dari [Abu Az Zinad] berkata; Umar bin Abdul Azis mendera seorang budak laki-laki yang menyebarkan fitnah zina tanpa disertai saksi dengan delapan puluh kali dera.\" Abu Zinad berkata; \"Aku lalu menanyakan hal itu kepada [Abdullah bin 'Amir bin Rabi'ah], ia menjawab; 'Aku hidup bersama [Umar bin Khattab], [Utsman bin 'Affan] dan khalifah-khalifah yang lain, saya tidak mendapati seorangpun di antara mereka yang mendera budak yang menyebarkan fitnah zina tanpa disertai saksi lebih banyak dari empat puluh dera'.\""
            },
            {
                "number": 1298,
                "arab": "حَدَّثَنِي مَالِك عَنْ زُرَيْقِ بْنِ حَكِيمٍ الْأَيْلِيِّأَنَّ رَجُلًا يُقَالُ لَهُ مِصْبَاحٌ اسْتَعَانَ ابْنًا لَهُ فَكَأَنَّهُ اسْتَبْطَأَهُ فَلَمَّا جَاءَهُ قَالَ لَهُ يَا زَانٍ قَالَ زُرَيْقٌ فَاسْتَعْدَانِي عَلَيْهِ فَلَمَّا أَرَدْتُ أَنْ أَجْلِدَهُ قَالَ ابْنُهُ وَاللَّهِ لَئِنْ جَلَدْتَهُ لَأَبُوءَنَّ عَلَى نَفْسِي بِالزِّنَا فَلَمَّا قَالَ ذَلِكَ أَشْكَلَ عَلَيَّ أَمْرُهُ فَكَتَبْتُ فِيهِ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ وَهُوَ الْوَالِي يَوْمَئِذٍ أَذْكُرُ لَهُ ذَلِكَ فَكَتَبَ إِلَيَّ عُمَرُ أَنْ أَجِزْ عَفْوَهُقَالَ زُرَيْقٌ وَكَتَبْتُ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ أَيْضًا أَرَأَيْتَ رَجُلًا افْتُرِيَ عَلَيْهِ أَوْ عَلَى أَبَوَيْهِ وَقَدْ هَلَكَا أَوْ أَحَدُهُمَا قَالَ فَكَتَبَ إِلَيَّ عُمَرُ إِنْ عَفَا فَأَجِزْ عَفْوَهُ فِي نَفْسِهِ وَإِنْ افْتُرِيَ عَلَى أَبَوَيْهِ وَقَدْ هَلَكَا أَوْ أَحَدُهُمَا فَخُذْ لَهُ بِكِتَابِ اللَّهِ إِلَّا أَنْ يُرِيدَ سِتْرًا",
                "id": "Telah menceritakan kepadaku Malik dari [Zuraiq bin Hakim Al Aili] seorang laki-laki yang bernama Misbah meminta pertolongan kepada anaknya, namun seakan-akan anaknya tersebut memperlambat diri. Ketika anaknya datang ia berkata, \"Dasar pezina! \" Zuraiq (perawi) berkata; \"Anaknya lalu minta pertolongan kepadaku (berkenaan dengan tuduhan bapaknya kepada dirinya) . Ketika aku akan mendera bapaknya, anaknya berkata; \"Demi Allah, jika engkau menderanya, maka aku akan mengaku berbuat zina.\" Ketika dia mengatakan hal itu, maka perkaranya kian sulit bagiku. Aku kemudian menulis surat kepada Umar bin Abdul Azis yang saat itu menjadi khalifah. [Umar bin Abdul Aziz] kemudian menulis balasan agar aku mengabulkan permaafan anaknya kepada sang bapak.\" Zuraiq berkata; \"Aku kemudian kembali menulis surat kepadanya, 'Apa pendapatmu tentang seorang laki-laki atau kedua orang tuanya dituduh telah berzina, sedangkan keduanya atau salah satu dari orang tuanya meninggal dunia? ' Zuraiq berkata; \"Maka Umar menjawab; \"Jika laki-laki (yang tertuduh) itu memberi maaf kepada penuduh, maka kabulkanlah maafyang ia berikan. Dan jika yang dituduh adalah kedua orang tuanya, sementara keduanya atau salah seorang dari keduanya telah meninggal, maka putuskanlah sesuai dengan Kitabullah, kecuali jika ia ingin merahasiakannya.\""
            },
            {
                "number": 1299,
                "arab": "حَدَّثَنِي مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّهُ قَالَ فِي رَجُلٍ قَذَفَ قَوْمًا جَمَاعَةً أَنَّهُ لَيْسَ عَلَيْهِ إِلَّا حَدٌّ وَاحِدٌقَالَ مَالِك وَإِنْ تَفَرَّقُوا فَلَيْسَ عَلَيْهِ إِلَّا حَدٌّ وَاحِدٌ",
                "id": "Telah menceritakan kepadaku Malik dari [Hisyam bin 'Urwah] dari [Bapaknya] berkata tentang seorang laki-laki yang menuduh sekelompok orang telah berbuat zina, maka tidaklah hukuman dijatuhkan atasnya melainkan hanyalah satu had saja.\" Malik berkata; \"Walaupun yang tertuduh terpisah-pisah maka tetap dia hanya dikenakan satu hukuman.\""
            },
            {
                "number": 1300,
                "arab": "حَدَّثَنِي مَالِك عَنْ أَبِي الرِّجَالِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَارِثَةَ بْنِ النُّعْمَانِ الْأَنْصَارِيِّ ثُمَّ مِنْ بَنِي النَّجَّارِ عَنْ أُمِّهِ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِأَنَّ رَجُلَيْنِ اسْتَبَّا فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ فَقَالَ أَحَدُهُمَا لِلْآخَرِ وَاللَّهِ مَا أَبِي بِزَانٍ وَلَا أُمِّي بِزَانِيَةٍ فَاسْتَشَارَ فِي ذَلِكَ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ قَائِلٌ مَدَحَ أَبَاهُ وَأُمَّهُ وَقَالَ آخَرُونَ قَدْ كَانَ لِأَبِيهِ وَأُمِّهِ مَدْحٌ غَيْرُ هَذَا نَرَى أَنْ تَجْلِدَهُ الْحَدَّ فَجَلَدَهُ عُمَرُ الْحَدَّ ثَمَانِينَ",
                "id": "Telah menceritakan kepadaku Malik dari [Abu Al Rijal Muhammad bin Abdurrahman bin Haritsah bin An Nu'man Al Anshari] -ia dari bani An Najjar- dari ibunya ['Amrah binti Abdurrahman] ada masa pemerintahan Umar bin Khattab ada dua orang laki-laki yang saling cela. Salah seorang dari mereka berkata kepada yang lainnya; \"Demi Allah, ayah dan ibuku bukanlah seorang pezina.\" ['Umar bin Khattab] kemudian bermusyawarah mengenai hal tersebut. Seorang laki-laki lalu berkata; \"Justru dia memuji ayah dan ibunya! \" Sementara yang lain berkata; \"Ayah dan ibunya pantas mendapatkan pujian selain itu. Maka menurut kami hendaknya anda menjatuhkan hukuman kepada laki-laki tersebut.\" Setelah itu, Umar menderanya dengan delapan puluh kali dera.\""
            },
            {
                "number": 1301,
                "arab": "حَدَّثَنِي مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّ عُمَرَ بْنَ الْخَطَّابِقَالَ لِرَجُلٍ خَرَجَ بِجَارِيَةٍ لِامْرَأَتِهِ مَعَهُ فِي سَفَرٍ فَأَصَابَهَا فَغَارَتْ امْرَأَتُهُ فَذَكَرَتْ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ وَهَبَتْهَا لِي فَقَالَ عُمَرُ لَتَأْتِينِي بِالْبَيِّنَةِ أَوْ لَأَرْمِيَنَّكَ بِالْحِجَارَةِ قَالَ فَاعْتَرَفَتْ امْرَأَتُهُ أَنَّهَا وَهَبَتْهَا لَهُ",
                "id": "Telah menceritakan kepadaku Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa [Umar bin Khattab] pernah berkata kepada seorang laki-laki yang melakukan perjalanan bersama budak wanita milik isterinya yang kemudian ia menggaulinya. Isterinya lalu merasa cemburu hingga melaporkannya kepada Umar bin Khattab. 'Umar bin Khattab lantas bertanya kepada laki-laki tersebut tentang persetubuhan yang dilakukannya dengan budak wanita tersebut, laki-laki itu menjawab, \"Dia telah menghibahkannya kepadaku! \" Umar berkata (kepada sang isteri); \"Engkau berikan bukti atau aku akan melemparimu dengan batu?\" Rabi'ah berkata; \"Maka isterinya mengakui bahwa dia telah menghibahkannya.\""
            },
            {
                "number": 1302,
                "arab": "حَدَّثَنِي مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي مِجَنٍّ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ",
                "id": "Telah menceritakan kepadaku Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah memotong (tangan) karena perisai yang harganya tiga dirham.\""
            },
            {
                "number": 1303,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ الْمَكِّيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا قَطْعَ فِي ثَمَرٍ مُعَلَّقٍ وَلَا فِي حَرِيسَةِ جَبَلٍ فَإِذَا آوَاهُ الْمُرَاحُ أَوْ الْجَرِينُ فَالْقَطْعُ فِيمَا يَبْلُغُ ثَمَنَ الْمِجَنِّ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abdurrahman bin Abu Husain Al Maki] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hukum potong tangan pada buah yang masih menggantung atau yang terjaga dalam pagar di pegunungan. Jika tempat berlindungnya hewan ternak atau tempat penumbukan padi terlindungi, maka hukuman potong (tangan) berlaku selama barang yang dicuri mencapai harga perisai.\""
            },
            {
                "number": 1304,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِأَنَّ سَارِقًا سَرَقَ فِي زَمَانِ عُثْمَانَ أُتْرُجَّةً فَأَمَرَ بِهَا عُثْمَانُ بْنُ عَفَّانَ أَنْ تُقَوَّمَ فَقُوِّمَتْ بِثَلَاثَةِ دَرَاهِمَ مِنْ صَرْفِ اثْنَيْ عَشَرَ دِرْهَمًا بِدِينَارٍ فَقَطَعَ عُثْمَانُ يَدَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] dari [Bapaknya] dari ['Amrah binti Abdurrahman] bahwa ada seorang pencuri yang mencuri buah Utrujah (buah yang rasanya agak masam) pada masa Utsman. [Utsman] lalu menyuruh untuk menghitung harganya. Buah itu dihargai dengan tiga dirham dengan kurs dua belas dirham seharga satu dinar, kemudian 'Utsman memotong tangannya.\""
            },
            {
                "number": 1305,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْمَا طَالَ عَلَيَّ وَمَا نَسِيتُ الْقَطْعُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari ['Amrah binti Abdurrahman] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; \"Belum lama bagiku dan belum hilang dari ingatanku bahwa pemotongan (tangan pencuri) pada seperempat dinar atau lebih.\""
            },
            {
                "number": 1306,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهَا قَالَتْخَرَجَتْ عَائِشَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ وَمَعَهَا مَوْلَاتَانِ لَهَا وَمَعَهَا غُلَامٌ لِبَنِي عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ فَبَعَثَتْ مَعَ الْمَوْلَاتَيْنِ بِبُرْدٍ مُرَجَّلٍ قَدْ خِيطَ عَلَيْهِ خِرْقَةٌ خَضْرَاءُ قَالَتْ فَأَخَذَ الْغُلَامُ الْبُرْدَ فَفَتَقَ عَنْهُ فَاسْتَخْرَجَهُ وَجَعَلَ مَكَانَهُ لِبْدًا أَوْ فَرْوَةً وَخَاطَ عَلَيْهِ فَلَمَّا قَدِمَتْ الْمَوْلَاتَانِ الْمَدِينَةَ دَفَعَتَا ذَلِكَ إِلَى أَهْلِهِ فَلَمَّا فَتَقُوا عَنْهُ وَجَدُوا فِيهِ اللِّبْدَ وَلَمْ يَجِدُوا الْبُرْدَ فَكَلَّمُوا الْمَرْأَتَيْنِ فَكَلَّمَتَا عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ كَتَبَتَا إِلَيْهَا وَاتَّهَمَتَا الْعَبْدَ فَسُئِلَ الْعَبْدُ عَنْ ذَلِكَ فَاعْتَرَفَ فَأَمَرَتْ بِهِ عَائِشَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُطِعَتْ يَدُهُ وَقَالَتْ عَائِشَةُ الْقَطْعُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar bin Hazm] dari ['Amrah binti Abdurrahman] berkata; \" [Aisyah], isteri Nabi shallallahu 'alaihi wasallam pergi ke Makkah bersama dua budak wanitanya, serta seorang pelayan laki-laki dari Bani Abdullah bin Abu Bakar As Shiddiq. Kemudian Aisyah mengirim kain selimut bergambar yang telah dijahit dengan sobekan kain hijau, lewat kedua budak wanitanya.\" 'Amrah binti Abdurrahman berkata; \"Pelayan laki-laki yang bersamanya mengambil selimut itu dan merusak jahitan lalu mengeluarkan isinya, budak laki-laki itu kemudian menggantinya dengan kain alas pelana atau sejenis jubah yang berlapis kulit, lalu ia menjahitnya. Ketika dua budak wanita itu sampai di Madinah, mereka menyerahkannya kepada keluarga Aisyah. Dan saat mereka membukanya, mereka menemukan al labd dan tidak menemukan selimut. Mereka lalu menanyakannya kepada dua budak wanita tersebut, hingga akhirnya keduanya menyampaikan hal itu kepada Aisyah, isteri Nabi shallallahu 'alaihi wasallam, atau mereka berdua mengirim surat kepadanya. Kedua budak wanita itu menduga bahwa budak laki-laki itulah yang telah melakukannya. Maka budak laki-laki tersebut ditanya dan dia mengakuinya. Aisyah, isteri Nabi shallallahu 'alaihi wasallam memerintahkan untuk memotong tangannya dan berkata; \"Potong tangan dilakukan jika mencapai seperempat dinar atau lebih.\" "
            },
            {
                "number": 1307,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدًا لِعَبْدِ اللَّهِ بْنِ عُمَرَسَرَقَ وَهُوَ آبِقٌ فَأَرْسَلَ بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ إِلَى سَعِيدِ بْنِ الْعَاصِ وَهُوَ أَمِيرُ الْمَدِينَةِ لِيَقْطَعَ يَدَهُ فَأَبَى سَعِيدٌ أَنْ يَقْطَعَ يَدَهُ وَقَالَ لَا تُقْطَعُ يَدُ الْآبِقِ السَّارِقِ إِذَا سَرَقَ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ فِي أَيِّ كِتَابِ اللَّهِ وَجَدْتَ هَذَا ثُمَّ أَمَرَ بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ فَقُطِعَتْ يَدُهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa budak Abdullah bin Umar mencuri lalu dia kabur, kemudian Abdullah bin Umar menyerahkan (perkara ini) kepada Sa'id bin Al Ash yang menjabat Gubernur Madinah agar memotong tangannya. Sa'id menolaknya dan berkata; \"Tangan seorang pencuri yang kabur, tidak dipotong.\" [Abdullah bin Umar] bertanya; \"Di kitabullah yang mana, kamu menemukan hal ini?\" Abdullah bin Umar lalu memerintahkan untuk memotong tangannya.\""
            },
            {
                "number": 1308,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زُرَيْقِ بْنِ حَكِيمٍ أَنَّهُ أَخْبَرَهُ أَنَّهُ أَخَذَ عَبْدًا آبِقًا قَدْ سَرَقَ قَالَ فَأَشْكَلَ عَلَيَّ أَمْرُهُ قَالَ فَكَتَبْتُ فِيهِ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِأَسْأَلُهُ عَنْ ذَلِكَ وَهُوَ الْوَالِي يَوْمَئِذٍ قَالَ فَأَخْبَرْتُهُ أَنَّنِي كُنْتُ أَسْمَعُ أَنَّ الْعَبْدَ الْآبِقَ إِذَا سَرَقَ وَهُوَ آبِقٌ لَمْ تُقْطَعْ يَدُهُ قَالَ فَكَتَبَ إِلَيَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ نَقِيضَ كِتَابِي يَقُولُ كَتَبْتَ إِلَيَّ أَنَّكَ كُنْتَ تَسْمَعُ أَنَّ الْعَبْدَ الْآبِقَ إِذَا سَرَقَ لَمْ تُقْطَعْ يَدُهُ وَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ{ وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوا أَيْدِيَهُمَا جَزَاءً بِمَا كَسَبَا نَكَالًا مِنْ اللَّهِ وَاللَّهُ عَزِيزٌ حَكِيمٌ }فَإِنْ بَلَغَتْ سَرِقَتُهُ رُبُعَ دِينَارٍ فَصَاعِدًا فَاقْطَعْ يَدَهُو حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ وَسَالِمَ بْنَ عَبْدِ اللَّهِ وَعُرْوَةَ بْنَ الزُّبَيْرِ كَانُوا يَقُولُونَ إِذَا سَرَقَ الْعَبْدُ الْآبِقُ مَا يَجِبُ فِيهِ الْقَطْعُ قُطِعَ قَالَ مَالِك وَذَلِكَ الْأَمْرُ الَّذِي لَا اخْتِلَافَ فِيهِ عِنْدَنَا أَنَّ الْعَبْدَ الْآبِقَ إِذَا سَرَقَ مَا يَجِبُ فِيهِ الْقَطْعُ قُطِعَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zuraiq bin Hakim] ia mengabarkan kepadanya, bahwa ia menemukan seorang budak yang kabur setelah mencuri. Zuraiq melanjutkan; \"Hal ini mengundang masalah bagiku. Maka aku menulis surat kepada Umar bin Abdul Aziz yang saat itu menjadi gubernur, untuk menanyakan hal tersebut. Aku kabarkan kepadanya bahwa aku mendengar seorang hamba yang melarikan diri jika mencuri dan kabur, maka tangannya tidak dipotong.\" Zuraiq melanjutkan, \" [Umar bin Abdul Aziz] lalu membalas suratku dan mengatakan; 'Kamu menulis surat kepadaku bahwasanya kamu telah mendengar, jika seorang hamba yang melarikan diri mencuri lalu dia kabur, maka tidak dipotong tangannya, sedangkan Allah Tabaraka Wa Ta'ala dalam kitab-Nya berfirman; \"Seorang pencuri baik laki-laki maupun perempuan maka potonglah tangannya sebagai balasan dari perbuatannya dan hukuman dari Allah, dan Allah Maha Mulia dan Maha Bijaksana) ' (Qs. Al Maidah: 38) jika barang curiannya mencapai seperempat dinar atau lebih, maka potonglah tangannya.\" Telah menceritakan kepadaku dari Malik, bahwasanya telah sampai kepadanya, bahwa Al Qasim bin Muhammad dan Salim bin Abdullah dan 'Urwah bin Zubair mereka mengatakan; \"Jika budak yang melarikan diri mencuri sesuatu yang mencapai kewajiban untuk dipotong, maka tangannya dipotong.\" Malik berkata; \"Itu adalah perkara yang tidak ada perbedaan pendapat di antara kami, yaitu jika seorang hamba yang kabur mencuri barang yang mencapai kewajiban potonga tangan, maka tangannya harus dipotong.\""
            },
            {
                "number": 1309,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَأَنَّ صَفْوَانَ بْنَ أُمَيَّةَ قِيلَ لَهُ إِنَّهُ مَنْ لَمْ يُهَاجِرْ هَلَكَ فَقَدِمَ صَفْوَانُ بْنُ أُمَيَّةَ الْمَدِينَةَ فَنَامَ فِي الْمَسْجِدِ وَتَوَسَّدَ رِدَاءَهُ فَجَاءَ سَارِقٌ فَأَخَذَ رِدَاءَهُ فَأَخَذَ صَفْوَانُ السَّارِقَ فَجَاءَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُقْطَعَ يَدُهُ فَقَالَ لَهُ صَفْوَانُ إِنِّي لَمْ أُرِدْ هَذَا يَا رَسُولَ اللَّهِ هُوَ عَلَيْهِ صَدَقَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلَّا قَبْلَ أَنْ تَأْتِيَنِي بِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Shafwan bin Abdullah bin Shafwan] dikatakan kepada Shafwan bin Umayyah; \"Barangsiapa tidak berhijrah maka akan binasa.\" Saat Shafwan bin Umayyah tiba di Madinah, dia tidur di masjid dengan menggunakan selendangnya sebagai bantal. Lalu ada seorang pencuri yang mengambil selendangnya tersebut, Shafwan langsung menangkapnya dan membawanya menghadap Rasulullah shallallahu 'alaihi wasallam. Beliau lalu menyuruh untuk memotong tangannya, namun Shafwan berkata; \"Wahai Rasulullah, saya tidak bermaksud demikian. Pakaian ini saya anggap sedekah untuknya.\" Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Kenapa tidak kamu katakan sebelum kamu membawanya kepadaku?\""
            },
            {
                "number": 1310,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّ الزُّبَيْرَ بْنَ الْعَوَّامِلَقِيَ رَجُلًا قَدْ أَخَذَ سَارِقًا وَهُوَ يُرِيدُ أَنْ يَذْهَبَ بِهِ إِلَى السُّلْطَانِ فَشَفَعَ لَهُ الزُّبَيْرُ لِيُرْسِلَهُ فَقَالَ لَا حَتَّى أَبْلُغَ بِهِ السُّلْطَانَ فَقَالَ الزُّبَيْرُ إِذَا بَلَغْتَ بِهِ السُّلْطَانَ فَلَعَنَ اللَّهُ الشَّافِعَ وَالْمُشَفِّعَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa [Zubair bin Al Awwam] pernah menjumpai seorang laki-laki menangkap seorang pencuri dan ingin membawanya kepada penguasa. Zubair lalu meminta agar pencuri itu diampuni dan melepaskannya. Namun laki-laki itu berkata; \"Tidak, hingga aku membawanya kepada penguasa.\" Zubair berkata; \"Jika kamu telah sampai kepada pihak penguasa, maka Allah akan melaknat orang yang memberi maaf dan yang diberi maaf.\""
            },
            {
                "number": 1311,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ أَنَّ رَجُلًا مِنْ أَهْلِ الْيَمَنِ أَقْطَعَ الْيَدِ وَالرِّجْلِ قَدِمَ فَنَزَلَ عَلَى أَبِي بَكْرٍ الصِّدِّيقِفَشَكَا إِلَيْهِ أَنَّ عَامِلَ الْيَمَنِ قَدْ ظَلَمَهُ فَكَانَ يُصَلِّ مِنْ اللَّيْلِ فَيَقُولُ أَبُو بَكْرٍ وَأَبِيكَ مَا لَيْلُكَ بِلَيْلِ سَارِقٍ ثُمَّ إِنَّهُمْ فَقَدُوا عِقْدًا لِأَسْمَاءَ بِنْتِ عُمَيْسٍ امْرَأَةِ أَبِي بَكْرٍ الصِّدِّيقِ فَجَعَلَ الرَّجُلُ يَطُوفُ مَعَهُمْ وَيَقُولُ اللَّهُمَّ عَلَيْكَ بِمَنْ بَيَّتَ أَهْلَ هَذَا الْبَيْتِ الصَّالِحِ فَوَجَدُوا الْحُلِيَّ عِنْدَ صَائِغٍ زَعَمَ أَنَّ الْأَقْطَعَ جَاءَهُ بِهِ فَاعْتَرَفَ بِهِ الْأَقْطَعُ أَوْ شُهِدَ عَلَيْهِ بِهِ فَأَمَرَ بِهِ أَبُو بَكْرٍ الصِّدِّيقُ فَقُطِعَتْ يَدُهُ الْيُسْرَى وَقَالَ أَبُو بَكْرٍ وَاللَّهِ لَدُعَاؤُهُ عَلَى نَفْسِهِ أَشَدُّ عِنْدِي عَلَيْهِ مِنْ سَرِقَتِهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] bahwa seorang laki-laki Yaman yang telah dipotong kaki dan tangannya, tiba dan singgah di tempat Abu Bakar As Shiddiq. Dia mengeluhkan bahwa seorang pejabat Yaman telah berbuat aniaya terhadapnya, ketika itu dia sedang sholat malam. [Abu Bakar] bertanya; \"Demi ayahmu, bagaimana malammu dengan seorang pencuri.\" Kemudian mereka kehilangan cincin Asma` binti 'Umais, isteri Abu Bakar As Shiddiq, dan lelaki (pencuri) itu ikut mencari bersama-sama mereka seraya berdo'a; \"Ya Allah, hukumlah orang yang telah melakukan pencurian pada malam hari ini terhadap pemilik rumah yang shalih ini.\" Mereka mendapatkan perhiasan itu pada seorang tukang emas. dan tukang emas itu mengatakan bahwa orang yang tangannya terpotong-lah yang telah membawanya. Dan laki-laki yang tangannya telah dipotong itu pun mengakuinya, atau diajukanlah beberapa saksi kepadanya. Maka Abu Bakar As Shiddiq memerintahkan untuk memotong tangan kirinya, lalu mengatakan, \"Demi Allah, sungguh do'anya untuk dirinya lebih hebat bagiku daripada tindak pencuriannya.\""
            },
            {
                "number": 1312,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّ أَبَا الزِّنَادِ أَخْبَرَهُ أَنَّ عَامِلًا لِعُمَرَ بْنِ عَبْدِ الْعَزِيزِأَخَذَ نَاسًا فِي حِرَابَةٍ وَلَمْ يَقْتُلُوا أَحَدًا فَأَرَادَ أَنْ يَقْطَعَ أَيْدِيَهُمْ أَوْ يَقْتُلَ فَكَتَبَ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي ذَلِكَ فَكَتَبَ إِلَيْهِ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ لَوْ أَخَذْتَ بِأَيْسَرِ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik bahwa [Abu Zinad] mengabarkan kepadanya, bahwa pekerja Umar bin Abdul Aziz menangkap beberapa perampok dan tidak membunuh seorang pun. Dan ia berkeinginan untuk memotong tyangan mereka atau membunuhnya, lalu dia menulis surat kepada Umar bin Abdul Aziz tentang perkara itu. [Umar bin Abdul Aziz] menjawab; \"Sekiranya engkau hukum dengan yang lebih ringan dari itu.\""
            },
            {
                "number": 1313,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَأَنَّ عَبْدًا سَرَقَ وَدِيًّا مِنْ حَائِطِ رَجُلٍ فَغَرَسَهُ فِي حَائِطِ سَيِّدِهِ فَخَرَجَ صَاحِبُ الْوَدِيِّ يَلْتَمِسُ وَدِيَّهُ فَوَجَدَهُ فَاسْتَعْدَى عَلَى الْعَبْدِ مَرْوَانَ بْنَ الْحَكَمِ فَسَجَنَ مَرْوَانُ الْعَبْدَ وَأَرَادَ قَطْعَ يَدِهِ فَانْطَلَقَ سَيِّدُ الْعَبْدِ إِلَى رَافِعِ بْنِ خَدِيجٍ فَسَأَلَهُ عَنْ ذَلِكَ فَأَخْبَرَهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ وَالْكَثَرُ الْجُمَّارُ فَقَالَ الرَّجُلُ فَإِنَّ مَرْوَانَ بْنَ الْحَكَمِ أَخَذَ غُلَامًا لِي وَهُوَ يُرِيدُ قَطْعَهُ وَأَنَا أُحِبُّ أَنْ تَمْشِيَ مَعِيَ إِلَيْهِ فَتُخْبِرَهُ بِالَّذِي سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَشَى مَعَهُ رَافِعٌ إِلَى مَرْوَانَ بْنِ الْحَكَمِ فَقَالَ أَخَذْتَ غُلَامًا لِهَذَا فَقَالَ نَعَمْ فَقَالَ فَمَا أَنْتَ صَانِعٌ بِهِ قَالَ أَرَدْتُ قَطْعَ يَدِهِ فَقَالَ لَهُ رَافِعٌ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ فَأَمَرَ مَرْوَانُ بِالْعَبْدِ فَأُرْسِلَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] bahwa seorang budak laki-laki mencuri pohon kurma yang masih kecil dari kebun seseorang, lalu dia menanamnya di kebun tuannya. Pemilik pohon tadi keluar mencari pohon kurmanya dan mendapatkannya. Dia lantas mengadukan kepada Marwan bin Al Hakam atas tindakan budak tersebut. Maka Marwan pun memenjarakan budak itu, dan berkeinginan untuk memotong tangannya. Majikan budak itu lalu pergi menemui Rafi' bin Khadij dan menanyakan tentang permasalahan itu. [Rafi'] kemudian mengabarkan kepadanya bahwa ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada potong tangan dalam kurma dan katsar, dan katsar adalah bejana dari mayang (pohon kurma) .\" Orang itu berkata; \"Marwan bin Al Hakam menangkap pelayanku dan dia ingin memotong tangannya. Maka aku berharap jika engkau sudi untuk pergi bersamaku menemuinya, agar engkau bisa menyampaikan apa yang telah engkau dengar dari Rasulullah Shalla Allahu 'alaihi wa sallam.\" Maka Rafi' pergi bersamanya menghadap Marwan bin Al Hakam, kemudian dia bertanya kepada Marwan; \"Apakah kamu telah menangkap budak orang ini?\" dia menjawab; \"Ya.\" Rafi' bertanya lagi; \"Apa yang akan kamu perbuat terhadapnya?\" Dia menjawab; \"Aku hendak memotong tangannya.\" Kemudian Rafi' berkata; kepadanya; \"Saya telah mendengar Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Tidak ada potong tangan dalam kurma dan katsar.' lalu dia menyuruh agar membebaskan budak itu, dan (budak itupun) dibebaskan."
            },
            {
                "number": 1314,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ السَّائِبِ بْنِ يَزِيدَأَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْحَضْرَمِيِّ جَاءَ بِغُلَامٍ لَهُ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ لَهُ اقْطَعْ يَدَ غُلَامِي هَذَا فَإِنَّهُ سَرَقَ فَقَالَ لَهُ عُمَرُ مَاذَا سَرَقَ فَقَالَ سَرَقَ مِرْآةً لِامْرَأَتِي ثَمَنُهَا سِتُّونَ دِرْهَمًا فَقَالَ عُمَرُ أَرْسِلْهُ فَلَيْسَ عَلَيْهِ قَطْعٌ خَادِمُكُمْ سَرَقَ مَتَاعَكُمْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [As Sa`ib bin Yazid] bahwa Abdullah bin Amru bin Al Hadlrami datang dengan pembantunya kepada Umar bin Khattab, seraya berkata; \"Potonglah tangan pembantuku ini, dia telah mencuri! \" Umar bertanya; \"Apa yang dia curi?\" dia menjawab; \"Dia mencuri cermin isteriku yang harganya enam puluh dirham.\" [Umar] berkata; \"Bebaskan dia, karena tidak ada potong tangan untuk pembantumu yang mencuri hartamu.\""
            },
            {
                "number": 1315,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍأَنَّ مَرْوَانَ بْنَ الْحَكَمِ أُتِيَ بِإِنْسَانٍ قَدْ اخْتَلَسَ مَتَاعًا فَأَرَادَ قَطْعَ يَدِهِ فَأَرْسَلَ إِلَى زَيْدِ بْنِ ثَابِتٍ يَسْأَلُهُ عَنْ ذَلِكَ فَقَالَ زَيْدُ بْنُ ثَابِتٍ لَيْسَ فِي الْخُلْسَةِ قَطْعٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa seorang pencopet dibawa ke hadapan Marwan bin Al Hakam, sehingga Marwan berkeinginan untuk memotong tangannya. Namun kemudian dia mengirim surat kepada Zaid bin Tsabit menanyakan hal itu, maka [Zaid bin Tsabit] menjawab; \"Tidak ada potong tangan dalam hal pencopetan.\""
            },
            {
                "number": 1316,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍأَنَّهُ أَخَذَ نَبَطِيًّا قَدْ سَرَقَ خَوَاتِمَ مِنْ حَدِيدٍ فَحَبَسَهُ لِيَقْطَعَ يَدَهُ فَأَرْسَلَتْ إِلَيْهِ عَمْرَةُ بِنْتُ عَبْدِ الرَّحْمَنِ مَوْلَاةً لَهَا يُقَالُ لَهَا أُمَيَّةُ قَالَ أَبُو بَكْرٍ فَجَاءَتْنِي وَأَنَا بَيْنَ ظَهْرَانَيْ النَّاسِ فَقَالَتْ تَقُولُ لَكَ خَالَتُكَ عَمْرَةُ يَا ابْنَ أُخْتِي أَخَذْتَ نَبَطِيًّا فِي شَيْءٍ يَسِيرٍ ذُكِرَ لِي فَأَرَدْتَ قَطْعَ يَدِهِ قُلْتُ نَعَمْ قَالَتْ فَإِنَّ عَمْرَةَ تَقُولُ لَكَ لَا قَطْعَ إِلَّا فِي رُبُعِ دِينَارٍ فَصَاعِدًا قَالَ أَبُو بَكْرٍ فَأَرْسَلْتُ النَّبَطِيَّ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata; telah mengabariku [Abu Bakar bin Muhammad bin Amru bin Hazm] bahwa dia menangkap seseorang petani non arab yang telah mencuri beberapa cincin besi, lalu dia mengurungnya untuk memotong tangannya. 'Amrah bin Abdurrahman mengutus mantan budaknya yang bernama [Umayyah] untuk menemuinya. Abu Bakar berkata; \"Budak wanita itu datang saat aku sedang bersama orang banyak, ia lalu berkata; ' [Amrah], bibimu menitip pesan kepadamu, 'Wahai anak saudaraku, kamu telah menangkap seorang petani yang mencuri sesuatu yang murah harganya dan ingin memotong tangannya? ' Saya menjawab; 'Benar'. Budak wanita itu berkata, \"Amrah berkata kepadamu, \"Amrah memesankan kepadamu bahwa tidak ada potong tangan kecuali pada seperempat dinar atau lebih'.\" Abu Bakar berkata; \"Maka aku membebaskan petani tadi.\""
            },
            {
                "number": 1317,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ السَّائِبِ بْنِ يَزِيدَ أَنَّهُ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِخَرَجَ عَلَيْهِمْ فَقَالَ إِنِّي وَجَدْتُ مِنْ فُلَانٍ رِيحَ شَرَابٍ فَزَعَمَ أَنَّهُ شَرَابُ الطِّلَاءِ وَأَنَا سَائِلٌ عَمَّا شَرِبَ فَإِنْ كَانَ يُسْكِرُ جَلَدْتُهُ فَجَلَدَهُ عُمَرُ الْحَدَّ تَامًّا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa`ib bin Yazid] ia mengabarkan kepadanya bahwa [Umar bin Khattab] keluar menemui kaumnya sambil berkata, \"Aku mencium berbau minuman keras dari si fulan.\" Lantas dia mengaku bahwa dia meminum ath thila` . Sa`ib bin Yazid bertanya tentang apa yang dia minum, jika memang memabukkan maka aku akan menderanya, kemudian Umar mendera orang itu dengan sempurna.\" "
            },
            {
                "number": 1318,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ أَنَّ عُمَرَ بْنَ الْخَطَّابِاسْتَشَارَ فِي الْخَمْرِ يَشْرَبُهَا الرَّجُلُ فَقَالَ لَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ نَرَى أَنْ تَجْلِدَهُ ثَمَانِينَ فَإِنَّهُ إِذَا شَرِبَ سَكِرَ وَإِذَا سَكِرَ هَذَى وَإِذَا هَذَى افْتَرَى أَوْ كَمَا قَالَ فَجَلَدَ عُمَرُ فِي الْخَمْرِ ثَمَانِينَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Tsaur bin Zaid Ad Dili] bahwa [Umar bin Khattab] bermusyawarah tentang seorang laki-laki yang minum khamr. [Ali bin Abu Thalib] berkata kepadanya; \"Aku berpendapat agar kamu menderanya delapan puluh kali dera, karena kalau dia minum maka akan mabuk. Kalau dia mabuk maka akan banyak mengigau. Jika banyak mengigau, maka akan banyak berbohong, \" atau seperti yang dikatakannya, \"Umar pun mendera peminum khamer dengan delapan puluh kali dera.\""
            },
            {
                "number": 1319,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّهُ سُئِلَ عَنْ حَدِّ الْعَبْدِ فِي الْخَمْرِ فَقَالَ بَلَغَنِي أَنَّ عَلَيْهِ نِصْفَ حَدِّ الْحُرِّ فِي الْخَمْرِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ وَعُثْمَانَ بْنَ عَفَّانَ وَعَبْدَ اللَّهِ بْنَ عُمَرَ قَدْ جَلَدُوا عَبِيدَهُمْ نِصْفَ حَدِّ الْحُرِّ فِي الْخَمْرِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa ia pernah ditanya tentang hukuman bagi seorang budak yang minum khamer. Dia menjawab; \"Telah sampai kepadaku bahwa hukuman bagi budak adalah setengah dari hukuman orang yang merdeka. [Umar bin Khattab] dan [utsman bin Affan] serta [Abdullah bin Umar] mendera budak-budak mereka setengah dari hukuman orang merdeka dalam masalah minum khamer.\""
            },
            {
                "number": 1320,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُمَا مِنْ شَيْءٍ إِلَّا اللَّهُ يُحِبُّ أَنْ يُعْفَى عَنْهُ مَا لَمْ يَكُنْ حَدًّا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] mendengar [Sa'id bin Musayyab] berkata; \"Semua perbuatan pelanggaran, Allah menyukai untuk di maafkan pelakunya selama bukan hukuman had.\""
            },
            {
                "number": 1321,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ النَّاسَ فِي بَعْضِ مَغَازِيهِ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَأَقْبَلْتُ نَحْوَهُ فَانْصَرَفَ قَبْلَ أَنْ أَبْلُغَهُ فَسَأَلْتُ مَاذَا قَالَ فَقِيلَ لِي نَهَى أَنْ يُنْبَذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada manusia di salah satu peperangan beliau. Abdullah bin Umar berkata; \"Aku lalu mendekatinya, namun beliau pergi sebelum aku menemuinya. Lalu aku bertanya apa yang baru saja beliau sampaikan, lalu ada yang memberitahukan kepadaku bahwa beliau melarang untuk menyimpan pada Duba dan muzaffat.\" "
            },
            {
                "number": 1322,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُنْبَذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Al 'Ala` bin Abdurrahman bin Ya'qub] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam melarang menyimpan pada duba dan muzaffat . "
            },
            {
                "number": 1323,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا وَالتَّمْرُ وَالزَّبِيبُ جَمِيعًا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] dari dari ['Atha bin Yasar] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam melarang membuat perasan busr dan ruthab (kurma basah) dalam satu campuran, kurma dan kismis dalam satu campuran.\" "
            },
            {
                "number": 1324,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْسُئِلَ رَسُولُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْبِتْعِ فَقَالَ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, berkata; \"Rasulullah shallallahu 'alaihi wasallam ditanya tentang Al bit', beliau lalu menjawab: \"Setiap minuman yang memabukkan maka itu haram.\" "
            },
            {
                "number": 1325,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْغُبَيْرَاءِ فَقَالَ لَا خَيْرَ فِيهَا وَنَهَى عَنْهَاقَالَ مَالِك فَسَأَلْتُ زَيْدَ بْنَ أَسْلَمَ مَا الْغُبَيْرَاءُ فَقَالَ هِيَ الْأُسْكَرْكَةُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari ['Atha bin Yasar] bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang Ghubaira (perasan jagung atau padi), beliau menjawab: \"Tidak ada kebaikan di dalamnya.\" Dan beliau melarangnya. Malik berkata; \"Saya bertanya kepada Zaid bin Aslam, apakah al ghubaira itu? Maka dia menjawab; \"Itu adalah Al Uskarkah (perasaan padi) \"."
            },
            {
                "number": 1326,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا ثُمَّ لَمْ يَتُبْ مِنْهَا حُرِمَهَا فِي الْآخِرَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minum arak di dunia kemudian tidak bertaubat, maka akan diharamkan baginya untuk meminumnya di akhirat.\""
            },
            {
                "number": 1327,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ وَعْلَةَ الْمِصْرِيِّأَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ عَمَّا يُعْصَرُ مِنْ الْعِنَبِ فَقَالَ ابْنُ عَبَّاسٍ أَهْدَى رَجُلٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاوِيَةَ خَمْرٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا عَلِمْتَ أَنَّ اللَّهَ حَرَّمَهَا قَالَ لَا فَسَارَّهُ رَجُلٌ إِلَى جَنْبِهِ فَقَالَ لَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَ سَارَرْتَهُ فَقَالَ أَمَرْتُهُ أَنْ يَبِيعَهَا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا فَفَتَحَ الرَّجُلُ الْمَزَادَتَيْنِ حَتَّى ذَهَبَ مَا فِيهِمَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] dari [Ibnu Wa'lah Al Mishri] ia bertanya kepada Abdullah bin 'Abbas tentang perasan buah anggur. [Abdullah bin 'Abbas] menjawab; \"Pernah seorang pemuda memberi hadiah Rasulullah shallallahu 'alaihi wasallam segelas arak, kemudian Rasulullah shallallahu 'alaihi wasallam bertanya; \"Tidakkah kamu tahu bahwa Allah telah mengharamkannya.\" Dia menjawab; \"Tidak.\" Lalu laki-laki itu menyembunyikan wadah itu di sampingnya. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Kenapa engkau menyembunyikannya?\" Dia menjawab; \"Saya menyuruhnya untuk menjualnya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya apa yang telah diharamkan untuk diminum maka diharamkan untuk dijual, \" pemuda itu lalu membuka dua wadahnya dan membuang apa yang ada di dalamnya."
            },
            {
                "number": 1328,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَكُنْتُ أَسْقِي أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَأَبَا طَلْحَةَ الْأَنْصَارِيَّ وَأُبَيَّ بْنَ كَعْبٍ شَرَابًا مِنْ فَضِيخٍ وَتَمْرٍ قَالَ فَجَاءَهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ فَقَالَ أَبُو طَلْحَةَ يَا أَنَسُ قُمْ إِلَى هَذِهِ الْجِرَارِ فَاكْسِرْهَا قَالَ فَقُمْتُ إِلَى مِهْرَاسٍ لَنَا فَضَرَبْتُهَا بِأَسْفَلِهِ حَتَّى تَكَسَّرَتْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] berkata; \"Aku menyuguhkan air minum dari perasan kurma muda dan kurma matang kepada Abu Ubaidah bin Al Jarrah, Abu Thalhah Al Anshari dan Ubay bin Ka'ab.\" Anas berkata; \"Maka datang seseorang dan mengatakan bahwa arak telah diharamkan, Abu Thalhah berkata; \"Wahai Anas, berdiri dan hancurkanlah bejana-bejana ini.\" Anas berkata; \"Maka aku berdiri menuju gentong milik kami dan memukulnya dari bagian bawahnya sampai pecah.\""
            },
            {
                "number": 1329,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ وَاقِدِ بْنِ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ أَنَّهُ أَخْبَرَهُ عَنْ مَحْمُودِ بْنِ لَبِيدٍ الْأَنْصَارِيِّ أَنَّ عُمَرَ بْنَ الْخَطَّابِحِينَ قَدِمَ الشَّامَ شَكَا إِلَيْهِ أَهْلُ الشَّامِ وَبَاءَ الْأَرْضِ وَثِقَلَهَا وَقَالُوا لَا يُصْلِحُنَا إِلَّا هَذَا الشَّرَابُ فَقَالَ عُمَرُ اشْرَبُوا هَذَا الْعَسَلَ قَالُوا لَا يُصْلِحُنَا الْعَسَلُ فَقَالَ رَجُلٌ مِنْ أَهْلِ الْأَرْضِ هَلْ لَكَ أَنْ نَجْعَلَ لَكَ مِنْ هَذَا الشَّرَابِ شَيْئًا لَا يُسْكِرُ قَالَ نَعَمْ فَطَبَخُوهُ حَتَّى ذَهَبَ مِنْهُ الثُّلُثَانِ وَبَقِيَ الثُّلُثُ فَأَتَوْا بِهِ عُمَرَ فَأَدْخَلَ فِيهِ عُمَرُ إِصْبَعَهُ ثُمَّ رَفَعَ يَدَهُ فَتَبِعَهَا يَتَمَطَّطُ فَقَالَ هَذَا الطِّلَاءُ هَذَا مِثْلُ طِلَاءِ الْإِبِلِ فَأَمَرَهُمْ عُمَرُ أَنْ يَشْرَبُوهُ فَقَالَ لَهُ عُبَادَةُ بْنُ الصَّامِتِ أَحْلَلْتَهَا وَاللَّهِ فَقَالَ عُمَرُ كَلَّا وَاللَّهِ اللَّهُمَّ إِنِّي لَا أُحِلُّ لَهُمْ شَيْئًا حَرَّمْتَهُ عَلَيْهِمْ وَلَا أُحَرِّمُ عَلَيْهِمْ شَيْئًا أَحْلَلْتَهُ لَهُمْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Daud bin Al Hushain] dari [Waqid bin 'Amru bin Sa'ad bin Mu'adz] ia mengabarkan kepadanya, dari [Mahmud bin Labid Al Anshari] bahwa ketika [Umar bin Khattab] tiba di Syam, penduduk Syam mengeluh kepadanya tentang wabah penyakit yang semakin dahsyat. Mereka berkata; \"Tidak ada yang menyembuhkan kita kecuali dengan minum air ini.\" Umar berkata; \"Minumlah madu ini.\" Mereka menjawab; \"Madu ini tidak manjur.\" Lalu ada seorang yang terkena wabah berkata; \"Bisakah kita membuat dari minuman ini sesuatu yang tidak memabukkan?\" 'Umar bin Khattab menjawab; \"Ya.\" Mereka memasaknya hingga habis dua pertiganya dan tersisa sepertiganya, lalu mereka membawanya kepada Umar. Umar memasukkan jarinya dan mengangkat tangannya diikuti dengan lengketannya. Kemudian dia berkata; \"Arak ini seperti halnya minyak unta.\" Maka Umar menyuruh mereka meminumnya.\" Ubadah bin Shamit berkata kepadanya; \"Demi Allah, engkau telah menghalalkannya.\" Umar menjawab; \"Sekali-kali tidak. Demi Allah, Ya Allah, sungguh aku tidak menghalalkan untuk mereka apa yang telah Engkau haramkan dan tidak mengharamkan untuk mereka sesuatu yang telah Engkau halalkan.\""
            },
            {
                "number": 1330,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رِجَالًا مِنْ أَهْلِ الْعِرَاقِ قَالُوا لَهُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّا نَبْتَاعُ مِنْ ثَمَرِ النَّخْلِ وَالْعِنَبِ فَنَعْصِرُهُ خَمْرًا فَنَبِيعُهَا فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ إِنِّي أُشْهِدُ اللَّهَ عَلَيْكُمْ وَمَلَائِكَتَهُ وَمَنْ سَمِعَ مِنْ الْجِنِّ وَالْإِنْسِ أَنِّي لَا آمُرُكُمْ أَنْ تَبِيعُوهَا وَلَا تَبْتَاعُوهَا وَلَا تَعْصِرُوهَا وَلَا تَشْرَبُوهَا وَلَا تَسْقُوهَا فَإِنَّهَا رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa beberapa orang dari penduduk Iraq berkata kepadanya; \"Wahai Abu Abdurrahman, kami membeli buah kurma dan anggur lalu kami memerasnya menjadi semacam arak dan kami menjualnya.\" Abdullah bin Umar berkata; \"Saya persaksikan kalian kepada Allah, malaikat-malaikatNya dan siapa saja yang mendengar dari golongan jin dan manusia. Sesungguhnya aku tidak pernah menyuruh kalian untuk menjual, atau membelinya, atau memerasnya, atau meminumnya, ataupun menyuguhkannya untuk orang lain, karena itu adalah perbuatan setan yang najid.\""
            },
            {
                "number": 1331,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِأَنَّ فِي الْكِتَابِ الَّذِي كَتَبَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ أَنَّ فِي النَّفْسِ مِائَةً مِنْ الْإِبِلِ وَفِي الْأَنْفِ إِذَا أُوعِيَ جَدْعًا مِائَةٌ مِنْ الْإِبِلِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ مِثْلُهَا وَفِي الْعَيْنِ خَمْسُونَ وَفِي الْيَدِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي كُلِّ أُصْبُعٍ مِمَّا هُنَالِكَ عَشْرٌ مِنْ الْإِبِلِ وَفِي السِّنِّ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdullah bin Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [Bapaknya] bahwa surat yang di tulis Rasulullah Shalla Allahu 'alaihi wa sallam untuk 'Amru bin Hazm tentang diyat, bahwa: pada setiap jiwa seratus ekor unta, pada bagian hidung jika retak atau terputus, diyatnya seratus ekor unta, pada bagian luka kepala maka sepertiga diyat, dan untuk luka dalam juga sepertiga, pada bagian mata lima puluh ekor, pada tangan lima puluh, dan kaki juga lima puluh. Untuk setiap jari-jarinya sepuluh ekor unta, untuk gigi dan luka yang kelihatan tulangnya masing-masing lima ekor unta.\""
            },
            {
                "number": 1332,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك أَنَّ ابْنَ شِهَابٍكَانَ يَقُولُ فِي دِيَةِ الْعَمْدِ إِذَا قُبِلَتْ خَمْسٌ وَعِشْرُونَ بِنْتَ مَخَاضٍ وَخَمْسٌ وَعِشْرُونَ بِنْتَ لَبُونٍ وَخَمْسٌ وَعِشْرُونَ حِقَّةً وَخَمْسٌ وَعِشْرُونَ جَذَعَةً",
                "id": "Telah menceritakan kepadaku Yahya dari Malik bahwa [Ibnu Syihab] berkata; tentang diyat pembunuhan yang di sengaja, \"Jika terbunuh maka dua puluh lima ekor bintu makhadl, dua puluh lima ekor bintu labun, dua puluh lima ekor hiqqah dan dua puluh lima ekor jad'ah.\" "
            },
            {
                "number": 1333,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ كَتَبَ إِلَى مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَأَنَّهُ أُتِيَ بِمَجْنُونٍ قَتَلَ رَجُلًا فَكَتَبَ إِلَيْهِ مُعَاوِيَةُ أَنْ اعْقِلْهُ وَلَا تُقِدْ مِنْهُ فَإِنَّهُ لَيْسَ عَلَى مَجْنُونٍ قَوَدٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa Marwan bin Al Hakam menulis surat kepada [Mu'awiyah bin Abu Sufyan], bahwa pernah dihadapkan kepada orang gila yang telah membunuh seseorang. Maka Mu'awiyah menjawab; \"Ikatlah dia dan jangan engkau balas semisal dengan perbuatannya, karena orang gila itu tidak boleh diqishas.\""
            },
            {
                "number": 1334,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عِرَاكِ بْنِ مَالِكٍ وَسُلَيْمَانَ بْنِ يَسَارٍأَنَّ رَجُلًا مِنْ بَنِي سَعْدِ بْنِ لَيْثٍ أَجْرَى فَرَسًا فَوَطِئَ عَلَى إِصْبَعِ رَجُلٍ مِنْ جُهَيْنَةَ فَنُزِيَ مِنْهَا فَمَاتَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لِلَّذِي ادُّعِيَ عَلَيْهِمْ أَتَحْلِفُونَ بِاللَّهِ خَمْسِينَ يَمِينًا مَا مَاتَ مِنْهَا فَأَبَوْا وَتَحَرَّجُوا وَقَالَ لِلْآخَرِينَ أَتَحْلِفُونَ أَنْتُمْ فَأَبَوْا فَقَضَى عُمَرُ بْنُ الْخَطَّابِ بِشَطْرِ الدِّيَةِ عَلَى السَّعْدِيِّينَقَالَ مَالِك وَلَيْسَ الْعَمَلُ عَلَى هَذَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari ['Iraq bin Malik] dan [Sulaiman bin Yasar] bahwa seseorang dari Bani Said bin Laits mengendarai kuda lalu menginjak jari seseorang dari Juhainah hingga terputus dan mati. Kemudian [Umar bin Khattab] berkata kepada para terdakwa; 'Apakah kalian mau bersumpah atas nama Allah limapuluh kali, bahwa dia tidak mati karenanya? ' mereka menolak dan merasa berat.\" Kemudian Umar bertanya kepada yang lainnya; 'Maukah kalian bersumpah? ' merekapun enggan. Kemudian Umar bin Khattab memutuskan agar membayar setengah diyat atas orang-orang Bani Said. Malik berkata; \"Bukanlah seperti ini pendapat kami.\""
            },
            {
                "number": 1335,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّ ابْنَ شِهَابٍ وَسُلَيْمَانَ بْنَ يَسَارٍ وَرَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ كَانُوا يَقُولُونَدِيَةُ الْخَطَإِ عِشْرُونَ بِنْتَ مَخَاضٍ وَعِشْرُونَ بِنْتَ لَبُونٍ وَعِشْرُونَ ابْنَ لَبُونٍ ذَكَرًا وَعِشْرُونَ حِقَّةً وَعِشْرُونَ جَذَعَةً",
                "id": "Telah menceritakan kepadaku dari Malik bahwa [Ibnu Syihab] dan [Sulaiman bin Yasar] dan [Rabi'ah bin Abu Abdurrahman] mereka mengatakan bahwa diyat pembunuhan karena kesalahan adalah dua puluh ekor bintu makhadl, dua puluh ekor bintu labun, dua puluh ekor ibnu labun jantan, dua puluh hiqqah dan dua puluh ekor jad'ah.\" "
            },
            {
                "number": 1336,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُتُعَاقِلُ الْمَرْأَةُ الرَّجُلَ إِلَى ثُلُثِ الدِّيَةِ إِصْبَعُهَا كَإِصْبَعِهِ وَسِنُّهَا كَسِنِّهِ وَمُوضِحَتُهَا كَمُوضِحَتِهِ وَمُنَقِّلَتُهَا كَمُنَقِّلَتِهِو حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ وَبَلَغَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّهُمَا كَانَا يَقُولَانِ مِثْلَ قَوْلِ سَعِيدِ بْنِ الْمُسَيَّبِ فِي الْمَرْأَةِ أَنَّهَا تُعَاقِلُ الرَّجُلَ إِلَى ثُلُثِ دِيَةِ الرَّجُلِ فَإِذَا بَلَغَتْ ثُلُثَ دِيَةِ الرَّجُلِ كَانَتْ إِلَى النِّصْفِ مِنْ دِيَةِ الرَّجُلِ قَالَ مَالِك وَتَفْسِيرُ ذَلِكَ أَنَّهَا تُعَاقِلُهُ فِي الْمُوضِحَةِ وَالْمُنَقِّلَةِ وَمَا دُونَ الْمَأْمُومَةِ وَالْجَائِفَةِ وَأَشْبَاهِهِمَا مِمَّا يَكُونُ فِيهِ ثُلُثُ الدِّيَةِ فَصَاعِدًا فَإِذَا بَلَغَتْ ذَلِكَ كَانَ عَقْلُهَا فِي ذَلِكَ النِّصْفَ مِنْ عَقْلِ الرَّجُلِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Seorang wanita membayar atas laki-laki dengan sepertiga diyat, jari dengan jari, gigi dengan gigi, luka yang sampai kelihatan tulangnya dengan luka yang sama, dan tulang yang pecah dengan tulang yang pecah.\" Telah menceritakan kepadaku Malik dari [Ibnu Syihab] telah sampai kepadanya dari ['Urwah bin Az Zubair] bahwa keduanya berpendapat seperti pendapat Sa'id bin Musayyab tentang perempuan yang membayar sepertiga diyat atas laki-laki, jika telah sampai sepertiga diyat laki-laki maka naik menjadi setengahnya. Malik berkata; \"Tafsiran hal itu bahwa perempuan itu membayar diyat pada luka yang hingga terlihat tulangnya, atau pada luka yang menyebabkan tulangnya pecah, atau luka-luka yang tidak sampai menembus tulang kepala atau perut, atau yang semisalnya, maka masih dalam sepertiga diyat lebih, jika telah melebihinya maka membayar setengah dari diyat laki-laki.\""
            },
            {
                "number": 1337,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَمِعَ ابْنَ شِهَابٍ يَقُولُمَضَتْ السُّنَّةُ أَنَّ الرَّجُلَ إِذَا أَصَابَ امْرَأَتَهُ بِجُرْحٍ أَنَّ عَلَيْهِ عَقْلَ ذَلِكَ الْجُرْحِ وَلَا يُقَادُ مِنْهُ",
                "id": "Telah menceritakan kepadaku dari Malik bahwa dia telah mendengar [Ibnu Syihab] berkata; \"Merupakan sunnah bahwa seorang laki-laki jika melukai isterinya maka dia harus membayar diyat seharga luka tersebut, namun ia tidak diqishash.\""
            },
            {
                "number": 1338,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَأَنَّ امْرَأَتَيْنِ مِنْ هُذَيْلٍ رَمَتْ إِحْدَاهُمَا الْأُخْرَى فَطَرَحَتْ جَنِينَهَا فَقَضَى فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman bin Auf] dari [Abu Hurairah] berkata, \"Dua orang wanita dari Hudzail saling melempar, hingga salah satu dari mereka membunuh janin yang ada dalam perut lawannya. Lalu Rasulullah shallallahu 'alaihi wasallam memutuskan agar orang yang membunuh janin tersebut membebaskan seorang budak laki-laki atau perempuan yang harganya mahal (sepuluh kali dari nilai diyat) .\""
            },
            {
                "number": 1339,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي الْجَنِينِ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ فَقَالَ الَّذِي قُضِيَ عَلَيْهِ كَيْفَ أَغْرَمُ مَا لَا شَرِبَ وَلَا أَكَلْ وَلَا نَطَقَ وَلَا اسْتَهَلْ وَمِثْلُ ذَلِكَ بَطَلْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam memutuskan perkara janin yang dibunuh diperut ibunya dengan membebaskan seorang budak laki-laki atau perempuan. Kemudian terdakwa berkata; \"Bagaimana mungkin aku didenda karena membunuh sesuatu yang belum makan, minum, bicara atau menangis saat lahir?\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang ini adalah kawannya dukun.\""
            },
            {
                "number": 1340,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّهُ كَانَ يَقُولُالْغُرَّةُ تُقَوَّمُ خَمْسِينَ دِينَارًا أَوْ سِتَّ مِائَةِ دِرْهَمٍ وَدِيَةُ الْمَرْأَةِ الْحُرَّةِ الْمُسْلِمَةِ خَمْسُ مِائَةِ دِينَارٍ أَوْ سِتَّةُ آلَافِ دِرْهَمٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] berkata; \"Al Ghurrah dihargai antara lima puluh dinar atau enam ratus dirham, dan diyatnya perempuan merdeka adalah lima ratus dinar atau enam ribu dirham.\" "
            },
            {
                "number": 1341,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُفِي الشَّفَتَيْنِ الدِّيَةُ كَامِلَةً فَإِذَا قُطِعَتْ السُّفْلَى فَفِيهَا ثُلُثَا الدِّيَةِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] Bahwasanya ia berkata tentang diyat dua bibir, \"Diatnya adalah diyat yang sempurna, jika dipotong bawahnya saja maka membayar sepertiga diyat."
            },
            {
                "number": 1342,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك أَنَّهُ سَأَلَ ابْنَ شِهَابٍعَنْ الرَّجُلِ الْأَعْوَرِ يَفْقَأُ عَيْنَ الصَّحِيحِ فَقَالَ ابْنُ شِهَابٍ إِنْ أَحَبَّ الصَّحِيحُ أَنْ يَسْتَقِيدَ مِنْهُ فَلَهُ الْقَوَدُ وَإِنْ أَحَبَّ فَلَهُ الدِّيَةُ أَلْفُ دِينَارٍ أَوْ اثْنَا عَشَرَ أَلْفَ دِرْهَمٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dia bertanya kepada [Ibnu Syihab] tentang seorang laki-laki buta mencongkel mata orang lain. Ibnu Syihab berkata; \"Jika yang di congkel ingin membalasnya maka itu adalah haknya, jika dia ingin agar dibayar dengan diyat maka diyatnya adalah seribu dinar atau duabelas ribu dirham.\""
            },
            {
                "number": 1343,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّ زَيْدَ بْنَ ثَابِتٍكَانَ يَقُولُ فِي الْعَيْنِ الْقَائِمَةِ إِذَا طَفِئَتْ مِائَةُ دِينَارٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar] bahwa [Zaid bin Tsabit] berkata tentang mata yang tidak dapat melihat setelah dilukai, \"Diyatnya seratus Dinar.\""
            },
            {
                "number": 1344,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ سَمِعَ سُلَيْمَانَ بْنَ يَسَارٍ يَذْكُرُأَنَّ الْمُوضِحَةَ فِي الْوَجْهِ مِثْلُ الْمُوضِحَةِ فِي الرَّأْسِ إِلَّا أَنْ تَعِيبَ الْوَجْهَ فَيُزَادُ فِي عَقْلِهَا مَا بَيْنَهَا وَبَيْنَ عَقْلِ نِصْفِ الْمُوضِحَةِ فِي الرَّأْسِ فَيَكُونُ فِيهَا خَمْسَةٌ وَسَبْعُونَ دِينَارًا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] Bahwasanya ia telah mendengar [Sulaiman bin Yasar] berkata, \"Sesungguhnya Mudlihah pada wajah diatnya sama dengan mudlihah yang ada pada kepala, kecuali jika terlalu parah hingga membuat cela pada wajah maka diatnya ditambah ditambah sekitar setengah diyat pada luka di kepala, sehingga diyatnya menjadi tujuh puluh lima dinar.\" "
            },
            {
                "number": 1345,
                "arab": "وَقَدْ قَالَ ابْنُ شِهَابٍلَيْسَ فِي الْمَأْمُومَةِ قَوَدٌ",
                "id": "sungguh [Ibnu Syihab] berkata, \"Tidak ada balasan pada luka yang dalam.\""
            },
            {
                "number": 1346,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَكُلُّ نَافِذَةٍ فِي عُضْوٍ مِنْ الْأَعْضَاءِ فَفِيهَا ثُلُثُ عَقْلِ ذَلِكَ الْعُضْوِحَدَّثَنِي مَالِك كَانَ ابْنُ شِهَابٍ لَا يَرَى ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Setiap luka yang ada pada anggota badan, maka diatnya adalah sepertiga diat anggota badan tersebut.\" Telah menceritakan kepadaku Malik berkata, \" [Ibnu Syihab] tidak berpendapat demikian.\""
            },
            {
                "number": 1347,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِأَقَادَ مِنْ الْمُنَقِّلَةِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa [Abdullah bin Az Zubair] membalas luka yang menyebabkan pecahnya tulang.\""
            },
            {
                "number": 1348,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّهُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِكَمْ فِي إِصْبَعِ الْمَرْأَةِ فَقَالَ عَشْرٌ مِنْ الْإِبِلِ فَقُلْتُ كَمْ فِي إِصْبَعَيْنِ قَالَ عِشْرُونَ مِنْ الْإِبِلِ فَقُلْتُ كَمْ فِي ثَلَاثٍ فَقَالَ ثَلَاثُونَ مِنْ الْإِبِلِ فَقُلْتُ كَمْ فِي أَرْبَعٍ قَالَ عِشْرُونَ مِنْ الْإِبِلِ فَقُلْتُ حِينَ عَظُمَ جُرْحُهَا وَاشْتَدَّتْ مُصِيبَتُهَا نَقَصَ عَقْلُهَا فَقَالَ سَعِيدٌ أَعِرَاقِيٌّ أَنْتَ فَقُلْتُ بَلْ عَالِمٌ مُتَثَبِّتٌ أَوْ جَاهِلٌ مُتَعَلِّمٌ فَقَالَ سَعِيدٌ هِيَ السُّنَّةُ يَا ابْنَ أَخِي",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Rabi'ah bin Abu Abdurrahman] berkata; \"Aku bertanya kepada [Sa'id bin Musayyab]; 'Berapa diyat untuk jari seorang wanita? ' Dia menjawab; 'Sepuluh ekor unta.\" Saya bertanya lagi; \"Berapa untuk dua jari?\" dia menjawab; \"Dua puluh ekor unta.\" Saya bertanya lagi; \"Berapa untuk tiga jari?\" dia menjawab; \"Tiga puluh ekor unta.\" Saya bertanya; \"Berapa untuk empat jari?\" dia menjawab; \"Dua puluh ekor unta?\" Aku bertanya; \"Bagaimana jika semakin besar lukanya dan parah sakitnya, apakah berkurang diyatnya, \" Sa'id bertanya; \"Apakah kamu orang Iraq?\" Aku menjawab; \"Tidak, tapi aku hanyalah seorang 'alim yang ingin mencari kepastian dan seorang bodoh yang ingin belajar.\" Said berkata; \"Itu adalah sunnah, Wahai anak saudaraku.\""
            },
            {
                "number": 1349,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ مُسْلِمِ بْنِ جُنْدُبٍ عَنْ أَسْلَمَ مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّ عُمَرَ بْنَ الْخَطَّابِقَضَى فِي الضِّرْسِ بِجَمَلٍ وَفِي التَّرْقُوَةِ بِجَمَلٍ وَفِي الضِّلَعِ بِجَمَلٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] dari [Muslim bin Jundub] dari [Aslam] bekas budak Umar bin Khattab, bahwa [Umar bin Khattab] memutuskan untuk diyat gigi geraham dengan seekor unta, diyat tulang selangka dengan seekor unta dan diyat tulang rusuk dengan seekor unta."
            },
            {
                "number": 1350,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ قَضَى عُمَرُ بْنُ الْخَطَّابِفِي الْأَضْرَاسِ بِبَعِيرٍ بَعِيرٍوَقَضَى مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ فِي الْأَضْرَاسِ بِخَمْسَةِ أَبْعِرَةٍ خَمْسَةِ أَبْعِرَةٍ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَالدِّيَةُ تَنْقُصُ فِي قَضَاءِ عُمَرَ بْنِ الْخَطَّابِ وَتَزِيدُ فِي قَضَاءِ مُعَاوِيَةَ فَلَوْ كُنْتُ أَنَا لَجَعَلْتُ فِي الْأَضْرَاسِ بَعِيرَيْنِ بَعِيرَيْنِ فَتِلْكَ الدِّيَةُ سَوَاءٌ وَكُلُّ مُجْتَهِدٍ مَأْجُورٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] bahwa ia mendengar [Sa'id bin Musayyab] berkata, \" [Umar bin Khattab] memutuskan dalam perkara diyat gigi geraham dengan seekor unta seekor unta. Sedangkan [Mu'awiyah bin Abu Sufyan] memutuskan dengan lima ekor unta lima ekor unta.\" Sa'id bin Musayyab berkata; \"Diyat berkurang dalam putusan Umar bin Khattab dan bertambah dalam putusan Mu'awiyah, jika aku yang memutuskan maka akan aku jadikan untuk diyat gigi geraham dua ekor unta dua ekor unta. Diyat tersebut adalah sama dan setiap mujtahid akan mendapatkan pahala.\""
            },
            {
                "number": 1351,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُإِذَا أُصِيبَتْ السِّنُّ فَاسْوَدَّتْ فَفِيهَا عَقْلُهَا تَامًّا فَإِنْ طُرِحَتْ بَعْدَ أَنْ اسْوَدَّتْ فَفِيهَا عَقْلُهَا أَيْضًا تَامًّا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] ia berkata; \"Jika semua gigi yang ada terkena sampai menghitam maka diyatnya sempurna, jika gigi tersebut rontok setelah menghitam maka diyatnya juga sempurna.\""
            },
            {
                "number": 1352,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ أَبِي غَطَفَانَ بْنِ طَرِيفٍ الْمُرِّيِّ أَنَّهُ أَخْبَرَهُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ بَعَثَهُ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍيَسْأَلُهُ مَاذَا فِي الضِّرْسِ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فِيهِ خَمْسٌ مِنْ الْإِبِلِ قَالَ فَرَدَّنِي مَرْوَانُ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقَالَ أَتَجْعَلُ مُقَدَّمَ الْفَمِ مِثْلَ الْأَضْرَاسِ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ لَوْ لَمْ تَعْتَبِرْ ذَلِكَ إِلَّا بِالْأَصَابِعِ عَقْلُهَا سَوَاءٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Daud bin Al Hushain] dari [Abu Ghathafan bin Tharif Al Muri] Bahwasanya ia mengabarkan kepadanya, bahwa Marwan bin Hakam mengutusnya kepada Abdullah bin 'Abbas, untuk menanyakan diyat gigi geraham. Lalu [Abdullah bin Abbas] menjawab; \"Diyatnya adalah lima ekor unta.\" Abu Ghathafan berkata; \"Lalu Marwan kembali menyuruhku menmui Abdullah bin Abbas untuk menanyakan; \"Apakah engkau menyamakan antara mulut bagian depan dengan diyat gigi geraham? ' Abdullah bin Abbas menjawab; \"Jika engkau tidak membandingkan (melogikanya) selain dengan jari jemari, maka diyatnya pun sama.\""
            },
            {
                "number": 1353,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّهُ كَانَ يُسَوِّي بَيْنَ الْأَسْنَانِ فِي الْعَقْلِ وَلَا يُفَضِّلُ بَعْضَهَا عَلَى بَعْضٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin 'Urwah] dari [Bapaknya] bahwasanya ia menyamakan diyat semua gigi-gigi dan tidak melebihkan antara satu dengan yang lain.\""
            },
            {
                "number": 1354,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ كَانَ يَقُولُدِيَةُ الْمَجُوسِيِّ ثَمَانِيَ مِائَةِ دِرْهَمٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] bahwa [Sulaiman bin Yasar] berkata; \"Diyat bagi orang Majusi adalah delapan ratus dirham.\""
            },
            {
                "number": 1355,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ كَانَ يَقُولُلَيْسَ عَلَى الْعَاقِلَةِ عَقْلٌ فِي قَتْلِ الْعَمْدِ إِنَّمَا عَلَيْهِمْ عَقْلُ قَتْلِ الْخَطَإِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin 'Urwah] dari [Bapaknya] berkata; \"Al Aqilah tidak wajib membayar diat pada pembunuhan sengaja, tetapi mereka hanya membayar pada pembunuhan karena kesalahan.\" "
            },
            {
                "number": 1356,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّهُ قَالَمَضَتْ السُّنَّةُ أَنَّ الْعَاقِلَةَ لَا تَحْمِلُ شَيْئًا مِنْ دِيَةِ الْعَمْدِ إِلَّا أَنْ يَشَاءُوا ذَلِكَو حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] berkata; \"Sudah menjadi sesuatu yang lazim (dalam sunah) bahwa Al Aqilah tidak terbebani oleh diat pembunuhan yang disengaja, kecuali jika bersedia.\" Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] seperti hadits tersebut. "
            },
            {
                "number": 1357,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِنَشَدَ النَّاسَ بِمِنًى مَنْ كَانَ عِنْدَهُ عِلْمٌ مِنْ الدِّيَةِ أَنْ يُخْبِرَنِي فَقَامَ الضَّحَّاكُ بْنُ سُفْيَانَ الْكِلَابِيُّ فَقَالَ كَتَبَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُوَرِّثَ امْرَأَةَ أَشْيَمَ الضِّبَابِيِّ مِنْ دِيَةِ زَوْجِهَا فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ ادْخُلْ الْخِبَاءَ حَتَّى آتِيَكَ فَلَمَّا نَزَلَ عُمَرُ بْنُ الْخَطَّابِ أَخْبَرَهُ الضَّحَّاكُ فَقَضَى بِذَلِكَ عُمَرُ بْنُ الْخَطَّابِقَالَ ابْنُ شِهَابٍ وَكَانَ قَتْلُ أَشْيَمَ خَطَأً",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] bahwa [Umar bin Khattab] menyerukan kepada orang-orang di Mina; \"Barangsiapa memiliki ilmu tentang diyat agar mengabariku.\" Lalu [Dlahak bin Sufyan Al Kilabi] berdiri dan berkata; \"Rasulullah shallallahu 'alaihi wasallam menulis untukku agar aku memberikan warisan kepada isteri Asyyam Adl Dlibabi dari diyat suaminya.\" Umar bin Khattab berkata kepadanya; \"Kalau begitu masuklah ke dalam tenda hingga aku menemuimu.\" Ketika Umar bin Khattab turun, Dlahak pun mengabarkan hal itu hingga Umar bin Al Khattab memberi putusan dengan apa yang disampaikan olehnya. Ibnu Syihab berkata; \"Pembunuhan terhadap Asyyam terjadi karena kesalahan.\""
            },
            {
                "number": 1358,
                "arab": "و حَدَّثَنِي مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍأَنَّ رَجُلًا مِنْ بَنِي مُدْلِجٍ يُقَالُ لَهُ قَتَادَةُ حَذَفَ ابْنَهُ بِالسَّيْفِ فَأَصَابَ سَاقَهُ فَنُزِيَ فِي جُرْحِهِ فَمَاتَ فَقَدِمَ سُرَاقَةُ بْنُ جُعْشُمٍ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ لَهُ عُمَرُ اعْدُدْ عَلَى مَاءِ قُدَيْدٍ عِشْرِينَ وَمِائَةَ بَعِيرٍ حَتَّى أَقْدَمَ عَلَيْكَ فَلَمَّا قَدِمَ إِلَيْهِ عُمَرُ بْنُ الْخَطَّابِ أَخَذَ مِنْ تِلْكَ الْإِبِلِ ثَلَاثِينَ حِقَّةً وَثَلَاثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً ثُمَّ قَالَ أَيْنَ أَخُو الْمَقْتُولِ قَالَ هَأَنَذَا قَالَ خُذْهَا فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ لِقَاتِلٍ شَيْءٌ",
                "id": "Telah menceritakan kepadaku Malik dari [Yahya bin Sa'id] dari [Amru bin Syu'aib] bahwa seorang laki-laki dari Bani Mudlij yang bernama Qatadah melempar anaknya dengan pedang hingga mengenai kakinya. Darah mengalir dari lukanya hingga menyebabkan kematiannya. Kemudian Suraqah bin Ju'syam menemui Umar bin Khattab dan mengabarkan hal tersebut. [Umar] berkata; \"Kumpulkanlah seratus dua puluh unta di air Qudaid hingga aku menemuimu.\" Ketika Umar menemuinya, Umar langsung mengambil dari unta-unta itu tersebut; tiga puluh ekor hiqqah, tiga puluh ekor jadz'ah dan empat puluh khalifah. Kemudian ia bertanya; \"Di mana saudara orang yang terbunuh?\" Suraqah menjawab; \"Di sini.\" 'Umar bin Khattab berkata; \"Ambillah unta-unta ini. Karena Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang membunuh tidak mendapatkan apa-apa.\" "
            },
            {
                "number": 1359,
                "arab": "و حَدَّثَنِي مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِأَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ أُحَيْحَةُ بْنُ الْجُلَاحِ كَانَ لَهُ عَمٌّ صَغِيرٌ هُوَ أَصْغَرُ مِنْ أُحَيْحَةَ وَكَانَ عِنْدَ أَخْوَالِهِ فَأَخَذَهُ أُحَيْحَةُ فَقَتَلَهُ فَقَالَ أَخْوَالُهُ كُنَّا أَهْلَ ثُمِّهِ وَرُمِّهِ حَتَّى إِذَا اسْتَوَى عَلَى عُمَمِهِ غَلَبَنَا حَقُّ امْرِئٍ فِي عَمِّهِ قَالَ عُرْوَةُ فَلِذَلِكَ لَا يَرِثُ قَاتِلٌ مَنْ قَتَلَ",
                "id": "Telah menceritakan kepadaku Malik dari [Yahya bin Sa'id] dari ['Urwah bin Zubair] berkata; Seorang laki-laki Anshar yang bernama Uhaihah bin Al Julah mempunyai paman yang umurnya masih muda, bahkan lebih muda di dirinya. Dan paman kecilnya tersebut hidup bersama-sama paman-paman dari keluarga ibunya. Lalu Uhaihah menjemput dan membunuhnya. Para paman dari pihak ibu berkata; \"Kami dulu yang mengurusinya sejak kecil, dan ketika dia tumbuh besar dan dewasa, Uhaihah mengambilnya dari kami secara paksa.\" 'Urwah berkata; \"Maka dari itu, seorang pembunuh tidak mewarisi harta orang yang dibunuhnya.\""
            },
            {
                "number": 1360,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَرْحُ الْعَجْمَاءِ جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُقَالَ مَالِك وَتَفْسِيرُ الْجُبَارِ أَنَّهُ لَا دِيَةَ فِيهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dan [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pencideraan terhadap binatang tidak dikenakan denda, (pengrusakan terhadap) sumur juga tidak dikenakan denda, (pengrusakan) barang tambang juga tidak dikenakan denda, dan dalam (pengrusakan) harta karun (dikenakan denda) seperlima.\" Malik berkata; \"Penjelasan arti jubar adalah tidak ada diyat di dalamnya.\""
            },
            {
                "number": 1361,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ عُمَرَ بْنَ الْخَطَّابِقَتَلَ نَفَرًا خَمْسَةً أَوْ سَبْعَةً بِرَجُلٍ وَاحِدٍ قَتَلُوهُ قَتْلَ غِيلَةٍ وَقَالَ عُمَرُ لَوْ تَمَالَأَ عَلَيْهِ أَهْلُ صَنْعَاءَ لَقَتَلْتُهُمْ جَمِيعًا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] bahwa [Umar bin Khattab] membunuh lima atau tujuh orang, sebab mereka telah membunuh seorang laki-laki dengan tipu muslihat. Umar berkata; \"Seandainya (seluruh) penduduk Shan'a berkomplot melakukannya, niscaya aku akan membunuh mereka semuanya.\""
            },
            {
                "number": 1362,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ أَنَّهُ بَلَغَهُ أَنَّ حَفْصَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَتَلَتْ جَارِيَةً لَهَا سَحَرَتْهَا وَقَدْ كَانَتْ دَبَّرَتْهَا فَأَمَرَتْ بِهَا فَقُتِلَتْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Muhammad bin Abdurrahman bin Sa'ad bin Zararah] telah sampai kepadanya, bahwa [Hafsah], isteri Nabi shallallahu 'alaihi wasallam membunuh seorang budak wanitanya yang telah menyihirnya, padahal sebelum itu ia pernah menjanjikannya untuk merdeka jika ia (Hafshah) telah meninggal. Namun Hafshah tetap memerintahkannya hingga budak itu pun dibunuh.\""
            },
            {
                "number": 1363,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عُمَرَ بْنِ حُسَيْنٍ مَوْلَى عَائِشَةَ بِنْتِ قُدَامَةَ أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَأَقَادَ وَلِيَّ رَجُلٍ مِنْ رَجُلٍ قَتَلَهُ بِعَصًا فَقَتَلَهُ وَلِيُّهُ بِعَصًا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari ['Umar bin Husain] mantan budak Aisyah binti Qudamah, bahwa [Abdul Malik bin Marwan] memberi (wewenang) wali korban pembunuhan yang dilakukan dengan tongkat, untuk membunuhnya (si pelaku) dengan tongkat sebagai balasan.\""
            },
            {
                "number": 1364,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍأَنَّ سَائِبَةً أَعْتَقَهُ بَعْضُ الْحُجَّاجِ فَقَتَلَ ابْنَ رَجُلٍ مِنْ بَنِي عَائِذٍ فَجَاءَ الْعَائِذِيُّ أَبُو الْمَقْتُولِ إِلَى عُمَرَ بْنِ الْخَطَّابِ يَطْلُبُ دِيَةَ ابْنِهِ فَقَالَ عُمَرُ لَا دِيَةَ لَهُ فَقَالَ الْعَائِذِيُّ أَرَأَيْتَ لَوْ قَتَلَهُ ابْنِي فَقَالَ عُمَرُ إِذًا تُخْرِجُونَ دِيَتَهُ فَقَالَ هُوَ إِذًا كَالْأَرْقَمِ إِنْ يُتْرَكْ يَلْقَمْ وَإِنْ يُقْتَلْ يَنْقَمْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Sulaiman bin Yasar] bahwa seorang budak telah dibebaskan oleh beberapa orang yang berhaji. Lalu dia membunuh seorang anak dari Bani 'A`idz. Kemudian bapak laki-laki korban pembunuhan itu menemui Umar bin Khattab meminta diyat anaknya. [Umar] berkata; \"Tidak ada diyat untuknya.\" Orang tua korban itu berkata, \"Bagaimana pendapatmu jika anakku yang membunuhnya?\" Umar berkata; \"Kalau begitu, kalianlah yang harus mengeluarkan diyatnya.\" 'Umar bin Khattab berkata; \"Kalau begitu, ini seperti ular berbisa, jika dibiarkan akan menelan, jika dibunuh akan membalas.\""
            },
            {
                "number": 1365,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ أَنَّهُ أَخْبَرَهُ رِجَالٌ مِنْ كُبَرَاءِ قَوْمِهِأَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرِ بِئْرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ فَقَالُوا وَاللَّهِ مَا قَتَلْنَاهُ فَأَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ ذَلِكَ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ كَبِّرْ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذِنُوا بِحَرْبٍ فَكَتَبَ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ فَقَالُوا لَا قَالَ أَفَتَحْلِفُ لَكُمْ يَهُودُ قَالُوا لَيْسُوا بِمُسْلِمِينَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمْ الدَّارَ قَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُقَالَ مَالِك الْفَقِيرُ هُوَ الْبِئْرُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Laila bin Abdullah bin Abdurrahman bin Sahl] dari [Sahl bin Abu Hatsmah] bahwa ada beberapa orang petinggi kaumnya mengabarkan kepadanya, bahwa Abdullah bin Sahl dan Muhayyishah berangkat ke Khaibar karena sebab kesengsaraan yang menimpa mereka. Lalu seseorang menemui Muhayyishah dan mengabarkan bahwa Abdullah bin Sahl telah dibunuh dan dibuang di samping sumur atau mata air. Muhayyishah kemudian menemui orang-orang Yahudi dan berkata; \"Demi Allah, kalianlah yang telah membunuhnya! \" Mereka menjawab; \"Demi Allah, kami tidak membunuhnya.\" Muhayyishah kemudian pergi mendatangi kaumnya, lantas dia mengabarkan perihal pembunuhan itu kepada mereka. Kemudian ia pergi bersama saudaranya, Huwaishah yang lebih besar darinya, dan Abdurrahman. Muhaiyishah lalu pergi untuk membicarakan hal itu, karena dialah yang di Khaibar. Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Yang besar, yang besar! \" -maksudnya orang yang umurnya lebih tua-. Akhirnya Huwaishah berbicara dan dibantu oleh Muhaiyishah. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mereka membayar diat untuk saudara kalian, atau mereka mengumumkan perang.\" Rasulullah shallallahu 'alaihi wasallam kemudian menulis surat kepada mereka tentang persoalan tersebut. Lalu orang-orang Yahudi membalas surat tersebut, \"Demi Allah, kami tidak membunuhnya.\" Rasulullah shallallahu 'alaihi wasallam bertanya kepada Huwaishah, Muhaiyishah dan Abdurrahman: \"Apakah kalian mau bersumpah sehingga kalian berhak atas darah teman kalian, \" Mereka menjawab; \"Tidak.\" Beliau bertanya: \"Apakah orang-orang Yahudi itu saja yang bersumpah untuk kalian?\" Mereka menjawab; \"Mereka itu bukan orang Islam.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam membayar diyat dari harta beliau, dan beliau mengirimkan kepada mereka seratus unta sehingga mereka memasukkan ke rumah mereka. Sahl berkata; \"Sampai ada seekor unta merah yang menendangku.\" Malik berkata; \"Al Faqir adalah sumur.\""
            },
            {
                "number": 1366,
                "arab": "قَالَ يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ أَنَّهُ أَخْبَرَهُأَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الْأَنْصَارِيَّ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَقَدِمَ مُحَيِّصَةُ فَأَتَى هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ لِمَكَانِهِ مِنْ أَخِيهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ كَبِّرْ فَتَكَلَّمَ حُوَيِّصَةُ وَمُحَيِّصَةُ فَذَكَرَا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ قَالُوا يَا رَسُولَ اللَّهِ لَمْ نَشْهَدْ وَلَمْ نَحْضُرْ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتُبْرِئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ قَالَ يَحْيَى بْنُ سَعِيدٍ فَزَعَمَ بُشَيْرُ بْنُ يَسَارٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَاهُ مِنْ عِنْدِهِ",
                "id": "Yahya berkata; dari Malik dari [Yahya bin Sa'id] dari [Busyair bin Yasar] bahwa ia mengabarkan kepadanya, bahwa Abdullah bin Sahl Al Anshari dan Muhaiyishah bin Mas'ud berangkat ke khaibar, mereka berpisah untuk memenuhi kebutuhan masing-masing. Hingga akhirnya Abdullah bin Sahl dibunuh oleh seseorang. Maka datanglah Muhayyishah (ke Madinah), lalu ia bersama saudaranya Huwayyishah dan 'Abdurrahman bin Sahl menghadap Nabi shallallahu 'alaihi wasallam. Abdurrahman karena merasa sebagai saudara korban, ia pun memulai pembicaraan. Tetapi Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Yang besar, yang besar.\" Lalu Huwaishah dan Muhaiyishah menceritakan kejadian yang menimpa Abdullah bin Sahl. Rasulullah shallallahu 'alaihi wasallam bertanya kepada mereka: \"Maukah kalian bersumpah lima puluh kali dan kalian berhak atas darah teman kalian?\" Mereka menjawab; \"Wahai Rasulullah, kami tidak menyaksikannya dan juga tidak hadir ketika itu.\" Rasulullah shallallahu 'alaihi wasallam bertanya lagi: \"Apakah orang-orang Yahudi akan berlepas diri dari kalian dengan bersumpah lima puluh kali! \" Mereka menjawab; \"Wahai Rasulullah, bagaimana kami menerima sumpah kaum kafir?\" Yahya bin Said berkata; \"Lalu lalu Busyair bin Yasar mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam membayarkan diyat dari harta beliau.\""
            },
            {
                "number": 1367,
                "arab": "و حَدَّثَنِي يَحْيَى بْن يَحْيَى قَالَ حَدَّثَنِي مَالِك عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ الْأَنْصَارِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ بَارِكْ لَهُمْ فِي مِكْيَالِهِمْ وَبَارِكْ لَهُمْ فِي صَاعِهِمْ وَمُدِّهِمْيَعْنِي أَهْلَ الْمَدِينَةِ",
                "id": "Telah menceritakan kepadaku Yahya bin Yahya berkata; telah menceritakan kepadaku dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah Al Anshari] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam berdo'a: \"Ya Allah, berkahilah mereka dalam timbangan-timbangan mereka, berkahilah sha' dan mud mereka.\" yaitu penduduk Madinah."
            },
            {
                "number": 1368,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَكَانَ النَّاسُ إِذَا رَأَوْا أَوَّلَ الثَّمَرِ جَاءُوا بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا أَخَذَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا وَبَارِكْ لَنَا فِي مَدِينَتِنَا وَبَارِكْ لَنَا فِي صَاعِنَا وَبَارِكْ لَنَا فِي مُدِّنَا اللَّهُمَّ إِنَّ إِبْرَاهِيمَ عَبْدُكَ وَخَلِيلُكَ وَنَبِيُّكَ وَإِنِّي عَبْدُكَ وَنَبِيُّكَ وَإِنَّهُ دَعَاكَ لِمَكَّةَ وَإِنِّي أَدْعُوكَ لِلْمَدِينَةِ بِمِثْلِ مَا دَعَاكَ بِهِ لِمَكَّةَ وَمِثْلَهُ مَعَهُ ثُمَّ يَدْعُو أَصْغَرَ وَلِيدٍ يَرَاهُ فَيُعْطِيهِ ذَلِكَ الثَّمَرَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] berkata; \"Dahulu jika orang-orang melihat awal musim buah, mereka membawanya kepada Rasulullah shallallahu 'alaihi wasallam. Ketika Rasulullah shallallahu 'alaihi wasallam mengambilnya, beliau berdo'a: \"Ya Allah, berkahilah buah-buah kami, berkahilah Madinah kami, berkahilah kami dalam takaran kami dan berkahilah kami dalam mud kami. Ya Allah, sesungguhnya Ibrahim adalah hamba-Mu, kekasih-Mu dan Nabi-Mu. Sesungguhnya aku adalah hamba-Mu dan Nabi-mu. Ibrahim berdo'a kepada-Mu untuk Makkah dan aku berdo'a kepada-Mu untuk Madinah seperti apa yang dia do'akan untuk Makkah.\" Kemudian beliau mendo'akan seorang anak yang paling kecil yang beliau lihat, lalu beliau memberi anak itu dari buah tersebut."
            },
            {
                "number": 1369,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ قَطَنِ بْنِ وَهْبِ بْنِ عُمَيْرِ بْنِ الْأَجْدَعِ أَنَّ يُحَنَّسَ مَوْلَى الزُّبَيْرِ بْنِ الْعَوَّامِ أَخْبَرَهُأَنَّهُ كَانَ جَالِسًا عِنْدَ عَبْدِ اللَّهِ بْنِ عُمَرَ فِي الْفِتْنَةِ فَأَتَتْهُ مَوْلَاةٌ لَهُ تُسَلِّمُ عَلَيْهِ فَقَالَتْ إِنِّي أَرَدْتُ الْخُرُوجَ يَا أَبَا عَبْدِ الرَّحْمَنِ اشْتَدَّ عَلَيْنَا الزَّمَانُ فَقَالَ لَهَا عَبْدُ اللَّهِ بْنُ عُمَرَ اقْعُدِي لُكَعُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَصْبِرُ عَلَى لَأْوَائِهَا وَشِدَّتِهَا أَحَدٌ إِلَّا كُنْتُ لَهُ شَفِيعًا أَوْ شَهِيدًا يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Qathan bin Wahb bin 'Umair bin Al Ajda'] bahwa [Yuhannas] mantan budak Zubair bin Awwam mengabarkan kepadanya, bahwa dia pernah duduk di samping Abdullah bin Umar ketika terjadi fitnah, kemudian budak wanitanya datang dan mengucapkan salam kepadanya. Setelah itu budak tersebut berkata, \"Aku ingin keluar wahai Abu Abdurrahman, waktu kini sudah semakin berat dan sulit bagi kami.\" [Abdullah bin Umar] berkata kepadanya; \"Duduklah bodoh, aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidaklah seseorang bersabar atas besar dan kerasnya (kehidupan di Madinah), kecuali saya akan memberinya syafa'at atau saksi pada Hari Kiamat'.\""
            },
            {
                "number": 1370,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ أَعْرَابِيًّا بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْإِسْلَامِ فَأَصَابَ الْأَعْرَابِيَّ وَعْكٌ بِالْمَدِينَةِ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَقِلْنِي بَيْعَتِي فَأَبَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي فَأَبَى ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي فَأَبَى فَخَرَجَ الْأَعْرَابِيُّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْمَدِينَةُ كَالْكِيرِ تَنْفِي خَبَثَهَا وَيَنْصَعُ طِيبُهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] berkata; seorang badui membaiat Rasulullah shallallahu 'alaihi wasallam atas Islam, lalu orang badui itu terkena demam di Madinah. Badui itu kemudian menemui Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Ya Rasulullah, batalkanlah baiatku.\" Namun Rasulullah shallallahu 'alaihi wasallam menolaknya. Badui itu mendatangi beliau lagi dan berkata; \"Batalkanlah baiatku.\" Beliau tetap menolaknya. Maka pergilah orang badui itu, Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sesungguhnya Madinah ini seperti al kir; menghilangkan kotorannya dan meninggalkan aroma semerbaknya.\" "
            },
            {
                "number": 1371,
                "arab": "و حَدَّثَنِي مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَ سَمِعْتُ أَبَا الْحُبَابِ سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أُمِرْتُ بِقَرْيَةٍ تَأْكُلُ الْقُرَى يَقُولُونَ يَثْرِبُ وَهِيَ الْمَدِينَةُ تَنْفِي النَّاسَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ",
                "id": "Telah menceritakan kepadaku Malik dari [Yahya bin Sa'id] ia berkata; Aku mendengar [Abu Al Hubab Sa'id bin Yasar] berkata; Aku mendengar [Abu Hurairah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku diperintahkan (untuk mendiami) sebuah kampung yang mencakup desa-desa lain, mereka menyebutnya Yatsrib, ia adalah kota yang akan menyingkirkan orang-orang sebagaimana al kir menghilangkan kotoran besi.\" "
            },
            {
                "number": 1372,
                "arab": "و حَدَّثَنِي مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَخْرُجُ أَحَدٌ مِنْ الْمَدِينَةِ رَغْبَةً عَنْهَا إِلَّا أَبْدَلَهَا اللَّهُ خَيْرًا مِنْهُ",
                "id": "Telah menceritakan kepadaku Malik dari [Hisyam bin 'Urwah] dari [Ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang keluar dari Madinah karena membencinya, kecuali Allah akan menggantikan bagi (Madinah) yang lebih baik dari orang tersebut.\""
            },
            {
                "number": 1373,
                "arab": "و حَدَّثَنِي مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ أَنَّهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تُفْتَحُ الْيَمَنُ فَيَأْتِي قَوْمٌ يَبُسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَتُفْتَحُ الشَّامُ فَيَأْتِي قَوْمٌ يُبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَتُفْتَحُ الْعِرَاقُ فَيَأْتِي قَوْمٌ يُبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ",
                "id": "Telah menceritakan kepadaku Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Abdullah bin Az-Zubair] dari [Sufyan bin Abu Zuhair] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Negeri Yaman akan ditaklukkan lalu datanglah suatu kaum kepada mereka, mengusir penduduknya, dan pergilah mereka dengan keluarga-keluarga mereka bersama orang-orang yang mengikutinya padahal Madinah lebih baik bagi mereka jika saja mereka tahu. Negeri Syam akan ditaklukkan lalu datanglah suatu kaum kepada mereka, mengusir penduduknya, dan pergilah mereka dengan keluarga-keluarga mereka bersama orang-orang yang mengikutinya, padahal Madinah lebih baik bagi mereka andai mereka tahu. Negeri Iraq akan ditaklukkan, lalu datanglah suatu kaum kepada mereka, mengusir penduduknya, dan pergilah mereka dengan keluarga-keluarga mereka bersama orang-orang yang mengikutinya, padahal Madinah lebih baik bagi mereka andai mereka tahu.\""
            },
            {
                "number": 1374,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ حِمَاسٍ عَنْ عَمِّهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَتُتْرَكَنَّ الْمَدِينَةُ عَلَى أَحْسَنِ مَا كَانَتْ حَتَّى يَدْخُلَ الْكَلْبُ أَوْ الذِّئْبُ فَيُغَذِّي عَلَى بَعْضِ سَوَارِي الْمَسْجِدِ أَوْ عَلَى الْمِنْبَرِ فَقَالُوا يَا رَسُولَ اللَّهِ فَلِمَنْ تَكُونُ الثِّمَارُ ذَلِكَ الزَّمَانَ قَالَ لِلْعَوَافِي الطَّيْرِ وَالسِّبَاعِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Himas] dari [Pamannya] dari [Abu Hurairah] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Sungguh Madinah akan di tinggalkan dengan segala apa yang terbaik di dalamnya hingga masuklah seekor anjing atau serigala. lalu hewan itu mengencingi pada sebagian tiang-tiang masjid atau mimbarnya.\" Para sahabat bertanya; \"Wahai Rasulullah, untuk siapakah buah-buahan pada masa itu?\" Beliau bersabda: \"Untuk burung-burung dan hewan buas.\""
            },
            {
                "number": 1375,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَمْرٍو مَوْلَى الْمُطَّلِبِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَلَعَ لَهُ أُحُدٌ فَقَالَ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ اللَّهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَأَنَا أُحَرِّمُ مَا بَيْنَ لَابَتَيْهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari ['Amru] mantan budak Al Muthallib, dari [Anas bin Malik] berkata, \"Saat gunung uhud terlihat oleh Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Ini adalah gunung, yang dia mencintai kami dan kamipun mencintainya. Ya Allah, sesungguhnya Ibrahim telah mengharamkan Makkah, maka aku mengharamkan apa yang ada di antara dua gunungnya (Madinah) .\""
            },
            {
                "number": 1376,
                "arab": "و حَدَّثَنِي مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ كَانَ يَقُولُ لَوْ رَأَيْتُ الظِّبَاءَ بِالْمَدِينَةِ تَرْتَعُ مَا ذَعَرْتُهَاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ لَابَتَيْهَا حَرَامٌ",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dari [Abu Hurairah] berkata; \"Seandainya aku melihat kijang (di padang rumput) sedang mencari makan di Madinah maka aku tidak akan membuatnya kabur, karena Rasulullah bersabda: 'Apa yang ada di antara dua gunungnya adalah Haram'.\""
            },
            {
                "number": 1377,
                "arab": "و حَدَّثَنِي مَالِك عَنْ يُونُسَ بْنِ يُوسُفَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّأَنَّهُ وَجَدَ غِلْمَانًا قَدْ أَلْجَئُوا ثَعْلَبًا إِلَى زَاوِيَةٍ فَطَرَدَهُمْ عَنْهُقَالَ مَالِك لَا أَعْلَمُ إِلَّا أَنَّهُ قَالَ أَفِي حَرَمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصْنَعُ هَذَا",
                "id": "Telah menceritakan kepadaku Malik dari [Yunus bin Yusuf] dari ['Atha bin Yasar] dari [Abu Ayub Al Anshari] bahwasanya ia pernah mendapati beberapa anak yang menggiring dan mengusir seekor serigala.\" Malik berkata; \"Aku tidak mengetahui kecuali Abu Hurairah mengatakan; 'Apakah ini dilakukan di wilayah haramnya (Madinah) Rasulullah shallallahu 'alaihi wasallam? '"
            },
            {
                "number": 1378,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا قَالَتْلَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلَالٌ قَالَتْ فَدَخَلْتُ عَلَيْهِمَا فَقُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلَالُ كَيْفَ تَجِدُكَ قَالَتْ فَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِوَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِوَكَانَ بِلَالٌ إِذَا أُقْلِعَ عَنْهُ يَرْفَعُ عَقِيرَتَهُ فَيَقُولُ أَلَا لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةًبِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُوَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مَجِنَّةٍوَهَلْ يَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُقَالَتْ عَائِشَةُ فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِقَالَ مَالِك و حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ وَكَانَ عَامِرُ بْنُ فُهَيْرَةَ يَقُولُ قَدْ رَأَيْتُ الْمَوْتَ قَبْلَ ذَوْقِهِإِنَّ الْجَبَانَ حَتْفُهُ مِنْ فَوْقِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Aisyah] Ummul Mukminin, ia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam tiba di Madinah, Abu Bakar dan Bilal diserang panas.\" Aisyah berkata; \"Lalu aku menemui keduanya. Aku berkata; 'Wahai ayahku, bagaimana kabarmu? Wahai Bilal bagaimana kabarmu? '\" dia menambahkan; \"Jika Abu Bakar diserang demam, dia selalu berkata; 'Setiap jiwa bangun di pagi hari pada keluarganya, padahal kematian lebih dekat dari tali sandalnya.' Adapun Bilal jika sembuh dari demamnya, dia mengangkat suaranya dan berkata; 'Duhai, seandainya ada yang mendengarkan syairku, akankah aku tinggal malam ini di suatu lembah dan di sekelilingku pohon idkhir dan pohon jalil. Dan akankah aku mendatangi suatu hari, air Majinnah ataukah nampak bagiku Syamah dan Thafil.\" Aisyah berkata; \"Aku menemui Rasulullah shallallahu 'alaihi wasallam dan mengabarkan kepada beliau. Beliau lalu berdo'a: \"Ya Allah, jadikanlah kami cinta kepada Madinah sebagaimana kecintaan kami kepada Makkah, atau lebihkan cinta kami padanya. Berkahilah kami dalam Sha' kami dan mud kami, dan pindahkanlah demamnya menuju Juhfah, \" Malik berkata; telah menceritakan kepadaku Yahya bin Sa'id bahwa Aisyah isteri Nabi shallallahu 'alaihi wasallam berkata; Amir bin Fuhairah berkata; \"Saya telah melihat kematian sebelum merasakannya, sesungguhnya kematian seorang pengecut adalah dari atasnya.\""
            },
            {
                "number": 1379,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَنْقَابِ الْمَدِينَةِ مَلَائِكَةٌ لَا يَدْخُلُهَا الطَّاعُونُ وَلَا الدَّجَّالُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nu'aim bin Abdullah Al Mujmir] dari [Abu Hurairah] berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Di setiap lorong-lorong Madinah ada malaikat sehingga penyakit Tha'un tidak bisa masuk, begitu juga Dajjal.\""
            },
            {
                "number": 1380,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِسْمَعِيلَ بْنِ أَبِي حَكِيمٍ أَنَّهُ سَمِعَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ يَقُولُكَانَ مِنْ آخِرِ مَا تَكَلَّمَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ قَالَ قَاتَلَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ لَا يَبْقَيَنَّ دِينَانِ بِأَرْضِ الْعَرَبِ",
                "id": "Telah menceritakan kepadaku Malik dari [Isma'il bin Abu Hakim] bahwa ia pernah mendengar [Umar bin Abdul Aziz] berkata, \"Salah satu sabda Rasulullah shallallahu 'alaihi wasallam yang terakhir adalah: \"Semoga Allah membinasakan orang Yahudi dan Nasrani. Mereka menjadikan kuburan para Nabi mereka sebagai masjid. Tidak akan ada dua agama di Tanah Arab.\""
            },
            {
                "number": 1381,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجْتَمِعُ دِينَانِ فِي جَزِيرَةِ الْعَرَبِقَالَ مَالِك قَالَ ابْنُ شِهَابٍ فَفَحَصَ عَنْ ذَلِكَ عُمَرُ بْنُ الْخَطَّابِ حَتَّى أَتَاهُ الثَّلْجُ وَالْيَقِينُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجْتَمِعُ دِينَانِ فِي جَزِيرَةِ الْعَرَبِ فَأَجْلَى يَهُودَ خَيْبَرَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan berkumpul dua ajaran di jazirah Arab.\" Malik berkata; [Ibnu Syihab] berkata; \" [Umar bin Khattab] menyelidiki tentang itu hingga dia yakin bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak akan berkumpul dua ajaran di jazirah Arab'.\" lalu dia mengusir Yahudi Khaibar."
            },
            {
                "number": 1382,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَلَعَ لَهُ أُحُدٌ فَقَالَ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin 'Urwah] dari [Bapaknya] berkata, \"Saat gunung uhud terlihat oleh Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Ini adalah gunung yang mencintai kami dan kamipun mencintainya.\""
            },
            {
                "number": 1383,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ أَنَّ أَسْلَمَ مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَخْبَرَهُأَنَّهُ زَارَ عَبْدَ اللَّهِ بْنَ عَيَّاشٍ الْمَخْزُومِيَّ فَرَأَى عِنْدَهُ نَبِيذًا وَهُوَ بِطَرِيقِ مَكَّةَ فَقَالَ لَهُ أَسْلَمُ إِنَّ هَذَا الشَّرَابَ يُحِبُّهُ عُمَرُ بْنُ الْخَطَّابِ فَحَمَلَ عَبْدُ اللَّهِ بْنُ عَيَّاشٍ قَدَحًا عَظِيمًا فَجَاءَ بِهِ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَوَضَعَهُ فِي يَدَيْهِ فَقَرَّبَهُ عُمَرُ إِلَى فِيهِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ عُمَرُ إِنَّ هَذَا لَشَرَابٌ طَيِّبٌ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ رَجُلًا عَنْ يَمِينِهِ فَلَمَّا أَدْبَرَ عَبْدُ اللَّهِ نَادَاهُ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ أَأَنْتَ الْقَائِلُ لَمَكَّةُ خَيْرٌ مِنْ الْمَدِينَةِ فَقَالَ عَبْدُ اللَّهِ فَقُلْتُ هِيَ حَرَمُ اللَّهِ وَأَمْنُهُ وَفِيهَا بَيْتُهُ فَقَالَ عُمَرُ لَا أَقُولُ فِي بَيْتِ اللَّهِ وَلَا فِي حَرَمِهِ شَيْئًا ثُمَّ قَالَ عُمَرُ أَأَنْتَ الْقَائِلُ لَمَكَّةُ خَيْرٌ مِنْ الْمَدِينَةِ قَالَ فَقُلْتُ هِيَ حَرَمُ اللَّهِ وَأَمْنُهُ وَفِيهَا بَيْتُهُ فَقَالَ عُمَرُ لَا أَقُولُ فِي حَرَمِ اللَّهِ وَلَا فِي بَيْتِهِ شَيْئًا ثُمَّ انْصَرَفَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abdurrahman bin Al Qasim] bahwa [Aslam] bekas budak Umar bin Khattab, mengabarkan kepadanya, bahwa ia pernah mengunjungi Abdullah bin 'Ayasy Al Makhzumy. Ketika sedang di jalanan Makkah ia melihatnya membawa perasan nabids. Aslam lalu berkata kepadanya; \"Ini adalah minuman yang disukai Umar bin Khattab.\" Maka Abdullah bin 'Ayasy mengambil segelas besar dan membawanya kepada Umar bin Khattab. Umar kemudian meletakkannya pada tangan dan mendekatkannya ke mulut, lalu mengangkat kepalanya seraya berkata, \"Sungguh ini adalah minuman yang enak.\" Umar kemudian minum dan memberikannya kepada seorang laki-laki yang ada di sisi kanannya. Ketika Abdullah beranjak pergi, [Umar bin Khattab] memanggilnya dan bertanya; \"Apakah engkau yang mengatakan bahwa Makkah lebih baik daripada Madinah.\" [Abdullah] berkata; \"Maka aku menjawab; 'Itu adalah tanah haram Allah, Dia yang menjamin keamanannya, dan di dalamnya juga ada rumah-Nya'. Umar berkata; \"Aku tidak mengatakan bahwa dalam rumah Allah dan tanah haram-Nya ada suatu (kemuliaan) .\" kemudian Umar bertanya; 'Apakah engkau yang mengatakan bahwa Makkah lebih baik daripada Madinah? ' maka aku menjawab; 'Itu adalah tanah haram Allah, Dia yang menjamin keamanannya, dan di dalamnya ada rumah-Nya.\" Umar lalu berkata lagi; 'Aku tidak mengatakan bahwa dalam rumah Allah dan tanah Haram-Nya ada suatu (kemuliaan) .\" Setelah itu ia pun pergi.\""
            },
            {
                "number": 1384,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِ خَرَجَ إِلَى الشَّامِ حَتَّى إِذَا كَانَ بِسَرْغَ لَقِيَهُ أُمَرَاءُ الْأَجْنَادِ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ وَأَصْحَابُهُ فَأَخْبَرُوهُ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِأَرْضِ الشَّامِ قَالَ ابْنُ عَبَّاسٍ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ادْعُ لِي الْمُهَاجِرِينَ الْأَوَّلِينَ فَدَعَاهُمْ فَاسْتَشَارَهُمْ وَأَخْبَرَهُمْ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِالشَّامِ فَاخْتَلَفُوا فَقَالَ بَعْضُهُمْ قَدْ خَرَجْتَ لِأَمْرٍ وَلَا نَرَى أَنْ تَرْجِعَ عَنْهُ وَقَالَ بَعْضُهُمْ مَعَكَ بَقِيَّةُ النَّاسِ وَأَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَرَى أَنْ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَإِ فَقَالَ عُمَرُ ارْتَفِعُوا عَنِّي ثُمَّ قَالَ ادْعُ لِي الْأَنْصَارَ فَدَعَوْتُهُمْ فَاسْتَشَارَهُمْ فَسَلَكُوا سَبِيلَ الْمُهَاجِرِينَ وَاخْتَلَفُوا كَاخْتِلَافِهِمْ فَقَالَ ارْتَفِعُوا عَنِّي ثُمَّ قَالَ ادْعُ لِي مَنْ كَانَ هَاهُنَا مِنْ مَشْيَخَةِ قُرَيْشٍ مِنْ مُهَاجِرَةِ الْفَتْحِ فَدَعَوْتُهُمْ فَلَمْ يَخْتَلِفْ عَلَيْهِ مِنْهُمُ رَجُلَانِ فَقَالُوا نَرَى أَنْ تَرْجِعَ بِالنَّاسِ وَلَا تُقْدِمَهُمْ عَلَى هَذَا الْوَبَإِ فَنَادَى عُمَرُ فِي النَّاسِ إِنِّي مُصْبِحٌ عَلَى ظَهْرٍ فَأَصْبِحُوا عَلَيْهِ فَقَالَ أَبُو عُبَيْدَةَ أَفِرَارًا مِنْ قَدَرِ اللَّهِ فَقَالَ عُمَرُ لَوْ غَيْرُكَ قَالَهَا يَا أَبَا عُبَيْدَةَ نَعَمْ نَفِرُّ مِنْ قَدَرِ اللَّهِ إِلَى قَدَرِ اللَّهِ أَرَأَيْتَ لَوْ كَانَ لَكَ إِبِلٌ فَهَبَطَتْ وَادِيًا لَهُ عُدْوَتَانِ إِحْدَاهُمَا خَصِبَةٌ وَالْأُخْرَى جَدْبَةٌ أَلَيْسَ إِنْ رَعَيْتَ الْخَصِبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ وَإِنْ رَعَيْتَ الْجَدْبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِفَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ وَكَانَ غَائِبًا فِي بَعْضِ حَاجَتِهِ فَقَالَ إِنَّ عِنْدِي مِنْ هَذَا عِلْمًا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا فِرَارًا مِنْهُ قَالَ فَحَمِدَ اللَّهَ عُمَرُ ثُمَّ انْصَرَفَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abdul Hamid bin Abdurrahman bin Zaid bin Al khattab] dari [Abdullah bin Abdullah bin Al Harits bin Naufal] dari [Abdullah bin 'Abbas] berkata, \"Umar bin Khattab berangkat ke Syam, maka ketika sampai suatu daerah yang bernama Sargha, para komandan pasukan; Abu Ubaidah bin Jarrah dan para sahabat, menemuinya dan mengabarkan bahwa wilayah Syam telah terjangkit wahab penyakit. Ibnu Abbas berkata; \"Lalu [Umar bin Khattab] berkata; 'Panggilkan untukku orang-orang muhajirin yang pertama-tama.\" Lalu dipanggillah para sahabat tersebut, kemudian Umar bermusyawarah dan mengabrkan kepada mereka bahwa wilayah Syam telah terjangkit wabah penyakit. Merekapun berselisih pendapat, sebagian dari mereka berkata; 'Engkau telah keluar untuk suatu keperluan, kami berpendapat bahwa engkau tidak perlu menarik diri.\" Dan sebagian lain berkata; 'Engkau bersama sebagian manusia dan beberapa sahabat Rasulullah shallallahu 'alaihi wasallam! Kami berpendapat agar engkau tidak menghadapkan mereka dengan wabah ini.\" Umar berkata; 'Keluarlah kalian, ' dia berkata; 'Panggilkan untukku orang-orang Anshar'. Aku memanggil mereka, dan diapun bermusyawarah dengan mereka, sedangkan mereka berpendapat seperti halnya orang-orang Muhajirin dan berbeda pendapat seperti halnya mereka. Umar berkata; 'keluarlah kalian, ' dia berkata; 'Panggilkan untukku siapa saja di sini yang dulu sesepuh-sesepuh Quraisy dan telah berhijrah ketika Fathul Makkah.' Aku memanggilnya dan tidak ada yang berselisih dari mereka kecuali dua orang. Mereka berkata; 'Kami berpendapat agar engkau kembali membawa orang-orang dan tidak menghadapkan mereka kepada wabah ini.' Umar menyeru kepada manusia; 'Sesungguhnya aku akan bangun pagi di atas pelana, bagunlah kalian pagi hari di atasnya, ' Abu Ubaidah bertanya; 'Apakah engkau akan lari dari takdir Allah? ' maka Umar menjawab; 'Kalau saja yang berkata bukan kamu, Wahai Abu 'Ubaidah! Ya, kami lari dari takdir Allah menuju takdir Allah yang lain. Bagaimana pendapatmu, jika kamu memiliki unta kemudian tiba di sebuah lembah yang mempunyai dua daerah, yang satu subur dan yang lainnya kering, tahukah kamu jika kamu membawanya ke tempat yang subur, niscaya kamu telah membawanya dengan takdir Allah. Apabila kamu membawanya ke tempat yang kering, maka kamu membawanya dengan takdir Allah juga.' Kemudian datanglah [Abdurrahman bin Auf], dia tidak hadir karena ada keperluan. Dia berkata; \"Saya memiliki kabar tentang ini dari Rasulullah Shalla Allahu 'alaihi wa sallam beliau bersabda: \"Jika kalian mendengar suatu negeri terjangkit wabah, maka janganlah kalian menuju ke sana, namun jika dia menjangkiti suatu negeri dan kalian berada di dalamnya, maka janganlah kalian keluar dan lari darinya.\" (Ibnu 'Abbas RA) berkata; \"Lalu Umar memuji Allah kemudian pergi.\""
            },
            {
                "number": 1385,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَعَنْ سَالِمٍ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَهُ يَسْأَلُ أُسَامَةَ بْنَ زَيْدٍمَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الطَّاعُونِ فَقَالَ أُسَامَةُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الطَّاعُونُ رِجْزٌ أُرْسِلَ عَلَى طَائِفَةٍ مِنْ بَنِي إِسْرَائِيلَ أَوْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَإِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَدْخُلُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا فِرَارًا مِنْهُقَالَ مَالِك قَالَ أَبُو النَّضْرِ لَا يُخْرِجُكُمْ إِلَّا فِرَارٌ مِنْهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Muhammad bin Al Munkadir] dan dari [Salim Abu Nadlr] mantan budak 'Umar bin 'ubaidhullah dari ['Amir bin Abu Waqqas] dari bapaknya, bahwasanya ia mendengar bapaknya bertanya kepada Usamah bin Zaid, \"Apa yang kamu dengar dari Rasulullah shallallahu 'alaihi wasallam tentang penyakit tha'un?\" [Usamah] menjawab, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tha'un adalah siksaan yang dikirim Allah kepada sekelompok orang dari Bani Isra`il, atau kepada orang-orang sebelum kalian. Jika kalian mendengarnya berada di suatu negeri maka janganlah kalian memasukinya. Dan jika penyakit itu berada di negeri yang kalian tinggali, maka janganlah kalian keluar melarikan diri darinya.\" Malik berkata; Abu Nadlr berkata; \"Tidak ada yang mengeluarkan kalian kecuali (karena ingin) kabur darinya.\""
            },
            {
                "number": 1386,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَأَنَّ عُمَرَ بْنَ الْخَطَّابِ خَرَجَ إِلَى الشَّامِ فَلَمَّا جَاءَ سَرْغَ بَلَغَهُ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِالشَّامِ فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا فِرَارًا مِنْهُ فَرَجَعَ عُمَرُ بْنُ الْخَطَّابِ مِنْ سَرْغَو حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ إِنَّمَا رَجَعَ بِالنَّاسِ مِنْ سَرْغَ عَنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abdullah bin 'Amir bin Rabi'ah] bahwa Umar bin Khattab keluar menuju Syam, ketika dia sampai di Sargha, terdengar kabar bahwa wabah penyakit menyebar di Syam. Lalu [Abdurrahman bin Auf] mengabarinya bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Jika kalian mendengar (wabah) di suatu daerah maka janganlah kalian memasukinya. Jika (wabah itu) berada di suatu negeri, dan kalian berada di dalamnya maka janganlah kalian keluar melarikan diri darinya.\" Lalu Umar bin Khattab meninggalkan Sargha. Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Salim bin Abdullah] bahwa Umar bin Khattab kembali bersama orang-orang meninggalkan Sargha karena perkataan Abdurrahman bin Auf."
            },
            {
                "number": 1387,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَحَاجَّ آدَمُ وَمُوسَى فَحَجَّ آدَمُ مُوسَى قَالَ لَهُ مُوسَى أَنْتَ آدَمُ الَّذِي أَغْوَيْتَ النَّاسَ وَأَخْرَجْتَهُمْ مِنْ الْجَنَّةِ فَقَالَ لَهُ آدَمُ أَنْتَ مُوسَى الَّذِي أَعْطَاهُ اللَّهُ عِلْمَ كُلِّ شَيْءٍ وَاصْطَفَاهُ عَلَى النَّاسِ بِرِسَالَتِهِ قَالَ نَعَمْ قَالَ أَفَتَلُومُنِي عَلَى أَمْرٍ قَدْ قُدِّرَ عَلَيَّ قَبْلَ أَنْ أُخْلَقَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adam dan Musa saling beradu argumen, lalu Adam mengalahkan Musa. Musa berkata kepadanya; \"Engkau adalah Adam, orang yang telah menyesatkan manusia dan mengeluarkan mereka dari surga! ' Lalu Adam bertanya kepada Musa; 'Engkau adalah Musa, orang yang Allah telah memberinya ilmu tentang segala sesuatu, dan seorang manusia yang dipilih atas manusia dengan risalah-Nya? ' Musa menjawab; \"Benar.\" Adam lalu berkata; 'Apakah engkau akan mencelaku atas perkara yang telah ditakdirkan kepadaku, sebelum aku diciptakan'.\""
            },
            {
                "number": 1388,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ أَنَّهُ أَخْبَرَهُ عَنْ مُسْلِمِ بْنِ يَسَارٍ الْجُهَنِيِّ أَنَّ عُمَرَ بْنَ الْخَطَّابِسُئِلَ عَنْ هَذِهِ الْآيَةِ{ وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى شَهِدْنَا أَنْ تَقُولُوا يَوْمَ الْقِيَامَةِ إِنَّا كُنَّا عَنْ هَذَا غَافِلِينَ }فَقَالَ عُمَرُ بْنُ الْخَطَّابِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْأَلُ عَنْهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى خَلَقَ آدَمَ ثُمَّ مَسَحَ ظَهْرَهُ بِيَمِينِهِ فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقْتُ هَؤُلَاءِ لِلْجَنَّةِ وَبِعَمَلِ أَهْلِ الْجَنَّةِ يَعْمَلُونَ ثُمَّ مَسَحَ ظَهْرَهُ فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقْتُ هَؤُلَاءِ لِلنَّارِ وَبِعَمَلِ أَهْلِ النَّارِ يَعْمَلُونَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ فَفِيمَ الْعَمَلُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ إِذَا خَلَقَ الْعَبْدَ لِلْجَنَّةِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعْمَالِ أَهْلِ الْجَنَّةِ فَيُدْخِلُهُ رَبُّهُ الْجَنَّةَ وَإِذَا خَلَقَ الْعَبْدَ لِلنَّارِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعْمَالِ أَهْلِ النَّارِ فَيُدْخِلُهُ رَبُّهُ النَّارَو حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَرَكْتُ فِيكُمْ أَمْرَيْنِ لَنْ تَضِلُّوا مَا تَمَسَّكْتُمْ بِهِمَا كِتَابَ اللَّهِ وَسُنَّةَ نَبِيِّهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Abu Unaisah] dari [Abdul Hamid bin Abdurrahman bin Zaid bin Al Khattab] Bahwasanya ia mengabarkan kepadanya, dari [Muslim bin Yasar Al Juhani] bahwa [Umar bin Khattab] ditanya ayat ini: '(Dan (ingatlah), ketika Tuhanmu mengeluarkan keturunan anak-anak Adam dari sulbi mereka dan Allah mengambil kesaksian terhadap jiwa mereka (seraya berfirman): \"Bukankah aku ini Tuhanmu?\" mereka menjawab: \"Betul (Engkau Tuhan kami), Kami menjadi saksi\". (kami lakukan yang demikian itu) agar di hari kiamat kamu tidak mengatakan: \"Sesungguhnya Kami (Bani Adam) adalah orang-orang yang lengah terhadap ini (keesaan Tuhan) \" (Qs. Al A'raf: 172) Umar berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam ditanya tentang ayat ini, maka beliau menjawab; \"Sesungguhnya Allah Tabaraka Wa Ta'ala menciptakan Adam lalu mengusap punggungnya dengan tangan kanan-nya, Allah mengeluarkan darinya beberapa keturunan. Kemudian Dia berfirman; 'Aku ciptakan mereka untuk surga dan mereka beramal dengan amalan ahli surga.' Kemudian Allah kembali mengusap punggung Adam dan mengeluarkan darinya keturunan. Kemudian Allah berfirman; 'Aku ciptakan mereka untuk neraka, dan mereka beramal dengan amalan ahli neraka.' Seorang laki-laki lalu bertanya, \"Wahai Rasulullah, lalu untuk apa kita beramal?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Allah jika menciptakan hamba dari ahli surga, maka Dia memperkerjakannya dengan amalan ahli surga, sehingga ia mati di atas amalan ahli surga, dan kemudian Rabbnya memasukkannya ke surga. Dan jika menciptakan hamba ahli neraka, maka Dia memperkerjakannya dengan amalan ahli neraka hingga dia mati di atas amalan-amalan ahli neraka. Lalu Rabbnya memasukkannya ke neraka.\" Telah menceritakan kepadaku dari Malik telah sampai kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Telah aku tinggalkan untuk kalian, dua perkara yang kalian tidak akan sesat selama kalian berpegang teguh dengan keduanya; Kitabullah dan Sunnah Nabi-Nya.\""
            },
            {
                "number": 1389,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ عَمْرِو بْنِ مُسْلِمٍ عَنْ طَاوُسٍ الْيَمَانِيِّ أَنَّهُ قَالَ أَدْرَكْتُ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُونَ كُلُّ شَيْءٍ بِقَدَرٍ قَالَ طَاوُسٌ وَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ شَيْءٍ بِقَدَرٍ حَتَّى الْعَجْزِ وَالْكَيْسِ أَوْ الْكَيْسِ وَالْعَجْزِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ziyad bin Sa'ad] dari ['Amr bin Muslim] dari [Thawus Al Yamani] berkata; \"Aku mendapati beberapa sahabat Rasulullah shallallahu 'alaihi wasallam berkata; \"Segala sesuatu terjadi dengan takdir.\" Thawus berkata; \"Dan aku juga mendengar [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Segala sesuatu terjadi dengan takdir hingga kelemahan dan kecerdasan, atau kecerdasan dan kelemahan.\""
            },
            {
                "number": 1390,
                "arab": "و حَدَّثَنِي مَالِك عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ يَقُولُ فِي خُطْبَتِهِإِنَّ اللَّهَ هُوَ الْهَادِي وَالْفَاتِنُ",
                "id": "Telah menceritakan kepadaku Malik dari [Ziyad bin Sa'ad] dari [Amru bin Dinar] berkata; \"Aku mendengar [Abdullah bin Zubair] berkata dalam khutbahnya; \"Allah itu adalah Maha Memberi Petunjuk dan Maha Memberi Fitnah.\""
            },
            {
                "number": 1391,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ أَنَّهُ قَالَ كُنْتُ أَسِيرُ مَعَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِفَقَالَ مَا رَأْيُكَ فِي هَؤُلَاءِ الْقَدَرِيَّةِ فَقُلْتُ رَأْيِي أَنْ تَسْتَتِيبَهُمْ فَإِنْ تَابُوا وَإِلَّا عَرَضْتَهُمْ عَلَى السَّيْفِ فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ وَذَلِكَ رَأْيِيقَالَ مَالِك وَذَلِكَ رَأْيِي",
                "id": "Telah menceritakan kepadaku dari Malik dari pamannya [Abu Suhail bin Malik] berkata; \"Aku berjalan bersama Umar bin Abdul Aziz, lalu dia bertanya, \"Apa pendapatmu tentang orang-orang Qadariyah?\" Aku menjawab, \"Menurutku anda harus meminta mereka untuk bertaubat, jika tidak mau (engkau terima), namun jika tidak maka engkau hunuskan pedangmu untuk mereka.\" [Umar bin Abdul Aziz] berkata; \"Itu juga pendapatku.\" Malik berkata; \"Itu juga pendapatku.\""
            },
            {
                "number": 1392,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَسْأَلْ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَسْتَفْرِغَ صَحْفَتَهَا وَلِتَنْكِحَ فَإِنَّمَا لَهَا مَا قُدِّرَ لَهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang wanita meminta talak atas saudarinya sesama perempuan agar ia bisa 'mengosongkan piringnya' dan menikah, karena baginya apa yang telah ditakdirkan untuknya.\""
            },
            {
                "number": 1393,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَزِيدَ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ قَالَ قَالَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ وَهُوَ عَلَى الْمِنْبَرِأَيُّهَا النَّاسُ إِنَّهُ لَا مَانِعَ لِمَا أَعْطَى اللَّهُ وَلَا مُعْطِيَ لِمَا مَنَعَ اللَّهُ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْهُ الْجَدُّ مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ ثُمَّ قَالَ مُعَاوِيَةُ سَمِعْتُ هَؤُلَاءِ الْكَلِمَاتِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذِهِ الْأَعْوَادِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Ziyad] dari [Muhammad bin Ka'b Al Qurazhi] berkata, \" [Mu'awiyah bin Abu Sufyan] berkata di atas mimbar; \"Wahai manusia. Sesungguhnya tidak ada yang mampu menghalangi apa yang telah Allah berikan. Tidak ada yang dapat memberi apa yang telah Allah larang. Tidak ada gunanya kekayaan orang yang memiliki kekayaan. Barangsiapa dikehendaki Allah mendapatkan kebaikan, niscaya Allah akan memahamkannya perkara agama.\" kemudian Mu'awiyah mengatakan, \"Aku mendengar kata-kata tersebut dari Rasulullah shallallahu 'alaihi wasallam di atas tempat ini.\""
            },
            {
                "number": 1394,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْمَا خُيِّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَمْرَيْنِ قَطُّ إِلَّا أَخَذَ أَيْسَرَهُمَا مَا لَمْ يَكُنْ إِثْمًا فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ وَمَا انْتَقَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِنَفْسِهِ إِلَّا أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ فَيَنْتَقِمُ لِلَّهِ بِهَا",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari ['Urwah bin Zubair] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam diberi dua pilihan antara dua perkara, kecuali akan mengambil yang paling ringan di antara keduanya selama bukan dosa. Jika itu suatu dosa, maka beliau adalah orang yang paling jauh darinya. Dan tidaklah Rasulullah shallallahu 'alaihi wasallam membalas untuk dirinya sendiri, kecuali jika kehormatan Allah dihinakan maka beliau akan membalasnya karena Allah.\""
            },
            {
                "number": 1395,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Ali bin Husain bin Ali bin Abu Thalib] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Di antara tanda baiknya keIslaman seseorang adalah meninggalkan apa yang tidak bermanfaat baginya.\""
            },
            {
                "number": 1396,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ كَعْبِ الْأَحْبَارِ أَنَّهُ قَالَإِذَا أَحْبَبْتُمْ أَنْ تَعْلَمُوا مَا لِلْعَبْدِ عِنْدَ رَبِّهِ فَانْظُرُوا مَاذَا يَتْبَعُهُ مِنْ حُسْنِ الثَّنَاءِ",
                "id": "Telah menceritakan kepadaku Malik dari pamannya [Abu Suhail bin Malik] dari [Ayahnya] dari [Ka'b Al Ahbari] ia berkata; \"Jika kalian ingin tahu apa yang diperoleh seorang hamba di sisi Rabbnya, maka lihatlah pujian baik yang mengiringinya.\""
            },
            {
                "number": 1397,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَ بَلَغَنِيأَنَّ الْمَرْءَ لَيُدْرِكُ بِحُسْنِ خُلُقِهِ دَرَجَةَ الْقَائِمِ بِاللَّيْلِ الظَّامِي بِالْهَوَاجِرِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata; \"Telah sampai kabar kepadaku bahwa seseorang dengan kebaikan akhlaknya akan bisa menyamai derajat orang yang sholat di malam hari dan orang yang kehausan di siang hari (berpuasa) .\""
            },
            {
                "number": 1398,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُأَلَا أُخْبِرُكُمْ بِخَيْرٍ مِنْ كَثِيرٍ مِنْ الصَّلَاةِ وَالصَّدَقَةِ قَالُوا بَلَى قَالَ إِصْلَاحُ ذَاتِ الْبَيْنِ وَإِيَّاكُمْ وَالْبِغْضَةَ فَإِنَّهَا هِيَ الْحَالِقَةُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] ia berkata; \"Aku mendengar [Sa'id bin Musayyab] berkata; 'Maukah kalian kuberitahu dengan kebaikan yang lebih banyak daripada sholat dan zakat?\" mereka menjawab, \"Tentu.\" Sa'id berkata, \"Memperbaiki hubungan sesama dan jauhilah amarah karena itu adalah perusak dan pencabut agama.\""
            },
            {
                "number": 1399,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سَلَمَةَ بْنِ صَفْوَانَ بْنِ سَلَمَةَ الزُّرَقِيِّ عَنْ زَيْدِ بْنِ طَلْحَةَ بْنِ رُكَانَةَ يَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِكُلِّ دِينٍ خُلُقٌ وَخُلُقُ الْإِسْلَامِ الْحَيَاءُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Salamah bin Shafwan bin Salamah Az Zuraqi] dari [Zaid bin Thalhah bin Rukanah] dia memarfu'kan kepada Nabi shallallahu 'alaihi wasallam, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap agama memiliki akhlak, dan akhlak Islam adalah malu.\""
            },
            {
                "number": 1400,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى رَجُلٍ وَهُوَ يَعِظُ أَخَاهُ فِي الْحَيَاءِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُ فَإِنَّ الْحَيَاءَ مِنْ الْإِيمَانِ",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melewati seseorang yang sedang menasehati saudaranya yang pemalu. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"biarkanlah ia, karena malu adalah bagian dari iman.\""
            },
            {
                "number": 1401,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍأَنَّ رَجُلًا أَتَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي كَلِمَاتٍ أَعِيشُ بِهِنَّ وَلَا تُكْثِرْ عَلَيَّ فَأَنْسَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَغْضَبْ",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Humaid bin Abdurrahman bin Auf] berkata, \"Seorang laki-laki menemui Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, ajari aku kalimat-kalimat yang bisa aku jadikan pegangan dalam hidup, namun jangan terlalu banyak hingga aku melupakannya! \" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu marah.\""
            },
            {
                "number": 1402,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang kuat bukanlah kuat dalam perkelahian. Namun orang yang kuat adalah orang yang dapat mengendalikan jiwanya ketika marah.\""
            },
            {
                "number": 1403,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِمُسْلِمٍ أَنْ يُهَاجِرَ أَخَاهُ فَوْقَ ثَلَاثِ لَيَالٍ يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلَامِ",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari ['Atha` bin Yazid Al Laitsi] dari [Abu Ayyub Al Anshari] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang muslim mendiamkan saudaranya lebih tiga malam. Mereka bertemu, lantas masing-masing membuang muka. Yang paling baik di antara keduanya adalah yang memulai mengucapkan salam.\""
            },
            {
                "number": 1404,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا وَلَا يَحِلُّ لِمُسْلِمٍ أَنْ يُهَاجِرَ أَخَاهُ فَوْقَ ثَلَاثِ لَيَالٍقَالَ مَالِك لَا أَحْسِبُ التَّدَابُرَ إِلَّا الْإِعْرَاضَ عَنْ أَخِيكَ الْمُسْلِمِ فَتُدْبِرَ عَنْهُ بِوَجْهِكَ",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian saling benci, saling dengki, saling memusuhi, namun jadilah hamba-hamba Allah yang bersaudara. Tidak halal bagi seorang muslim mendiamkan saudaranya melebihi tiga malam.\" Malik berkata; \"Aku tidaklah menganggap tadabur selain berpalingnya seseorang dari saudaranya yang muslim lalu kamu palingkan wajahmu darinya.\""
            },
            {
                "number": 1405,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ وَلَا تَجَسَّسُوا وَلَا تَحَسَّسُوا وَلَا تَنَافَسُوا وَلَا تَحَاسَدُوا وَلَا تَبَاغَضُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jauhilah oleh kalian prasangka buruk, karena prasangka buruk adalah sedusta-dusta pembicaraan. Janganlah kalian saling memata-matai, saling mencari aib orang lain, saling berlomba-lomba mencari kemewahan dunia, saling dengki, saling memusuhi, dan saling memutuskan. Jadilah hamba-hamba Allah yang bersaudara.\""
            },
            {
                "number": 1406,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَطَاءِ بْنِ أَبِي مُسْلِمٍ عَبْدِ اللَّهِ الْخُرَاسَانِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَصَافَحُوا يَذْهَبْ الْغِلُّ وَتَهَادَوْا تَحَابُّوا وَتَذْهَبْ الشَّحْنَاءُ",
                "id": "Telah menceritakan kepadaku Malik dari ['Atha bin Abu Muslim Abdullah Al Khurasani] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah kalian saling berjabat tangan, niscaya maka akan hilanglah kedengkian. Hendaklah kalian saling memberi hadiah, niscaya akan saling mencintai dan menghilanglah permusuhan.\""
            },
            {
                "number": 1407,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الْاثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ مُسْلِمٍ لَا يُشْرِكُ بِاللَّهِ شَيْئًا إِلَّا رَجُلًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pintu-pintu surga dibuka pada hari senin dan kamis, maka setiap hamba muslim yang tidak menyekutukan Allah akan diampuni kecuali seorang laki-laki yang ada permusuhan dengan saudaranya. Lalu dikatakan; 'Tangguhkan untuk keduanya hingga mereka damai, tangguhkan untuk keduanya hingga mereka damai'.\""
            },
            {
                "number": 1408,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَتُعْرَضُ أَعْمَالُ النَّاسِ كُلَّ جُمُعَةٍ مَرَّتَيْنِ يَوْمَ الْاثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ مُؤْمِنٍ إِلَّا عَبْدًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ اتْرُكُوا هَذَيْنِ حَتَّى يَفِيئَا أَوِ ارْكُوا هَذَيْنِ حَتَّى يَفِيئَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Muslim bin Abu Maryam] dari [Abu Shalih As Saman] dari [Abu Hurairah] berkata; \"Amalan-amalan manusia akan diperlihatkan dua kali dalam sepekan; hari senin dan kamis. Kemudian setiap orang mukmin akan diampuni dosanya kecuali seorang hamba yang bermusuhan dengan saudaranya, lalu dikatakan 'tinggalkan keduanya hingga mereka kembali' atau 'tinggalkan mereka berdua sampai mereka kembali'.\""
            },
            {
                "number": 1409,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ أَنَّهُ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ بَنِي أَنْمَارٍ قَالَ جَابِرٌ فَبَيْنَا أَنَا نَازِلٌ تَحْتَ شَجَرَةٍ إِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبَلَ فَقُلْتُ يَا رَسُولَ اللَّهِ هَلُمَّ إِلَى الظِّلِّ قَالَ فَنَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُمْتُ إِلَى غِرَارَةٍ لَنَا فَالْتَمَسْتُ فِيهَا شَيْئًا فَوَجَدْتُ فِيهَا جِرْوَ قِثَّاءٍ فَكَسَرْتُهُ ثُمَّ قَرَّبْتُهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مِنْ أَيْنَ لَكُمْ هَذَا قَالَ فَقُلْتُ خَرَجْنَا بِهِ يَا رَسُولَ اللَّهِ مِنْ الْمَدِينَةِ قَالَ جَابِرٌ وَعِنْدَنَا صَاحِبٌ لَنَا نُجَهِّزُهُ يَذْهَبُ يَرْعَى ظَهْرَنَا قَالَ فَجَهَّزْتُهُ ثُمَّ أَدْبَرَ يَذْهَبُ فِي الظَّهْرِ وَعَلَيْهِ بُرْدَانِ لَهُ قَدْ خَلَقَا قَالَ فَنَظَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِ فَقَالَ أَمَا لَهُ ثَوْبَانِ غَيْرُ هَذَيْنِ فَقُلْتُ بَلَى يَا رَسُولَ اللَّهِ لَهُ ثَوْبَانِ فِي الْعَيْبَةِ كَسَوْتُهُ إِيَّاهُمَا قَالَ فَادْعُهُ فَمُرْهُ فَلْيَلْبَسْهُمَا قَالَ فَدَعَوْتُهُ فَلَبِسَهُمَا ثُمَّ وَلَّى يَذْهَبُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَهُ ضَرَبَ اللَّهُ عُنُقَهُ أَلَيْسَ هَذَا خَيْرًا لَهُ قَالَ فَسَمِعَهُ الرَّجُلُ فَقَالَ يَا رَسُولَ اللَّهِ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَبِيلِ اللَّهِ قَالَ فَقُتِلَ الرَّجُلُ فِي سَبِيلِ اللَّهِو حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَ إِنِّي لَأُحِبُّ أَنْ أَنْظُرَ إِلَى الْقَارِئِ أَبْيَضَ الثِّيَابِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Jabir bin Abdullah Al Anshari] berkata; \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam dalam Perang Bani Anmar.\" Jabir berkata; \"Ketika aku duduk di bawah pohon, Rasulullah shallallahu 'alaihi wasallam datang. Aku lalu berkata; 'Wahai Rasulullah, kemarilah berteduh di bawah pohon.' Rasulullah shallallahu 'alaihi wasallam lantas turun, sementara aku bangkit dan menuju karung milik kami. Aku merogoh sesuatu di dalamnya, dan aku mendapatkan mentimun kecil. Mentimun itu kemudian aku belah dan aku berikan kepada Rasulullah shallallahu 'alaihi wasallam. Beliau bertanya: \"Dari mana ini?\" Jabir berkata; \"Aku menjawab; 'Wahai Rasulullah, kami membawanya dari Madinah.\" Jabir melanjutkan, \"Kami memiliki seorang teman, dan kami menyiapkan bekal untuk ia bawa saat mengembalakan hewan tunggangan kami.\" Jabir berkata; \"Aku persiapkan bekal itu untuknya, kemudian dia berbalik dan pergi saat zhuhur dengan mengenakan dua buah kain yang telah usang. Rasulullah shallallahu 'alaihi wasallam lalu melihatnya dan bertanya: 'Apakah dia memiliki dua pakaian lagi selain ini? ' aku menjawab; \"Benar, wahai Rasulullah! Ia punya dua kain di tasnya yang aku berikan untuknya.\" Beliau bersabda: 'Panggillah dia dan suruh dia mengenakannya.\" Aku lalu memanggil dan menyuruhnya memakai kain tersebut. Sahabatku itu kemudian berpaling dan pergi.\" Jabir berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah menebas lehernya. Bukankah itu lebih baik baginya?\" Sahabatku mendengar ucapan Rasulullah tersebut, lalu ia berkata, \"Wahai Rasulullah, apakah ini di jalan Allah? ' Beliau menjawabnya: \"Di jalan Allah.\" Jabir berkata; \"Kemudian sahabatku terbunuh di jalan Allah.\" Telah menceritakan kepadaku Malik telah sampai kabar kepadanya bahwa Umar bin Khattab berkata; \"Sungguh aku lebih senang melihat seorang Qari' yang mengenakan pakaian warna putih.\""
            },
            {
                "number": 1410,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ عَنْ ابْنِ سِيرِينَ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِإِذَا أَوْسَعَ اللَّهُ عَلَيْكُمْ فَأَوْسِعُوا عَلَى أَنْفُسِكُمْ جَمَعَ رَجُلٌ عَلَيْهِ ثِيَابَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ayyub bin Abu Tamimah] dari [Ibnu Sirin] berkata; [Umar bin Khattab] berkata; \"Jika Allah melapangkan rizki-Nya atas kalian, maka pergunakanlah atas diri kalian. Seseorang mengumpulkan pakaian untuk dirinya (yaitu dalam sholat) .\" "
            },
            {
                "number": 1411,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يَلْبَسُ الثَّوْبَ الْمَصْبُوغَ بِالْمِشْقِ وَالْمَصْبُوغَ بِالزَّعْفَرَانِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] mengenakan pakaian yang telah dicelup dengan misyq dan za'faran. "
            },
            {
                "number": 1412,
                "arab": "و حَدَّثَنِي مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا كَسَتْ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ مِطْرَفَ خَزٍّ كَانَتْ عَائِشَةُ تَلْبَسُهُ",
                "id": "Telah menceritakan kepadaku Malik dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwasanya ia pernah memakaikan kain yang terbuat dari tenunan sutra dan katun kepada Abdullah bin Zubair. Dan kain itu biasa dikenakan oleh 'Aisyah.\""
            },
            {
                "number": 1413,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ عَنْ أُمِّهِ أَنَّهَا قَالَتْ دَخَلَتْ حَفْصَةُ بِنْتُ عَبْدِ الرَّحْمَنِ عَلَى عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَوَعَلَى حَفْصَةَ خِمَارٌ رَقِيقٌ فَشَقَّتْهُ عَائِشَةُ وَكَسَتْهَا خِمَارًا كَثِيفًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Alqamah bin Abu Alqamah] dari [Ibunya] ia berkata; \"Hafsah binti Abdurrahman menemui Aisyah, isteri Nabi shallallahu 'alaihi wasallam dengan mengenakan kerudung yang tipis, ['Aisyah] kemudian menyobek dan memakaikan untuknya kerudung yang lebih tebal.\""
            },
            {
                "number": 1414,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَنِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مَائِلَاتٌ مُمِيلَاتٌ لَا يَدْخُلْنَ الْجَنَّةَ وَلَا يَجِدْنَ رِيحَهَا وَرِيحُهَا يُوجَدُ مِنْ مَسِيرَةِ خَمْسِ مِائَةِ عَامٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Muslim bin Abu Maryam] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; \"Wanita-wanita yang berpakaian tapi telanjang, dan berjalan melenggak-lenggok tidak akan masuk surga atau pun mencium baunya, padahal bau surga tercium dari jarak perjalanan lima ratus tahun.\""
            },
            {
                "number": 1415,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ ابْنِ شِهَابٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ مِنْ اللَّيْلِ فَنَظَرَ فِي أُفُقِ السَّمَاءِ فَقَالَ مَاذَا فُتِحَ اللَّيْلَةَ مِنْ الْخَزَائِنِ وَمَاذَا وَقَعَ مِنْ الْفِتَنِ كَمْ مِنْ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٌ يَوْمَ الْقِيَامَةِ أَيْقِظُوا صَوَاحِبَ الْحُجَرِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Ibnu Syihab] berkata, \"Pada suatu malam Rasulullah shallallahu 'alaihi wasallam bangun dan melihat ke ufuk langit, kemudian bersabda: \"Perbendaharaan apa yang dibuka di waktu malam, dan fitnah apa yang terjadi? berapa banyak wanita yang mengenakan pakaian di dunia, tapi telanjang pada hari kiamat nanti, bangunkanlah para penghuni kamar.\""
            },
            {
                "number": 1416,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِي يَجُرُّ ثَوْبَهُ خُيَلَاءَ لَا يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Dinar] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang menjulurkan kainnya karena sombong, maka pada hari kiamat kelak ia tidak akan dilihat oleh Allah.\""
            },
            {
                "number": 1417,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْظُرُ اللَّهُ تَبَارَكَ وَتَعَالَى يَوْمَ الْقِيَامَةِ إِلَى مَنْ يَجُرُّ إِزَارَهُ بَطَرًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat kelak Allah Tabaraka wa Ta'ala tidak melihat orang yang menjulurkan pakaiannya dengan sombong.\""
            },
            {
                "number": 1418,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ وَعَبْدِ اللَّهِ بْنِ دِينَارٍ وَزَيْدِ بْنِ أَسْلَمَ كُلُّهُمْ يُخْبِرُهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ يَجُرُّ ثَوْبَهُ خُيَلَاءَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dan [Abdullah bin Dinar] dan [Zaid bin Aslam] semuanya mengabarkan kepadanya, dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat kelak Allah tidak akan melihat orang yang menjulurkan pakaiannya karena sombong.\" "
            },
            {
                "number": 1419,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ أَنَّهُ قَالَ سَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّعَنْ الْإِزَارِ فَقَالَ أَنَا أُخْبِرُكَ بِعِلْمٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِزْرَةُ الْمُؤْمِنِ إِلَى أَنْصَافِ سَاقَيْهِ لَا جُنَاحَ عَلَيْهِ فِيمَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ مَا أَسْفَلَ مِنْ ذَلِكَ فَفِي النَّارِ مَا أَسْفَلَ مِنْ ذَلِكَ فَفِي النَّارِ لَا يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا",
                "id": "Telah menceritakan kepadaku Malik dari [Al 'Ala bin Abdurrahman] dari [Bapaknya] berkata; Aku bertanya kepada [Abu Sa'id Al Khudri] tentang pakaian. Dia menjawab; \"Aku akan mengabarkan kepadamu dengan berdasarkan ilmu. Aku mendengar Rasulullah shallallahu 'alaihi wasallam beliau bersabda: 'Panjang sarung seorang mukmin adalah setengah betisnya, dan tidak mengapa jika panjangnya antara betis hingga kedua mata kaki. Jika di bawah itu maka tempatnya adalah neraka, jika di bawah itu maka tempatnya adalah neraka. Pada hari kiamat Allah tidak akan melihat orang yang menjulurkan sarungnya dengan sombong.\""
            },
            {
                "number": 1420,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ عَنْ أَبِيهِ نَافِعٍ مَوْلَى ابْنِ عُمَرَ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ أَنَّهَا أَخْبَرَتْهُ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا قَالَتْ حِينَ ذُكِرَ الْإِزَارُ فَالْمَرْأَةُ يَا رَسُولَ اللَّهِ قَالَ تُرْخِيهِ شِبْرًا قَالَتْ أُمُّ سَلَمَةَ إِذًا يَنْكَشِفُ عَنْهَا قَالَ فَذِرَاعًا لَا تَزِيدُ عَلَيْهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Bakar bin Nafi'] dari bapaknya [Nafi'] mantan budak Ibnu 'Umar, dari [Shafiyyah binti Abu 'Ubaid] Bahwasanya ia mengabarkan kepadanya, dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, saat disebutkan tentang kain sarung ia pun bertanya, \"Wahai Rasulullah, bagaimana dengan wanita?\" Beliau menjawab: \"Panjangkanlah satu jengkal lagi.\" Ummu Salamah bertanya lagi; \"Jika masih bisa tersingkap?\" Beliau bersabda: \"Panjangkanlah satu hasta dan jangan engkau lebihkan lagi.\""
            },
            {
                "number": 1421,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمْشِيَنَّ أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ لِيُنْعِلْهُمَا جَمِيعًا أَوْ لِيُحْفِهِمَا جَمِيعًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan sekali-kali salah seorang dari kalian berjalan dengan menggunakan satu sandal, hendaknya dia memakai kedua-duanya atau melepaskannya semuanya.\""
            },
            {
                "number": 1422,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ وَلْتَكُنْ الْيُمْنَى أَوَّلَهُمَا تُنْعَلُ وَآخِرَهُمَا تُنْزَعُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seseorang di antara kalian memakai sandal, mulailah dengan sebelah kanan. Jika melepaskannya, maka mulailah dengan sebelah kiri. Jadikanlah yang kanan itu pertama kali saat memakai, dan terakhir kali saat melepas.\""
            },
            {
                "number": 1423,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ كَعْبِ الْأَحْبَارِأَنَّ رَجُلًا نَزَعَ نَعْلَيْهِ فَقَالَ لِمَ خَلَعْتَ نَعْلَيْكَ لَعَلَّكَ تَأَوَّلْتَ هَذِهِ الْآيَةَ{ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى }قَالَ ثُمَّ قَالَ كَعْبٌ لِلرَّجُلِ أَتَدْرِي مَا كَانَتْ نَعْلَا مُوسَى قَالَ مَالِك لَا أَدْرِي مَا أَجَابَهُ الرَّجُلُ فَقَالَ كَعْبٌ كَانَتَا مِنْ جِلْدِ حِمَارٍ مَيِّتٍ",
                "id": "Telah menceritakan kepadaku Malik dari pamannya [Abu Suhail bin Malik] dari [Bapaknya] dari [Ka'b Al Ahbar] bahwa ada seorang laki-laki melepaskan kedua sandalnya. Ka'b lalu bertanya; \"Kenapa engkau lepas sandalmu, apakah engkau menta'wilkan ayat ini: '(maka tanggalkanlah kedua sandalmu, sesungguhnya engkau berada di lembah Thuwa yang suci)?\" (Qs. Thaahaa: 12) Malik bin Abu 'Amir berkata; \"Ka'b kemudian bertanya bertanya kepada orang itu, \"Apakah kamu tahu bagaimana kedua sandal Musa? ' Malik berkata; \"Aku tidak mengetahui apa jawaban laki-laki itu.\" Ka'b berkata; \"Sandalnya terbuat dari kulit keledai yang telah mati.\""
            },
            {
                "number": 1424,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لِبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ عَنْ الْمُلَامَسَةِ وَعَنْ الْمُنَابَذَةِ وَعَنْ أَنْ يَحْتَبِيَ الرَّجُلُ فِي ثَوْبٍ وَاحِدٍ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَيْءٌ وَعَنْ أَنْ يَشْتَمِلَ الرَّجُلُ بِالثَّوْبِ الْوَاحِدِ عَلَى أَحَدِ شِقَّيْهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dua jenis pakaian dan dua jenis jual beli; Mulamasah dan munabadzah. Beliau melarang seorang laki-laki berihtiba dengan hanya mengenakan satu kain, sehingga tidak ada sesuatu yang menutupi kemaluannya. Dan melarang seorang laki-laki membungkus dirinya dengan satu pakaian pada salah satu bagiannya.\""
            },
            {
                "number": 1425,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ عُمَرَ بْنَ الْخَطَّابِ رَأَى حُلَّةً سِيَرَاءَ تُبَاعُ عِنْدَ بَابِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ لَوْ اشْتَرَيْتَ هَذِهِ الْحُلَّةَ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لَا خَلَاقَ لَهُ فِي الْآخِرَةِ ثُمَّ جَاءَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا حُلَلٌ فَأَعْطَى عُمَرَ بْنَ الْخَطَّابِ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ أَكَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ أَكْسُكَهَا لِتَلْبَسَهَا فَكَسَاهَا عُمَرُ أَخًا لَهُ مُشْرِكًا بِمَكَّةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa Umar bin Khattab melihat perhiasan yang dihiasi dengan sutra dijual di depan pintu masjid. Umar lalu berkata, \"Wahai Rasulullah, sekiranya engkau membeli pakaian ini sehingga engkau bisa memakainya pada hari jumat dan saat menjamu para utusan yang datang.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Hanyasanya yang mengenakan pakaian ini adalah orang-yang tidak mendapatkan bagian di akhirat.\" Kemudian datanglah beberapa jenis pakaian, beliau kemudian memberi Umar bin Khattab sehelai. Umar bertanya; \"Wahai Rasulullah, akankah anda memberiku pakaian ini, padahal anda telah mengatakan tentang pakaian Utharid sebagaimana yang engkau katakan! \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku memberi ini bukan untuk engkau kenakan.\" Maka Umar memberikannya kepada saudaranya yang musyrik di Makkah.\""
            },
            {
                "number": 1426,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّهُ قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ وَهُوَ يَوْمَئِذٍ أَمِيرُ الْمَدِينَةِوَقَدْ رَقَعَ بَيْنَ كَتِفَيْهِ بِرِقَاعٍ ثَلَاثٍ لَبَّدَ بَعْضَهَا فَوْقَ بَعْضٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] ia berkata; [Anas bin Malik] berkata; \"Aku melihat [Umar bin Khattab] yang ketika itu menjadi gubernur Madinah, menambal baju pada bagian kedua pundaknya dengan tiga buah tambalan. Dia menambali sehelai di atas helai lainnya.\""
            },
            {
                "number": 1427,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ سَمِعَهُ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ بِالطَّوِيلِ الْبَائِنِ وَلَا بِالْقَصِيرِ وَلَيْسَ بِالْأَبْيَضِ الْأَمْهَقِ وَلَا بِالْآدَمِ وَلَا بِالْجَعْدِ الْقَطَطِ وَلَا بِالسَّبِطِ بَعَثَهُ اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ وَتَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ عَلَى رَأْسِ سِتِّينَ سَنَةً وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعْرَةً بَيْضَاءَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari [Anas bin Malik] bahwa Rabi'ah bin Abu Abdurrahman mendengarnya berkata; \"Rasulullah shallallahu 'alaihi wasallam bukanlah seorang yang terlalu tinggi juga tidak terlalu pendek. Tidak putih pucat juga tidak pula coklat kelam. Rambutnya tidak keriting juga tidak lurus. Allah mengutusnya ketika beliau berusia empat puluh tahun. Beliau tinggal di Makkah selama sepuluh tahun dan di Madinah sepuluh tahun. Allah Azza Wa Jalla mewafatkannya ketika berumur enam puluhan, pada kepala dan jenggotnya tidak ada kecuali dua puluh helai rambut putih.\""
            },
            {
                "number": 1428,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلًا آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ اللِّمَمِ قَدْ رَجَّلَهَا فَهِيَ تَقْطُرُ مَاءً مُتَّكِئًا عَلَى رَجُلَيْنِ أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ يَطُوفُ بِالْكَعْبَةِ فَسَأَلْتُ مَنْ هَذَا قِيلَ هَذَا الْمَسِيحُ ابْنُ مَرْيَمَ ثُمَّ إِذَا أَنَا بِرَجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ فَسَأَلْتُ مَنْ هَذَا فَقِيلَ لِي هَذَا الْمَسِيحُ الدَّجَّالُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada suatu malam aku mimpi di dekat Ka'bah. Aku melihat seseorang yang kulitnya sawo matang, seakan-akan dia adalah sebaik-baik orang yang berkulit sawo matang. Dia memiliki rambut, seakan-akan ia adalah sebaik-baik orang yang mempunyai rambut seperti itu. Dia membiarkannya terurai dan air itupun menetes darinya. Ia bersandar pada dua orang laki-laki, atau \"Dua bahu laki-laki, dia mengelilingi Ka'bah, lalu aku bertanya, siapakah dia? Maka dikatakan bahwa dia Al masih bin Maryam. Kemudian aku melihat orang yang rambutnya sangat keriting, buta mata kanannya seperti anggur yang menggelembung. Aku bertanya; siapakah ini, dikatakan kepadaku bahwa ia Almasih Dajjal.\""
            },
            {
                "number": 1429,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَخَمْسٌ مِنْ الْفِطْرَةِ تَقْلِيمُ الْأَظْفَارِ وَقَصُّ الشَّارِبِ وَنَتْفُ الْإِبْطِ وَحَلْقُ الْعَانَةِ وَالْاخْتِتَانُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Bapaknya] dari [Abu Hurairah] berkata; \"Lima macam sunnah fitrah: memotong kuku, memendekkan kumis, mencabut bulu ketiak, mencukur bulu kemaluan, dan berkhitan.\""
            },
            {
                "number": 1430,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَكَانَ إِبْرَاهِيمُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلَ النَّاسِ ضَيَّفَ الضَّيْفَ وَأَوَّلَ النَّاسِ اخْتَتَنَ وَأَوَّلَ النَّاسِ قَصَّ الشَّارِبَ وَأَوَّلَ النَّاسِ رَأَى الشَّيْبَ فَقَالَ يَا رَبِّ مَا هَذَا فَقَالَ اللَّهُ تَبَارَكَ وَتَعَالَى وَقَارٌ يَا إِبْرَاهِيمُ فَقَالَ يَا رَبِّ زِدْنِي وَقَارًاقَالَ يَحْيَى و سَمِعْت قَوْله تَعَالَى يَقُولُ يُؤْخَذُ مِنْ الشَّارِبِ حَتَّى يَبْدُوَ طَرَفُ الشَّفَةِ وَهُوَ الْإِطَارُ وَلَا يَجُزُّهُ فَيُمَثِّلُ بِنَفْسِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Ibrahim shallallahu 'alaihi wasallam adalah orang pertama yang memuliakan tamu. Orang pertama yang berkhitan. Orang pertama yang memendekkan kumis dan orang pertama yang melihat uban. Ibrahim bertanya, \"Wahai Rabbku, apa ini?\" Allah Tabaraka wa Ta'ala berfirman: \"Wahai Ibrahim, itu adalah kewibawaan.\" Ibrahim berkata, \"Ya Rabb, tambahkanlah kewibawaan bagiku! \" Yahya berkata; \"Aku mendengar Malik berkata; 'kumis diambil hingga nampak ujung bibir -yaitu bibir itu sendiri-, dan dia tidak mencukur habis, sehingga tetap terlihat kumis tersebut'.\""
            },
            {
                "number": 1431,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ السَّلَمِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَأْكُلَ الرَّجُلُ بِشِمَالِهِ أَوْ يَمْشِيَ فِي نَعْلٍ وَاحِدَةٍ وَأَنْ يَشْتَمِلَ الصَّمَّاءَ وَأَنْ يَحْتَبِيَ فِي ثَوْبٍ وَاحِدٍ كَاشِفًا عَنْ فَرْجِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zubair] dari [Jabir bin Abdullah As Sulami] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang makan dengan tangan kirinya, atau berjalan dengan memakai satu sandal. Beliau melarang berselimut dengan tidak mengeluarkan satupun anggota badannya, dan beliau melarang duduk ihtiba dengan mengenakan satu pakaian, sehingga tersingkap kemaluannya.\" "
            },
            {
                "number": 1432,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي بَكْرِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَلْيَشْرَبْ بِيَمِينِهِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari [Abu Bakar bin 'ubaidhullah bin Abdullah bin Umar] dari [Abdullah bin 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian makan, hendaklah ia makan dengan tangan kanannya dan minum dengan tangan kanannya. Sesungguhnya setan makan dan minum dengan tangan kirinya.\""
            },
            {
                "number": 1433,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ الْمِسْكِينُ بِهَذَا الطَّوَّافِ الَّذِي يَطُوفُ عَلَى النَّاسِ فَتَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ قَالُوا فَمَا الْمِسْكِينُ يَا رَسُولَ اللَّهِ قَالَ الَّذِي لَا يَجِدُ غِنًى يُغْنِيهِ وَلَا يَفْطُنُ النَّاسُ لَهُ فَيُتَصَدَّقَ عَلَيْهِ وَلَا يَقُومُ فَيَسْأَلَ النَّاسَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukanlah orang miskin itu yang berkeliling mengitari orang-orang lalu dia mendapatkan satu atau dua suapan, sebutir atau dua butir kurma.\" Para sahabat bertanya, \"Wahai Rasulullah, lalu siapakah orang miskin itu?\" Beliau menjawab: \"(Yaitu) orang yang tidak mendapatkan kecukupan bagi dirinya, namun orang-orang tidak menyadarinya sehingga memberinya sedekah, dan dia tidak meminta-minta kepada manusia.\""
            },
            {
                "number": 1434,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ بُجَيْدٍ الْأَنْصَارِيِّ ثُمَّ الْحَارِثِيِّ عَنْ جَدَّتِهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُدُّوا الْمِسْكِينَ وَلَوْ بِظِلْفٍ مُحْرَقٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Ibnu Bujaid Al Anshari Al Haritsi] dari [Neneknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berilah orang miskin, walaupun hanya dengan kuku (kaki kambing) yang telah dibakar! \""
            },
            {
                "number": 1435,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الْمُسْلِمُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang muslim makan dengan satu usus sedangkan orang kafir makan dengan tujuh usus.\""
            },
            {
                "number": 1436,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَافَهُ ضَيْفٌ كَافِرٌ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلَابَهَا ثُمَّ أُخْرَى فَشَرِبَهُ ثُمَّ أُخْرَى فَشَرِبَهُ حَتَّى شَرِبَ حِلَابَ سَبْعِ شِيَاهٍ ثُمَّ إِنَّهُ أَصْبَحَ فَأَسْلَمَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلَابَهَا ثُمَّ أَمَرَ لَهُ بِأُخْرَى فَلَمْ يَسْتَتِمَّهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤْمِنُ يَشْرَبُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَشْرَبُ فِي سَبْعَةِ أَمْعَاءٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] berkata, \"Seorang kafir datang bertamu kepada Rasulullah shallallahu 'alaihi wasallam. Maka beliau memerintahkan untuk kambing mendatangkan seekor kambing untuk diperah, orang kafir itu lalu memimun perahan susunya. Lalu diperahkan dari kambing yang lain, dan ia meminumnya. Lalu diperahkan dari kambing lain lain, dan ia meminumnya lagi, hingga menghabiskan susu dari tujuh kambing. Keesoakan harinya orangitu masuk Islam. Rasulullah shallallahu 'alaihi wasallam menyuruh agar kambing beliau diperah. Diapun minum air susunya, kemudian beliau memerahkannya lagi namun dia tidak sanggup menghabisinya. Sehingga Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang mukmin minum dengan satu usus sedangkan orang kafir minum dengan tujuh usus.\""
            },
            {
                "number": 1437,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِي يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Zaid bin Abdullah bin Umar bin Khattab] dari [Abdullah bin Abdurrahman bin Abu Bakar Ash Shidhiq] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang minum dari bejana perak, sungguh akan terdengar gemuruh api neraka di dalam perutnya.\""
            },
            {
                "number": 1438,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَيُّوبَ بْنِ حَبِيبٍ مَوْلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِي الْمُثَنَّى الْجُهَنِيِّ أَنَّهُ قَالَكُنْتُ عِنْدَ مَرْوَانَ بْنِ الْحَكَمِ فَدَخَلَ عَلَيْهِ أَبُو سَعِيدٍ الْخُدْرِيُّ فَقَالَ لَهُ مَرْوَانُ بْنُ الْحَكَمِ أَسَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ النَّفْخِ فِي الشَّرَابِ فَقَالَ لَهُ أَبُو سَعِيدٍ نَعَمْ فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي لَا أَرْوَى مِنْ نَفَسٍ وَاحِدٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبِنْ الْقَدَحَ عَنْ فَاكَ ثُمَّ تَنَفَّسْ قَالَ فَإِنِّي أَرَى الْقَذَاةَ فِيهِ قَالَ فَأَهْرِقْهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ayyub bin Habib] mantan budak Saad bin Abu Waqqash, dari [Abu Al Mutsanna Al Juhani] berkata, \"Ketika aku berada di samping Marwan bin Al Hakam, datanglah Abu Sa'id Al Khudri. Marwan bin Hakam bertanya kepadanya, \"Apakah engkau pernah mendengar Rasulullah shallallahu 'alaihi wasallam melarang bernafas meniup ketika minum?\" [Abu Sa'id Al Khudri] menjawab, \"Ya.\" Lalu ada seorang laki-laki bertanya kepada beliau, \"Wahai Rasulullah, aku tidak bisa kenyang dengan satu nafas! \" Rasulullah shallallahu 'alaihi wasallam bersabda: 'Jauhkan gelas dari mulutmu, lalu bernafaslah! \"' Laki-laki itu berkata, \"Aku melihat ada kotoran di dalamnya! \" Beliau menjawab: \"Tumpahkanlah! \""
            },
            {
                "number": 1439,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ وَسَعْدَ بْنَ أَبِي وَقَّاصٍكَانَا لَا يَرَيَانِ بِشُرْبِ الْإِنْسَانِ وَهُوَ قَائِمٌ بَأْسًا",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] dari bahwa [Aisyah] Ummul Mukminim dan [Sa'd bin Waqqas] berpendapat bahwa tidaklah mengapa seorang minum sambil berdiri.\""
            },
            {
                "number": 1440,
                "arab": "و حَدَّثَنِي مَالِك عَنْ أَبِي جَعْفَرٍ الْقَارِئِ أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَيَشْرَبُ قَائِمًا",
                "id": "Telah menceritakan kepadaku Malik dari [Abu Ja'far Al Qari] berkata, \"Aku melihat [Abdullah bin Umar] minum sambil berdiri.\""
            }
        ]
    }
}