{
    "status": true,
    "data": {
        "start": 721,
        "end": 864,
        "total": 144,
        "book": "malik",
        "hadits": [
            {
                "number": 721,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِرَدَّ رَجُلًا مِنْ مَرِّ الظَّهْرَانِ لَمْ يَكُنْ وَدَّعَ الْبَيْتَ حَتَّى وَدَّعَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Umar bin al Khatthab] menyuruh seorang laki-laki dari Mari Zhuhran yang belum melakukan thawaf wada' untuk kembali lagi (ke Makkah) hingga orang tersebut melakukan thawaf.\""
            },
            {
                "number": 722,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ قَالَمَنْ أَفَاضَ فَقَدْ قَضَى اللَّهُ حَجَّهُ فَإِنَّهُ إِنْ لَمْ يَكُنْ حَبَسَهُ شَيْءٌ فَهُوَ حَقِيقٌ أَنْ يَكُونَ آخِرُ عَهْدِهِ الطَّوَافَ بِالْبَيْتِ وَإِنْ حَبَسَهُ شَيْءٌ أَوْ عَرَضَ لَهُ فَقَدْ قَضَى اللَّهُ حَجَّهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] berkata; \"Barangsiapa melakukan Thawaf Ifadlah, maka Allah telah memenuhi ibadah hajinya. Jika dirinya tidak mendapati rintangan, maka hendaknya ia mengakhiri hajinya dengan thawaf di Ka'bah. Namun jika ia mendapat rintangan, maka Allah telah memenuhi hajinya.\" Malik berkata, \"Jika ada seseorang tidak tahu bahwa masa akhir hajinya adalah melaksanakan thawaf di Baitullah hingga ia sampai di rumah, maka menurutku hal itu tidak apa-apa. Kecuali jika ia masih di sekitar (Makkah), maka hendaklah ia kembali lagi untuk melakaukan thawaf di baitullah, kemudian ia barulah kembali pulang jika telah melaksanakan thawaf ifadlah.\""
            },
            {
                "number": 723,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الْأَسْوَدِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْشَكَوْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي أَشْتَكِي فَقَالَ طُوفِي مِنْ وَرَاءِ النَّاسِ وَأَنْتِ رَاكِبَةٌ قَالَتْ فَطُفْتُ رَاكِبَةً بَعِيرِي وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَئِذٍ يُصَلِّي إِلَى جَانِبِ الْبَيْتِ وَهُوَ يَقْرَأُ بِالطُّورِ وَكِتَابٍ مَسْطُورٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Aswad Muhammad bin Abdurrahman bin Nufail] dari ['Urwah bin Zubair] dari [Zainab binti Abu Salamah] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; \"Saya mengadu kepada Rasulullah shallallahu 'alaihi wasallam bahwa saya sakit.\" Beliau bersabda: \"Hendaklah kamu melaksanakan thawaf di belakang orang-orang dengan berkendara.\" Ummu Salamah berkata; \"Maka aku pun melaksanakan thawaf dengan mengendarai untaku.\" sementara Rasulullah shallallahu 'alaihi wasallam saat itu sedang melaksanakan sholat di samping Ka'bah dengan membaca: 'WA THUUR WA KITAABIM MASTHUUR' .\""
            },
            {
                "number": 724,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ أَنَّ أَبَا مَاعِزٍ الْأَسْلَمِيَّ عَبْدَ اللَّهِ بْنَ سُفْيَانَ أَخْبَرَهُ أَنَّهُ كَانَ جَالِسًا مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَفَجَاءَتْهُ امْرَأَةٌ تَسْتَفْتِيهِ فَقَالَتْ إِنِّي أَقْبَلْتُ أُرِيدُ أَنْ أَطُوفَ بِالْبَيْتِ حَتَّى إِذَا كُنْتُ بِبَابِ الْمَسْجِدِ هَرَقْتُ الدِّمَاءَ فَرَجَعْتُ حَتَّى ذَهَبَ ذَلِكَ عَنِّي ثُمَّ أَقْبَلْتُ حَتَّى إِذَا كُنْتُ عِنْدَ بَابِ الْمَسْجِدِ هَرَقْتُ الدِّمَاءَ فَرَجَعْتُ حَتَّى ذَهَبَ ذَلِكَ عَنِّي ثُمَّ أَقْبَلْتُ حَتَّى إِذَا كُنْتُ عِنْدَ بَابِ الْمَسْجِدِ هَرَقْتُ الدِّمَاءَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ إِنَّمَا ذَلِكِ رَكْضَةٌ مِنْ الشَّيْطَانِ فَاغْتَسِلِي ثُمَّ اسْتَثْفِرِي بِثَوْبٍ ثُمَّ طُوفِي",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zubair Al Maki] bahwa [Abu Ma'iz Al Aslami Abdullah bin Sufyan] mengabarkan kepadanya bahwa ia pernah duduk bersama [Abdullah bin Umar] . Lalu ada seorang wanita datang meminta fatwa seraya berkata, \"Saya menuju Ka'bah untuk melakukan thawaf. Saat tiba di pintu Masjidil Haram, tiba-tiba darahku keluar. Maka aku pun pulang hingga darahku berhenti keluar. Kemudian saya berangkat lagi, namun ketika sampai di depan pintu Masjidil Haram darahku kembali keluar?\" Kemudian saya berangkat lagi, namun ketika sampai di depan pintu Masjidil Haram darahku kembali keluar?\" Abdullah bin Umar berkata; \"Itu adalah gangguan dari setan. Maka, hendaklah kami mandi, lalu tutuplah dengan kain dan lakukanlah thawaf.\""
            },
            {
                "number": 725,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حِينَ خَرَجَ مِنْ الْمَسْجِدِ وَهُوَ يُرِيدُ الصَّفَا وَهُوَ يَقُولُ نَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ فَبَدَأَ بِالصَّفَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ja'far bin Muhammad bin Ali] dari [Bapaknya] dari [Jabir bin Abdullah] berkata; \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda saat beliau hendak keluar dari Masjidil Haram menuju Shafa: 'Kita akan memulai sebagaimana Allah memulai.' Maka beliau memulai dari Shafa.\""
            },
            {
                "number": 726,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا وَقَفَ عَلَى الصَّفَا يُكَبِّرُ ثَلَاثًا وَيَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ يَصْنَعُ ذَلِكَ ثَلَاثَ مَرَّاتٍ وَيَدْعُو وَيَصْنَعُ عَلَى الْمَرْوَةِ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ja'far bin Muhammad bin Ali] dari [Bapaknya] dari [Jabir bin Abdullah] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam berdiri di atas bukit Shafa, beliau bertakbir tiga kali dan mengucapkan: \"LAA ILAAHA ILLALLAH WAHDAHU LAA SYARIIKALAH LAHUL MULKU WALAHUL HAMDU WAHUWA 'ALA KULLI SYAI'IN QADIIR (Tidak ada tuhan selain Allah Yang Maha Tunggal, tidak ada sekutu bagi-Nya. Bagi-Nya kerajaan, dan pujian. Dia Maha Menentukan atas segala sesuatu) \" Beliau melakukannya tiga kali lalu berdo'a. Dan beliau juga melakukan hal yang sama di Marwa."
            },
            {
                "number": 727,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَوَهُوَ عَلَى الصَّفَا يَدْعُو يَقُولُ اللَّهُمَّ إِنَّكَ قُلْتَ{ ادْعُونِي أَسْتَجِبْ لَكُمْ }وَإِنَّكَ لَا تُخْلِفُ الْمِيعَادَ وَإِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي لِلْإِسْلَامِ أَنْ لَا تَنْزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي وَأَنَا مُسْلِمٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] Bahwasanya ia pernah mendengar [Abdullah bin Umar] berdo'a di atas Shafa: \"ALLAHUMMA INNAKA QULTA UD'UUNI ASTAJIB LAKUM WA INNAKA LAA TUKHLIFUL MII'AAD. WA INNI AS'ALUKA KAMA HADAITANII LIL ISLAAM AN LAA TANZI'AHU MINNII HATTA TATAWAFFAANII WA ANA MUSLIMUN (Ya Allah, Engkau mengatakan: 'Mintalah kepada-Ku maka akan Aku kabulkan. Sesungguhnya Engkau tidak pernah mengingkari janji. Saya memohon kepadamu sebagaimana engkau tunjuki saya pada Islam, janganlah engkau cabut dariku hingga ajal menjemputku sedang saya dalam keadaan muslim.) \""
            },
            {
                "number": 728,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ قَالَ قُلْتُ لِعَائِشَةَ أُمِّ الْمُؤْمِنِينَ وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّأَرَأَيْتِ قَوْلَ اللَّهِ تَبَارَكَ وَتَعَالَى{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا }فَمَا عَلَى الرَّجُلِ شَيْءٌ أَنْ لَا يَطَّوَّفَ بِهِمَا فَقَالَتْ عَائِشَةُ كَلَّا لَوْ كَانَ كَمَا تَقُولُ لَكَانَتْ فَلَا جُنَاحَ عَلَيْهِ أَنْ لَا يَطَّوَّفَ بِهِمَا إِنَّمَا أُنْزِلَتْ هَذِهِ الْآيَةُ فِي الْأَنْصَارِ كَانُوا يُهِلُّونَ لِمَنَاةَ وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَلَمَّا جَاءَ الْإِسْلَامُ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا }",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] ia berkata; \"Aku pernah bertanya kepada [Aisyah Ummul Mukminin], saat saya masih muda: 'Apakah anda tahu tentang firman Allah Tabaraka Wa Ta'ala: 'Sesungguhnya Shafaa dan Marwa adalah sebahagian dari syi'ar Allah. Barangsiapa yang beribadah haji ke Baitullah atau ber'umrah, Maka tidak ada dosa baginya mengerjakan sa'i antara keduanya.' -Qs. Al Baqarah: 156- Maka tidak apa-apa bagi seseorang untuk meninggalkan sa'i.\" Aisyah menjawab; \"Bukan begitu, kalau seperti yang kamu katakan, tentu tidak ada dosa bagi orang yang tidak melakukan sa'i. Ayat ini turun pada orang-orang Anshar, dahulu mereka melakukan talbiyah untuk Manat, yang letaknya di depan Qudaid. Mereka menjauhi untuk tidak melaksanakan sa'i antara Shafaa dan Marwa. Maka tatkala datang Islam, mereka bertanya pada Rasulullah shallallahu 'alaihi wasallam tentang hal itu. Allah Tabaraka Wa Ta'ala menurunkan ayat: 'Sesungguhnya Shafa dan Marwa adalah sebagian dari syi'ar Allah. Maka barangsiapa yang beribadah haji ke Baitullah atau umrah, Maka tidak ada dosa baginya mengerjakan sa'i antara keduanya'. -Qs. Al Baqarah: 156-."
            },
            {
                "number": 729,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ أَنَّ سَوْدَةَ بِنْتَ عَبْدِ اللَّهِ بْنِ عُمَرَ كَانَتْ عِنْدَ عُرْوَةَ بْنِ الزُّبَيْرِفَخَرَجَتْ تَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ فِي حَجٍّ أَوْ عُمْرَةٍ مَاشِيَةً وَكَانَتْ امْرَأَةً ثَقِيلَةً فَجَاءَتْ حِينَ انْصَرَفَ النَّاسُ مِنْ الْعِشَاءِ فَلَمْ تَقْضِ طَوَافَهَا حَتَّى نُودِيَ بِالْأُولَى مِنْ الصُّبْحِ فَقَضَتْ طَوَافَهَا فِيمَا بَيْنَهَا وَبَيْنَهُ وَكَانَ عُرْوَةُ إِذَا رَآهُمْ يَطُوفُونَ عَلَى الدَّوَابِّ يَنْهَاهُمْ أَشَدَّ النَّهْيِ فَيَعْتَلُّونَ بِالْمَرَضِ حَيَاءً مِنْهُ فَيَقُولُ لَنَا فِيمَا بَيْنَنَا وَبَيْنَهُ لَقَدْ خَابَ هَؤُلَاءِ وَخَسِرُوا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] berkata, \" [Saudah binti Abdullah bin Umar] adalah isteri Urwah bin az Zubair. Ia keluar melakukan sa'i antara Shafa dan Marwa untuk haji atau umrah dengan berjalan kaki, padahal ia adalah wanita yang gemuk. Sehingga ia baru datang saat orang-orang telah selesai melaksanakan sholat isya, dan ia belum selesai melaksanakan thawaf hingga adzan subuh yang pertama dikumandangkan. Namun demikian ia tetap merampungkan thawafnya antara isya hingga adzan subuh tersebut. Sementara Urwah, jika ia melihat orang-orang melaksanakan thawaf dengan berkendaraan, ia melarang mereka dengan keras. Lalu mereka beralasan sakit karena malu darinya. ' [Urwah] lantas berkata kepada kami, \"Mereka telah tertipu dan merugi.\""
            },
            {
                "number": 730,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا نَزَلَ مِنْ الصَّفَا وَالْمَرْوَةِ مَشَى حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي بَطْنِ الْوَادِي سَعَى حَتَّى يَخْرُجَ مِنْهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ja'far bin Muhammad] dari [Bapaknya] dari [Jabir bin Abdullah] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam singgah di Shafa dan Marwa, beliau berjalan. Kalau kedua kakinya sudah menginjak ujung lembah, beliau berlari-lari kecil hingga keluar dari tempat itu."
            },
            {
                "number": 731,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عُمَيْرٍ مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِأَنَّ نَاسًا تَمَارَوْا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُهُمْ هُوَ صَائِمٌ وَقَالَ بَعْضُهُمْ لَيْسَ بِصَائِمٍ فَأَرْسَلْتُ إِلَيْهِ بِقَدَحِ لَبَنٍ وَهُوَ وَاقِفٌ عَلَى بَعِيرِهِ فَشَرِبَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Nadlr] mantan budak 'Umar bin 'ubaidhullah, dari ['Umair] mantan budak Abdullah bin 'Abbas, dari [Ummul Fadll binti Al Harits] orang-orang saling berdebat di sisinya tentang puasa Rasulullah shallallahu 'alaihi wasallam pada hari Arafah. Sebagian mereka berkata; 'Beliau berpuasa', dan sebagian lagi berkata 'Beliau tidak berpuasa'. Lalu aku memberikan segelas susu saat beliau sedang berada di atas hewan tunggangannya, lalu beliau minum."
            },
            {
                "number": 732,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَكَانَتْ تَصُومُ يَوْمَ عَرَفَةَقَالَ الْقَاسِمُ وَلَقَدْ رَأَيْتُهَا عَشِيَّةَ عَرَفَةَ يَدْفَعُ الْإِمَامُ ثُمَّ تَقِفُ حَتَّى يَبْيَضَّ مَا بَيْنَهَا وَبَيْنَ النَّاسِ مِنْ الْأَرْضِ ثُمَّ تَدْعُو بِشَرَابٍ فَتُفْطِرُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] berkata, \" [Aisyah] -Umul mukminin- pernah berpuasa pada hari Arafah.\" Al Qasim berkata; \"Saya pernah melihatnya di sore hari Arafah saat imam bertolak. Kemudian Aisyah wukuf hingga tanah yang ada antara dirinya dan orang-orang menjadi kosong. Kemudian ia meminta air minum dan berbuka dengannya.\""
            },
            {
                "number": 733,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ أَيَّامِ مِنًى",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Nadlr] mantan budak 'Umar bin 'ubaidhullah dari [Sulaiman bin Yasar] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang berpuasa pada hari-hari Mina."
            },
            {
                "number": 734,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ عَبْدَ اللَّهِ بْنَ حُذَافَةَ أَيَّامَ مِنًى يَطُوفُ يَقُولُ إِنَّمَا هِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutus Abdullah bin Hudzafah pada hari Mina untuk berkeliling dan menyerukan, \"Ini adalah hari-hari untuk makan, minum dan dzikir kepada Allah.\""
            },
            {
                "number": 735,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ يَوْمَيْنِ يَوْمِ الْفِطْرِ وَيَوْمِ الْأَضْحَى",
                "id": "Telah menceritakan kepadaku dari Malik dari [Muhammad bin Yahya bin Habban] dari [Al A'raj] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang puasa pada dua Hari Raya, Idul Fitri dan Idul Adha.\""
            },
            {
                "number": 736,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِي عَنْ أَبِي مُرَّةَ مَوْلَى أُمِّ هَانِئٍ أُخْتِ عَقِيلِ بْنِ أَبِي طَالِبٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّهُ أَخْبَرَهُأَنَّهُ دَخَلَ عَلَى أَبِيهِ عَمْرِو بْنِ الْعَاصِ فَوَجَدَهُ يَأْكُلُ قَالَ فَدَعَانِي قَالَ فَقُلْتُ لَهُ إِنِّي صَائِمٌ فَقَالَ هَذِهِ الْأَيَّامُ الَّتِي نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صِيَامِهِنَّ وَأَمَرَنَا بِفِطْرِهِنَّقَالَ مَالِك هِيَ أَيَّامُ التَّشْرِيقِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Abdullah bin Al Had] dari [Abu Murrah] mantan budak Ummu Hani, saudara perempuan 'Aqil bin Abu Thalib, dari [Abdullah bin 'Amru bin Al 'Ash] mengabarkan kepadanya, bahwa ia pernah masuk menemui bapaknya, [Amru bin Al Ash] dan mendapatinya sedang makan. Abdullah berkata, \"Lalu bapakku memanggilku untuk ikut makan bersama. Maka aku katakan kepadanya, \"Aku sedang berpuasa.\" Amru bin al Ash berkata, \"Ini adalah hari-hari yang Rasulullah shallallahu 'alaihi wasallam melarang kita untuk berpuasa, dan menyuruh kita untuk berbuka.\" Malik berkata; \"Maksudnya adalah hari-hari Tasyriq.\""
            },
            {
                "number": 737,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْدَى جَمَلًا كَانَ لِأَبِي جَهْلِ بْنِ هِشَامٍ فِي حَجٍّ أَوْ عُمْرَةٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari Nafi' dari [Abdullah bin Abu Bakar bin Muhammad bin 'Amru bin Hazm] berkata, \"Rasulullah shallallahu 'alaihi wasallam menyembelih seekor unta yang dulunya milik Abu Jahl bin Hisyam dalam haji atau umrah.\""
            },
            {
                "number": 738,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً فَقَالَ ارْكَبْهَا فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ فَقَالَ ارْكَبْهَا وَيْلَكَ فِي الثَّانِيَةِ أَوْ الثَّالِثَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melihat seorang laki-laki sedang menuntun seekor unta. Beliau lalu bersabda: \"Naikilah.\" Orang tersebut menjawab; \"Wahai Rasulullah, ini adalah unta sembelihan.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Naikilah! \" lalu beliau mengatakan 'celakalah kamu', pada kali kedua atau ketiga dari ucapannya.\""
            },
            {
                "number": 739,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ كَانَ يَرَى عَبْدَ اللَّهِ بْنَ عُمَرَيُهْدِي فِي الْحَجِّ بَدَنَتَيْنِ بَدَنَتَيْنِ وَفِي الْعُمْرَةِ بَدَنَةً بَدَنَةً قَالَ وَرَأَيْتُهُ فِي الْعُمْرَةِ يَنْحَرُ بَدَنَةً وَهِيَ قَائِمَةٌ فِي دَارِ خَالِدِ بْنِ أَسِيدٍ وَكَانَ فِيهَا مَنْزِلُهُ قَالَ وَلَقَدْ رَأَيْتُهُ طَعَنَ فِي لَبَّةِ بَدَنَتِهِ حَتَّى خَرَجَتْ الْحَرْبَةُ مِنْ تَحْتِ كَتِفِهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Dinar] Bahwasanya ia melihat [Abdullah bin Umar] menyembelih dua ekor unta, dua ekor unta saat haji, dan satu ekor satu ekor saat umrah. Abdullah bin Dinar berkata; \"Dan saat Umrah aku melihatnya menyembelih seekor unta, unta itu berdiri di rumah Khalid bin Asid, dan di dalam itulah ia menginap. Aku melihatnya menusuk leher unta tersebut hingga pisaunya keluar dari bawah bahu.\""
            },
            {
                "number": 740,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِأَهْدَى جَمَلًا فِي حَجٍّ أَوْ عُمْرَةٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \" [Umar bin Abdul Aziz] menyembelih seekor unta dalam haji atau umrah."
            },
            {
                "number": 741,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي جَعْفَرٍ الْقَارِئِ أَنَّ عَبْدَ اللَّهِ بْنَ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيَّأَهْدَى بَدَنَتَيْنِ إِحْدَاهُمَا بُخْتِيَّةٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Ja'far Al Qari] berkata, \" [Abdullah bin 'Ayyas bin Abu Rabi'ah al Makhzumi] menyembelih dua ekor unta, salah satunya unta yang panjang lehernya.\""
            },
            {
                "number": 742,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُإِذَا نُتِجَتْ النَّاقَةُ فَلْيُحْمَلْ وَلَدُهَا حَتَّى يُنْحَرَ مَعَهَا فَإِنْ لَمْ يُوجَدْ لَهُ مَحْمَلٌ حُمِلَ عَلَى أُمِّهِ حَتَّى يُنْحَرَ مَعَهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] berkata, \" [Abdullah bin Umar] berkata, \"Jika unta telah beranak, hendaklah anaknya dibawa hingga ikut disembelih bersamanya. Jika tidak ada alat untuk membawanya, hendaklah dibawa di atas badan induknya hingga disembelih bersamanya.\""
            },
            {
                "number": 743,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ أَنَّ أَبَاهُ قَالَإِذَا اضْطُرِرْتَ إِلَى بَدَنَتِكَ فَارْكَبْهَا رُكُوبًا غَيْرَ فَادِحٍ وَإِذَا اضْطُرِرْتَ إِلَى لَبَنِهَا فَاشْرَبْ بَعْدَ مَا يَرْوَى فَصِيلُهَا فَإِذَا نَحَرْتَهَا فَانْحَرْ فَصِيلَهَا مَعَهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] bahwa [Bapaknya] berkata, \"Jika kamu membutuhkan untamu, kendarailah tanpa membuatnya lelah. Jika kamu membutuhkan susunya, minumlah setelah anaknya minum darinya. Jika kamu menyembelihnya, maka sembelihlah anaknya bersama induknya.\""
            },
            {
                "number": 744,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ كَانَ إِذَا أَهْدَى هَدْيًا مِنْ الْمَدِينَةِ قَلَّدَهُ وَأَشْعَرَهُ بِذِي الْحُلَيْفَةِ يُقَلِّدُهُ قَبْلَ أَنْ يُشْعِرَهُ وَذَلِكَ فِي مَكَانٍ وَاحِدٍ وَهُوَ مُوَجَّهٌ لِلْقِبْلَةِ يُقَلِّدُهُ بِنَعْلَيْنِ وَيُشْعِرُهُ مِنْ الشِّقِّ الْأَيْسَرِ ثُمَّ يُسَاقُ مَعَهُ حَتَّى يُوقَفَ بِهِ مَعَ النَّاسِ بِعَرَفَةَ ثُمَّ يَدْفَعُ بِهِ مَعَهُمْ إِذَا دَفَعُوا فَإِذَا قَدِمَ مِنًى غَدَاةَ النَّحْرِ نَحَرَهُ قَبْلَ أَنْ يَحْلِقَ أَوْ يُقَصِّرَ وَكَانَ هُوَ يَنْحَرُ هَدْيَهُ بِيَدِهِ يَصُفُّهُنَّ قِيَامًا وَيُوَجِّهُهُنَّ إِلَى الْقِبْلَةِ ثُمَّ يَأْكُلُ وَيُطْعِمُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin 'Umar] Bahwasanya jika dia memotong hewan sembelihan dari Madinah, maka dia me nuntunnya dan memberinya tanda di Dzul Hulaifah. Dia menuntunnya sebelum menandainya dalam satu tempat dengan menghadap kiblat; menuntunnya dengan mengenakan kedua sandal, lalu memberinya tanda dari sebelah kirinya. Setelah itu ia menggiringnya hingga tiba di Arafah berkumpul bersama orang-orang. Kemudian bertolak ke mina jika orang-orang bertolak, ketika telah tiba di Mina pada pagi hari, maka ia memotong sembelihan tersebut sebelum mencukur kepala dan memendekkannya. Kemudian ia sembelih sembelihan tersebut kedua tangannya menghadap kiblat, lalu memakan dagingnya dan memberikan sebagiannya kepada orang lain.\""
            },
            {
                "number": 745,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا طَعَنَ فِي سَنَامِ هَدْيِهِ وَهُوَ يُشْعِرُهُ قَالَ بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] jika menusuk punuk binatang sembelihannya untuk memberi tanda, maka ia mengucapkan, \"BISMILLAHI ALLAHU AKBAR (Dengan menyebut nama Allah, Allah Maha Besar) .\""
            },
            {
                "number": 746,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُالْهَدْيُ مَا قُلِّدَ وَأُشْعِرَ وَوُقِفَ بِهِ بِعَرَفَةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata, \"Binatang sembelihan itu adalah hewan yang telah dikalungi, diberi tanda diberhentikan di Arafah.\""
            },
            {
                "number": 747,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُجَلِّلُ بُدْنَهُ الْقُبَاطِيَّ وَالْأَنْمَاطَ وَالْحُلَلَ ثُمَّ يَبْعَثُ بِهَا إِلَى الْكَعْبَةِ فَيَكْسُوهَا إِيَّاهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] berkata, \" [Abdullah bin Umar] menghiasi untanya dengan kain tipis putih dari Mesir, kain sutra dan kain campuran, kemudian mengirimkannya ke Ka'bah dan menyelimutinya dengan kain yang sama.\""
            },
            {
                "number": 748,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ دِينَارٍ مَا كَانَ عَبْدُ اللَّهِ بْنُ عُمَرَيَصْنَعُ بِجِلَالِ بُدْنِهِ حِينَ كُسِيَتْ الْكَعْبَةُ هَذِهِ الْكِسْوَةَ قَالَ كَانَ يَتَصَدَّقُ بِهَا",
                "id": "Telah menceritakan kepadaku dari Malik Bahwasanya ia pernah bertanya kepada [Abdullah bin Dinar] tentang perbuatan [Abdullah bin Umar] menyelimuti hewan yang akan disembelihnya saat Ka'bah ditutup dengan kain kiswah?\" Abdullah bin Dinar menjawab; \"Dia mensedekahkannya.\""
            },
            {
                "number": 749,
                "arab": "و حَدَّثَنِي مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُفِي الضَّحَايَا وَالْبُدْنِ الثَّنِيُّ فَمَا فَوْقَهُ",
                "id": "Telah menceritakan kepadaku Malik dari [Nafi'] bahwa [Abdullah bin 'Umar] pernah berkomentar tentang hewan kurban (untuk hari Id) dan unta yang disiapkan untuk hadyu, yaitu Ats Tsaniy (kambing yang masuk umur tiga tahun atau unta yang masuk umur enam tahun) atau yang lebih dari itu.\""
            },
            {
                "number": 750,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ لَا يَشُقُّ جِلَالَ بُدْنِهِ وَلَا يُجَلِّلُهَا حَتَّى يَغْدُوَ مِنْ مِنًى إِلَى عَرَفَةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] tidak merabek atau melepas kain penutup punggung untanya sehingga ia berangkat dari Mina menuju Arafah.\""
            },
            {
                "number": 751,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ كَانَ يَقُولُ لِبَنِيهِيَا بَنِيَّ لَا يُهْدِيَنَّ أَحَدُكُمْ مِنْ الْبُدْنِ شَيْئًا يَسْتَحْيِي أَنْ يُهْدِيَهُ لِكَرِيمِهِ فَإِنَّ اللَّهَ أَكْرَمُ الْكُرَمَاءِ وَأَحَقُّ مَنْ اخْتِيرَ لَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] ia berkata kepada anak-anaknya, \"Wahai anakku, janganlah salah seorang dari kalian menyembelih unta, yang dia malu untuk memberikannya kepada orang yang ia muliakan, sesungguhnya Allah adalah Yang Maha Mulia, dan yang paling berhak untuk dipilihkan.\""
            },
            {
                "number": 752,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّ صَاحِبَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنْ الْهَدْيِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَدَنَةٍ عَطِبَتْ مِنْ الْهَدْيِ فَانْحَرْهَا ثُمَّ أَلْقِ قِلَادَتَهَا فِي دَمِهَا ثُمَّ خَلِّ بَيْنَهَا وَبَيْنَ النَّاسِ يَأْكُلُونَهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] berkata, \"Pembawa binatang hadyu Rasulullah shallallahu 'alaihi wasallam berkata, \"Wahai Rasulullah, apa yang harus saya lakukan terhadap binatang sembelihan yang cacat?\" Rasulullah shallallahu 'alaihi wasallam menjawab; \"Setiap unta sembelihan yang cacat maka sembelihlah, kemudian lemparkanlah tali pengikatnya ke dalam darahnya. Biarkanlah orang-orang yang memakannya.\""
            },
            {
                "number": 753,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَمَنْ سَاقَ بَدَنَةً تَطَوُّعًا فَعَطِبَتْ فَنَحَرَهَا ثُمَّ خَلَّى بَيْنَهَا وَبَيْنَ النَّاسِ يَأْكُلُونَهَا فَلَيْسَ عَلَيْهِ شَيْءٌ وَإِنْ أَكَلَ مِنْهَا أَوْ أَمَرَ مَنْ يَأْكُلُ مِنْهَا غَرِمَهَاو حَدَّثَنِي عَنْ مَالِك عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] berkata, \"Barangsiapa menuntun unta sembelihan tathawwu', lalu unta itu hampir mati sehingga ia menyembelihnya. Jika ia membiarkan sembelihan itu dimakan oleh orang-orang, maka tiada kewajiban apapun atasnya. Namun jika ia ikut memakannya, atau menyuruh orang lain untuk memakannya, maka ia telah berhutang.\" Telah menceritakan kepadaku dari Malik dari [Tsaur bin Zaid ad Dili] dari [Abdullah bin Abbas] seperti di atas. "
            },
            {
                "number": 754,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّهُ قَالَمَنْ أَهْدَى بَدَنَةً جَزَاءً أَوْ نَذْرًا أَوْ هَدْيَ تَمَتُّعٍ فَأُصِيبَتْ فِي الطَّرِيقِ فَعَلَيْهِ الْبَدَلُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] berkata; \"Barangsiapa menyembelih unta pengganti, atau karena nadzar, atau karena sembelihan haji tamattu', kemudian binatang hadyu tersebut tertimpa musibah musibah di jalan, maka ia wajib menggantinya.\""
            },
            {
                "number": 755,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَمَنْ أَهْدَى بَدَنَةً ثُمَّ ضَلَّتْ أَوْ مَاتَتْ فَإِنَّهَا إِنْ كَانَتْ نَذْرًا أَبْدَلَهَا وَإِنْ كَانَتْ تَطَوُّعًا فَإِنْ شَاءَ أَبْدَلَهَا وَإِنْ شَاءَ تَرَكَهَاو حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَمِعَ أَهْلَ الْعِلْمِ يَقُولُونَ لَا يَأْكُلُ صَاحِبُ الْهَدْيِ مِنْ الْجَزَاءِ وَالنُّسُكِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin 'Umar] berkata; \"Barangsiapa hendak menyembelih unta, lalu unta itu hilang atau mati, jika itu karena nadzar maka ia menggantinya. Tetapi jika karena haji tathawwu', bila mau ia boleh dan jika tidak maka tidak perlu menggantinya.\" Telah menceritakan kepadaku dari Malik Bahwasanya ia mendengar ahli ilmu berkata; \"Orang yang berkurban hadyu pengganti atau nusuk, maka ia tidak boleh memakan dagingnya.\""
            },
            {
                "number": 756,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُمَا تَرَوْنَ فِي رَجُلٍ وَقَعَ بِامْرَأَتِهِ وَهُوَ مُحْرِمٌ فَلَمْ يَقُلْ لَهُ الْقَوْمُ شَيْئًا فَقَالَ سَعِيدٌ إِنَّ رَجُلًا وَقَعَ بِامْرَأَتِهِ وَهُوَ مُحْرِمٌ فَبَعَثَ إِلَى الْمَدِينَةِ يَسْأَلُ عَنْ ذَلِكَ فَقَالَ بَعْضُ النَّاسِ يُفَرَّقُ بَيْنَهُمَا إِلَى عَامٍ قَابِلٍ فَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ لِيَنْفُذَا لِوَجْهِهِمَا فَلْيُتِمَّا حَجَّهُمَا الَّذِي أَفْسَدَاهُ فَإِذَا فَرَغَا رَجَعَا فَإِنْ أَدْرَكَهُمَا حَجٌّ قَابِلٌ فَعَلَيْهِمَا الْحَجُّ وَالْهَدْيُ وَيُهِلَّانِ مِنْ حَيْثُ أَهَلَّا بِحَجِّهِمَا الَّذِي أَفْسَدَاهُ وَيَتَفَرَّقَانِ حَتَّى يَقْضِيَا حَجَّهُمَاقَالَ مَالِك يُهْدِيَانِ جَمِيعًا بَدَنَةً بَدَنَةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] Bahwasanya ia mendengar [Sa'id Ibnul Musayyab] bertanya, \"Apa pendapat kalian tentang seorang laki-laki yang menggauli isterinya saat sedang ihram?\" Orang-orang tidak ada yang menjawabnya. Sa'id lalu berkata, \"Ada seorang laki-laki menggauli isterinya saat sedang ihram, lalu ia mengutus seseorang ke Madinah untuk menanyakan hal tersebut. Sebagian orang menjawab, 'Dia harus dipisahkan dari isterinya hingga tahun depan.\" Sa'id Ibnul Musayyab berkata; \"Mereka berdua harus melaksanakan niatnya yang semula dan menuntaskan haji mereka yang telah mereka rusak. Jika telah selesai, mereka boleh kembali. Jika mereka masih menjumpai musim haji tahun depan, maka mereka harus menunaikan haji dan menyembelih sembelihan, serta berniat sebagaimana niat haji mereka sebelumnya yang telah mereka rusak. Mereka harus berpisah sehingga mereka selesai mengerjakan haji mereka.\" Malik berkata; \"Keduanya harus menyembelih masing-masing seekor unta.\""
            },
            {
                "number": 757,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَ أَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ أَنَّ أَبَا أَيُّوبَ الْأَنْصَارِيَّخَرَجَ حَاجًّا حَتَّى إِذَا كَانَ بِالنَّازِيَةِ مِنْ طَرِيقِ مَكَّةَ أَضَلَّ رَوَاحِلَهُ وَإِنَّهُ قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ يَوْمَ النَّحْرِ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ عُمَرُ اصْنَعْ كَمَا يَصْنَعُ الْمُعْتَمِرُ ثُمَّ قَدْ حَلَلْتَ فَإِذَا أَدْرَكَكَ الْحَجُّ قَابِلًا فَاحْجُجْ وَأَهْدِ مَا اسْتَيْسَرَ مِنْ الْهَدْيِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] berkata; telah mengabarkan kepadaku [Sulaiman bin Yasar] berkata, \"Abu Ayyub al Anshari berangkat haji, hingga ketika ia tiba di Naziyah, salah satu jalan ke menuju Makkah, dia kehilangan hewan tunggangannya. Dia mendatangi Umar bin al Khatthab pada hari penyembelihan, dan menceritakan hal itu padanya. [Umar] berkata; \"Lakukanlah sebagaimana yang dilakukan orang yang sedang umrah, lalu silahkan bertahallul. Jika tahun depan engkau masih bisa bertemu dengan musim haji, maka berhajilah dan sembelihlah apa yang bisa kamu dapatkan.\""
            },
            {
                "number": 758,
                "arab": "و حَدَّثَنِي مَالِك عَنْ نَافِعٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّ هَبَّارَ بْنَ الْأَسْوَدِ جَاءَ يَوْمَ النَّحْرِ وَعُمَرُ بْنُ الْخَطَّابِيَنْحَرُ هَدْيَهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْطَأْنَا الْعِدَّةَ كُنَّا نَرَى أَنَّ هَذَا الْيَوْمَ يَوْمُ عَرَفَةَ فَقَالَ عُمَرُ اذْهَبْ إِلَى مَكَّةَ فَطُفْ أَنْتَ وَمَنْ مَعَكَ وَانْحَرُوا هَدْيًا إِنْ كَانَ مَعَكُمْ ثُمَّ احْلِقُوا أَوْ قَصِّرُوا وَارْجِعُوا فَإِذَا كَانَ عَامٌ قَابِلٌ فَحُجُّوا وَأَهْدُوا فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلَاثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعَ",
                "id": "Telah menceritakan kepadaku Malik dari [Nafi'] dari [Sulaiman bin Yasar] berkata, \"Habbar bin al Aswad datang pada hari penyembelihan, sementara Umar bin al Khatthab waktu itu sedang menyembelih hewan sembelihannya. Habbar berkata, \"Wahai Amirul Mukminin, kami salah menghitung, kami kira hari ini adalah hari Arafah?\" [Umar] berkata, \"Pergilah kamu ke Makkah bersama orang-orang yang ikut denganmu, dan lakukanlah thawaf. Lalu sembelihlah sembelihan jika kalian membawanya. Cukur atau pendekkanlah rambut, setelah itu pulanglah. Jika tahun depan kalian menemui musim haji lagi, maka berhaji dan sembelihlah sembelihan. Bagi yang tidak mendapatkannya, maka hendaknya ia berpuasa tiga hari saat haji dan tujuh hari jika telah kembali.\""
            },
            {
                "number": 759,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّهُ سُئِلَ عَنْ رَجُلٍ وَقَعَ بِأَهْلِهِ وَهُوَ بِمِنًى قَبْلَ أَنْ يُفِيضَ فَأَمَرَهُ أَنْ يَنْحَرَ بَدَنَةً",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zubair Al Maki] dari ['Atha bin Abu Rabah] dari [Abdullah bin Abbas] Bahwasanya ia ditanya tentang seorang laki-laki yang menggauli isterinya saat berada di Mina, dan sebelum ia melakukan Thawaf Ifadlah. lalu Iabnu Abbas menyuruhnya untuk menyembelih seekor unta."
            },
            {
                "number": 760,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ عَنْ عِكْرِمَةَ مَوْلَى ابْنِ عَبَّاسٍ قَالَ لَا أَظُنُّهُ إِلَّا عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّهُ قَالَالَّذِي يُصِيبُ أَهْلَهُ قَبْلَ أَنْ يُفِيضَ يَعْتَمِرُ وَيُهْدِيو حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ يَقُولُ فِي ذَلِكَ مِثْلَ قَوْلِ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ مَالِك وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَيَّ فِي ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Tsaur bin Zaid Ad Dailami] dari [Ikrimah] mantan budak Ibnu 'Abbas, ia berkata; Aku tidak menyangka kecuali dari [Abdullah bin 'Abbas] ia berkata, \"Orang yang mensetubuhi isterinya sebelum melaksanakan thawaf ifadlah, maka ia tetap melakukan umrah dan memotong sembelihan.\" Telah menceritakan kepadaku dari Malik Bahwasanya ia mendengar [Rabi'ah bin Abu Abdurrahman] berkata tentang masalah itu, sebagaimana perkataan Ikrimah dari Ibnu 'Abbas. Malik berkata; \"Itu adalah hal yang paling saya sukai, dari apa yang saya dengar tentang masalah ini.\""
            },
            {
                "number": 761,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ كَانَ يَقُولُ{ مَا اسْتَيْسَرَ مِنْ الْهَدْيِ }شَاةٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ja'far bin Muhammad] dari [Bapaknya] dari [Ali bin Abu Thalib] berkata; \"'Binatang sembelihan yang paling mudah (didapat) ..-Qs. Al Baqarah: 196- adalah kambing.\""
            },
            {
                "number": 762,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُمَا اسْتَيْسَرَ مِنْ الْهَدْيِ بَدَنَةٌ أَوْ بَقَرَةٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Binatang sembelihan yang paling mudah didapat adalah unta atau sapi.\""
            },
            {
                "number": 763,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ أَنَّ مَوْلَاةً لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ يُقَالُ لَهَا رُقَيَّةُ أَخْبَرَتْهُ أَنَّهَا خَرَجَتْ مَعَ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ إِلَى مَكَّةَ قَالَتْفَدَخَلَتْ عَمْرَةُ مَكَّةَ يَوْمَ التَّرْوِيَةِ وَأَنَا مَعَهَا فَطَافَتْ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ دَخَلَتْ صُفَّةَ الْمَسْجِدِ فَقَالَتْ أَمَعَكِ مِقَصَّانِ فَقُلْتُ لَا فَقَالَتْ فَالْتَمِسِيهِ لِي فَالْتَمَسْتُهُ حَتَّى جِئْتُ بِهِ فَأَخَذَتْ مِنْ قُرُونِ رَأْسِهَا فَلَمَّا كَانَ يَوْمُ النَّحْرِ ذَبَحَتْ شَاةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] mantan budak 'Amrah binti Abdurrahman yang bernama [Ruqayyah] ia mengabarkan kepadanya, bahwa ia pernah keluar bersama ['Amrah binti Abdurrahman] menuju Makkah. Ruqayyah berkata; \"'Amrah memasuki Makkah pada hari Tarwiyah, sedang saya bersamanya. Ia melakukan thawaf di Ka'bah, lalu sa'i dari Shafa menuju Marwa. Kemudian ia memasuki bagian masjid yang belakang dan bertanya, 'Apakah kamu membawa dua gunting?\" saya menjawab, \"Tidak.\" Ia lantas berkata, \"Carikanlah untukku.\" Maka aku pun mencarinya sampai aku mendapatkannya, lalu aku memegang kepalanya. Dan saat hari penyembelihan tiba, ia menyembelih seekor kambing.\""
            },
            {
                "number": 764,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ صَدَقَةَ بْنِ يَسَارٍ الْمَكِّيِّ أَنَّ رَجُلًا مِنْ أَهْلِ الْيَمَنِ جَاءَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَوَقَدْ ضَفَرَ رَأْسَهُ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي قَدِمْتُ بِعُمْرَةٍ مُفْرَدَةٍ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ لَوْ كُنْتُ مَعَكَ أَوْ سَأَلْتَنِي لَأَمَرْتُكَ أَنْ تَقْرِنَ فَقَالَ الْيَمَانِي قَدْ كَانَ ذَلِكَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ خُذْ مَا تَطَايَرَ مِنْ رَأْسِكَ وَأَهْدِ فَقَالَتْ امْرَأَةٌ مِنْ أَهْلِ الْعِرَاقِ مَا هَدْيُهُ يَا أَبَا عَبْدِ الرَّحْمَنِ فَقَالَ هَدْيُهُ فَقَالَتْ لَهُ مَا هَدْيُهُ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَوْ لَمْ أَجِدْ إِلَّا أَنْ أَذْبَحَ شَاةً لَكَانَ أَحَبَّ إِلَيَّ مِنْ أَنْ أَصُومَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Shadaqah bin Yasar Al Maki] berkata, \"Seorang laki-laki Yaman menemui Abdulah bin Umar, sementara telah mengepang rambutnya, laki-laki itu berkata, \"Wahai Abu Abdurrahman, saya datang untuk melaksanakan umrah saja.\" [Abdullah bin Umar] berkata, \"Andai saja saya bersamamu, atau kamu bertanya kepadaku, niscaya saya akan suruh kamu melakukan niat haji dan umrah sekaligus.\" Laki-laki Yaman itu berkata, \"Namun itu telah terjadi.\" Abdullah bin Umar berkata, \"Potonglah rambutmu dan sembelihlah sembelihan.\" Kemudian ada seorang wanita Iraq bertanya, \"Wahai Abu 'Abdurrahman, binatang apa yang disembelih?\" Abdullah bin Umar balik bertanya, \"Sembelihannya…?\" wanita itu bertanya lagi, \"Binatang apa?\" Abdullah bin Umar menjawab, \"Andai saya tidak mendapati selain kambing, maka itu lebih saya sukai daripada saya berpuasa.\""
            },
            {
                "number": 765,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُالْمَرْأَةُ الْمُحْرِمَةُ إِذَا حَلَّتْ لَمْ تَمْتَشِطْ حَتَّى تَأْخُذَ مِنْ قُرُونِ رَأْسِهَا وَإِنْ كَانَ لَهَا هَدْيٌ لَمْ تَأْخُذْ مِنْ شَعْرِهَا شَيْئًا حَتَّى تَنْحَرَ هَدْيَهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata, \"Seorang wanita yang sedang ihram, jika hendak bertahallul, maka dia tidak boleh menyisir rambutnya hingga memotong sebagian ujung rambutnya. Jika dia mempunyai sembelihan, maka tidak perlu memotong sedikitpun dari rambutnya hingga dia menyembelih sembelihannya.\""
            },
            {
                "number": 766,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ يَعْقُوبَ بْنِ خَالِدٍ الْمَخْزُومِيِّ عَنْ أَبِي أَسْمَاءَ مَوْلَى عَبْدِ اللَّهِ بْنِ جَعْفَرٍ أَنَّهُ أَخْبَرَهُأَنَّهُ كَانَ مَعَ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ فَخَرَجَ مَعَهُ مِنْ الْمَدِينَةِ فَمَرُّوا عَلَى حُسَيْنِ بْنِ عَلِيٍّ وَهُوَ مَرِيضٌ بِالسُّقْيَا فَأَقَامَ عَلَيْهِ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ حَتَّى إِذَا خَافَ الْفَوَاتَ خَرَجَ وَبَعَثَ إِلَى عَلِيِّ بْنِ أَبِي طَالِبٍ وَأَسْمَاءَ بِنْتِ عُمَيْسٍ وَهُمَا بِالْمَدِينَةِ فَقَدِمَا عَلَيْهِ ثُمَّ إِنَّ حُسَيْنًا أَشَارَ إِلَى رَأْسِهِ فَأَمَرَ عَلِيٌّ بِرَأْسِهِ فَحُلِّقَ ثُمَّ نَسَكَ عَنْهُ بِالسُّقْيَا فَنَحَرَ عَنْهُ بَعِيرًا قَالَ يَحْيَى بْنُ سَعِيدٍ وَكَانَ حُسَيْنٌ خَرَجَ مَعَ عُثْمَانَ بْنِ عَفَّانَ فِي سَفَرِهِ ذَلِكَ إِلَى مَكَّةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Ya'qub bin Khalid Al Makhzumi] dari [Abu Asma] mantan budak Abdullah bin Ja'far, Bahwasanya ia mengabarkan kepadanya, bahwa ia pernah bersama Abdullah bin Ja'far berangkat dari Madinah. Mereka melewati Husain bin Ali yang sedang sakit di Suqya, Abdullah bin Ja'far pun singgah hingga ketika ia khawatir tertinggal, maka ia berangkat dan mengutus seseorang menemui Ali bin Abu Thalib dan Asma binti 'Umais yang sedang di Madinah. Ali bin Abu Thalib dan Asma lalu mendatangi Husain, Husain kemudian menunjuk ke arah kepalanya (agar rambutnya dicukur) . Maka [Ali] menyuruh seseorang agar memotong rambutnya, lantas rambutnya pun dicukur. Setelah itu Ali menghajikan Husain di Sugya dan memotong unta sebagai hadyu.\" Yahya bin Sa'id berkata, \"Husain berangkat bersama 'Utsman bin 'Affan dalam perjalanannya ke Makkah.\""
            },
            {
                "number": 767,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَنَّهُ كَانَ يَقُولُاعْلَمُوا أَنَّ عَرَفَةَ كُلَّهَا مَوْقِفٌ إِلَّا بَطْنَ عُرَنَةَ وَأَنَّ الْمُزْدَلِفَةَ كُلَّهَا مَوْقِفٌ إِلَّا بَطْنَ مُحَسِّرٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Abdullah bin Az Zubair] ia berkata, \"Ketahuilah, Arafah seluruhnya adalah tempat wukuf, kecuali lembah Uranah. Muzdalifah semuanya adalah tempat wukuf kecuali lembah Muhassir.\""
            },
            {
                "number": 768,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُمَنْ لَمْ يَقِفْ بِعَرَفَةَ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ قَبْلَ أَنْ يَطْلُعَ الْفَجْرُ فَقَدْ فَاتَهُ الْحَجُّ وَمَنْ وَقَفَ بِعَرَفَةَ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ مِنْ قَبْلِ أَنْ يَطْلُعَ الْفَجْرُ فَقَدْ أَدْرَكَ الْحَجَّ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata, \"Barangsiapa tidak melakukan wukuf di Arafah sejak bermalam di Muzdalifah sebelum terbitnya fajar, maka dia telah ketinggalan hajinya. Barangsiapa melaksanakan wukuf dari saat bermalam di Muzdalifah sebelum terbitnya fajar maka dia telah mendapatkan haji.\""
            },
            {
                "number": 769,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ قَالَمَنْ أَدْرَكَهُ الْفَجْرُ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ وَلَمْ يَقِفْ بِعَرَفَةَ فَقَدْ فَاتَهُ الْحَجُّ وَمَنْ وَقَفَ بِعَرَفَةَ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ قَبْلَ أَنْ يَطْلُعَ الْفَجْرُ فَقَدْ أَدْرَكَ الْحَجَّ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] berkata, \"Barangsiapa mendapatkan fajar dari malam Muzdalifah namun dia tidak melaksanakan wukuf di Arafah, maka dia telah kehilangan haji. Barangsiapa melaksanakan wukuf di Arafah sejak bermalam di Muzdalifah sebelum terbitnya fajar maka dia telah mendapatkan haji.\""
            },
            {
                "number": 770,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ سَالِمٍ وَعُبَيْدِ اللَّهِ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ أَبَاهُمَا عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُقَدِّمُ أَهْلَهُ وَصِبْيَانَهُ مِنْ الْمُزْدَلِفَةِ إِلَى مِنًى حَتَّى يُصَلُّوا الصُّبْحَ بِمِنًى وَيَرْمُوا قَبْلَ أَنْ يَأْتِيَ النَّاسُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Salim] dan ['ubaidhullah] -keduanya adalah anak Abdullah bin 'Umar- bahwa bapak keduanya [Abdullah bin 'Umar] mendahulukan (mempercepat) isteri dan dan anak-anaknya dari Muzdalifah menuju Mina agar mereka dapat melaksanakan sholat subuh di Mina dan melempar sebelum orang-orang sampai.\""
            },
            {
                "number": 771,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّ مَوْلَاةً لِأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَخْبَرَتْهُ قَالَتْ جِئْنَا مَعَ أَسْمَاءَ ابْنَةِ أَبِي بَكْرٍمِنًى بِغَلَسٍ قَالَتْ فَقُلْتُ لَهَا لَقَدْ جِئْنَا مِنًى بِغَلَسٍ فَقَالَتْ قَدْ كُنَّا نَصْنَعُ ذَلِكَ مَعَ مَنْ هُوَ خَيْرٌ مِنْكِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari ['Atha bin Abu Rabah] bahwa [mantan budak Asma binti Abu Bakar] mengabarkan kepadanya, ia berkata, \"Kami bersama [Asma binti Abu Bakar] tiba di Mina saat malam masih gelap.\" Mantan budak Asma berkata, \"Maka aku berkata kepada Asma, \"Kita sampai di Mina saat waktu malam masih gelap.\" Asma menjawab, \"Kami pernah melakukannya bersama orang yang lebih baik dari kamu.\""
            },
            {
                "number": 772,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ أَخْبَرَتْهُ أَنَّهَا كَانَتْ تَرَى أَسْمَاءَ بِنْتَ أَبِي بَكْرٍبِالْمُزْدَلِفَةِ تَأْمُرُ الَّذِي يُصَلِّي لَهَا وَلِأَصْحَابِهَا الصُّبْحَ يُصَلِّي لَهُمْ الصُّبْحَ حِينَ يَطْلُعُ الْفَجْرُ ثُمَّ تَرْكَبُ فَتَسِيرُ إِلَى مِنًى وَلَا تَقِفُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Fathimah binti Al Mundzir] ia mengabarkan kepadanya, bahwa ia pernah melihat [Asma binti Abu Bakar] di Muzdalifah menyuruh seseorang untuk menjadi imam sholat subuh baginya dan para sahabatnya ketika matahari telah terbit, lalu ia naik kendaraannya dan bertolak menuju Mina tanpa berhenti.\""
            },
            {
                "number": 773,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ قَالَ سُئِلَ أُسَامَةُ بْنُ زَيْدٍوَأَنَا جَالِسٌ مَعَهُ كَيْفَ كَانَ يَسِيرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ حِينَ دَفَعَ قَالَ كَانَ يَسِيرُ الْعَنَقَ فَإِذَا وَجَدَ فَجْوَةً نَصَّقَالَ مَالِك قَالَ هِشَامُ بْنُ عُرْوَةَ وَالنَّصُّ فَوْقَ الْعَنَقِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] ia berkata, \" [Usamah bin Zaid] pernah ditanya, dan waktu itu aku sedang duduk bersamanya, 'Bagaimana Rasulullah shallallahu 'alaihi wasallam berjalan meninggalkan tempatnya saat haji Wada'?\" Ia menjawab, \"Beliau berjalan dengan biasa saja, jika beliau mendapatkan tanah yang luas beliau mempercepatnya.\" Malik berkata; Hisyam bin Urwah berkata, \"An-Nash adalah berjalan dengan agak cepat.\""
            },
            {
                "number": 774,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُحَرِّكُ رَاحِلَتَهُ فِي بَطْنِ مُحَسِّرٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] berkata, \" [Abdullah bin Umar] mempercepat kendaraannya di tengah Muhassir (lembah dekat Muzdalifah) ."
            },
            {
                "number": 775,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ أَخْبَرَتْنِي عَمْرَةُ بِنْتُ عَبْدِ الرَّحْمَنِ أَنَّهَا سَمِعَتْ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ تَقُولُخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِخَمْسِ لَيَالٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ وَلَا نُرَى إِلَّا أَنَّهُ الْحَجُّ فَلَمَّا دَنَوْنَا مِنْ مَكَّةَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ إِذَا طَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ أَنْ يَحِلَّ قَالَتْ عَائِشَةُ فَدُخِلَ عَلَيْنَا يَوْمَ النَّحْرِ بِلَحْمِ بَقَرٍ فَقُلْتُ مَا هَذَا فَقَالُوا نَحَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَزْوَاجِهِقَالَ يَحْيَى بْنُ سَعِيدٍ فَذَكَرْتُ هَذَا الْحَدِيثَ لِلْقَاسِمِ بْنِ مُحَمَّدٍ فَقَالَ أَتَتْكَ وَاللَّهِ بِالْحَدِيثِ عَلَى وَجْهِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, telah mengabarkan kepadaku ['Amrah binti Abdurrahman] Bahwasanya ia mendengar [Aisyah Ummul Mukminin] berkata, \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam lima hari menjelang berakhirnya bulan Dzul Hijjah. Tidak ada yang kami duga kecuali itu adalah haji. Tatkala kami telah mendekati Makkah, Rasulullah shallallahu 'alaihi wasallam menyuruh kami; 'Siapa yang tidak membawa sembelihan, jika dia telah thawaf di Ka'bah dan melaksanakan sa'i antara Shafa dan Marwa, maka hendaklah ia bertahallul.\" Aisyah berkata, \"Maka pada hari Nahr kami diberi hidangan daging sapi.\" Aisyah bertanya, \"Ada apa ini?\" mereka menjawab; \"Rasulullah shallallahu 'alaihi wasallam telah menyembelih untuk para isterinya.\" Yahya bin Sa'id berkata; \"Lalu saya menyebutkan hadits ini kepada [Al Qasim bin Muhammad], dia berkata; \"Demi Allah, 'Amrah membawakan hadits kepadamu sebagaimana mestinya?\""
            },
            {
                "number": 776,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ حَفْصَةَ أُمِّ الْمُؤْمِنِينَأَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ فَقَالَ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلَا أَحِلُّ حَتَّى أَنْحَرَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin 'Umar] dari [Hafshah] Ummul Mukminin, Bahwasanya ia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Kenapa orang-orang telah bertahallul sedangkan anda belum.\" Beliau menjawab: \"Saya telah mengempalkan rambutku dan telah memasng kalung pada hewan sembelihanku. Saya tidak akan bertahallul sampai saya menyembelih.\""
            },
            {
                "number": 777,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ بَعْضَ هَدْيِهِ وَنَحَرَ غَيْرُهُ بَعْضَهُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ja'far bin Muhammad] dari [Bapaknya] dari [Ali bin Abu Thalib] berkata, \"Rasulullah shallallahu 'alaihi wasallam menyembelih sebagian dari hewan sembelihannya, sedangkan sisanya disembelih oleh orang lain.\""
            },
            {
                "number": 778,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَمَنْ نَذَرَ بَدَنَةً فَإِنَّهُ يُقَلِّدُهَا نَعْلَيْنِ وَيُشْعِرُهَا ثُمَّ يَنْحَرُهَا عِنْدَ الْبَيْتِ أَوْ بِمِنًى يَوْمَ النَّحْرِ لَيْسَ لَهَا مَحِلٌّ دُونَ ذَلِكَ وَمَنْ نَذَرَ جَزُورًا مِنْ الْإِبِلِ أَوْ الْبَقَرِ فَلْيَنْحَرْهَا حَيْثُ شَاءَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Barangsiapa bernadzar hewan kurban, hendaknya dia mengalunginya dengan dua sandal dan menandainya, lalu menyembelihnya di dekat Ka'bah atau Mina pada Hari Nahr, tidak ada tempat bertahallul selain itu. Barangsiapa bernadzar sembelihan dari unta atau sapi, maka sembelihlah dimana saja.\""
            },
            {
                "number": 779,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ أَنَّ أَبَاهُكَانَ يَنْحَرُ بُدْنَهُ قِيَامًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] bahwa [Bapaknya] menyembelih hewan hadyunya dengan dengan berdiri."
            },
            {
                "number": 780,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ ارْحَمْ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ اللَّهُمَّ ارْحَمْ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ وَالْمُقَصِّرِينَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam berdo'a: \"Ya Allah, berilah rahmat orang-orang yang mencukur gundul.\" Para sahabat berkata, \"Wahai Rasulullah, dan orang-orang yang memendekkan rambut?\" Beliau mengulanginya: \"Ya Allah, berilah rahmat orang-orang yang mencukur gundul.\" Para sahabat berkata, \"Wahai Rasulullah, dan orang-orang yang memendekkan rambut?\" Beliau bersabda: \"Dan orang-orang yang memendekkan.\" "
            },
            {
                "number": 781,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِأَنَّهُ كَانَ يَدْخُلُ مَكَّةَ لَيْلًا وَهُوَ مُعْتَمِرٌ فَيَطُوفُ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ وَيُؤَخِّرُ الْحِلَاقَ حَتَّى يُصْبِحَ قَالَ وَلَكِنَّهُ لَا يَعُودُ إِلَى الْبَيْتِ فَيَطُوفُ بِهِ حَتَّى يَحْلِقَ رَأْسَهُ قَالَ وَرُبَّمَا دَخَلَ الْمَسْجِدَ فَأَوْتَرَ فِيهِ وَلَا يَقْرَبُ الْبَيْتَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] bahwa dia memasuki Makkah pada malam hari untuk umrah, lalu dia melaksanakan thawaf di Ka'bah dan sa'i antara Shafa dan Marwa, lalu menunda mencukur rambut hingga pagi hari.\" Abdurrahman bin Al Qasim berkata, \"Tapi dia tidak kembali ke Ka'bah untuk thawaf hingga memotong rambutnya.\" 'Abdurrahman menambahkan, \"Mungkin dia masuk masjid lalu sholat witir di dalamnya tanpa mendekati Ka'bah.\""
            },
            {
                "number": 782,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا أَفْطَرَ مِنْ رَمَضَانَ وَهُوَ يُرِيدُ الْحَجَّ لَمْ يَأْخُذْ مِنْ رَأْسِهِ وَلَا مِنْ لِحْيَتِهِ شَيْئًا حَتَّى يَحُجَّقَالَ مَالِك لَيْسَ ذَلِكَ عَلَى النَّاسِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] jika telah berbuka (idul fitri) dan berniat untuk untuk haji, maka ia tidak akan mengambil rambut atau jenggotnya sedikitpun hingga melaksanakan haji.\" Malik berkata; \"Itu tidak dilakukan orang-orang.\""
            },
            {
                "number": 783,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا حَلَقَ فِي حَجٍّ أَوْ عُمْرَةٍ أَخَذَ مِنْ لِحْيَتِهِ وَشَارِبِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] jika mencukur pada saat haji atau umrah, dia memotong jenggot dan kumisnya.\""
            },
            {
                "number": 784,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّ رَجُلًا أَتَى الْقَاسِمَ بْنَ مُحَمَّدٍفَقَالَ إِنِّي أَفَضْتُ وَأَفَضْتُ مَعِي بِأَهْلِي ثُمَّ عَدَلْتُ إِلَى شِعْبٍ فَذَهَبْتُ لِأَدْنُوَ مِنْ أَهْلِي فَقَالَتْ إِنِّي لَمْ أُقَصِّرْ مِنْ شَعَرِي بَعْدُ فَأَخَذْتُ مِنْ شَعَرِهَا بِأَسْنَانِي ثُمَّ وَقَعْتُ بِهَا فَضَحِكَ الْقَاسِمُ وَقَالَ مُرْهَا فَلْتَأْخُذْ مِنْ شَعَرِهَا بِالْجَلَمَيْنِقَالَ مَالِك أَسْتَحِبُّ فِي مِثْلِ هَذَا أَنْ يُهْرِقَ دَمًا وَذَلِكَ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَ مَنْ نَسِيَ مِنْ نُسُكِهِ شَيْئًا فَلْيُهْرِقْ دَمًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa ada seorang laki-laki datang kepada [Al Qasim bin Muhammad] dan berkata, \"Saya telah selesai melaksanakan thawaf ifadlah bersama isteriku, kemudian saya pergi menuju ke salah satu jalan di gunung agar saya dapat mendekati isteriku. Isteriku lalu berkata, \"Aku belum memendekkan rambutku.\" Maka aku memotong rambutnya dengan gigiku, setelah itu aku menggaulinya?\" Al Qasim pun tertawa dan berkata, \"Perintahkan kepada isterimu agar memotong rambutnya dengan gunting.\" Malik berkata, \"Menurutku untuk kasus seperti ini, semestinya menyembelih hewan kurban. Hal itu karena Abdullah bin 'Abbas berkata, \"Barangsiapa yang terlupakan dengan salah satu rangkaian hajinya maka tumpahkanlah darah.\""
            },
            {
                "number": 785,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ لَقِيَ رَجُلًا مِنْ أَهْلِهِ يُقَالُ لَهُ الْمُجَبَّرُ قَدْ أَفَاضَ وَلَمْ يَحْلِقْ وَلَمْ يُقَصِّرْ جَهِلَ ذَلِكَ فَأَمَرَهُ عَبْدُ اللَّهِ أَنْ يَرْجِعَ فَيَحْلِقَ أَوْ يُقَصِّرَ ثُمَّ يَرْجِعَ إِلَى الْبَيْتِ فَيُفِيضَو حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ كَانَ إِذَا أَرَادَ أَنْ يُحْرِمَ دَعَا بِالْجَلَمَيْنِ فَقَصَّ شَارِبَهُ وَأَخَذَ مِنْ لِحْيَتِهِ قَبْلَ أَنْ يَرْكَبَ وَقَبْلَ أَنْ يُهِلَّ مُحْرِمًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin 'Umar] bahwa ia pernah bertemu dengan salah satu keluarganya yang bernama Al Mujabbar, ia telah melakukan thawaf ifadlah namun belum mencukur ataupun memendekkan rambutnya karena tidak tahu. Abdullah lalu menyuruhnya agar mencukur atau memendekkan rambutnya, kemudian kembali ke Ka'bah untuk melaksanakan thawaf ifadlah.\" Telah menceritakan kepadaku dari Malik sampai kaliannya, bahwa jika Salim bin Abdullah hendak ihram dia akan meminta pemotong, lalu dia mencukur kumisnya dan memangkas jenggotnya sebelum naik kendaraannya dan sebelum berniat untuk umrah."
            },
            {
                "number": 786,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَمَنْ ضَفَرَ رَأْسَهُ فَلْيَحْلِقْ وَلَا تَشَبَّهُوا بِالتَّلْبِيدِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa [Umar bin Khaththab] berkata, \"Barangsiapa mengepang rambutnya, maka hendaklah ia mencukur rambutnya dan jangan menyerupai kuciran.\""
            },
            {
                "number": 787,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَمَنْ عَقَصَ رَأْسَهُ أَوْ ضَفَرَ أَوْ لَبَّدَ فَقَدْ وَجَبَ عَلَيْهِ الْحِلَاقُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] bahwa [Umar bin Khaththab] berkata, \"Barangsiapa memintal rambutnya, atau mengepang, atau mengucir (mengempalkan), maka telah wajib baginya untuk mengundul.\""
            },
            {
                "number": 788,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَبِلَالُ بْنُ رَبَاحٍ وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ فَأَغْلَقَهَا عَلَيْهِ وَمَكَثَ فِيهَا قَالَ عَبْدُ اللَّهِ فَسَأَلْتُ بِلَالًا حِينَ خَرَجَ مَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ جَعَلَ عَمُودًا عَنْ يَمِينِهِ وَعَمُودَيْنِ عَنْ يَسَارِهِ وَثَلَاثَةَ أَعْمِدَةٍ وَرَاءَهُ وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ ثُمَّ صَلَّى",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam masuk ke Ka'bah bersama Usamah bin Zaid, Bilal bin Rabah dan 'Utsman bin Thalhah Al Hajabi, lalu beliau menutupnya pintu dan menetap di dalamnya.\" Abdullah berkata, \"Aku lalu bertanya kepada [Bilal] saat ia keluar, 'Apa yang telah dilakukan Rasulullah shallallahu 'alaihi wasallam di dalam Ka'bah?\" Dia menjawab, \"Beliau memposisikan tiang sebelah kanannya dan dua tiang pada sisi kirinya, sementara tiga tiang lainnya di belakangnya. Waktu itu Ka'bah terdiri dari enam tiang, lalu beliau sholat.\""
            },
            {
                "number": 789,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَكَتَبَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ إِلَى الْحَجَّاجِ بْنِ يُوسُفَ أَنْ لَا تُخَالِفَ عَبْدَ اللَّهِ بْنَ عُمَرَ فِي شَيْءٍ مِنْ أَمْرِ الْحَجِّ قَالَ فَلَمَّا كَانَ يَوْمُ عَرَفَةَ جَاءَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ حِينَ زَالَتْ الشَّمْسُ وَأَنَا مَعَهُ فَصَاحَ بِهِ عِنْدَ سُرَادِقِهِ أَيْنَ هَذَا فَخَرَجَ عَلَيْهِ الْحَجَّاجُ وَعَلَيْهِ مِلْحَفَةٌ مُعَصْفَرَةٌ فَقَالَ مَا لَكَ يَا أَبَا عَبْدِ الرَّحْمَنِ فَقَالَ الرَّوَاحَ إِنْ كُنْتَ تُرِيدُ السُّنَّةَ فَقَالَ أَهَذِهِ السَّاعَةَ قَالَ نَعَمْ قَالَ فَأَنْظِرْنِي حَتَّى أُفِيضَ عَلَيَّ مَاءً ثُمَّ أَخْرُجَ فَنَزَلَ عَبْدُ اللَّهِ حَتَّى خَرَجَ الْحَجَّاجُ فَسَارَ بَيْنِي وَبَيْنَ أَبِي فَقُلْتُ لَهُ إِنْ كُنْتَ تُرِيدُ أَنْ تُصِيبَ السُّنَّةَ الْيَوْمَ فَاقْصُرْ الْخُطْبَةِ وَعَجِّلْ الصَّلَاةَ قَالَ فَجَعَلَ الْحَجَّاجُ يَنْظُرُ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ كَيْمَا يَسْمَعَ ذَلِكَ مِنْهُ فَلَمَّا رَأَى ذَلِكَ عَبْدُ اللَّهِ قَالَ صَدَقَ سَالِمٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Salim bin Abdullah] berkata, \"Abdullah bin Malik bin Marwan menulis surat kepada Al Hajjaj bin Yusuf agar dia tidak menyelisihi Abdullah bin 'Umar dalam masalah haji sedikitpun.\" Salim bin Abdullah berkata, \"Pada hari Arafah, Abdullah bin 'Umar mendatanginya ketika matahari telah condong, dan saat itu aku sedang bersamanya. Kemudian dari dalam sekedup ia berseru, \"Sekarang sampai mana?\" Al Hajjaj keluar dengan memakai selimut yang dicelup warna kuning, lalu berkata, \"Ada apa denganmu Wahai Abu Abdurrahman?\" Abdullah bin 'Umar berkata, \"Segeralah berangkat, jika kamu hendak melaksanakan sunah.\" Al Hajjaj bertanya, \"Apakah pada waktu seperti ini?\" Dia menjawab, \"Ya.\" Al Hajjaj berkata, \"Tunggulah hingga aku mengguyur rambutku dengan air dan keluar lagi.\" Abdullah kemudian turun hingga Al Hajjaj keluar. Lalu ia berjalan antara aku dengan bapakku. Aku lantas berkata kepadanya, \"Jika hari ini engkau ingin beramal sesuai dengan sunah, maka pendekanlah khutbah dan segerakan sholat.\" Salim berkata, \"Setelah mendengar itu, Al Hajjaj menoleh ke arah [Abdullah bin 'Umar], maka tatkala Abdullah menyadari hal itu, dia berkata; \"Salim benar.\""
            },
            {
                "number": 790,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُصَلِّي الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالصُّبْحَ بِمِنًى ثُمَّ يَغْدُو إِذَا طَلَعَتْ الشَّمْسُ إِلَى عَرَفَةَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] berkata, \"[Abdullah bin Umar] sholat zhuhur, ashar, maghrib, isya' dan subuh di Mina lalu berangkat pada awal siang, ketika matahari telah terbit ke Arafah.\""
            },
            {
                "number": 791,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ جَمِيعًا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Abdullah bin 'Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat maghrib dan isya' di Muzdalifah dengan dijamak.\""
            },
            {
                "number": 792,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ سَمِعَهُ يَقُولُدَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَرَفَةَ حَتَّى إِذَا كَانَ بِالشِّعْبِ نَزَلَ فَبَالَ فَتَوَضَّأَ فَلَمْ يُسْبِغْ الْوُضُوءَ فَقُلْتُ لَهُ الصَّلَاةَ يَا رَسُولَ اللَّهِ فَقَالَ الصَّلَاةُ أَمَامَكَ فَرَكِبَ فَلَمَّا جَاءَ الْمُزْدَلِفَةَ نَزَلَ فَتَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ثُمَّ أُقِيمَتْ الصَّلَاةُ فَصَلَّى الْمَغْرِبَ ثُمَّ أَنَاخَ كُلُّ إِنْسَانٍ بَعِيرَهُ فِي مَنْزِلِهِ ثُمَّ أُقِيمَتْ الْعِشَاءُ فَصَلَّاهَا وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Musa bin Uqbah] dari [Kuraib] mantan budak Ibnu 'Abbas, dari [Usamah bin Zaid] bahwa ia mendengarnya berkata, \"Rasulullah shallallahu 'alaihi wasallam meninggalkan Arafah hingga ketika beliau sampai pada suatu jalan di daerah pegunungan, beliau turun untuk kencing, lalu berliau berwudlu namun tidak menyempurnakan wudlunya. Lalu aku bertanya, \"Apakah kita akan sholat Wahai Rasulullah?\" beliau menjawab: 'sholat di depanmu nanti.' Kemudian beliau menaiki kendaraannya hingga ketika sampai di Muzdalifah beliau turun, lalu berwudlu dan menyempurnakan wudlunya. Setelah itu sholat dikumandangkan, beliau lalu sholat maghrib. Orang-orang mengistirahatkan kendaraannya pada tempatnya, kemudian sholat isya' dilaksanakan tanpa ada sholat lain antara kedua sholat tersebut.\""
            },
            {
                "number": 793,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ الْأَنْصَارِيِّ أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْخَطْمِيَّ أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ الْأَنْصَارِيَّ أَخْبَرَهُأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ جَمِيعًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari ['Adi bin Tsabit Al Anshari] bahwa [Abdullah bin Yazid Al Khathmi] mengabarkan kepadanya, bahwa [Abu Ayyub Al Anshari] mengabarkan kepadanya, bahwa ia pernah sholat maghrib dan isya' di Muzdalifah bersama Rasulullah shallallahu 'alaihi wasallam pada saat haji Wada' dengan di jamak.\""
            },
            {
                "number": 794,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُصَلِّي الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ جَمِيعًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] sholat maghrib dan isya' di Muzdalifah dengan dijamak.\""
            },
            {
                "number": 795,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الصَّلَاةَ الرُّبَاعِيَّةَ بِمِنًى رَكْعَتَيْنِوَأَنَّ أَبَا بَكْرٍ صَلَّاهَا بِمِنًى رَكْعَتَيْنِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ صَلَّاهَا بِمِنًى رَكْعَتَيْنِ وَأَنَّ عُثْمَانَ صَلَّاهَا بِمِنًى رَكْعَتَيْنِ شَطْرَ إِمَارَتِهِ ثُمَّ أَتَمَّهَا بَعْدُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat yang terdiri dari empat rakaat di Mina menjadi dua rakaat. [Abu Bakar] juga mengerjakannya dua rakaat di Mina. [Umar bin al Khatthab] juga mengerjakannya dua rakaat di Mina. [Utsman bin Affan] mengerjakannya dua rakaat di sebagian waktu kepemimpinannya, kemudian dia menggenapkannya setelahnya.\""
            },
            {
                "number": 796,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ عُمَرَ بْنَ الْخَطَّابِلَمَّا قَدِمَ مَكَّةَ صَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ انْصَرَفَ فَقَالَ يَا أَهْلَ مَكَّةَ أَتِمُّوا صَلَاتَكُمْ فَإِنَّا قَوْمٌ سَفْرٌ ثُمَّ صَلَّى عُمَرُ بْنُ الْخَطَّابِ رَكْعَتَيْنِ بِمِنًىوَلَمْ يَبْلُغْنَا أَنَّهُ قَالَ لَهُمْ شَيْئًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] berkata, \"Tatkala ['Umar bin al Khatthab] tiba di Makkah ia mengimami mereka sholat dua rakaat lalu pergi seraya berkata, \"Wahai penduduk Makkah, sempurnakanlah sholat kalian, karena kami sedang dalam perjalanan.\" Kemudian Umar bin al Khatthab mengerjakannya dua rakaat di Mina, dan tidak ada satu kabarpun yang sampai pada kami bahwa dia mengatakan sesuatu kepada mereka.\""
            },
            {
                "number": 797,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِصَلَّى لِلنَّاسِ بِمَكَّةَ رَكْعَتَيْنِ فَلَمَّا انْصَرَفَ قَالَ يَا أَهْلَ مَكَّةَ أَتِمُّوا صَلَاتَكُمْ فَإِنَّا قَوْمٌ سَفْرٌ ثُمَّ صَلَّى عُمَرُ رَكْعَتَيْنِ بِمِنًىوَلَمْ يَبْلُغْنَا أَنَّهُ قَالَ لَهُمْ شَيْئًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Bapaknya] bahwa [Umar bin al Khatthab] sholat mengimami orang-orang dua rekaat di Makkah. Tatkala dia hendak pergi, dia berkata; \"Wahai penduduk Makkah, sempurnakanlah sholat kalian, karena kami sedang dalam perjalanan.\" Lalu Umar sholat dua rakaat di Mina, dan tidak ada satu kabarpun yang sampai pada kami bahwa dia mengatakan sesuatu kepada mereka."
            },
            {
                "number": 798,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِخَرَجَ الْغَدَ مِنْ يَوْمِ النَّحْرِ حِينَ ارْتَفَعَ النَّهَارُ شَيْئًا فَكَبَّرَ فَكَبَّرَ النَّاسُ بِتَكْبِيرِهِ ثُمَّ خَرَجَ الثَّانِيَةَ مِنْ يَوْمِهِ ذَلِكَ بَعْدَ ارْتِفَاعِ النَّهَارِ فَكَبَّرَ فَكَبَّرَ النَّاسُ بِتَكْبِيرِهِ ثُمَّ خَرَجَ الثَّالِثَةَ حِينَ زَاغَتْ الشَّمْسُ فَكَبَّرَ فَكَبَّرَ النَّاسُ بِتَكْبِيرِهِ حَتَّى يَتَّصِلَ التَّكْبِيرُ وَيَبْلُغَ الْبَيْتَ فَيُعْلَمَ أَنَّ عُمَرَ قَدْ خَرَجَ يَرْمِي",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] bahwa telah sampai kepadanya, bahwa [Umar bin al Khatthab] keluar keesokan harinya di hari Nahr saat matahari mulai meninggi. Dia bertakbir dan orang-orang pun ikut bertakbir mengikuti takbirnya. Pada hari kedua ia keluar saat matahari sedikit tinggi (siang), ia bertakbir dan orang-orang pun ikut bertakbir. Dan pada hari ketiga ia keluar saat matahari mulai tergelincir, ia bertakbir dan orang-orang pun ikut bertakbir karena takbirnya. Dia menyambung takbirnya hingga sampai di Ka'bah, baru diketahui bahwa Umar keluar untuk melempar jumrah."
            },
            {
                "number": 799,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَاخَ بِالْبَطْحَاءِ الَّتِي بِذِي الْحُلَيْفَةِ فَصَلَّى بِهَاقَالَ نَافِعٌ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam beristirahat di Bathha yang ada di Dzul Hulaifah, lalu beliau sholat di sana.\" Nafi' berkata; \"Abdullah bin Umar juga melakukan hal demikian.\""
            },
            {
                "number": 800,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُصَلِّي الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ بِالْمُحَصَّبِ ثُمَّ يَدْخُلُ مَكَّةَ مِنْ اللَّيْلِ فَيَطُوفُ بِالْبَيْتِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] berkata, \" [Abdullah bin Umar] sholat zhuhur, ashar, maghrib dan isya' di Muhasshab (daerah dekat Makkah), kemudian masuk ke Makkah pada malam hari, kemudian melaksanakan thawaf di Ka'bah.\""
            },
            {
                "number": 801,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّهُ قَالَ زَعَمُوا أَنَّ عُمَرَ بْنَ الْخَطَّابِكَانَ يَبْعَثُ رِجَالًا يُدْخِلُونَ النَّاسَ مِنْ وَرَاءِ الْعَقَبَةِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] berkata, \"Mereka menyatakan bahwa [Umar bin al Khatthab] mengutus beberapa orang yang memasukkan orang-orang dari belakang Aqabah.\""
            },
            {
                "number": 802,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَلَا يَبِيتَنَّ أَحَدٌ مِنْ الْحَاجِّ لَيَالِيَ مِنًى مِنْ وَرَاءِ الْعَقَبَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa [Umar bin al Khatthab] berkata, \"Jangan sekali-kali seorangpun yang berhaji bermalam di Mina di belakang Aqabah.\""
            },
            {
                "number": 803,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّهُ قَالَ فِي الْبَيْتُوتَةِ بِمَكَّةَ لَيَالِيَ مِنًى لَا يَبِيتَنَّ أَحَدٌ إِلَّا بِمِنًى",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] Bahwasanya ia berkata tentang masalah bermalam di Makkah pada malam Mina, \"Jangan sekali-kali seseorang bermalam kecuali di Mina.\""
            },
            {
                "number": 804,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يَقِفُ عِنْدَ الْجَمْرَتَيْنِ الْأُولَيَيْنِ وُقُوفًا طَوِيلًا يُكَبِّرُ اللَّهَ وَيُسَبِّحُهُ وَيَحْمَدُهُ وَيَدْعُو اللَّهَ وَلَا يَقِفُ عِنْدَ جَمْرَةِ الْعَقَبَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] pernah berdiri lama di dua Jumrah pertama; dia bertakbir, bertasbih, bertahmid dan berdo'a kepada Allah. Dia tidak berhenti pada jumrah Aqabah.\""
            },
            {
                "number": 805,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُكَبِّرُ عِنْدَ رَمْيِ الْجَمْرَةِ كُلَّمَا رَمَى بِحَصَاةٍو حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَمِعَ بَعْضَ أَهْلِ الْعِلْمِ يَقُولُ الْحَصَى الَّتِي يُرْمَى بِهَا الْجِمَارُ مِثْلُ حَصَى الْخَذْفِ قَالَ مَالِك وَأَكْبَرُ مِنْ ذَلِكَ قَلِيلًا أَعْجَبُ إِلَيَّ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] berkata, \"Ketika melempar jumrah, maka setiap kali [Abdullah bin Umar] melemparkan sebuah kerikil, ia selalu mengucapkan takbir.\" Telah menceritakan kepadaku dari Malik bahwa ia mendengar sebagian ahli ilmu berkata, \"Kerikil yang dilempar saat Jumrah itu adalah kerikil kecil.\" Malik berkata, \"Aku lebih suka jika kerikilnya sedikit lebih besar.\""
            },
            {
                "number": 806,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُمَنْ غَرَبَتْ لَهُ الشَّمْسُ مِنْ أَوْسَطِ أَيَّامِ التَّشْرِيقِ وَهُوَ بِمِنًى فَلَا يَنْفِرَنَّ حَتَّى يَرْمِيَ الْجِمَارَ مِنْ الْغَدِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] pernah berkata, \"Barangsiapa mendapati matahari terbenam di pertengahan Hari Tasyriq saat ia masih di Mina, maka janganlah pergi hingga dia melempar Jumrah pada keesokan harinya.\""
            },
            {
                "number": 807,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِأَنَّ النَّاسَ كَانُوا إِذَا رَمَوْا الْجِمَارَ مَشَوْا ذَاهِبِينَ وَرَاجِعِينَ وَأَوَّلُ مَنْ رَكِبَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] berkata, \"Jika orang-orang yang melempar Jumrah, mereka biasa berjalan kaki saat pulang dan pergi. Pertama kali orang yang menggunakan kendaraan adalah [Mu'awiyah bin Abu Sufyan] .\""
            },
            {
                "number": 808,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَأَلَ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ مِنْ أَيْنَ كَانَ الْقَاسِمُ يَرْمِي جَمْرَةَ الْعَقَبَةِفَقَالَ مِنْ حَيْثُ تَيَسَّرَ",
                "id": "Telah menceritakan kepadaku dari Malik Bahwasanya ia bertanya kepada [Abdurrahman bin Al Qasim], \"Dari mana [al Qasim] melempar Jumrah Aqabah?\" dia menjawab, \"Dari mana saja yang terasa mudah baginya.\""
            },
            {
                "number": 809,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُلَا تُرْمَى الْجِمَارُ فِي الْأَيَّامِ الثَّلَاثَةِ حَتَّى تَزُولَ الشَّمْسُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata, \"Jumrah tidak boleh dilempar pada tiga hari tersebut kecuali setelah matahari tergelincir.\""
            },
            {
                "number": 810,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ عَنْ أَبِيهِ أَنَّ أَبَا الْبَدَّاحِ بْنَ عَاصِمِ بْنِ عَدِيٍّ أَخْبَرَهُ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْخَصَ لِرِعَاءِ الْإِبِلِ فِي الْبَيْتُوتَةِ خَارِجِينَ عَنْ مِنًى يَرْمُونَ يَوْمَ النَّحْرِ ثُمَّ يَرْمُونَ الْغَدَ وَمِنْ بَعْدِ الْغَدِ لِيَوْمَيْنِ ثُمَّ يَرْمُونَ يَوْمَ النَّفْرِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdullah bin Abu Bakar bin Hazm] dari [Bapaknya] bahwa [Abu Al Badah bin 'Ashim bin 'Adi] menagabarkan kepadanya, dari [Bapaknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi keringanan kepada penggembala unta untuk bermalam di luar Mina. Sehingga mereka melempar jumrahnya pada hari Nahr, lalu melempar lagi pada keesokan harinya dan setelahnya untuk dua hari, kemudian melempar lagi pada hari Nafar.\" "
            },
            {
                "number": 811,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّهُ سَمِعَهُ يَذْكُرُأَنَّهُ أُرْخِصَ لِلرِّعَاءِ أَنْ يَرْمُوا بِاللَّيْلِ يَقُولُ فِي الزَّمَانِ الْأَوَّلِقَالَ مَالِك تَفْسِيرُ الْحَدِيثِ الَّذِي أَرْخَصَ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِرِعَاءِ الْإِبِلِ فِي تَأْخِيرِ رَمْيِ الْجِمَارِ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ أَنَّهُمْ يَرْمُونَ يَوْمَ النَّحْرِ فَإِذَا مَضَى الْيَوْمُ الَّذِي يَلِي يَوْمَ النَّحْرِ رَمَوْا مِنْ الْغَدِ وَذَلِكَ يَوْمُ النَّفْرِ الْأَوَّلِ فَيَرْمُونَ لِلْيَوْمِ الَّذِي مَضَى ثُمَّ يَرْمُونَ لِيَوْمِهِمْ ذَلِكَ لِأَنَّهُ لَا يَقْضِي أَحَدٌ شَيْئًا حَتَّى يَجِبَ عَلَيْهِ فَإِذَا وَجَبَ عَلَيْهِ وَمَضَى كَانَ الْقَضَاءُ بَعْدَ ذَلِكَ فَإِنْ بَدَا لَهُمْ النَّفْرُ فَقَدْ فَرَغُوا وَإِنْ أَقَامُوا إِلَى الْغَدِ رَمَوْا مَعَ النَّاسِ يَوْمَ النَّفْرِ الْآخِرِ وَنَفَرُوا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari ['Atha bin Abu Rabah] bahwa ia mendengarnya menyebutkan, bahwa para pengembala unta telah diberikan keringanan untuk melempar Jumrah pada malam hari, ia berkata; \"Pada awal-awal waktu.\" Malik berkata; \"Tafsir hadits Rasulullah shallallahu 'alaihi wasallam tentang rukhshah bagi para penggembala unta dalam mengakhirkan lempar Jumrah, menurut kami wallahu a'lam; mereka boleh melempar pada hari penyembelihan. Jika hari-hari setelah Hari Raya sudah berlalu, mereka melempar Jumrah pada keesokan harinya, yaitu pada Hari Nafar Awal. Jadi mereka melempar Jumrah untuk hari-hari sebelumnya, lalu melempar Jumrah untuk hari itu, karena tidaklah seseorang itu mengganti sesuatu kecuali hal yang wajib baginya. Jika ada kewajiban atasnya yang tidak terselesaikan, maka dia harus mengqadla setelahnya. Setelah tiba saat nafar, maka mereka telah selesai. Jika mereka tetap tinggal sampai besok, mereka melempar bersama orang-orang pada hari nafar akhir, setelah itu pergi.\""
            },
            {
                "number": 812,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ عَنْ أَبِيهِ أَنَّ ابْنَةَ أَخٍ لِصَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ نُفِسَتْ بِالْمُزْدَلِفَةِ فَتَخَلَّفَتْ هِيَ وَصَفِيَّةُ حَتَّى أَتَتَا مِنًى بَعْدَ أَنْ غَرَبَتْ الشَّمْسُ مِنْ يَوْمِ النَّحْرِفَأَمَرَهُمَا عَبْدُ اللَّهِ بْنُ عُمَرَ أَنْ تَرْمِيَا الْجَمْرَةَ حِينَ أَتَتَا وَلَمْ يَرَ عَلَيْهِمَا شَيْئًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Bakar bin Nafi'] dari [Bapaknya] bahwa anak perempuan saudara laki-laki Shafiyyah binti Abu Ubaid haid di Muzdalifah, sehingga ia dan Shafiyyah terlambat, mereka tiba di Mina setelah matahari tenggelam pada Hari Nahr. Ketika kedua tiba, [Abdullah bin 'Umar] menyuruhnya untuk melempar jumrah, dan Abdullah bin Umar tidak melihat bermasalah dalam hal itu."
            },
            {
                "number": 813,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ وَعَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِخَطَبَ النَّاسَ بِعَرَفَةَ وَعَلَّمَهُمْ أَمْرَ الْحَجِّ وَقَالَ لَهُمْ فِيمَا قَالَ إِذَا جِئْتُمْ مِنًى فَمَنْ رَمَى الْجَمْرَةَ فَقَدْ حَلَّ لَهُ مَا حَرُمَ عَلَى الْحَاجِّ إِلَّا النِّسَاءَ وَالطِّيبَ لَا يَمَسَّ أَحَدٌ نِسَاءً وَلَا طِيبًا حَتَّى يَطُوفَ بِالْبَيْتِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dan [Abdullah bin Dinar] dari [Abdullah bin 'Umar] bahwa ['Umar bin Khattab] pernah berkhutbah kepada orang-orang di Arafah, ia mengajarkan kepada mereka masalah Haji. Lalu ia berkata kepada mereka dalam salah satu perkataannya, \"Jika kalian tiba dari Mina, maka bagi siapa saja yang telah melempar jumrah, telah halallah baginya apa yang diharamkan bagi orang yang berhaji, kecuali wanita dan minyak wangi. Tidak boleh seorangpun menggauli wanita atau memakai minyak wangi sehingga dia thawaf di Ka'bah.\""
            },
            {
                "number": 814,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ وَعَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَمَنْ رَمَى الْجَمْرَةَ ثُمَّ حَلَقَ أَوْ قَصَّرَ وَنَحَرَ هَدْيًا إِنْ كَانَ مَعَهُ فَقَدْ حَلَّ لَهُ مَا حَرُمَ عَلَيْهِ إِلَّا النِّسَاءَ وَالطِّيبَ حَتَّى يَطُوفَ بِالْبَيْتِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dan [Abdullah bin Dinar] dari [Abdullah bin 'Umar] bahwasanya [Umar bin Al khattab] berkata, \"Barangsiapa telah melempar jumrah, lalu mencukur atau memendekkan rambutnya, serta menyembelih sembelihan jika dia membawanya, maka halal baginya kecuali wanita dan wangi-wangian sehingga dia thawaf di Ka'bah.\""
            },
            {
                "number": 815,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ فَأَهْلَلْنَا بِعُمْرَةٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مَعَهُ هَدْيٌ فَلْيُهْلِلْ بِالْحَجِّ مَعَ الْعُمْرَةِ ثُمَّ لَا يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا قَالَتْ فَقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ فَلَمْ أَطُفْ بِالْبَيْتِ وَلَا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ انْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ قَالَتْ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ هَذَا مَكَانُ عُمْرَتِكِ فَطَافَ الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ حَلُّوا مِنْهَا ثُمَّ طَافُوا طَوَافًا آخَرَ بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى لِحَجِّهِمْ وَأَمَّا الَّذِينَ كَانُوا أَهَلُّوا بِالْحَجِّ أَوْ جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًاو حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ بِمِثْلِ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] dari [Aisyah] Ummul Mukminin, ia berkata, \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam pada tahun terjadinya Haji Wada'. Kami melakukan ihram untuk umrah, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa membawa sembelihan, maka hendaklah ia berihram untuk haji dan umrah, dan dia tidak boleh bertahallul sehingga selesai dari keduanya.' Aisyah berkata; \"Saya tiba di Makkah dalam keadaan haid, padahal saya belum thawaf di Ka'bah ataupun sa'i antara Shafa dan Marwa. Lalu hal itu saya adukan kepada Rasulullah shallallahu 'alaihi wasallam, lantas beliau bersabda: 'Uraikanlah rambutmu dan bersisirlah, lalu berihramlah untuk haji dan tinggalkanlah umrah'.\" Aisyah berkata; \"Aku kemudian melaksanakannya. Tatkala kami telah melakukan haji, Rasulullah shallallahu 'alaihi wasallam mengutusku bersama Abdurrahman bin Abu Bakar ash Shidiq ke Tan'im, lalu saya melakukan umrah.\" Beliau bersabda: \"Ini adalah tempat umrah kamu.\" Orang-orang yang berihram untuk umrah melakukan thawaf di Ka'bah dan sa'i antara Shofa dan Marwa, lalu mereka bertahallul darinya. Kemudian mereka melakukan thawaf lagi untuk haji mereka sekembalinya mereka dari Mina. Sedangkan mereka yang berihram untuk haji saja, atau yang mengumpulkan haji dan umrah, maka cukup dengan satu thawaf.\" Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Urwah bin Az Zubair] dari [Aisyah] seperti di atas."
            },
            {
                "number": 816,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ فَلَمْ أَطُفْ بِالْبَيْتِ وَلَا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ افْعَلِي مَا يَفْعَلُ الْحَاجُّ غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ وَلَا بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى تَطْهُرِي",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] dari [Aisyah] berkata, \"Saat aku tiba di Makkah, aku dalam kondisi haid hingga aku tidak bisa thawaf di Ka'bah ataupun sa'i antara Shafa dan Marwah. Lalu hal itu aku sampaikan kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: 'Kerjakanlah semua yang dilakukan oleh orang yang sedang haji, kecuali thawaf di Ka'bah dan sa'i antara Shafa dan Marwah sehingga kamu suci.\""
            },
            {
                "number": 817,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَأَنَّ صَفِيَّةَ بِنْتَ حُيَيٍّ حَاضَتْ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَابِسَتُنَا هِيَ فَقِيلَ إِنَّهَا قَدْ أَفَاضَتْ فَقَالَ فَلَا إِذًا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Shafiyyah binti Huyyai mengeluarkan darah haid, lalu kau laporkan hal itu kepada Nabi shallallahu 'alaihi wasallam. Beliau bersabda: \"Apakah dia akan menjadi penahan kita?\" lalu ada yang berkata, \"Dia telah melakukan thawaf ifadlah.\" Beliau bersabda: \"Kalau begitu, tidak.\""
            },
            {
                "number": 818,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَأَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ إِنَّ صَفِيَّةَ بِنْتَ حُيَيٍّ قَدْ حَاضَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّهَا تَحْبِسُنَا أَلَمْ تَكُنْ طَافَتْ مَعَكُنَّ بِالْبَيْتِ قُلْنَ بَلَى قَالَ فَاخْرُجْنَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar bin Hazm] dari [Bapaknya] dari [Amrah binti Abdurrahman] dari [Aisyah] Ummul Mukminin ia berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah, Shafiyyah binti Huyyai telah haid! \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia bisa menjadi penghalang kami, tapi bukankah dia telah melaksanakan thawaf di Ka'bah bersama kalian?\" mereka menjawab, \"Ya.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berangkatlah kalian.\""
            },
            {
                "number": 819,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الرِّجَالِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَكَانَتْ إِذَا حَجَّتْ وَمَعَهَا نِسَاءٌ تَخَافُ أَنْ يَحِضْنَ قَدَّمَتْهُنَّ يَوْمَ النَّحْرِ فَأَفَضْنَ فَإِنْ حِضْنَ بَعْدَ ذَلِكَ لَمْ تَنْتَظِرْهُنَّ فَتَنْفِرُ بِهِنَّ وَهُنَّ حُيَّضٌ إِذَا كُنَّ قَدْ أَفَضْنَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Ar Rijal Muhammad bin Abdurrahman] dari [Amrah binti Abdurrahman] berkata, \"Jika [Aisyah] -Ummul Mukminin- berhaji bersama para wanita, ia merasa takut jika mereka haid. Maka ia mendahulukan mereka pada Hari Nahr, hingga bisa melakukan thawaf ifadlah. Jika setelah itu mereka mengalami haid, maka ia tidak menunggu mereka (hingga suci), tapi langsung melakukan thawaf ifadlah sementara mereka dalam keadaan haid. Demikian jika mereka telah melakukan thawaf ifadlah sebelumnya.\""
            },
            {
                "number": 820,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ صَفِيَّةَ بِنْتَ حُيَيٍّ فَقِيلَ لَهُ قَدْ حَاضَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّهَا حَابِسَتُنَا فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ طَافَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا إِذًا قَالَ مَالِك قَالَ هِشَامٌ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ وَنَحْنُ نَذْكُرُ ذَلِكَ فَلِمَ يُقَدِّمُ النَّاسُ نِسَاءَهُمْ إِنْ كَانَ ذَلِكَ لَا يَنْفَعُهُنَّ وَلَوْ كَانَ الَّذِي يَقُولُونَ لَأَصْبَحَ بِمِنًى أَكْثَرُ مِنْ سِتَّةِ آلَافِ امْرَأَةٍ حَائِضٍ كُلُّهُنَّ قَدْ أَفَاضَتْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] Ummul Mukminin, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menanyakan Shafiyyah binti Huyai, lalu ada yang menyampaikan kabar kepada beliau bahwa dia sedang haid. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bisa jadi dia akan menahan kita.\" Mereka berkata, \"Wahai Rasulullah, dia telah melakukan thawaf.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Kalau begitu, tidak.\" Malik berkata; Urwah berkata; Aisyah berkata, \"Kami menyebutkan hal itu, kenapa orang-orang mendahulukan kaum wanita mereka, jika hal itu tidak mendatangkan manfaat kepada mereka. Jika keadaannya sebagaimana yang dikatakan mereka, maka di Mina akan terkumpul jumlah wanita yang lebih banyak dari enam ribu wanita haid, yang semuanya telah melakukan thawaf ifadlah.\""
            },
            {
                "number": 821,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُأَنَّ أُمَّ سُلَيْمٍ بِنْتَ مِلْحَانَ اسْتَفْتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ حَاضَتْ أَوْ وَلَدَتْ بَعْدَمَا أَفَاضَتْ يَوْمَ النَّحْرِ فَأَذِنَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَتْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] dari [Bapaknya] bahwa [Abu Salamah bin Abdurrahman] mengabarkan kepadanya, bahwa Ummu Sulaim binti Milhan meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam karena ia mengalami haid, atau melahirkan anak setelah melaksanakan thawaf pada hari Nahr. Rasulullah shallallahu 'alaihi wasallam lalu mengijinkannya hingga ia pun berangkat.\""
            },
            {
                "number": 822,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزُّبَيْرِ أَنَّ عُمَرَ بْنَ الْخَطَّابِقَضَى فِي الضَّبُعِ بِكَبْشٍ وَفِي الْغَزَالِ بِعَنْزٍ وَفِي الْأَرْنَبِ بِعَنَاقٍ وَفِي الْيَرْبُوعِ بِجَفْرَةٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zubair] berkata, \" [Umar bin Khattab] memutuskan tebusan untuk anjing liar dengan domba jantan, untuk kijang dengan kambing betina, untuk kelinci dengan anak kambing betina yang belum berumur satu tahun dan untuk marmut dengan anak kambing yang berumur empat bulan.\""
            },
            {
                "number": 823,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الْمَلِكِ بْنِ قُرَيْرٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ أَنَّ رَجُلًا جَاءَ إِلَى عُمَرَ بْنِ الْخَطَّابِفَقَالَ إِنِّي أَجْرَيْتُ أَنَا وَصَاحِبٌ لِي فَرَسَيْنِ نَسْتَبِقُ إِلَى ثُغْرَةِ ثَنِيَّةٍ فَأَصَبْنَا ظَبْيًا وَنَحْنُ مُحْرِمَانِ فَمَاذَا تَرَى فَقَالَ عُمَرُ لِرَجُلٍ إِلَى جَنْبِهِ تَعَالَ حَتَّى أَحْكُمَ أَنَا وَأَنْتَ قَالَ فَحَكَمَا عَلَيْهِ بِعَنْزٍ فَوَلَّى الرَّجُلُ وَهُوَ يَقُولُ هَذَا أَمِيرُ الْمُؤْمِنِينَ لَا يَسْتَطِيعُ أَنْ يَحْكُمَ فِي ظَبْيٍ حَتَّى دَعَا رَجُلًا يَحْكُمُ مَعَهُ فَسَمِعَ عُمَرُ قَوْلَ الرَّجُلِ فَدَعَاهُ فَسَأَلَهُ هَلْ تَقْرَأُ سُورَةَ الْمَائِدَةِ قَالَ لَا قَالَ فَهَلْ تَعْرِفُ هَذَا الرَّجُلَ الَّذِي حَكَمَ مَعِي فَقَالَ لَا فَقَالَ لَوْ أَخْبَرْتَنِي أَنَّكَ تَقْرَأُ سُورَةَ الْمَائِدَةِ لَأَوْجَعْتُكَ ضَرْبًا ثُمَّ قَالَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ{ يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِنْكُمْ هَدْيًا بَالِغَ الْكَعْبَةِ }وَهَذَا عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdul Malik bin Qurair] dari [Muhammmad bin Sirin] berkata, \"Seorang laki-laki menemui [Umar bin Khattab] dan bertanya, \"Saya dan sahabatku lomba berpacu dengan dua ekor kuda, lalu kami menambrak kijang, sementara kami dalam keadaan ihram. Lalu apa pendapatmu?\" Umar berkata kepada [seseorang] yang berada di sampingnya, \"Mari kita bermusyawarah untuk menghukumi kejadian tersebut! \" Muhammmad bin Sirin berkata; \"Kemudian keduanya menghukumi mereka dengan membayar denda satu ekor kambing. Penanya tadi pergi sambil berkata, \"Amirul mukminin kok tidak bisa memberi putusan dalam masalah seekor kijang kecuali harus bersama orang lain! \" Umar mendengar ucapan orang tadi, lalu memanggilnya dan bertanya kepadanya, \"Apakah kamu telah membaca Surat Al Maidah?\" laki-laki itu menjawab, \"Tidak.\" Umar bertanya lagi, \"Tahukah kamu siapa laki-laki tadi yang telah bermusyawarah untuk menghukumi kejadian tersebut bersamaku?\" orang tadi menjawab, \"Saya tidak tahu.\" 'Umar bin Khattab berkata; \"Seandainya kamu memberitahuku bahwa kamu telah membaca Surat Al Maidah, niscaya saya akan memukulmu.\" Kemudian Umar berkata, \"Allah Tabaraka Wa Ta'ala berfirman dalam Kitab-Nya: '(Menurut putusan dua orang yang adil di antara kamu sebagai hadyu (ialah: binatang unta, lembu, kambing, biri-biri) yang dibawa ke Ka'bah untuk mendekatkan diri kepada Allah, disembelih di tanah Haram dan dagingnya dihadiahkan kepada fakir miskin dalam rangka ibadat haji) yang dibawa sampai ke Ka'bah) ' -Qs. Al Maidah: 95- Dan orang itu adalah Abdurrahman bin Auf."
            },
            {
                "number": 824,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ أَنَّ أَبَاهُكَانَ يَقُولُ فِي الْبَقَرَةِ مِنْ الْوَحْشِ بَقَرَةٌ وَفِي الشَّاةِ مِنْ الظِّبَاءِ شَاةٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] bahwa [Bapaknya] berkata, \"Tebusan sapi liar adalah seekor sapi, sedang untuk kambing gunung adalah seekor kambing.\""
            },
            {
                "number": 825,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُفِي حَمَامِ مَكَّةَ إِذَا قُتِلَ شَاةٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata, \"(Denda) burung merpati (yang ada) di Makkah, jika di bunuh adalah seekor kambing.\""
            },
            {
                "number": 826,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ أَنَّ رَجُلًا جَاءَ إِلَى عُمَرَ بْنِ الْخَطَّابِفَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي أَصَبْتُ جَرَادَاتٍ بِسَوْطِي وَأَنَا مُحْرِمٌ فَقَالَ لَهُ عُمَرُ أَطْعِمْ قَبْضَةً مِنْ طَعَامٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] bahwa ada seorang laki-laki menemui [Umar bin Khattab] dan bertanya, \"Wahai Amirul Mukminin, saya telah membunuh beberapa belalang dengan cemetiku, padahal saya sedang ihram?\" Umar berkata kepadanya, \"Berilah makan kepada orang miskin segenggam makanan.\""
            },
            {
                "number": 827,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ رَجُلًا جَاءَ إِلَى عُمَرَ بْنِ الْخَطَّابِفَسَأَلَهُ عَنْ جَرَادَاتٍ قَتَلَهَا وَهُوَ مُحْرِمٌ فَقَالَ عُمَرُ لِكَعْبٍ تَعَالَ حَتَّى نَحْكُمَ فَقَالَ كَعْبٌ دِرْهَمٌ فَقَالَ عُمَرُ لِكَعْبٍ إِنَّكَ لَتَجِدُ الدَّرَاهِمَ لَتَمْرَةٌ خَيْرٌ مِنْ جَرَادَةٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \"Seorang laki-laki menemui [Umar bin Khattab] bertanya kepadanya mengenai belalang yang telah dia bunuh, sedang dia dalam keadaan ihram. Umar berkata kepada Ka'ab, \"Mari menghukumi kejadian tersebut bersama! \" Ka'ab berkata, \"(Dendanya) satu dirham, \" Umar berkata kepada Ka'ab, \"Bagimu mudah sekali mendapatkan dirham, padahal kurma sudah lebih dari cukup untuk tebusan belalang.\""
            },
            {
                "number": 828,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ الْكَرِيمِ بْنِ مَالِكٍ الْجَزَرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَأَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُحْرِمًا فَآذَاهُ الْقَمْلُ فِي رَأْسِهِ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَحْلِقَ رَأْسَهُ وَقَالَ صُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ مُدَّيْنِ مُدَّيْنِ لِكُلِّ إِنْسَانٍ أَوْ انْسُكْ بِشَاةٍ أَيَّ ذَلِكَ فَعَلْتَ أَجْزَأَ عَنْكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdul Karim bin Malik Al Jazari] dari [Abdurrahman bin Abu Laila] dari [Ka'ab bin Ujrah] bahwa dia pernah bersama Rasulullah shallallahu 'alaihi wasallam ketika sedang ihram, lalu ia merasa sangat terganggu dengan kutu yang ada di kepalanya. Rasulullah shallallahu 'alaihi wasallam lantas menyuruhnya untuk memotong rambutnya, beliau bersabda: \"Berpuasalah tiga hari atau berilah makan pada enam orang miskin dua mud dua mud tiap orang, atau sembelihlah kambing. Mana saja yang kamu lakukan, maka itu telah cukup bagimu.\""
            },
            {
                "number": 829,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ حُمَيْدِ بْنِ قَيْسٍ عَنْ مُجَاهِدٍ أَبِي الْحَجَّاجِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ لَعَلَّكَ آذَاكَ هَوَامُّكَ فَقُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْلِقْ رَأْسَكَ وَصُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ أَوْ انْسُكْ بِشَاةٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Humaid bin Qais] dari [Mujahid Abu Al Hajjaj] dari [Ibnu Abu Laila] dari [Ka'ab bin Ujrah] bahwa Rasululah shallallahu 'alaihi wasallam bersabda kepadanya: \"Barangkali kutu-kutumu itu telah mengganggumu, \" saya menjawab; \"Benar wahai Rasulullah! \" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Potonglah rambutmu lalu puasalah tiga hari, atau berilah makan kepada enam orang miskin, atau sembelilah seekor kambing\""
            },
            {
                "number": 830,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَطَاءِ بْنِ عَبْدِ اللَّهِ الْخُرَاسَانِيِّ أَنَّهُ قَالَ حَدَّثَنِي شَيْخٌ بِسُوقِ الْبُرَمِ بِالْكُوفَةِ عَنْ كَعْبِ بْنِ عُجْرَةَ أَنَّهُ قَالَجَاءَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَنْفُخُ تَحْتَ قِدْرٍ لِأَصْحَابِي وَقَدْ امْتَلَأَ رَأْسِي وَلِحْيَتِي قَمْلًا فَأَخَذَ بِجَبْهَتِي ثُمَّ قَالَ احْلِقْ هَذَا الشَّعَرَ وَصُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ وَقَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِمَ أَنَّهُ لَيْسَ عِنْدِي مَا أَنْسُكُ بِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari ['Atha bin Abdullah Al Khurasani] berkata, telah menceritakan kepadaku [Seorang syaikh] -di pasar Al Buram, Kufah- dari [Ka'ab bin Ujrah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemuiku, saat itu saya sedang meniup api di bawah periuk (memasak) untuk para sahabatku, rambut dan jenggotku penuh dengan kutu, lalu kutu tersebut mulai memenuhi dahiku, lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Potonglah rambut itu, lalu berpuasalah tiga hari atau berilah makan pada enam orang miskin.\" Rasulullah shallallahu 'alaihi wasallam telah mengetahui bahwa aku tidak mempunyai sesuatu untuk menebus denda.\""
            },
            {
                "number": 831,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَمَنْ نَسِيَ مِنْ نُسُكِهِ شَيْئًا أَوْ تَرَكَهُ فَلْيُهْرِقْ دَمًاقَالَ أَيُّوبُ لَا أَدْرِي قَالَ تَرَكَ أَوْ نَسِيَ قَالَ مَالِك مَا كَانَ مِنْ ذَلِكَ هَدْيًا فَلَا يَكُونُ إِلَّا بِمَكَّةَ وَمَا كَانَ مِنْ ذَلِكَ نُسُكًا فَهُوَ يَكُونُ حَيْثُ أَحَبَّ صَاحِبُ النُّسُكِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ayyub bin Abu Tamimah As Sakhtiyani] dari [Sa'id bin Jubair] dari [Abdullah bin Abbas] ia berkata, \"Barangsiapa melalaikan salah satu bagian dari ibadah hajinya atau meninggalkannya, maka ia harus menyembelih seekor kambing.\" Ayyub berkata, \"Saya tidak tahu apakah Rasulullah shallallahu 'alaihi wasallam bersabda: \"melalaikan\" ataukah \"meninggalkan.\" Malik berkata, \"Tebusan yang berupa sembelihan, maka tidak boleh dilakukan kecuali di kota Makkah. Dan tebusan untuk yang lainnya sesuai dengan keinginan pelaku (yang mengamalkan ibadah) .\""
            },
            {
                "number": 832,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّهُ قَالَوَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلنَّاسِ بِمِنًى وَالنَّاسُ يَسْأَلُونَهُ فَجَاءَهُ رَجُلٌ فَقَالَ لَهُ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَنْحَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْحَرْ وَلَا حَرَجَ ثُمَّ جَاءَهُ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ قَالَ ارْمِ وَلَا حَرَجَ قَالَ فَمَا سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَيْءٍ قُدِّمَ وَلَا أُخِّرَ إِلَّا قَالَ افْعَلْ وَلَا حَرَجَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Isa bin Thalhah] dari [Abdullah bin 'Amru bin Al 'Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam wukuf di Mina bersama orang-orang, sementara orang-orang bertanya kepada beliau. Tiba-tiba datang seorang laki-laki dan berkata, 'Wahai Rasulullah! Saya tidak sengaja telah bertahallul sebelum menyembelih sembelihan.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sembelihlah dan tidak akan ada masalah bagimu.' Kemudian datang laki-laki lain dan berkata, \"Wahai Rasulullah, saya tidak sengaja telah menyembelih sebelum melempar Jumrah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: 'Lemparlah Jumrah dan tidak akan ada masalah bagimu.' Abdullah bin 'Amru berkata, \"Tidaklah Rasulullah shallallahu 'alaihi wasallam ditanya tentang sesuatu yang diawalkan atau di akhirkan kecuali beliau menjawab: \"Lakukanlah dan tidak akan ada masalah bagimu.\""
            },
            {
                "number": 833,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنْ الْأَرْضِ ثَلَاثَ تَكْبِيرَاتٍ ثُمَّ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam kembali dari peperangan, haji atau umrah, beliau mengucapkan takbir di setiap tempat yang tinggi sebanyak tiga kali kemudian membaca: \"Tidak ada Ilah selain Allah, Yang Maha Esa, yang tidak ada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dia berkuasa atas segala sesuatu. Kita berserah diri, bertaubat, beribadah, bersujud kepada Rabb kita dengan terus memuji-Nya, Allah akan menepati janji-Nya, dan menolong hamba-Nya dan mengalahkan golongan-golongan kafir dengan kekuatan-Nya.\""
            },
            {
                "number": 834,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِامْرَأَةٍ وَهِيَ فِي مِحَفَّتِهَا فَقِيلَ لَهَا هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَتْ بِضَبْعَيْ صَبِيٍّ كَانَ مَعَهَا فَقَالَتْ أَلِهَذَا حَجٌّ يَا رَسُولَ اللَّهِ قَالَ نَعَمْ وَلَكِ أَجْرٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibrahim bin Uqbah] dari [Kuraib] mantan budak Abdullah bin 'Abbas, dari [Ibnu 'Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam melewati seorang wanita yang sedang berada di dalam sekedupnya, lalu dikatakan kepada wanita itu, \"Ini adalah Rasulullah shallallahu 'alaihi wasallam.\" Wanita itu lantas memegang kedua lengan anak kecil yang bersamanya, lalu ia bertanya, \"Apakah ada kewajiban haji untuk anak kecil ini wahai Rasulullah?\" beliau menjawab: \"Ya, dan engkau akan mendapatkan pahala.\""
            },
            {
                "number": 835,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا رُئِيَ الشَّيْطَانُ يَوْمًا هُوَ فِيهِ أَصْغَرُ وَلَا أَدْحَرُ وَلَا أَحْقَرُ وَلَا أَغْيَظُ مِنْهُ فِي يَوْمِ عَرَفَةَ وَمَا ذَاكَ إِلَّا لِمَا رَأَى مِنْ تَنَزُّلِ الرَّحْمَةِ وَتَجَاوُزِ اللَّهِ عَنْ الذُّنُوبِ الْعِظَامِ إِلَّا مَا أُرِيَ يَوْمَ بَدْرٍ قِيلَ وَمَا رَأَى يَوْمَ بَدْرٍ يَا رَسُولَ اللَّهِ قَالَ أَمَا إِنَّهُ قَدْ رَأَى جِبْرِيلَ يَزَعُ الْمَلَائِكَةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibrahim bin Abu 'Ablah bin 'ubaidhullah bin Kariz] dari [Thalhah bin Ubaidillah bin Kariz] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak sehari pun setan terlihat lebih kerdil, lebih buruk, lebih hina, dan lebih marah kecuali pada hari Arafah. Hal itu karena dia melihat turunnya rahmat Allah dan terhapusnya dosa-dosa besar kecuali apa yang diperlihatkan pada hari Badar.\" Ada yang bertanya, \"Apa yang setan lihat pada hari Badar, Wahai Rasulullah?\" beliau menjawab: \"Dia telah melihat Jibril sedang mengatur barisan para Malaikat.\""
            },
            {
                "number": 836,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زِيَادِ بْنِ أَبِي زِيَادٍ مَوْلَى عَبْدِ اللَّهِ بْنِ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفْضَلُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ وَأَفْضَلُ مَا قُلْتُ أَنَا وَالنَّبِيُّونَ مِنْ قَبْلِي لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ziyad bin Abu Ziyad] mantan budak Abdullah bin 'Ayyas bin Abu Rabi'ah, dari [Thalhah bin ubaidhullah bin Kariz] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Do'a yang paling utama adalah do'a pada hari Arafah, dan do'a paling afdlal yang pernah aku dan para nabi sebelumku adalah: \"LAA ILAAHA ILLALLAH WAHDAHU LAA SYARIIKA LAHU' (Tidak ada Tuhan selain Allah Yang Maha Esa tidak ada sekutu bagi-Nya) .\""
            },
            {
                "number": 837,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ فَقَالَ لَهُ يَا رَسُولَ اللَّهِ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتُلُوهُقَالَ مَالِك وَلَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ مُحْرِمًا وَاللَّهُ أَعْلَمُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam masuk Makkah saat penaklukan, sementara pada kepalanya terdapat penutup sebagai pelindung. Tatkala beliau melepaskannya, ada seorang laki-laki datang kepada beliau dan berkata, \"Wahai Rasulullah, Ibnu Khathal terikat di tirai Ka'bah! \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bunuhlah.\" Malik berkata, \"Rasulullah shallallahu 'alaihi wasallam waktu itu tidak dalam keadaan ihram. Wallahu A'lam.\""
            },
            {
                "number": 838,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَأَقْبَلَ مِنْ مَكَّةَ حَتَّى إِذَا كَانَ بِقُدَيْدٍ جَاءَهُ خَبَرٌ مِنْ الْمَدِينَةِ فَرَجَعَ فَدَخَلَ مَكَّةَ بِغَيْرِ إِحْرَامٍو حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ بِمِثْلِ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] pulang dari Makkah hingga saat di Qudaid, ada sebuah berita yang datang dari Madinah, maka beliau memutuskan untuk kembali ke Makkah tanpa berihram.\" Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] seperti di atas."
            },
            {
                "number": 839,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدِّيلِيِّ عَنْ مُحَمَّدِ بْنِ عِمْرَانَ الْأَنْصَارِيِّ عَنْ أَبِيهِ أَنَّهُ قَالَ عَدَلَ إِلَيَّ عَبْدُ اللَّهِ بْنُ عُمَرَوَأَنَا نَازِلٌ تَحْتَ سَرْحَةٍ بِطَرِيقِ مَكَّةَ فَقَالَ مَا أَنْزَلَكَ تَحْتَ هَذِهِ السَّرْحَةِ فَقُلْتُ أَرَدْتُ ظِلَّهَا فَقَالَ هَلْ غَيْرُ ذَلِكَ فَقُلْتُ لَا مَا أَنْزَلَنِي إِلَّا ذَلِكَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنْتَ بَيْنَ الْأَخْشَبَيْنِ مِنْ مِنًى وَنَفَخَ بِيَدِهِ نَحْوَ الْمَشْرِقِ فَإِنَّ هُنَاكَ وَادِيًا يُقَالُ لَهُ السِّرَرُ بِهِ شَجَرَةٌ سُرَّ تَحْتَهَا سَبْعُونَ نَبِيًّا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Muhammad bin 'Amru bin Halhalah Ad-Dili] dari [Muhammad bin Imran Al Anshari] dari [Bapaknya] ia berkata, \" [Abdullah bin Umar] pernah berpaling kepadaku tatkala saya turun untuk berteduh di bawah pohon yang tinggi di jalanan kota Makkah. Dia bertanya, \"Apa yang membuatmu turun di bawah pohon ini?\" Saya menjawab, \"Saya ingin berteduh.\" Dia bertanya lagi, \"Apakah ada tujuan lain selain itu?\" Saya menjawab, \"Tidak ada. Saya tidak turun kecuali hanya untuk itu.\" Abdullah bin Umar lantas berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah bersabda: Apabila kamu berada di antara dua bukit di lembah Mina -seraya memberi isyaratdengan tangannya ke arah timur- maka di sana ada sebuah lembah yang bernama As Sirar, di sana terdapat sebuah pohon yang membuat senang tujuh puluh Nabi ketika berteduh di bawahnya'.\""
            },
            {
                "number": 840,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ أَنَّ عُمَرَ بْنَ الْخَطَّابِمَرَّ بِامْرَأَةٍ مَجْذُومَةٍ وَهِيَ تَطُوفُ بِالْبَيْتِ فَقَالَ لَهَا يَا أَمَةَ اللَّهِ لَا تُؤْذِي النَّاسَ لَوْ جَلَسْتِ فِي بَيْتِكِ فَجَلَسَتْ فَمَرَّ بِهَا رَجُلٌ بَعْدَ ذَلِكَ فَقَالَ لَهَا إِنَّ الَّذِي كَانَ قَدْ نَهَاكِ قَدْ مَاتَ فَاخْرُجِي فَقَالَتْ مَا كُنْتُ لِأُطِيعَهُ حَيًّا وَأَعْصِيَهُ مَيِّتًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar bin Hazm] dari [Ibnu Abu Mulaikah] berkata, \" [Umar bin Khattab] melewati seorang wanita yang terkena penyakit kusta, wanita tersebut sedang thawaf di Ka'bah. 'Umar berkata kepadanya, \"Wahai hamba Allah, jangan kamu membuat manusia merasa terganggu. Seandainya kamu duduk di rumahmu (maka hal itu lebih baik bagimu) .\" Maka wanita itu pun berdiam diri di dalam rumah. Setelah itu ada seorang laki-laki melewatinya dan berkata kepadanya, \"Orang yang telah melarangmu sekarang telah wafat, maka keluarlah kamu (untuk haji) .\" Wanita itu lantas berkata, \"Aku tidak ingin mentaati seseorang di masa hidupnya, lalu mendurhakainya saat ia telah tiada.\""
            },
            {
                "number": 841,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ أَنَّهُ سَمِعَهُ يَذْكُرُ أَنَّ رَجُلًا مَرَّ عَلَى أَبِي ذَرٍّ بِالرَّبَذَةِوَأَنَّ أَبَا ذَرٍّ سَأَلَهُ أَيْنَ تُرِيدُ فَقَالَ أَرَدْتُ الْحَجَّ فَقَالَ هَلْ نَزَعَكَ غَيْرُهُ فَقَالَ لَا قَالَ فَأْتَنِفْ الْعَمَلَ قَالَ الرَّجُلُ فَخَرَجْتُ حَتَّى قَدِمْتُ مَكَّةَ فَمَكَثْتُ مَا شَاءَ اللَّهُ ثُمَّ إِذَا أَنَا بِالنَّاسِ مُنْقَصِفِينَ عَلَى رَجُلٍ فَضَاغَطْتُ عَلَيْهِ النَّاسَ فَإِذَا أَنَا بِالشَّيْخِ الَّذِي وَجَدْتُ بِالرَّبَذَةِ يَعْنِي أَبَا ذَرٍّ قَالَ فَلَمَّا رَآنِي عَرَفَنِي فَقَالَ هُوَ الَّذِي حَدَّثْتُكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] Bahwasanya ia pernah mendengarnya menyebut, bahwa ada [seorang laki-laki] lewat di depan Abu Dzar di daerah Rabadzah. [Abu Dzar] bertanya kepadanya, \"Kamu hendak ke mana?\" laki-laki itu menjawab, \"Saya hendak menunaikan haji.\" Abu Dzar bertanya lagi, \"Apakah ada yang menghalangimu selain itu?\" laki-laki itu menjawab, \"Tidak ada.\" Abu Dzar berkata, \"Laksanakanlah amalanmu itu.\" Laki-laki itu berkata, \"Lalu aku berangkat hingga ketika sampai di Makkah, aku menetap di sana sampai waktu yang tidak menentu. Tatkala aku berkumpul dan berdesak-desakkan bersama orang-orang pada seorang laki-laki. Ternyata saya mendapati seorang yang sudah tua yang saya lihat di daerah Rabadzah. Yaitu Abu Dzarr.\" Laki-laki itu berkata, \"Saat melihat, ia pun langsung mengenaliku. Ia lalu berkata, \"Inilah orang yang saya ceritakan kepadamu.\""
            },
            {
                "number": 842,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَأَلَ ابْنَ شِهَابٍعَنْ الْاسْتِثْنَاءِ فِي الْحَجِّ فَقَالَ أَوَ يَصْنَعُ ذَلِكَ أَحَدٌ وَأَنْكَرَ ذَلِكَسُئِلَ مَالِك هَلْ يَحْتَشُّ الرَّجُلُ لِدَابَّتِهِ مِنْ الْحَرَمِ فَقَالَ لَا",
                "id": "Telah menceritakan kepadaku dari Malik Bahwasanya ia bertanya kepada [Ibnu Syihab] tentang pengecualian yang ada dalam ibadah haji. Ibnu Abbas lalu menjawab, \"Apakah ada seseorang yang melakukan hal itu dan dia mengingkari?\" Malik ditanya, \"Apakah boleh seorang mencabut rumput dari tanah suci untuk binatang ternaknya?\" dia menjawab, \"Tidak boleh.\""
            },
            {
                "number": 843,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا كَانَتْ تَقُولُالصِّيَامُ لِمَنْ تَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ لِمَنْ لَمْ يَجِدْ هَدْيًا مَا بَيْنَ أَنْ يُهِلَّ بِالْحَجِّ إِلَى يَوْمِ عَرَفَةَ فَإِنْ لَمْ يَصُمْ صَامَ أَيَّامَ مِنًىو حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ كَانَ يَقُولُ فِي ذَلِكَ مِثْلَ قَوْلِ عَائِشَةَ رَضِيَ اللَّهُ تَعَالَى عَنْهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Urwah bin Zubair] dari [Aisyah] Ummul Mukminin, ia berkata, \"Puasa itu bagi orang yang haji tamattu'; dengan umrah lalu berhaji, dan tidak mendapatkan hewan sembelihan antara waktu bertahallul haji sampai waktu 'Arafah. Jika dia belum berpuasa, dia harus berpuasa pada waktu di Mina.\" Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Abdullah bin 'Umar] berkata dalam masalah itu sebagaimana perkataan Aisyah radliallahu 'anha."
            },
            {
                "number": 844,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَثَلُ الْمُجَاهِدِ فِي سَبِيلِ اللَّهِ كَمَثَلِ الصَّائِمِ الْقَائِمِ الدَّائِمِ الَّذِي لَا يَفْتُرُ مِنْ صَلَاةٍ وَلَا صِيَامٍ حَتَّى يَرْجِعَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan mujahid yang berperang di jalan Allah, seperti orang yang berpuasa dan sholat; ia tidak buka dari puasanya dan tidak berhenti dari sholat hingga ia kembali (perang) .\""
            },
            {
                "number": 845,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَكَفَّلَ اللَّهُ لِمَنْ جَاهَدَ فِي سَبِيلِهِ لَا يُخْرِجُهُ مِنْ بَيْتِهِ إِلَّا الْجِهَادُ فِي سَبِيلِهِ وَتَصْدِيقُ كَلِمَاتِهِ أَنْ يُدْخِلَهُ الْجَنَّةَ أَوْ يَرُدَّهُ إِلَى مَسْكَنِهِ الَّذِي خَرَجَ مِنْهُ مَعَ مَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menjamin orang yang berjihad di jalan-Nya; ia tidak keluar dari rumahnya kecuali berjihad di jalan-Nya dan membenarkan kalimat-Nya, untuk memasukkannya ke dalam surga. Atau mengembalikannya ke tempat asalnya saat ia berangkat dengan memperoleh dan atau ghanimah.\""
            },
            {
                "number": 846,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَيْلُ لِرَجُلٍ أَجْرٌ وَلِرَجُلٍ سِتْرٌ وَعَلَى رَجُلٍ وِزْرٌ فَأَمَّا الَّذِي هِيَ لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ فَأَطَالَ لَهَا فِي مَرْجٍ أَوْ رَوْضَةٍ فَمَا أَصَابَتْ فِي طِيَلِهَا ذَلِكَ مِنْ الْمَرْجِ أَوْ الرَّوْضَةِ كَانَ لَهُ حَسَنَاتٌ وَلَوْ أَنَّهَا قُطِعَتْ طِيَلَهَا ذَلِكَ فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كَانَتْ آثَارُهَا وَأَرْوَاثُهَا حَسَنَاتٍ لَهُ وَلَوْ أَنَّهَا مَرَّتْ بِنَهَرٍ فَشَرِبَتْ مِنْهُ وَلَمْ يُرِدْ أَنْ يَسْقِيَ بِهِ كَانَ ذَلِكَ لَهُ حَسَنَاتٍ فَهِيَ لَهُ أَجْرٌ وَرَجُلٌ رَبَطَهَا تَغَنِّيًا وَتَعَفُّفًا وَلَمْ يَنْسَ حَقَّ اللَّهِ فِي رِقَابِهَا وَلَا فِي ظُهُورِهَا فَهِيَ لِذَلِكَ سِتْرٌ وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِيَاءً وَنِوَاءً لِأَهْلِ الْإِسْلَامِ فَهِيَ عَلَى ذَلِكَ وِزْرٌ وَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحُمُرِ فَقَالَ لَمْ يُنْزَلْ عَلَيَّ فِيهَا شَيْءٌ إِلَّا هَذِهِ الْآيَةُ الْجَامِعَةُ الْفَاذَّةُ{ فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ }",
                "id": "Telah menceritakan kepadaku dari dari Malik dari [Zaid bin Aslam] dari [Abu Shalih As Samman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kuda bagi seorang laki-laki bisa menjadi pahala, bagi laki-laki lain bisa menjadi penutup, dan bagi laki-laki lain bisa menjadi dosa. Adapun kuda yang mendatangkan pahala adalah; seorang laki-laki membawa kudanya di jalan Allah, lalu ia membiarkannya di padang rumput atau di sebuah taman yang indah. Maka apapun yang menempel pada kuda tersebut dalam pengembalaannya di padang rumput, atau taman tersebut, maka pemiliknya akan mendapatkan kebaikan. Seandainya kuda tersebut terputus dari pengembalaannya kemudian dia terus mengikuti jejak melalui tempat-tempat yang tinggi, maka jejak-jejak dan kotoran-kotoran kudanya itu akan dibalas dengan kebaikan-kebaikan. Seandainya kuda tersebut melewati sebuah sungai lalu meminum airnya, sedang pemiliknya tidak menghendakinya minum, maka itu akan menjadi kebaikan-kebaikan bagi dirinya, dan semuanya itu menjadi pahala bagi pemiliknya. Sedangkan orang yang telah mengikat kudanya karena dia ingin menjauhkan dari ketergantungan dari manusia dan menjaga diri dari dosa, dengan tidak melupakan hak Allah di dalam leher-lehernya atau punggung-punggungnya, maka hal itu menjadi penutup. Adapun seseorang yang telah mengikat kudanya karena perasaan bangga, riya' dan menentang kepada orang Islam maka baginya dosa.\" Rasulullah shallallahu 'alaihi wasallam ditanya tentang keledai, maka beliau menjawab: \"Belum turun kepadaku sesuatu pun tentang itu kecuali hanya ayat yang global ini, yaitu ayat: '(Barangsiapa yang beramal kebaikan sebesar biji sawi maka dia akan melihatnya kelak. Dan barangsiapa yang beramal kejelekan sebesar biji sawi maka dia juga akan melihatnya kelak) '. (Qs. Az Zalzalah: 7-8) \""
            },
            {
                "number": 847,
                "arab": "و حَدَّثَنِي عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ الْأَنْصَارِيِّ عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِخَيْرِ النَّاسِ مَنْزِلًا رَجُلٌ آخِذٌ بِعِنَانِ فَرَسِهِ يُجَاهِدُ فِي سَبِيلِ اللَّهِ أَلَا أُخْبِرُكُمْ بِخَيْرِ النَّاسِ مَنْزِلًا بَعْدَهُ رَجُلٌ مُعْتَزِلٌ فِي غُنَيْمَتِهِ يُقِيمُ الصَّلَاةَ وَيُؤْتِي الزَّكَاةَ وَيَعْبُدُ اللَّهَ لَا يُشْرِكُ بِهِ شَيْئًا",
                "id": "Telah menceritakan kepadaku dari [Abdullah bin Abdurrahman bin Ma'mar Al Anshari] dari ['Atha bin Yasar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah saya beritahukan kepada kalian tentang manusia yang paling bagus kedudukannya? Yaitu seseorang yang memegang tali kekang kuda untuk berjihad di jalan Allah. Maukah saya beritahukan kepada kalian tentang manusia yang paling bagus kedudukannya setelah itu? Yaitu seseorang yang berdiam di tempat kesendiriannya, ia senantiasa sholat malam, menunaikan zakat serta beribadah kepada Allah dengan tidak menyekutukan-Nya dengan sesuatu pun.\""
            },
            {
                "number": 848,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ أَخْبَرَنِي عُبَادَةُ بْنُ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَبَايَعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْيُسْرِ وَالْعُسْرِ وَالْمَنْشَطِ وَالْمَكْرَهِ وَأَنْ لَا نُنَازِعَ الْأَمْرَ أَهْلَهُ وَأَنْ نَقُولَ أَوْ نَقُومَ بِالْحَقِّ حَيْثُمَا كُنَّا لَا نَخَافُ فِي اللَّهِ لَوْمَةَ لَائِمٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, telah mengabarkan kepadaku ['Ubadaah bin Al Walid bin Ubadah bin Ash-Shamit] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Kami telah berbai'at kepada Rasulullah shallallahu 'alaihi wasallam untuk selalu mendengar dan taat, baik pada waktu mudah ataupun sulit, dalam keadaan semangat ataupun terpaksa, untuk tidak menentang pemerintahnya, serta selalu berkata atau menegakkan kebenaran di mana pun kami berada, untuk tidak takut dalam menegakkan urusan karena Allah meskipun mendapat celaan.\""
            },
            {
                "number": 849,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ قَالَ كَتَبَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ إِلَى عُمَرَ بْنِ الْخَطَّابِيَذْكُرُ لَهُ جُمُوعًا مِنْ الرُّومِ وَمَا يَتَخَوَّفُ مِنْهُمْ فَكَتَبَ إِلَيْهِ عُمَرُ بْنُ الْخَطَّابِ أَمَّا بَعْدُ فَإِنَّهُ مَهْمَا يَنْزِلْ بِعَبْدٍ مُؤْمِنٍ مِنْ مُنْزَلِ شِدَّةٍ يَجْعَلْ اللَّهُ بَعْدَهُ فَرَجًا وَإِنَّهُ لَنْ يَغْلِبَ عُسْرٌ يُسْرَيْنِ وَأَنَّ اللَّهَ تَعَالَى يَقُولُ فِي كِتَابِهِ{ يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ }",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] berkata; \"Abu Ubaidah bin Al Jarrah menulis surat kepada Umar bin Al Khattab tentang jumlah pasukan Ramawi dan ketakutan (kaum muslimin) terhadap mereka. Lalu [Umar bin Khattab] membalas kepadanya; \"Amma ba'du: Sekiranya turun penderitaan kepada seorang hamba yang beriman, niscaya Allah akan menjadikan kemudahan setelah itu. Sesungguhnya satu kesulitan tidak akan bisa mengalahkan dua kemudahan, Allah berfirman dalam kitab-Nya: '(Hai orang-orang yang beriman, Bersabarlah kamu dan kuatkanlah kesabaranmu dan tetaplah bersiap siaga (di perbatasan negerimu) dan bertaqwalah kepada Allah, supaya kamu beruntung) ' (Qs. Ali Imran: 200)"
            },
            {
                "number": 850,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّقَالَ مَالِك وَإِنَّمَا ذَلِكَ مَخَافَةَ أَنْ يَنَالَهُ الْعَدُوُّ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang bepergian dengan membawa al-qur'an ke tempat musuh.\" Malik berkata; \"Yang demikian itu dikhawatirkan bahwa musuh akan mengambilnya.\""
            },
            {
                "number": 851,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ ابْنٍ لِكَعْبِ بْنِ مَالِكٍ قَالَ حَسِبْتُ أَنَّهُ قَالَ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ أَنَّهُ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِينَ قَتَلُوا ابْنَ أَبِي الْحُقَيْقِ عَنْ قَتْلِ النِّسَاءِ وَالْوِلْدَانِ قَالَ فَكَانَ رَجُلٌ مِنْهُمْ يَقُولُ بَرَّحَتْ بِنَا امْرَأَةُ ابْنِ أَبِي الْحُقَيْقِ بِالصِّيَاحِ فَأَرْفَعُ السَّيْفَ عَلَيْهَا ثُمَّ أَذْكُرُ نَهْيَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكُفُّ وَلَوْلَا ذَلِكَ اسْتَرَحْنَا مِنْهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [salah seorang anak Ka'ab bin Malik] berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang orang-orang yang telah membunuh Ibnu Abu Al Huqaiq untuk membunuh wanita dan anak-anak.\" 'Abdurrahman berkata; \"Salah seorang dari mereka berkata, \"Isteri Ibnu Abu Al Huqaiq telah menyusahkan kita dengan teriakannya, aku lalu mengangkat pedangku untuk membunuhnya, namun aku teringat dengan larangan Rasulullah shallallahu 'alaihi wasallam. Maka aku pun mengurungkan niatku. Seandainya tidak ada larangan itu niscaya aku akan membunuhnya.\""
            },
            {
                "number": 852,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي بَعْضِ مَغَازِيهِ امْرَأَةً مَقْتُولَةً فَأَنْكَرَ ذَلِكَ وَنَهَى عَنْ قَتْلِ النِّسَاءِ وَالصِّبْيَانِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Ibnu 'Umar] berkata, \"Pada sebagian peperangannya, Rasulullah shallallahu 'alaihi wasallam melihat wanita (terbunuh), lalu beliau mengingkari hal tersebut. kemudian beliau melarang membunuh kaum wanita dan anak-anak."
            },
            {
                "number": 853,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَبَعَثَ جُيُوشًا إِلَى الشَّامِ فَخَرَجَ يَمْشِي مَعَ يَزِيدَ بْنِ أَبِي سُفْيَانَ وَكَانَ أَمِيرَ رُبْعٍ مِنْ تِلْكَ الْأَرْبَاعِ فَزَعَمُوا أَنَّ يَزِيدَ قَالَ لِأَبِي بَكْرٍ إِمَّا أَنْ تَرْكَبَ وَإِمَّا أَنْ أَنْزِلَ فَقَالَ أَبُو بَكْرٍ مَا أَنْتَ بِنَازِلٍ وَمَا أَنَا بِرَاكِبٍ إِنِّي أَحْتَسِبُ خُطَايَ هَذِهِ فِي سَبِيلِ اللَّهِ ثُمَّ قَالَ لَهُ إِنَّكَ سَتَجِدُ قَوْمًا زَعَمُوا أَنَّهُمْ حَبَّسُوا أَنْفُسَهُمْ لِلَّهِ فَذَرْهُمْ وَمَا زَعَمُوا أَنَّهُمْ حَبَّسُوا أَنْفُسَهُمْ لَهُ وَسَتَجِدُ قَوْمًا فَحَصُوا عَنْ أَوْسَاطِ رُءُوسِهِمْ مِنْ الشَّعَرِ فَاضْرِبْ مَا فَحَصُوا عَنْهُ بِالسَّيْفِ وَإِنِّي مُوصِيكَ بِعَشْرٍ لَا تَقْتُلَنَّ امْرَأَةً وَلَا صَبِيًّا وَلَا كَبِيرًا هَرِمًا وَلَا تَقْطَعَنَّ شَجَرًا مُثْمِرًا وَلَا تُخَرِّبَنَّ عَامِرًا وَلَا تَعْقِرَنَّ شَاةً وَلَا بَعِيرًا إِلَّا لِمَأْكَلَةٍ وَلَا تَحْرِقَنَّ نَحْلًا وَلَا تُغَرِّقَنَّهُ وَلَا تَغْلُلْ وَلَا تَجْبُنْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Abu Bakar Ash Shiddiq] mengirim pasukan ke negeri Syam, lalu dia ikut keluar bersama Yazid bin Abu Sufyan yang saat itu memimpin seperempat dari tentara tersebut. Orang-orang berkeyakinan bahwa Yazid pernah berkata kepada Abu Bakar, \"Engkau naik, atau aku yang turun.\" Abu Bakar berkata; \"Janganlah kamu turun agar saya mengendarai kendaraan. Saya telah meniatkan langkah-langkahku ini hanya di jalan Allah.\" Kemudian Abu Bakar berkata kepadanya; \"Kalian akan mendapatkan suatu kaum yang mengklaim bahwa mereka telah menahan dirinya untuk Allah, maka jauhilah mereka dan apa yang mereka sangkakan. Kamu juga akan mendapatkan suatu kaum yang menggunduli bagian tengah kepala mereka, maka pukullah apa yang mereka cukur tersebut dengan pedang. Sungguh saya berwasiat kepadamu dengan sepuluh perkara: jangan sekali-kali kamu membunuh wanita, anak-anak dan orang yang sudah tua. Jangan memotong pohon yang sedang berbuah, jangan merobohkan bangunan, jangan menyembelih kambing ataupun unta kecuali hanya untuk dimakan, jangan membakar pohon kurma atau menenggelamkannya. Dan janganlah berbuat ghulul atau menjadi seorang yang penakut.\""
            },
            {
                "number": 854,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ كَانَ إِذَا أَعْطَى شَيْئًا فِي سَبِيلِ اللَّهِ يَقُولُ لِصَاحِبِهِ إِذَا بَلَغْتَ وَادِيَ الْقُرَى فَشَأْنَكَ بِهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa jika dia memberikan sesuatu di jalan Allah, dia akan berkata kepada yang menggunakannya: Jika kamu telah sampai di sebuah lembah sebuah desa maka itu terserah kamu."
            },
            {
                "number": 855,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ كَانَ يَقُولُإِذَا أُعْطِيَ الرَّجُلُ الشَّيْءَ فِي الْغَزْوِ فَيَبْلُغُ بِهِ رَأْسَ مَغْزَاتِهِ فَهُوَ لَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Sa'id Ibnul Musayyab] berkata; \"Jika seseorang diberi sesuatu dalam sebuah peperangan, lalu dia sampai lokasi keberangkatan perang, maka barang itu menjadi miliknya.\""
            },
            {
                "number": 856,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ سَرِيَّةً فِيهَا عَبْدُ اللَّهِ بْنُ عُمَرَ قِبَلَ نَجْدٍ فَغَنِمُوا إِبِلًا كَثِيرَةً فَكَانَ سُهْمَانُهُمْ اثْنَيْ عَشَرَ بَعِيرًا أَوْ أَحَدَ عَشَرَ بَعِيرًا وَنُفِّلُوا بَعِيرًا بَعِيرًا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengutus pasukan yang di dalamnya ada Abdullah bin Umar menuju Najd, lalu mereka mendapatkan rampasan perang berupa unta yang banyak. Sehingga mereka mendapatkan bagian sebanyak dua belas atau sebelas unta, dan mereka juga diberi tambahan satu unta per orang.\""
            },
            {
                "number": 857,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُكَانَ النَّاسُ فِي الْغَزْوِ إِذَا اقْتَسَمُوا غَنَائِمَهُمْ يَعْدِلُونَ الْبَعِيرَ بِعَشْرِ شِيَاهٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa ia mendengar [Sa'id bin Musayyab] berkata; \"Orang-orang (kaum muslimin) jika membagi harta ghanimah dari peperangan, mereka mensetarakan satu ekor unta dengan sepuluh kambing.\""
            },
            {
                "number": 858,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ كَثِيرِ بْنِ أَفْلَحَ عَنْ أَبِي مُحَمَّدٍ مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ أَنَّهُ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حُنَيْنٍ فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ قَالَ فَرَأَيْتُ رَجُلًا مِنْ الْمُشْرِكِينَ قَدْ عَلَا رَجُلًا مِنْ الْمُسْلِمِينَ قَالَ فَاسْتَدَرْتُ لَهُ حَتَّى أَتَيْتُهُ مِنْ وَرَائِهِ فَضَرَبْتُهُ بِالسَّيْفِ عَلَى حَبْلِ عَاتِقِهِ فَأَقْبَلَ عَلَيَّ فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ ثُمَّ أَدْرَكَهُ الْمَوْتُ فَأَرْسَلَنِي قَالَ فَلَقِيتُ عُمَرَ بْنَ الْخَطَّابِ فَقُلْتُ مَا بَالُ النَّاسِ فَقَالَ أَمْرُ اللَّهِ ثُمَّ إِنَّ النَّاسَ رَجَعُوا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ قَتِيلًا لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ قَالَ فَقُمْتُ ثُمَّ قُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ثُمَّ قَالَ مَنْ قَتَلَ قَتِيلًا لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ قَالَ فَقُمْتُ ثُمَّ قُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ثُمَّ قَالَ ذَلِكَ الثَّالِثَةَ فَقُمْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَكَ يَا أَبَا قَتَادَةَ قَالَ فَاقْتَصَصْتُ عَلَيْهِ الْقِصَّةَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ صَدَقَ يَا رَسُولَ اللَّهِ وَسَلَبُ ذَلِكَ الْقَتِيلِ عِنْدِي فَأَرْضِهِ عَنْهُ يَا رَسُولَ اللَّهِ فَقَالَ أَبُو بَكْرٍ لَا هَاءَ اللَّهِ إِذًا لَا يَعْمِدُ إِلَى أَسَدٍ مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنْ اللَّهِ وَرَسُولِهِ فَيُعْطِيكَ سَلَبَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَ فَأَعْطِهِ إِيَّاهُ فَأَعْطَانِيهِ فَبِعْتُ الدِّرْعَ فَاشْتَرَيْتُ بِهِ مَخْرَفًا فِي بَنِي سَلِمَةَ فَإِنَّهُ لَأَوَّلُ مَالٍ تَأَثَّلْتُهُ فِي الْإِسْلَامِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari ['Amru bin Katsir bin Aflah] dari [Abu Muhammad] mantan budak Abu Qatadah bin Rib'i, dari [Abu Qatadah bin Rib'i] ia berkata; \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam pada perang Hunain, tatkala kami bertemu (dengan musuh), kaum muslimin bercerai-berai.\" Abu Qatadah berkata; \"Aku melihat seorang musyrik tengah mengincar seorang muslim, maka aku mencarinya hingga mendapatinya dari arah belakang. Aku lalu menebasnya dengan pedang tepat pada bagian leher. Orang musyrik tadi menghadap ke arahku dan merangkulku dengan kuat hingga aku dapat merasakan hawa kematiannya. Dan tidak lama kemudian iapun mati. Lalu saya pergi membawanya.\" Abu Qatadah berkata; \"Lalu aku bertemu Umar bin Khattab, maka aku pun berkata, \"Apa yang terjadi dengan orang-orang musyrik? ' Umar menjawab; \"Ini sudah menjadi ketentuan Allah Ta'ala.\" Kemudian orang-orang muslim kembali pulang. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Barangsiapa membunuh musuh dan bisa membuktikannya, maka baginya harta yang dibawa musuh itu.\" Abu Qatadah berkata; \"Aku lalu berdiri dan bertanya; 'Siapa yang bisa menjadi saksi bagiku?\" Kemudian aku duduk kembali. Beliau bersabda lagi: 'Barangsiapa membunuh musuh dan bisa membuktikannya, maka baginya harta yang dibawa musuh itu.'\" Abu Qatadah berkata; \"Aku lalu berdiri dan berkata; 'Siapa yang bisa menjadi saksi bagiku?\" Kemudian aku duduk kembali. Rasulullah shallallahu 'alaihi wasallam bersabda untuk yang ketiga kalinya, lalu aku berdiri, ketika itu Rasulullah shallallahu 'alaihi wasallam bertanya: 'Apa yang terjadi padamu wahai Abu Qatadah? '.\" Abu Qatadah berkata, \"Lalu aku ceritakan kisah tersebut. Tiba-tiba ada seorang laki-laki berdiri dan berkata; \"Benar wahai Rasulullah, dan harta rampasan yang dibunuh itu ada padaku. Relakankan barang itu untukku, wahai Rasulullah! ' Abu Bakar berkata; 'Tidak, demi Allah. Kalau begitu caranya, itu berarti ada salah satu dari singa-singa Allah berperang karena Allah dan Rasul-Nya, tetapi hartanya diberikan kepada kamu! \" Rasulullah shallallahu 'alaihi wasallam bersabda: 'Benar kata dia, berikanlah kepadanya harta itu, ' laki-laki tersebut lalu memberikan harta rampasannya kepadaku. Maka senjata-senjata tersebut aku jual dan aku belikan sebidang kebun yang hendak panen di Bani Salimah. Harta itu adalah harta pertama yang saya peroleh dalam Islam.\""
            },
            {
                "number": 859,
                "arab": "و حَدَّثَنِي مَالِك عَنْ ابْنِ شِهَابٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّهُ قَالَ سَمِعْتُ رَجُلًا يَسْأَلُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍعَنْ الْأَنْفَالِ فَقَالَ ابْنُ عَبَّاسٍ الْفَرَسُ مِنْ النَّفَلِ وَالسَّلَبُ مِنْ النَّفَلِ قَالَ ثُمَّ عَادَ الرَّجُلُ لِمَسْأَلَتِهِ فَقَالَ ابْنُ عَبَّاسٍ ذَلِكَ أَيْضًا ثُمَّ قَالَ الرَّجُلُ الْأَنْفَالُ الَّتِي قَالَ اللَّهُ فِي كِتَابِهِ مَا هِيَ قَالَ الْقَاسِمُ فَلَمْ يَزَلْ يَسْأَلُهُ حَتَّى كَادَ أَنْ يُحْرِجَهُ ثُمَّ قَالَ ابْنُ عَبَّاسٍ أَتَدْرُونَ مَا مَثَلُ هَذَا مَثَلُ صَبِيغٍ الَّذِي ضَرَبَهُ عُمَرُ بْنُ الْخَطَّابِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [al Qasim bin Muhammad] ia berkata; Aku mendengar seorang lelaki bertanya kepada [Abdullah bin Abbas] tentang Al Anfal (harta rampasan) . Ibnu Abbas menjawab, \"Seekor kuda itu termasuk ghanimah, begitu juga senjata atau perhiasan yang di dapat dari orang yang dibunuh.\" al Qasim berkata; \"Laki-laki tadi mengulang pertanyaannya.\" Ibnu Abbas juga menjawab dengan jawaban yang sama. Kemudian lelaki itu bertanya lagi tentang Al Anfal yang termaktub di dalam al-qur'an, lelaki itu terus saja bertanya, sehingga hampir-hampir saja Ibnu Abbas mengusirnya pergi. Setelah itu Ibnu Abbas berkata, \"Apakah kamu tahu perumpamaan orang ini? Yaitu seperti Shabigh yang dipukul oleh Umar bin Khattab.\""
            },
            {
                "number": 860,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَكَانَ النَّاسُ يُعْطَوْنَ النَّفَلَ مِنْ الْخُمُسِقَالَ مَالِك وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ إِلَيَّ فِي ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Sa'id bin Musayyab] berkata; \"Orang-orang (peserta Perang) juga diberi tambahan harta dari yang seperlima.\" Malik berkata; \"Itu adalah hadits terbaik yang saya dengar dalam masalah ini.\""
            },
            {
                "number": 861,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ صَدَرَ مِنْ حُنَيْنٍ وَهُوَ يُرِيدُ الْجِعِرَّانَةَ سَأَلَهُ النَّاسُ حَتَّى دَنَتْ بِهِ نَاقَتُهُ مِنْ شَجَرَةٍ فَتَشَبَّكَتْ بِرِدَائِهِ حَتَّى نَزَعَتْهُ عَنْ ظَهْرِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُدُّوا عَلَيَّ رِدَائِي أَتَخَافُونَ أَنْ لَا أَقْسِمَ بَيْنَكُمْ مَا أَفَاءَ اللَّهُ عَلَيْكُمْ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَفَاءَ اللَّهُ عَلَيْكُمْ مِثْلَ سَمُرِ تِهَامَةَ نَعَمًا لَقَسَمْتُهُ بَيْنَكُمْ ثُمَّ لَا تَجِدُونِي بَخِيلًا وَلَا جَبَانًا وَلَا كَذَّابًا فَلَمَّا نَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِي النَّاسِ فَقَالَ أَدُّوا الْخِيَاطَ وَالْمِخْيَطَ فَإِنَّ الْغُلُولَ عَارٌ وَنَارٌ وَشَنَارٌ عَلَى أَهْلِهِ يَوْمَ الْقِيَامَةِ قَالَ ثُمَّ تَنَاوَلَ مِنْ الْأَرْضِ وَبَرَةً مِنْ بَعِيرٍ أَوْ شَيْئًا ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ مَا لِي مِمَّا أَفَاءَ اللَّهُ عَلَيْكُمْ وَلَا مِثْلُ هَذِهِ إِلَّا الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ عَلَيْكُمْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdu Rabbih bin Sa'id] dari ['Amru bin Syu'aib] berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam kembali dari Hunain, beliau menuju Ji'ranah. Orang-orang bertanya kepada beliau hingga unta beliau mendekat pada sebuah pohon lalu selendang beliau tersangkut, beliau pun terjatuh dari punggung untanya. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Kembalikan selendangku, apakah kalian takut saya tidak membagi kepada kalian apa yang telah Allah kembalikan kepadamu. Demi Dzat yang jiwaku berada di tangan-Nya. Jika Allah mengembalikan kepada kalian, seperti pohon samur (salah satu jenis tumbuhan gurun) Tihamah dalam bentuk ternak, niscaya saya akan membagikan binatang itu kepada kalian. Sehingga kalian tidak mendapatiku sebagai seorang yang pelit, penakut dan pendusta.\" Tatkala Rasulullah shallallahu 'alaihi wasallam turun, beliau berdiri di depan manusia dan bersabda: \"Kembalikanlah jarum dan pakaiannya, sesungguhnya ghulul (mengambil rampasan perang sebelum dibagi) pada hari kiamat adalah kecacatan, neraka, dan aib bagi pengambilnya.\" 'Amru bin Syu'aib berkata; \"Beliau lalu mengambil bulu unta atau sesuatu yang lain dari tanah. Kemudian beliau bersabda: 'Demi Dzat yang jiwaku berada di tangan-Nya. Saya tidak mempunyai sesuatupun dari apa yang Allah berikan kepada kalian yang berupa rampasan Perang kecuali hanya seperlima, dan seperlima itupun dikembalikan kepada kalian.\""
            },
            {
                "number": 862,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ قَالَتُوُفِّيَ رَجُلٌ يَوْمَ حُنَيْنٍ وَإِنَّهُمْ ذَكَرُوهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلُّوا عَلَى صَاحِبِكُمْ فَتَغَيَّرَتْ وُجُوهُ النَّاسِ لِذَلِكَ فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ صَاحِبَكُمْ قَدْ غَلَّ فِي سَبِيلِ اللَّهِ قَالَ فَفَتَحْنَا مَتَاعَهُ فَوَجَدْنَا خَرَزَاتٍ مِنْ خَرَزِ يَهُودَ مَا تُسَاوِينَ دِرْهَمَيْنِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] bahwa [Zaid bin Khalid Al Juhani] berkata; \"Seorang laki-laki meninggal saat perang Hunain, lalu mereka menyampaikan hal itu kepada Rasulullah shallallahu 'alaihi wasallam. Zaid menyatakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'sholatilah teman kalian itu.\" Maka berubahlah wajah orang-orang karena ucapan Rasulullah. Lalu Zaid mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Teman kalian itu telah berbuat ghulul di jalan Allah.\" Zaid bin Khalid berkata; \"Kami membuka barang-barangnya, ternyata kami menemukan marjan (mutiara mahkota) Yahudi yang nilainya tidak sampai dua dirham.\""
            },
            {
                "number": 863,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ الْكِنَانِيِّ أَنَّهُ بَلَغَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى النَّاسَ فِي قَبَائِلِهِمْ يَدْعُو لَهُمْ وَأَنَّهُ تَرَكَ قَبِيلَةً مِنْ الْقَبَائِلِ قَالَ وَإِنَّ الْقَبِيلَةَ وَجَدُوا فِي بَرْدَعَةِ رَجُلٍ مِنْهُمْ عِقْدَ جَزْعٍ غُلُولًا فَأَتَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَبَّرَ عَلَيْهِمْ كَمَا يُكَبِّرُ عَلَى الْمَيِّتِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abdullah bin Mughirah bin Abu Burdah Al Kinani] bahwa telah sampai kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam menemui manusia di kabilah-kabilah mereka seranya mendo'akan mereka semua, kecuali satu kabilah. Abudallah berkata, \"Dan ternyata kabilah tersebut menemukan sebuah kalung marjan pada pelana milik salah seorang dari penduduknya hasil pencurian harta ghanimah. Setelah itu Rasulullah shallallahu 'alaihi wasallam mendatangi mereka dan bertakbir atas mereka sebagaimana beliau bertakbir atas orang mati.\""
            },
            {
                "number": 864,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ عَنْ أَبِي الْغَيْثِ سَالِمٍ مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ خَيْبَرَ فَلَمْ نَغْنَمْ ذَهَبًا وَلَا وَرِقًا إِلَّا الْأَمْوَالَ الثِّيَابَ وَالْمَتَاعَ قَالَ فَأَهْدَى رِفَاعَةُ بْنُ زَيْدٍ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُلَامًا أَسْوَدَ يُقَالُ لَهُ مِدْعَمٌ فَوَجَّهَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى وَادِي الْقُرَى حَتَّى إِذَا كُنَّا بِوَادِي الْقُرَى بَيْنَمَا مِدْعَمٌ يَحُطُّ رَحْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَهُ سَهْمٌ عَائِرٌ فَأَصَابَهُ فَقَتَلَهُ فَقَالَ النَّاسُ هَنِيئًا لَهُ الْجَنَّةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَّا وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ الشَّمْلَةَ الَّتِي أَخَذَ يَوْمَ خَيْبَرَ مِنْ الْمَغَانِمِ لَمْ تُصِبْهَا الْمَقَاسِمُ لَتَشْتَعِلُ عَلَيْهِ نَارًا قَالَ فَلَمَّا سَمِعَ النَّاسُ ذَلِكَ جَاءَ رَجُلٌ بِشِرَاكٍ أَوْ شِرَاكَيْنِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِرَاكٌ أَوْ شِرَاكَانِ مِنْ نَارٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Tsaur bin Zaid Ad-Dili] dari [Abu Al Ghaits Salim] mantan budak Ibnu Muthi', dari [Abu Hurairah] ia berkata; \"Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam pada Perang Khaibar, namun kami tidak mendapatkan ghanimah yang berupa emas ataupun uang. Kami hanya mendapatkan harta berupa pakaian dan perkakas.\" Abu Hurairah berkata, \"Rifa'ah bin Zaid lalu memberi hadiah Rasulullah shallallahu 'alaihi wasallam seorang budak hitam yang bernama Mid'am. Rasulullah shallallahu 'alaihi wasallam kemudian menuju Wadil Qura. Ketika kami tiba di Wadil Qura, tiba-tiba muncul anak panah yang tidak diketahui pemiliknya mengenai Mid'am yang sedang menuntun unta Rasulullah shallallahu 'alaihi wasallam hingga tewas. Orang-orang berkata; \"Mudah-mudahan dia masuk surga.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekali-kali tidak, demi dzat yang jiwaku berada di tangan-Nya, mantel yang telah dia ambil pada Perang Khaibar itu adalah termasuk ghanimah yang belum dibagi, dan itu akan akan menyalakan api pada dirinya.\" Abu Hurairah berkata; \"Tatkala orang-orang mendengar ucapan Rasulullah, datang seseorang dengan membawa satu tali sandal atau dua tali sandal kepada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu tali sandal atau dua (yang belum dibagi) bagian dari neraka.\""
            }
        ]
    }
}