{
    "status": true,
    "data": {
        "start": 145,
        "end": 288,
        "total": 144,
        "book": "malik",
        "hadits": [
            {
                "number": 145,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُمَنْ صَلَّى بِأَرْضٍ فَلَاةٍ صَلَّى عَنْ يَمِينِهِ مَلَكٌ وَعَنْ شِمَالِهِ مَلَكٌ فَإِذَا أَذَّنَ وَأَقَامَ الصَّلَاةَ أَوْ أَقَامَ صَلَّى وَرَاءَهُ مِنْ الْمَلَائِكَةِ أَمْثَالُ الْجِبَالِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] dia berkata, \"Barangsiapa sholat di sebidang tanah, niscaya malaikat sholat di sebelah kanan dan kirinya. Jika ia mengumandangkan adzan dan iqamat, atau iqamat saja, niscaya para Malaikat sholat di belakangnya seperti gunung.\""
            },
            {
                "number": 146,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بِلَالًا يُنَادِي بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdullah bin Dinar] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Bilal mengumandangkan Adzan di malam hari, maka makan dan minumlah kalian hingga Abdullah bin Ummi Maktum mengumandangkan adzan.\""
            },
            {
                "number": 147,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بِلَالًا يُنَادِي بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ قَالَ وَكَانَ ابْنُ أُمِّ مَكْتُومٍ رَجُلًا أَعْمَى لَا يُنَادِي حَتَّى يُقَالَ لَهُ أَصْبَحْتَ أَصْبَحْتَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Salim bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Bilal mengumandangkan adzan di malam hari, makan dan minumlah kalian hingga Ibnu Ummi Maktum mengumandangkan adzan.\" Salim bin Abdullah berkata, \"Abdullah bin Ummi Maktum adalah seorang laki-laki buta, ia tidak mengumandangkan adzan hingga dikatakan padanya, 'subuh telah tiba, subuh telah tiba'.\""
            },
            {
                "number": 148,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَهُمَا كَذَلِكَ أَيْضًا وَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ وَكَانَ لَا يَفْعَلُ ذَلِكَ فِي السُّجُودِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Abdullah bin Umar], bahwa jika Rasulullah shallallahu 'alaihi wasallam memulai sholat, beliau mengangkat kedua tangannya setinggi kedua bahunya. Jika bangkit dari rukuk, beliau juga mengangkat kedua tangannya seraya membaca do'a: \"SAMI'A ALLAHU LIMAN HAMIDAH, RABBANAA WALAKAL HAMDU (Allah Maha Mendengar terhadap siapa yang memuji-Nya. Wahai Rabb kami, hanya bagi-Mu segala pujian) .\" Tetapi beliau tidak melakukan hal itu saat sujudnya.\""
            },
            {
                "number": 149,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّهُ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي الصَّلَاةِ كُلَّمَا خَفَضَ وَرَفَعَ فَلَمْ تَزَلْ تِلْكَ صَلَاتَهُ حَتَّى لَقِيَ اللَّهَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Ali bin Husain bin Ali bin Abu Thalib] berkata, \"Dalam sholat Rasulullah shallallahu 'alaihi wasallam bertakbir saat akan bangkit dan turun. Beliau selalu melakukannya hingga meninggal dunia.\""
            },
            {
                "number": 150,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَرْفَعُ يَدَيْهِ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar], bahwa Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya dalam sholat.\""
            },
            {
                "number": 151,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ أَبَا هُرَيْرَةَكَانَ يُصَلِّي لَهُمْ فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ فَإِذَا انْصَرَفَ قَالَ وَاللَّهِ إِنِّي لَأَشْبَهُكُمْ بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman bin Auf] bahwa [Abu Hurairah] pernah mengimami mereka sholat. Lalu ia bertakbir setiap kali turun dan bangkit. Ketika selesai sholat ia berkata, \"Demi Allah, aku adalah orang yang sholat paling mirip dengan sholatnya Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 152,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُكَبِّرُ فِي الصَّلَاةِ كُلَّمَا خَفَضَ وَرَفَعَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Salim bin Abdullah], bahwa [Abdullah bin 'Umar] bertakbir dalam sholatnya setiap kali turun dan bangkit.\""
            },
            {
                "number": 153,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَهُمَا دُونَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'], bahwa [Abdullah bin Umar] apabila memulai sholat, ia mengangkat kedua tangannya setinggi bahu. Dan jika mengangkat kepalanya dari rukuk, ia mengangkat kedua tangannya lebih rendah daripada itu.\""
            },
            {
                "number": 154,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي نُعَيْمٍ وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّهُ كَانَ يُعَلِّمُهُمْ التَّكْبِيرَ فِي الصَّلَاةِ قَالَ فَكَانَ يَأْمُرُنَا أَنْ نُكَبِّرَ كُلَّمَا خَفَضْنَا وَرَفَعْنَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Nu'aim Wahab bin Kaisan] dari [Jabir bin Abdullah], Bahwasanya dia telah mengajarkan mereka bertakbir dalam sholat.\" Ia berkata, \"Beliau (Rasulullah) menyuruh kami untuk bertakbir setiap kali turun dan bangkit.\""
            },
            {
                "number": 155,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّهُ كَانَ يَقُولُإِذَا أَدْرَكَ الرَّجُلُ الرَّكْعَةَ فَكَبَّرَ تَكْبِيرَةً وَاحِدَةً أَجْزَأَتْ عَنْهُ تِلْكَ التَّكْبِيرَةُقَالَ مَالِك وَذَلِكَ إِذَا نَوَى بِتِلْكَ التَّكْبِيرَةِ افْتِتَاحَ الصَّلَاةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] ia berkata; \"Apabila seorang laki-laki telah mendapatkan rukuk, lalu dia bertakbir dengan sekali takbir, maka telah cukup baginya dengan takbir itu.\" Malik berkata berkata, \"Yang demikian itu jika dia meniatkan takbirnya untuk memulai (membuka) sholat.\""
            },
            {
                "number": 156,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ أَنَّهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ بِالطُّورِ فِي الْمَغْرِبِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Muhammad bin Jubair bin Muth'im] dari [Bapaknya] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam membaca surat Ath Thur dalam sholat maghrib.\""
            },
            {
                "number": 157,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ أُمَّ الْفَضْلِ بِنْتَ الْحَارِثِسَمِعَتْهُ وَهُوَ يَقْرَأُ وَالْمُرْسَلَاتِ عُرْفًا فَقَالَتْ لَهُ يَا بُنَيَّ لَقَدْ ذَكَّرْتَنِي بِقِرَاءَتِكَ هَذِهِ السُّورَةَ إِنَّهَا لَآخِرُ مَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهَا فِي الْمَغْرِبِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah bin 'Utbah bin Mas'ud] dari [Abdullah bin 'Abbas], bahwa [Ummul Al Fadl binti Al Harits] mendengarnya membaca, \"WALMURSALAATI 'URFA.\" Umul Al Fadl binti Al Harits berkata, \"Wahai anakku! Dengan kamu membaca surat ini, kamu telah mengingatkanku, bahwa itu adalah surat terakhir yang pernah aku dengar dari Rasulullah shallallahu 'alaihi wasallam, beliau membaca surat tersebut dalam sholat maghrib.\""
            },
            {
                "number": 158,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي عُبَيْدٍ مَوْلَى سُلَيْمَانَ بْنِ عَبْدِ الْمَلِكِ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ قَيْسِ بْنِ الْحَارِثِ عَنْ أَبِي عَبْدِ اللَّهِ الصُّنَابِحِيِّ قَالَقَدِمْتُ الْمَدِينَةَ فِي خِلَافَةِ أَبِي بَكْرٍ الصِّدِّيقِ فَصَلَّيْتُ وَرَاءَهُ الْمَغْرِبَ فَقَرَأَ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ بِأُمِّ الْقُرْآنِ وَسُورَةٍ سُورَةٍ مِنْ قِصَارِ الْمُفَصَّلِ ثُمَّ قَامَ فِي الثَّالِثَةِ فَدَنَوْتُ مِنْهُ حَتَّى إِنَّ ثِيَابِي لَتَكَادُ أَنْ تَمَسَّ ثِيَابَهُ فَسَمِعْتُهُ قَرَأَ بِأُمِّ الْقُرْآنِ وَبِهَذِهِ الْآيَةِ{ رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ }",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu 'Ubaid] mantan budak Sulaiman bin Abdul Malik, dari [Ubadah bin Nusai] dari [Qais bin Al Harits] dari [Abu Abdullah Ash Shunabihi] ia berkata; \"Aku datang ke Madinah pada masa kekhilafahan [Abu Bakar As Shiddiq] . Lalu aku sholat maghrib di belakangnya, dia membaca Ummul Qur'an pada dua rakaat pertama dan surat-surat Al Mufashshal yang pendek. Kemudian dia berdiri menuju rakaat yang ketiga, lalu aku mendekat kepadanya hingga kainku hampir menempel pakaiannya. Aku mendengar ia membaca Ummul Qur'an dan ayat ini; '(Ya Tuhan kami, janganlah Engkau jadikan hati kami condong kepada kesesatan sesudah Engkau beri petunjuk kepada kami, dan karuniakanlah kepada kami Rahmat dari sisi Engkau; Karena Engkau-lah Maha pemberi (karunia) '.\" (Qs. Ali Imran: 8) . "
            },
            {
                "number": 159,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا صَلَّى وَحْدَهُ يَقْرَأُ فِي الْأَرْبَعِ جَمِيعًا فِي كُلِّ رَكْعَةٍ بِأُمِّ الْقُرْآنِ وَسُورَةٍ مِنْ الْقُرْآنِ وَكَانَ يَقْرَأُ أَحْيَانًا بِالسُّورَتَيْنِ وَالثَّلَاثِ فِي الرَّكْعَةِ الْوَاحِدَةِ مِنْ صَلَاةِ الْفَرِيضَةِ وَيَقْرَأُ فِي الرَّكْعَتَيْنِ مِنْ الْمَغْرِبِ كَذَلِكَ بِأُمِّ الْقُرْآنِ وَسُورَةٍ سُورَةٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'], bahwa [Abdullah bin Umar] apabila sholat sendirian, ia membaca pada semua rakaat yang empat. Pada setiap rakaat ia membaca Ummul qur'an dan salah satu surat dari al-qur'an. Dan terkadang ia membaca dua atau tiga surat dalam satu rakaat dalam sholat fardlu. Pada dua rakaat dalam sholat maghrib ia juga membaca Ummul Qur'an dan surat.\""
            },
            {
                "number": 160,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ الْأَنْصَارِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ أَنَّهُ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ فَقَرَأَ فِيهَا بِالتِّينِ وَالزَّيْتُونِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari ['Adi bin Tsabit Al Anshari] dari [Al Barra bin 'Azib] dia berkata; \"Saya sholat isya bersama Rasulullah shallallahu 'alaihi wasallam, beliau membaca: WATT-TIIN WAZZAITUN (Demi Buah Tin dan Demi Buah Zaitun) .\""
            },
            {
                "number": 161,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الْقَسِّيِّ وَعَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ قِرَاءَةِ الْقُرْآنِ فِي الرُّكُوعِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Ibrahim bin Abdullah bin Hunain] dari [Bapaknya] dari [Ali bin Abu Thalib], Rasulullah shallallahu 'alaihi wasallam melarang memakai sutra, memakai cincin emas dan membaca al-qur'an saat rukuk\"."
            },
            {
                "number": 162,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ عَنْ أَبِي حَازِمٍ التَّمَّارِ عَنْ الْبَيَاضِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَى النَّاسِ وَهُمْ يُصَلُّونَ وَقَدْ عَلَتْ أَصْوَاتُهُمْ بِالْقِرَاءَةِ فَقَالَ إِنَّ الْمُصَلِّيَ يُنَاجِي رَبَّهُ فَلْيَنْظُرْ بِمَا يُنَاجِيهِ بِهِ وَلَا يَجْهَرْ بَعْضُكُمْ عَلَى بَعْضٍ بِالْقُرْآنِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim bin Al Harits At Taimi] dari [Abu Hazm At Tammar] dari [Al Bayadli], bahwa Rasulullah shallallahu 'alaihi wasallam menemui orang-orang ketika mereka sedang sholat. Mereka mengeraskan bacaan di dalamnya, maka beliau bersabda: \"Sesungguhnya orang yang sholat itu sedang bermunajat kepada Rabbnya, maka lihatlah apa yang dia bisikkan. Janganlah sebagian dari kalian mengeraskan bacaannya atas sebagian yang lain! \""
            },
            {
                "number": 163,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَقُمْتُ وَرَاءَ أَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكُلُّهُمْ كَانَ لَا يَقْرَأُ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ إِذَا افْتَتَحَ الصَّلَاةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Humaid At Thawil] dari [Anas bin Malik] dia berkata; \"Saya pernah sholat di belakang [Abu Bakar], [Umar] dan [Utsman], mereka semua tidak membaca; BISMILLAHI AR-RAHMAN AR-RAHIM ketika mengawali sholat.\""
            },
            {
                "number": 164,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ عَنْ أَبِيهِ أَنَّهُ قَالَكُنَّا نَسْمَعُ قِرَاءَةَ عُمَرَ بْنِ الْخَطَّابِ عِنْدَ دَارِ أَبِي جَهْمٍ بِالْبَلَاطِ",
                "id": "Telah menceritakan kepadaku dari Malik dari pamannya [Abu Suhail bin Malik] dari [Bapaknya] dia berkata; \"Saya mendengar bacaan [Umar bin Khatthab] di rumah Abu Jahm ketika di Balath.\""
            },
            {
                "number": 165,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا فَاتَهُ شَيْءٌ مِنْ الصَّلَاةِ مَعَ الْإِمَامِ فِيمَا جَهَرَ فِيهِ الْإِمَامُ بِالْقِرَاءَةِ أَنَّهُ إِذَا سَلَّمَ الْإِمَامُ قَامَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَقَرَأَ لِنَفْسِهِ فِيمَا يَقْضِي وَجَهَرَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'], bahwa apabila [Abdullah bin Umar] tertinggal dari imam pada beberapa rakaat yang dikeraskan bacaannya, maka ketika imam salam, dia berdiri dan membaca sendiri pada rakaat yang tertinggal dengan membacanya agak keras.\""
            },
            {
                "number": 166,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَزِيدَ بْنِ رُومَانَ أَنَّهُ قَالَ كُنْتُ أَؤُصَلِّ إِلَى جَانِبِ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍفَيَغْمِزُنِي فَأَفْتَحُ عَلَيْهِ وَنَحْنُ نُصَلِّي",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Ruman] berkata; \"Saya sholat di samping [Nafi' bin Jubair bin Muth'im] . Dia berisyarat kepadaku (agar aku membetulkan bacaanya) . Akupun membetulkan bacaannya, padahal kami sedang sholat.\""
            },
            {
                "number": 167,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَصَلَّى الصُّبْحَ فَقَرَأَ فِيهَا سُورَةَ الْبَقَرَةِ فِي الرَّكْعَتَيْنِ كِلْتَيْهِمَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin Urwah] dari [Bapaknya], bahwa [Abu Bakar As Shidiq] sholat subuh. Dia membaca surat Al Baqarah dalam dua rakaat tersebut."
            },
            {
                "number": 168,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ يَقُولُصَلَّيْنَا وَرَاءَ عُمَرَ بْنِ الْخَطَّابِ الصُّبْحَ فَقَرَأَ فِيهَا بِسُورَةِ يُوسُفَ وَسُورَةِ الْحَجِّ قِرَاءَةً بَطِيئَةً فَقُلْتُ وَاللَّهِ إِذًا لَقَدْ كَانَ يَقُومُ حِينَ يَطْلُعُ الْفَجْرُ قَالَ أَجَلْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] Bahwasanya ia mendengar [Abdullah bin 'Amir bin Rabi'ah] berkata; \"Kami sholat subuh di belakang [Umar bin Khatthab] . Dia membaca Surat Yusuf dan surat Al Haj dengan bacaan yang pelan.\" Saya berkata; \"Demi Allah, kalau begitu dia berdiri sholat sampai munculnya fajar.\" Abdullah bin 'Amir menjawab; \"Benar.\""
            },
            {
                "number": 169,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ وَرَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّ الْفُرَافِصَةَ بْنَ عُمَيْرٍ الْحَنَفِيَّ قَالَمَا أَخَذْتُ سُورَةَ يُوسُفَ إِلَّا مِنْ قِرَاءَةِ عُثْمَانَ بْنِ عَفَّانَ إِيَّاهَا فِي الصُّبْحِ مِنْ كَثْرَةِ مَا كَانَ يُرَدِّدُهَا لَنَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dan [Rabi'ah bin Abu Abdurrahman] dari [Al Qasim bin Muhammad] bahwa [Al Furafishah bin 'Umair Al Hanafi] berkata; \"Tidaklah aku hafal Surat Yusuf melainkan dari bacaan [Utsman bin Affan] pada sholat subuh, karena seringnya dia mengulanginya.\""
            },
            {
                "number": 170,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يَقْرَأُ فِي الصُّبْحِ فِي السَّفَرِ بِالْعَشْرِ السُّوَرِ الْأُوَلِ مِنْ الْمُفَصَّلِ فِي كُلِّ رَكْعَةٍ بِأُمِّ الْقُرْآنِ وَسُورَةٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'], bahwa ketika dalam perjalanan pada sholat subuh, [Abdullah bin Umar] membaca sepuluh surat yang pertama dari kelompok surat Al Mufashshal. Dan dalam setiap rakaat ia membaca Al Fatihah dan surat.\" "
            },
            {
                "number": 171,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ أَنَّ أَبَا سَعِيدٍ مَوْلَى عَامِرِ بْنِ كُرَيْزٍ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَادَى أُبَيَّ بْنَ كَعْبٍ وَهُوَ يُصَلِّي فَلَمَّا فَرَغَ مِنْ صَلَاتِهِ لَحِقَهُ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَى يَدِهِ وَهُوَ يُرِيدُ أَنْ يَخْرُجَ مِنْ بَابِ الْمَسْجِدِ فَقَالَ إِنِّي لَأَرْجُو أَنْ لَا تَخْرُجَ مِنْ الْمَسْجِدِ حَتَّى تَعْلَمَ سُورَةً مَا أَنْزَلَ اللَّهُ فِي التَّوْرَاةِ وَلَا فِي الْإِنْجِيلِ وَلَا فِي الْقُرْآنِ مِثْلَهَا قَالَ أُبَيٌّ فَجَعَلْتُ أُبْطِئُ فِي الْمَشْيِ رَجَاءَ ذَلِكَ ثُمَّ قُلْتُ يَا رَسُولَ اللَّهِ السُّورَةَ الَّتِي وَعَدْتَنِي قَالَ كَيْفَ تَقْرَأُ إِذَا افْتَتَحْتَ الصَّلَاةَ قَالَ فَقَرَأْتُ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ حَتَّى أَتَيْتُ عَلَى آخِرِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيَ هَذِهِ السُّورَةُ وَهِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُعْطِيتُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Al 'Ala` bin Abdurrahman bin Ya'qub] bahwasanya [Abu Sa'id] mantan budak 'Amir bin Kuraiz, mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam memanggil Ubay bin Ka'ab yang sedang melaksanakan sholat. Tatkala dia telah selesai, dia menyusul beliau. Beliau memegang tangan Ubay bin Ka'ab ketika hendak keluar dari pintu Masjid. Beliau bersabda: \"Saya berharap kamu tidak keluar dahulu, hingga kamu mendengar surat yang Allah tidak menurunkan yang semisalnya baik dalam Taurat, Injil maupun al-qur'an \" Ubay bin Ka'ab berkata; \"Saya memperlambat jalanku, mengharap hal itu. Kemudian saya bertanya; \"Wahai Rasulullah, mana surat yang telah anda janjikan kepadaku?\" Beliau bersabda: \"Apa yang kamu baca ketika kamu mengawali sholat?\" Ubay bin Ka'ab menjawab; \"Saya membaca; 'ALHAMDU LILLAHI RABBIL 'AALAMIIN' hingga akhir.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itulah surat As Sab'u Al Matsani dan al-qur'an Agung yang diberikan kepadaku.\" "
            },
            {
                "number": 172,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي نُعَيْمٍ وَهْبِ بْنِ كَيْسَانَ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِيَقُولُ مَنْ صَلَّى رَكْعَةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَلَمْ يُصَلِّ إِلَّا وَرَاءَ الْإِمَامِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Nu'aim Wahab bin Kaisan] Bahwasanya ia mendengar [Jabir bin Abdullah] berkata; \"Barangsiapa sholat satu rakaat dengan tidak membaca Ummul qur'an (Al Fatihah) di dalamnya, maka janganlah dia kerjakan kecuali di belakang imam.\""
            },
            {
                "number": 173,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ أَنَّهُ سَمِعَ أَبَا السَّائِبِ مَوْلَى هِشَامِ بْنِ زُهْرَةَ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَلَّى صَلَاةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَهِيَ خِدَاجٌ هِيَ خِدَاجٌ هِيَ خِدَاجٌ غَيْرُ تَمَامٍ قَالَ فَقُلْتُ يَا أَبَا هُرَيْرَةَ إِنِّي أَحْيَانًا أَكُونُ وَرَاءَ الْإِمَامِ قَالَ فَغَمَزَ ذِرَاعِي ثُمَّ قَالَ اقْرَأْ بِهَا فِي نَفْسِكَ يَا فَارِسِيُّ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ فَنِصْفُهَا لِي وَنِصْفُهَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَءُوا يَقُولُ الْعَبْدُ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ }يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى حَمِدَنِي عَبْدِي وَيَقُولُ الْعَبْدُ{ الرَّحْمَنِ الرَّحِيمِ }يَقُولُ اللَّهُ أَثْنَى عَلَيَّ عَبْدِي وَيَقُولُ الْعَبْدُ{ مَالِكِ يَوْمِ الدِّينِ }يَقُولُ اللَّهُ مَجَّدَنِي عَبْدِي يَقُولُ الْعَبْدُ{ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ }فَهَذِهِ الْآيَةُ بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ يَقُولُ الْعَبْدُ{ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }فَهَؤُلَاءِ لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Al 'Ala bin Abdurrahman bin Ya'qub] Bahwasanya ia mendengar [Abu As Sa`ib] mantan budak Hisyam bin Zuhrah berkata; Saya mendengar [Abu Hurairah] berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa sholat namun tidak membaca Ummul qur'an (Al Fatihah) di dalamnya, maka sholatnya kurang, sholatnya kurang, sholatnya kurang dan tidak sempurna.\" Abu As Sa`ib berkata, \"Lalu saya berkata, \"Wahai Abu Hurairah, aku terkadang sholat di belakang imam, \" Abu As Sa`ib berkata, \"Abu Hurairah langsung memegang lenganku seraya berkata, \"Bacalah dalam hatimu, Wahai orang Persi', karena saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Tabaraka Wa Ta'ala berfirman, 'Aku membagi antara diri-Ku dan hamba-Ku dengan dua paruh, separuh untukku dan separuh lainnya untuk hamba-Ku, dan bagi hamba-Ku apa yang dia yang minta.' Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bacalah: ALHAMDU LILLAHI RABBIL 'AALAMIIN. Allah Tabaraka Wa Ta'ala berfirman; 'Hamba-Ku telah memuji-Ku'. Jika seorang hamba membaca; AR-RAHMAANIR RAHIIM. Allah Tabaraka Wa Ta'ala berfirman; 'Hamba-Ku telah memuji-Ku.' Jika seorang hamba membaca; MALIKI YAUMIDDIIN. Allah berfirman; 'Hamba-Ku telah mengagungkan-Ku'. Jika seorang hamba membaca; 'IYYAAKA NA'BUDU WA IYYAAKA NASTA'IIN'. Ayat ini antara Aku dengan hamba-Ku, dan untuknya apa yang dia minta.\" Jika seorang hamba membaca, 'IHDINAS SHIRAATHAL MUSTAQIIM, SHIRAATHAL LADZIINA AN'AMTA 'ALAIHIM GHAIRIL MAGHDLUUBI 'ALAIHIM WALAD DLAALLIIN', itu semua untuk hamba-Ku dan baginya apa yang dia minta.\""
            },
            {
                "number": 174,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّهُ كَانَ يَقْرَأُ خَلْفَ الْإِمَامِ فِيمَا لَا يَجْهَرُ فِيهِ الْإِمَامُ بِالْقِرَاءَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya], Bahwasanya dia membaca di belakang imam pada sholat yang bacaannya tidak dibaca keras oleh imam.\""
            },
            {
                "number": 175,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ وَعَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍكَانَ يَقْرَأُ خَلْفَ الْإِمَامِ فِيمَا لَا يَجْهَرُ فِيهِ الْإِمَامُ بِالْقِرَاءَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Rabi'ah bin Abu Abdurrahman], bahwa [Al Qasim bin Muhammad] membaca di belakang imam, pada sholat yang bacaannya tidak dibaca keras oleh imam.\""
            },
            {
                "number": 176,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَزِيدَ بْنِ رُومَانَ أَنَّ نَافِعَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍكَانَ يَقْرَأُ خَلْفَ الْإِمَامِ فِيمَا لَا يَجْهَرُ فِيهِ بِالْقِرَاءَةِقَالَ مَالِك وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَيَّ فِي ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Ruman] bahwasanya [Nafi' bin Jubair bin Muth'im], ia membaca di belakang imam, pada bacaan yang imam tidak mengeraskannya.\" Malik berkata; \"Itu yang paling saya sukai dari apa yang telah saya dengar.\""
            },
            {
                "number": 177,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا سُئِلَ هَلْ يَقْرَأُ أَحَدٌ خَلْفَ الْإِمَامِ قَالَ إِذَا صَلَّى أَحَدُكُمْ خَلْفَ الْإِمَامِ فَحَسْبُهُ قِرَاءَةُ الْإِمَامِ وَإِذَا صَلَّى وَحْدَهُ فَلْيَقْرَأْقَالَ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَا يَقْرَأُ خَلْفَ الْإِمَامِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] ketika ditanya, \"Apakah seseorang membaca di belakang imam?\" Ia menjawab, \"Jika salah seorang dari kalian sholat di belakang imam, cukuplah baginya bacaan imam. Jika dia sholat sendirian, hendaklah dia membaca.\" Nafi' berkata; \"Abdullah bin Umar tidak membaca (Al Fatihah) di belakang imam.\""
            },
            {
                "number": 178,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ أُكَيْمَةَ اللَّيْثِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ مِنْ صَلَاةٍ جَهَرَ فِيهَا بِالْقِرَاءَةِ فَقَالَ هَلْ قَرَأَ مَعِي مِنْكُمْ أَحَدٌ آنِفًا فَقَالَ رَجُلٌ نَعَمْ أَنَا يَا رَسُولَ اللَّهِ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَقُولُ مَا لِي أُنَازَعُ الْقُرْآنَ فَانْتَهَى النَّاسُ عَنْ الْقِرَاءَةِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا جَهَرَ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْقِرَاءَةِ حِينَ سَمِعُوا ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Ibnu Ukaimah Al Laitsi] dari [Abu Hurairah], bahwa ketika Rasulullah shallallahu 'alaihi wasallam selesai dari sholat yang dikeraskan bacaannya. Beliau bersabda: \"Apakah salah seorang dari kalian tadi ada yang membaca bersamaku?\" Ada seorang laki-laki yang menjawab, \"Saya, Wahai Rasulullah! \" Abu Hurairah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Aku katakan (heran) kenapa aku diselisihi saat membaca al-qur'an! ' Maka, setelah mereka mendengar (hadits) itu dari Rasulullah shallallahu 'alaihi wasallam orang-orang berhenti membaca dalam sholat yang dikeraskan Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 179,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَمَّنَ الْإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ قَالَ ابْنُ شِهَابٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ آمِينَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dan [Abu Salamah bin Abdurrahman] keduanya mengabarkan kepadanya, dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila imam membaca AAMIIN, maka ucapkanlah AAMIIN. Barangsiapa yang bacaan AAMIIN-nya bersamaan dengan AAMIN-nya Malaikat, niscaya akan diampuni dosa-dosanya yang telah lalu.\" Ibnu Syihab berkata, \"Rasulullah shallallahu 'alaihi wasallam membaca AAMIIN.\""
            },
            {
                "number": 180,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ{ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }فَقُولُوا آمِينَ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Sumayya] budak Abu Bakar dari [Abu Shalih As Samman] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila iImam mengucapkan, GHAIRIL MAGHDLUUBI 'ALAIHIM WALAD DLAALLIIN, maka ucapkan, AAMIIN. Barangsiapa yang bacaanya tersebut bertepatan dengan bacaan Malaikat, niscaya akan diampuni dosa-dosanya yang telah lalu.\""
            },
            {
                "number": 181,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ أَحَدُكُمْ آمِينَ وَقَالَتْ الْمَلَائِكَةُ فِي السَّمَاءِ آمِينَ فَوَافَقَتْ إِحْدَاهُمَا الْأُخْرَى غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian mengucapkan AMIN, dan para Malaikat di langit juga mengucapkannya, hingga keduanya serentak niscaya diampuni dosa-dosanya yang telah lalu.\""
            },
            {
                "number": 182,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Sumayya] mantan budak Abu Bakar, dari [Abu Shalih As Samman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila imam membaca: SAMI'A ALLAHU LIMAN HAMIDAH, maka bacalah, RABBANAA WALAKAL HAMDU. Barangsiapa ucapannya bertepatan dengan do'a para Malaikat, niscaya akan diampuni dosa-dosanya yang telah lalu.\""
            },
            {
                "number": 183,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ عَنْ عَلِيِّ بْنِ عَبْدِ الرَّحْمَنِ الْمُعَاوِيِّ أَنَّهُ قَالَرَآنِي عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَنَا أَعْبَثُ بِالْحَصْبَاءِ فِي الصَّلَاةِ فَلَمَّا انْصَرَفْتُ نَهَانِي وَقَالَ اصْنَعْ كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ فَقُلْتُ وَكَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ قَالَ كَانَ إِذَا جَلَسَ فِي الصَّلَاةِ وَضَعَ كَفَّهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى وَقَبَضَ أَصَابِعَهُ كُلَّهَا وَأَشَارَ بِأُصْبُعِهِ الَّتِي تَلِي الْإِبْهَامَ وَوَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَقَالَ هَكَذَا كَانَ يَفْعَلُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Muslim bin Abu Maryam] dari [Ali bin Abdurrahman Al Mu'awi] dia berkata; \" [Abdullah bin Umar] melihatku bermain-main dengan kerikil dalam sholat. Tatkala telah selesai, dia melarangku dan berkata, \"Lakukanlah sebagaimana yang dilakukan Rasulullah shallallahu 'alaihi wasallam! \" Saya bertanya, \"Apa yang dilakukan oleh Rasulullah shallallahu 'alaihi wasallam?\" Dia menjawab, \"Jika beliau duduk dalam sholat, beliau meletakkan tangan kanannya di atas paha kanannya, menggenggam semua jari-jarinya dan berisyarat dengan jari telunjuknya. Dan beliau juga meletakkan tangan kirinya di atas paha kirinya.\" Abdullah bin Umar berkata; \"Beginilah Rasulullah shallallahu 'alaihi wasallam melakukannya.\""
            },
            {
                "number": 184,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَوَصَلَّى إِلَى جَنْبِهِ رَجُلٌ فَلَمَّا جَلَسَ الرَّجُلُ فِي أَرْبَعٍ تَرَبَّعَ وَثَنَى رِجْلَيْهِ فَلَمَّا انْصَرَفَ عَبْدُ اللَّهِ عَابَ ذَلِكَ عَلَيْهِ فَقَالَ الرَّجُلُ فَإِنَّكَ تَفْعَلُ ذَلِكَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَإِنِّي أَشْتَكِي",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Dinar] Bahwasanya ia mendengar, ada seorang laki-laki yang sholat di sisi [Abdullah bin Umar] . Takala laki-laki itu duduk di rakaat ke empat, dia duduk dengan kaki bersilang di bawah paha dan menjongkokkan kedua kakinya. Tatkala Abdullah telah selesai, dia mencela perbuatan laki-laki itu. Orang itu berkata; \"Kamu juga melakukan itu.\" Abdullah bin Umar menjawab, \"Karena kakiku sakit.\""
            },
            {
                "number": 185,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ صَدَقَةَ بْنِ يَسَارٍ عَنْ الْمُغِيرَةِ بْنِ حَكِيمٍ أَنَّهُ رَأَى عَبْدَ اللَّهِ بْنَ عُمَرَيَرْجِعُ فِي سَجْدَتَيْنِ فِي الصَّلَاةِ عَلَى صُدُورِ قَدَمَيْهِ فَلَمَّا انْصَرَفَ ذَكَرَ لَهُ ذَلِكَ فَقَالَ إِنَّهَا لَيْسَتْ سُنَّةَ الصَّلَاةِ وَإِنَّمَا أَفْعَلُ هَذَا مِنْ أَجْلِ أَنِّي أَشْتَكِي",
                "id": "Telah menceritakan kepadaku dari Malik dari [Shadaqah bin Yasar] dari [Al Mughirah bin Hakim] dia melihat [Abdullah bin Umar] bertopang pada kedua telapak kakinya setiap kali mengangkat kepalanya dari sujud. Tatkala selesai, ada orang yang menanyakan hal itu. Dia menjawab; \"Sesungguhnya itu bukan sunnah dalam sholat. Saya melakukannya karena kakiku sakit.\""
            },
            {
                "number": 186,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ أَخْبَرَهُ أَنَّهُ كَانَ يَرَى عَبْدَ اللَّهِ بْنَ عُمَرَيَتَرَبَّعُ فِي الصَّلَاةِ إِذَا جَلَسَ قَالَ فَفَعَلْتُهُ وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ فَنَهَانِي عَبْدُ اللَّهِ وَقَالَ إِنَّمَا سُنَّةُ الصَّلَاةِ أَنْ تَنْصِبَ رِجْلَكَ الْيُمْنَى وَتَثْنِيَ رِجْلَكَ الْيُسْرَى فَقُلْتُ لَهُ فَإِنَّكَ تَفْعَلُ ذَلِكَ فَقَالَ إِنَّ رِجْلَيَّ لَا تَحْمِلَانِي",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Abdullah bin Abdullah bin Umar] dia mengabarkan kepadanya, bahwa ia pernah melihat [Abdullah bin Umar] duduk dengan kaki bersilang di bawah paha dalam sholat, Abdurrahman bin Al Qasim berkata; \"Saya melakukannya ketika saya masih kecil. lantas Abdullah melarangku. Kemudian ia berkata; \"Sunah dalam sholat adalah, menegakkan kaki kananmu dan menghamparkan kaki kirimu.\" Saya bertanya, \"Kenapa kamu melakukan?\" ia menjawab, \"Karena kedua kakiku sudah tidak kuat lagi.\""
            },
            {
                "number": 187,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ أَرَاهُمْ الْجُلُوسَ فِي التَّشَهُّدِ فَنَصَبَ رِجْلَهُ الْيُمْنَى وَثَنَى رِجْلَهُ الْيُسْرَى وَجَلَسَ عَلَى وَرِكِهِ الْأَيْسَرِ وَلَمْ يَجْلِسْ عَلَى قَدَمِهِ ثُمَّ قَالَ أَرَانِي هَذَا عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ وَحَدَّثَنِي أَنَّ أَبَاهُكَانَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id], bahwa [Al Qasm bin Muhammad] memperlihatkan kepada mereka cara duduk tasyahud. Dia menegakkan kaki kanannya, menghamparkan kaki kirinya dan duduk di atas pangkal paha yang kiri, dan ia tidak duduk di atas telapak kakinya. Lalu ia berkata, \" [Abdullah bin Abdullah bin Umar] telah memperlihatkan ini kepadaku, dan ia katakan kepadaku bahwa [bapaknya] melakukan hal itu.\""
            },
            {
                "number": 188,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِوَهُوَ عَلَى الْمِنْبَرِ يُعَلِّمُ النَّاسَ التَّشَهُّدَ يَقُولُ قُولُوا التَّحِيَّاتُ لِلَّهِ الزَّاكِيَاتُ لِلَّهِ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Urwah bin Az Zubair] dari [Abdurrahman bin Abdin Al Qari] Bahwasanya ia mendengar [Umar bin Khatthab] di atas mimbar mengajarkan tasyahud kepada orang-orang. Umar berkata, \"Bacalah: 'ATTAHIYYAATU LILLAHI AZZAKIYAATU LILLAHI AT THAYYIBAAT ASHSHALAWAATU LILLAHI ASSALAAMU 'ALAIKA AYYUHAN NABIYYU WA RAHMATULLAHI WA BARAKAATUH, ASSALAMU 'ALAINAA WA 'ALAA 'IBAADILLAH ASH-SHAALIHIIN. ASYHADU AN LAA ILAAHA ILLALLAH WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH (Segala penghormatan yang suci hanya milik Allah, shalawat yang baik hanya milik Allah. Keselamatan bagimu wahai Nabi dan Rahmat Allah dan barakah-Nya, keselamatan bagi kami dan Hamba Hamba Allah yang Shalih. Aku bersaksi bahwa tiada Tuhan -yang berhak diibadahi- selain Allah, dan aku bersaksi bahwa Muhammad adalah hamba dan utusan Allah) '.\""
            },
            {
                "number": 189,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يَتَشَهَّدُ فَيَقُولُ بِسْمِ اللَّهِ التَّحِيَّاتُ لِلَّهِ الصَّلَوَاتُ لِلَّهِ الزَّاكِيَاتُ لِلَّهِ السَّلَامُ عَلَى النَّبِيِّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ شَهِدْتُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ شَهِدْتُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ يَقُولُ هَذَا فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ وَيَدْعُو إِذَا قَضَى تَشَهُّدَهُ بِمَا بَدَا لَهُ فَإِذَا جَلَسَ فِي آخِرِ صَلَاتِهِ تَشَهَّدَ كَذَلِكَ أَيْضًا إِلَّا أَنَّهُ يُقَدِّمُ التَّشَهُّدَ ثُمَّ يَدْعُو بِمَا بَدَا لَهُ فَإِذَا قَضَى تَشَهُّدَهُ وَأَرَادَ أَنْ يُسَلِّمَ قَالَ السَّلَامُ عَلَى النَّبِيِّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلَامُ عَلَيْكُمْ عَنْ يَمِينِهِ ثُمَّ يَرُدُّ عَلَى الْإِمَامِ فَإِنْ سَلَّمَ عَلَيْهِ أَحَدٌ عَنْ يَسَارِهِ رَدَّ عَلَيْهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'], bahwa [Abdullah bin Umar] bertasyahud dengan membaca: BISMILLAHIT TAHIYYAATI LILLAH ASHSHALAAWATU LILLAHIZ ZAAKIYAATU LILLAAH. ASSALAAMU 'ALAN NABIYYI WARAHMATULLAHI WABARAKAATUH. ASSALAAMU 'ALAINAA WA 'ALAA 'IBAADILLAHISH SHAALIHIIN. SYAHIDTU AN LAA ILAAHA ILLALLAH, SYAHIDTU ANNA MUHAMMADAR RASULAULLAH. (Dengan nama Allah, semua kemuliaan hanya milik Allah dan shalawat yang suci hanya milik Allah, kesalamatan bagimu wahai Nabi serta Rahmat Allah dan barakah-Nya. Kesalamatan atas kami dan hamba-hamba Allah yang Shalih. Saya bersaksi bahwa tiada Tuhan -yang berhak untuk disembah- selain Allah, dan saya bersaksi bahwa Muhammad adalah utusan Allah) . Abdullah bin Umar membaca ini pada dua rakaat yang pertama dan berdo'a jika telah selesai tasyahhud dengan do'a yang ada padanya. Jika dia duduk pada akhir sholatnya, maka dia duduk seperti itu juga, hanya saja dia mendahulukan tasyahhud kemudian baru berdo'a. Jika dia telah selesai tasyahud dan hendak salam, dia membaca: 'ASSALaAMU 'ALA ANNABI WARAHMATULLAHI WA BARAKAATUH. ASSALAAMMU 'ALAINaA WA 'ALaA 'IBAADILLAHISH SHALIHIIN (Keselamatan atas Nabi, rahmat Allah dan barakah-Nya. Keselamatan atas kami dan hamba hamba Allah yang Shalih) ', 'ASSALAAMU 'ALAIKUM ke sisi kanannya. Kemudian ia menjawab salam imam. Jika ada yang salam dari sisi kirinya dia juga menjawabnya.\""
            },
            {
                "number": 190,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا كَانَتْ تَقُولُ إِذَا تَشَهَّدَتْ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ الزَّاكِيَاتُ لِلَّهِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلَامُ عَلَيْكُمْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, Bahwasanya jika bertasyahud ia membaca: ATTAHIYYAATUT THAYYIBAATU ASHSHALAWAATU AZZAKIYYAATU LILLAAHI. ASYHADU AN LAA ILAAHA ILLALLAH WAHDAHU LAA SYARIIKA LAHU WA ANNA MUHAMMADAN ABDUHU WA RASUULUHU. ASSALAAMU 'ALAIKA AYYUHAN NABIYYU WARAHMATULLAHI WA BARAKAATUH ASSALAAMU 'ALAINA WA'ALAA 'IBAADILLAAHIS SHAALIHIN ASSALAAMU 'ALAIKUM. (Kesejahteraan yang baik dan shalawat yang suci hanya milik Allah. Aku bersaksi bahwa tiada ilah selain Allah satu-satunya dan tidak sekutu bagi-Nya. Aku bersaksi bahwa Muhammad adalah hamba-Nya dan utusan-Nya. Kesalamatan bagimu, wahai Nabi serta Rahmat Allah dan barakah-Nya. Kesalamatan atas kami dan hamba hamba Allah yang Shalih. Semoga keselamatan atas kalian) .\""
            },
            {
                "number": 191,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّهُ أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَكَانَتْ تَقُولُ إِذَا تَشَهَّدَتْ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ الزَّاكِيَاتُ لِلَّهِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُ اللَّهِ وَرَسُولُهُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ السَّلَامُ عَلَيْكُمْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id Al Anshari] dari [Al Qasim bin Muhammad] ia mengabarkan bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam jika tasyahhud membaca; ATTAHIYYAATUT THAYYIBAATU ASHSHALAWAATU AZZAKIYYAATU LILLAAHI. ASYHADU AN LAA ILAAHA ILLALLAH WAHDAHU LAA SYARIIKA LAHU WA ASYHADU ANNA MUHAMMADAN ABDULLAHI WA RASUULUH. ASSALAAMU 'ALAIKA AYYUHAN NABIYYU WARAHMATULLAHI WA BARAKAATUH ASSALAAMU 'ALAINA WA'ALAA 'IBAADILLAAHIS SHAALIHIIN ASSALAAMU 'ALAIKUM. (Kesejahteraan yang baik dan shalawat yang suci hanya milik Allah. Aku bersaksi bahwa tiada ilah selain Allah satu-satunya dan tidak sekutu bagi-Nya. Aku bersaksi bahwa Muhammad adalah hamba Allah dan utusan-Nya. Kesalamatan bagimu, wahai Nabi serta Rahmat Allah dan barakah-Nya. Kesalamatan atas kami dan hamba hamba Allah yang Shalih. Semoga keselamatan atas kalian) .\""
            },
            {
                "number": 192,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَأَلَ ابْنَ شِهَابٍ وَنَافِعًا مَوْلَى ابْنِ عُمَرَعَنْ رَجُلٍ دَخَلَ مَعَ الْإِمَامِ فِي الصَّلَاةِ وَقَدْ سَبَقَهُ الْإِمَامُ بِرَكْعَةٍ أَيَتَشَهَّدُ مَعَهُ فِي الرَّكْعَتَيْنِ وَالْأَرْبَعِ وَإِنْ كَانَ ذَلِكَ لَهُ وِتْرًا فَقَالَا لِيَتَشَهَّدْ مَعَهُقَالَ مَالِك وَهُوَ الْأَمْرُ عِنْدَنَا",
                "id": "Telah menceritakan kepadaku dari Malik dia bertanya kepada [Ibnu Syihab] dan [Nafi'] mantan budak Ibnu Umar, tentang seorang laki-laki yang masuk sholat jama'ah dan tertinggal satu rakaat. Apakah dia bertasyahhud bersama imam pada rakaat kedua dan keempat, meskipun itu adalah rakaat ganjil baginya? Keduanya menjawab, \"Suruh agar dia bertasyahhud bersama imam.\" Malik berkata, \"Itulah pendapat kami.\""
            },
            {
                "number": 193,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَلْقَمَةَ عَنْ مَلِيحِ بْنِ عَبْدِ اللَّهِ السَّعْدِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَالَّذِي يَرْفَعُ رَأْسَهُ وَيَخْفِضُهُ قَبْلَ الْإِمَامِ فَإِنَّمَا نَاصِيَتُهُ بِيَدِ شَيْطَانٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Muhammad bin 'Amru bin Alqamah] dari [Malih bin Abdullah As Sa'di] dari [Abu Hurairah] ia berkata, \"Orang yang mengangkat dan menurunkan kepalanya sebelum imam, maka ubun-ubunnya berada di genggaman setan.\""
            },
            {
                "number": 194,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ مِنَ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الْيَدَيْنِ أَقَصُرَتْ الصَّلَاةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَدَقَ ذُو الْيَدَيْنِ فَقَالَ النَّاسُ نَعَمْ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَكْعَتَيْنِ أُخْرَيَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ayyub bin Abu Tamimah As Sakhtiyani] dari [Muhammad bin Sirin] dari [Abu Hurairah], bahwasanya pernah Rasulullah shallallahu 'alaihi wasallam berlalu pada dua rakaat. Dzul Yadain bertanya, \"Apakah anda mengqashar sholat atau lupa, Wahai Rasulullah?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Apakah Dzul Yadain benar?\" para sahabat menjawab, \"Ya benar.\" Rasulullah shallallahu 'alaihi wasallam lantas berdiri menyempurnakan dua rakaat lainnya, kemudian salam dan bertakbir dan sujud seperti sujud biasanya atau agak lama. Lantas beliau bangkit, lalu bertakbir, lalu bersujud seperti biasanya atau agak lama. Kemudian beliau bangun kembali.\""
            },
            {
                "number": 195,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ أَبِي سُفْيَانَ مَوْلَى ابْنِ أَبِي أَحْمَدَ أَنَّهُ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْعَصْرِ فَسَلَّمَ فِي رَكْعَتَيْنِ فَقَامَ ذُو الْيَدَيْنِ فَقَالَ أَقَصُرَتْ الصَّلَاةُ يَا رَسُولَ اللَّهِ أَمْ نَسِيتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ ذَلِكَ لَمْ يَكُنْ فَقَالَ قَدْ كَانَ بَعْضُ ذَلِكَ يَا رَسُولَ اللَّهِ فَأَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى النَّاسِ فَقَالَ أَصَدَقَ ذُو الْيَدَيْنِ فَقَالُوا نَعَمْ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَمَّ مَا بَقِيَ مِنْ الصَّلَاةِ ثُمَّ سَجَدَ سَجْدَتَيْنِ بَعْدَ التَّسْلِيمِ وَهُوَ جَالِسٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Daud bin Al Hushain] dari [Abu Sufyan] mantan budak Ibnu Abu Ahmad, ia berkata; Saya mendengar [Abu Hurairah] berkata, \" Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat asar, lalu beliau salam pada rakaat yang kedua. Dzul Yadain pun berdiri dan bertanya, \"Wahai Rasulullah, apakah anda mengqashar sholat atau lupa?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Keduanya tidak.\" Dzul Yadain berkata, \"Tapi itu terjadi, wahai Rasulullah! \" Kemudian Rasulullah shallallahu 'alaihi wasallam menghadap orang-orang dan bertanya: \"Apakah Dzul Yadain benar?\" mereka menjawab, \"Ya benar.\" Maka Rasulullah shallallahu 'alaihi wasallam pun berdiri dan menyempurnakan sholat yang tersisa, setelah itu beliau sujud dengan dua sujud setelah salam, dan beliau dalam keadaan duduk.\""
            },
            {
                "number": 196,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ قَالَ بَلَغَنِيأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكَعَ رَكْعَتَيْنِ مِنْ إِحْدَى صَلَاتَيْ النَّهَارِ الظُّهْرِ أَوْ الْعَصْرِ فَسَلَّمَ مِنَ اثْنَتَيْنِ فَقَالَ لَهُ ذُو الشِّمَالَيْنِ أَقَصُرَتْ الصَّلَاةُ يَا رَسُولَ اللَّهِ أَمْ نَسِيتَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَصُرَتْ الصَّلَاةُ وَمَا نَسِيتُ فَقَالَ ذُو الشِّمَالَيْنِ قَدْ كَانَ بَعْضُ ذَلِكَ يَا رَسُولَ اللَّهِ فَأَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى النَّاسِ فَقَالَ أَصَدَقَ ذُو الْيَدَيْنِ فَقَالُوا نَعَمْ يَا رَسُولَ اللَّهِ فَأَتَمَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَقِيَ مِنْ الصَّلَاةِ ثُمَّ سَلَّمَو حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abu Bakar bin Suliman bin Abu Hatsmah] berkata; telah sampai kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam pernah sholat dua rakaat antara sholat dzuhur atau asar, kemudian beliau salam pada dua rakaat. Dzus Syimalain bertanya, \"Wahai Rasulullah, apakah anda mengqashar sholat atau memang lupa?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Saya tidak mengqashar sholat dan tidak juga lupa.\" Dzus Syimalain berkata, \"Wahai Rasulullah, salah satunya telah terjadi.\" Rasulullah shallallahu 'alaihi wasallam menghadap orang-orang dan bertanya: \"Apakah Dzul Yadain benar?\" mereka menjawab, \"Ya benar, wahai Rasulullah.\" Rasulullah shallallahu 'alaihi wasallam kemudian menyempurnakan sholat yang tersisa, setelah itu salam.\" Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dan dari [Abu Salamah bin Abdurrahman] seperti dalam hadits tersebut."
            },
            {
                "number": 197,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَلَمْ يَدْرِ كَمْ صَلَّى أَثَلَاثًا أَمْ أَرْبَعًا فَلْيُصَلِّي رَكْعَةً وَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ فَإِنْ كَانَتْ الرَّكْعَةُ الَّتِي صَلَّى خَامِسَةً شَفَعَهَا بِهَاتَيْنِ السَّجْدَتَيْنِ وَإِنْ كَانَتْ رَابِعَةً فَالسَّجْدَتَانِ تَرْغِيمٌ لِلشَّيْطَانِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Atha bin Yasar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian ragu dalam sholatnya, tidak tahu berapa rakaat dia telah sholat, apakah empat atau tiga? maka hendaklah dia sholat (lagi) satu rakaat, kemudian dia sujud dua kali sebelum salam. Jika rakaat yang dia kerjakan adalah yang kelima, dia telah menggenapkannya dengan dua sujud tadi. Jika itu adalah yang keempat maka itu untuk menghinakan setan.\""
            },
            {
                "number": 198,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ زَيْدٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُإِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيَتَوَخَّ الَّذِي يَظُنُّ أَنَّهُ نَسِيَ مِنْ صَلَاتِهِ فَلْيُصَلِّهِ ثُمَّ لْيَسْجُدْ سَجْدَتَيْ السَّهْوِ وَهُوَ جَالِسٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Umar bin Muhammad bin Zaid] dari [Salim bin Abdullah] bahwasanya [Abdullah bin Umar] berkata; \"Apabila salah seorang dari kalian ragu dalam sholatnya, hendaklah dia mencari apa yang diyakini bahwa dia telah lupa dalam sholatnya, kemudian hendaklah ia mengerjakannya lalu sujud sahwi dua kali ketika dia masih duduk.\""
            },
            {
                "number": 199,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَفِيفِ بْنِ عَمْرٍو السَّهْمِيِّ عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّهُ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ وَكَعْبَ الْأَحْبَارِعَنْ الَّذِي يَشُكُّ فِي صَلَاتِهِ فَلَا يَدْرِي كَمْ صَلَّى أَثَلَاثًا أَمْ أَرْبَعًا فَكِلَاهُمَا قَالَ لِيُصَلِّ رَكْعَةً أُخْرَى ثُمَّ لْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Afif bin 'Amr As Sahm] dari [Atha bin Yasar] ia berkata, \"Saya telah bertanya kepada [Abdullah bin 'Amru bin Al 'Ash] dan [Ka'b Al Akhbar] tentang seorang laki-laki yang ragu dalam sholatnya, apakah dia telah sholat tiga atau empat rakaat. Keduanya menjawab; \"Suruh dia sholat satu rakaat kemudian sujud dua kali saat masih duduk.\""
            },
            {
                "number": 200,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا سُئِلَ عَنْ النِّسْيَانِ فِي الصَّلَاةِ قَالَ لِيَتَوَخَّ أَحَدُكُمْ الَّذِي يَظُنُّ أَنَّهُ نَسِيَ مِنْ صَلَاتِهِ فَلْيُصَلِّهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] ketika ditanya tentang lupa dalam sholat, dia menjawab, \"Hendaknya salah seorang dari mencari apa yang ia yakini telah lupa, lalu sempurnakanlah sholatnya.\""
            },
            {
                "number": 201,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ الْأَعْرَجِ عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ أَنَّهُ قَالَصَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ ثُمَّ قَامَ فَلَمْ يَجْلِسْ فَقَامَ النَّاسُ مَعَهُ فَلَمَّا قَضَى صَلَاتَهُ وَنَظَرْنَا تَسْلِيمَهُ كَبَّرَ ثُمَّ سَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ ثُمَّ سَلَّمَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Al A'raj] dari [Abdullah bin Buhainah] berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat dua rakaat bersama kami. Kemudian beliau langsung berdiri tanpa duduk, sementara orang-orang tetap mengikuti beliau berdiri. Tatkala beliau selesai sholat dan kami melihat salamnya, beliau takbir kemudian sujud dua kali sebelum salam, setelah itu salam dan masih dalam keadaan duduk.\""
            },
            {
                "number": 202,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ أَنَّهُ قَالَصَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فَقَامَ فِي اثْنَتَيْنِ وَلَمْ يَجْلِسْ فِيهِمَا فَلَمَّا قَضَى صَلَاتَهُ سَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ بَعْدَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abdurrahman bin Hurmuz] dari [Abdullah bin Buhainah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat zhuhur bersama kami. Beliau berdiri pada rakaat yang kedua dan tidak duduk di dalamnya. Tatkala selesai sholat, beliau sujud dengan dua kali sujud, kemudian salam setelahnya.\""
            },
            {
                "number": 203,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ عَنْ أُمِّهِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْأَهْدَى أَبُو جَهْمِ بْنُ حُذَيْفَةَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمِيصَةً شَامِيَّةً لَهَا عَلَمٌ فَشَهِدَ فِيهَا الصَّلَاةَ فَلَمَّا انْصَرَفَ قَالَ رُدِّي هَذِهِ الْخَمِيصَةَ إِلَى أبِي جَهْمٍ فَإِنِّي نَظَرْتُ إِلَى عَلَمِهَا فِي الصَّلَاةِ فَكَادَ يَفْتِنُنِي",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Alqamah bin Abu Alqamah] dari [Ibunya], bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam berkata, \"Abu Jahm bin Hudzaifah menghadiahkan baju dari Syam yang ada gambarnya kepada Rasulullah shallallahu 'alaihi wasallam. Beliau melihatnya dalam sholat. Tatkala selesai sholat beliau bersabda: \"Kembalikan baju ini kepada Abu Jahm, karena aku melihat gambarnya dalam sholat dan hampir menjadi fitnah bagiku.\""
            },
            {
                "number": 204,
                "arab": "و حَدَّثَنِي مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِسَ خَمِيصَةً لَهَا عَلَمٌ ثُمَّ أَعْطَاهَا أَبَا جَهْمٍ وَأَخَذَ مِنْ أَبِي جَهْمٍ أَنْبِجَانِيَّةً لَهُ فَقَالَ يَا رَسُولَ اللَّهِ وَلِمَ فَقَالَ إِنِّي نَظَرْتُ إِلَى عَلَمِهَا فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepadaku Malik dari [Hisyam bin Urwah] dari [Bapaknya], bahwa Rasulullah shallallahu 'alaihi wasallam memakai baju yang ada lukisannya, kemudian beliau memberikannya kepada Abu Jahm dan mengambil jaket kulit milik Abu Jahm. Abu Jahm bertanya, \"Kenapa Wahai Rasulullah?\" beliau menjawab: \"Saya melihat lukisannya dalam sholat.\""
            },
            {
                "number": 205,
                "arab": "و حَدَّثَنِي مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍأَنَّ أَبَا طَلْحَةَ الْأَنْصَارِيَّ كَانَ يُصَلِّي فِي حَائِطِهِ فَطَارَ دُبْسِيٌّ فَطَفِقَ يَتَرَدَّدُ يَلْتَمِسُ مَخْرَجًا فَأَعْجَبَهُ ذَلِكَ فَجَعَلَ يُتْبِعُهُ بَصَرَهُ سَاعَةً ثُمَّ رَجَعَ إِلَى صَلَاتِهِ فَإِذَا هُوَ لَا يَدْرِي كَمْ صَلَّى فَقَالَ لَقَدْ أَصَابَتْنِي فِي مَالِي هَذَا فِتْنَةٌ فَجَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ لَهُ الَّذِي أَصَابَهُ فِي حَائِطِهِ مِنْ الْفِتْنَةِ وَقَالَ يَا رَسُولَ اللَّهِ هُوَ صَدَقَةٌ لِلَّهِ فَضَعْهُ حَيْثُ شِئْتَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] bahwa [Abu Thalhah Al Anshari] pernah sholat di kebunnya, maka ada belalang yang terbang dan bingung mencari jalan keluar hingga Abu Thalhah terheran-heran dan matanya tertuju padanya sesaat. Dia kembali pada sholatnya dan dia tidak tahu berapa rakaat yang telah ia kerjakan?\" Dia lalu berujar, \"Sungguh, saya telah sibuk dengan hartaku, ini adalah fitnah.\" Kemudian dia menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan tentang fitnah yang telah menimpanya di kebun. Dia katakan, \"Wahai Rasulullah! Kebun ini saya sedekahkan untuk Allah. Aturlah sesesuai kemauan anda.\""
            },
            {
                "number": 206,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ أَنَّ رَجُلًا مِنْ الْأَنْصَارِكَانَ يُصَلِّي فِي حَائِطٍ لَهُ بِالْقُفِّ وَادٍ مِنْ أَوْدِيَةِ الْمَدِينَةِ فِي زَمَانِ الثَّمَرِ وَالنَّخْلُ قَدْ ذُلِّلَتْ فَهِيَ مُطَوَّقَةٌ بِثَمَرِهَا فَنَظَرَ إِلَيْهَا فَأَعْجَبَهُ مَا رَأَى مِنْ ثَمَرِهَا ثُمَّ رَجَعَ إِلَى صَلَاتِهِ فَإِذَا هُوَ لَا يَدْرِي كَمْ صَلَّى فَقَالَ لَقَدْ أَصَابَتْنِي فِي مَالِي هَذَا فِتْنَةٌ فَجَاءَ عُثْمَانَ بْنَ عَفَّانَ وَهُوَ يَوْمَئِذٍ خَلِيفَةٌ فَذَكَرَ لَهُ ذَلِكَ وَقَالَ هُوَ صَدَقَةٌ فَاجْعَلْهُ فِي سُبُلِ الْخَيْرِ فَبَاعَهُ عُثْمَانُ بْنُ عَفَّانَ بِخَمْسِينَ أَلْفًا فَسُمِّيَ ذَلِكَ الْمَالُ الْخَمْسِينَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar], bahwa ada seorang laki-laki Anshar yang sholat di kebunnya di Al Quf -sebuah lembah yang ada di Madinah- pada musim kurma yang menjulang buahnya dan layak panen. Laki-laki itu memperhatikan buah kurma tersebut hingga membuatnya taajub, kemudian ia kembali pada konsentrasi sholatnya, namun ternyata dia tidak tahu berapa rakaat yang telah dia kerjakan?\" Kemudian dia berkata, \"Sungguh, saya telah tertimpa musibah dengan hartaku, ini adalah fitnah.\" Laki-laki itu kemudian menemui [Utsman bin Affan] yang waktu itu menjadi Khalifah. Dia menceritakan hal itu, dia katakan, \"Kebun itu saya sedekahkan, maka gunakanlah di jalan kebenaran.\" Utsman bin Affan menjualnya dengan lima puluh ribu, hingga harta itu diberi nama Al khamsin (limapluh ribu) .\""
            },
            {
                "number": 207,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحَدَكُمْ إِذَا قَامَ يُصَلِّي جَاءَهُ الشَّيْطَانُ فَلَبَسَ عَلَيْهِ حَتَّى لَا يَدْرِيَ كَمْ صَلَّى فَإِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman bin Auf] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian berdiri sholat, setan datang kepadanya, menggodanya hingga dia tidak tahu berapa rakaat yang telah dia kerjakan. Jika kalian mendapatkan hal itu, maka sujudlah dua kali saat masih duduk\""
            },
            {
                "number": 208,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فِي السَّاعَةِ الْأُولَى فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الْإِمَامُ حَضَرَتْ الْمَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Sumayya] mantan budak Abu Bakar bin Abdurrahman, dari [Abu Shalih As Samman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mandi hari Jumat seperti mandi junub lalu berangkat pada waktu yang pertama, maka seakan ia telah berkurban dengan seekor unta. Barangsiapa berangkat pada waktu yang kedua, maka seakan-akan dia berkurban dengan seekor sapi. Barangsiapa berangkat pada waktu yang ketiga, maka seakan dia berkurban dengan seekor kambing. Barangsiapa berangkat pada waktu yang keempat, maka seakan dia berkurban dengan seekor ayam. Dan barangsiapa berangkat pada waktu yang kelima, maka seakan dia berkurban dengan sebutir telur. Maka jika imam telah datang, para malaikat hadir untuk mendengarkan khutbah.\""
            },
            {
                "number": 209,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ كَانَ يَقُولُغُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ كَغُسْلِ الْجَنَابَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Sa'id Abu Abu Sa'id Al Maqburi] dari [Abu Hurairah] dia berkata; \"Mandi besar (mandi junub) pada hari jumat hukumnya adalah wajib bagi setiap orang yang telah mimpi basah.\""
            },
            {
                "number": 210,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَعُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ فَقَالَ عُمَرُأَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ انْقَلَبْتُ مِنْ السُّوقِ فَسَمِعْتُ النِّدَاءَ فَمَا زِدْتُ عَلَى أَنْ تَوَضَّأْتُ فَقَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِالْغُسْلِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Salim bin Abdullah] ia berkata; \"Ada seorang laki-laki dari sahabat Nabi shallallahu 'alaihi wasallam masuk ke dalam masjid pada hari Jumat, saat itu Umar bin Khatthab sedang berkhutbah. [Umar bin Khattab] lalu bertanya, \"Jam berapa ini! \" Laki-laki itu menjawab, \"Wahai Amirul Mukminin, saya baru kembali dari pasar, kemudian aku mendengar adzan. Dan aku tidak sempat melakukan apapun kecuali hanya berwudlu.\" Umar berkata, \"Hanya berwudhu saja! \" Bukankah kamu tahu bahwa Rasulullah shallallahu 'alaihi wasallam menyuruh untuk mandi.\""
            },
            {
                "number": 211,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Shafwan bin Sulaim] dari [Atha bin Yasar] dari [Abu Sa'id Al Khudri], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi hari Jumat wajib bagi setiap orang yang telah mimpi basah.\""
            },
            {
                "number": 212,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَاءَ أَحَدُكُمْ الْجُمُعَةَ فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian hendak mendatangi Jumat, hendaklah dia mandi.\""
            },
            {
                "number": 213,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ وَالْإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَدْ لَغَوْتَ",
                "id": "Telah menceritakan kepadaku dari Yahya dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu berkata pada saudaramu; 'Diamlah! ' ketika imam sedang berkhutbah, niscaya kamu telah berbuat sia-sia.\""
            },
            {
                "number": 214,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ الْقُرَظِيِّ أَنَّهُ أَخْبَرَهُأَنَّهُمْ كَانُوا فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ يُصَلُّونَ يَوْمَ الْجُمُعَةِ حَتَّى يَخْرُجَ عُمَرُ فَإِذَا خَرَجَ عُمَرُ وَجَلَسَ عَلَى الْمِنْبَرِ وَأَذَّنَ الْمُؤَذِّنُونَ قَالَ ثَعْلَبَةُ جَلَسْنَا نَتَحَدَّثُ فَإِذَا سَكَتَ الْمُؤَذِّنُونَ وَقَامَ عُمَرُ يَخْطُبُ أَنْصَتْنَا فَلَمْ يَتَكَلَّمْ مِنَّا أَحَدٌقَالَ ابْنُ شِهَابٍ فَخُرُوجُ الْإِمَامِ يَقْطَعُ الصَّلَاةَ وَكَلَامُهُ يَقْطَعُ الْكَلَامَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Tsa'labah bin Abu Malik Al Qurazhi] ia mengabarkan, bahwa mereka melaksanakan sholat jumat pada masa [Umar bin Khatthab] ketika Umar telah keluar. Jika Umar telah keluar dan duduk di atas mimbar, Muaddzin mengumandangkan adzan.\" Tsa'labah berkata, \"Kami masih duduk mengobrol, jika muaddzin telah diam dan Umar berdiri berkhutbah, maka kami pun diam dan tidak ada seorangpun yang berbicara.\" Ibnu Syihab berkata; \"Keluarnya imam menghentikan sholat, dan khutbahnya menghentikan pembicaraan.\""
            },
            {
                "number": 215,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ مَالِكِ بْنِ أَبِي عَامِرٍ أَنَّ عُثْمَانَ بْنَ عَفَّانَ كَانَ يَقُولُ فِي خُطْبَتِهِ قَلَّ مَا يَدَعُ ذَلِكَ إِذَا خَطَبَإِذَا قَامَ الْإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَاسْتَمِعُوا وَأَنْصِتُوا فَإِنَّ لِلْمُنْصِتِ الَّذِي لَا يَسْمَعُ مِنْ الْحَظِّ مِثْلَ مَا لِلْمُنْصِتِ السَّامِعِ فَإِذَا قَامَتْ الصَّلَاةُ فَاعْدِلُوا الصُّفُوفَ وَحَاذُوا بِالْمَنَاكِبِ فَإِنَّ اعْتِدَالَ الصُّفُوفِ مِنْ تَمَامِ الصَّلَاةِ ثُمَّ لَا يُكَبِّرُ حَتَّى يَأْتِيَهُ رِجَالٌ قَدْ وَكَّلَهُمْ بِتَسْوِيَةِ الصُّفُوفِ فَيُخْبِرُونَهُ أَنْ قَدْ اسْتَوَتْ فَيُكَبِّرُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Nadlr] mantan budak Umar bin ubaidhullah, dari [Malik bin 'Amir] bahwa [Utsman bin Affan] pernah berkata dalam khutbahnya, dan jarang sekali ia meninggalkan dalam berkhutbah; \"Jika seorang imam telah berdiri berkhutbah pada Hari Jum'at, maka dengarkanlah dan diamlah. Sesungguhnya orang yang diam tetapi tidak mendengarkan, pahalanya tidak sama dengan orang yang diam dan tetap mendengarkan. Jika sholat hendak ditegakkan, maka luruskanlah shaf dan rapatkan antara bahu dengan bahu. Sesungguhnya lurusnya shaf termasuk bagian dari sempurnanya sholat.\" Umar tidak bertakbir hingga orang-orang yang diberi tugas untuk meluruskan shaf datang mengabarkan kepadanya, bahwa shaf telah lurus. Setelah itu ia pun bertakbir.\""
            },
            {
                "number": 216,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَرَأَى رَجُلَيْنِ يَتَحَدَّثَانِ وَالْإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَحَصَبَهُمَا أَنْ اصْمُتَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'], bahwa [Abdullah bin Umar] melihat dua orang laki-laki yang mengobrol ketika imam sedang berkhutbah pada Hari Jum'at. Maka ia pun melemparnya dengan kerikil agar mereka berdua diam.\""
            },
            {
                "number": 217,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ الْكَلَامِ يَوْمَ الْجُمُعَةِ إِذَا نَزَلَ الْإِمَامُ عَنْ الْمِنْبَرِ قَبْلَ أَنْ يُكَبِّرَ فَقَالَ ابْنُ شِهَابٍلَا بَأْسَ بِذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dia bertanya kepada [Ibnu Syihab] tentang berbicara pada Hari Jumat, ketika imam telah turun dari mimbar sebelum bertakbir. Ibnu Syihab menjawab; \"Yang demikian itu tidak masalah.\""
            },
            {
                "number": 218,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّهُ كَانَ يَقُولُمَنْ أَدْرَكَ مِنْ صَلَاةِ الْجُمُعَةِ رَكْعَةً فَلْيُصَلِّ إِلَيْهَا أُخْرَىقَالَ ابْنُ شِهَابٍ وَهِيَ السُّنَّةُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dia berkata; \"Barangsiapa mendapatkan satu rakaat dari sholat jumat, maka sempurnakanlah yang lainnya.\" Ibnu Syihab berkata; \"Hal itu adalah sunah.\""
            },
            {
                "number": 219,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك أَنَّهُ سَأَلَ ابْنَ شِهَابٍعَنْ قَوْلِ اللَّهِ عَزَّ وَجَلَّ{ يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ }فَقَالَ ابْنُ شِهَابٍ كَانَ عُمَرُ بْنُ الْخَطَّابِ يَقْرَؤُهَا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَامْضُوا إِلَى ذِكْرِ اللَّهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dia bertanya kepada [Ibnu Syihab] tentang firman Allah Azza Wa Jalla: '(Wahai orang-orang yang beriman, apabila kalian dipanggil untuk sholat di hari Jumat maka bersegerlah menuju dzikir kepada Allah..) \" Qs. Al Jumu'ah: 9) Ibnu Syihab berkata; \" [Umar bin Al Khattahab] membacanya dengan; 'Apabila kalian dipanggil untuk sholat maka berlalulah menuju Dzikir kepada Allah'.\""
            },
            {
                "number": 220,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ فِيهِ سَاعَةٌ لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ وَأَشَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ يُقَلِّلُهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam menyebutkan pada hari Jumat dengan bersabda: \"Di dalamnya terdapat satu waktu, tiada seorang hamba muslim yang menepatinya dengan berdiri sholat memohon sesuatu pada Allah, melainkan Allah pasti akan memberi apa yang dia minta.\" Rasulullah shallallahu 'alaihi wasallam lantas memberi isyarat dengan tangannya untuk menunjukkan sedikitnya waktu tersebut.\""
            },
            {
                "number": 221,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَخَرَجْتُ إِلَى الطُّورِ فَلَقِيتُ كَعْبَ الْأَحْبَارِ فَجَلَسْتُ مَعَهُ فَحَدَّثَنِي عَنْ التَّوْرَاةِ وَحَدَّثْتُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ فِيمَا حَدَّثْتُهُ أَنْ قُلْتُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ مِنْ الْجَنَّةِ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ مَاتَ وَفِيهِ تَقُومُ السَّاعَةُ وَمَا مِنْ دَابَّةٍ إِلَّا وَهِيَ مُصِيخَةٌ يَوْمَ الْجُمُعَةِ مِنْ حِينِ تُصْبِحُ حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنْ السَّاعَةِ إِلَّا الْجِنَّ وَالْإِنْسَ وَفِيهِ سَاعَةٌ لَا يُصَادِفُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُقَالَ كَعْبٌ ذَلِكَ فِي كُلِّ سَنَةٍ يَوْمٌ فَقُلْتُ بَلْ فِي كُلِّ جُمُعَةٍ فَقَرَأَ كَعْبٌ التَّوْرَاةَ فَقَالَ صَدَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو هُرَيْرَةَ فَلَقِيتُ بَصْرَةَ بْنَ أَبِي بَصْرَةَ الْغِفَارِيَّ فَقَالَ مِنْ أَيْنَ أَقْبَلْتَ فَقُلْتُ مِنْ الطُّورِ فَقَالَ لَوْ أَدْرَكْتُكَ قَبْلَ أَنْ تَخْرُجَ إِلَيْهِ مَا خَرَجْتَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُعْمَلُ الْمَطِيُّ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ إِلَى الْمَسْجِدِ الْحَرَامِ وَإِلَى مَسْجِدِي هَذَا وَإِلَى مَسْجِدِ إِيلِيَاءَ أَوْ بَيْتِ الْمَقْدِسِ يَشُكُّ قَالَ أَبُو هُرَيْرَةَ ثُمَّ لَقِيتُ عَبْدَ اللَّهِ بْنَ سَلَامٍ فَحَدَّثْتُهُ بِمَجْلِسِي مَعَ كَعْبِ الْأَحْبَارِ وَمَا حَدَّثْتُهُ بِهِ فِي يَوْمِ الْجُمُعَةِ فَقُلْتُ قَالَ كَعْبٌ ذَلِكَ فِي كُلِّ سَنَةٍ يَوْمٌ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ كَذَبَ كَعْبٌ فَقُلْتُ ثُمَّ قَرَأَ كَعْبٌ التَّوْرَاةَ فَقَالَ بَلْ هِيَ فِي كُلِّ جُمُعَةٍ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ صَدَقَ كَعْبٌ ثُمَّ قَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ قَدْ عَلِمْتُ أَيَّةَ سَاعَةٍ هِيَ قَالَ أَبُو هُرَيْرَةَ فَقُلْتَ لَهُ أَخْبِرْنِي بِهَا وَلَا تَضَنَّ عَلَيَّ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ هِيَ آخِرُ سَاعَةٍ فِي يَوْمِ الْجُمُعَةِ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ وَكَيْفَ تَكُونُ آخِرَ سَاعَةٍ فِي يَوْمِ الْجُمُعَةِ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَادِفُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي وَتِلْكَ السَّاعَةُ سَاعَةٌ لَا يُصَلَّى فِيهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ أَلَمْ يَقُلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَلَسَ مَجْلِسًا يَنْتَظِرُ الصَّلَاةَ فَهُوَ فِي صَلَاةٍ حَتَّى يُصَلِّيَ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ بَلَى قَالَ فَهُوَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Abdullah bin Al Had] dari [Muhammad bin Ibrahim bin Al Harits At Taim] dari [Abu Salamah bin Abdurrahman bin Auf] dari [Abu Hurairah] dia berkata; \"Aku keluar menuju bukit Thur, lalu aku bertemu dengan [Ka'b Al Ahbar] dan duduk bersamanya. Ka'b menceritakan kepadaku tentang Taurat, sedangkan aku menceritakan kepadanya apa yang aku dengar dari Rasulullah shallallahu 'alaihi wasallam. Di antara yang aku ceritakan adalah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik hari yang matahari terbit di dalamnya adalah hari Jum'at. Pada hari tersebut Adam diciptakan dan diturunkan dari surga. Pada hari itu Adam diterima taubatnya. Pada hari itu Adam meninggal dunia, dan pada hari itu akan terjadi kiamat. Tiada seekor binatang melatapun kecuali akan mendengar, dari pagi sampai matahari terbit karena takut dengan Hari Kiamat, kecuali jin dan manusia. Di dalamnya ada satu waktu, tiada seorang hamba muslim yang menepatinya dengan berdiri sholat, memohon sesuatu pada Allah, melainkan Allah pasti akan memberikan kepadanya apa yang dipinta.\" Ka'b bertanya, \"Apakah hal itu terjadi hanya sekali saja dalam setahun?\" Aku menjawab, \"Bahkan terjadi dalam setiap Jum'at.\" Lalu Ka'b membaca Taurat dan berkata; \"Rasulullah shallallahu 'alaihi wasallam benar.\" Abu Hurairah berkata, \"Aku kemudian bertemu [Bashrah bin Abu Bashrah Al Ghifari], dia bertanya, \"Dari mana kamu? ' Aku menjawab, \"Dari bukit Thur.\" Dia berkata, \"Kalau saja aku mendapatimu sebelum kamu keluar ke Thur, niscaya kamu tidak akan pergi. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidaklah hewan tunggangan digunakan untuk perjalanan jauh kecuali menuju tiga masjid; Masjidil Haram, masjidku ini dan masjid Iliya`, atau Baitul Maqdis.\" Abu Hurairah berkata, \"Kemudian aku bertemu [Abdullah bin Salam] dan aku ceritakan kepadanya tentang pertemuanku dengan Ka'b Al Ahbar dan apa yang kami perbincangkan di hari Jumat. Saya katakan, \"Ka'b berkata, \"Hal itu terjadi hanya sekali saja dalam setahun.\" Abdullah bin Salam berkata, \"Ka'b telah berbohong! \" Aku berkata, \"Kemudian Ka'b membaca Taurat, lalu berkata, \"Ya benar, yang demikian itu terjadi dalam setiap Jumat.\" Abdullah bin Salam berkata, \"Ka'b benar.\" Kemudian dia berkata; \"Sungguh saya tahu kapan itu?\" Abu Hurairah berkata; \"Saya meminta kepadanya, \"Kabarkanlah kepadaku kapan itu terjadi dan jangan sembunyikan?\" Abdullah bin Salam menjawab; \"Itu adalah waktu terakhir di hari Jumat\" Abu Hurairah berkata; \"Lalu aku bertanya, \"Bagaimana mungkin terjadi pada saat itu, sedangkan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba muslim menepatinya dengan berdiri sholat', padahal di saat itu tidak boleh sholat di dalamnya? Abdullah bin Salam menjawab: \"Bukankah Rasulullah shallallahu 'alaihi wasallam juga bersabda: \"Barangsiapa duduk menunggu sholat, maka dia dalam keadaan sholat hingga dia melaksanakan sholat'. Abu Hurairah menjawab; \"Aku pun berkata, \"Ya benar.\" Abdullah bin Salam berkata, \"Itulah maksudnya.\""
            },
            {
                "number": 222,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ بَلَغَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا عَلَى أَحَدِكُمْ لَوْ اتَّخَذَ ثَوْبَيْنِ لِجُمُعَتِهِ سِوَى ثَوْبَيْ مَهْنَتِهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] telah sampai kabar kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah beratnya jika salah seorang dari kalian memakai dua baju untuk sholat Jum'at, selain dua baju yang dia pakai sehari hari.\""
            },
            {
                "number": 223,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ لَا يَرُوحُ إِلَى الْجُمُعَةِ إِلَّا ادَّهَنَ وَتَطَيَّبَ إِلَّا أَنْ يَكُونَ حَرَامًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'], bahwa [Abdullah bin Umar] tidak berangkat sholat Jumat meliankan ia telah memakai minyak dan wewangian terlebih dahulu, kecuali jika wewanian itu haram.\""
            },
            {
                "number": 224,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ عَمَّنْ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ كَانَ يَقُولُلَأَنْ يُصَلِّيَ أَحَدُكُمْ بِظَهْرِ الْحَرَّةِ خَيْرٌ لَهُ مِنْ أَنْ يَقْعُدَ حَتَّى إِذَا قَامَ الْإِمَامُ يَخْطُبُ جَاءَ يَتَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِقَالَ مَالِك السُّنَّةُ عِنْدَنَا أَنْ يَسْتَقْبِلَ النَّاسُ الْإِمَامَ يَوْمَ الْجُمُعَةِ إِذَا أَرَادَ أَنْ يَخْطُبَ مَنْ كَانَ مِنْهُمْ يَلِي الْقِبْلَةَ وَغَيْرَهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar bin Hazm] dari [seseorang yang menceritakan kepadanya] dari [Abu Hurairah] dia berkata; \"Jika salah seorang dari kalian sholat di bawah terik panas, maka itu lebih baginya daripada hanya duduk, kemudian ketika khatib berdiri berkhutbah, dia pada hari jumat datang dengan melangkahi bahu orang-orang.\" Malik berkata; \"Menurut kami yang disunahkan pada hari jum'at adalah, menghadap ke arah imam saat imam berkhutbah di manapun mereka berada, baik (imam) berada di arah qiblat ataupun tidak.\""
            },
            {
                "number": 225,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ الضَّحَّاكَ بْنَ قَيْسٍ سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍمَاذَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ قَالَ كَانَ يَقْرَأُ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Dlamrah bin Sa'id Al-Mazini] dari [ubaidhullah bin Abdullah bin 'Utbah bin Mas'ud], bahwa Ad Dlahhak bin Qais bertanya kepada [Nu'man bin Basyir], \"Apa yang dibaca Rasulullah shallallahu 'alaihi wasallam pada hari Jumat setelah surat Al Jumu'ah?\" dia menjawab; \"Beliau membaca: \"HAL ATAAKA HADITSUL GHASYIYAH.\""
            },
            {
                "number": 226,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ صَفْوَانَ بْنِ سُلَيْمٍ قَالَ مَالِك لَا أَدْرِي أَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْ لَا أَنَّهُ قَالَمَنْ تَرَكَ الْجُمُعَةَ ثَلَاثَ مَرَّاتٍ مِنْ غَيْرِ عُذْرٍ وَلَا عِلَّةٍ طَبَعَ اللَّهُ عَلَى قَلْبِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Shafwan bin Sulaim], Malik berkata; \"Saya tidak tahu apakah dari Nabi shallallahu 'alaihi wasallam atau tidak? Yaitu perkataan, \"Barangsiapa meninggalkan sholat Jumat tiga kali tanpa ada udzur dan alasan, niscaya Allah telah menutup hatinya.\""
            },
            {
                "number": 227,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ خُطْبَتَيْنِ يَوْمَ الْجُمُعَةِ وَجَلَسَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ja'far bin Muhammad] dari [Bapaknya], bahwa Rasulullah shallallahu 'alaihi wasallam pada hari jum'at berkhutbah dengan dua khutbah, dan beliau duduk di antara keduanya.\""
            },
            {
                "number": 228,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي الْمَسْجِدِ ذَاتَ لَيْلَةٍ فَصَلَّى بِصَلَاتِهِ نَاسٌ ثُمَّ صَلَّى اللَّيْلَةَ الْقَابِلَةَ فَكَثُرَ النَّاسُ ثُمَّ اجْتَمَعُوا مِنْ اللَّيْلَةِ الثَّالِثَةِ أَوْ الرَّابِعَةِ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَصْبَحَ قَالَ قَدْ رَأَيْتُ الَّذِي صَنَعْتُمْ وَلَمْ يَمْنَعْنِي مِنْ الْخُرُوجِ إِلَيْكُمْ إِلَّا أَنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ وَذَلِكَ فِي رَمَضَانَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Urwah bin Az Zubair] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwa pada suatu malam Rasulullah shallallahu 'alaihi wasallam sholat di masjid, dan orang-orang mengikutinya dari belakang. Pada malam berikutnya, beliau sholat lagi dan semakin banyak yang mengikutinya. Sehingga pada malam ketiga atau keempat, orang-orang berkumpul (di masjid) sementara Rasulullah shallallahu 'alaihi wasallam tidak kunjung keluar. Pada pagi harinya, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya tahu apa yang kalian lakukan, tidak ada yang menghalangiku untuk keluar kepada kalian, melainkan saya takut hal itu menjadi wajib bagi kalian.\" Hal itu terjadi pada bulan ramadhan.\""
            },
            {
                "number": 229,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَ بِعَزِيمَةٍ فَيَقُولُ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ قَالَ ابْنُ شِهَابٍ فَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْأَمْرُ عَلَى ذَلِكَثُمَّ كَانَ الْأَمْرُ عَلَى ذَلِكَ فِي خِلَافَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلَافَةِ عُمَرَ بْنِ الْخَطَّابِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman bin Auf] dari [Abu Hurairah], Rasulullah shallallahu 'alaihi wasallam menganjurkan sholat malam pada bulan ramadhan dengan perintah yang tidak mewajibkan. Beliau bersabda: \"Barangsiapa sholat malam ramadhan, dengan penuh iman dan berharap pahala dari Allah, niscaya diampuni dosa-dosanya yang telah lalu.\" Ibnu Syihab berkata; \"Rasulullah shallallahu 'alaihi wasallam meninggal dan perintahnya masih seperti itu. Begitu juga pada masa khalifah Abu Bakar dan pada masa khalifah Umar bin Khatthab.\""
            },
            {
                "number": 230,
                "arab": "حَدَّثَنِي مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ أَنَّهُ قَالَ خَرَجْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِفِي رَمَضَانَ إِلَى الْمَسْجِدِ فَإِذَا النَّاسُ أَوْزَاعٌ مُتَفَرِّقُونَ يُصَلِّي الرَّجُلُ لِنَفْسِهِ وَيُصَلِّي الرَّجُلُ فَيُصَلِّي بِصَلَاتِهِ الرَّهْطُ فَقَالَ عُمَرُ وَاللَّهِ إِنِّي لَأَرَانِي لَوْ جَمَعْتُ هَؤُلَاءِ عَلَى قَارِئٍ وَاحِدٍ لَكَانَ أَمْثَلَ فَجَمَعَهُمْ عَلَى أُبَيِّ بْنِ كَعْبٍ قَالَ ثُمَّ خَرَجْتُ مَعَهُ لَيْلَةً أُخْرَى وَالنَّاسُ يُصَلُّونَ بِصَلَاةِ قَارِئِهِمْ فَقَالَ عُمَرُ نِعْمَتِ الْبِدْعَةُ هَذِهِ وَالَّتِي تَنَامُونَ عَنْهَا أَفْضَلُ مِنْ الَّتِي تَقُومُونَ يَعْنِي آخِرَ اللَّيْلِ وَكَانَ النَّاسُ يَقُومُونَ أَوَّلَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Urwah bin Az Zubair] dari [Abdurrahman bin Abdul Al-Qari] dia berkata; \"Saya keluar bersama Umar bin Khattab ke masjid pada bulan ramadhan. Ternyata orang-orang berpencar dalam beberapa kelompok. Ada yang sholat sendirian, ada juga yang sholat dengan diikuti jamaah. [Umar] berkata, \"Demi Allah, sesungguhnya saya berpendapat, jika saya kumpulkan mereka dengan satu Qari', niscaya akan lebih utama.\" Akhirnya Umar pun memerintahkan agar mereka sholat bersama Ubay bin Ka'b (sebagai imam) . Abdurrahman berkata; \"Saya keluar bersama Umar bin Khatthab pada hari yang lain, sedang orang-orang telah sholat dengan satu Qari' mereka. Umar berkata; \"Sebaik-baik bid'ah adalah ini. Waktu yang kalian gunakan untuk tidur di dalamnya (maksudnya akhir malam) adalah lebih baik daripada yang kalian pergunakan untuk sholat (sekarang ini) . Saat itu orang-orang sholat pada awal malam.\""
            },
            {
                "number": 231,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ يُوسُفَ عَنْ السَّائِبِ بْنِ يَزِيدَ أَنَّهُ قَالَ أَمَرَ عُمَرُ بْنُ الْخَطَّابِ أُبَيَّ بْنَ كَعْبٍ وَتَمِيمًا الدَّارِيَّأَنْ يَقُومَا لِلنَّاسِ بِإِحْدَى عَشْرَةَ رَكْعَةً قَالَ وَقَدْ كَانَ الْقَارِئُ يَقْرَأُ بِالْمِئِينَ حَتَّى كُنَّا نَعْتَمِدُ عَلَى الْعِصِيِّ مِنْ طُولِ الْقِيَامِ وَمَا كُنَّا نَنْصَرِفُ إِلَّا فِي فُرُوعِ الْفَجْرِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Muhammad bin Yusuf] dari [As-Sa`ib bin Yazid] dia berkata, \" [Umar bin Khatthab] memerintahkan Ubay bin Ka'ab dan Tamim Ad Dari untuk mengimami orang-orang, dengan sebelas rakaat.\" As Sa`ib berkata; \"Imam membaca dua ratusan ayat, hingga kami bersandar di atas tongkat karena sangat lamanya berdiri. Dan kami tidak keluar melainkan di ambang fajar.\""
            },
            {
                "number": 232,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَزِيدَ بْنِ رُومَانَ أَنَّهُ قَالَكَانَ النَّاسُ يَقُومُونَ فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ فِي رَمَضَانَ بِثَلَاثٍ وَعِشْرِينَ رَكْعَةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Ruman] dia berkata; \"Para sahabat pada masa Umar bin Khatthab mengerjakan sholat malam dua puluh tiga rakaat.\""
            },
            {
                "number": 233,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ دَاوُدَ بْنِ الْحُصَيْنِ أَنَّهُ سَمِعَ الْأَعْرَجَ يَقُولُمَا أَدْرَكْتُ النَّاسَ إِلَّا وَهُمْ يَلْعَنُونَ الْكَفَرَةَ فِي رَمَضَانَ قَالَ وَكَانَ الْقَارِئُ يَقْرَأُ سُورَةَ الْبَقَرَةِ فِي ثَمَانِ رَكَعَاتٍ فَإِذَا قَامَ بِهَا فِي اثْنَتَيْ عَشْرَةَ رَكْعَةً رَأَى النَّاسُ أَنَّهُ قَدْ خَفَّفَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Daud bin Al Hushain] Bahwasanya ia mendengar [Al A'raj] berkata; \"Saya tidak mendapatkan orang-orang melainkan mereka melaknat orang-orang kafir pada bulan ramadhan.\" Al A'raj berkata; \"Imamnya membaca surat Al Baqarah dalam delapan rakaat. Jika imam membacanya untuk dua belas rakaat, maka orang-orang akan mengatakan bahwa imam telah memeringan bacaan.\""
            },
            {
                "number": 234,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ قَالَ سَمِعْتُ أَبِي يَقُولُكُنَّا نَنْصَرِفُ فِي رَمَضَانَ فَنَسْتَعْجِلُ الْخَدَمَ بِالطَّعَامِ مَخَافَةَ الْفَجْرِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] berkata, saya mendengar [Bapakku] berkata; \"Pada bulan ramadhan kami keluar (selesai dari sholat) segera mempersiapkan makanan karena takut datangnya fajar.\""
            },
            {
                "number": 235,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّ ذَكْوَانَ أَبَا عَمْرٍو وَكَانَ عَبْدًا لِعَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفَأَعْتَقَتْهُ عَنْ دُبُرٍ مِنْهَا كَانَ يَقُومُ يَقْرَأُ لَهَا فِي رَمَضَانَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] bahwa Dzakwan Abu 'Amru pernah menjadi budak Aisyah, isteri Nabi shallallahu 'alaihi wasallam. Kemudian ['Aisyah] menjanjinkannya merdeka ketika ia telah meninggal. Dzakwan kemudian membaca al-qur'an untuk 'Aisyah di bulan ramadhan."
            },
            {
                "number": 236,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ رَجُلٍ عِنْدَهُ رِضًا أَنَّهُ أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ امْرِئٍ تَكُونُ لَهُ صَلَاةٌ بِلَيْلٍ يَغْلِبُهُ عَلَيْهَا نَوْمٌ إِلَّا كَتَبَ اللَّهُ لَهُ أَجْرَ صَلَاتِهِ وَكَانَ نَوْمُهُ عَلَيْهِ صَدَقَةً",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Muhammad bin Al-Munkadir] dari [Sa'id bin Jubair] dari [seorang laki-laki yang sudah diridhai] dia mengabarkan kepadanya, bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang hamba yang berniat sholat malam kemudian tertidur, kecuali Allah akan menuliskan baginya pahala sholat malam. Adapun tidurnya tersebut adalah sesuatu yang Allah sedekahkan kepadanya.\""
            },
            {
                "number": 237,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْكُنْتُ أَنَامُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرِجْلَايَ فِي قِبْلَتِهِ فَإِذَا سَجَدَ غَمَزَنِي فَقَبَضْتُ رِجْلَيَّ فَإِذَا قَامَ بَسَطْتُهُمَا قَالَتْ وَالْبُيُوتُ يَوْمَئِذٍ لَيْسَ فِيهَا مَصَابِيحُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Nadlar] budak Umar bin ubaidhullah, dari [Abu Salamah bin Abdurrahman] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia berkata; \"Saya tidur di depan Rasulullah shallallahu 'alaihi wasallam dan kedua kakiku berada di arah kiblatnya. Ketika sujud, beliau memegang kedua kakiku, lalu saya menekuknya hingga ketika beliau berdiri saya menghamparkanya kembali.\" Aisyah berkata; \"Pada waktu itu, rumah-rumah masih belum ada lampunya.\""
            },
            {
                "number": 238,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَعَسَ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لَا يَدْرِي لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبَّ نَفْسَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian mengantuk dalam sholatnya, hendaklah ia tidur hingga hilang rasa kantuknya. Sebab jika salah seorang dari kalian sholat dalam keadaan mengantuk, dia tidak tahu mungkin dia memohon ampunan tetapi dia malah mencela dirinya.\""
            },
            {
                "number": 239,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِسْمَعِيلَ بْنِ أَبِي حَكِيمٍ أَنَّهُ بَلَغَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ امْرَأَةً مِنْ اللَّيْلِ تُصَلِّي فَقَالَ مَنْ هَذِهِ فَقِيلَ لَهُ هَذِهِ الْحَوْلَاءُ بِنْتُ تُوَيْتٍ لَا تَنَامُ اللَّيْلَ فَكَرِهَ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى عُرِفَتْ الْكَرَاهِيَةُ فِي وَجْهِهِ ثُمَّ قَالَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لَا يَمَلُّ حَتَّى تَمَلُّوا اكْلَفُوا مِنْ الْعَمَلِ مَا لَكُمْ بِهِ طَاقَةٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Isma'il bin Abu Hakim] telah sampai kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam mendengar seorang wanita yang sholat pada malam hari. Beliau bertanya; \"Siapa ini?\" Ada yang menjawab; \"Dia adalah Haula binti Tuwait. Dia tidak tidur pada malam hari.\" Rasulullah shallallahu 'alaihi wasallam pun membenci pebuatan tersebut hingga terlihat tanda kebencian pada wajahnya. Beliau bersabda: \"Allah Tabaraka Wa Ta'ala tiada akan jenuh hingga kalian sendiri yang merasa jenuh, maka kerjakan amalan yang kalian mampu.\""
            },
            {
                "number": 240,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِكَانَ يُصَلِّي مِنْ اللَّيْلِ مَا شَاءَ اللَّهُ حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ أَيْقَظَ أَهْلَهُ لِلصَّلَاةِ يَقُولُ لَهُمْ الصَّلَاةَ الصَّلَاةَ ثُمَّ يَتْلُو هَذِهِ الْآيَةَ{ وَأْمُرْ أَهْلَكَ بِالصَّلَاةِ وَاصْطَبِرْ عَلَيْهَا لَا نَسْأَلُكَ رِزْقًا نَحْنُ نَرْزُقُكَ وَالْعَاقِبَةُ لِلتَّقْوَى }",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Bapaknya] bahwa [Umar bin Khatthab] sholat malam dalam jumlah yang banyak, hingga ketika menjelang akhir malam dia membangunkan keluarganya untuk sholat. Dia berkata kepada mereka; \"ASHSHALAAH ASHSHALAAH (sholatlah kalian, sholatlah kalian) .\" Setelah itu ia membaca ayat; '(Dan perintahkanlah kepada keluargamu mendirikan sholat dan Bersabarlah kamu dalam mengerjakannya. Kami tidak meminta rezki kepadamu, kamilah yang memberi rezki kepadamu. dan akibat (yang baik) itu adalah bagi orang yang bertaqwa) ' (Qs. Thaahaa: 132) ."
            },
            {
                "number": 241,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنْ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِوَاحِدَةٍ فَإِذَا فَرَغَ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Urwah bin Az Zubair] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam sholat malam sebelas rakaat, dengan witir satu rakaat. Ketika selesai, beliau berbaring miring ke kanan.\""
            },
            {
                "number": 242,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَكَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ فَقَالَتْ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَزِيدُ فِي رَمَضَانَ وَلَا فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي ثَلَاثًا فَقَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ فَقَالَ يَا عَائِشَةُ إِنَّ عَيْنَيَّ تَنَامَانِ وَلَا يَنَامُ قَلْبِي",
                "id": "Telah menceritakan kepadaku dari Malik dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Salamah bin Abdurrahman bin Auf] dia bertanya kepada [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, 'Bagaimana sholat Rasulullah shallallahu 'alaihi wasallam di bulan ramadhan? ' Aisyah lantas menjawab, \"Rasulullah shallallahu 'alaihi wasallam tidak melakukan sholat lebih dari sebelas rakaat, baik pada bulan ramadhan maupun lainnya. Beliau sholat empat rakaat, jangan kamu tanya bagus dan panjangnya. Beliau sholat empat rakaat, jangan kamu tanya bagus dan panjangnya. Setelah itu beliau sholat tiga rakaat.\" Aisyah meneruskan ucapannya, \"Aku lalu bertanya, 'Wahai Rasulullah, apakah anda tidur sebelum berwitir? ' beliau menjawab: \"Wahai Aisyah, sesungguhnya kedua mataku tidur tapi hatiku tidak.\""
            },
            {
                "number": 243,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِاللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] Ummul Mukminin berkata, \"Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat malam tiga belas rakaat. Kemudian beliau sholat dua rakaat setelah mendengar adzan subuh.\""
            },
            {
                "number": 244,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُأَنَّهُ بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ خَالَتُهُ قَالَ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ وَاضْطَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ فِي طُولِهَا فَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ اسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ ثُمَّ قَرَأَ الْعَشْرَ الْآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقٍ فَتَوَضَّأَ مِنْهُ فَأَحْسَنَ وُضُوءَهُ ثُمَّ قَامَ يُصَلِّي قَالَ ابْنُ عَبَّاسٍ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا فَصَلَّى رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ أَوْتَرَ ثُمَّ اضْطَجَعَ حَتَّى أَتَاهُ الْمُؤَذِّنُ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Mahramah bin Sulaiman] dari [Kuraib] budak Ibnu 'Abbas, bahwa [Abdullah bin Abbas] mengabarkan kepadanya, bahwa ia pernah bermalam di tempat Maimunah, isteri Nabi shallallahu 'alaihi wasallam, yaitu bibi dari pihak ibunya. Abdullah bin Abbas berkata; \"Saya berbaring di atas bantal pada bagian sisinya, sedangkan Rasulullah shallallahu 'alaihi wasallam dan isterinya berbaring pada bagian sisi panjangnya. Rasulullah shallallahu 'alaihi wasallam tidur hingga ketika sampai pertengahan malam, atau kurang sedikit, atau lewat sedikit, beliau bangun. Beliau kemudian duduk sambil mengusap rasa kantuk dari wajah dengan tangan. Dan beliau membaca sepuluh ayat terakhir dari surat Ali Imran, lalu berdiri menuju geriba yang tergantung. Beliau berwudlu dengan menyempurnakan wudlunya, setelahitu berdiri sholat. Ibnu Abbas berkata, \"Kemudian aku bangun dan melakukan sebagaimana yang dilakukan oleh beliau, lalu aku pergi dan sholat di sisinya. Rasulullah shallallahu 'alaihi wasallam lalu meletakkan tangan kanannya di atas kepalaku seraya memegang telinga kananku dan menariknya (memalingkan) . Beliau lalu sholat dua rakaat, dua rakaat, dua rakaat, dua rakaat, dua rakaat, dan dua rakaat. Kemudian beliau sholat witir. Setelah itu beliau berbaring hingga muaddzin datang kepadanya. Beliau sholat ringan dua rakaat kemudian keluar sholat subuh.\""
            },
            {
                "number": 245,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَنَّهُ قَالَلَأَرْمُقَنَّ اللَّيْلَةَ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَتَوَسَّدْتُ عَتَبَتَهُ أَوْ فُسْطَاطَهُ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ أَوْتَرَ فَتِلْكَ ثَلَاثَ عَشْرَةَ رَكْعَةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] dari [Bapaknya] bahwa [Abdullah bin Qais bin Makhramah] mengabarkan kepadanya, dari [Zaid bin Khalid Al-Juhani] dia berkata, \"Saya akan menyelidiki sholat Rasulullah shallallahu 'alaihi wasallam pada malam ini.\" Zaid bin Khalid Al-Juhani berkata, \"Aku lalu tidur di kemah beliau, atau pintunya. Rasulullah shallallahu 'alaihi wasallam kemudian berdiri dan sholat dua rakaat panjang, dua rakaat panjang, dua rakaat panjang. Kemudian beliau sholat dua rakaat yang lebih ringan dari dua rakaat sebelumnya. Beliau sholat dua rakaat yang lebih ringan lagi dari dua rakaat sebelumnya. Beliau sholat dua rakaat yang lebih ringan lagi dari dua rakaat sebelumnya. Lalu beliau sholat dua rakaat yang lebih ringan dari dua rakaat sebelumnya. Kemudian beliau sholat witir, maka genaplah menjadi tiga belas rakaat.\""
            },
            {
                "number": 246,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ وَعَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خَشِيَ أَحَدُكُمْ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً تُوتِرُ لَهُ مَا قَدْ صَلَّى",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dan [Abdullah bin Dinar] dari [Abdullah bin Umar], bahwa ada seorang laki-laki bertanya Rasulullah shallallahu 'alaihi wasallam tentang sholat malam? Rasulullah shallallahu 'alaihi wasallam menjawab: \"sholat malam dikerjakan dua rakaat, dua rakaat. Jika salah seorang dari kalian khawatir subuh tiba, sholatlah satu rakaat sebagai witir untuk sholat sebelumnya.\""
            },
            {
                "number": 247,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ ابْنِ مُحَيْرِيزٍأَنَّ رَجُلًا مِنْ بَنِي كِنَانَةَ يُدْعَى الْمُخْدَجِيَّ سَمِعَ رَجُلًا بِالشَّامِ يُكَنَّى أَبَا مُحَمَّدٍ يَقُولُ إِنَّ الْوِتْرَ وَاجِبٌ فَقَالَ الْمُخْدَجِيُّ فَرُحْتُ إِلَى عُبَادَةَ بْنِ الصَّامِتِ فَاعْتَرَضْتُ لَهُ وَهُوَ رَائِحٌ إِلَى الْمَسْجِدِ فَأَخْبَرْتُهُ بِالَّذِي قَالَ أَبُو مُحَمَّدٍ فَقَالَ عُبَادَةُ كَذَبَ أَبُو مُحَمَّدٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَمْسُ صَلَوَاتٍ كَتَبَهُنَّ اللَّهُ عَزَّ وَجَلَّ عَلَى الْعِبَادِ فَمَنْ جَاءَ بِهِنَّ لَمْ يُضَيِّعْ مِنْهُنَّ شَيْئًا اسْتِخْفَافًا بِحَقِّهِنَّ كَانَ لَهُ عِنْدَ اللَّهِ عَهْدٌ أَنْ يُدْخِلَهُ الْجَنَّةَ وَمَنْ لَمْ يَأْتِ بِهِنَّ فَلَيْسَ لَهُ عِنْدَ اللَّهِ عَهْدٌ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ أَدْخَلَهُ الْجَنَّةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz], bahwa ada seorang laki-laki Bani Kinanah yang bernama [Al-Mukhdaji], mendengar seorang laki-laki yang diberi julukan Abu Muhammad berkata di wilayah Syam, \"Witir itu wajib.\" Al-Mukhdaji berkata; \"Aku kemudian menemui Ubadah bin Shamit, aku mencegatnya saat ia berangkat ke masjid. Aku lalu kabarkan kepadanya dengan apa yang dikatakan oleh Abu Muhammad. [Ubadah] pun berkata, \"Abu Muhammad telah berdusta. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lima sholat Allah Azza Wa Jalla telah mewajibkannya kepada-Nya. Barangsiapa melaksanakan dan tidak meninggalkan satupun darinya karena meremehkan kewajiban, niscaya baginya janji Allah untuk memasukkannya ke surga. Barangsiapa tidak melakukannya, niscaya dia tidak mendapatkan janji Allah (untuk memasukkannya ke surga) . Jika berkehendak Allah akan menyiksanya, dan jika berkehendak maka Allah akan memasukkannya ke dalam surga.\""
            },
            {
                "number": 248,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي بَكْرِ بْنِ عُمَرَ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ كُنْتُ أَسِيرُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ بِطَرِيقِ مَكَّةَ قَالَ سَعِيدٌ فَلَمَّا خَشِيتُ الصُّبْحَ نَزَلْتُ فَأَوْتَرْتُ ثُمَّ أَدْرَكْتُهُ فَقَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ أَيْنَ كُنْتَ فَقُلْتُ لَهُ خَشِيتُ الصُّبْحَ فَنَزَلْتُ فَأَوْتَرْتُ فَقَالَ عَبْدُ اللَّهِأَلَيْسَ لَكَ فِي رَسُولِ اللَّهِ أُسْوَةٌ فَقُلْتُ بَلَى وَاللَّهِ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ عَلَى الْبَعِيرِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Bakar bin Muhammad bin Umar] dari [Sa'id bin Yasar] berkata, \"Saya berjalan bersama Abdullah bin 'Umar di sebuah jalan Makkah.\" Sa'id berkata, \"Saya khawatir subuh akan segera tiba, maka saya pun berhenti untuk melaksanakan sholat witir, hingga saya masih mendapatkannya sholat witir tersebut. Abdullah bin Umar bertanya, \"Dari mana kamu?\" saya menjawab, \"Saya khawatir masuk subuh, maka saya singgah untuk sholat witir.\" [Abdullah] berkata; \"Bukankah sudah ada bagimu contoh dari Rasulullah shallallahu 'alaihi wasallam?\" saya menjawab; \"Ya, demi Allah.\" Dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat witir di atas untanya.\""
            },
            {
                "number": 249,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَ كَانَ أَبُو بَكْرٍ الصِّدِّيقُإِذَا أَرَادَ أَنْ يَأْتِيَ فِرَاشَهُ أَوْتَرَوَكَانَ عُمَرُ بْنُ الْخَطَّابِ يُوتِرُ آخِرَ اللَّيْلِ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَأَمَّا أَنَا فَإِذَا جِئْتُ فِرَاشِي أَوْتَرْتُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] dia berkata; \"Jika [Abu Bakar Ash Shidiq] hendak mendatangi ranjangnya, dia sholat witir, sedangkan [Umar bin Khatthab] melaksanakan sholat witir di akhir malam.\" Sa'id bin Musayyab berkata; \"Jika saya hendak tidur, saya sholat witir terlebih dahulu.\""
            },
            {
                "number": 250,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّهُ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَبِمَكَّةَ وَالسَّمَاءُ مُغِيمَةٌ فَخَشِيَ عَبْدُ اللَّهِ الصُّبْحَ فَأَوْتَرَ بِوَاحِدَةٍ ثُمَّ انْكَشَفَ الْغَيْمُ فَرَأَى أَنَّ عَلَيْهِ لَيْلًا فَشَفَعَ بِوَاحِدَةٍ ثُمَّ صَلَّى بَعْدَ ذَلِكَ رَكْعَتَيْنِ رَكْعَتَيْنِ فَلَمَّا خَشِيَ الصُّبْحَ أَوْتَرَ بِوَاحِدَةٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dia berkata, \"Saya bersama [Abdullah bin Umar] di Makkah, sementara saat itu langit terlihat mendung. Abdullah khawatir jika waktu subuh segera datang, sehingga ia sholat witir satu rakaat. Namun setelah itu mendung tersingkap dan Abdullah melihat ternyata masih malam. Maka ia pun menggenapkannya dengan satu rakaat lagi, setelah itu ia sholat dua rakaat, dua rakaat. Dan ketika ia khawatir waktu subuh akan segera datang, ia mengerjakan sholat witir satu rakaat.\""
            },
            {
                "number": 251,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يُسَلِّمُ بَيْنَ الرَّكْعَتَيْنِ وَالرَّكْعَةِ فِي الْوِتْرِ حَتَّى يَأْمُرَ بِبَعْضِ حَاجَتِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] ketika sholat witir, ia membaca salam setelah dua rakaat dan satu rakaat. Kemudian dia menyuruh diambilkan sebagian keperluannya.\""
            },
            {
                "number": 252,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍكَانَ يُوتِرُ بَعْدَ الْعَتَمَةِ بِوَاحِدَةٍقَالَ مَالِك وَلَيْسَ عَلَى هَذَا الْعَمَلُ عِنْدَنَا وَلَكِنْ أَدْنَى الْوِتْرِ ثَلَاثٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa [Sa'ad bin Abu Waqash] sholat witir satu rakaat setelah isya'. Malik berkata; \"Ini bukanlah yang kami amalkan. Menurut pendapat kami, sholat wirit paling sedikit adalah tiga rakaat.\""
            },
            {
                "number": 253,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُصَلَاةُ الْمَغْرِبِ وِتْرُ صَلَاةِ النَّهَارِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Dinar] bahwa [Abdullah bin Umar] berkata; \"sholat maghrib adalah witirnya sholat siang hari\""
            },
            {
                "number": 254,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ الْبَصْرِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍرَقَدَ ثُمَّ اسْتَيْقَظَ فَقَالَ لِخَادِمِهِ انْظُرْ مَا صَنَعَ النَّاسُ وَهُوَ يَوْمَئِذٍ قَدْ ذَهَبَ بَصَرُهُ فَذَهَبَ الْخَادِمُ ثُمَّ رَجَعَ فَقَالَ قَدْ انْصَرَفَ النَّاسُ مِنْ الصُّبْحِ فَقَامَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فَأَوْتَرَ ثُمَّ صَلَّى الصُّبْحَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdul Karim bin Abu Al Mukhariq Al Bashri] dari [Sa'id bin Jubair], bahwa [Abdullah bin 'Abbas] tidur kemudian bangun. Lalu ia berkata kepada pembantunya; \"Lihatlah apa yang telah dikerjakan manusia -saat itu dia telah buta-.\" Pembantunya kemudian pergi, dan setelah kemabli, pembantunya berkata; \"Orang-orang telah selesai sholat subuh.\" Abdullah bin Abbas berdiri sholat witir kemudian sholat subuh.\""
            },
            {
                "number": 255,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ قَالَمَا أُبَالِي لَوْ أُقِيمَتْ صَلَاةُ الصُّبْحِ وَأَنَا أُوتِرُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] bahwa [Abdullah bin Mas'ud] berkata; \"Saya tidak peduli walau iqamat subuh dikumandangkan, saya akan tetap sholat witir.\""
            },
            {
                "number": 256,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَ كَانَ عُبَادَةُ بْنُ الصَّامِتِيَؤُمُّ قَوْمًا فَخَرَجَ يَوْمًا إِلَى الصُّبْحِ فَأَقَامَ الْمُؤَذِّنُ صَلَاةَ الصُّبْحِ فَأَسْكَتَهُ عُبَادَةُ حَتَّى أَوْتَرَ ثُمَّ صَلَّى بِهِمْ الصُّبْحَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dia berkata; \" [Ubadah bin Shamit] adalah imam bagi suatu kaum. Pada suatu hari, dia keluar untuk sholat subuh. Muaddzin lalu mengkumandangkan iqamat, maka Ubadah menghentikan iqamahnya hingga ia menerjakan sholat witir. Setelah itu ia sholat subuh bersama mereka.\""
            },
            {
                "number": 257,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ يَقُولُإِنِّي لَأُوتِرُ وَأَنَا أَسْمَعُ الْإِقَامَةَ أَوْ بَعْدَ الْفَجْرِ يَشُكُّ عَبْدُ الرَّحْمَنِ أَيَّ ذَلِكَ قَالَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dia berkata; saya telah mendengar [Abdullah bin 'Amir bin Rabi'ah] berkata; \"Saya akan tetap sholat witir saat aku mendengar iqamat atau setelah fajar.\" Abdurrahman ragu, mana yang dikatakan Abdullah bin Amru.\""
            },
            {
                "number": 258,
                "arab": "و حَدَّثَنِي مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ أَنَّهُ سَمِعَ أَبَاهُ الْقَاسِمَ بْنَ مُحَمَّدٍ يَقُولُإِنِّي لَأُوتِرُ بَعْدَ الْفَجْرِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dia mendengar bapaknya [Al Qasim bin Muhammad] berkata; \"Saya tetap sholat witir walau setelah terbit fajar.\""
            },
            {
                "number": 259,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ حَفْصَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَكَتَ الْمُؤَذِّنُ عَنْ الْأَذَانِ لِصَلَاةِ الصُّبْحِ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ تُقَامَ الصَّلَاةُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar], bahwa [Hafshah] isteri Nabi shallallahu 'alaihi wasallam mengabarkan kepadanya, bahwa \"Jika muaddzin telah selesai mengumandangkan adzan subuh, maka sebelum iqamah dikumandangkan Rasulullah shallallahu 'alaihi wasallam sholat ringan dua rakaat.\""
            },
            {
                "number": 260,
                "arab": "و حَدَّثَنِي مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُخَفِّفُ رَكْعَتَيْ الْفَجْرِ حَتَّى إِنِّي لَأَقُولُ أَقَرَأَ بِأُمِّ الْقُرْآنِ أَمْ لَا",
                "id": "Telah menceritakan kepadaku Malik dari [Yahya bin Sa'id] bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, berkata; \"Rasulullah shallallahu 'alaihi wasallam meringankan dua rakaat fajar, hingga saya bertanya-tanya, 'Apakah beliau membaca Ummul Qur'an (Al Fatihah) atau tidak'.\""
            },
            {
                "number": 261,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ قَالَسَمِعَ قَوْمٌ الْإِقَامَةَ فَقَامُوا يُصَلُّونَ فَخَرَجَ عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَصَلَاتَانِ مَعًا أَصَلَاتَانِ مَعًا وَذَلِكَ فِي صَلَاةِ الصُّبْحِ فِي الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَ الصُّبْحِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Syarik bin Abdullah bin Abu Namr] dari [Abu Salamah bin Abdurrahman] dia berkata; \"Suatu kaum mendengar iqomat, lalu mereka bangun mengerjakan sholat. Rasulullah shallallahu 'alaihi wasallam menemui mereka seraya bertanya: \"Apakah ada dua sholat secara bersamaan, apakah ada dua sholat secara bersamaan?\" hal itu terjadi mengenai sholat subuh dan dua rakaat sebelum subuh."
            },
            {
                "number": 262,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَفَاتَتْهُ رَكْعَتَا الْفَجْرِ فَقَضَاهُمَا بَعْدَ أَنْ طَلَعَتْ الشَّمْسُو حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّهُ صَنَعَ مِثْلَ الَّذِي صَنَعَ ابْنُ عُمَرَ",
                "id": "Telah menceritakan kepadaku dari Malik telah sampai padanya, bahwa Abdullah bin Umar pernah tertinggal dua rakaat fajar, lalu ia mengqadlanya setelah matahari terbit. Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Al Qasim bin Muhammad], bahwa ia mengerjakan seperti yang dikerjakan oleh Ibnu Umar.\""
            },
            {
                "number": 263,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الْجَمَاعَةِ تَفْضُلُ صَلَاةَ الْفَذِّ بِسَبْعٍ وَعِشْرِينَ دَرَجَةً",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat berjama'ah lebih utama dua puluh tujuh derajat daripada sholat sendirian.\""
            },
            {
                "number": 264,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الْجَمَاعَةِ أَفْضَلُ مِنْ صَلَاةِ أَحَدِكُمْ وَحْدَهُ بِخَمْسَةٍ وَعِشْرِينَ جُزْءًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat berjama'ah lebih utama dua puluh lima bagian daripada sholat salah seorang dari kalian sendirian.\""
            },
            {
                "number": 265,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ هَمَمْتُ أَنْ آمُرَ بِحَطَبٍ فَيُحْطَبَ ثُمَّ آمُرَ بِالصَّلَاةِ فَيُؤَذَّنَ لَهَا ثُمَّ آمُرَ رَجُلًا فَيَؤُمَّ النَّاسَ ثُمَّ أُخَالِفَ إِلَى رِجَالٍ فَأُحَرِّقَ عَلَيْهِمْ بُيُوتَهُمْ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ يَعْلَمُ أَحَدُهُمْ أَنَّهُ يَجِدُ عَظْمًا سَمِينًا أَوْ مِرْمَاتَيْنِ حَسَنَتَيْنِ لَشَهِدَ الْعِشَاءَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi dzat yang jiwaku berada di tangan-Nya. Sungguh, saya sangat berkeinginan memerintahkan seseorang untuk mengumpulkan kayu bakar, kemudian aku perintahkan seseorang mengumandangkan adzan, kemudian iqmah dikumandangkan. Setelah itu aku perintahkan seseorang untuk menjadi imam bagi manusia, sementara aku pergi menuju beberapa laki-laki, sehingga aku bisa membakar rumah-rumah mereka. Demi dzat yang jiwaku berada di tangan-Nya, kalau saja salah seorang dari mereka tahu bahwa mereka akan mendapatkan tulang kambing yang gemuk (banyak sisa dagingnya), atau dua tulang rusuk yang enak, niscaya dia akan mengikuti sholat Isya.\""
            },
            {
                "number": 266,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ سَعِيدٍ أَنَّ زَيْدَ بْنَ ثَابِتٍ قَالَأَفْضَلُ الصَّلَاةِ صَلَاتُكُمْ فِي بُيُوتِكُمْ إِلَّا صَلَاةَ الْمَكْتُوبَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Nadlr] mantan budak Umar bin ubaidhullah, dari [Busr bin Sa'id] dari [Zaid bin Tsabit] berkata; \"Sebaik-baik sholat kalian adalah yang kalian lakukan di rumah, kecuali sholat wajib.\""
            },
            {
                "number": 267,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ الْأَسْلَمِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَنَا وَبَيْنَ الْمُنَافِقِينَ شُهُودُ الْعِشَاءِ وَالصُّبْحِ لَا يَسْتَطِيعُونَهُمَا أَوْ نَحْوَ هَذَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Harmalah Al-Aslami] dari [Sa'id bin Musayyab] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Pembeda) antara kita dengan orang munafik adalah menghadiri sholat isya dan subuh. Mereka tidak bisa melaksanakannya.\" atau dengan lafad lain yang semisal."
            },
            {
                "number": 268,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ إِذْ وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ وَقَالَ الشُّهَدَاءُ خَمْسَةٌ الْمَطْعُونُ وَالْمَبْطُونُ وَالْغَرِقُ وَصَاحِبُ الْهَدْمِ وَالشَّهِيدُ فِي سَبِيلِ اللَّهِ وَقَالَ لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الْأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عَلَيْهِ لَاسْتَهَمُوا وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لَأَتَوْهُمَا وَلَوْ حَبْوًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Sumayya] budak Abu Bakar bin Abdurrahman, dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika seorang laki-laki sedang berjalan di sebuah jalan, tiba-tiba ia mendapatkan duri, lalu ia ambil dan menyingkirkannya. Maka Allah berterima kasih padanya dan mengampuni dosa-dosanya\". Beliau bersabda lagi: \"Mati syahid itu ada empat macam: orang yang mati karena wabah tha'un, orang yang mati karena sakit perut, orang yang mati karena tenggelam, orang yang mati karena reruntuhan dan orang yang mati karena berperang di jalan Allah.\" Beliau lalu melanjutkan sabdanya: \"Seandainya manusia mengetahui pahala yang ada pada adzan dan shaf pertama, lalu mereka tidak bisa mendapatkannya kecuali dengan mengundi, niscaya mereka akan berebut undian. Seandainya mereka tahu pahala bersegera dalam menghadiri sholat berjama'ah, niscaya mereka akan berlomba-lomba menujunya. Dan seandainya mereka tahu pahala sholat isya dan subuh, niscaya mereka akan mendatanginya walau dengan merangkak.\""
            },
            {
                "number": 269,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ أَنَّ عُمَرَ بْنَ الْخَطَّابِفَقَدَ سُلَيْمَانَ بْنَ أَبِي حَثْمَةَ فِي صَلَاةِ الصُّبْحِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ غَدَا إِلَى السُّوقِ وَمَسْكَنُ سُلَيْمَانَ بَيْنَ السُّوقِ وَالْمَسْجِدِ النَّبَوِيِّ فَمَرَّ عَلَى الشِّفَاءِ أُمِّ سُلَيْمَانَ فَقَالَ لَهَا لَمْ أَرَ سُلَيْمَانَ فِي الصُّبْحِ فَقَالَتْ إِنَّهُ بَاتَ يُصَلِّي فَغَلَبَتْهُ عَيْنَاهُ فَقَالَ عُمَرُ لَأَنْ أَشْهَدَ صَلَاةَ الصُّبْحِ فِي الْجَمَاعَةِ أَحَبُّ إِلَيَّ مِنْ أَنْ أَقُومَ لَيْلَةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abu Bakar bin Sulaiman bin Abu Hatsmah], bahwa [Umar bin Khatthab] pernah kehilangan (tidak melihat) Sulaiman bin Abu Hatsmah dalam sholat subuh. Maka pada gai menjelang siang Umar bin Khatthab pagi menuju pasar, sementara tempat tinggal Sulaiman terletak antara pasar dan Masjid Nabawi. Umar lalu bertemu dengan Asy Syifa, ibu Sulaiman. Umar lalu berkata, \"Saya tidak melihat Sulaiman saat sholat subuh?\" Wanita itu menjawab, \"Dia telah sholat semalaman, hingga dia terlelap tidur.\" Umar berkata; \"Mengikuti sholat subuh berjama'ah lebih saya sukai daripada sholat semalam suntuk.\""
            },
            {
                "number": 270,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ الْأَنْصَارِيِّ أَنَّهُ قَالَ جَاءَ عُثْمَانُ بْنُ عَفَّانَإِلَى صَلَاةِ الْعِشَاءِ فَرَأَى أَهْلَ الْمَسْجِدِ قَلِيلًا فَاضْطَجَعَ فِي مُؤَخَّرِ الْمَسْجِدِ يَنْتَظِرُ النَّاسَ أَنْ يَكْثُرُوا فَأَتَاهُ ابْنُ أَبِي عَمْرَةَ فَجَلَسَ إِلَيْهِ فَسَأَلَهُ مَنْ هُوَ فَأَخْبَرَهُ فَقَالَ مَا مَعَكَ مِنْ الْقُرْآنِ فَأَخْبَرَهُ فَقَالَ لَهُ عُثْمَانُ مَنْ شَهِدَ الْعِشَاءَ فَكَأَنَّمَا قَامَ نِصْفَ لَيْلَةٍ وَمَنْ شَهِدَ الصُّبْحَ فَكَأَنَّمَا قَامَ لَيْلَةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim] dari [Abdurrahman bin Abu 'Amrah Al Anshari] dia berkata; \" [Utsman bin Affan] mendatangi sholat Isya, namun ia melihat orang-orang yang hadir hanya sedikit sekali, maka ia pun berbaring di tepi masjid menunggu agar yang datang lebih banyak. Ibnu Abu 'Amrah lalu menghampirinya dan duduk di dekatnya. Abu Amrah lalu bertanya diri Utsman, lalu Utsman pun mengebarkan kepadanya. Lalu Amrah bertanya kembali, \"Apa saja yang kamu ketahui dari al-qur'an? ' Utsman kembali menagabarkan kepadanya. Setelah itu Utsman berkata kepadanya, \"Barangsiapa mengikuti sholat isya seakan dia telah sholat separuh malam. Barangsiapa mengikuti sholat subuh, seakan-akan dia telah sholat seluruh malam.\""
            },
            {
                "number": 271,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ رَجُلٍ مِنْ بَنِي الدِّيلِ يُقَالُ لَهُ بُسْرُ بْنُ مِحْجَنٍ عَنْ أَبِيهِ مِحْجَنٍأَنَّهُ كَانَ فِي مَجْلِسٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُذِّنَ بِالصَّلَاةِ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى ثُمَّ رَجَعَ وَمِحْجَنٌ فِي مَجْلِسِهِ لَمْ يُصَلِّ مَعَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَنَعَكَ أَنْ تُصَلِّيَ مَعَ النَّاسِ أَلَسْتَ بِرَجُلٍ مُسْلِمٍ فَقَالَ بَلَى يَا رَسُولَ اللَّهِ وَلَكِنِّي قَدْ صَلَّيْتُ فِي أَهْلِي فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جِئْتَ فَصَلِّ مَعَ النَّاسِ وَإِنْ كُنْتَ قَدْ صَلَّيْتَ",
                "id": "Telah menceritakan kepadaku dari Yahya dari Malik dari [Zaid bin Aslam] dari seorang laki-laki dari Bani Ad Dil yang bernama [Busr bin Mihjan] dari bapaknya [Mihjan], Bahwasanya ia pernah berada dalam majlis Rasulullah shallallahu 'alaihi wasallam. Lalu dikumandangkanlah adzan sholat, Rasulullah shallallahu 'alaihi wasallam kemudian berdiri mengerjakan sholat dan kembali. Sedangkan Mihjan masih berada di majlis dan tidak sholat bersamanya. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apa yang menghalangimu sholat bersama orang-orang? Bukankah kamu seorang muslim?\" Mihjan menjawab, \"Benar wahai Rasulullah! Tapi saya sudah sholat bersama keluargaku.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu datang ke masjid, maka sholatlah bersama orang-orang walau sudah sholat.\""
            },
            {
                "number": 272,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ رَجُلًا سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَفَقَالَ إِنِّي أُصَلِّي فِي بَيْتِي ثُمَّ أُدْرِكُ الصَّلَاةَ مَعَ الْإِمَامِ أَفَأُصَلِّي مَعَهُ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ نَعَمْ فَقَالَ الرَّجُلُ أَيَّتَهُمَا أَجْعَلُ صَلَاتِي فَقَالَ لَهُ ابْنُ عُمَرَ أَوَ ذَلِكَ إِلَيْكَ إِنَّمَا ذَلِكَ إِلَى اللَّهِ يَجْعَلُ أَيَّتَهُمَا شَاءَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'], bahwa ada seorang laki-laki bertanya kepada Abdullah bin Umar, \"Saya sudah sholat di rumah, lalu saya mendapati sholat bersama imam. Apakah saya harus sholat lagi bersama mereka?\" [Abdullah bin 'Umar] menjawab, \"Ya.\" Laki-laki itu berkata, \"Mana di antara keduanya yang menggugurkan kewajibanku?\" Ibnu Umar menjawab, \"Apakah itu urusanmu? Yang demikian itu adalah urusan Allah. Dia yang berhak dalam menentukannya.\""
            },
            {
                "number": 273,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ رَجُلًا سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِفَقَالَ إِنِّي أُصَلِّي فِي بَيْتِي ثُمَّ آتِ الْمَسْجِدَ فَأَجِدُ الْإِمَامَ يُصَلِّي أَفَأُصَلِّي مَعَهُ فَقَالَ سَعِيدٌ نَعَمْ فَقَالَ الرَّجُلُ فَأَيُّهُمَا صَلَاتِي فَقَالَ سَعِيدٌ أَوَ أَنْتَ تَجْعَلُهُمَا إِنَّمَا ذَلِكَ إِلَى اللَّهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa ada seorang laki-laki yang bertanya kepada [Sa'id bin Musayyab]; \"Saya sudah sholat di rumahku. Kemudian saya mendatangi masjid, maka saya mendapati imam sedang sholat. Apakah saya harus sholat bersamanya?\" Lalu Sa'id menjawab; \"Ya\" laki-laki itu bertanya; \"Mana dari keduanya yang menggugurkan kewajibanku?\" Sa'id menjawab, \"Apakah itu hak kamu? Itu adalah hak Allah.\""
            },
            {
                "number": 274,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَفِيفٍ السَّهْمِيِّ عَنْ رَجُلٍ مِنْ بَنِي أَسَدٍ أَنَّهُ سَأَلَ أَبَا أَيُّوبَ الْأَنْصَارِيَّفَقَالَ إِنِّي أُصَلِّي فِي بَيْتِي ثُمَّ آتِ الْمَسْجِدَ فَأَجِدُ الْإِمَامَ يُصَلِّي أَفَأُصَلِّي مَعَهُ فَقَالَ أَبُو أَيُّوبَ نَعَمْ فَصَلِّ مَعَهُ فَإِنَّ مَنْ صَنَعَ ذَلِكَ فَإِنَّ لَهُ سَهْمَ جَمْعٍ أَوْ مِثْلَ سَهْمِ جَمْعٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Afif As-Sahmi] dari [seorang laki-laki dari Bani Asad] dia bertanya kepada [Abu Ayub Al Anshari], \"Saya sudah sholat di rumahku, lalu saya mendatangi masjid dan saya mendapati imam sedang sholat. Maka apakah saya harus sholat lagi bersamanya?\" Abu Ayub menjawab; \"Ya, sholatlah bersamanya. Siapa saja yang mengerjakan itu, maka ia akan mendapatkan pahala jama'ah, atau seperti pahala jama'ah.\""
            },
            {
                "number": 275,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُمَنْ صَلَّى الْمَغْرِبَ أَوْ الصُّبْحَ ثُمَّ أَدْرَكَهُمَا مَعَ الْإِمَامِ فَلَا يَعُدْ لَهُمَاقَالَ مَالِك وَلَا أَرَى بَأْسًا أَنْ يُصَلِّيَ مَعَ الْإِمَامِ مَنْ كَانَ قَدْ صَلَّى فِي بَيْتِهِ إِلَّا صَلَاةَ الْمَغْرِبِ فَإِنَّهُ إِذَا أَعَادَهَا كَانَتْ شَفْعًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Barangsiapa telah melaksanakan sholat maghrib atau subuh, lalu dia mendapatkan imam sedang melaksanakannya, maka janganlah ia mengulanginya.\" Malik berkata; \"Saya berpendapat: tidak masalah sholat bersama imam bagi siapa yang telah sholat, kecuali sholat maghrib. Karena jika dia mengulanginya, maka akan menjadi genap.\""
            },
            {
                "number": 276,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ بِالنَّاسِ فَلْيُخَفِّفْ فَإِنَّ فِيهِمْ الضَّعِيفَ وَالسَّقِيمَ وَالْكَبِيرَ وَإِذَا صَلَّى أَحَدُكُمْ لِنَفْسِهِ فَلْيُطَوِّلْ مَا شَاءَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian mengimami orang-orang, maka hendaklah ia ringankan. Karena di antara mereka terdapat orang lemah, sakit dan tua. Jika salah seorang dari kalian sholat sendirian, maka ia boleh memanjangkannya sekehendaknya.\""
            },
            {
                "number": 277,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّهُ قَالَ قُمْتُ وَرَاءَ عَبْدِ اللَّهِ بْنِ عُمَرَفِي صَلَاةٍ مِنْ الصَّلَوَاتِ وَلَيْسَ مَعَهُ أَحَدٌ غَيْرِي فَخَالَفَ عَبْدُ اللَّهِ بِيَدِهِ فَجَعَلَنِي حِذَاءَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dia berkata; \"Saya berdiri di belakang [Abdullah bin Umar] dalam suatu sholat. Sementara tidak ada seorang pun yang sholat di belakangnya selain aku, lalu Abdullah menarikku dengan tangannya dan menjadikanku sejajar dengannya.\""
            },
            {
                "number": 278,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍأَنَّ رَجُلًا كَانَ يَؤُمُّ النَّاسَ بِالْعَقِيقِ فَأَرْسَلَ إِلَيْهِ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَنَهَاهُقَالَ مَالِك وَإِنَّمَا نَهَاهُ لِأَنَّهُ كَانَ لَا يُعْرَفُ أَبُوهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id], bahwa ada seorang laki-laki mengimami orang-orang di 'Aqiq. Lalu [Umar bin Abdul Aziz] mengirimkan utusan kepadanya dan melarangnya menjadi imam. Malik berkata, \"'Umar bin Abdul Aziz melarangnya menjadi imam karena laki-laki tersebut tidak diketahui siapa bapaknya.\""
            },
            {
                "number": 279,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكِبَ فَرَسًا فَصُرِعَ فَجُحِشَ شِقُّهُ الْأَيْمَنُ فَصَلَّى صَلَاةً مِنْ الصَّلَوَاتِ وَهُوَ قَاعِدٌ وَصَلَّيْنَا وَرَاءَهُ قُعُودًا فَلَمَّا انْصَرَفَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam menunggang kuda, lalu kuda beliau tersungkur hingga lengan kanannya retak. Beliau kemudian mengerjakan sholat dengan duduk, dan sholat kami mengikutinya dengan duduk. Kamipun sholat di belakang beliau dengan duduk. Selesai sholat beliau bersabda: \"Dijadikannya seorang imam adalah untuk diikuti. Jika dia sholat dengan berdiri, sholatlah dengan berdiri. Jika dia rukuk, maka ikutlah rukuk. Jika dia bangkit, maka ikutlah bangkit. Jika dia membaca; SAMI'A ALLAHU LIMAN HAMIDAH (Allah Maha Mendengar terhadap orang yang memuji-Nya), maka ucapkan; RABBANAA WALAKAL HAMDU (Wahai Rab kami hanya untuk-Mu segala pujian) . Jika dia sholat dengan duduk, maka sholatlah dengan duduk semuanya.\""
            },
            {
                "number": 280,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ شَاكٍ فَصَلَّى جَالِسًا وَصَلَّى وَرَاءَهُ قَوْمٌ قِيَامًا فَأَشَارَ إِلَيْهِمْ أَنْ اجْلِسُوا فَلَمَّا انْصَرَفَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat ketika sakit. Beliau sholat dengan duduk, sementara orang-orang yang sholat dibelakangnya sholat sambil berdiri. Kemudian beliau memberi isyarat agar mereka sholat sambil duduk, setelah selesai sholat beliau bersabda: \"Hanyasanya dijadikannya imam adalah untuk diikuti. Jika dia rukuk, maka rukuklah bersamanya. Jika dia bangkit, maka ikutlah bangkit bersamanya. Dan jika dia sholat dengan duduk, maka sholatlah dengan duduk.\""
            },
            {
                "number": 281,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فِي مَرَضِهِ فَأَتَى فَوَجَدَ أَبَا بَكْرٍ وَهُوَ قَائِمٌ يُصَلِّي بِالنَّاسِ فَاسْتَأْخَرَ أَبُو بَكْرٍ فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ كَمَا أَنْتَ فَجَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى جَنْبِ أَبِي بَكْرٍ فَكَانَ أَبُو بَكْرٍ يُصَلِّي بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ وَكَانَ النَّاسُ يُصَلُّونَ بِصَلَاةِ أَبِي بَكْرٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya], bahwa Rasulullah shallallahu 'alaihi wasallam keluar untuk melaksanakan sholat ketika sedang sakit. Saat datang, beliau mendapati Abu Bakar sedang sholat mengimami orang-orang, maka Abu Bakar pun mundur ke belakang. Tetapi Rasulullah shallallahu 'alaihi wasallam berisyarat kepadanya, agar tetap pada posisinya.\" Rasulullah shallallahu 'alaihi wasallam kemudian duduk di sebelah Abu Bakar. Abu Bakar sholat dengan mengikuti sholat Rasulullah shallallahu 'alaihi wasallam, sedang beliau duduk. Dan orang-orang mengikuti sholat Abu Bakar.\""
            },
            {
                "number": 282,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ مَوْلًى لِعَمْرِو بْنِ الْعَاصِ أَوْ لِعَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ أَحَدِكُمْ وَهُوَ قَاعِدٌ مِثْلُ نِصْفِ صَلَاتِهِ وَهُوَ قَائِمٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Isma'il bin Muhammad bin Sa'd bin Abu Waqqash] dari [mantan budak 'Amru bin Al-Ash atau Abdullah bin 'Amru bin Al Ash] dari [Abdullah bin 'Amr bin Al Ash], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat salah seorang dari kalian dengan duduk seperti separuh sholat berdiri\""
            },
            {
                "number": 283,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّهُ قَالَلَمَّا قَدِمْنَا الْمَدِينَةَ نَالَنَا وَبَاءٌ مِنْ وَعْكِهَا شَدِيدٌ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى النَّاسِ وَهُمْ يُصَلُّونَ فِي سُبْحَتِهِمْ قُعُودًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ الْقَاعِدِ مِثْلُ نِصْفِ صَلَاةِ الْقَائِمِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Abdullah bin 'Amru bin Al Ash] berkata; \"Tatkala kami datang di Madinah, kami terkena wabah penyakit karena panas Madinah yang menyengat. Rasulullah shallallahu 'alaihi wasallam kemudian keluar menemui orang-orang, sementara orang-orang sedang mengerjakan sholat nafilah dengan duduk. Rasulullah shallallahu 'alaihi wasallam bersabda: 'sholatnya seorang yang dikerjakan dengan duduk, seperti nilainya setengah dari sholatnya seseorang yang dikerjakan dengan berdiri'.\""
            },
            {
                "number": 284,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ السَّهْمِيِّ عَنْ حَفْصَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي سُبْحَتِهِ قَاعِدًا قَطُّ حَتَّى كَانَ قَبْلَ وَفَاتِهِ بِعَامٍ فَكَانَ يُصَلِّي فِي سُبْحَتِهِ قَاعِدًا وَيَقْرَأُ بِالسُّورَةِ فَيُرَتِّلُهَا حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [As-Sa`ib bin Yazid] dari [Abdul Muthallib bin Abu Wada'ah As-Sahmi] dari [Hafshah] isteri Nabi shallallahu 'alaihi wasallam, dia berkata; \"Saya tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat sunnah dengan duduk sama sekali, hingga setahun sebelum beliau meninggal. Beliau sholat sunnah dengan duduk dan membaca surat dengan tartil hingga menjadi sangat lama, lebih lama dari biasanya.\""
            },
            {
                "number": 285,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا أَخْبَرَتْهُأَنَّهَا لَمْ تَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاةَ اللَّيْلِ قَاعِدًا قَطُّ حَتَّى أَسَنَّ فَكَانَ يَقْرَأُ قَاعِدًا حَتَّى إِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَقَرَأَ نَحْوًا مِنْ ثَلَاثِينَ أَوْ أَرْبَعِينَ آيَةً ثُمَّ رَكَعَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia mengabarkan kepadanya, bahwa dia tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat malam dengan duduk sama sekali, kecuali saat usianya telah tua. Beliau membaca dengan duduk, hingga ketika akan rukuk beliau berdiri dan membaca ayat antara tiga samapi atau empat puluh ayat, setelah itu baru beliau rukuk.\""
            },
            {
                "number": 286,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمَدَنِيِّ وَعَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي جَالِسًا فَيَقْرَأُ وَهُوَ جَالِسٌ فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ قَدْرُ مَا يَكُونُ ثَلَاثِينَ أَوْ أَرْبَعِينَ آيَةً قَامَ فَقَرَأَ وَهُوَ قَائِمٌ ثُمَّ رَكَعَ وَسَجَدَ ثُمَّ صَنَعَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Yazid Al-Madani] dan dari [Abu Nadlr] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwasanya Rasulullah shallallahu 'alaihi wasallam sholat dan membaca dengan duduk. Jika masih tersisa dari bacaanya sekitar tiga puluh atau empat puluh ayat, beliau berdiri dan membacanya dengan berdiri. Setelah itu beliau rukuk dan sujud. Lalu pada rakaat kedua beliau juga mengerjakannya seperti itu.\""
            },
            {
                "number": 287,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي يُونُسَ مَوْلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهُ قَالَ أَمَرَتْنِي عَائِشَةُأَنْ أَكْتُبَ لَهَا مُصْحَفًا ثُمَّ قَالَتْ إِذَا بَلَغْتَ هَذِهِ الْآيَةَ فَآذِنِّي{ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ }فَلَمَّا بَلَغْتُهَا آذَنْتُهَا فَأَمْلَتْ عَلَيَّ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى وَصَلَاةِ الْعَصْرِ وَقُومُوا لِلَّهِ قَانِتِينَ قَالَتْ عَائِشَةُ سَمِعْتُهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] dari [Al-Qa'qa' bin Hakim] dari [Abu Yunus] mantan budak Aisyah Ummul Mukminin, dia berkata; \" [Aisyah] menyuruhku menulis mushaf untuknya, kemudian ia berkata, \"Apabila kamu telah sampai pada ayat ini, maka kabarkanlah saya: '(Peliharalah semua sholat(mu), dan (peliharalah) sholat wusthaa. Berdirilah untuk Allah (dalam sholatmu) dengan khusyu') ' (Qs. Al Baqarah: 238) Tatkala saya sampai pada ayat itu, saya pun menyampaikan hal itu kepdanya. Lalu ia mendiktekan kepadaku; '(Peliharalah semua sholat(mu), dan (peliharalah) sholat wusthaa dan sholat asar. Kerjakanlah sholat dengan khusyu' karena Allah) ' Aisyah lantas berkata, \"Saya mendengarnya dari Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 288,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَمْرِو بْنِ رَافِعٍ أَنَّهُ قَالَ كُنْتُ أَكْتُبُ مُصْحَفًا لِحَفْصَةَ أُمِّ الْمُؤْمِنِينَفَقَالَتْ إِذَا بَلَغْتَ هَذِهِ الْآيَةَ فَآذِنِّي{ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ }فَلَمَّا بَلَغْتُهَا آذَنْتُهَا فَأَمْلَتْ عَلَيَّ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى وَصَلَاةِ الْعَصْرِ وَقُومُوا لِلَّهِ قَانِتِينَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari ['Amru bin Rafi'] dia berkata; \"Saya menulis mushaf untuk [Hafshah] Ummul Mukminin. Dia berkata; \"Apabila kamu telah sampai pada ayat ini, maka beritahukanlah kepadaku: '(Peliharalah semua sholat(mu), dan (peliharalah) sholat wusthaa. Berdirilah untuk Allah (dalam sholatmu) dengan khusyu) ' (As. Al Baqarah: 238) Tatkala saya sampai pada ayat tersebut, maka saya pun memberitahukan kepadanya. Lalu ia mendiktekan kepadaku: '(Peliharalah semua sholat(mu), dan (peliharalah) sholat wusthaa dan sholat asar dan kerjakanlah sholat dengan khusyu' karena Allah) '."
            }
        ]
    }
}