{
    "status": true,
    "data": {
        "start": 1938,
        "end": 2086,
        "total": 149,
        "book": "muslim",
        "hadits": [
            {
                "number": 1938,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ عَنْ صَالِحِ بْنِ كَيْسَانَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَاللَّفْظُ لَهُ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا صَالِحُ بْنُ كَيْسَانَ قَالَ سَمِعْتُ أَبَا مُحَمَّدٍ مَوْلَى أَبِي قَتَادَةَ يَقُولُ سَمِعْتُ أَبَا قَتَادَةَ يَقُولُاخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كُنَّا بِالْقَاحَةِ فَمِنَّا الْمُحْرِمُ وَمِنَّا غَيْرُ الْمُحْرِمِ إِذْ بَصُرْتُ بِأَصْحَابِي يَتَرَاءَوْنَ شَيْئًا فَنَظَرْتُ فَإِذَا حِمَارُ وَحْشٍ فَأَسْرَجْتُ فَرَسِي وَأَخَذْتُ رُمْحِي ثُمَّ رَكِبْتُ فَسَقَطَ مِنِّي سَوْطِي فَقُلْتُ لِأَصْحَابِي وَكَانُوا مُحْرِمِينَ نَاوِلُونِي السَّوْطَ فَقَالُوا وَاللَّهِ لَا نُعِينُكَ عَلَيْهِ بِشَيْءٍ فَنَزَلْتُ فَتَنَاوَلْتُهُ ثُمَّ رَكِبْتُ فَأَدْرَكْتُ الْحِمَارَ مِنْ خَلْفِهِ وَهُوَ وَرَاءَ أَكَمَةٍ فَطَعَنْتُهُ بِرُمْحِي فَعَقَرْتُهُ فَأَتَيْتُ بِهِ أَصْحَابِي فَقَالَ بَعْضُهُمْ كُلُوهُ وَقَالَ بَعْضُهُمْ لَا تَأْكُلُوهُ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَامَنَا فَحَرَّكْتُ فَرَسِي فَأَدْرَكْتُهُ فَقَالَ هُوَ حَلَالٌ فَكُلُوهُ",
                "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari [Shalih bin Kaisan] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Abu Umar] -lafazh juga miliknya- Telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Shalih bin Kaisan] ia berkata, saya mendengar [Abu Muhammad] Maula Abu Qatadah, berkata, saya mendengar [Abu Qatadah] berkata; Pada suatu ketika, kami bepergian bersama-sama Rasulullah shallallahu 'alaihi wasallam. Setelah sampai di Qahah, sebagian kami ada yang ihram dan ada pula yang tidak ihram. Sementara itu, aku melihat kawan-kawanku sedang memperhatikan sesuatu, lalu aku ikut pula melihatnya bersama-sama dengan mereka. Kiranya seekor himar liar. Aku segera memasang pelana kudaku dan kuambil lembingku, lalu kukendarai kudaku. Tetapi sayang, cemetiku terjatuh. Aku meminta tolong kepada kawan-kawanku untuk mengambilkannya, sedangkan mereka adalah orang-orang yang ihram. Mereka pun menjawab, \"Kami tidak bisa menolongmu sedikit pun jua.\" Lalu aku turun untuk mengambilnya sendiri. Sesudah itu, kukendarai kudaku kembali dan kukejar himar itu. kudapati ia sedang berada di belakang gundukan pasir, lalu kutusuk lambungnya dengan lembingku, dan dagingnya kubawakan untuk kawan-kawanku. Sebagian mereka mengatakan boleh memakan daging itu dan sebagian yang lain tidak boleh. Sedangkan Nabi shallallahu 'alaihi wasallam telah berlalu terlebih dahulu daripada kami. Lalu kupacu kudaku sehingga beliau tersusul olehku. Beliau bersabda: \"Daging itu halal, makanlah.\""
            },
            {
                "number": 1939,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ ح و حَدَّثَنَا قُتَيْبَةُ عَنْ مَالِكٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ أَبِي النَّضْرِ عَنْ نَافِعٍ مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ رَضِيَ اللَّهُ عَنْهُأَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كَانَ بِبَعْضِ طَرِيقِ مَكَّةَ تَخَلَّفَ مَعَ أَصْحَابٍ لَهُ مُحْرِمِينَ وَهُوَ غَيْرُ مُحْرِمٍ فَرَأَى حِمَارًا وَحْشِيًّا فَاسْتَوَى عَلَى فَرَسِهِ فَسَأَلَ أَصْحَابَهُ أَنْ يُنَاوِلُوهُ سَوْطَهُ فَأَبَوْا عَلَيْهِ فَسَأَلَهُمْ رُمْحَهُ فَأَبَوْا عَلَيْهِ فَأَخَذَهُ ثُمَّ شَدَّ عَلَى الْحِمَارِ فَقَتَلَهُ فَأَكَلَ مِنْهُ بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَى بَعْضُهُمْ فَأَدْرَكُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ إِنَّمَا هِيَ طُعْمَةٌ أَطْعَمَكُمُوهَا اللَّهُو حَدَّثَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي قَتَادَةَ رَضِيَ اللَّهُ عَنْهُ فِي حِمَارِ الْوَحْشِ مِثْلَ حَدِيثِ أَبِي النَّضْرِ غَيْرَ أَنَّ فِي حَدِيثِ زَيْدِ بْنِ أَسْلَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْءٌ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Qutaibah] dari [Malik] -sebagaimana yang telah dibacakan kepadanya- dari [Abu Nadlr] dari [Nafi'] Maula Abu Qatadah, dari [Abu Qatadah] radliallahu 'anhu, bahwa ia pernah bersama Rasulullah shallallahu 'alaihi wasallam, dan ketika sampai di sebagian jalan di Makkah, maka ia berjalan di belakang bersama beberapa orang sahabatnya yang sedang melakukan ihram, sementara ia sendiri tidak. Tiba-tiba ia melihat Himar liar, maka ia pun segera memacu kudanya dan meminta kepada para sahabatnya untuk mengambilkan cemetinya, namun mereka enggan. Ia meminta untuk diambilkan tombaknya, namun mereka juga enggan. Akhirnya ia mengambilnya sendiri, dan segera memburu Himar itu, hingga ia pun dapat membunuhnya. Lalu sebagian sahabat Nabi shallallahu 'alaihi wasallam memakan dagingnya, sementara sebagian yang lain enggan. Kemudian setelah mereka menemui Rasulullah shallallahu 'alaihi wasallam, mereka pun menanyakan hal itu pada beliau. Maka beliau bersabda: \"Sesungguhnya daging itu adalah makanan yang telah Allah berikan kepada kalian.\" Dan Telah menceritakan kepada kami [Qutaibah] dari [Malik] dari [Zaid bin Aslam] dari [Atha` bin Yasar] dari [Abu Qatadah] radliallahu 'anhu. Berkenaan dengan Himar liar. Yakni sebagaimana haditsnya Abu Nadlr, hanya saja di dalam haditsnya Zaid bin Aslam tercantum; Bahwa Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah pada kalian masih ada dagingnya.\""
            },
            {
                "number": 1940,
                "arab": "و حَدَّثَنَا صَالِحُ بْنُ مِسْمَارٍ السُّلَمِيُّ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ قَالَانْطَلَقَ أَبِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ فَأَحْرَمَ أَصْحَابُهُ وَلَمْ يُحْرِمْ وَحُدِّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ عَدُوًّا بِغَيْقَةَ فَانْطَلَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَبَيْنَمَا أَنَا مَعَ أَصْحَابِهِ يَضْحَكُ بَعْضُهُمْ إِلَى بَعْضٍ إِذْ نَظَرْتُ فَإِذَا أَنَا بِحِمَارِ وَحْشٍ فَحَمَلْتُ عَلَيْهِ فَطَعَنْتُهُ فَأَثْبَتُّهُ فَاسْتَعَنْتُهُمْ فَأَبَوْا أَنْ يُعِينُونِي فَأَكَلْنَا مِنْ لَحْمِهِ وَخَشِينَا أَنْ نُقْتَطَعَ فَانْطَلَقْتُ أَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْفَعُ فَرَسِي شَأْوًا وَأَسِيرُ شَأْوًا فَلَقِيتُ رَجُلًا مِنْ بَنِي غِفَارٍ فِي جَوْفِ اللَّيْلِ فَقُلْتُ أَيْنَ لَقِيتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَرَكْتُهُ بِتَعْهِنَ وَهُوَ قَائِلٌ السُّقْيَا فَلَحِقْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَصْحَابَكَ يَقْرَءُونَ عَلَيْكَ السَّلَامَ وَرَحْمَةَ اللَّهِ وَإِنَّهُمْ قَدْ خَشُوا أَنْ يُقْتَطَعُوا دُونَكَ انْتَظِرْهُمْ فَانْتَظَرَهُمْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَصَدْتُ وَمَعِي مِنْهُ فَاضِلَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْقَوْمِ كُلُوا وَهُمْ مُحْرِمُونَ",
                "id": "Dan Telah menceritakan kepada Kami [Shalih bin Mismar As Sulami] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepada kami [bapakku] dari [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abdullah bin Abu Qatadah] ia berkata; Pada tahun Hudaibiyyah, bapakku berangkat bersama Rasulullah shallallahu 'alaihi wasallam, lalu beliau dan para sahabatnya berihram namun bapakku tidak. Kemudian diberitakan kepada beliau bahwa pasukan musuh telah berada di Ghaiqah, maka Rasulullah shallallahu 'alaihi wasallam pun segera berangkat. Ketika aku sedang bersama para sahabatku yang lagi tertawa satu sama lain, tiba-tiba aku melihat seekor Himar liar, maka aku pun segera memburunya. Aku meminta bantuan mereka, namun mereka enggan untuk membantuku. Akhirnya kami pun memakan daging himar liar tersebut. Namun, kami khawatir bahwa ihram yang dilakukan batal. Maka aku pun pergi mencari Rasulullah shallallahu 'alaihi wasallam, lalu kupacu kudaku dengan kencang. Kemudian di akhir malam, aku bertemu dengan seorang laki-laki dari Bani Ghifar, maka aku pun bertanya, \"Di manakah kamu berjumpa dengan Rasululllah shallallahu 'alaihi wasallam?\" Ia menjawab, \"Di Ta'hin, dan saat itu, beliau sedang tidur siang.\" Maka segeralah aku menjumpai beliau. Kukatakan, \"Wahai Rasulullah, sesungguhnya para sahabat Anda menyampaikan AS SALAAM WA RAHMATULLAH kepada Anda. Dan mereka khawatir bahwa (ihram yang mereka lakukan) batal. Karena itu tunggulah mereka.\" Maka beliau pun menunggu mereka tiba. Aku berkata lagi, \"Wahai Rasulullah, sesungguhnya aku telah memburu (himar liar) dan sisa dagingnya masih ada padaku.\" Maka Nabi shallallahu 'alaihi wasallam bersabda kepada mereka yang sedang ihram: \"Makanlah.\""
            },
            {
                "number": 1941,
                "arab": "حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ رَضِيَ اللَّهُ عَنْهُ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجًّا وَخَرَجْنَا مَعَهُ قَالَ فَصَرَفَ مِنْ أَصْحَابِهِ فِيهِمْ أَبُو قَتَادَةَ فَقَالَ خُذُوا سَاحِلَ الْبَحْرِ حَتَّى تَلْقَوْنِي قَالَ فَأَخَذُوا سَاحِلَ الْبَحْرِ فَلَمَّا انْصَرَفُوا قِبَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْرَمُوا كُلُّهُمْ إِلَّا أَبَا قَتَادَةَ فَإِنَّهُ لَمْ يُحْرِمْ فَبَيْنَمَا هُمْ يَسِيرُونَ إِذْ رَأَوْا حُمُرَ وَحْشٍ فَحَمَلَ عَلَيْهَا أَبُو قَتَادَةَ فَعَقَرَ مِنْهَا أَتَانًا فَنَزَلُوا فَأَكَلُوا مِنْ لَحْمِهَا قَالَ فَقَالُوا أَكَلْنَا لَحْمًا وَنَحْنُ مُحْرِمُونَ قَالَ فَحَمَلُوا مَا بَقِيَ مِنْ لَحْمِ الْأَتَانِ فَلَمَّا أَتَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا يَا رَسُولَ اللَّهِ إِنَّا كُنَّا أَحْرَمْنَا وَكَانَ أَبُو قَتَادَةَ لَمْ يُحْرِمْ فَرَأَيْنَا حُمُرَ وَحْشٍ فَحَمَلَ عَلَيْهَا أَبُو قَتَادَةَ فَعَقَرَ مِنْهَا أَتَانًا فَنَزَلْنَا فَأَكَلْنَا مِنْ لَحْمِهَا فَقُلْنَا نَأْكُلُ لَحْمَ صَيْدٍ وَنَحْنُ مُحْرِمُونَ فَحَمَلْنَا مَا بَقِيَ مِنْ لَحْمِهَا فَقَالَ هَلْ مِنْكُمْ أَحَدٌ أَمَرَهُ أَوْ أَشَارَ إِلَيْهِ بِشَيْءٍ قَالَ قَالُوا لَا قَالَ فَكُلُوا مَا بَقِيَ مِنْ لَحْمِهَاو حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ شَيْبَانَ جَمِيعًا عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ بِهَذَا الْإِسْنَادِ فِي رِوَايَةِ شَيْبَانَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمِنْكُمْ أَحَدٌ أَمَرَهُ أَنْ يَحْمِلَ عَلَيْهَا أَوْ أَشَارَ إِلَيْهَا وَفِي رِوَايَةِ شُعْبَةَ قَالَ أَشَرْتُمْ أَوْ أَعَنْتُمْ أَوْ أَصَدْتُمْ قَالَ شُعْبَةُ لَا أَدْرِي قَالَ أَعَنْتُمْ أَوْ أَصَدْتُمْ",
                "id": "Telah menceritakan kepadaku [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Abu 'Awanah] dari [Utsman bin Abdullah bin Mauhab] dari [Abdullah bin Abu Qatadah] dari [bapaknya] radliallahu 'anhu, ia berkata; Kami pernah pergi melaksanakan haji bersama Rasulullah shallallahu 'alaihi wasallam, sebagian sahabat menempuh jalan yang lain, termasuk Abu Qatadah. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tempuhlah jalan pantai hingga kalian menemuiku.\" Mereka pun kemudian menempuh jalan pesisir pantai. Ketika mereka semua berangkat lebih dulu dari Rasulullah shallallahu 'alaihi wasallam, semuanya berihram kecuali Abu Qatadah. Di tengah-tengah perjalanan, tiba-tiba mereka melihat beberapa ekor keledai liar, kemudian Abu Qatadah berhasil menangkap seekor darinya yang betina dan menyembelihnya. Rombongan kemudian berhenti, lalu memakan daging himar tersebut. Kemudian mereka berkata, \"Kita telah memakan daging binatang buruan, padahal kita sedang berihram.\" Lalu sisa daging tersebut mereka bawa. Dan tatkala mereka sampai kepada Rasulullah shallallahu 'alaihi wasallam, mereka pun berkata, \"Wahai Rasulullah, kami tadi telah berihram, sedangkan Abu Qatadah tidak berihram, lalu kami melihat beberapa ekor himar liar, kemudian ditangkap oleh Abu Qatadah, lalu disembelihnya. Kemudian kami berhenti untuk memakan dagingnya. Dan kami pun berkata, 'Kita makan daging hewan buruan, padahal kita sedang ihram.' Maka sisa daging tersebut pun kami bawa.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bertanya: \"Apakah ada seorang dari kalian yang telah menyuruh atau memberinya petunjuk (isyarat) terhadap buruan tersebut?\" Mereka menjawab, \"Tidak ada.\" Akhirnya beliau pun bersabda: \"Kalau begitu, makanlah dagingnya yang masih tersisa.\" Dan Telah menceritakannya kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] -dalam riwayat lain- Dan telah menceritakan kepadaku [Al Qasim bin Zakariya] telah menceritakan kepada kami [ubaidhullah] dari [Syaiban] semuanya dari [Utsman bin Abdullah bin Mauhab] dengan isnad ini. Di dalam riwayatnya Syaiban termaktub; \"Maka Rasulullah shallallahu 'alaihi wasallam bertanya; 'Apakah ada salah seorang dari kalian yang menyuruhnya untuk berburu atau memberinya petunjuk (isyarat) kepadanya himar itu? '\" sementara di dalam riwayat Syu'bah termaktub; \"Apakah kalian telah memberi isyarat, atau ikut membantu atau pun ikut berburu?\" Syu'bah berkata; Saya tidak tahu apakah; \"Apakah kalian turut membantu?\" atau \"Apakah kalian ikut berburu?\""
            },
            {
                "number": 1942,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ أَخْبَرَنِي يَحْيَى أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ أَنَّ أَبَاهُ رَضِيَ اللَّهُ عَنْهُ أَخْبَرَهُأَنَّهُ غَزَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ الْحُدَيْبِيَةِ قَالَ فَأَهَلُّوا بِعُمْرَةٍ غَيْرِي قَالَ فَاصْطَدْتُ حِمَارَ وَحْشٍ فَأَطْعَمْتُ أَصْحَابِي وَهُمْ مُحْرِمُونَ ثُمَّ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْبَأْتُهُ أَنَّ عِنْدَنَا مِنْ لَحْمِهِ فَاضِلَةً فَقَالَ كُلُوهُ وَهُمْ مُحْرِمُونَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ النُّمَيْرِيُّ حَدَّثَنَا أَبُو حَازِمٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ رَضِيَ اللَّهُ عَنْهُ أَنَّهُمْ خَرَجُوا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمْ مُحْرِمُونَ وَأَبُو قَتَادَةَ مُحِلٌّ وَسَاقَ الْحَدِيثَ وَفِيهِ فَقَالَ هَلْ مَعَكُمْ مِنْهُ شَيْءٌ قَالُوا مَعَنَا رِجْلُهُ قَالَ فَأَخَذَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَهَا و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ ح و حَدَّثَنَا قُتَيْبَةُ وَإِسْحَقُ عَنْ جَرِيرٍ كِلَاهُمَا عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ قَالَ كَانَ أَبُو قَتَادَةَ فِي نَفَرٍ مُحْرِمِينَ وَأَبُو قَتَادَةَ مُحِلٌّ وَاقْتَصَّ الْحَدِيثَ وَفِيهِ قَالَ هَلْ أَشَارَ إِلَيْهِ إِنْسَانٌ مِنْكُمْ أَوْ أَمَرَهُ بِشَيْءٍ قَالُوا لَا يَا رَسُولَ اللَّهِ قَالَ فَكُلُوا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Mu'awiyah bin Sallam] telah mengabarkan kepadaku [Yahya] telah mengabarkan kepadaku [Abdullah bin Abu Qatadah] bahwa [bapaknya] radliallahu 'anhu telah mengabarkan kepadanya ia pernah berperang bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam yakni perang Hudaibiyah, lalu mereka para sahabat melakukan Ihram untuk Umrah, selain aku. Kemudian aku pun berburu himar liar, dan memberikannya kepada sahabat-sahabatku yang sedang ihram. Kemudian aku mendatangi Rasulullah shallallahu 'alaihi wasallam dan memberitahukan kepadanya, bahwa kami masih mempunyai sisa daging himar liar, maka beliau pun bersabda: \"Makanlah oleh kalian semua.\" Padahal saat itu mereka sedang berihram. Telah menceritakan kepada kami [Ahmad bin Abdah Adl Dlabbi] telah menceritakan kepada kami [Fudlail bin Sulaiman An Numairi] telah menceritakan kepada kami [Abu Hazim] dari [Abdullah bin Abu Qatadah] dari [bapaknya] radliallahu 'anhu bahwasanya; Mereka pernah berangkat bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam dan saat itu mereka sedang ihram, sementara Abu Qatadah tidak. Lalu ia pun menyebutkan hadits itu, dan di dalamnya ia menyebutkan; Maka beliau bertanya: \"Apakah kalian masih mempunyai sisa dagingnya?\" mereka menjawab, \"Kami masih mempunyai kakinya.\" Lalu Rasulullah shallallahu 'alaihi wasallam pun mengambil dan memakannya. Dan Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abul Ahwash] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Qutaibah] dan [Ishaq] dari [Jarir] keduanya dari [Abdul Aziz bin Rufai'] dari [Abdullah bin Abu Qatadah] ia berkata; \" [Abu Qatadah] pernah berada dalam suatu rombongan yang sedang ihram, sementara ia sendiri tidak.\" Lalu ia pun mengisahkan hadits itu. Dan di dalamnya ia menyebutkan; Beliau bertanya: \"Adakah seseorang dari kalian yang memberi isyarat atau memerintahkannya dengan sesuatu?\" mereka menjawab, \"Tidak, ya Rasulullah.\" Beliau bersabda: \"Kalau begitu, makanlah.\""
            },
            {
                "number": 1943,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ عَنْ أَبِيهِ قَالَكُنَّا مَعَ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ وَنَحْنُ حُرُمٌ فَأُهْدِيَ لَهُ طَيْرٌ وَطَلْحَةُ رَاقِدٌ فَمِنَّا مَنْ أَكَلَ وَمِنَّا مَنْ تَوَرَّعَ فَلَمَّا اسْتَيْقَظَ طَلْحَةُ وَفَّقَ مَنْ أَكَلَهُ وَقَالَ أَكَلْنَاهُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] telah mengabarkan kepadaku [Muhammad bin Al Munkadir] dari [Mu'adz bin Abdurrahman] dari [Mu'adz bin Abdurrahman bin Utsman At Tamimi] dari [bapaknya] ia berkata; Kami pernah melakukan Ihram bersama-sama dengan Thalhah bin ubaidhullah. Kemudian ia diberi hadiah burung saat ia tertidur. Lalu di antara kami ada yang memakannya dan ada pula yang enggan. Ketika Thalhah bangun, ia pun mendapati orang yang memakannya, maka ia berkata; Kami pernah memakannya bersama Rasulullah shallallahu 'alaihi wasallam (saat ihram).\""
            },
            {
                "number": 1944,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ بْنَ مِقْسَمٍ يَقُولُ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ يَقُولُ سَمِعْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَرْبَعٌ كُلُّهُنَّ فَاسِقٌ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ الْحِدَأَةُ وَالْغُرَابُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُقَالَ فَقُلْتُ لِلْقَاسِمِ أَفَرَأَيْتَ الْحَيَّةَ قَالَ تُقْتَلُ بِصُغْرٍ لَهَا",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] dan [Ahmad bin Isa] keduanya berkata, telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Makhramah bin Bukair] dari [bapaknya] ia berkata, saya mendengar [ubaidhullah bin Miqsam] berkata, saya mendengar [Al Qasim bin Muhammad] berkata, saya mendengar [Aisyah] isteri Nabi shallallahu 'alaihi wasallam berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada empat macam binatang yang kesemuanya boleh dibunuh baik di luar tanah haram atau di dalamnya, yaitu; elang, gagak, tikus dan anjing gila.\" ubaidhullah bin Miqsam berkata; saya bertanya kepada Al Qasim, \"Bagaimana dengan Ular?\" ia menjawab, \"Ular juga diboleh dibunuh, meskipun kecil.\""
            },
            {
                "number": 1945,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ خَمْسٌ فَوَاسِقُ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ الْحَيَّةُ وَالْغُرَابُ الْأَبْقَعُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ وَالْحُدَيَّا",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnul Mutsanna] dan [Ibnu Basysyar] keduanya berkata, Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] saya mendengar [Qatadah] menceritakan dari [Sa'id bin Al Musayyab] dari [Aisyah] radliallahu 'anha, dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Ada lima jenis binatang yang boleh dibunuh baik di tanah haram atau pun di luar tanah haram, yaitu; Ular, gagak yang di punggung atau perutnya ada warna putih, tikus, anjing gila dan elang.\""
            },
            {
                "number": 1946,
                "arab": "و حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ فَوَاسِقُ يُقْتَلْنَ فِي الْحَرَمِ الْعَقْرَبُ وَالْفَأْرَةُ وَالْحُدَيَّا وَالْغُرَابُ وَالْكَلْبُ الْعَقُورُو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ بِهَذَا الْإِسْنَادِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] radliallahu 'anha, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada lima macam binatang berbahaya yang boleh dibunuh di tanah haram, yaitu; kalajengking, tikus, dan elang, anjing gila.\" Dan Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Hisyam] dengan isnad ini."
            },
            {
                "number": 1947,
                "arab": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ فَوَاسِقُ يُقْتَلْنَ فِي الْحَرَمِ الْفَأْرَةُ وَالْعَقْرَبُ وَالْغُرَابُ وَالْحُدَيَّا وَالْكَلْبُ الْعَقُورُو حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ قَالَتْ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ خَمْسِ فَوَاسِقَ فِي الْحِلِّ وَالْحَرَمِ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ يَزِيدَ بْنِ زُرَيْعٍ",
                "id": "Dan Telah menceritakan kepada kami [ubaidhullah bin Umar Al Qawariri] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari [Aisyah] radliallahu 'anha, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada lima macam binatang berbahaya yang boleh dibunuh di tanah haram, yaitu; Tikus, kala jengking, ular, elang dan anjing gila.\" Dan Telah menceritakannya kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dengan isnad ini. Ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh lima macam binatang berbahaya baik di luar tanah haram, atau di dalam tanah haram. Kemudian ia pun menyebutkan sebagaiaman yang terdapat dalam haditsnya Yazid bin Zurai'."
            },
            {
                "number": 1948,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الدَّوَابِّ كُلُّهَا فَوَاسِقُ تُقْتَلُ فِي الْحَرَمِ الْغُرَابُ وَالْحِدَأَةُ وَالْكَلْبُ الْعَقُورُ وَالْعَقْرَبُ وَالْفَأْرَةُ",
                "id": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah] keduanya berkata, telah mengabarkan kepada kami [Ibnu Wab] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Urwah bin Zubair] dari [Aisyah] radliallahu 'anha, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada lima jenis binatang yang berbahaya, semuanya boleh dibunuh di tanah haram, yaitu; Gagak, elang, anjing gila, kalajengking dan tikus.\""
            },
            {
                "number": 1949,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسٌ لَا جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ فِي الْحَرَمِ وَالْإِحْرَامِ الْفَأْرَةُ وَالْعَقْرَبُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْكَلْبُ الْعَقُورُو قَالَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ فِي الْحُرُمِ وَالْإِحْرَامِ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] dan [Ibnu Abu Umar] semuanya dari [Ibnu Uyainah] - [Zuhair] berkata- Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Salim] dari [bapaknya] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ada lima jenis binatang yang tidak ada dosa bagi orang yang membunuhnya baik di tanah haram atau pun di luar tanah haram, yaitu; tikus, kalajengking, burung gagak, elang dan anjing gila.\" Dan Ibnu Abu Umar berkata di dalam riwayatnya; Di dalam tanah haram saat berihram."
            },
            {
                "number": 1950,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا زَيْدُ بْنُ جُبَيْرٍ أَنَّ رَجُلًا سَأَلَ ابْنَ عُمَرَ مَا يَقْتُلُ الْمُحْرِمُ مِنْ الدَّوَابِّفَقَالَ أَخْبَرَتْنِي إِحْدَى نِسْوَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَمَرَ أَوْ أُمِرَ أَنْ يَقْتُلَ الْفَأْرَةَ وَالْعَقْرَبَ وَالْحِدَأَةَ وَالْكَلْبَ الْعَقُورَ وَالْغُرَابَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Zaid bin Jubair] bahwa seorang laki-laki bertanya kepada [Ibnu Umar] tentang binatang apa saja yang boleh dibunuh. Maka ia pun menjawab; \"Salah seorang dari isteri-isteri Rasulullah shallallahu 'alaihi wasallam telah mengabarkan kepadaku bahwa beliau memerintahkan -atau- telah diperintahkan untuk membunuh tikus, kalajengking, elang, anjing gila dan burung gagak.\""
            },
            {
                "number": 1951,
                "arab": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ زَيْدِ بْنِ جُبَيْرٍ قَالَ سَأَلَ رَجُلٌ ابْنَ عُمَرَ مَا يَقْتُلُ الرَّجُلُ مِنْ الدَّوَابِّ وَهُوَ مُحْرِمٌقَالَ حَدَّثَتْنِي إِحْدَى نِسْوَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَأْمُرُ بِقَتْلِ الْكَلْبِ الْعَقُورِ وَالْفَأْرَةِ وَالْعَقْرَبِ وَالْحُدَيَّا وَالْغُرَابِ وَالْحَيَّةِ قَالَ وَفِي الصَّلَاةِ أَيْضًا",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Abu Awanah] dari [Zaid bin Jubair] ia berkat; Seorang laki-laki bertanya kepada [Ibnu Umar], \"Binatang apa saja yang boleh dibunuh oleh seseorang yang muhrim (melakukan Ihram)?\" Ibnu Umar menjawabl; \"Salah seorang dari isteri-isteri Nabi shallallahu 'alaihi wasallam telah menceritakan kepadaku, bahwa beliau telah memerintahkan untuk membunuh anjing gila, tikus, kalajengking, elang, burung gagak dan ular.\" Ibnu Umar melanjutkan; (Diperintahkan juga untuk membunuhnya) di dalam sholat."
            },
            {
                "number": 1952,
                "arab": "و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ قُلْتُ لِنَافِعٍ مَاذَا سَمِعْتَ ابْنَ عُمَرَ يُحِلُّ لِلْحَرَامِ قَتْلَهُ مِنْ الدَّوَابِّ فَقَالَ لِي نَافِعٌ قَالَ عَبْدُ اللَّهِسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَمْسٌ مِنْ الدَّوَابِّ لَا جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ فِي قَتْلِهِنَّ الْغُرَابُ وَالْحِدَأَةُ وَالْعَقْرَبُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُو حَدَّثَنَاه قُتَيْبَةُ وَابْنُ رُمْحٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ ح و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ جَمِيعًا عَنْ نَافِعٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي جَمِيعًا عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنِي أَبُو كَامِلٍ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ مَالِكٍ وَابْنِ جُرَيْجٍ وَلَمْ يَقُلْ أَحَدٌ مِنْهُمْ عَنْ نَافعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا ابْنُ جُرَيْجٍ وَحْدَهُ وَقَدْ تَابَعَ ابْنَ جُرَيْجٍ عَلَى ذَلِكَ ابْنُ إِسْحَقَ و حَدَّثَنِيهِ فَضْلُ بْنُ سَهْلٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ نَافِعٍ وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَمْسٌ لَا جُنَاحَ فِي قَتْلِ مَا قُتِلَ مِنْهُنَّ فِي الْحَرَمِ فَذَكَرَ بِمِثْلِهِ",
                "id": "Dan Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Muhammad bin Bakr] telah menceritakan kepada kami [Ibnu Juraij] ia berkata; saya bertanya kepada [Nafi'], \"Apa yang telah Anda dengar dari [Ibnu Umar] mengenai binatang yang halal untuk dibunuh saat Ihram?\" maka Nafi' pun berkata kepadaku; Abdullah berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Ada lima jenis binatang yang tidak ada dosa bagi yang membunuhnya, yaitu; gagak, elang, kalajengking, tikus dan anjing gila.\" Dan Telah menceritakannya kepada kami [Qutaibah bin Sa'id] dan [Ibnu Rumh] dari [Laits bin Sa'd] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Jarir bin Hazim] dari [Nafi'] -dalam riwayat lain-Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] semuanya dari [ubaidhullah] -dalam riwayat lain- Dan telah menceritakan kepadaku [Abu Kamil] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnul Mutsanna] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya bin Sa'id] semuanya dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam, yakni sebagaimana haditsnya Malik dan Ibnu Juraij, namun tidak satu pun dari mereka yang menyebutkan; \"Dari Nafi', dari Ibnu Umar radliallahu 'anhuma; Saya mendengar Nabi shallallahu 'alaihi wasallam\" kecuali Ibnu Juraij sendiri dan Ibnu Ishaq juga mengikuti Ibnu Juraij dalam hal itu. Dan telah menceritakannya kepadaku [Fadl bin Sahl] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Nafi'] dan [ubaidhullah bin Abdullah] dari [Ibnu Umar] radliallahu 'anhuma, ia berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Ada lima jenis binatang yang tidak ada dosa dalam membunuhnya saat Ihram…\" maka ia pun menyebutkan hadits semisalnya."
            },
            {
                "number": 1953,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مَنْ قَتَلَهُنَّ وَهُوَ حَرَامٌ فَلَا جُنَاحَ عَلَيْهِ فِيهِنَّ الْعَقْرَبُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ وَالْغُرَابُ وَالْحُدَيَّاوَاللَّفْظُ لِيَحْيَى بْنِ يَحْيَى",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Yahya bin Ayyub] dan [Qutaibah bin Sa'id] dan [Ibnu Hujr] -Yahya bin Yahya berkata- telah mengabarkan kepada kami -sementara yang lain berkata- Telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Abdullah bin Dinar] bahwa ia mendengar [Abdullah bin Umar] radliallahu 'anhuma, berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada lima macam binatang, siapa yang membunuhnya saat ia Ihram, maka tidak ada dosa baginya, yaitu kalajengking, tikus, anjing gila, gagak, dan elang.\" Lafazh adalah milik Yahya bin Yahya."
            },
            {
                "number": 1954,
                "arab": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ أَيُّوبَ ح و حَدَّثَنِي أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ قَالَ سَمِعْتُ مُجَاهِدًا يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَأَتَى عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْحُدَيْبِيَةِ وَأَنَا أُوقِدُ تَحْتَ قَالَ الْقَوَارِيرِيُّ قِدْرٍ لِي و قَالَ أَبُو الرَّبِيعِ بُرْمَةٍ لِي وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ قَالَ قُلْتُ نَعَمْ قَالَ فَاحْلِقْ وَصُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ أَوْ انْسُكْ نَسِيكَةًقَالَ أَيُّوبُ فَلَا أَدْرِي بِأَيِّ ذَلِكَ بَدَأَ حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَزُهَيْرُ بْنُ حَرْبٍ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ ابْنِ عُلَيَّةَ عَنْ أَيُّوبَ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ",
                "id": "Dan telah menceritakan kepadaku [ubaidhullah bin Umar Al Qawariri] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] -dalam riwayat lain- Dan telah menceritakan kepadaku [Abu Rabi'] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] ia berkata, saya mendengar [Mujahid] menceritakan dari [Abdurrahman bin Abu Laila] dari [Ka'ab bin Ujrah] radliallahu 'anhu, ia berkata; Pada zaman Hudaibiyah, Rasulullah shallallahu 'alaihi wasallam mendatangiku, sementa aku sedang menyalakan api yang ada di bawah periuk -Abu Rabi' berkata- Burmah (yaitu sejenis periuk yang terbuat dari batu). Sedangkan kutu kepalaku telah bertebaran di wajahku. Maka beliau pun bertanya: \"Apakah kutu di kepalamu itu mengganggumu?\" saya menjawab, \"Ya.\" Beliau bersabda: \"Cukurlah rambutmu dan berpuasalah tiga hari, atau berilah makan kepada enam orang miskin, atau pun berkorbanlah.\" Ayyub berkata; Saya tidak tahu, dari yang mana beliau memulai. Telah menceritakan kepadaku [Ali bin Hurj As Sa'di] dan [Zuhair bin Harb] dan [Ya'qub bin Ibrahim] dari [Ibnu Ulayyah] dari [Ayyub] dalam isnad ini, dengan hadits yang semisalnya."
            },
            {
                "number": 1955,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَفِيَّ أُنْزِلَتْ هَذِهِ الْآيَةُ{ فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ }قَالَ فَأَتَيْتُهُ فَقَالَ ادْنُهْ فَدَنَوْتُ فَقَالَ ادْنُهْ فَدَنَوْتُ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُؤْذِيكَ هَوَامُّكَ قَالَ ابْنُ عَوْنٍ وَأَظُنُّهُ قَالَ نَعَمْ قَالَ فَأَمَرَنِي بِفِدْيَةٍ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ مَا تَيَسَّرَ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu Adi] dari [Ibnu Aun] dari [Mujahid] dari [Abdurrahman bin Abu Laila] dari [Ka'ab bin Ujrah] radliallahu 'anhu, ia berkata; Kepadakulah ayat ini diturunkan; \"Jika ada di antaramu yang sakit atau ada gangguan di kepalanya (lalu ia bercukur), Maka wajiblah atasnya berfid-yah, yaitu: berpuasa atau bersedekah atau berkorban.\" (QS. Albaqarah; 196), Saya mendatangi beliau, dan beliau bersabda: \"Dekatkanlah ia.\" Saya pun mendekat. Beliau berkata lagi: \"Dekatkanlah ia.\" Saya pun lebih mendekat lagi, kemudian Nabi shallallahu 'alaihi wasallam bertanya: \"Apakah kutu dikepalamu itu mengganggumu?\" Ibnu Aun berkata; Saya menduga bahwa ia menjawab, \"Ya.\" Ka'ab bin Ujrah berkata; Lalu beliau pun memerintahkanku untuk membayar fidyah berupa puasa atau sedekah atau berkurban sesuai kemampuan."
            },
            {
                "number": 1956,
                "arab": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سَيْفٌ قَالَ سَمِعْتُ مُجَاهِدًا يَقُولُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى حَدَّثَنِي كَعْبُ بْنُ عُجْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَفَ عَلَيْهِ وَرَأْسُهُ يَتَهَافَتُ قَمْلًا فَقَالَ أَيُؤْذِيكَ هَوَامُّكَ قُلْتُ نَعَمْ قَالَ فَاحْلِقْ رَأْسَكَ قَالَ فَفِيَّ نَزَلَتْ هَذِهِ الْآيَةُ{ فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ }فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُمْ ثَلَاثَةَ أَيَّامٍ أَوْ تَصَدَّقْ بِفَرَقٍ بَيْنَ سِتَّةِ مَسَاكِينَ أَوْ انْسُكْ مَا تَيَسَّرَ",
                "id": "Dan Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Saif] ia berkata, saya mendengar [Mujahid] berkata, telah menceritakan kepadaku [Abdurrahman bin Abu Laila] telah menceritakan kepadaku [Ka'ab bin Ujrah] radliallahu 'anhu katanya; Bahwa ketika ia sedang ihram, Rasulullah shallallahu 'alaihi wasallam berdiri di dekatnya, sedangkan kutu berjatuhan dari kepadalanya. Maka beliau pun bertanya: \"Apakah kutumu itu mengganggumu?\" saya menjawab, \"Ya.\" Beliau bersabda: \"Cukurlah rambutmu.\" Ka'ab berkata; Maka kepadakulah ayat ini diturunkan: \"… atau ada gangguan di kepalanya (lalu ia bercukur), Maka wajiblah atasnya berfid-yah, yaitu: berpuasa atau bersedekah atau berkorban.\" (QS. Albaqarah; 196), Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Berpuasalah tiga hari, atau bersedekahlah kepada enam orang miskin atau berkurban dengan sesuatu yang mudah di dapatkan.\""
            },
            {
                "number": 1957,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ وَأَيُّوبَ وَحُمَيْدٍ وَعَبْدِ الْكَرِيمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ بِالْحُدَيْبِيَةِ قَبْلَ أَنْ يَدْخُلَ مَكَّةَ وَهُوَ مُحْرِمٌ وَهُوَ يُوقِدُ تَحْتَ قِدْرٍ وَالْقَمْلُ يَتَهَافَتُ عَلَى وَجْهِهِ فَقَالَ أَيُؤْذِيكَ هَوَامُّكَ هَذِهِ قَالَ نَعَمْ قَالَ فَاحْلِقْ رَأْسَكَ وَأَطْعِمْ فَرَقًا بَيْنَ سِتَّةِ مَسَاكِينَ وَالْفَرَقُ ثَلَاثَةُ آصُعٍ أَوْ صُمْ ثَلَاثَةَ أَيَّامٍ أَوْ انْسُكْ نَسِيكَةًقَالَ ابْنُ أَبِي نَجِيحٍ أَوْ اذْبَحْ شَاةً",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dan [Ayyub] dan [Humaid] dan [Abdul Karim] dari [Mujahid] dari [Ibnu Abu Laila] dari [Ka'b bin Ujrah] radliallahu 'anhu, bahwa ia bertemu dengan Nabi shallallahu 'alaihi wasallam pada masa berlangsungnya perjanjian Hudaibiyah sebelum masuk Makkah, dan ia sedang Ihram lagi menyalan api di bawah periuk, sementara kutu telah berjatuhan ke wajahnya. Mak beliau pun bertanya: \"Apakah kutumu ini mengganggumu?\" Ia menjawab, \"Ya.\" Beliau bersabda: \"Cukurlah rambutmu dan berilah makan sebanyak satu Faraq (tiga Sha') kepada enam orang miskin, atau berpuasalah tiga hari, atau berkorbanlah.\" Ibnu Abu Najih berkata; \"Atau sembelihlah seekor kambing.\""
            },
            {
                "number": 1958,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ زَمَنَ الْحُدَيْبِيَةِ فَقَالَ لَهُ آذَاكَ هَوَامُّ رَأْسِكَ قَالَ نَعَمْ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْلِقْ رَأْسَكَ ثُمَّ اذْبَحْ شَاةً نُسُكًا أَوْ صُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ ثَلَاثَةَ آصُعٍ مِنْ تَمْرٍ عَلَى سِتَّةِ مَسَاكِينَ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Khalid bin Abdullah] dari [Khalid] dari [Abu Qilabah] dari [Abdurrahman bin Abu Laila] dari [Ka'ab bin Ujrah] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam pernah melewatinya pada masa perjanjian Hudaibiyah, lalu beliau bertanya: \"Apakah kutu di kepalamu itu mengganggumu?\" ia menjawab, \"Ya.\" Maka Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Cukurlah rambutmu, lalu sembelihlah seekor kambing sebagai nusuk. Atau berpuasalah tiga hari atau berilah makan sebanyak tiga Sha' kurma kepada enam orang miskin.\""
            },
            {
                "number": 1959,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَصْبَهَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ قَالَقَعَدْتُ إِلَى كَعْبٍ رَضِيَ اللَّهُ عَنْهُ وَهُوَ فِي الْمَسْجِدِ فَسَأَلْتُهُ عَنْ هَذِهِ الْآيَةِ{ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ }فَقَالَ كَعْبٌ رَضِيَ اللَّهُ عَنْهُ نَزَلَتْ فِيَّ كَانَ بِي أَذًى مِنْ رَأْسِي فَحُمِلْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ مَا كُنْتُ أُرَى أَنَّ الْجَهْدَ بَلَغَ مِنْكَ مَا أَرَى أَتَجِدُ شَاةً فَقُلْتُ لَا فَنَزَلَتْ هَذِهِ الْآيَةُ{ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ }قَالَ صَوْمُ ثَلَاثَةِ أَيَّامٍ أَوْ إِطْعَامُ سِتَّةِ مَسَاكِينَ نِصْفَ صَاعٍ طَعَامًا لِكُلِّ مِسْكِينٍ قَالَ فَنَزَلَتْ فِيَّ خَاصَّةً وَهِيَ لَكُمْ عَامَّةً",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abdurrahman bin Al Ashbahani] dari [Abdullah bin Ma'qil] ia berkata; Saya duduk bersama [Ka'ab radliallahu 'anhu] yang saat itu ia sedang berada di masjid. Lalu saya bertanya kepadanya tentang ayat ini; \"Maka wajiblah atasnya berfid-yah, yaitu: berpuasa atau bersedekah atau berkorban.\" (QS. Albaqarah; 196), Maka Ka'ab bin Ujrah radliallahu 'anhu menjawab; Ayat itu turun berkenaan dengan diriku. Aku pernah menderita sakit di kulit kepalaku (ketika sedang ihram), lalu aku dibawa menghadap Rasulullah shallallahu 'alaihi wasallam, sedangkan kutu telah bertebaran di wajahku. Maka beliau bersabda: \"Aku tidak pernah melihat penderitaan seperti yang menimpamu. Apakah kamu mampu mendapatkan seekor kambing?\" aku menjawab, \"Tidak.\" Maka turunlah ayat ini; \"Maka wajiblah atasnya berfid-yah, yaitu: berpuasa atau bersedekah atau berkorban.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau begitu, berpuasalah tiga hari, atau berilah makan kepada enam orang miskin, yakni setengah sha' untuk setiap orangnya.\" Ka'ab bin Ujrah berkata; Ayat tersebut turun khusus berkenaan dengan diriku, namun berlaku umum untuk kalian semua."
            },
            {
                "number": 1960,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَصْبَهَانِيِّ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مَعْقِلٍ حَدَّثَنِي كَعْبُ بْنُ عُجْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّهُ خَرَجَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُحْرِمًا فَقَمِلَ رَأْسُهُ وَلِحْيَتُهُ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَرْسَلَ إِلَيْهِ فَدَعَا الْحَلَّاقَ فَحَلَقَ رَأْسَهُ ثُمَّ قَالَ لَهُ هَلْ عِنْدَكَ نُسُكٌ قَالَ مَا أَقْدِرُ عَلَيْهِ فَأَمَرَهُ أَنْ يَصُومَ ثَلَاثَةَ أَيَّامٍ أَوْ يُطْعِمَ سِتَّةَ مَسَاكِينَ لِكُلِّ مِسْكِينَيْنِ صَاعٌ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِيهِ خَاصَّةً{ فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ }ثُمَّ كَانَتْ لِلْمُسْلِمِينَ عَامَّةً",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] dari [Zakaria bin Abu Za`idah] telah menceritakan kepada kami [Abdurrahman Al Ashbahani] telah menceritakan kepadaku [Abdullah bin Ma'qil] telah menceritakan kepadaku [Ka'ab bin Ujrah] radliallahu 'anhu katanya; Ia pernah pergi haji bersama-sama dengan Nabi shallallahu 'alaihi wasallam, sedangkan kepala dan jenggotnya penuh dengan kutu. Kemudian hal itu sampai sampai kepada Nabi shallallahu 'alaihi wasallam, dan beliau pun mengutus seseorang keapdanya. Lalu beliau memanggil tukang cukur untuk mencukur rambutnya. Akhirnya tukang cukur itu pun mencukur rambut Ka'ab bin Ujrah. Sesudah itu, beliau bertanya: \"Apakah kamu mempunyai Nusuk (hewan kurban)?\" ia menjawab, \"Saya tidak sanggup melakukannya.\" Maka beliau pun memerintahkannya untuk berpuasa tiga hari, atau memberi makan kepada enam orang miskin, yakni satu Sha' untuk setiap orangnya. Kemudian Allah menurunkan ayat yang khusus berkenaan dengan peristiwa itu; \"Jika ada di antaramu yang sakit atau ada gangguan di kepalanya (lalu ia bercukur), \" (QS. Albaqarah; 196) dan hukumnya kemudian menjadi umum bagi kaum muslimin."
            },
            {
                "number": 1961,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ طَاوُسٍ وَعَطَاءٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ishaq bin Ibrahim] -Ishaq berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru] dari [Thawus] dan [Atha`] dari [Ibnu Abbas] radliallahu 'anhuma, bahwa Nabi shallallahu 'alaihi wasallam berbekam saat beliau sedang Ihram."
            },
            {
                "number": 1962,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْمُعَلَّى بْنُ مَنْصُورٍ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ ابْنِ بُحَيْنَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ بِطَرِيقِ مَكَّةَ وَهُوَ مُحْرِمٌ وَسَطَ رَأْسِهِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Al Mu'lla bin Manshur] telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Alqamah bin Abu Alqamah] dari [Abdurrahman Al A'raj] dari [Ibnu Buhainah] bahwa Nabi shallallahu 'alaihi wasallam berbekam di tengah perjalanan menuju Makkah saat beliau Ihram, dan titik bekamnya tepat di tengah kepala."
            },
            {
                "number": 1963,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى عَنْ نُبَيْهِ بْنِ وَهْبٍ قَالَ خَرَجْنَا مَعَ أَبَانَ بْنِ عُثْمَانَحَتَّى إِذَا كُنَّا بِمَلَلٍ اشْتَكَى عُمَرُ بْنُ عُبَيْدِ اللَّهِ عَيْنَيْهِ فَلَمَّا كُنَّا بِالرَّوْحَاءِ اشْتَدَّ وَجَعُهُ فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ يَسْأَلُهُ فَأَرْسَلَ إِلَيْهِ أَنْ اضْمِدْهُمَا بِالصَّبِرِ فَإِنَّ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ إِذَا اشْتَكَى عَيْنَيْهِ وَهُوَ مُحْرِمٌ ضَمَّدَهُمَا بِالصَّبِرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Amru An Naqid] dan [Zuhair bin Harb] semuanya dari [Ibnu Uyainah] - [Abu Bakr] berkata- Telah menceritakan kepada kami [Sufyan bin Uyainah] telah menceritakan kepada kami [Ayyub bin Musa] dari [Nubaih bin Wahb] ia berkata; Kami naik haji besama-sama dengan [Aban bin Utsman]. Setelah sampai di Malal, Umar bin ubaidhullah sakit kedua matanya, dan ketika tiba di Rauha`, sakit matanya bertambah parah. Lalu ditanyakannya obatnya kepada Aban bin Utsman. Aban menyarankan supaya mengobatinya dengan daun sabir, karena ia ingat bahwa [Utsman] radliallahu 'anhu pernah mengabarkan dari Rasulullah shallallahu 'alaihi wasallam perihal seorang laki-laki yang sakit mata ketika ihram, lalu diobatinya dengan daun Sabir."
            },
            {
                "number": 1964,
                "arab": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنِي أَبِي حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ رَمِدَتْ عَيْنُهُ فَأَرَادَ أَنْ يَكْحُلَهَا فَنَهَاهُ أَبَانُ بْنُ عُثْمَانَوَأَمَرَهُ أَنْ يُضَمِّدَهَا بِالصَّبِرِ وَحَدَّثَ عَنْ عُثْمَانَ بْنِ عَفَّانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَعَلَ ذَلِكَ",
                "id": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali] telah menceritakan kepada kami [Abdush Shamad bin Abdul Warits] telah menceritakan kepadaku [bapakku] telah menceritakan kepada kami [Ayyub bin Musa] telah menceritakan kepadaku [Nubaih bin Wahb] bahwa Umar bin ubaidhullah bin Ma'mar sakit mata, lalu ia ingin mencelakinya, namun [Aban bin Utsman] segera melarangnya dan ia menyuruhnya untuk membalutnya dengan daun Sabir. Kemudian Aban menceritakan (hadits) dari [Utsman] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam, baha beliau pernah melakukan terapi tersebut."
            },
            {
                "number": 1965,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ زَيْدِ بْنِ أَسْلَمَ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَهَذَا حَدِيثُهُ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ وَالْمِسْوَرِ بْنِ مَخْرَمَةَ أَنَّهُمَا اخْتَلَفَا بِالْأَبْوَاءِ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ وَقَالَ الْمِسْوَرُ لَا يَغْسِلُ الْمُحْرِمُ رَأْسَهُ فَأَرْسَلَنِي ابْنُ عَبَّاسٍ إِلَى أَبِي أَيُّوبَ الْأَنْصَارِيِّ أَسْأَلُهُ عَنْ ذَلِكَفَوَجَدْتُهُ يَغْتَسِلُ بَيْنَ الْقَرْنَيْنِ وَهُوَ يَسْتَتِرُ بِثَوْبٍ قَالَ فَسَلَّمْتُ عَلَيْهِ فَقَالَ مَنْ هَذَا فَقُلْتُ أَنَا عَبْدُ اللَّهِ بْنُ حُنَيْنٍ أَرْسَلَنِي إِلَيْكَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ أَسْأَلُكَ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْسِلُ رَأْسَهُ وَهُوَ مُحْرِمٌ فَوَضَعَ أَبُو أَيُّوبَ رَضِيَ اللَّهُ عَنْهُ يَدَهُ عَلَى الثَّوْبِ فَطَأْطَأَهُ حَتَّى بَدَا لِي رَأْسُهُ ثُمَّ قَالَ لِإِنْسَانٍ يَصُبُّ اصْبُبْ فَصَبَّ عَلَى رَأْسِهِ ثُمَّ حَرَّكَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ ثُمَّ قَالَ هَكَذَا رَأَيْتُهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ بِهَذَا الْإِسْنَادِ وَقَالَ فَأَمَرَّ أَبُو أَيُّوبَ بِيَدَيْهِ عَلَى رَأْسِهِ جَمِيعًا عَلَى جَمِيعِ رَأْسِهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ فَقَالَ الْمِسْوَرُ لِابْنِ عَبَّاسٍ لَا أُمَارِيكَ أَبَدًا",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Amru An Naqid] dan [Zuhair bin Harb] dan [Qutaibah bin Sa'id] mereka berkata, Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Zaid bin Aslam] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] -dan haditsnya ini- dari [Malik bin Anas] -sebagaimana yang telah dibacakan kepadanya- dari [Zaid bin Aslam] dari [Ibrahim bin Abdullah bin Hunain] dari [bapaknya] dari Abdullah bin Abbas dan Al Miswar bin Makhramah bahwa keduanya berselisih pendapat di Abwa` mengenai membasuh kepala ketika ihram. Ibnu Abbas berkata, \"Seorang yang Muhrim (melakukan ihram) boleh membasuh kepalanya.\" Sedangkan Al Miswar berkata, \"Bagi seorang yang sedang ihram, tidak boleh membasuh kepalanya.\" Karena itu, Ibnu Abbas mengutusku kepada [Abu Ayyub Al Anshari] untuk menanyakan hukum masalah itu. Kudapati Abu Ayyub sedang mandi bertutupkan sehelai kain yang direntangkannya antara dua tiang. Aku memberi salam kepadanya, lalu ia menyahut, \"Siapa itu?\" jawabku, \"Aku, Abdullah bin Hunain, diutus oleh Ibnu Abbas untuk menanyakan kepada Anda perihal membasuh kepala saat Ihram, bagaimanakah Rasulullah shallallahu 'alaihi wasallam melakukannya?\" Abu Ayyub lalu merendahkan kain tabir, sehingga kelihatan kepalanya, lalu ia menggosok kepalanya dengan kedua tangannya ke arah muka dan belakang. Kemudian ia berkata, \"Demikianlah yang saya lihat Rasulullah shallallahu 'alaihi wasallam melakukannya.\" Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ali bin Khasyram] keduanya berkata, telah mengabarkan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Zaid bin Aslam] dengan isnad ini, dan ia menyebutkan; Maka Abu Ayyub mengangkat kedua tangannya di atas kepala lalu menarik keduanya ke depan dan ke belakang. Dan Al Miswar pun berkata kepada Ibnu Abbas, \"Saya tidak akan mendebatmu selama-lamanya.\""
            },
            {
                "number": 1966,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَّ رَجُلٌ مِنْ بَعِيرِهِ فَوُقِصَ فَمَاتَ فَقَالَ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلَا تُخَمِّرُوا رَأْسَهُ فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam bahwa; Seorang laki-laki jatuh dari Unta lalu patah lehernya dan meninggal. Maka beliau pun bersabda: \"Mandikanlah ia dengan air yang dicampur dengan daun bidara, kemudian kafani dengan kedua kain ihramnya, dan jangan tutupi kepalanya, karena Allah akan membangkitkannya kelak di hari kiamat dalam keadaan membaca Talbiyah (sedang mengerjakan haji).\""
            },
            {
                "number": 1967,
                "arab": "و حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرِو بْنِ دِينَارٍ وَأَيُّوبَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَبَيْنَمَا رَجُلٌ وَاقِفٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ إِذْ وَقَعَ مِنْ رَاحِلَتِهِ قَالَ أَيُّوبُ فَأَوْقَصَتْهُ أَوْ قَالَ فَأَقْعَصَتْهُ و قَالَ عَمْرٌو فَوَقَصَتْهُ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْنِ وَلَا تُحَنِّطُوهُ وَلَا تُخَمِّرُوا رَأْسَهُ قَالَ أَيُّوبُ فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا وَقَالَ عَمْرٌو فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ يُلَبِّيو حَدَّثَنِيهِ عَمْرٌو النَّاقِدُ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ قَالَ نُبِّئْتُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَجُلًا كَانَ وَاقِفًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ فَذَكَرَ نَحْوَ مَا ذَكَرَ حَمَّادٌ عَنْ أَيُّوبَ",
                "id": "Dan Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] telah menceritakan kepada kami [Hammad] dari [Amru bin Dinar] dan [Ayyub] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; Ketika seorang laki-laki melakukan wukuf di Arafah bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba ia terjatuh dari Untanya -Ayyub berkata; FA`AUQASHATHU, sementara Amru menyebutkan; FAWAQASHATHU- hingga lehernya patah (dan meninggal seketika). Kemudian disampaikanlah peristiwa itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau pun bersabda: \"Mandikanlah ia dengan air bercampur daun bidara. Lalu kafanilah dengan kedua helai kain ihramnya, janganlah kalian memakaikan wewangian padanya dan jangan pula menutupi kepalanya.\" Ayyub berkata; \"Karena Allah akan membangkitkannya kelak di hari kiamat dalam keadaan bertalbiyah (menunaikan haji).\" Amru menyebutkan; \"Karena Allah akan membangkitkannya kelak di hari kiamat dalam keadaan YULABBI (bertalbiyah).\" Dan telah menceritakannya kepadaku [Amru An Naqid] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ayyub] ia berkata, terlah diberitakan kepadaku dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma, bahwa ada seorang laki-laki yang sedang melakukan wukuf bersama Nabi shallallahu 'alaihi wasallam, jadi ia dalam keadaan ihram. Maka ia pun menyebutkan sebagaimana hadits yang disebutkan oleh Hammad dari Ayyub."
            },
            {
                "number": 1968,
                "arab": "و حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَأَقْبَلَ رَجُلٌ حَرَامًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَّ مِنْ بَعِيرِهِ فَوُقِصَ وَقْصًا فَمَاتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَأَلْبِسُوهُ ثَوْبَيْهِ وَلَا تُخَمِّرُوا رَأْسَهُ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ يُلَبِّيو حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّ سَعِيدَ بْنَ جُبَيْرٍ أَخْبَرَهُ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ أَقْبَلَ رَجُلٌ حَرَامٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا وَزَادَ لَمْ يُسَمِّ سَعِيدُ بْنُ جُبَيْرٍ حَيْثُ خَرَّ",
                "id": "Dan Telah menceritakan kepada kami [Ali bin Khasyram] telah mengabarkan kepada kami [Isa bin Yunus] dari [Ibnu Juraij] telah mengabarkan kepadaku [Amru bin Dinar] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; Seorang laki-laki melakukan Ihram bersama Nabi shallallahu 'alaihi wasallam, lalu ia tersungkur jatuh dari Unta hingga lehernya patah dan meninggal seketika itu. maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Mandikanlah jenazahnya dengan air bercampur daun bidara. Lalu kafanilah ia dengan kedua helai kain (ihram) -nya. Dan janganlah kalian menutupi kepala dengan surban, karena ia akan datang kelak di hari kiamat dalam keadaan Ihram.\" Dan Telah menceritakannya kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Muhammad bin Bakr Al Bursani] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Amru bin Dinar] bahwa [Sa'id bin Jubair] telah mengabarkan kepadanya dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; Seorang laki-laki melakukan Ihram bersama Rasulullah shallallahu 'alaihi wasallam. yakni serupa dengan hadits di atas. Hanya saja ia menyebutkan; \"Sebab, ia akan dibangkitkan kelak di hari kiamat dalam keadaan Mulabbiyan (berihram).\" Dan ia juga menambahkan; Sa'id bin Jubair tidak menyebutkan kata \"HAITSU KHARRA (jatuh tersungkur).\""
            },
            {
                "number": 1969,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَجُلًا أَوْقَصَتْهُ رَاحِلَتُهُ وَهُوَ مُحْرِمٌ فَمَاتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلَا تُخَمِّرُوا رَأْسَهُ وَلَا وَجْهَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا",
                "id": "Dan Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Amru bin Dinar] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma bahwa; Seorang laki-laki patah lehernya karena terjatuh dari Unta ketika Ihram hingga ia meninggal seketika. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandikanlah jenazahnya dengan air bercampur daun bidara. Lalu kafanilah ia dengan kedua helai kain (ihram) -nya. Dan janganlah kalian menutupi kepala dengan surban, jangan pula menutupi wajahnya, karena ia akan dibangkitnya kelak di hari kiamat dalam keadaan Ihram.\""
            },
            {
                "number": 1970,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو بِشْرٍ حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَجُلًا كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُحْرِمًا فَوَقَصَتْهُ نَاقَتُهُ فَمَاتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلَا تَمَسُّوهُ بِطِيبٍ وَلَا تُخَمِّرُوا رَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abu Bisyr] telah menceritakan kepada kami [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma -dalam riwayat lain- Dan Telah menceritakan kepada kami [Yahya bin Yahya] -lafazh juga miliknya- telah mengabarkan kepada kami [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma, bahwa seorang laki-laki sedang melakukan ihram bersama Rasulullah shallallahu 'alaihi wasallam, lalu lehernya patah karena terjatuh dari Untanya hingga ia meninggal seketika. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Mandikanlah jenazahnya dengan air campuran daun bidara. Kemudian kafanilah ia kainnya, dan jangan kalian memakaikannya wewangian, dan jangan pula mengenakan surban di kepalanya, karena ia akan dibangkitkan pada hari kiamat kelak dalam keadaan Ihram.\""
            },
            {
                "number": 1971,
                "arab": "و حَدَّثَنِي أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَجُلًا وَقَصَهُ بَعِيرُهُ وَهُوَ مُحْرِمٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُغْسَلَ بِمَاءٍ وَسِدْرٍ وَلَا يُمَسَّ طِيبًا وَلَا يُخَمَّرَ رَأْسُهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا",
                "id": "Dan telah menceritakan kepadaku [Abu Kamil Fudlail bin Husain Al Jahdari] telah menceritakan kepada kami [Abu Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma, bahwasanya; \"Seroang laki-laki patah lehernya karena terjatuh dari Untanya ketika Ihram bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam. lalu beliau memerintahkan agar jenazahnya dimandikan dengan air campuran daun bidara, jangan pakai harum-haruman dan jangan ditutup kepalanya, karena dia akan dibangkitkan kelak pada hari kiamat dalam keadaan ihram.\""
            },
            {
                "number": 1972,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ نَافعٍ قَالَ ابْنُ نَافِعٍ أَخْبَرَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا بِشْرٍ يُحَدِّثُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا يُحَدِّثُأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ فَوَقَعَ مِنْ نَاقَتِهِ فَأَقْعَصَتْهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُغْسَلَ بِمَاءٍ وَسِدْرٍ وَأَنْ يُكَفَّنَ فِي ثَوْبَيْنِ وَلَا يُمَسَّ طِيبًا خَارِجٌ رَأْسُهُقَالَ شُعْبَةُ ثُمَّ حَدَّثَنِي بِهِ بَعْدَ ذَلِكَ خَارِجٌ رَأْسُهُ وَوَجْهُهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Abu Bakr bin Nafi'] telah mengabarkan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Abu Bisyr] menceritakan dari [Sa'id bin Jubair] bahwa mendengar [Ibnu Abbas] radliallahu 'anhuma menceritakan bahwasanya; \"Seorang laki-laki yang sedang melakukan Ihram mendatangi Nabi shallallahu 'alaihi wasallam, kemudian laki-laki itu terjatuh dari Untanya lalu meninggal seketika. Maka Nabi shallallahu 'alaihi wasallam memerintahkan untuk memandikannya dengan air dan daun bidara, mengkafaninya dengan dua helai kain dan tidak melumurinya dengan wewangian serta membiarkan bagian kepalanya disingkap.\" Syu'bah berkata; Kemudian Abu Bisyr menceritakannya kepadaku; \"(Agar mereka) membiarkan kepala dan wajahnya tersingkap, sebab ia akan dibangkitkan -kelak pada hari kiamat- dalam keadaan bertalbiyah.\""
            },
            {
                "number": 1973,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ عَنْ زُهَيْرٍ عَنْ أَبِي الزُّبَيْرِ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ قَالَ ابْنُ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاوَقَصَتْ رَجُلًا رَاحِلَتُهُ وَهُوَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَأَنْ يَكْشِفُوا وَجْهَهُ حَسِبْتُهُ قَالَ وَرَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ وَهُوَ يُهِلُّ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Al Aswad bin Amir] dari [Zuhair] dari [Abu Az Zubair] ia berkata, saya mendengar [Sa'id bin Jubair] berkata, [Ibnu Abbas] radliallahu 'anhuma berkata; Seorang laki-laki terjatuh dari Untanya hingga lehernya patah (dan menigggal), dan saat itu ia sedang bersama Rasulullah shallallahu 'alaihi wasallam. Lalu beliau memerintahkan agar para sahabat memandikannya dengan air dan daun bidara serta menyingkap wajahnya. Abu Zubari berkata; Dan saya menduga ia menyebutkan; (agar mereka menyingkap) kepalanya, sebab ia akan dibangkitkan kelak pada hari kiamat dalam keadaan membaca Talbiyah."
            },
            {
                "number": 1974,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا إِسْرَائِيلُ عَنْ مَنْصُورٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَكَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَوَقَصَتْهُ نَاقَتُهُ فَمَاتَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْسِلُوهُ وَلَا تُقَرِّبُوهُ طِيبًا وَلَا تُغَطُّوا وَجْهَهُ فَإِنَّهُ يُبْعَثُ يُلَبِّي",
                "id": "Dan Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [ubaidhullah bin Musa] telah menceritakan kepada kami [Isra`il] dari [Manshur] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; Ada seorang laki-laki bersama Rasulullah shallallahu 'alaihi wasallam, ia terjatuh (dari Untanya hingga) lehernya patah, maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Mandikanlah ia, dan janganlah kalian memakaikan wewangian padanya. Dan jangan pula menutup wajahnya, karena akan dibangkitkan (kelak pada hari kiamat) dalam keadaan membaca Talbiyah.\""
            },
            {
                "number": 1975,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَقَالَ لَهَا أَرَدْتِ الْحَجَّ قَالَتْ وَاللَّهِ مَا أَجِدُنِي إِلَّا وَجِعَةً فَقَالَ لَهَا حُجِّي وَاشْتَرِطِي وَقُولِي اللَّهُمَّ مَحِلِّي حَيْثُ حَبَسْتَنِي وَكَانَتْ تَحْتَ الْمِقْدَادِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Ala` Al Hamdani] Telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [bapaknya] dari [Aisyah] radliallahu 'anha, ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah datang ke rumah Dluba'ah binti Zubair, lalu beliau bertanya: \"Adakah kamu bermaksud hendak naik haji?\" jawab, Dlubabah, \"Aku sakit ya Rasulullah!\" beliau bersabda: \"Hajilah dengan niat bersyarat. Ucapkanlah; 'ALLAHUMMA MAHILLI HAITSU HABASTANI (Ya Allah, aku akan tahallul (berhenti) jika Engkau menahanku -bila tambah sakit dan tak sanggup meneruskannya-).'\" Saat itu, Dluba'ah adalah isteri dari Miqdad."
            },
            {
                "number": 1976,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ الْحَجَّ وَأَنَا شَاكِيَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُجِّي وَاشْتَرِطِي أَنَّ مَحِلِّي حَيْثُ حَبَسْتَنِيو حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا مِثْلَهُ",
                "id": "Dan Telah meceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari [Aisyah] radliallahu 'anha, ia berkata; Nabi shallallahu 'alaihi wasallam datang ke rumah Dluba'ah binti Zubair bin Abdul Muthalib. Lalu Dluba'ah pun berkata, \"Ya Rasulullah, aku bermaksud hendak menunaikan ibadah haji, tetapi aku sakit, bagaimana itu?\" maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Hajilah dan syariatkan dalam niatmu akan tahallul (berhenti) jika tak sanggup meneruskannya karena sakit.\" Dan telah meceritakan kepadaku [Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] radliallahu 'anha semisalnya."
            },
            {
                "number": 1977,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ وَأَبُو عَاصِمٍ وَمُحَمَّدُ بْنُ بَكْرٍ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لَهُ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ طَاوُسًا وَعِكْرِمَةَ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ ضُبَاعَةَ بِنْتَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ رَضِيَ اللَّهُ عَنْهَا أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنِّي امْرَأَةٌ ثَقِيلَةٌ وَإِنِّي أُرِيدُ الْحَجَّ فَمَا تَأْمُرُنِي قَالَ أَهِلِّي بِالْحَجِّ وَاشْتَرِطِي أَنَّ مَحِلِّي حَيْثُ تَحْبِسُنِي قَالَ فَأَدْرَكَتْ",
                "id": "Dan Telah meceritakan kepada kami [Muhammad bin Basysyar] Telah menceritakan kepada kami [Abdul Wahhab bin Abdul Majid] dan [Abu Ashim] dan [Muhammad bin Bakr] dari [Ibnu Juraij] -dalam riwayat lain- Telah menceritakan kepada kami [Ishaq bin Ibrahim] -lafazh darinya- telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Thawus] dan [Ikrimah] Maula Ibnu Abbas, dari [Ibnu Abbas] bahwasanya; Dluba'ah bini Zubair bin Abdul Muthalib radliallahu 'anha menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Saya adalah seorang wanita yang berat (karena sakit), namun ingin sekali berhaji, lalu apa yang Anda perintahkan padaku?\" beliau bersabda: \"Niatkanlah untuk berhaji dan syaratkan, 'ANNA MAHILLII HAITSU TAHBISUNII (Ya Allah, aku akan tahallul (berhenti) jika Engkau menahanku -bila tambah sakit dan tak sanggup meneruskannya-).'\" Ibnu Abbas berkata; Lalu Dluba'ah pun mendapatkannya."
            },
            {
                "number": 1978,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا حَبِيبُ بْنُ يَزِيدَ عَنْ عَمْرِو بْنِ هَرِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ وَعِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ ضُبَاعَةَ أَرَادَتْ الْحَجَّ فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَشْتَرِطَ فَفَعَلَتْ ذَلِكَ عَنْ أَمْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] Telah menceritakan kepada kami [Abu Dawud Ath Thiyalisi] Telah menceritakan kepada kami [Habib bin Yazid] dari [Amru bin Haram] dari [Sa'id bin Jubair] dan [Ikrimah] dari [Ibnu Abbas] radliallahu 'anhuma, bahwa Dluba'ah ingin menunaikan haji, maka Nabi shallallahu 'alaihi wasallam pun memerintahkannya untuk menyaratkan (di dalam niatnya), lalu ia pun mengerjakan perintah Rasulullah shallallahu 'alaihi wasallam tersebut."
            },
            {
                "number": 1979,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَأَبُو أَيُّوبَ الْغَيْلَانِيُّ وَأَحْمَدُ بْنُ خِرَاشٍ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو عَامِرٍ وَهُوَ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا رَبَاحٌ وَهُوَ ابْنُ أَبِي مَعْروفٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِضُبَاعَةَ حُجِّي وَاشْتَرِطِي أَنَّ مَحِلِّي حَيْثُ تَحْبِسُنِيوَفِي رِوَايَةِ إِسْحَقَ أَمَرَ ضُبَاعَةَ",
                "id": "Dan Telah meceritakan kepada kami [Ishaq bin Ibrahim] dan [Abu Al Ghailani] dan [Ahmad bin Khirasy] -Ishaq berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- Telah menceritakan kepada kami [Abu Amir] ia adalah Abdul Malik bin Amru Telah menceritakan kepada kami [Rabah] ia adalah Ibnu Abu Ma'ruf dari [Atha`] dari [Ibnu Abbas] radliallahu 'anhuma bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada Dluba'ah: \"Berhajilah dan syaratkan dalam niatmu: 'ANNA MAHILLII HAITSU TAHBISUNII (Ya Allah, aku akan tahallul (berhenti) jika Engkau menahanku -bila tambah sakit dan tak sanggup meneruskannya-).'\" Sementara dalam riwayat Ishaq; Beliau memerintahkan Dluba'ah."
            },
            {
                "number": 1980,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ وَزُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ كُلُّهُمْ عَنْ عَبْدَةَ قَالَ زُهَيْرٌ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْنُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ بِالشَّجَرَةِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ يَأْمُرُهَا أَنْ تَغْتَسِلَ وَتُهِلَّ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sariya] dan [Zuhair bin Harb] dan [Utsman bin Abu Syaibah] semuanya dari [Abdah] - [Zuhair] berkata- Telah menceritakan kepada kami [Abdah bin Sulaiman] dari [ubaidhullah bin Umar] dari [Abdurrahman bin Al Qasim] dari [bapaknya] dari [Aisyah] radliallahu 'anha, ia berkata; \"Asma' binti 'Umais melahirkan Muhammad bin Abu Bakar di sebuah pohon di Dzulhulaifah, maka Rasulullah shallallahu 'alaihi wasallam pun memerintahkan kepada Abu Bakar untuk menyuruhnya mandi (junub) lalu memulai ihram.\""
            },
            {
                "number": 1981,
                "arab": "حَدَّثَنَا أَبُو غَسَّانَ مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا فِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ حِينَ نُفِسَتْ بِذِي الْحُلَيْفَةِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَأَمَرَهَا أَنْ تَغْتَسِلَ وَتُهِلَّ",
                "id": "Telah menceritakan kepada kami [Abu Ghassan Muhammad bin Amru] Telah menceritakan kepada kami [Jarir bin Abdul Hamid] dari [Yahya bin Sa'id] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin Abdullah] radliallahu 'anhuma, yakni terkait dengan hadits Asma binti Umais saat ia melahirkan di Dzulhulaifah bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan Abu Bakar radliallahu 'anhu, agar ia mandi junub atau  junub dan berniat Ihram."
            },
            {
                "number": 1982,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ فَأَهْلَلْنَا بِعُمْرَةٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مَعَهُ هَدْيٌ فَلْيُهِلَّ بِالْحَجِّ مَعَ الْعُمْرَةِ ثُمَّ لَا يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا قَالَتْ فَقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ لَمْ أَطُفْ بِالْبَيْتِ وَلَا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ انْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ قَالَتْ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ هَذِهِ مَكَانُ عُمْرَتِكِ فَطَافَ الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ حَلُّوا ثُمَّ طَافُوا طَوَافًا آخَرَ بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى لِحَجِّهِمْ وَأَمَّا الَّذِينَ كَانُوا جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] ia berkata, saya telah membacakan kepada [Malik] dari [Ibnu Syihab] dari [Urwah] dari [Aisyah] radliallahu 'anha, bahwa ia berkata; Kami pergi haji bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam pada tahun haji Wada', lalu kami ihram untuk umrah. Kemudian beliau bersabda: \"Siapa yang membawa hadya (hewan kurban) boleh ihram untuk haji dan umrah dan tidak boleh tahallul sebelum keduanya selesai.\" Aisyah berkata; Setibanya aku di Makkah, kebetulan aku haid, sehingga aku tidak thawaf di Baitullah dan tidak sa'i antara Shafa dan Marwa. Hal itu kulaporkan kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau pun bersabda: \"Lepas sanggulmu dan bersisirlah. Kemudian teruskan ihrammu untuk haji dan tinggalkan umrah.\" Apa yang diperintahkan beliau kulaksanakan semuanya. Setelah kami selesai mengerjakan haji, Rasulullah shallallahu 'alaihi wasallam menyuruhku bersama-sama Abdurrahman bin Abu Bakr pergi ke Tan'im untuk melakukan umrah. Beliau bersabda: \"Itulah ganti umrahmu yang gagal.\" Orang-orang yang tadinya ihram untuk umrah, setibanya di Makkah mereka terus thawaf dan Baitullah dan sa'i antara Shafa dan Marwa. Kemudian sekembalinya di mereka dari Mina, mereka thawaf kembali selaku thawaf akhir. Ada pun orang-orang yang menggabungkan niat haji dan umrah, mereka thawaf satu kali saja."
            },
            {
                "number": 1983,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْخَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ فَأَهْلَلْتُ بِعُمْرَةٍ وَلَمْ أَكُنْ سُقْتُ الْهَدْيَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مَعَهُ هَدْيٌ فَلْيُهْلِلْ بِالْحَجِّ مَعَ عُمْرَتِهِ ثُمَّ لَا يَحِلَّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا قَالَتْ فَحِضْتُ فَلَمَّا دَخَلَتْ لَيْلَةُ عَرَفَةَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ أَهْلَلْتُ بِعُمْرَةٍ فَكَيْفَ أَصْنَعُ بِحَجَّتِي قَالَ انْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَمْسِكِي عَنْ الْعُمْرَةِ وَأَهِلِّي بِالْحَجِّ قَالَتْ فَلَمَّا قَضَيْتُ حَجَّتِي أَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَأَرْدَفَنِي فَأَعْمَرَنِي مِنْ التَّنْعِيمِ مَكَانَ عُمْرَتِي الَّتِي أَمْسَكْتُ عَنْهَا",
                "id": "Dan Telah meceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari [Aisyah] radliallahu 'anha, ia berkata; Kami keluar berhaji bersama-sama dengan Nabi shallallahu 'alaihi wasallam pada tahun haji wada', lalu saya ihram untuk umrah, namun saya tidak membawa hadya. Maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Siapa yang membawa hadya (hewan kurban), hendaklah ia ihram untuk haji beserta umrahnya, dan tidak bertahallul hingga ia bertahallul dari keduanya.\" Kemudian saya haid, dan ketika masuk malam Arafah, saya bekata, \"Wahai Rasulullah, saya telah berihram untuk umrah, lalu apa yang mesti aku lakukan dengan hajiku?\" beliau menjawab: \"Lepaskanlah sanggul, sisirlah rambutmu dan tinggalkanlah umrah serta berihramlah untuk haji.\" Maka setelah saya menunaikan hajiku, beliau menyuruh Abdurrahman bin Abu Bakar (untuk menemaniku umrah). Lalu ia pun memboncengku dan menemaniku untuk melaksanakan umrah dari Tan'im sebagai ganti dari umrah yang kutinggalkan."
            },
            {
                "number": 1984,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ أَرَادَ مِنْكُمْ أَنْ يُهِلَّ بِحَجٍّ وَعُمْرَةٍ فَلْيَفْعَلْ وَمَنْ أَرَادَ أَنْ يُهِلَّ بِحَجٍّ فَلْيُهِلَّ وَمَنْ أَرَادَ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا فَأَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحَجٍّ وَأَهَلَّ بِهِ نَاسٌ مَعَهُ وَأَهَلَّ نَاسٌ بِالْعُمْرَةِ وَالْحَجِّ وَأَهَلَّ نَاسٌ بِعُمْرَةٍ وَكُنْتُ فِيمَنْ أَهَلَّ بِالْعُمْرَةِ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu Umar] Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Urwah] dari [Aisyah] radliallahu 'anha, ia berkata; Kami pernah keluar (untuk haji) bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Barangsiapa yang ingin berihram untuk haji dan umrah, maka hendaklah ia melakukannya. Dan siapa yang ingin ihram hanya untuk hanya, maka lakukanlah, dan siapa yang ingin ihram, hanya untuk haji, maka lakukanlah.\" Aisyah radliallahu 'anha berkata; Kemudian Rasulullah shallallahu 'alaihi wasallam berihram untuk haji dan para sahabat pun ikut ihram bersamanya, dan ada juga yang ihram untuk umrah dan haji, serta ada pula yang ihram untuk umrah. Dan saya termasuk yang berihram untuk umrah."
            },
            {
                "number": 1985,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الْأَسْوَدِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِالْحَجِّ وَأَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ فَأَمَّا مَنْ أَهَلَّ بِعُمْرَةٍ فَحَلَّ وَأَمَّا مَنْ أَهَلَّ بِحَجٍّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ فَلَمْ يَحِلُّوا حَتَّى كَانَ يَوْمُ النَّحْرِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Abul Aswad Muhammad bin Abdurrahman bin Naufal] dari [Urwah] dari [Aisyah] radliallahu 'anha, bahwa ia berkata; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam pada tahun haji waja', di antara kami ada yang ihram untuk umrah, ada yang ihram untuk haji dan umrah sekaligus, dan ada pula yang ihram untuk haji. Sementara Rasulullah shallallahu 'alaihi wasallam ihram untuk haji. Maka mereka yang ihram untuk umrah boleh tahallul, sedangkan mereka yang ihram untuk haji atau yang menggabungkan keduanya tidak boleh tahallul sampai hari Nahar tiba.\""
            },
            {
                "number": 1986,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْخَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَرَى إِلَّا الْحَجَّ حَتَّى إِذَا كُنَّا بِسَرِفَ أَوْ قَرِيبًا مِنْهَا حِضْتُ فَدَخَلَ عَلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي فَقَالَ أَنَفِسْتِ يَعْنِي الْحَيْضَةَ قَالَتْ قُلْتُ نَعَمْ قَالَ إِنَّ هَذَا شَيْءٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ فَاقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ حَتَّى تَغْتَسِلِي قَالَتْ وَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ بِالْبَقَرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Amru An Naqid] dan [Zuhair bin Harb] semuanya dari [Ibnu Uyainah] - [Amru] berkata- Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abdurrahman bin Al Qasim] dari [bapaknya] dari [Aisyah] radliallahu 'anha, ia berkata; Kami pergi bersama-sama Nabi shallallahu 'alaihi wasallam, tiada lain niat kami selain haji. Setelah kami sampai dekat Sarif, tiba-tiba aku haid. Ketika Nabi shallallahu 'alaihi wasallam masuk ke dalam kemahku, didapatinya aku sedang menangis. Lalu beliau bertanya: \"Apakah kamu haid?\" jawabku, \"Benar ya Rasulullah.\" Beliau bersabda: \"Haid adalah hal yang lumrah bagi putera-puteri anak Adam. Karena itu, kerjakanlah apa yang seharusnya dikerjakan oleh orang haji, kecuali thawaf di Baitullah sehingga kamu mandi suci terlebih dahulu.\" Aisyah berkata; Kemudian beliau menyembelih sapi untuk kurban para isteri-isterinya."
            },
            {
                "number": 1987,
                "arab": "حَدَّثَنِي سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ أَبُو أَيُّوبَ الْغَيْلَانِيُّ حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْكُرُ إِلَّا الْحَجَّ حَتَّى جِئْنَا سَرِفَ فَطَمِثْتُ فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي فَقَالَ مَا يُبْكِيكِ فَقُلْتُ وَاللَّهِ لَوَدِدْتُ أَنِّي لَمْ أَكُنْ خَرَجْتُ الْعَامَ قَالَ مَا لَكِ لَعَلَّكِ نَفِسْتِ قُلْتُ نَعَمْ قَالَ هَذَا شَيْءٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ افْعَلِي مَا يَفْعَلُ الْحَاجُّ غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ حَتَّى تَطْهُرِي قَالَتْ فَلَمَّا قَدِمْتُ مَكَّةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِهِ اجْعَلُوهَا عُمْرَةً فَأَحَلَّ النَّاسُ إِلَّا مَنْ كَانَ مَعَهُ الْهَدْيُ قَالَتْ فَكَانَ الْهَدْيُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَذَوِي الْيَسَارَةِ ثُمَّ أَهَلُّوا حِينَ رَاحُوا قَالَتْ فَلَمَّا كَانَ يَوْمُ النَّحْرِ طَهَرْتُ فَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَفَضْتُ قَالَتْ فَأُتِيَنَا بِلَحْمِ بَقَرٍ فَقُلْتُ مَا هَذَا فَقَالُوا أَهْدَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ الْبَقَرَ فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ قُلْتُ يَا رَسُولَ اللَّهِ يَرْجِعُ النَّاسُ بِحَجَّةٍ وَعُمْرَةٍ وَأَرْجِعُ بِحَجَّةٍ قَالَتْ فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَأَرْدَفَنِي عَلَى جَمَلِهِ قَالَتْ فَإِنِّي لَأَذْكُرُ وَأَنَا جَارِيَةٌ حَدِيثَةُ السِّنِّ أَنْعَسُ فَيُصِيبُ وَجْهِي مُؤْخِرَةَ الرَّحْلِ حَتَّى جِئْنَا إِلَى التَّنْعِيمِ فَأَهْلَلْتُ مِنْهَا بِعُمْرَةٍ جَزَاءً بِعُمْرَةِ النَّاسِ الَّتِي اعْتَمَرُواو حَدَّثَنِي أَبُو أَيُّوبَ الْغَيْلَانِيُّ حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادٌ عَنْ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ لَبَّيْنَا بِالْحَجِّ حَتَّى إِذَا كُنَّا بِسَرِفَ حِضْتُ فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ الْمَاجِشُونِ غَيْرَ أَنَّ حَمَّادًا لَيْسَ فِي حَدِيثِهِ فَكَانَ الْهَدْيُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَذَوِي الْيَسَارَةِ ثُمَّ أَهَلُّوا حِينَ رَاحُوا وَلَا قَوْلُهَا وَأَنَا جَارِيَةٌ حَدِيثَةُ السِّنِّ أَنْعَسُ فَيُصِيبُ وَجْهِي مُؤْخِرَةَ الرَّحْلِ",
                "id": "Telah menceritakan kepadaku [Sulaiman bin ubaidhullah Abu Ayyub Al Ghailani] Telah menceritakan kepada kami [Abu Amir Abdul Malik bin Amru] Telah menceritakan kepada kami [Abdul Aziz bin Abu Salamah Al Majisyun] dari [Abdurrahman bin Al Qasim] dari [bapaknya] dari [Aisyah] radliallahu 'anha, ia berkata; Kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam dan tidak ada maksud lain kecuali untuk haji. Dan ketika sampai di Sarif, aku mengalami haid, lalu Rasulullah shallallahu 'alaihi wasallam menemuiku yang pada saat itu aku sedang menangis. Maka beliau pun bertanya: \"Apa yang menyebabkanmu menangis?\" aku menjawab, \"Demi Allah, sekiranya aku tidak keluar (untuk haji) di tahun ini.\" Beliau bertanya lagi, \"Ada apa denganmu, sepertinya kamu sedang haid?\" Aku menjawab, \"Ya.\" Beliau bersabda: \"Ini adalah sesuatu yang telah ditetapkan Allah atas kaum wanita dari anak keturunan Adam. Karena itu, lakukanlah sebagaimana apa yang biasanya dilakukan oleh seorang yang haji, hanya saja kamu tidak boleh thawaf di Baitullah hingga suci kembali.\" Aisyah berkata; Ketika sampai di Makkah, Rasulullah shallallahu 'alaihi wasallam bersabda kepada para sahabatnya: \"Jadikanlah ihram kalian sebagai umrah.\" Maka orang-orang pun melakukan ihram untuk umrah kecuali bagi mereka yang membawa hadyu (hewan kurban). Yang termasuk membawa hadyu adalah Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, Umar dan mereka yang memiliki kendaraan. Maka saat istirahat, mereka pun membaca talbiyah. Ketika hari Nahar tiba, aku pun suci dari haidku, maka Rasulullah shallallahu 'alaihi wasallam memerintahkanku untuk ikut berangkat. Lalu kami diberikan daging sapi, maka aku pun bertanya, \"Daging apa ini?\" mereka menjawab, \"Rasulullah shallallahu 'alaihi wasallam menyembelih hewan kurban berupa sapi untuk isteri-isterinya.\" Pada hari Hashabah, aku berkata, \"Ya Rasulullah, orang-orang pulang dengan membawa pahala haji dan umrah, sementara aku hanya membawa pahala haji.\" Akhirnya beliau memerintahkan Abdurrahman bin Abu Bakar (untuk menemaniku umrah). Maka Abdurrahman kemudian pun memboncengku di atas untanya. Saat itu, aku benar-masih teringat bahwa usiaku masih sangat muda belia. Bahkan aku mengantuk higga wajahku tertunduk di atas unta hingga kami sampai di Tan'im. Kemudian aku pun segera bertalbiyah (membulai ihram) untuk umrah, sebagaimana yang telah dikerjakan para sahabat yang lain. Dan telah menceritakan kepadaku [Abu Ayyub Al Ghailani] Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Hammad] dari [Abdurrahman] dari [bapaknya] dari [Aisyah] radliallahu 'anha, ia berkata; Kami membaca talbiyah (memulai ihram) untuk haji. Dan ketika kami sampai di Sarif aku mengalami haid. Kemudian Rasulullah Shallallahu 'Alai wa Sallam menemuiku dan ketika itu aku sedang mengangis. Maka ia pun menyebutkan hadits sebagaimana haditsnya Al Majisyuna. Hanya di dalam haditsnya Hammad, tidak tercantum; \"Yang membawa hadyu adalah Nabi shallallahu 'alaihi wasallam, Abu Bakar, Umar dan mereka yang memiliki kendaraan. Kemudian mereka pun membaca Talbiyah saat mereka istirahat.\" Dan tidak juga terdapat ungkapan Aisyah; \"Dan saat itu, aku masih sangat muda belia. Aku mengantuk hingga wajahtu terkelungkup di atas punggung kendaraan.\""
            },
            {
                "number": 1988,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ عَنْ أَفْلَحَ بْنِ حُمَيْدٍ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ فِي أَشْهُرِ الْحَجِّ وَفِي حُرُمِ الْحَجِّ وَلَيَالِي الْحَجِّ حَتَّى نَزَلْنَا بِسَرِفَ فَخَرَجَ إِلَى أَصْحَابِهِ فَقَالَ مَنْ لَمْ يَكُنْ مَعَهُ مِنْكُمْ هَدْيٌ فَأَحَبَّ أَنْ يَجْعَلَهَا عُمْرَةً فَلْيَفْعَلْ وَمَنْ كَانَ مَعَهُ هَدْيٌ فَلَا فَمِنْهُمْ الْآخِذُ بِهَا وَالتَّارِكُ لَهَا مِمَّنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ فَأَمَّا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ مَعَهُ الْهَدْيُ وَمَعَ رِجَالٍ مِنْ أَصْحَابِهِ لَهُمْ قُوَّةٌ فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي فَقَالَ مَا يُبْكِيكِ قُلْتُ سَمِعْتُ كَلَامَكَ مَعَ أَصْحَابِكَ فَسَمِعْتُ بِالْعُمْرَةِ قَالَ وَمَا لَكِ قُلْتُ لَا أُصَلِّي قَالَ فَلَا يَضُرُّكِ فَكُونِي فِي حَجِّكِ فَعَسَى اللَّهُ أَنْ يَرْزُقَكِيهَا وَإِنَّمَا أَنْتِ مِنْ بَنَاتِ آدَمَ كَتَبَ اللَّهُ عَلَيْكِ مَا كَتَبَ عَلَيْهِنَّ قَالَتْ فَخَرَجْتُ فِي حَجَّتِي حَتَّى نَزَلْنَا مِنًى فَتَطَهَّرْتُ ثُمَّ طُفْنَا بِالْبَيْتِ وَنَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُحَصَّبَ فَدَعَا عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَقَالَ اخْرُجْ بِأُخْتِكَ مِنْ الْحَرَمِ فَلْتُهِلَّ بِعُمْرَةٍ ثُمَّ لِتَطُفْ بِالْبَيْتِ فَإِنِّي أَنْتَظِرُكُمَا هَا هُنَا قَالَتْ فَخَرَجْنَا فَأَهْلَلْتُ ثُمَّ طُفْتُ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ فَجِئْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي مَنْزِلِهِ مِنْ جَوْفِ اللَّيْلِ فَقَالَ هَلْ فَرَغْتِ قُلْتُ نَعَمْ فَآذَنَ فِي أَصْحَابِهِ بِالرَّحِيلِ فَخَرَجَ فَمَرَّ بِالْبَيْتِ فَطَافَ بِهِ قَبْلَ صَلَاةِ الصُّبْحِ ثُمَّ خَرَجَ إِلَى الْمَدِينَةِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] Telah menceritakan kepada kami [Ishaq bin Sulaiman] dari [Aflah bin Humaid] dari [Al Qasim] dari [Aisyah] radliallahu 'anha, ia berkata; Kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam di bulan-bulan haji untuk menunaikan Ibadah haji, melewati hari dan malam-malam haji hingga kami singgah di Saraf. Kemudian beliau pun keluar menemui para sahabatnya dan bersabda: \"Siapa yang tidak membawa Hadyu (hewan kurban) dan ia suka bila menjadikan (ihramnya) sebagai Umrah, maka hendaklah ia melakukannya. Sedangkan siapa yang mempunyai hadyu (hewan kurban) maka janganlah ia melakukannya.\" Maka sebagian sahabat pun ada yang melakukannya, dan sebagian yang lain ada juga yang tidak, yakni mereka yang tidak membawa hadyu. Adapun Rasulullah shallallahu 'alaihi wasallam, maka beliau membawa hadyu, demikian juga beberapa sahabatnya yang kuat. Kemudian Rasulullah shallallahu 'alaihi wasallam masuk menemuiku (ke dalam kemahku), sementara saat itu aku sedang menangis, maka beliau pun bertanya: \"Apa yang menyebabkanmu menangis?\" Aku menjawab, \"Aku telah mendengar ungkapan Anda dengan para sahabat, maka aku pu mendengar ucapan umrah.\" Beliau bertanya lagi: \"Ada apa denganmu?\" Aku menjawab, \"(Sekatang) aku tidak sholat (karena sedang haidl).\" Akhirnya beliau bersabda: \"Hal itu tidaklah merugikanmu, lakukanlah ibadah hajimu. Semoga Allah memberimu pahala umrah. Kamu hanyalah anak ketururan Adam yang Allah telah tetapkan sebagaimana apa yang ditetapkan pada kaum wanita.\" Lalu aku pun keluar untuk haji hingga kami singgah di Mina. Kemudian aku bersuci dan melakukan thawaf di Baitullah, dan Rasulullah Shallahu 'Alaihi wa Sallam singgah di Al Muhashshab. Lalu beliau memanggil Abdurrahman bin Abu Bakar dan bersabda: \"Keluarlah bersama saudara perempuanmu dari Al Haram hingga ia dapat melakukan ihram untuk umrah dan thawaf di Baitullah, sedangkan aku menunggu kalian berdua di tempat ini.\" Akhirnya kami segera keluar, lalu aku berihram (untuk umrah) dan melakukan thawaf di Baitullah serta Sa'i antara Shafa dan Marwa. Sesudah itu, kami kembali menemui Rasulullah shallallahu 'alaihi wasallam di tempat persinggahannya yakni di malam hari. Lalu beliau bertanya: \"Apakah kamu telah selesai (mengerjakan umrah)?\" Aku menjawab, \"Ya.\" Akhirnya beliau mengungumkan kepada para sahabatnya untuk melanjutkan perjalanan. Kemudian beliau melewati Baitulalh, maka beliau pun thawaf di Ka'bah sebelum sholat Shubuh dan barulah beliau keluar menuju Madinah."
            },
            {
                "number": 1989,
                "arab": "حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ أُمِّ الْمُؤْمِنِينَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْمِنَّا مَنْ أَهَلَّ بِالْحَجِّ مُفْرَدًا وَمِنَّا مَنْ قَرَنَ وَمِنَّا مَنْ تَمَتَّعَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ قَالَ جَاءَتْ عَائِشَةُ حَاجَّةً",
                "id": "Telah menceritakan kepadaku [Yahya bin Ayyub] Telah menceritakan kepada kami [Abbad Al Muhallabi] Telah menceritakan kepada kami [ubaidhullah bin Umar] dari [Al Qasim bin Muhammad] dari [Ummul Mukminin] Aisyah radliallahu 'anha, ia berkata; \"Di antara kami ada yang ihram untuk haji Ifrad (mendahulukan haji dari umrah), ada yang ihram untuk haji Qiran (mengerjakan haji digabung dengan umrah sekaligus) dan ada pula yang ihram untuk haji tamattu' (mendahulukan umrah dari pada haji).\" Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [ubaidhullah bin Umar] dari [Al Qasim bin Muhammad] ia berkata; [Aisyah] datang untuk menunaikan haji."
            },
            {
                "number": 1990,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ ابْنِ عَوْنٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ أُمِّ الْمُؤْمِنِينَ ح وَعَنْ الْقَاسِمِ عَنْ أُمِّ الْمُؤْمِنِينَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ يَصْدُرُ النَّاسُ بِنُسُكَيْنِ وَأَصْدُرُ بِنُسُكٍ وَاحِدٍ قَالَ انْتَظِرِي فَإِذَا طَهَرْتِ فَاخْرُجِي إِلَى التَّنْعِيمِ فَأَهِلِّي مِنْهُ ثُمَّ الْقَيْنَا عِنْدَ كَذَا وَكَذَا قَالَ أَظُنُّهُ قَالَ غَدًا وَلَكِنَّهَا عَلَى قَدْرِ نَصَبِكِ أَوْ قَالَ نَفَقَتِكِو حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ عَنْ الْقَاسِمِ وَإِبْرَاهِيمَ قَالَ لَا أَعْرِفُ حَدِيثَ أَحَدِهِمَا مِنْ الْآخَرِ أَنَّ أُمَّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ يَا رَسُولَ اللَّهِ يَصْدُرُ النَّاسُ بِنُسُكَيْنِ فَذَكَرَ الْحَدِيثَ",
                "id": "Dan Telah meceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Ibnu Ulayyah] dari [Ibnu Aun] dari [Ibrahim] dari [Al Aswad] dari [Ummul mukminin] -dalam riwayat lain- dan dari [Al Qasim] dari [Ummul mukminin] ia berkata; Saya berkata, \"Wahai Rasulullah, orang-orang menunaikan dua nusuk sementara saya hanya satu nusuk.\" Beliau bersabda: \"Jika kamu telah suci, maka keluarlah ke Tan'im dan berihramlah (untuk umrah), kemudian temuilah kami di tempat ini dan ini -saya menduga bahwa beliau mengatakan- esok hari, tetapi hendaklah sesuai dengan bagianmu -atau beliau berkata- nafkahmu.\" Dan Telah meceritakan kepada kami [Ibnul Mutsanna] Telah menceritakan kepada kami [Ibnu Adi] dari [Ibnu Aun] dari [Al Qasim] dan [Ibrahim] ia berkata; -saya tidak dapat membedakan hadits salah satu dari keduanya daripada yang lain- bahwa [Ummul Mukminin] radliallahu 'anha berkata; \"Wahai Rasulullah, orang-orang menunaikan dua nusuk,..\" Ia pun menyebutkan hadits."
            },
            {
                "number": 1991,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ زُهَيْرٌ حَدَّثَنَا و قَالَ إِسْحَقُ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَرَى إِلَّا أَنَّهُ الْحَجُّ فَلَمَّا قَدِمْنَا مَكَّةَ تَطَوَّفْنَا بِالْبَيْتِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَمْ يَكُنْ سَاقَ الْهَدْيَ أَنْ يَحِلَّ قَالَتْ فَحَلَّ مَنْ لَمْ يَكُنْ سَاقَ الْهَدْيَ وَنِسَاؤُهُ لَمْ يَسُقْنَ الْهَدْيَ فَأَحْلَلْنَ قَالَتْ عَائِشَةُ فَحِضْتُ فَلَمْ أَطُفْ بِالْبَيْتِ فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ يَرْجِعُ النَّاسُ بِعُمْرَةٍ وَحَجَّةٍ وَأَرْجِعُ أَنَا بِحَجَّةٍ قَالَ أَوْ مَا كُنْتِ طُفْتِ لَيَالِيَ قَدِمْنَا مَكَّةَ قَالَتْ قُلْتُ لَا قَالَ فَاذْهَبِي مَعَ أَخِيكِ إِلَى التَّنْعِيمِ فَأَهِلِّي بِعُمْرَةٍ ثُمَّ مَوْعِدُكِ مَكَانَ كَذَا وَكَذَا قَالَتْ صَفِيَّةُ مَا أُرَانِي إِلَّا حَابِسَتَكُمْ قَالَ عَقْرَى حَلْقَى أَوْ مَا كُنْتِ طُفْتِ يَوْمَ النَّحْرِ قَالَتْ بَلَى قَالَ لَا بَأْسَ انْفِرِي قَالَتْ عَائِشَةُ فَلَقِيَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُصْعِدٌ مِنْ مَكَّةَ وَأَنَا مُنْهَبِطَةٌ عَلَيْهَا أَوْ أَنَا مُصْعِدَةٌ وَهُوَ مُنْهَبِطٌ مِنْهَاو قَالَ إِسْحَقُ مُتَهَبِّطَةٌ وَمُتَهَبِّطٌ و حَدَّثَنَاه سُوَيْدُ بْنُ سَعِيدٍ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُلَبِّي لَا نَذْكُرُ حَجًّا وَلَا عُمْرَةً وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ مَنْصُورٍ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] -Zuhair berkata- Telah menceritakan kepada kami -Ishaq berkata- telah mengabarkan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] radliallahu 'anha ia berkata; Kami pernah keluar bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam dan tidak maksud keculali untuk haji. Sesampainya di Makkah, kami melakukan thwaf di Baitullah, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan: \"Siapa yang membawa hadya (hewan kurban), maka ia boleh bertahallul.\" Maka orang-orang yang tidak membawa hadya pun bertahallul, isteri-isteri beliau juga tida membawa hadya, maka mereka pun bertahallul. Aisyah berkata; Tiba-tiba aku haid hingga aku tidak melakukan thawaf di Baitullah. Pada malam Hashbah saya berkata, \"Wahai Rasulullah, orang-orang pada pulang dengan (membawa pahala) umrah dan haji, sementara aku pulang hanya (membawa pahala) haji.\" Beliau bertanya: \"Apakah kamu tidak melakukan thawaf di malam hari saat kita sampai di Makkah?\" Aisyah menjawab, \"Tidak.\" Beliau bersabda: \"Berangkatlah bersama saudaramu ke Tan'im, lalu berihramlah untuk umrah dan kita akan bertemu di tempat ini dan ini.\" Shafiyah berkata, \"Saya tidak menyangka, kecuali kalian menunggu aku suci dan selesai melakukan thawaf, tetapi aku haid sehingga tidak mungkin aku thawaf.\" Beliau bersabda: \"AQRA HALQA (semoga Allah menjadikannya mandul tidak beranak) bukankah kamu telah melaukan thawaf pada hari Nahr?\" Shafiyyah menjawab, \"Ya, benar.\" Beliau bersabda: \"Tidak mengapa, berangkatlah.\" Aisyah berkata; Kemudian Rasulullah shallallahu 'alaihi wasallam pun menjumpaiku saat beliau pergi dari Makkah sementara aku datang. Ishaq berkata; Mutahabbithatun wa Mutahabbithun (berpaspasan di jalan). Dan Telah meceritakanny6a kepada kami [Suwaid bin Sa'id] dari [Ali bin Mushir] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] radliallahu 'anha, ia berkata; Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam, dan kami bertalbiyah dengan tidak menyebutkan haji dan umrah. Lalu ia pun menyebutkan hadits yang semakna dengan haditsnya Manshur. "
            },
            {
                "number": 1992,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَبِي نَضْرَةَ قَالَكَانَ ابْنُ عَبَّاسٍ يَأْمُرُ بِالْمُتْعَةِ وَكَانَ ابْنُ الزُّبَيْرِ يَنْهَى عَنْهَا قَالَ فَذَكَرْتُ ذَلِكَ لِجَابِرِ بْنِ عَبْدِ اللَّهِ فَقَالَ عَلَى يَدَيَّ دَارَ الْحَدِيثُ تَمَتَّعْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَامَ عُمَرُ قَالَ إِنَّ اللَّهَ كَانَ يُحِلُّ لِرَسُولِهِ مَا شَاءَ بِمَا شَاءَ وَإِنَّ الْقُرْآنَ قَدْ نَزَلَ مَنَازِلَهُ فَ{ أَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ }كَمَا أَمَرَكُمْ اللَّهُ وَأَبِتُّوا نِكَاحَ هَذِهِ النِّسَاءِ فَلَنْ أُوتَى بِرَجُلٍ نَكَحَ امْرَأَةً إِلَى أَجَلٍ إِلَّا رَجَمْتُهُ بِالْحِجَارَةِو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ بِهَذَا الْإِسْنَادِ وَقَالَ فِي الْحَدِيثِ فَافْصِلُوا حَجَّكُمْ مِنْ عُمْرَتِكُمْ فَإِنَّهُ أَتَمُّ لِحَجِّكُمْ وَأَتَمُّ لِعُمْرَتِكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] -[Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Qatadah] menceritakan dari [Abu Nadlrah] ia berkata; Ibnu Abbas memerintahkan untuk berhaji dengan tamattu' sedang Ibnu Zubair melarangnya. Lalu aku menyebutkan hal itu kepada [Jabir bin Abdillah], dan iapun berkata; Perbincangan ini berkisar antara aku. Dulu kami melaksanakan haji tamattu' bersama Rasulullah shallallahu 'alaihi wasallam, dan ketika Umar berdiri, ia berkata, \"Sesungguhnya Allah telah menghalalkan bagi Rasul-Nya apa yang dikehendaki-Nya, dan sesungguhnya Al Qur'an telah diturunkan maka; 'Sempurnakanlah haji dan umrah untuk Allah semata.' sebagaimana yang telah Allah perintahkan kepada kalian, dan langsungkanlah pernikahan wanita ini, sebab sekali-kali tidaklah didatangkan kepadaku seorang lelaki yang menikahi seorang wanita untuk jangka waktu tertentu (nikah mut'ah) kecuali pasti aku akan merajamnya dengan batu.\" Dan telah meceritakannya kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hammam] Telah menceritakan kepada kami [Qatadah] dengan isnad ini, dan ia menyebutkan di dalam hadits; \"Oleh sebab itu pisahkanlah haji kalian dari umrah kalian, karena yang demikian itu akan membuat haji dan umrah kalian lebih sempurna.\""
            },
            {
                "number": 1993,
                "arab": "و حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ وَأَبُو الرَّبِيعِ وَقُتَيْبَةُ جَمِيعًا عَنْ حَمَّادٍ قَالَ خَلَفٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ قَالَ سَمِعْتُ مُجَاهِدًا يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا قَالَقَدِمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَقُولُ لَبَّيْكَ بِالْحَجِّ فَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَجْعَلَهَا عُمْرَةً",
                "id": "Dan Telah meceritakan kepada kami [Khalaf bin Hisyam] dan [Abu Rabi'] dan [Qutaibah] semuanya dari [Hammad] - [Khalaf] berkata- Telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] ia berkata, saya mendengar [Mujahid] menceritakan dari [Jabir bin Abdullah] radliallahu 'anhuma, ia berkata; Kami datang bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam. Dan saat itu, kami melakukan ihram untuk haji, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menjadikannya umrah."
            },
            {
                "number": 1994,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ حَاتِمٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ الْمَدَنِيُّ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ قَالَدَخَلْنَا عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ فَسَأَلَ عَنْ الْقَوْمِ حَتَّى انْتَهَى إِلَيَّ فَقُلْتُ أَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حُسَيْنٍ فَأَهْوَى بِيَدِهِ إِلَى رَأْسِي فَنَزَعَ زِرِّي الْأَعْلَى ثُمَّ نَزَعَ زِرِّي الْأَسْفَلَ ثُمَّ وَضَعَ كَفَّهُ بَيْنَ ثَدْيَيَّ وَأَنَا يَوْمَئِذٍ غُلَامٌ شَابٌّ فَقَالَ مَرْحَبًا بِكَ يَا ابْنَ أَخِي سَلْ عَمَّا شِئْتَ فَسَأَلْتُهُ وَهُوَ أَعْمَى وَحَضَرَ وَقْتُ الصَّلَاةِ فَقَامَ فِي نِسَاجَةٍ مُلْتَحِفًا بِهَا كُلَّمَا وَضَعَهَا عَلَى مَنْكِبِهِ رَجَعَ طَرَفَاهَا إِلَيْهِ مِنْ صِغَرِهَا وَرِدَاؤُهُ إِلَى جَنْبِهِ عَلَى الْمِشْجَبِ فَصَلَّى بِنَا فَقُلْتُ أَخْبِرْنِي عَنْ حَجَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بِيَدِهِ فَعَقَدَ تِسْعًا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَثَ تِسْعَ سِنِينَ لَمْ يَحُجَّ ثُمَّ أَذَّنَ فِي النَّاسِ فِي الْعَاشِرَةِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجٌّ فَقَدِمَ الْمَدِينَةَ بَشَرٌ كَثِيرٌ كُلُّهُمْ يَلْتَمِسُ أَنْ يَأْتَمَّ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيَعْمَلَ مِثْلَ عَمَلِهِ فَخَرَجْنَا مَعَهُ حَتَّى أَتَيْنَا ذَا الْحُلَيْفَةِ فَوَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ أَصْنَعُ قَالَ اغْتَسِلِي وَاسْتَثْفِرِي بِثَوْبٍ وَأَحْرِمِي فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى إِذَا اسْتَوَتْ بِهِ نَاقَتُهُ عَلَى الْبَيْدَاءِ نَظَرْتُ إِلَى مَدِّ بَصَرِي بَيْنَ يَدَيْهِ مِنْ رَاكِبٍ وَمَاشٍ وَعَنْ يَمِينِهِ مِثْلَ ذَلِكَ وَعَنْ يَسَارِهِ مِثْلَ ذَلِكَ وَمِنْ خَلْفِهِ مِثْلَ ذَلِكَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِنَا وَعَلَيْهِ يَنْزِلُ الْقُرْآنُ وَهُوَ يَعْرِفُ تَأْوِيلَهُ وَمَا عَمِلَ بِهِ مِنْ شَيْءٍ عَمِلْنَا بِهِ فَأَهَلَّ بِالتَّوْحِيدِ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لَا شَرِيكَ لَكَ وَأَهَلَّ النَّاسُ بِهَذَا الَّذِي يُهِلُّونَ بِهِ فَلَمْ يَرُدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِمْ شَيْئًا مِنْهُ وَلَزِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَلْبِيَتَهُ قَالَ جَابِرٌ رَضِيَ اللَّهُ عَنْهُ لَسْنَا نَنْوِي إِلَّا الْحَجَّ لَسْنَا نَعْرِفُ الْعُمْرَةَ حَتَّى إِذَا أَتَيْنَا الْبَيْتَ مَعَهُ اسْتَلَمَ الرُّكْنَ فَرَمَلَ ثَلَاثًا وَمَشَى أَرْبَعًا ثُمَّ نَفَذَ إِلَى مَقَامِ إِبْرَاهِيمَ عَلَيْهِ السَّلَام فَقَرَأَ{ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى }فَجَعَلَ الْمَقَامَ بَيْنَهُ وَبَيْنَ الْبَيْتِ فَكَانَ أَبِي يَقُولُ وَلَا أَعْلَمُهُ ذَكَرَهُ إِلَّا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ قُلْ هُوَ اللَّهُ أَحَدٌ وَقُلْ يَا أَيُّهَا الْكَافِرُونَ ثُمَّ رَجَعَ إِلَى الرُّكْنِ فَاسْتَلَمَهُ ثُمَّ خَرَجَ مِنْ الْبَابِ إِلَى الصَّفَا فَلَمَّا دَنَا مِنْ الصَّفَا قَرَأَ{ إِنَّ الصَّفَا والْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ }أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ فَاسْتَقْبَلَ الْقِبْلَةَ فَوَحَّدَ اللَّهَ وَكَبَّرَهُ وَقَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ ثُمَّ دَعَا بَيْنَ ذَلِكَ قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ ثُمَّ نَزَلَ إِلَى الْمَرْوَةِ حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي بَطْنِ الْوَادِي سَعَى حَتَّى إِذَا صَعِدَتَا مَشَى حَتَّى أَتَى الْمَرْوَةَ فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا حَتَّى إِذَا كَانَ آخِرُ طَوَافِهِ عَلَى الْمَرْوَةِ فَقَالَ لَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمْ أَسُقْ الْهَدْيَ وَجَعَلْتُهَا عُمْرَةً فَمَنْ كَانَ مِنْكُمْ لَيْسَ مَعَهُ هَدْيٌ فَلْيَحِلَّ وَلْيَجْعَلْهَا عُمْرَةً فَقَامَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ فَقَالَ يَا رَسُولَ اللَّهِ أَلِعَامِنَا هَذَا أَمْ لِأَبَدٍ فَشَبَّكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابِعَهُ وَاحِدَةً فِي الْأُخْرَى وَقَالَ دَخَلَتْ الْعُمْرَةُ فِي الْحَجِّ مَرَّتَيْنِ لَا بَلْ لِأَبَدٍ أَبَدٍ وَقَدِمَ عَلِيٌّ مِنْ الْيَمَنِ بِبُدْنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَجَدَ فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا مِمَّنْ حَلَّ وَلَبِسَتْ ثِيَابًا صَبِيغًا وَاكْتَحَلَتْ فَأَنْكَرَ ذَلِكَ عَلَيْهَا فَقَالَتْ إِنَّ أَبِي أَمَرَنِي بِهَذَا قَالَ فَكَانَ عَلِيٌّ يَقُولُ بِالْعِرَاقِ فَذَهَبْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُحَرِّشًا عَلَى فَاطِمَةَ لِلَّذِي صَنَعَتْ مُسْتَفْتِيًا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا ذَكَرَتْ عَنْهُ فَأَخْبَرْتُهُ أَنِّي أَنْكَرْتُ ذَلِكَ عَلَيْهَا فَقَالَ صَدَقَتْ صَدَقَتْ مَاذَا قُلْتَ حِينَ فَرَضْتَ الْحَجَّ قَالَ قُلْتُ اللَّهُمَّ إِنِّي أُهِلُّ بِمَا أَهَلَّ بِهِ رَسُولُكَ قَالَ فَإِنَّ مَعِيَ الْهَدْيَ فَلَا تَحِلُّ قَالَ فَكَانَ جَمَاعَةُ الْهَدْيِ الَّذِي قَدِمَ بِهِ عَلِيٌّ مِنْ الْيَمَنِ وَالَّذِي أَتَى بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِائَةً قَالَ فَحَلَّ النَّاسُ كُلُّهُمْ وَقَصَّرُوا إِلَّا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ كَانَ مَعَهُ هَدْيٌ فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ تَوَجَّهُوا إِلَى مِنًى فَأَهَلُّوا بِالْحَجِّ وَرَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِهَا الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالْفَجْرَ ثُمَّ مَكَثَ قَلِيلًا حَتَّى طَلَعَتْ الشَّمْسُ وَأَمَرَ بِقُبَّةٍ مِنْ شَعَرٍ تُضْرَبُ لَهُ بِنَمِرَةَ فَسَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا تَشُكُّ قُرَيْشٌ إِلَّا أَنَّهُ وَاقِفٌ عِنْدَ الْمَشْعَرِ الْحَرَامِ كَمَا كَانَتْ قُرَيْشٌ تَصْنَعُ فِي الْجَاهِلِيَّةِ فَأَجَازَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَى عَرَفَةَ فَوَجَدَ الْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ فَنَزَلَ بِهَا حَتَّى إِذَا زَاغَتْ الشَّمْسُ أَمَرَ بِالْقَصْوَاءِ فَرُحِلَتْ لَهُ فَأَتَى بَطْنَ الْوَادِي فَخَطَبَ النَّاسَ وَقَالَ إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ حَرَامٌ عَلَيْكُمْ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلَا كُلُّ شَيْءٍ مِنْ أَمْرِ الْجَاهِلِيَّةِ تَحْتَ قَدَمَيَّ مَوْضُوعٌ وَدِمَاءُ الْجَاهِلِيَّةِ مَوْضُوعَةٌ وَإِنَّ أَوَّلَ دَمٍ أَضَعُ مِنْ دِمَائِنَا دَمُ ابْنِ رَبِيعَةَ بْنِ الْحَارِثِ كَانَ مُسْتَرْضِعًا فِي بَنِي سَعْدٍ فَقَتَلَتْهُ هُذَيْلٌ وَرِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ رِبًا أَضَعُ رِبَانَا رِبَا عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ فَإِنَّهُ مَوْضُوعٌ كُلُّهُ فَاتَّقُوا اللَّهَ فِي النِّسَاءِ فَإِنَّكُمْ أَخَذْتُمُوهُنَّ بِأَمَانِ اللَّهِ وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ وَلَكُمْ عَلَيْهِنَّ أَنْ لَا يُوطِئْنَ فُرُشَكُمْ أَحَدًا تَكْرَهُونَهُ فَإِنْ فَعَلْنَ ذَلِكَ فَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ وَلَهُنَّ عَلَيْكُمْ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ وَقَدْ تَرَكْتُ فِيكُمْ مَا لَنْ تَضِلُّوا بَعْدَهُ إِنْ اعْتَصَمْتُمْ بِهِ كِتَابُ اللَّهِ وَأَنْتُمْ تُسْأَلُونَ عَنِّي فَمَا أَنْتُمْ قَائِلُونَ قَالُوا نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَأَدَّيْتَ وَنَصَحْتَ فَقَالَ بِإِصْبَعِهِ السَّبَّابَةِ يَرْفَعُهَا إِلَى السَّمَاءِ وَيَنْكُتُهَا إِلَى النَّاسِ اللَّهُمَّ اشْهَدْ اللَّهُمَّ اشْهَدْ ثَلَاثَ مَرَّاتٍ ثُمَّ أَذَّنَ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا ثُمَّ رَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَى الْمَوْقِفَ فَجَعَلَ بَطْنَ نَاقَتِهِ الْقَصْوَاءِ إِلَى الصَّخَرَاتِ وَجَعَلَ حَبْلَ الْمُشَاةِ بَيْنَ يَدَيْهِ وَاسْتَقْبَلَ الْقِبْلَةَ فَلَمْ يَزَلْ وَاقِفًا حَتَّى غَرَبَتْ الشَّمْسُ وَذَهَبَتْ الصُّفْرَةُ قَلِيلًا حَتَّى غَابَ الْقُرْصُ وَأَرْدَفَ أُسَامَةَ خَلْفَهُ وَدَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ شَنَقَ لِلْقَصْوَاءِ الزِّمَامَ حَتَّى إِنَّ رَأْسَهَا لَيُصِيبُ مَوْرِكَ رَحْلِهِ وَيَقُولُ بِيَدِهِ الْيُمْنَى أَيُّهَا النَّاسُ السَّكِينَةَ السَّكِينَةَ كُلَّمَا أَتَى حَبْلًا مِنْ الْحِبَالِ أَرْخَى لَهَا قَلِيلًا حَتَّى تَصْعَدَ حَتَّى أَتَى الْمُزْدَلِفَةَ فَصَلَّى بِهَا الْمَغْرِبَ وَالْعِشَاءَ بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ وَلَمْ يُسَبِّحْ بَيْنَهُمَا شَيْئًا ثُمَّ اضْطَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى طَلَعَ الْفَجْرُ وَصَلَّى الْفَجْرَ حِينَ تَبَيَّنَ لَهُ الصُّبْحُ بِأَذَانٍ وَإِقَامَةٍ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَاسْتَقْبَلَ الْقِبْلَةَ فَدَعَاهُ وَكَبَّرَهُ وَهَلَّلَهُ وَوَحَّدَهُ فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا فَدَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ وَأَرْدَفَ الْفَضْلَ بْنَ عَبَّاسٍ وَكَانَ رَجُلًا حَسَنَ الشَّعْرِ أَبْيَضَ وَسِيمًا فَلَمَّا دَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ishaq bin Ibrahim] semuanya dari [Hatim] ia berkata, - [Abu Bakr] berkata- Telah menceritakan kepada kami [Hatim bin Isma'il Al Madani] dari [Ja'far bin Muhammad] dari [bapaknya] ia berkata; Kami datang ke rumah [Jabir bin Abdullah], lalu ia menanyai kami satu persatu, siapa nama kami masing-masing. Sampai giliranku, kusebutkan namaku Muhammad bin Ali bin Husain. Lalu dibukanya kancing bajuku yang atas dan yang bawah. Kemudian diletakkannya telapak tangannya antara kedua susuku. Ketika itu, aku masih muda belia. Lalu dia berkata, \"Selamat datang wahai anak saudaraku, tanyakanlah apa yang hendak kamu tanyakan.\" Maka aku pun bertanya kepadanya. Dia telah buta. Ketika waktu sholat tiba, dia berdiri di atas sehelai sajadah yang selalu dibawanya. Tiap kali sajadah itu diletakkannya ke bahunya, pinggirnya selalu lekat padanya karena kecilnya sajadah itu. Aku bertanya kepadanya, \"Terangkanlah kepadaku bagaimana Rasulullah shallallahu 'alaihi wasallam melakukan ibadah haji.\" Lalu ia bicara dengan isyarat tangannya sambil memegang sembilan anak jarinya. Katanya; Sembilan tahun lamanya beliau menetap di Madinah, namun beliau belum haji. Kemudian beliau memberitahukan bahwa tahun kesepuluh beliau akan naik haji. Karena itu, berbondong-bondonglah orang datang ke Madinah, hendak ikut bersama-sama Rasulullah shallallahu 'alaihi wasallam untuk beramal seperti amalan beliau. Lalu kami berangkat bersama-sama dengan beliau. Ketika sampai di Dzulhulaifah, Asma` binti Humais melahirkan puteranya, Muhammad bin Abu Bakar. Dia menyuruh untuk menanyakan kepada Rasulullah shallallahu 'alaihi wasallam apa yang harus dilakukannya (karena melahirkan itu). Maka beliau pun bersabda: \"Mandi dan pakai kain pembalutmu. Kemudian pakai pakaian ihrammu kembali.\" Rasulullah shallallahu 'alaihi wasallam sholat dua raka'at di masjid Dzulhulaifah, kemudian beliau naiki untanya yang bernama Qashwa. Setelah sampai di Baida`, kulihat sekelilingku, alangkah banyaknya orang yang mengiringi beliau, yang berkendaraan dan yang berjalan kaki, di kanan-kiri dan di belakang beliau. Ketika itu turun Al Qur`an (wahyu), dimana Rasulullah shallallahu 'alaihi wasallam mengerti maksudnya, yaitu sebagaimana petunjuk amal yang harus kami amalkan. Lalu beliau teriakan bacaan talbiyah: \"LABBAIKA ALLAHUMMA LABBAIKA LABBAIKA LAA SYARIIKA LAKA LABBAIKA INNALHAMDA WAN NI'MATA LAKA WALMULKU LAA SYARIIKA LAKA (Aku patuhi perintah-Mu ya Allah, aku patuhi, aku patuhi. Tiada sekutu bagi-Mu, aku patuhi perintah-Mu; sesungguhnya puji dan nikmat adalah milik-Mu, begitu pula kerajaan, tiada sekutu bagi-Mu, aku patuhi perintah-Mu).\" Maka talbiyah pula orang banyak seperti talbiyah Nabi shallallahu 'alaihi wasallam itu. Rasulullah shallallahu 'alaihi wasallam tidak melarang mereka membacanya, bahkan senantiasa membaca terus-menerus. Niat kami hanya untuk mengerjakan haji, dan kami belum mengenal umrah. Setelah sampai di Baitullah, beliau cium salah satu sudutnya (hajar Aswad), kemudian beliau thawaf, lari-lari kecil tiga kali dan berjalan biasa empat kali. Kemudian beliau terus menuju ke Maqam. Ibrahim 'Alais Salam, lalu beliau baca ayat: \"Jadikanlah maqam Ibrahim sebagai tempat sholat...\" (Al Baqarah: 125). Lalu ditempatkannya maqam itu diantaranya dengan Baitullah. Sementara itu ayahku berkata bahwa Nabi shallallahu 'alaihi wasallam membaca dalam sholatnya: \"QUL HUWALLAHU AHADL…\" (Al Ikhlas: 1-4). Dan: \"QUL YAA AYYUHAL KAAFIRUUN..\" (Al Kafirun: 1-6). Kemudian beliau kembali ke sudut Bait (hajar Aswad) lalu diciumnya pula. Kemudian melalui pintu, beliau pergi ke Shafa. Setelah dekat ke bukit Shafa beliau membaca ayat: \"Sesungguhnya Sa'i antara Shafa dan Marwah termasuk lambang-lambang kebesaran Agama Allah...\" (Al Baqarah: 1589). Kemudian mulailah dia melaksanakan perintah Allah. Maka dinaikinya bukit shafa. Setelah kelihatan Baitullah, lalu beliau menghadap ke kiblat seraya mentauhidkan Allah dan mengagungkan-Nya. Dan beliau membaca: \"LAA ILAAHA ILAALLAH WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI`IN QADIIR LAA ILAAHA ILLALLAH WAHDAHU ANJAZA WA'DAHU WANASHARA 'ABDAHU WAHAZAMAL AHZABA WAHDAH (Tiada Tuhan yang berhak disembah selain Allah satu-satu-Nya, tiada sekutu bagi-Nya, milik-Nyalah kerajaan dan segala puji, sedangkan Dia Maha Kuasa atas segala-galanya. Tiada Tuhan yang berhak disembah selain Allah satu-satu-Nya, Yang Maha Menepati janji-Nya dan menolong hamba-hamaba-Nya dan menghancurkan musuh-musuh-Nya sendiri-Nya).\" Kemudian beliau berdo'a. Ucapakan tahlil itu diulanginya sampai tiga kali. Kemudian beliau turun di Marwa. Ketika sampai di lembah, beliau berlari-lari kecil. Dan sesudah itu, beliau menuju bukit Marwa sambil berjalan kembali. setelah sampai di bukit Marwa, beliau berbuat apa yang diperbuatnya di bukit Shafa. Tatkala beliau mengakhiri sa'i-nya di bukit Marwa, beliau berujar: \"Kalau aku belum lakukan apa yang telah kuperbuat, niscaya aku tidak membawa hadya dan menjadikannya umrah.\" Lalu Suraqah bin Malik bin Ju'tsyum, \"Ya, Rasulullah! Apakah untuk tahun ini saja ataukah untuk selama-lamanya?\" Rasulullah shallallahu 'alaihi wasallam memperpanjangkan jari-jari tangannya yang lain seraya bersabda: \"Memasukkan umrah ke dalam haji. Memasukkan umrah ke dalam haji, tidak! Bahkan untuk selama-lamanya.\" Sementara itu Ali datang dari Yaman membawa hewan kurban Nabi shallallahu 'alaihi wasallam. didapatinya Fathimah termasuk orang yang tahallul; dia mengenakan pakaian bercelup dan bercelak mata. Ali melarangnya berbuat demikian. Fathimah menjawab, \"Ayahku sendiri yang menyuruhku berbuat begini.\" Ali berkata; Maka aku pergi menemui Rasulullah shallallahu 'alaihi wasallam untuk meminta fatwa terhadap perbuatan Fathimah tersebut. Kujelaskan kepada beliau bahwa aku mencegahnya berbuat demikian. Beliau pun bersabda: \"Fathimah benar.\" Kemudian beliau bertanya: \"Apa yang kamu baca ketika hendak menunaikan haji?\" Ali berkata; Aku menjawab: \"Ya Allah, aku aku niat menunaikan ibadah haji seperti yang dicontohkan oleh Rasul Engkau.\" Kemudian Ali bertanya, \"Tetapi aku membawa hwankurban, bagaimana itu?\" Beliau menjawab: \"Kamu jangan tahallul.\" Ja'far berkata; Jumlah hadya yang dibawa Ali dari Yaman dan yang dibawa Nabi shallallahu 'alaihi wasallam ada seratus ekor. Para jama'ah telah tahallul dan bercukur semuanya, melainkan Nabi shallallahu 'alaihi wasallam dan orang-orang yang membawa hadya beserta beliau. Ketika hari Tarwiyah (delapan Dzulhijjah) tiba, mereka berangkat menuju Mina untuk melakukan ibadah haji. Rasulullah shallallahu 'alaihi wasallam menunggang kendaraannya. Di sana beliau sholat Zhuhur, 'Ashar, Maghrib, Isya dan Shubuh. Kemudian beliau menanti sebentar hingga terbit matahari; sementara itu beliau menyuruh orang lebih dahulu ke Namirah untuk mendirikan kemah di sana. Sedangkan Orang Quraisy mengira bahwa beliau tentu akan berhenti di Masy'aril Haram (sebuah bukit di Muzdalifah) sebagaimana biasanya orang-orang jahililiyah. Tetapi ternyata beliau terus saja menuju Arafah. Sampai ke Namirah, didapatinya tenda-tenda telah didirikan orang. Lalu beliau berhenti untuk istirahat di situ. Ketika matahari telah condong, beliau menaiki untanya meneruskan. Sampai di tengah-tengah lebah beliau berpidato: \"Sesungguhnya menumpahkan darah, merampas harta sesamamu adalah haram sebagaimana haramnya berperang pada hari ini, pada bulan ini, dan di negeri ini. Ketahuilah, semua yang berbau Jahiliyah telah dihapuskan di bawah undang-undangku, termasuk tebusan darah masa jahilijyah. Tebusan darah yang pertama-tama kuhapuskan adalah darah Ibnu Rabi'ah bin Harits yang disusukan oleh Bani Sa'ad, lalu ia dibunuh oleh Huzail. Begitu pula telah kuhapuskan riba jahiliyah; yang mula-mula kuhapuskan ialah riba yang ditetapkan Abbas bin Abdul Muthalib. Sesungguhnya riba itu kuhapuskan semuanya. Kemudian jangalah dirimu terhadap wanita. Kamu boleh mengambil mereka sebagai amanah Allah, dan mereka halal bagimu dengan mematuhi peraturan-peraturan Allah. Setelah itu, kamu punya hak atas mereka, yaitu supaya mereka tidak membolehkan orang lain menduduki tikarmu. Jika mereka melanggar, pukullah mereka dengan cara yang tidak membahayakan. Sebaliknya mereka punya hak atasmu. Yaitu nafkah dan pakaian yang pantas. Kuwariskan kepadamu sekalian suatu pedoman hidup, yang jika kalian berpegang teguh kepadanya yaitu Al Qur`an. Kalian semua akan ditanya mengenai diriku, lalu bagaimana nanti jawab kalian?\" mereka menjawab: \"Kami bersaksi bahwa Anda benar-benar telah menyampaikan risalah, Anda telah menunaikan tugas dan telah memberi nasehat kepada kami.\" Kemudian beliau bersabda sambil mengangkat jari telunjuknya ke atas langit dan menunjuk kepada orang banyak: \"Ya, Allah saksikanlah, Ya Allah saksikanlah, ya Allah saksikanlah.\" Sesudah itu, beliau adzan kemudian qamat, lalu sholat Zhuhur. Lalu qamat lagi dan sholat Ashar tanpa sholat sunnah antara keduanya. Setelah itu, beliau meneruskan perjalanan menuju tempat wukuf. Sampai di sana, dihentikannya unta Qashwa di tempat berbatu-batu dan orang-orang yang berjalan kaki berada di hadapannya. Beliau menghadap ke kiblat, dan senantiasa wukuf sampai matahari terbenam dan mega merah hilang. Kemudian beliau teruskan pula perjalanan dengan membonceng Usamah di belakangnya, sedang beliau sendiri memegang kendali. Beliau tarik tali kekang Unta Qashwa, hingga kepalanya hampir menyentuh bantal pelana. Beliau bersabda dengan isyarat tangannya: \"Saudara-saudara, tenanglah, tenanglah.\" Setiap beliau sampai di bukit, beliau dikendorkannya tali unta sedikit, untuk memudahkannya mendaki. Sampai di Muzdalifah beliau sholat Maghrib dan Isya`dengan satu kali adzan dan dua qamat tanpa sholat sunnah antara keduanya. Kemudian beliau tidur hingga terbit fajar. Setelah tiba waktu Shubuh, beliau sholat Shubuh dengan satu Adzan dan satu qamat. Kemudian beliau tunggangi pula unta Qaswa meneruskan perjalanan sampai ke Masy'aril Haram. Sampai di sana beliau menghadap ke kiblat, berdo'a, takbir, tahlil dan membaca kaliamat tauhid. Beliau wukuf di sana hingga langit kekuning-kuningan dan berangkat sebelum matahari terbit sambil membonceng Fadlal bin Abbas. Fadlal adalah seorang laki-laki berambut indah dan berwajah putih. Ketika beliau berangkat, berangkat pulalah orang-orang besertanya. Fadlal menengok pada mereka, lalu mukanya ditutup oleh Rasulullah shallallahu 'alaihi wasallam dengan tangannya. Tetapi Fadlal menoleh ke arah lain untuk melihat. Rasulullah shallallahu 'alaihi wasallam menutup pula mukanya dengan tangan lain, sehingga Fadlala mengarahkan pandangannya ke tempat lain. Sampai di tengah lembah Muhassir, dipercepatnya untanya melalui jalan tengah yang langsung menembus ke Jumratul Kubra. Sampai di Jumrah yang dekat dengan sebatang pohon, beliau melempar dengan tujuh buah batu kerikil sambil membaca takbir pada setiap lemparan. Kemudian beliau terus ke tempat penyembelihan kurban. Di sana beliau menyembelih enam puluh tiga hewan kurban dengan tangannya dan sisanya diserahkannya kepada Ali untuk menyembelihnya, yaitu hewan kurban bersama-sama dengan anggota jama'ah yang lain. Kemudian beliau suruh ambil dari setiap hewan kurban itu sepotong kecil, lalu disuruhnya masak dan kemudian beliau makan dagingnya serta beliau minum kuahnya. Sesudah itu, beliau naiki kendaraan beliau menuju ke Baitullah untuk tawaf. Beliau sholat Zhuhur di Makkah. Sesudah itu, beliau datangi Bani Abdul Muthalib yang sedang menimba sumur zamzam. Beliau bersabda kepada mereka: \"Wahai Bani Abdul Muthalib, berilah kami minum. Kalaulah orang banyak tidak akan salah tangkap, tentu akan kutolong kamu menimba bersama-sama.\" Lalu mereka timbakan seember, dan beliau pun minum daripadanya. Dan Telah meceritakan kepada kami [Umar bin Hafsh bin Ghiyats] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Ja'far bin Muhammad] telah menceritakan kepadaku [bapakku] ia berkata; Saya mendatangi [Jabir bin Abdullah] dan bertanya kepadanya tentang haji Rasulullah shallallahu 'alaihi wasallam. lalu ia pun menyebutkan hadits yang serupa dengan haditsnya Hatim bin Isma'il, dan ia menambahkan di dalamnya; Dulu orang-orang disuruh oleh Abu Sayyarah untuk menaiki Himar telanjang. Dan ketika Rasulullah shallallahu 'alaihi wasallam melewati Muzdalifah di Masy'aril Haram, orang-orang Quraisy tidak ragu sedikit pun bahwa beliau akan berhenti di situ dan akan menjadi tempat persinggahannya nanti. Namun beliau melewatinya dan tidak singgah hingga beliau sampai di Arafah dan singgah di sana."
            },
            {
                "number": 1995,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي عَنْ جَعْفَرٍ حَدَّثَنِي أَبِي عَنْ جَابِرٍ فِي حَدِيثِهِ ذَلِكَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَحَرْتُ هَاهُنَا وَمِنًى كُلُّهَا مَنْحَرٌ فَانْحَرُوا فِي رِحَالِكُمْ وَوَقَفْتُ هَاهُنَا وَعَرَفَةُ كُلُّهَا مَوْقِفٌ وَوَقَفْتُ هَاهُنَا وَجَمْعٌ كُلُّهَا مَوْقِفٌ",
                "id": "Telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyats] Telah menceritakan kepada kami [bapakku] dari [Ja'far] telah menceritakan kepadaku [bapakku] dari [Jabir] ia menceritakan dalam haditsnya; Bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku menyembelih hewan kurban di sini, dan Mina seluruhnya adalah tempat menyembelih. Karena itu, sembelihlah kurbanmu di tempat kendaraanmu berhenti. Dan wukuf di Arafah, maka Arafah seluruhnya adalah tempat wukuf. Dan aku wukuf pula di Muzdalifah, maka Muzdalifah seluruhnya adalah tempat wukuf.\""
            },
            {
                "number": 1996,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا سُفْيَانُ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ مَكَّةَ أَتَى الْحَجَرَ فَاسْتَلَمَهُ ثُمَّ مَشَى عَلَى يَمِينِهِ فَرَمَلَ ثَلَاثًا وَمَشَى أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Yahya bin Adam] Telah menceritakan kepada kami [Sufyan] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin Abdullah] radliallahu 'anhuma, bahwa ketika Rasulullah shallallahu 'alaihi wasallam sampai di Makkah, beliau mendatangi hajar Aswad dan menciumnya, kemudian beliau berjalan ke sebelah kanannya. Beliau berlari-lari kecil tiga kali, dan berjalan biasa empat kali.\""
            },
            {
                "number": 1997,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ قُرَيْشٌ وَمَنْ دَانَ دِينَهَا يَقِفُونَ بِالْمُزْدَلِفَةِ وَكَانُوا يُسَمَّوْنَ الْحُمْسَ وَكَانَ سَائِرُ الْعَرَبِ يَقِفُونَ بِعَرَفَةَ فَلَمَّا جَاءَ الْإِسْلَامُ أَمَرَ اللَّهُ عَزَّ وَجَلَّ نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْتِيَ عَرَفَاتٍ فَيَقِفَ بِهَا ثُمَّ يُفِيضَ مِنْهَا فَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ{ ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ }",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] radliallahu 'anha, ia berkata; Kaum quraisy dan orang-orang mengikuti ajarannya, mereka melakukan wuquf di Muzdalifah, dan mereka menamakannya Al Hums. Adapun seluruh kabilah Arab, mereka semua melakukan wuquf di Arafah, dan ketika agama Islam datang, Allah 'azza wajalla menyuruh NabiNya untuk mendatangi arafah dan melakukan wuquf padanya, lalu keluar darinya dengan segera. Dan itulah yang ditunjukkan firman 'azza wajalla; \"Kemudian bertolaklah kamu dari tempat bertolaknya orang-orang banyak ('Arafah) …\"."
            },
            {
                "number": 1998,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ قَالَكَانَتْ الْعَرَبُ تَطُوفُ بِالْبَيْتِ عُرَاةً إِلَّا الْحُمْسَ وَالْحُمْسُ قُرَيْشٌ وَمَا وَلَدَتْ كَانُوا يَطُوفُونَ عُرَاةً إِلَّا أَنْ تُعْطِيَهُمْ الْحُمْسُ ثِيَابًا فَيُعْطِي الرِّجَالُ الرِّجَالَ وَالنِّسَاءُ النِّسَاءَ وَكَانَتْ الْحُمْسُ لَا يَخْرُجُونَ مِنْ الْمُزْدَلِفَةِ وَكَانَ النَّاسُ كُلُّهُمْ يَبْلُغُونَ عَرَفَاتٍ قَالَ هِشَامٌ فَحَدَّثَنِي أَبِي عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ الْحُمْسُ هُمْ الَّذِينَ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِيهِمْ{ ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ }قَالَتْ كَانَ النَّاسُ يُفِيضُونَ مِنْ عَرَفَاتٍ وَكَانَ الْحُمْسُ يُفِيضُونَ مِنْ الْمُزْدَلِفَةِ يَقُولُونَ لَا نُفِيضُ إِلَّا مِنْ الْحَرَمِ فَلَمَّا نَزَلَتْ{ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ }رَجَعُوا إِلَى عَرَفَاتٍ",
                "id": "Dan Telah meceritakan kepada kami [Abu Kuraib] Telah menceritakan kepada kami [Abu Usamah] Telah menceritakan kepada kami [Hisyam] dari [bapaknya] ia berkata; Orang-orang Arab zaman dahulu thawaf di Baitullah dalam keadaan telanjang bulat, kecuali Al Hums. Al Hums ialah orang-orang Quraisy dan turunannya. Orang-orang Arab itu thawaf dalam keadaan telanjang, kecuali apabila mereka diberi pakaian oleh orang Quraisy, yang laki-laki memberi pakaian kepada yang laki-laki dan perempuan kepada perempuan. Orang-orang Quraisy tidak berangkat dari Muzdalifah, tetapi orang banyak semuanya pergi ke 'Arafah. Hisyam berkata; telah menceritakan kepadaku bapakku, dari [Aisyah] radliallahu 'anha, ia berkata; Al Hums adalah orang-orang Quraisy yang menyebabkan Allah menurunkan ayat pada mereka, \"Kemudian berangkatlah kamu dari tempat berangkatnya orang banyak...\" (Al Baqarah: 199). Aisyah berkata; Orang banyak berangkat dari Arafah, sedangkan mereka (Al Hums) berangkat dari Muzdalifah. Kata mereka, \"Kami tidak akan berangkat melainkan dari tanah haram.\" Maka ketika ayat di atas turun, mereka sama-sama pergi ke Arafah."
            },
            {
                "number": 1999,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو سَمِعَ مُحَمَّدَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍ يُحَدِّثُ عَنْ أَبِيهِ جُبَيْرِ بْنِ مُطْعِمٍ قَالَأَضْلَلْتُ بَعِيرًا لِي فَذَهَبْتُ أَطْلُبُهُ يَوْمَ عَرَفَةَ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا مَعَ النَّاسِ بِعَرَفَةَ فَقُلْتُ وَاللَّهِ إِنَّ هَذَا لَمِنْ الْحُمْسِ فَمَا شَأْنُهُ هَاهُنَا وَكَانَتْ قُرَيْشٌ تُعَدُّ مِنْ الْحُمْسِ",
                "id": "Dan Telah meceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Amru An Naqid] semuanya dari [Ibnu Uyainah] - [Amru] berkata- Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru] ia mendengar [Muhammad bin Jubair bin Muth'im] menceritakan dari [bapaknya] Jubair bin Muth'im, ia berkata; Unta milikku hilang, maka aku pun pergi untuk mencarinya pada hari Arafah. Kemudian aku melihat Rasulullah shallallahu 'alaihi wasallam sedang wukuf di Arafah bersama orang-orang, maka saya pun berkata, \"Demi Allah, mereka ini benar-benar dari kalangan Al Hums. Kenapa mereka ada di sini, padahal orang-orang Quraisy termasuk golongan Al Hums.\""
            },
            {
                "number": 2000,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ أَخْبَرَنَا شُعْبَةُ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ عَنْ أَبِي مُوسَى قَالَقَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُنِيخٌ بِالْبَطْحَاءِ فَقَالَ لِي أَحَجَجْتَ فَقُلْتُ نَعَمْ فَقَالَ بِمَ أَهْلَلْتَ قَالَ قُلْتُ لَبَّيْكَ بِإِهْلَالٍ كَإِهْلَالِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَدْ أَحْسَنْتَ طُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَأَحِلَّ قَالَ فَطُفْتُ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ أَتَيْتُ امْرَأَةً مِنْ بَنِي قَيْسٍ فَفَلَتْ رَأْسِي ثُمَّ أَهْلَلْتُ بِالْحَجِّ قَالَ فَكُنْتُ أُفْتِي بِهِ النَّاسَ حَتَّى كَانَ فِي خِلَافَةِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَهُ رَجُلٌ يَا أَبَا مُوسَى أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ رُوَيْدَكَ بَعْضَ فُتْيَاكَ فَإِنَّكَ لَا تَدْرِي مَا أَحْدَثَ أَمِيرُ الْمُؤْمِنِينَ فِي النُّسُكِ بَعْدَكَ فَقَالَ يَا أَيُّهَا النَّاسُ مَنْ كُنَّا أَفْتَيْنَاهُ فُتْيَا فَلْيَتَّئِدْ فَإِنَّ أَمِيرَ الْمُؤْمِنِينَ قَادِمٌ عَلَيْكُمْ فَبِهِ فَأْتَمُّوا قَالَ فَقَدِمَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ إِنْ نَأْخُذْ بِكِتَابِ اللَّهِ فَإِنَّ كِتَابَ اللَّهِ يَأْمُرُ بِالتَّمَامِ وَإِنْ نَأْخُذْ بِسُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَحِلَّ حَتَّى بَلَغَ الْهَدْيُ مَحِلَّهُو حَدَّثَنَاه عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ فِي هَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Muhammad bin Ja'far] telah mengabarkan kepada kami [Syu'bah] dari [Qais bin Muslim] dari [Thariq bin Syihab] dari [Abu Musa] ia berkata; Saya datang kepada Rasulullah shallallahu 'alaihi wasallam yang pada saat itu beliau berada di Bathha`. Maka beliau pun bertanya kepadaku: \"Apakah kamu telah menunaikan haji?\" saya menjawab, \"Ya.\" Beliau bertanya lagi: \"Dengan bacaan apa kamu berihlal (memulai ihram)?\" saya menjawab, \"LABBAIKA (Ya Allah, aku penuhi panggilan-Mu) yakni sebagaimana Ihlal Nabi shallallahu 'alaihi wasallam.\" beliau bersabda: \"Bagus, kalau begitu, lakukanlah thawaf di Baitullah, dan antara Shafa dan Marwa, kemudian kamu bertahallul.\" Abu Musa berkata; \"Maka aku pun melakukan thawaf di Baitullah, dan Sa'i antara Shafa dan Marwa. Kemudian aku mendatangi seorang wanita dari Bani Qais, lalu dia mengeramasi rambutku. Setelah itu, aku berihlal (memulai ihram) untuk haji. Dan aku senantiasa berfatwa (menjawab pertanyaan) kepada orang-orang dengan apa yang Rasulullah shallallahu 'alaihi wasallam perintahkan kepadaku, sampai pada masa kekhilafahan Umar radliallahu 'anhu.\" Kemudian seorang laki-laki berkata kepadanya, \"Wahai Abu Musa, janganlah kamu terburu-buru dengan fatwamu, karena kamu tidak tahu kebijakan apa yang akan diambil oleh Amirul mukminin terkait Nusuk setelahmu.\" Maka Abu Musa pun berkata, \"Wahai sekaliana manusia, siapa yang telah kami beri fatwa, hendaklah dia tangguhkan karena amirul mukminin datang untuk melaksanakan haji, maka sempurnakanlah haji kalian bersamanya.\" Lalu Umar radliallahu 'anhu datang, dan aku menuturkan hal itu padanya. Ia pun berkata, \"Ya, kalau mengambil dari kitabullah, maka Kitabullah telah memerintahkan unutuk menyempurnakan haji. Dan jika kita mengambil dari sunnah Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam tidak tahallul hingga hadya (hewan kurban) sampai pada tempatnya.\" Dan Telah meceritakannya kepada kami [ubaidhullah bin Mu'adz] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Syu'bah] dalam isnad ini, semisalnya."
            },
            {
                "number": 2001,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ قَيْسٍ عَنْ طَارِقِ بْنِ شِهَابٍ عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَقَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُنِيخٌ بِالْبَطْحَاءِ فَقَالَ بِمَ أَهْلَلْتَ قَالَ قُلْتُ أَهْلَلْتُ بِإِهْلَالِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَلْ سُقْتَ مِنْ هَدْيٍ قُلْتُ لَا قَالَ فَطُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ حِلَّ فَطُفْتُ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ أَتَيْتُ امْرَأَةً مِنْ قَوْمِي فَمَشَطَتْنِي وَغَسَلَتْ رَأْسِي فَكُنْتُ أُفْتِي النَّاسَ بِذَلِكَ فِي إِمَارَةِ أَبِي بَكْرٍ وَإِمَارَةِ عُمَرَ فَإِنِّي لَقَائِمٌ بِالْمَوْسِمِ إِذْ جَاءَنِي رَجُلٌ فَقَالَ إِنَّكَ لَا تَدْرِي مَا أَحْدَثَ أَمِيرُ الْمُؤْمِنِينَ فِي شَأْنِ النُّسُكِ فَقُلْتُ أَيُّهَا النَّاسُ مَنْ كُنَّا أَفْتَيْنَاهُ بِشَيْءٍ فَلْيَتَّئِدْ فَهَذَا أَمِيرُ الْمُؤْمِنِينَ قَادِمٌ عَلَيْكُمْ فَبِهِ فَأْتَمُّوا فَلَمَّا قَدِمَ قُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا هَذَا الَّذِي أَحْدَثْتَ فِي شَأْنِ النُّسُكِ قَالَ إِنْ نَأْخُذْ بِكِتَابِ اللَّهِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ{ وَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ }وَإِنْ نَأْخُذْ بِسُنَّةِ نَبِيِّنَا عَلَيْهِ الصَّلَاةُ وَالسَّلَام فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَحِلَّ حَتَّى نَحَرَ الْهَدْيَو حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عُمَيْسٍ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَنِي إِلَى الْيَمَنِ قَالَ فَوَافَقْتُهُ فِي الْعَامِ الَّذِي حَجَّ فِيهِ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا مُوسَى كَيْفَ قُلْتَ حِينَ أَحْرَمْتَ قَالَ قُلْتُ لَبَّيْكَ إِهْلَالًا كَإِهْلَالِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَلْ سُقْتَ هَدْيًا فَقُلْتُ لَا قَالَ فَانْطَلِقْ فَطُفْ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ أَحِلَّ ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ شُعْبَةَ وَسُفْيَانَ",
                "id": "Dan Telah meceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Sufyan] dari [Qais] dari [Thariq bin Syihab] dari [Abu Musa] radliallahu 'anhu, ia berkata; Aku mendatangi Rasulullah shallallahu 'alaihi wasallam saat beliau menambatkan kendaraannya di Bathha`. Beliau bertanya kepadaku: \"Dengan bacaan apa kamu melakukan Ihlal (bacaan niat untuk ihram).\" Saya menjawab, \"Dengan Ihlal sebagaimana Ihlal-nya Nabi shallallahu 'alaihi wasallam.\" beliau bertanya lagi: \"Apakah kamu membawa Hadyu (hewan kurban)?\" saya menjawab, \"Tidak.\" Beliau bersabda: \"Kalau begitu, lakukanlah thawaf di Baitullah, dan sa'i antara Shafa dan Marwa kemudian kamu bertahallul.\" Maka aku pun melakukan thawaf di Baitullah dan Sa'i antara Shafa dan Marwah. Setelah itu, aku mendatangi seorang wanita dari kaummu, lalu wanita itu mengeramasi dan menyisir rambutku. Akhirnya aku menyampaikan hal itu kepada manusia pada masa pemerintahan Abu Bakar dan Umar radliallahu 'anhuma. Saat aku berdiri di pasar Al Mausim, tiba-tiba seorang laki-laki datang dan berkata, \"Sesungguhnya Anda tidak tahu kebijakan apa yang akan diberikan Amirul mukminin mengenai tatara cara Manasik Haji.\" Maka aku pun berkata, \"Wahai sekalian manusia, barangsiapa yang telah melaksanakan dari apa yang telah aku fatwakan, maka hendaklah dia tangguhkan karena amirul mukminin akan segera datang, karena itu sempurnakanlah haji kalian bersamanya.\" Ketika Umar datang aku bertanya padanya, \"Wahai Amirul Mukminin, kebijakan apa yang telah Anda ambil terkait dengan tata cara Nusuk?\" Umar menjawab, \"Jika kita mengambil (hukum) dari Kitabullah, maka Allah telah berfirman: 'Sempurnakanlah haji dan umrah untuk Allah...' Namun, bila kita mengambil dari sunnah Nabi kita shallallahu 'alaihi wasallam, maka beliau tidaklah bertahallul hingga beliau menyembelih hadyu.\" Dan telah meceritakan kepadaku [Ishaq bin Manshur] dan [Abdu bin Humaid] keduanya berkata, telah mengabarkan kepada kami [Ja'far bin Aun] telah mengabarkan kepada kami [Abu Umais] dari [Qais bin Muslim] dari [Thariq bin Syihab] dari [Abu Musa] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutusku ke negeri Yaman, dan waktu itu bertepatan dengan musim haji. Maka Rasulullah shallallahu 'alaihi wasallam bertanya kepadaku: \"Wahai Abu Musa, apa yang kamu baca ketika kamu memulai ihram?\" saya menjawab, \"LABBAIKA IHLAALAN KAIHLAALIN NABI SHALLALLAHU 'ALAIHI WASALLAM (Dengan Ihlal sebagaimana Ihlal-nya Nabi shallallahu 'alaihi wasallam).\" beliau bertanya lagi: \"Apakah kamu membawa hadya (hewan kurban)?\" saya menjawab, \"Tidak.\" Beliau bersabda: \"Berangkat dan lakukanlah thawaf di Baitullah, dan Sa'i antara Shafa dan Marwa, kemudian kamu bertahallul.\" Dan ia pun menyebutkan hadits sebagaiaman haditsnya Syu'bah dan Sufyan."
            },
            {
                "number": 2002,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي مُوسَى عَنْ أَبِي مُوسَىأَنَّهُ كَانَ يُفْتِي بِالْمُتْعَةِ فَقَالَ لَهُ رَجُلٌ رُوَيْدَكَ بِبَعْضِ فُتْيَاكَ فَإِنَّكَ لَا تَدْرِي مَا أَحْدَثَ أَمِيرُ الْمُؤْمِنِينَ فِي النُّسُكِ بَعْدُ حَتَّى لَقِيَهُ بَعْدُ فَسَأَلَهُ فَقَالَ عُمَرُ قَدْ عَلِمْتُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ فَعَلَهُ وَأَصْحَابُهُ وَلَكِنْ كَرِهْتُ أَنْ يَظَلُّوا مُعْرِسِينَ بِهِنَّ فِي الْأَرَاكِ ثُمَّ يَرُوحُونَ فِي الْحَجِّ تَقْطُرُ رُءُوسُهُمْ",
                "id": "Dan Telah meceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Umarah bin Umair] dan [Ibrahim bin Abu Musa] dari [Abu Musa] bahwa ia memberi fatwa bolehnya haji tamattu', maka seorang laki-laki pun berkata kepadanya, \"Tangguhkanlah fatwamu, karena kamu tidak tahu kebijakan apa yang akan diambil oleh Amirul Mukminin nanti mengenai tata cara Manasik.\" Setelah itu, Abu Musa menjumpai Umar dan bertanya kepadanya. Kemudian [Umar] berkata, \"Saya tahu bahwa Nabi shallallahu 'alaihi wasallam dan para sahabatnya telah melakukannya. Akan tetapi saya tidak suka bila mereka terus-menerus bergaul dengan isteri-isteri mereka di Al Arak, kemudian mereka beristirahan di dalam haji dengan rambut basah meneteskan air.\""
            },
            {
                "number": 2003,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ شَقِيقٍكَانَ عُثْمَانُ يَنْهَى عَنْ الْمُتْعَةِ وَكَانَ عَلِيٌّ يَأْمُرُ بِهَا فَقَالَ عُثْمَانُ لِعَلِيٍّ كَلِمَةً ثُمَّ قَالَ عَلِيٌّ لَقَدْ عَلِمْتَ أَنَّا قَدْ تَمَتَّعْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَجَلْ وَلَكِنَّا كُنَّا خَائِفِينَو حَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ أَخْبَرَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] -[Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] ia berkata, [Abdullah bin Syaqiq] berkata; Utsman bin Affan pernah melarang mengerjakan haji tamattu' (umrah sebelum haji), sedangkan [Ali] menyuruh melakukannya. Karena itu, [Utsman] menegur Ali, maka Ali pun menjawab, \"Bukankah Anda tahu, bahwa kita pernah mengerjakan haji tamattu' bersama Rasulullah shallallahu 'alaihi wasallam?\" Utsman berkata, \"Benar, tetapi ketika itu kita dalam keadaan tidak aman.\" Dan telah meceritakannya kepadaku [Yahya bin Habib Al Haritsi] Telah menceritakan kepada kami [Khalid bin Harits] telah mengabarkan kepada kami [Syu'bah] dengan isnad ini, semisalnya."
            },
            {
                "number": 2004,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَاجْتَمَعَ عَلِيٌّ وَعُثْمَانُ رَضِيَ اللَّهُ عَنْهُمَا بِعُسْفَانَ فَكَانَ عُثْمَانُ يَنْهَى عَنْ الْمُتْعَةِ أَوْ الْعُمْرَةِ فَقَالَ عَلِيٌّ مَا تُرِيدُ إِلَى أَمْرٍ فَعَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَنْهَى عَنْهُ فَقَالَ عُثْمَانُ دَعْنَا مِنْكَ فَقَالَ إِنِّي لَا أَسْتَطِيعُ أَنْ أَدَعَكَ فَلَمَّا أَنْ رَأَى عَلِيٌّ ذَلِكَ أَهَلَّ بِهِمَا جَمِيعًا",
                "id": "Dan Telah meceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] keduanya berkata, Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Amru bin Murrah] dari [Sa'id bin Al Musayyab] ia berkata; Pada suatu ketika [Ali] dan [Utsman radliallahu 'anhuma] bertemu di 'Usfan. Utsman melarang melakukan haji tamattu' atau umrah. Kata Ali, \"Apa maksud Anda melarang orang mengerjakan ibadah yang pernah diperbuat oleh Rasulullah shallallahu 'alaihi wasallam?\" Utsman menjawab, \"Biarkan kami dengan urusan kami!\" Ali berkata, \"Aku tidak dapat membiarkan Anda begitu saja.\" Setelah Ali melihat yang demikian, lalu ia ihram untuk keduanya (haji dan umrah) sekaligus."
            },
            {
                "number": 2005,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ عَيَّاشٍ الْعَامِرِيِّ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِ عَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ قَالَكَانَتْ لَنَا رُخْصَةً يَعْنِي الْمُتْعَةَ فِي الْحَجِّ",
                "id": "Dan Telah meceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Ayyas Al Amiri] dari [Ibrahim At Taimi] dari [bapaknya] dari [Abu Dzar] radliallahu 'anhu, ia berkata; \"Dulu haji tamattu' itu adalah rukhshah (keringanan) bagi kami.\""
            },
            {
                "number": 2006,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ فُضَيْلٍ عَنْ زُبَيْدٍ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِ قَالَقَالَ أَبُو ذَرٍّ رَضِيَ اللَّهُ عَنْهُ لَا تَصْلُحُ الْمُتْعَتَانِ إِلَّا لَنَا خَاصَّةً يَعْنِي مُتْعَةَ النِّسَاءِ وَمُتْعَةَ الْحَجِّ",
                "id": "Dan Telah meceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Jarir] dari [Fudlail] dari [Zubaid] dari [Ibrahim At Tamimi] dari [bapaknya] ia berkata, [Abu Dzar] radliallahu 'anhu berkata; \"Tidak diperbolehkan dua Mut'ah, kecuali khusus bagi kami (dahulu), yaitu Mut'atun Nisa` (nikah mut'ah) dan Mut'atul Hajji (haji tamattu')."
            },
            {
                "number": 2007,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ بَيَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الشَّعْثَاءِ قَالَ أَتَيْتُ إِبْرَاهِيمَ النَّخَعِيَّ وَإِبْرَاهِيمَ التَّيْمِيَّ فَقُلْتُ إِنِّي أَهُمُّ أَنْ أَجْمَعَ الْعُمْرَةَ وَالْحَجَّ الْعَامَ فَقَالَ إِبْرَاهِيمُ النَّخَعِيُّ لَكِنْ أَبُوكَ لَمْ يَكُنْ لِيَهُمَّ بِذَلِكَ قَالَ قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ بَيَانٍ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِأَنَّهُ مَرَّ بِأَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ بِالرَّبَذَةِ فَذَكَرَ لَهُ ذَلِكَ فَقَالَ إِنَّمَا كَانَتْ لَنَا خَاصَّةً دُونَكُمْ",
                "id": "Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Jarir] dari [Bayan] dari [Abdurrahman bin Abu Sya'tsa`] ia berkata; Aku mendatangi Ibrahim An Nakha'i dan Ibrahim At Taimi. Aku pun berkata, \"Sesungguhnya ingin menggabungkan umrah dan haji pada tahun ini.\" Maka [Ibrahim An Nakha'i] berkata, \"Akan tetapi bapakmu tidak pernah berkeinginan melakukan hal itu.\" [Qutaibah] berkata, Telah menceritakan kepada kami [Jarir] dari [Bayan] dari [Ibrahim At Tamimi] dari [bapaknya] bahwa ia melewati [Abu Dzar] radliallahu 'anhu di Rabadzah, lalau ia menyebutkan hal itu padanya, dan Abu Dzar pun berkata, \"Sesungguhnya itu hanyalah khusus bagi kami (dulu) dan bukan untuk kalian.\""
            },
            {
                "number": 2008,
                "arab": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ قَالَقَالَ لِي عِمْرَانُ بْنُ حُصَيْنٍ إِنِّي لَأُحَدِّثُكَ بِالْحَدِيثِ الْيَوْمَ يَنْفَعُكَ اللَّهُ بِهِ بَعْدَ الْيَوْمِ وَاعْلَمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَعْمَرَ طَائِفَةً مِنْ أَهْلِهِ فِي الْعَشْرِ فَلَمْ تَنْزِلْ آيَةٌ تَنْسَخُ ذَلِكَ وَلَمْ يَنْهَ عَنْهُ حَتَّى مَضَى لِوَجْهِهِ ارْتَأَى كُلُّ امْرِئٍ بَعْدُ مَا شَاءَ أَنْ يَرْتَئِيَو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ حَاتِمٍ كِلَاهُمَا عَنْ وَكِيعٍ حَدَّثَنَا سُفْيَانُ عَنْ الْجُرَيْرِيِّ فِي هَذَا الْإِسْنَادِ و قَالَ ابْنُ حَاتِمٍ فِي رِوَايَتِهِ ارْتَأَى رَجُلٌ بِرَأْيِهِ مَا شَاءَ يَعْنِي عُمَرَ",
                "id": "Dan Telah meceritakan kepada kami [Zuhair bin Harb] Telah menceritakan kepada kami [Isma'il bin Ibrahim] Telah menceritakan kepada kami [Al Jurairi] dari [Abul 'Ala`] dari [Mutharrif] ia berkata; [Imran bin Hushain] berkata kepadaku; \"Pada hari ini saya akan menceritakan hadits kepadamu dan semoga Allah memberikan manfaat kepadamu setelah hari ini. Ketahuilah bahwa Rasulullah shallallahu 'alaihi wasallam telah membolehkan sekelompok dari keluarganya berihram untuk umrah dan tidak ada satu ayat pun yang turun untuk menghapuskannya, dan belau juga tidak pernah melarangnya hingga beliau wafat. Dan setelah itu, setiap orang dapat mengusulkan apa saja yang ingin mereka usulkan.\" Dan Telah meceritakannya kepada kami [Ishaq bin Ibarahim] dan [Muhammad bin Hatim] keduanya dari [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Al Jurairi] di dalam isnad ini. Dan Ibnu Hatim berkata dalam riwayatnya; Seorang dapat mengusulkan apa saja yang menjadi pendapatnya, yakni Umar."
            },
            {
                "number": 2009,
                "arab": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ مُطَرِّفٍ قَالَقَالَ لِي عِمْرَانُ بْنُ حُصَيْنٍ أُحَدِّثُكَ حَدِيثًا عَسَى اللَّهُ أَنْ يَنْفَعَكَ بِهِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ حَجَّةٍ وَعُمْرَةٍ ثُمَّ لَمْ يَنْهَ عَنْهُ حَتَّى مَاتَ وَلَمْ يَنْزِلْ فِيهِ قُرْآنٌ يُحَرِّمُهُ وَقَدْ كَانَ يُسَلَّمُ عَلَيَّ حَتَّى اكْتَوَيْتُ فَتُرِكْتُ ثُمَّ تَرَكْتُ الْكَيَّ فَعَادَو حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ هِلَالٍ قَالَ سَمِعْتُ مُطَرِّفًا قَالَ قَالَ لِي عِمْرَانُ بْنُ حُصَيْنٍ بِمِثْلِ حَدِيثِ مُعَاذٍ",
                "id": "Dan telah meceritakan kepadaku [ubaidhullah bin Mu'adz] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Syu'bah] dari [Humaid bin Hilal] dari [Mutharrif] ia berkata; [Imran bin Hushain] berkata kepadaku; Akan kusampaikan kepadamu sebuah hadits, semoga ia bermanfaat bagimu. Yaitu; bahwa Rasulullah shallallahu 'alaihi wasallam pernah menggabungkan umrah dengan haji dan mengerjakannya sekaligus. Kemudian beliau tidak pernah melarang yang demikian sampai beliau meninggal. Serta ayat yang melarang demikian pun tidak pernah turun. Dan Telah meceritakannya kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] keduanya berkata, Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Humaid bin Hilal] ia berkata, saya mendengar [Mutharrif] berkata, [Imran bin Hushain] berkata kepadaku; Yakni sebagaimana hadits Mu'adz."
            },
            {
                "number": 2010,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ رَضِيَ اللَّهُ عَنْهُ قَالَاعْلَمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ حَجٍّ وَعُمْرَةٍ ثُمَّ لَمْ يَنْزِلْ فِيهَا كِتَابٌ وَلَمْ يَنْهَنَا عَنْهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهَا رَجُلٌ بِرَأْيِهِ مَا شَاءَ",
                "id": "Dan Telah meceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepadaku [Isa bin Yunus] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Mutharrif bin Abdullah Asy Syakhiri] dari [Imran bin Hushain] radliallahu 'anhu, ia berkata; \"Aku tahu bahwa Rasulullah shallallahu 'alaihi wasallam mengumpulkan haji dan umrah dan sesudah itu, belum ada ayat Al Quran yang turun melarangnya dan beliau juga tidak melarangnya. Namun seorang laki-laki telah berkata tentang hal itu dengan menggunakan akalnya sendiri."
            },
            {
                "number": 2011,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ مُطَرِّفٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللَّهُ عَنْهُ قَالَتَمَتَّعْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَنْزِلْ فِيهِ الْقُرْآنُ قَالَ رَجُلٌ بِرَأْيِهِ مَا شَاءَو حَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ حَدَّثَنِي مُحَمَّدُ بْنُ وَاسِعٍ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللَّهُ عَنْهُ بِهَذَا الْحَدِيثِ قَالَ تَمَتَّعَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَمَتَّعْنَا مَعَهُ",
                "id": "Dan Telah meceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepadaku [Abdush Shamad] Telah menceritakan kepada kami [Hammam] Telah menceritakan kepada kami [Qatadah] dari [Mutharrif] dari [Imran bin Hushain] radliallahu 'anhu, ia berkata; \"Kami mengerjakan haji tamattu' bersama Rasulullah shallallahu 'alaihi wasallam, dan tidak ada ayat Al Qur`an yang turun (melarangnya). Namun seorang laki-laki telah berkata dengan akalnya sendiri dan semuanya.\" Dan telah menceritakan kepadaku [Hajjaj bin Sya'ir] Telah menceritakan kepada kami [ubaidhullah bin Abdul Majid] Telah menceritakan kepada kami [Isma'il bin Muslim] telah menceritakan kepadaku [Muhammad bin Wasi'] dari [Mutharrif bin Abdullah Asy Syikhkhir] dari [Imran bin Hushain] radliallahu 'anhu dengan isnad ini, ia berkata; Nabi shallallahu 'alaihi wasallam mengerjakan haji tamattu', maka kami pun ikut mengerjakannya."
            },
            {
                "number": 2012,
                "arab": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ وَمُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ قَالَا حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عِمْرَانُ بْنُ مُسْلِمٍ عَنْ أَبِي رَجَاءٍ قَالَقَالَ عِمْرَانُ بْنُ حُصَيْنٍ نَزَلَتْ آيَةُ الْمُتْعَةِ فِي كِتَابِ اللَّهِ يَعْنِي مُتْعَةَ الْحَجِّ وَأَمَرَنَا بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ لَمْ تَنْزِلْ آيَةٌ تَنْسَخُ آيَةَ مُتْعَةِ الْحَجِّ وَلَمْ يَنْهَ عَنْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى مَاتَ قَالَ رَجُلٌ بِرَأْيِهِ بَعْدُ مَا شَاءَو حَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عِمْرَانَ الْقَصِيرِ حَدَّثَنَا أَبُو رَجَاءٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ وَفَعَلْنَاهَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ وَأَمَرَنَا بِهَا",
                "id": "Telah menceritakan kepada kami [Hamid bin Umar Al Bakrawi] dan [Muhammad bin Abu Bakr Al Muqaddami] keduanya berkata, Telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] Telah menceritakan kepada kami [Imran bin Muslim] dari [Abu Raja`] ia berkata, [Imran bin Hushain] berkata; \"Telah turun ayat Mut'ah di dalam kitabullah, yakni Mut'atul Hajji (haji tamattu'), dan Rasulullah shallallahu 'alaihi wasallam juga memerintahkan untuk mengerjakannya. Sesudah itu, belum ada ayat yang turun dan menghapuskannya, demikan juga Rasulullah shallallahu 'alaihi wasallam, beliau tidak pernah melarangnya kembali hingga beliau meninggal. Namun seseorang telah berkata sesuai dengan selera akalnya sendiri.\" Dan telah menceritakannya kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Imran Al Qashir] Telah menceritakan kepada kami [Abu Raja`] dari [Imran bin Hushain] semisalnya. Hanya saja ia menyebutkan; \"Dan kami mengerjakannya bersama Rasulullah shallallahu 'alaihi wasallam.\" yakni, ia tidak menyebutkan; \"Beliau memerintahkan kami (untuk mengerjakannya).\""
            },
            {
                "number": 2013,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَتَمَتَّعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بِالْعُمْرَةِ إِلَى الْحَجِّ وَأَهْدَى فَسَاقَ مَعَهُ الْهَدْيَ مِنْ ذِي الْحُلَيْفَةِ وَبَدَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَهَلَّ بِالْعُمْرَةِ ثُمَّ أَهَلَّ بِالْحَجِّ وَتَمَتَّعَ النَّاسُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعُمْرَةِ إِلَى الْحَجِّ فَكَانَ مِنْ النَّاسِ مَنْ أَهْدَى فَسَاقَ الْهَدْيَ وَمِنْهُمْ مَنْ لَمْ يُهْدِ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ قَالَ لِلنَّاسِ مَنْ كَانَ مِنْكُمْ أَهْدَى فَإِنَّهُ لَا يَحِلُّ مِنْ شَيْءٍ حَرُمَ مِنْهُ حَتَّى يَقْضِيَ حَجَّهُ وَمَنْ لَمْ يَكُنْ مِنْكُمْ أَهْدَى فَلْيَطُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَلْيُقَصِّرْ وَلْيَحْلِلْ ثُمَّ لِيُهِلَّ بِالْحَجِّ وَلْيُهْدِ فَمَنْ لَمْ يَجِدْ هَدْيًا فَلْيَصُمْ ثَلَاثَةَ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةً إِذَا رَجَعَ إِلَى أَهْلِهِ وَطَافَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قَدِمَ مَكَّةَ فَاسْتَلَمَ الرُّكْنَ أَوَّلَ شَيْءٍ ثُمَّ خَبَّ ثَلَاثَةَ أَطْوَافٍ مِنْ السَّبْعِ وَمَشَى أَرْبَعَةَ أَطْوَافٍ ثُمَّ رَكَعَ حِينَ قَضَى طَوَافَهُ بِالْبَيْتِ عِنْدَ الْمَقَامِ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَانْصَرَفَ فَأَتَى الصَّفَا فَطَافَ بِالصَّفَا وَالْمَرْوَةِ سَبْعَةَ أَطْوَافٍ ثُمَّ لَمْ يَحْلِلْ مِنْ شَيْءٍ حَرُمَ مِنْهُ حَتَّى قَضَى حَجَّهُ وَنَحَرَ هَدْيَهُ يَوْمَ النَّحْرِ وَأَفَاضَ فَطَافَ بِالْبَيْتِ ثُمَّ حَلَّ مِنْ كُلِّ شَيْءٍ حَرُمَ مِنْهُ وَفَعَلَ مِثْلَ مَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَهْدَى وَسَاقَ الْهَدْيَ مِنْ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Laits] telah menceritakan kepadaku [bapakku] dari [kakekku] telah menceritakan kepadaku [Uqail bin Khalid] dari [Ibnu Syihab] dari [Salim bin Abdullah] bahwa [Abdullah bin Umar] radliallahu 'anhuma, berkata; Rasulullah shallallahu 'alaihi wasallam mengerjakan haji tamattu' ketika haji wada', yaitu dengan mengerjakan umrah sebelum haji. Kemudian beliau bayar denda dengan hewan kurban yang dibawanya dari Zulhulaifah, tempat beliau memulai ihram untuk umrahnya itu. sesudah itu, barulah beliau ihram pula untuk haji, dan orang banyak umrah pula bersama-sama dengan beliau. Di antara mereka ada yang membawa hadyu dan ada pula yang tidak membawa. Setibanya Rasulullah shallallahu 'alaihi wasallam di Makkah, beliau bersabda kepada orang banyak: \"Barangsiapa yang membawa hadyu, dia boleh bertahallul (berhenti ihram) hingga selesai haji. Dan siapa yang tidak membawa hadyu, hendaklah thawaf di Baitullah, kemudian sa'i antara Shafa dan Marwa, setelah itu ia boleh bercukur dan tahallul. Kemudian ia harus ihram kembali untuk haji dan harus membayar denda dengan menyembelih kurban. Siapa yang tidak membawa hewan kurban, dia harus puasa tiga hari di tempat haji dan tujuh hari apabila dia telah tiba di kampungnya.\" Sesampainya di Makkah, lebih dahulu beliau jamah hajar Aswad, kemudian beliau berlari-lari kecil tiga kali putaran keliling Ka'bah, beliau sholat dua raka'at di maqam Ibrahim. Selesai sholat beliau pergi ke Shafa dan Marwa, lalu Sa'i antara Shafa dan Marwa tujuh kali. Beliau tidak tahallul sampai selesai haji dan menyembelih kurban di hari Nahr (tanggal sepuluh Dzulhijjjah). Sesudah itu, beliau kembali ke Makkah, lalu thawaf di Bait, kemudian tahallul atau menghalalkan segala sesuatu yang tadinya haram dikerjakan selama ibadah haji. Apa yang diperbuat beliau itu, dicontoh pula oleh orang-orang yang membawa hewan kurban."
            },
            {
                "number": 2014,
                "arab": "و حَدَّثَنِيهِ عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَمَتُّعِهِ بِالْحَجِّ إِلَى الْعُمْرَةِ وَتَمَتُّعِ النَّاسِ مَعَهُبِمِثْلِ الَّذِي أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah meceritakannya kepadaku [Abdul Malik bin Syu'aib] telah menceritakan kepadaku [bapakku] dari [kakekku] telah menceritakan kepadaku [Uqail] dari [Ibnu Syihab] dari [Urwah bin Zubair] bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya dari Rasulullah shallallahu 'alaihi wasallam berkenaan dengan haji tamattu' yang juga diikutsertai oleh para sahabatnya. Yakni sebagaimana yang telah dikabarkan kepadaku oleh Salim bin Abdullah dari Abdullah radliallahu 'anhu dari Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 2015,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ حَفْصَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْيَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلَا أَحِلُّ حَتَّى أَنْحَرَو حَدَّثَنَاه ابْنُ نُمَيْرٍ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ رَضِيَ اللَّهُ عَنْهُمْ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ مَا لَكَ لَمْ تَحِلَّ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa [Hafshah] isteri Nabi shallallahu 'alaihi wasallam berkata, \"Wahai Rasulullah, kenapa orang banyak telah tahallul dari umrah sementara Anda sendiri belum?\" beliau menjawab: \"Aku telah menggulung rambutku dan memberi kalung pada hewan kurban. Karena itu, aku tidak boleh tahallul sampai aku menyembelih hewan kurbanku ini.\" Dan Telah meceritakannya kepada kami [Ibnu Numair] Telah menceritakan kepada kami [Khalid bin Makhlad] dari [Malik] dari [Nafi'] dari [Ibnu Umar] dari [Hafshah] radliallahu 'anhum, ia berkata; Saya bertanya, \"Wahai Rasulullah, kenapa Anda belum tahallul.\" Yakni serupa dengan hadits di atas."
            },
            {
                "number": 2016,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ رَضِيَ اللَّهُ عَنْهُمْ قَالَتْقُلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحِلَّ مِنْ عُمْرَتِكَ قَالَ إِنِّي قَلَّدْتُ هَدْيِي وَلَبَّدْتُ رَأْسِي فَلَا أَحِلُّ حَتَّى أَحِلَّ مِنْ الْحَجِّو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ حَفْصَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ يَا رَسُولَ اللَّهِ بِمِثْلِ حَدِيثِ مَالِكٍ فَلَا أَحِلُّ حَتَّى أَنْحَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [ubaidhullah] ia berkata, telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] dari [Hafshah] radliallahu 'anhum, ia berkata; Saya bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Kenapa orang-orang pada bertahallul dari umrah sedangkan Anda sendiri belum?\" beliau menjawab: \"Aku telah mengalungi hewan kurbanku dan menggulung rambutku. Karena itu, aku tidak boleh tahallul, sampai ibadah haji selesai.\" Dan Telah meceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abu Usamah] Telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa [Hafshah] radliallahu 'anha, berkata, \"Wahai Rasulullah…\" yakni sebagaimana haditsnya Malik.\"Aku tidak akan bertahallul sampai menyembelih hewan kurban.\""
            },
            {
                "number": 2017,
                "arab": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ الْمَخْزُومِيُّ وَعَبْدُ الْمَجِيدِ عَنْ ابْنِ جُرَيْجٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ حَدَّثَتْنِي حَفْصَةُ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَزْوَاجَهُ أَنْ يَحْلِلْنَ عَامَ حَجَّةِ الْوَدَاعِ قَالَتْ حَفْصَةُ فَقُلْتُ مَا يَمْنَعُكَ أَنْ تَحِلَّ قَالَ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلَا أَحِلُّ حَتَّى أَنْحَرَ هَدْيِي",
                "id": "Dan Telah meceritakan kepada kami [Ibnu Abu Umar] Telah menceritakan kepada kami [Hisyam bin Sulaiman Al Makhzumi] dan [Abdul Majid] dari [Ibnu Juraij] dari [Nafi'] dari [Ibnu Umar] ia berkata; telah menceritakan kepadaku [Hafshah] radliallahu 'anha, bahwa Nabi shallallahu 'alaihi wasallam memerintahkan kepada isteri-isterinya untuk bertahallul pada tahun haji wada'. Hafshah bertanya, \"Apa yang menghalangi Anda untuk bertahallul?\" beliau menjawab: \"Aku telah menggulung rambutku dan telah mengalungkan hewan kurbanku. Karena itu, aku tidak akan bertahallul hingga aku menyembelih hewan kurbanku.\""
            },
            {
                "number": 2018,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا خَرَجَ فِي الْفِتْنَةِ مُعْتَمِرًا وَقَالَ إِنْ صُدِدْتُ عَنْ الْبَيْتِ صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ فَأَهَلَّ بِعُمْرَةٍ وَسَارَ حَتَّى إِذَا ظَهَرَ عَلَى الْبَيْدَاءِ الْتَفَتَ إِلَى أَصْحَابِهِ فَقَالَ مَا أَمْرُهُمَا إِلَّا وَاحِدٌ أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ الْحَجَّ مَعَ الْعُمْرَةِ فَخَرَجَ حَتَّى إِذَا جَاءَ الْبَيْتَ طَافَ بِهِ سَبْعًا وَبَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا لَمْ يَزِدْ عَلَيْهِ وَرَأَى أَنَّهُ مُجْزِئٌ عَنْهُ وَأَهْدَى",
                "id": "Dan Telah meceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Nafi'] bahwa [Abdullah bin Umar] radliallahu 'anhuma keluar untuk menunaikan Umrah pada saat terjadinya fitnah. Dan ia pun berkata, \"Jika aku dihalangi dari Baitullah, maka kami akan berbuat sebagaimana yang kami perbuat bersama Rasulullah shallallahu 'alaihi wasallam.\" Lalu ia pun berangkat, dan memulai Ihram untuk Umrah dan berjalan terus. Ketika mendekati Baida`, Abdullah bin Umar menoleh ke arah para sahabatnya seraya berkata, \"Tidaklah keduanya (umrah dan haji) kecuali merupakan satu perkara. Saya saksikan kepada kalian, bahwa aku telah mewajibkan haji bersama umrahku.\" Lalu Ibnu Umar pun keluar, dan ketika ia sampai di Baitullah, ia pun melakukan thawaf dan Sa'i antara Shafa dan Marwa sebanyak tujuh kali. Dan ia tidak lagi menambahkannya. Menurutnya, haji telah cukup, dan ia pun menyembelih hewan kurban."
            },
            {
                "number": 2019,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ أَنَّ عَبْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ وَسَالِمَ بْنَ عَبْدِ اللَّهِكَلَّمَا عَبْدَ اللَّهِ حِينَ نَزَلَ الْحَجَّاجُ لِقِتَالِ ابْنِ الزُّبَيْرِ قَالَا لَا يَضُرُّكَ أَنْ لَا تَحُجَّ الْعَامَ فَإِنَّا نَخْشَى أَنْ يَكُونَ بَيْنَ النَّاسِ قِتَالٌ يُحَالُ بَيْنَكَ وَبَيْنَ الْبَيْتِ قَالَ فَإِنْ حِيلَ بَيْنِي وَبَيْنَهُ فَعَلْتُ كَمَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ حِينَ حَالَتْ كُفَّارُ قُرَيْشٍ بَيْنَهُ وَبَيْنَ الْبَيْتِ أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ عُمْرَةً فَانْطَلَقَ حَتَّى أَتَى ذَا الْحُلَيْفَةِ فَلَبَّى بِالْعُمْرَةِ ثُمَّ قَالَ إِنْ خُلِّيَ سَبِيلِي قَضَيْتُ عُمْرَتِي وَإِنْ حِيلَ بَيْنِي وَبَيْنَهُ فَعَلْتُ كَمَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ ثُمَّ تَلَا{ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ }ثُمَّ سَارَ حَتَّى إِذَا كَانَ بِظَهْرِ الْبَيْدَاءِ قَالَ مَا أَمْرُهُمَا إِلَّا وَاحِدٌ إِنْ حِيلَ بَيْنِي وَبَيْنَ الْعُمْرَةِ حِيلَ بَيْنِي وَبَيْنَ الْحَجِّ أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجَّةً مَعَ عُمْرَةٍ فَانْطَلَقَ حَتَّى ابْتَاعَ بِقُدَيْدٍ هَدْيًا ثُمَّ طَافَ لَهُمَا طَوَافًا وَاحِدًا بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ لَمْ يَحِلَّ مِنْهُمَا حَتَّى حَلَّ مِنْهُمَا بِحَجَّةٍ يَوْمَ النَّحْرِو حَدَّثَنَاه ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ قَالَ أَرَادَ ابْنُ عُمَرَ الْحَجَّ حِينَ نَزَلَ الْحَجَّاجُ بِابْنِ الزُّبَيْرِ وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ هَذِهِ الْقِصَّةِ وَقَالَ فِي آخِرِ الْحَدِيثِ وَكَانَ يَقُولُ مَنْ جَمَعَ بَيْنَ الْحَجِّ وَالْعُمْرَةِ كَفَاهُ طَوَافٌ وَاحِدٌ وَلَمْ يَحِلَّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا",
                "id": "Dan Telah meceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Yahya Al Qaththan] dari [ubaidhullah] telah menceritakan kepadaku [Nafi'] bahwa Abdullah bin Abdullah dan Salim bin Abdullah, keduanya pernah terlibat dalam suatu perbincangan dengan [Abdullah bin Umar] ketika Hajjaj hendak memerangi Ibnu Zubair. Keduanya mengatakan kepada Abdullah, \"Tidaklah mengapa agaknya jika Anda tidak pergi haji tahun ini, karena khawatir akan terjadi peperangan sehingga Anda terhalang mengerjakannya.\" Maka Abdullah menjawab, \"Jika aku dihalangi dari Baitullah, maka akan kulakukan sebagaimana apa yang dilakukan Rasulullah shallallahu 'alaihi wasallam dan saat itu aku bersama, yakni ketika beliau dihalangi dari Baitullah oleh orang-orang kafir Quraisy. Aku saksikan kepada kalian, bahwa aku telah mewajibkan umrah (atas diriku).\" Maka Abdullah pun berangkat, dan ketika ia telah sampai di Dzulhulaifah, ia pun memulai ihram untuk umrah. Kemudian ia berkata, \"Apabila aku dibiarkan, akan kulaksanakan umrahku, tetapi jika aku dihalangi dari Baitullah, maka akan kulakukan sebagaimana yang dilakukan Rasulullah shallallahu 'alaihi wasallam yang pada saat itu aku bersama bersamanya.\" Lalu ia membawakan ayat: \"Sesungguhnya telah ada pada diri Rasulullah shallallahu 'alaihi wasallam itu suri tauladan bagimu….\" (Al Ahzab: 21). Setelah itu, ia melanjutkan perjalanannya ke Baida`. Kemudian ia berkata, \"Sesungguhnya ibadah haji dan umrah itu adalah satu. Jika aku terhalang mengerjakan umrah, berarti aku terhalang pula mengerjakan haji. Akan kuperlihatkan kepadamu, bagaimana cara menunaikan haji sekaligus dengan umrah.\" Dan diteruskanlah perjalanannya. Sampai di Qudaid dibelinya hadyu (hewan kurban). Kemudian dia thawaf di Baitullah satu kali, Sa'i di Shafa dan Marwa satu kali. Dan ia tidak tahallul melainkan pada hari Nahr (tanggal sepuluh Dzulhijjah). Dan Telah meceritakannya kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] ia berkata; [Ibnu Umar] ingin menunaikan ibadah haji ketika Hajjaj ingin memerangi Ibnu Zubair. Ia pun menuturkan hadits sebagaimana kisah di atas. Dan di akhir hadits, ia menyebutkan; Ibnu Umar berkata, \"Siapa yang menggabungkan antara haji dan umrah, maka cukup baginya untuk melakukan sekali thwaf. Dan hendaklah ia tidak tahallul hingga tahallul dari keduanya dengan bersamaan.\""
            },
            {
                "number": 2020,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ وَاللَّفْظُ لَهُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ أَرَادَ الْحَجَّ عَامَ نَزَلَ الْحَجَّاجُ بِابْنِ الزُّبَيْرِ فَقِيلَ لَهُ إِنَّ النَّاسَ كَائِنٌ بَيْنَهُمْ قِتَالٌ وَإِنَّا نَخَافُ أَنْ يَصُدُّوكَ فَقَالَ{ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ }أَصْنَعُ كَمَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ عُمْرَةً ثُمَّ خَرَجَ حَتَّى إِذَا كَانَ بِظَاهِرِ الْبَيْدَاءِ قَالَ مَا شَأْنُ الْحَجِّ وَالْعُمْرَةِ إِلَّا وَاحِدٌ اشْهَدُوا قَالَ ابْنُ رُمْحٍ أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجًّا مَعَ عُمْرَتِي وَأَهْدَى هَدْيًا اشْتَرَاهُ بِقُدَيْدٍ ثُمَّ انْطَلَقَ يُهِلُّ بِهِمَا جَمِيعًا حَتَّى قَدِمَ مَكَّةَ فَطَافَ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَلَمْ يَزِدْ عَلَى ذَلِكَ وَلَمْ يَنْحَرْ وَلَمْ يَحْلِقْ وَلَمْ يُقَصِّرْ وَلَمْ يَحْلِلْ مِنْ شَيْءٍ حَرُمَ مِنْهُ حَتَّى كَانَ يَوْمُ النَّحْرِ فَنَحَرَ وَحَلَقَ وَرَأَى أَنْ قَدْ قَضَى طَوَافَ الْحَجِّ وَالْعُمْرَةِ بِطَوَافِهِ الْأَوَّلِ وَقَالَ ابْنُ عُمَرَ كَذَلِكَ فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنِي إِسْمَعِيلُ كِلَاهُمَا عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ بِهَذِهِ الْقِصَّةِ وَلَمْ يَذْكُرْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا فِي أَوَّلِ الْحَدِيثِ حِينَ قِيلَ لَهُ يَصُدُّوكَ عَنْ الْبَيْتِ قَالَ إِذَنْ أَفْعَلَ كَمَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ فِي آخِرِ الْحَدِيثِ هَكَذَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا ذَكَرَهُ اللَّيْثُ",
                "id": "Dan Telah meceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] -dalam riwayat lain- Dan Telah meceritakan kepada kami [Qutaibah] -lafazh juga miliknya- Telah menceritakan kepada kami [Laits] dari [Nafi'] bahwa [Ibnu Umar] ingin naik haji, ketika Hajjaj hendak memerangi Ibnu Zubair, maka dikatakanlah kepadanya, \"Sesungguhnya akan terjadi peperangan di antara manusia, dan kami khawatir mereka akan mencegahmu.\" Ibnu Umar berkata, \"Sungguh, telah ada pada diri Rasulullah suri tauladan bagi kalian. saya akan lakukan sebagaimana yang dilakukan oleh Rasulullah shallallahu 'alaihi wasallam. Aku saksikan kepada kalian, bahwa aku telah mewajibkan umrah (atas diriku).\" Ia pun berangkat, dan ketika mendekati Baida`, ia berkata, \"Tidaklah Haji dan umrah itu melainkan satu perkara. Saksikanlah, -Ibnu Rumh berkata- Aku saksikan kepada kalian, bahwa aku telah mewajibkan haji bersama umrahku.\" Kemudian Ibnu Umar menyembelih hadya (hewan kurban) yang telah ia beli di Qudaid. Sesudah itu, ia pergi dan melakukan ihram untuk haji dan umrah. Sesampainya di kota Makkah, ia langsung thawaf di Baitullah, sa'i antara Shafa dan Marwa, dan ia tidak lagi menambah atas itu semua, tidak pula menyembelih (hewan kurban), tidak bercukur, tidak memendekkan rambut, dan tidak pula tahallul hingga tiba hari Nahr. Lalu ia pun menyembelih hewan kurban. Menurutnya, ia telah mengganti thawaf haji dan umrah dengan thawafnya yang pertama. Kemudian Ibnu Umar berkata, \"Demikianlah yang diberbuat oleh Rasulullah shallallahu 'alaihi wasallam.\" Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] dan [Abu Kamil] Telah menceritakan kepada kami [Hammad] -dalam riwayat lain- Dan telah meceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepadaku [Isma'il] keduanya dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dengan kisah ini. dan ia tidak menyebut Nabi shallallahu 'alaihi wasallam, kecuali di awal hadits, yakti saat dikatakan kepadanya; \"Mereka akan menghalangimu dari Baitullah.\" Ibnu Umar menjawab: \"Kalau begitu, akan kulakukan sebagai yang dilakukan Rasulullah shallallahu 'alaihi wasallam.\" dan di akhir hadits ia juga tidak menyebutkan; \"Seperti inilah yang dilakukan oleh Rasulullah shallallahu 'alaihi wasallam.\" yakni, sebagaimana yang disebutkan oleh Laits."
            },
            {
                "number": 2021,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَعَبْدُ اللَّهِ بْنُ عَوْنٍ الْهِلَالِيُّ قَالَا حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ فِي رِوَايَةِ يَحْيَى قَالَأَهْلَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ مُفْرَدًاوَفِي رِوَايَةِ ابْنِ عَوْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ بِالْحَجِّ مُفْرَدًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Abdullah bin Aun Al Hilali] keduanya berkata, Telah menceritakan kepada kami [Abbad bin Abbad Al Muhallabi] Telah menceritakan kepada kami [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] -dalam riwayat Yahya- ia berkata; \"Kami pernah berihram bersama Rasulullah shallallahu 'alaihi wasallam untuk haji ifrad.\""
            },
            {
                "number": 2022,
                "arab": "و حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا حُمَيْدٌ عَنْ بَكْرٍ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي بِالْحَجِّ وَالْعُمْرَةِ جَمِيعًاقَالَ بَكْرٌ فَحَدَّثْتُ بِذَلِكَ ابْنَ عُمَرَ فَقَالَ لَبَّى بِالْحَجِّ وَحْدَهُ فَلَقِيتُ أَنَسًا فَحَدَّثْتُهُ بِقَوْلِ ابْنِ عُمَرَ فَقَالَ أَنَسٌ مَا تَعُدُّونَنَا إِلَّا صِبْيَانًا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَبَّيْكَ عُمْرَةً وَحَجًّا",
                "id": "Dan Telah meceritakan kepada kami [Suraij bin Yunus] Telah menceritakan kepada kami [Husyaim] Telah menceritakan kepada kami [Humaid] dari [Bakr] dari [Anas] radliallahu 'anhu, ia berkata; \"Saya mendengar Nabi shallallahu 'alaihi wasallam membaca talbiyah (memulai ihram) untuk haji dan umrah sekaligus.\" Bakr berkata; Lalu saya menceritakan hal itu kepada Ibnu Umar, maka ia pun berkata, \"Beliau membaca talbiyah (memulai ihram) hanya untuk haji saja.\" Kemudian aku menemui Anas dan menceritakan ungkapan [Ibnu Umar], maka Anas pun berkata, \"Kalian tidaklah menganggap kami, kecuali masih kecil (saat itu). Saya telah mendengar Rasulullah shallallahu 'alaihi wasallam membaca: \"LABBAIKA UMRATAN WA HAJJAN (Ya Allah, aku penuhi panggilan-Mu untuk haji sekaligus Umrah).\""
            },
            {
                "number": 2023,
                "arab": "و حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا حَبِيبُ بْنُ الشَّهِيدِ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ حَدَّثَنَا أَنَسٌ رَضِيَ اللَّهُ عَنْهُأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَهُمَا بَيْنَ الْحَجِّ وَالْعُمْرَةِقَالَ فَسَأَلْتُ ابْنَ عُمَرَ فَقَالَ أَهْلَلْنَا بِالْحَجِّ فَرَجَعْتُ إِلَى أَنَسٍ فَأَخْبَرْتُهُ مَا قَالَ ابْنُ عُمَرَ فَقَالَ كَأَنَّمَا كُنَّا صِبْيَانًا",
                "id": "Dan telah meceritakan kepadaku [Umayyah bin Bistham Al 'Aisyi] Telah menceritakan kepada kami [Yazid bin Zurai'] Telah menceritakan kepada kami [Habib bin Asy Syahid] dari [Bakr bin Abdullah] Telah menceritakan kepada kami [Anas] radliallahu 'anhu bahwa ia pernah melihat Nabi shallallahu 'alaihi wasallam menggabungkan antata keduanya (haji dan umrah).\" Bakr berkata; Lalu aku bertanya kepada [Ibnu Umar], maka ia pun berkata, \"Kami Ihlal (memulai ihram) untuk haji.\" Kemudian aku pun kembali kepada Anas dan menyampaikan apa yang telah dikatakan oleh Ibnu Umar, maka ia pun berkata, \"Sepertinya (saat itu), kami masih anak-anak.\""
            },
            {
                "number": 2024,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْثَرٌ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ وَبَرَةَ قَالَ كُنْتُ جَالِسًا عِنْدَ ابْنِ عُمَرَ فَجَاءَهُ رَجُلٌ فَقَالَ أَيَصْلُحُ لِي أَنْ أَطُوفَ بِالْبَيْتِ قَبْلَ أَنْ آتِيَ الْمَوْقِفَ فَقَالَ نَعَمْ فَقَالَ فَإِنَّ ابْنَ عَبَّاسٍ يَقُولُ لَا تَطُفْ بِالْبَيْتِ حَتَّى تَأْتِيَ الْمَوْقِفَفَقَالَ ابْنُ عُمَرَ فَقَدْ حَجَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَافَ بِالْبَيْتِ قَبْلَ أَنْ يَأْتِيَ الْمَوْقِفَفَبِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَقُّ أَنْ تَأْخُذَ أَوْ بِقَوْلِ ابْنِ عَبَّاسٍ إِنْ كُنْتَ صَادِقًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami ['Abtsar] dari [Isma'il bin Abu Khalid] dari [Wabarah] ia berkata; Aku pernah duduk bersama [Ibnu Umar], tiba-tiba seorang lelaki datang kepadanya dan bertanya, \"Apakah tindakanku bisa dibenarkan bila aku melaksanakan thawaf di Baitullah terlebih dahulu sebelum aku datang ke Arafah untuk melaksanakan wuquf?\" Maka Ibnu Umar menjawab, \"Ya, benar.\" Namun Ibnu Abbas berkata, \"Janganlah kamu melaksanakan thawaf di Baitullah hingga kamu melaksanakan wuquf di Arafah.\" Ibnu Umar berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melaksanakan haji, dan beliau melaksanakan thawaf di Baitullah sebelum mendatangi Arafah untuk melaksanakan wuquf di sana. Maka jika kamu seorang yang benar, manakah yang lebih berhak kau ambil; perkataan Rasulullah shallallahu 'alaihi wasallam atau perkataan Ibnu Abbas?\""
            },
            {
                "number": 2025,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ بَيَانٍ عَنْ وَبَرَةَ قَالَ سَأَلَ رَجُلٌ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَطُوفُ بِالْبَيْتِ وَقَدْ أَحْرَمْتُ بِالْحَجِّ فَقَالَ وَمَا يَمْنَعُكَ قَالَ إِنِّي رَأَيْتُ ابْنَ فُلَانٍ يَكْرَهُهُ وَأَنْتَ أَحَبُّ إِلَيْنَا مِنْهُ رَأَيْنَاهُ قَدْ فَتَنَتْهُ الدُّنْيَا فَقَالَ وَأَيُّنَا أَوْ أَيُّكُمْ لَمْ تَفْتِنْهُ الدُّنْيَا ثُمَّقَالَ رَأَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْرَمَ بِالْحَجِّ وَطَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِفَسُنَّةُ اللَّهِ وَسُنَّةُ رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَقُّ أَنْ تَتَّبِعَ مِنْ سُنَّةِ فُلَانٍ إِنْ كُنْتَ صَادِقًا",
                "id": "Dan Telah meceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Jarir] dari [Bayan] dari [Wabarah] ia berkata; Seorang laki-laki bertanya kepada [Ibnu Umar radliallahu 'anhuma], \"Bolehkah aku thawaf di Baitullah, sementara aku telah ihram untuk haji.\" Maka Ibnu Umar menjawab, \"Lalu, apa yang menghalangimu untuk melakukannya?\" Laki-laki itu berkata, \"Sesungguhnya saya melihat Ibnu Fulan membencinya, dan Anda lebih kami sukai daripada dia. Kami melihat bahwa ia telah termakan oleh fitnah dunia.\" Ibnu Umar kemudian berkata, \"Siapakah di antara kalian yang tidak termakan oleh fitnah dunia?\" kemudian ia berkata lagi, \"Kami telah melihat Rasulullah shallallahu 'alaihi wasallam berihram untuk haji, kemudian beliau thawaf di Baitullah dan Sa'i antara Shafa dan Marwa. Maka sunnah Allah dan sunnah Rasul-Nyalah yang lebih berhak untuk diikuti daripada sunnah si Fulan, jika kamu benar-benar seorang yang Shadiq (jujur).\""
            },
            {
                "number": 2026,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَأَلْنَا ابْنَ عُمَرَ عَنْ رَجُلٍ قَدِمَ بِعُمْرَةٍ فَطَافَ بِالْبَيْتِ وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ أَيَأْتِي امْرَأَتَهُ فَقَالَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَافَ بِالْبَيْتِ سَبْعًا وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ عَنْ حَمَّادِ بْنِ زَيْدٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ جَمِيعًا عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ ابْنِ عُيَيْنَةَ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] ia berkata; Kami bertanya kepada [Ibnu Umar] mengenai seorang laki-laki yang mengerjakan ibadah umrah, lalu ia thawaf di Baitullah tetapi belum Sa'i antara Shafa dan Marwa. Bolehkah ia menggauli isterinya (bertahallul). Ibnu Umar menjawab, \"Rasulullah shallallahu 'alaihi wasallam telah melakukan umrah, mula-mula beliau thawaf di Baitullah tujuh kali; kemudian sholat dua raka'at di Maqam Ibrahim, kemudian Sa'i antara Shafa dan Marwah tujuh kali. Sesungguhnya pada diri Rasulullah shallallahu 'alaihi wasallam terdapat suri tauladan yang baik bagi kalian.\" Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Rabi' Az Zahrani] dari [Hammad bin Zaid] -dalam riwayat lain- Dan Telah meceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Muhamamd bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] semuanya dari [Amru bin Dinar] dari [Ibnu Umar] radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam. yakni seperti haditsnya Ibnu Uyainah."
            },
            {
                "number": 2027,
                "arab": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ رَجُلًا مِنْ أَهْلِ الْعِرَاقِ قَالَ لَهُ سَلْ لِي عُرْوَةَ بْنَ الزُّبَيْرِ عَنْ رَجُلٍ يُهِلُّ بِالْحَجِّ فَإِذَا طَافَ بِالْبَيْتِ أَيَحِلُّ أَمْ لَا فَإِنْ قَالَ لَكَ لَا يَحِلُّ فَقُلْ لَهُ إِنَّ رَجُلًا يَقُولُ ذَلِكَقَالَ فَسَأَلْتُهُ فَقَالَ لَا يَحِلُّ مَنْ أَهَلَّ بِالْحَجِّ إِلَّا بِالْحَجِّ قُلْتُ فَإِنَّ رَجُلًا كَانَ يَقُولُ ذَلِكَ قَالَ بِئْسَ مَا قَالَ فَتَصَدَّانِي الرَّجُلُ فَسَأَلَنِي فَحَدَّثْتُهُ فَقَالَ فَقُلْ لَهُ فَإِنَّ رَجُلًا كَانَ يُخْبِرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ فَعَلَ ذَلِكَ وَمَا شَأْنُ أَسْمَاءَ وَالزُّبَيْرِ قَدْ فَعَلَا ذَلِكَ قَالَ فَجِئْتُهُ فَذَكَرْتُ لَهُ ذَلِكَ فَقَالَ مَنْ هَذَا فَقُلْتُ لَا أَدْرِي قَالَ فَمَا بَالُهُ لَا يَأْتِينِي بِنَفْسِهِ يَسْأَلُنِي أَظُنُّهُ عِرَاقِيًّا قُلْتُ لَا أَدْرِي قَالَ فَإِنَّهُ قَدْ كَذَبَ قَدْ حَجَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا أَنَّ أَوَّلَ شَيْءٍ بَدَأَ بِهِ حِينَ قَدِمَ مَكَّةَ أَنَّهُ تَوَضَّأَ ثُمَّ طَافَ بِالْبَيْتِثُمَّ حَجَّ أَبُو بَكْرٍ فَكَانَ أَوَّلَ شَيْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ ثُمَّ لَمْ يَكُنْ غَيْرُهُ ثُمَّ عُمَرُ مِثْلُ ذَلِكَ ثُمَّ حَجَّ عُثْمَانُ فَرَأَيْتُهُ أَوَّلُ شَيْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ ثُمَّ لَمْ يَكُنْ غَيْرُهُ ثُمَّ مُعَاوِيَةُ وَعَبْدُ اللَّهِ بْنُ عُمَرَ ثُمَّ حَجَجْتُ مَعَ أَبِي الزُّبَيْرِ بْنِ الْعَوَّامِ فَكَانَ أَوَّلَ شَيْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ ثُمَّ لَمْ يَكُنْ غَيْرُهُ ثُمَّ رَأَيْتُ الْمُهَاجِرِينَ وَالْأَنْصَارَ يَفْعَلُونَ ذَلِكَ ثُمَّ لَمْ يَكُنْ غَيْرُهُ ثُمَّ آخِرُ مَنْ رَأَيْتُ فَعَلَ ذَلِكَ ابْنُ عُمَرَ ثُمَّ لَمْ يَنْقُضْهَا بِعُمْرَةٍ وَهَذَا ابْنُ عُمَرَ عِنْدَهُمْ أَفَلَا يَسْأَلُونَهُ وَلَا أَحَدٌ مِمَّنْ مَضَى مَا كَانُوا يَبْدَءُونَ بِشَيْءٍ حِينَ يَضَعُونَ أَقْدَامَهُمْ أَوَّلَ مِنْ الطَّوَافِ بِالْبَيْتِ ثُمَّ لَا يَحِلُّونَ وَقَدْ رَأَيْتُ أُمِّي وَخَالَتِي حِينَ تَقْدَمَانِ لَا تَبْدَأَانِ بِشَيْءٍ أَوَّلَ مِنْ الْبَيْتِ تَطُوفَانِ بِهِ ثُمَّ لَا تَحِلَّانِ وَقَدْ أَخْبَرَتْنِي أُمِّي أَنَّهَا أَقْبَلَتْ هِيَ وَأُخْتُهَا وَالزُّبَيْرُ وَفُلَانٌ وَفُلَانٌ بِعُمْرَةٍ قَطُّ فَلَمَّا مَسَحُوا الرُّكْنَ حَلُّوا وَقَدْ كَذَبَ فِيمَا ذَكَرَ مِنْ ذَلِكَ",
                "id": "Telah menceritakan kepadaku [Harun bin Sa'id Al Aili] Telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru bin Al Harits] dari [Muhammad bin Abdurrahman] bahwa seorang laki-laki dari penduduk Irak berkata kepadanya, \"Tanyakanlah untukku kepada [Urwah bin Zubair] mengenai seorang laki-laki yang ihram untuk haji. Setelah ia melakukan thawaf di Baitullah, bolehkah ia bertahallul atau tidak. Jika ia menjawab boleh, maka katakanlah padanya, bahwa ada seseorang yang menjawab seperti itu.\" Muhammad bin Abdurrahman berkata; Maka aku pun menanyakan hal itu pada Urwah, lalu ia menjawab, \"Tidak boleh bagi tahallul bagi seorang yang ihram untuk haji kecuali dengan haji.\" Saya berkata, \"Sesungguhnya telah ada seseorang yang membolehkannya.\" Urwah berkata, \"Alangkah buruknya apa yang ia katakan.\" Kemudian laki-laki tadi merintangiku, maka aku pun menceritakan kepadanya (apa yang dikatakan Urwah). Lalu laki-laki itu berkata, \"Katakan kepadanya bahwa seseorang yang membolehkan itu mengabarkan bahwa Rasulullah shallallahu 'alaihi wasallam telah berbuat demikian, dan bagaimana dengan Asma` dan Zubair yang juga pernah melakukannya?\" Maka aku mendatangi Urwah dan menuturkan hal itu padanya, namun ia balik bertanya, \"Siapakah orang ini, kenapa ia tidak datang sendiri untuk menanyakannya? Menurut dugaanku ia adalah seorang penduduk Irak.\" Saya menjawab, \"Aku tidak tahu.\" Urwah berkata, \"Sesungguhnya ia telah berdusta. Rasulullah shallallahu 'alaihi wasallam telah menunaikan haji. Kemudian [Aisyah] telah mengabarkan kepadaku bahwa yang pertama kali dilakukan sesampainya beliau di Makkah adalah berwudlu, lalu beliau thawaf di Baitullah. Kemudian Abu Bakar juga pernah menunaikan haji, dan hal yang pertama kali diperbuatnya adalah thawaf di Baitullah, bukan dengan yang lainnya. Lalu Umar juga berbuat demikian. Setelah itu, Utsman menunaikan haji, lalu saya melihat yang pertama kali dilakukannya juga thawaf di Baitullah, bukan dengan yang lainnya. Sesudah itu Mu'awiyah dan Abdullah bin Umar. Dan aku juga pernah menunaikan haji bersama Abu Zubair bin Al Awwam, dan yang pertama kali dikerjakannya adalah thawaf di Baitullah, bukan dengan yang lainnya. Aku juga melihat kaum Muhajirin dan Anshar berbuat demikian, bukan dengan yang lainnya. Dan yang terakhir kali aku lihat berbuat seperti itu adalah Ibnu Umar, dan ia belum pernah membatalkannya dengan Umrah. Sekarang Ibnu Umar ada di tengah-tengah mereka, lalu kenapa mereka tidak bertanya kepadanya? Tidak seorang pun dari mereka yang telah mendahului kita yang tidak memulainya dengan thawaf di Baitullah saat pertama kali mereka menginjakkan kaki (di Makkah). Setelah itu, mereka tidak bertahallul. Sungguh, saya juga telah melihat ibu dan bibiku saat mereka sampai di Makkah, mereka tidak memulainya dengan ritual apa pun di Baitullah kecuali thawaf di Baitullah, kemudian mereka tidak bertahallul. Dan ibuku telah mengabarkan kepadaku, bahwa ia beserta saudaranya dan Az Zubair serta si Fulan dan Fulan pernah menunaikan umrah, dan ketika mereka telah membasuh rukun, mereka pun bertahallul. Dan sungguhnya seorang Irak tadi telah berdusta terhadap apa yang dikatakannya.\""
            },
            {
                "number": 2028,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لَهُ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَتْخَرَجْنَا مُحْرِمِينَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مَعَهُ هَدْيٌ فَلْيَقُمْ عَلَى إِحْرَامِهِ وَمَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ فَلْيَحْلِلْ فَلَمْ يَكُنْ مَعِي هَدْيٌ فَحَلَلْتُ وَكَانَ مَعَ الزُّبَيْرِ هَدْيٌ فَلَمْ يَحْلِلْ قَالَتْ فَلَبِسْتُ ثِيَابِي ثُمَّ خَرَجْتُ فَجَلَسْتُ إِلَى الزُّبَيْرِ فَقَالَ قُومِي عَنِّي فَقُلْتُ أَتَخْشَى أَنْ أَثِبَ عَلَيْكَو حَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ حَدَّثَنَا أَبُو هِشَامٍ الْمُغِيرَةُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَتْ قَدِمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ جُرَيْجٍ غَيْرَ أَنَّهُ قَالَ فَقَالَ اسْتَرْخِي عَنِّي اسْتَرْخِي عَنِّي فَقُلْتُ أَتَخْشَى أَنْ أَثِبَ عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] -dalam riwayat lain- Dan telah menceritakan kepadaku [Zuhair bin Harb] -lafazh juga miliknya- Telah menceritakan kepada kami [Rauh bin Ubadah] Telah menceritakan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Manshur bin Abdurrahman] dari [ibunya] Shafiyyah binti Syaibah, dari [Asma` binti Abu Bakr] radliallahu 'anhuma, ia berkata; Ketika kami ihram, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang membawa hadya (hewan kurban), hendaklah ia tetap dalam keadaan ihram. Dan siapa yang tidak membawa hadya, dia boleh bertahallul (berhenti ihram).\" Ketika itu, Zubair (suami Asma`) membawa hadya. Karena itu, dia tidak tahallul. Tetapi aku memakai pakaianku, lalu keluar dan duduk dekat Zubair. Maka Zubair berkata, \"Beranjaklah dariku.\" Aku pun berkata, \"Apakah kamu khawatir akan batal karena aku?\" Dan telah menceritakannya kepadaku [Abbas bin Abdul Azhim Al Anbari] Telah menceritakan kepada kami [Abu Hisyam Al Mughirah bin Salamah Al Makhzumi] Telah menceritakan kepada kami [Wuhaib] Telah menceritakan kepada kami [Manshur bin Abdurrahman] dari [ibunya] dari [Asma` binti Abu Bakar] radliallahu 'anhuma, ia berkata; Kami datang bersama Rasulullah shallallahu 'alaihi wasallam dalam keadaan ihram untuk haji. Kemudian ia pun menyebutkan seperti hadits Ibnu Juraij, hanya saja ia menyebutkan; (Zubair berkata), \"ISTARKHII 'ANNII, ISTARKHII 'ANNII (menjauhlah dariku, menjauhla dariku).\" Saya berkata, \"Apakah kamu khawatir akan batal karena aku?\""
            },
            {
                "number": 2029,
                "arab": "و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ أَبِي الْأَسْوَدِ أَنَّ عَبْدَ اللَّهِ مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُمَا حَدَّثَهُأَنَّهُ كَانَ يَسْمَعُ أَسْمَاءَ كُلَّمَا مَرَّتْ بِالْحَجُونِ تَقُولُ صَلَّى اللَّهُ عَلَى رَسُولِهِ وَسَلَّمَ لَقَدْ نَزَلْنَا مَعَهُ هَاهُنَا وَنَحْنُ يَوْمَئِذٍ خِفَافُ الْحَقَائِبِ قَلِيلٌ ظَهْرُنَا قَلِيلَةٌ أَزْوَادُنَا فَاعْتَمَرْتُ أَنَا وَأُخْتِي عَائِشَةُ وَالزُّبَيْرُ وَفُلَانٌ وَفُلَانٌ فَلَمَّا مَسَحْنَا الْبَيْتَ أَحْلَلْنَا ثُمَّ أَهْلَلْنَا مِنْ الْعَشِيِّ بِالْحَجِّقَالَ هَارُونُ فِي رِوَايَتِهِ أَنَّ مَوْلَى أَسْمَاءَ وَلَمْ يُسَمِّ عَبْدَ اللَّهِ",
                "id": "Dan telah meceritakan kepadaku [Harun bin Sa'id Al Aili] dan [Ahmad bin Isa] keduanya berkata, Telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru] dari [Abu Al Aswad] bahwa [Abdullah budak Asma' binti Abu Bakar] radliallahu 'anhuma, telah mengabarkan kepadanya bahwa dia mendengar [Asma'] setiap kali kali melewati Al Hajun, Asma` berkata, \"Shalawat dan salam semoga selalu tercurahkan kepada Rasul-Nya. Kami dulu pernah beristirahat bersama beliau di sini, dan ketika itu kami hanya membawa tas yang ringan, sedikit kendaraan dan juga perbekalan. Lalu aku melaksanakan umrah bersama-sama dengan saudara perempuanku 'Aisyah, Zubair, si fulan serta si fulan. Ketika kami telah mengusap Baitullah, kami pun bertahallul, lalu di siang hari kami berniat untuk melaksanakan haji.\" Dalam hadits yang diriwayatkannya Harun menyebutkan: bahwa budak Asma' (dst), dan ia tidak menyebutkan kalau namanya adalah Abdullah."
            },
            {
                "number": 2030,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا شُعْبَةُ عَنْ مُسْلِمٍ الْقُرِّيِّ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنْ مُتْعَةِ الْحَجِّ فَرَخَّصَ فِيهَا وَكَانَ ابْنُ الزُّبَيْرِ يَنْهَى عَنْهَافَقَالَ هَذِهِ أُمُّ ابْنِ الزُّبَيْرِ تُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِيهَا فَادْخُلُوا عَلَيْهَا فَاسْأَلُوهَا قَالَ فَدَخَلْنَا عَلَيْهَا فَإِذَا امْرَأَةٌ ضَخْمَةٌ عَمْيَاءُ فَقَالَتْ قَدْ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَاو حَدَّثَنَاه ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ ح و حَدَّثَنَاه ابْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ جَمِيعًا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ فَأَمَّا عَبْدُ الرَّحْمَنِ فَفِي حَدِيثِهِ الْمُتْعَةُ وَلَمْ يَقُلْ مُتْعَةُ الْحَجِّ وَأَمَّا ابْنُ جَعْفَرٍ فَقَالَ قَالَ شُعْبَةُ قَالَ مُسْلِمٌ لَا أَدْرِي مُتْعَةُ الْحَجِّ أَوْ مُتْعَةُ النِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim] Telah menceritakan kepada kami [Rauh bin Ubadah] Telah menceritakan kepada kami [Syu'bah] dari [Muslim Al Qurri] ia berkata; Saya bertanya kepada [Ibnu Abbas] radliallahu 'anhuma tentang Mut'atul Hajji (haji tamattu'), dan adapun Ibnu Az Zubair, maka ia melarang untuk melakukannya, maka Ibnu Umar menjawab, \"Ini [Ummu Zubair] yang menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam telah memberikan keringanan untuk melakukannya. Masuklah kalian, dan tanyakanlah kepadanya.\" Maka kami pun masuk menemuinya dan ternyata ia adalah seorang wanita yang besar tubuhnya dan buta. Ummu Zubair pun berkata, \"Rasulullah shallallahu 'alaihi wasallam telah memberikan Rukhshah (keringanan untuk melaksanakan haji tamattu').\" Dan Telah meceritakannya kepada kami [Ibnul Mutsanna] Telah menceritakan kepada kami [Abdurrahman] -dalam riwayat lain- Dan Telah meceritakannya kepada kami [Ibnu Basysyar] Telah menceritakan kepada kami [Muhammad bin Ja'far] semuanya dari [Syu'bah] dengan isnad ini. Adapun Abdurrahman, maka di dalam haditsnya tercantum; \"Al Mut'ah\" ia tidak menyebutnya; \"Mut'atul Hajji.\" Adapun Ibnu Ja'far, ia berkata; Syu'bah berkata, Muslim berkata, \"Tidak tahu, apakah Mu'atul Hajji ataukah Mut'atun Nisa`.\" "
            },
            {
                "number": 2031,
                "arab": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ حَدَّثَنَا مُسْلِمٌ الْقُرِّيُّ سَمِعَ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُاأَهَلَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُمْرَةٍ وَأَهَلَّ أَصْحَابُهُ بِحَجٍّ فَلَمْ يَحِلَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا مَنْ سَاقَ الْهَدْيَ مِنْ أَصْحَابِهِ وَحَلَّ بَقِيَّتُهُمْ فَكَانَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ فِيمَنْ سَاقَ الْهَدْيَ فَلَمْ يَحِلَّو حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ وَكَانَ مِمَّنْ لَمْ يَكُنْ مَعَهُ الْهَدْيُ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ وَرَجُلٌ آخَرُ فَأَحَلَّا",
                "id": "Dan Telah meceritakan kepada kami [ubaidhullah bin Mu'adz] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Syu'bah] Telah menceritakan kepada kami [Muslim Al Qurri] ia mendengar [Ibnu Abbas] radliallahu 'anhuma berkata; \"Nabi shallallahu 'alaihi wasallam ihram untuk umrah, sedangkan para sahabatnya ihram untuk haji, maka Nabi shallallahu 'alaihi wasallam tidak tahallul dan tidak pula mereka yang membawa hadya (hewan kurban). Sedangkan sisanya tahallul, dan Thalhah bin ubaidhullah termasuk mereka yang membawa hadya, sehingga ia tidak tahallul.\" Dan Telah meceritakannya kepada kami [Muhammad bin Basysyar] Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dengan isnad ini, hanya saja ia berkata; Dan di antara mereka yang tidak membawa hadya adalah Thalhah bin Zubair dan laki-laki lain namun keduanya tahallul (berhenti ihram)."
            },
            {
                "number": 2032,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَكَانُوا يَرَوْنَ أَنَّ الْعُمْرَةَ فِي أَشْهُرِ الْحَجِّ مِنْ أَفْجَرِ الْفُجُورِ فِي الْأَرْضِ وَيَجْعَلُونَ الْمُحَرَّمَ صَفَرًا وَيَقُولُونَ إِذَا بَرَأَ الدَّبَرْ وَعَفَا الْأَثَرْ وَانْسَلَخَ صَفَرْ حَلَّتْ الْعُمْرَةُ لِمَنْ اعْتَمَرْ فَقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ صَبِيحَةَ رَابِعَةٍ مُهِلِّينَ بِالْحَجِّ فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً فَتَعَاظَمَ ذَلِكَ عِنْدَهُمْ فَقَالُوا يَا رَسُولَ اللَّهِ أَيُّ الْحِلِّ قَالَ الْحِلُّ كُلُّهُ",
                "id": "Dan telah meceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Bahz] Telah menceritakan kepada kami [Wuhaib] Telah menceritakan kepada kami [Abdullah bin Thawus] dari [bapaknya] dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; Orang-orang jahiliyah menganggap bahwa umrah di bulan-bulan haji merupakan perbuatan yang paling keji di muka bumi. Dan mereka juga menganggap bulan Muharram sama dengan bulan Shafar. Mereka mengatakan, \"Apabila jama'ah haji sudah bubar (pulang), dan bulan shafar telah berlalu, maka baru boleh melakukan umrah (sunnah) bagi orang yang melakukan umrah wajib. Lalu pada bagi hari yang keempat, Nabi shallallahu 'alaihi wasallam datang dengan para sahabatnya (dalam bulan-bulan haji) untuk berihram haji, tetapi kemudian beliau menyuruh para sahabat agar menjadikan ihram tersebut sebagai umrah, sehingga hal itu sangat penting bagi mereka. Mereka bertanya, \"Wahai Rasulullah, nanti kita bertahallul apa?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tahallul keseluruhan.\""
            },
            {
                "number": 2033,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ أَيُّوبَ عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُاأَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ فَقَدِمَ لِأَرْبَعٍ مَضَيْنَ مِنْ ذِي الْحِجَّةِ فَصَلَّى الصُّبْحَ وَقَالَ لَمَّا صَلَّى الصُّبْحَ مَنْ شَاءَ أَنْ يَجْعَلَهَا عُمْرَةً فَلْيَجْعَلْهَا عُمْرَةًو حَدَّثَنَاه إِبْرَاهِيمُ بْنُ دِينَارٍ حَدَّثَنَا رَوْحٌ ح و حَدَّثَنَا أَبُو دَاوُدَ الْمُبَارَكِيُّ حَدَّثَنَا أَبُو شِهَابٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ كُلُّهُمْ عَنْ شُعْبَةَ فِي هَذَا الْإِسْنَادِ أَمَّا رَوْحٌ وَيَحْيَى بْنُ كَثِيرٍ فَقَالَا كَمَا قَالَ نَصْرٌ أَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ وَأَمَّا أَبُو شِهَابٍ فَفِي رِوَايَتِهِ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُهِلُّ بِالْحَجِّ وَفِي حَدِيثِهِمْ جَمِيعًا فَصَلَّى الصُّبْحَ بِالْبَطْحَاءِ خَلَا الْجَهْضَمِيَّ فَإِنَّهُ لَمْ يَقُلْهُ",
                "id": "Telah menceritakan kepada kami [Nashru bin Ali Al Jahdlami] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Syu'bah] dari [Ayyub] dari [Abul 'Aliyah Al Barra`] bahwa ia mendengar [Ibnu Abbas] radliallahu 'anhuma berkata; Rasulullah shallallahu 'alaihi wasallam ihram untuk haji dan tiba di Makkah pada tanggal empat Dzulhijjah. Setelah selesai sholat Shubuh, beliau bersabda: \"Siapa yang hendak menjadikan haji ini umrah, maka silahkan.\" Dan Telah meceritakannya kepada kami [Ibrahim bin Dinar] Telah menceritakan kepada kami [Rauh] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Abu Dawud Al Mubaraki] Telah menceritakan kepada kami [Abu Syihab] -dalam riwayat lain- Dan Telah meceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Yahya bin Katsir] semuanya dari [Syu'bah] dalam isnad ini. Adapun Rauh dan Yahya bin Katsir, maka keduanya mengatakan sebagaimana Nashru berkata; \"AHALLA RASULULLAH SHALLALLAHU 'ALAIHI WASALLAM BILHAJJI (Rasulullah shallallahu 'alaihi wasallam melakukan Ihram untuk haji).\" Adapun Abu Syihab, maka di dalam riwayatnya ia menyebutkan; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam dan kami ihram untuk haji.\" Sedangkan di dalam hadits mereka tercantum; \"Beliau sholat Shubuh di Bathha`.\" Selain Al Jahdlami, karena ia tidak menyebutkannya."
            },
            {
                "number": 2034,
                "arab": "و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ السَّدُوسِيُّ حَدَّثَنَا وُهَيْبٌ أَخْبَرَنَا أَيُّوبُ عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ لِأَرْبَعٍ خَلَوْنَ مِنْ الْعَشْرِ وَهُمْ يُلَبُّونَ بِالْحَجِّ فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً",
                "id": "Dan Telah meceritakan kepada kami [Harun bin Abdullah] Telah menceritakan kepada kami [Muhammad bin Al Fadll As Sadusi] Telah menceritakan kepada kami [Wuhaib] telah mengabarkan kepada kami [Ayyub] dari [Abul Aliyah Al Barra`] dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; \"Nabi shallallahu 'alaihi wasallam sampai di Makkah pada tanggal empat Dzulhijjah dan mereka ihram untuk haji, lalu belau memerintahkan mereka untuk menjadikannya sebagai umrah.\""
            },
            {
                "number": 2035,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ بِذِي طَوًى وَقَدِمَ لِأَرْبَعٍ مَضَيْنَ مِنْ ذِي الْحِجَّةِ وَأَمَرَ أَصْحَابَهُ أَنْ يُحَوِّلُوا إِحْرَامَهُمْ بِعُمْرَةٍ إِلَّا مَنْ كَانَ مَعَهُ الْهَدْيُ",
                "id": "Dan Telah meceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] dari [Abul Aliyah] dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat Shubuh di Dzuthuwa, dan beliau sampai di Makkah pada tanggal empat Dzulhijjah. Kemudian beliau memerintahkan para sahabatnya agar menjadikan ihram mereka untuk umrah, kecuali bagi yang membawa hadya (hewan kurban).\""
            },
            {
                "number": 2036,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ عُمْرَةٌ اسْتَمْتَعْنَا بِهَا فَمَنْ لَمْ يَكُنْ عِنْدَهُ الْهَدْيُ فَلْيَحِلَّ الْحِلَّ كُلَّهُ فَإِنَّ الْعُمْرَةَ قَدْ دَخَلَتْ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Dan Telah meceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu bin Basysyar] keduanya berkata, Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] -dalam riwayat lain- dan telah menceritakan kepada kami [ubaidhullah bin Muadz] lafad ini darinya, telah menceritakan kepada kami [Bapakku] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Mujahid] dari [Ibnu Abbas radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Umrah ini kita kerjakan sebelum haji. Siapa yang membawa hadya, dia boleh tahallul seluruhnya, namun umrah itu termasuk ibadah haji sampai hari kiamat.\""
            },
            {
                "number": 2037,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا جَمْرَةَ الضُّبَعِيَّ قَالَ تَمَتَّعْتُ فَنَهَانِي نَاسٌ عَنْ ذَلِكَ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَسَأَلْتُهُ عَنْ ذَلِكَ فَأَمَرَنِي بِهَاقَالَ ثُمَّ انْطَلَقْتُ إِلَى الْبَيْتِ فَنِمْتُ فَأَتَانِي آتٍ فِي مَنَامِي فَقَالَ عُمْرَةٌ مُتَقَبَّلَةٌ وَحَجٌّ مَبْرُورٌ قَالَ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَأَخْبَرْتُهُ بِالَّذِي رَأَيْتُ فَقَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ سُنَّةُ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] keduanya berkata, Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Abu Jamrah Adl Dluba'i] berkata; Aku melakukan haji tamattu', lalu orang-orang pun melarangku untuk melakukannya. Maka aku menemui [Ibnu Abbas] dan menanyakan hal itu padanya. Lalu beliau memerintahkanku untuk tetap melakukannya. Kemudian aku pulang ke rumah dan tidur. Lalu aku bermimpi didatangi oleh seseorang dan berkata, \"Umrah Mutaqabbalah (diterima) dan haji mabrur.\" Sesudah itu, akau menemui Ibnu Abbas dan mengabarkan kepadanya tentang apa yang kulihat dalam mimpiku, maka ia pun berkata; \"ALLAHU AKBAR, ALLAHU AKBAR (Allah Maha Besar, Allah Maha Besar) itulah sunnah Abul Qasim shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2038,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ جَمِيعًا عَنْ ابْنِ أَبِي عَدِيٍّ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَبِي حَسَّانَ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِذِي الْحُلَيْفَةِ ثُمَّ دَعَا بِنَاقَتِهِ فَأَشْعَرَهَا فِي صَفْحَةِ سَنَامِهَا الْأَيْمَنِ وَسَلَتَ الدَّمَ وَقَلَّدَهَا نَعْلَيْنِ ثُمَّ رَكِبَ رَاحِلَتَهُ فَلَمَّا اسْتَوَتْ بِهِ عَلَى الْبَيْدَاءِ أَهَلَّ بِالْحَجِّحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ فِي هَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ شُعْبَةَ غَيْرَ أَنَّهُ قَالَ إِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَتَى ذَا الْحُلَيْفَةِ وَلَمْ يَقُلْ صَلَّى بِهَا الظُّهْرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [ibnu Basysyar] semuanya dari [Ibnu Abu Adi] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Ibnu Abu Adi] dari [Syu'bah] dari [Qatadah] dari [Abu Hassan] dari [Ibnu Abbas] radliallahu 'anhuma, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat Zhuhur di Dzulhulaifah, kemudian beliau meminta agar diambilkan untanya (hewan kurban), lalu diberinya tanda di punuk kanan unta itu sampai berdarah, kemudian dikalungkannya sepasang terompah di tengkuknya, sampai di Baida`. Barulah beliau ihram untuk haji.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [bapakku] dari [Qatadah] dalam isnad ini, dan semakna dengan haditsnya Syu'bah, hanya saja ia berkata; \"Ketika Nabi shallallahu 'alaihi wasallam sampai di Dzulhulaifah.\" Ia tidak mengatakan; \"Beliau sholat Zhuhur.\""
            },
            {
                "number": 2039,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَبَا حَسَّانَ الْأَعْرَجَ قَالَقَالَ رَجُلٌ مِنْ بَنِي الْهُجَيْمِ لِابْنِ عَبَّاسٍ مَا هَذَا الْفُتْيَا الَّتِي قَدْ تَشَغَّفَتْ أَوْ تَشَغَّبَتْ بِالنَّاسِ أَنَّ مَنْ طَافَ بِالْبَيْتِ فَقَدْ حَلَّ فَقَالَ سُنَّةُ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنْ رَغِمْتُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Muhammad bin Ja'far] ia berkata, Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] ia berkata, saya mendengar [Abu Hassan Al A'raj] berkata; Seorang laki-laki dari Bani Al Hujam bertanya kepada [Ibnu Abbas], \"Bagaimana dengan fatwa yang telah menyatu dengan hati banyak orang, bahwa siapa yang thawaf di Baitullah, maka ia telah tahallul.\" Ibnu Abbas berkata, \"Sunnah Nabi kalian shallallahu 'alaihi wasallam, meskipun kalian tidak menyukainya.\""
            },
            {
                "number": 2040,
                "arab": "و حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى عَنْ قَتَادَةَ عَنْ أَبِي حَسَّانَ قَالَقِيلَ لِابْنِ عَبَّاسٍ إِنَّ هَذَا الْأَمْرَ قَدْ تَفَشَّغَ بِالنَّاسِ مَنْ طَافَ بِالْبَيْتِ فَقَدْ حَلَّ الطَّوَافُ عُمْرَةٌ فَقَالَ سُنَّةُ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنْ رَغَمْتُمْ",
                "id": "Dan telah menceritakan kepadaku [Ahmad bin Sa'id Ad Darimi] Telah menceritakan kepada kami [Ahmad bin Ishaq] Telah menceritakan kepada kami [Hammam bin Yahya] dari [Qatadah] dari [Abu Hassan] ia berkata, dikatakan kepada [Ibnu Abbas], \"Sesungguhnya perkara ini telah menyebar di tengah-tengah manusia, bahwa siapa yang thawaf di Baitullah maka ia telah tahallul.\" Maka Ibnu Abbas berkata, \"Itu adalah sunnah Nabi kalian shallallahu 'alaihi wasallam, meskipun kalian tidak suka.\""
            },
            {
                "number": 2041,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ قَالَ كَانَ ابْنُ عَبَّاسٍ يَقُولُا لَا يَطُوفُ بِالْبَيْتِ حَاجٌّ وَلَا غَيْرُ حَاجٍّ إِلَّا حَلَّ قُلْتُ لِعَطَاءٍ مِنْ أَيْنَ يَقُولُ ذَلِكَ قَالَ مِنْ قَوْلِ اللَّهِ تَعَالَى{ ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ }قَالَ قُلْتُ فَإِنَّ ذَلِكَ بَعْدَ الْمُعَرَّفِ فَقَالَ كَانَ ابْنُ عَبَّاسٍ يَقُولُ هُوَ بَعْدَ الْمُعَرَّفِ وَقَبْلَهُوَكَانَ يَأْخُذُ ذَلِكَ مِنْ أَمْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَمَرَهُمْ أَنْ يَحِلُّوا فِي حَجَّةِ الْوَدَاعِ",
                "id": "Dan Telah meceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] ia berkata; \"Tidaklah seorang haji melakukan thawaf di Baitullah dan tidak pula seorang yang tidak haji kecuali ia telah tahallul.\" Saya bertanya kepada Atha`, \"Atas dasar apa yang berkata seperti itu?\" Ia menjawab, \"Dari firman Allah Ta'ala: \"Kemudian tempat wajib (serta akhir masa) menyembelihnya ialah setelah sampai ke Baitul Atiq (Baitullah).\" (QS. Alhajj 33). Aku berkata, \"Sesungguhnya hal itu adalah setelah wukuf di Arafah.\" Atha` berkata, \" [Ibnu Abbas] telah mengatakan bahwa hal itu adalah setelah dan sesudah wukuf di Arafah. Dan ia mengambil hal itu dari perkara Nabi shallallahu 'alaihi wasallam, saat beliau memerintahkan mereka untuk tahallul pada haji wada'.\""
            },
            {
                "number": 2042,
                "arab": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامِ بْنِ حُجَيْرٍ عَنْ طَاوُسٍ قَالَ قَالَ ابْنُ عَبَّاسٍ قَالَ لِي مُعَاوِيَةُأَعَلِمْتَ أَنِّي قَصَّرْتُ مِنْ رَأْسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ الْمَرْوَةِ بِمِشْقَصٍ فَقُلْتُ لَهُ لَا أَعْلَمُ هَذَا إِلَّا حُجَّةً عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [Amru An Naqid] Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Hisyam bin Hujr] dari [Thawus] ia berkata, [Ibnu Abbas] berkata; [Mu'awiyah] berkata kepadaku, \"Tahukah Anda, bahwa aku telah menggunting rambut Rasulullah shallallahu 'alaihi wasallam di Marwa?\" aku menjawab, \"Aku tidak tahu akan ini kecuali ia merupakan hujjah yang bakalan menuntutmu.\""
            },
            {
                "number": 2043,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي الْحَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ أَخْبَرَهُ قَالَقَصَّرْتُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِشْقَصٍ وَهُوَ عَلَى الْمَرْوَةِ أَوْ رَأَيْتُهُ يُقَصَّرُ عَنْهُ بِمِشْقَصٍ وَهُوَ عَلَى الْمَرْوَةِ",
                "id": "Dan telah meceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] telah menceritakan kepadaku [Al Hasan bin Muslim] dari [Thawus] dari [Ibnu Abbas] bahwa [Mu'awiyah bin Abu Sufyan] telah mengabarkan kepadanya, ia berkata; \"Aku pernah menggunting rambut Rasulullah shallallahu 'alaihi wasallam ketika beliau berada di Marwa.\" Atau aku melihatnya menggunting rambut beliau dan saat itu beliau berada di Marwa."
            },
            {
                "number": 2044,
                "arab": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا دَاوُدُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَصْرُخُ بِالْحَجِّ صُرَاخًا فَلَمَّا قَدِمْنَا مَكَّةَ أَمَرَنَا أَنْ نَجْعَلَهَا عُمْرَةً إِلَّا مَنْ سَاقَ الْهَدْيَ فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ وَرُحْنَا إِلَى مِنًى أَهْلَلْنَا بِالْحَجِّ",
                "id": "Telah menceritakan kepadaku [ubaidhullah bin Umar Al Qawariri] Telah menceritakan kepada kami [Abdul A'la bin Abdul A'la] Telah menceritakan kepada kami [Dawud] dari [Abu Nadlrah] dari [Abu Sa'id] ia berkata; Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam dengan menyuarakan ihram untuk haji. Dan ketika kami sampai di Makkah, beliau memerintahkan kami untuk menjadikannya sebagai Umrah, kecuali bagi mereka yang membawa hadya (hewan kurban). Ketika hari Tarwiyah tiba dan kami pergi ke Mina, maka kami pun ihram untuk haji.\""
            },
            {
                "number": 2045,
                "arab": "و حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ عَنْ دَاوُدَ عَنْ أَبِي نَضْرَةَ عَنْ جَابِرٍ وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُمَا قَالَاقَدِمْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَصْرُخُ بِالْحَجِّ صُرَاخًا",
                "id": "Dan Telah meceritakan kepada kami [Hajjaj bin Sya'ir] Telah menceritakan kepada kami [Mu'alla bin Asad] Telah menceritakan kepada kami [Wuhaib bin Khalid] dari [Dawud] dari [Abu Nadlrah] dari [Jabir] dan dari [Abu Sa'id Al Khudri] radliallahu 'anhuma, keduanya berkata; \"Kami pergi bersama Nabi shallallahu 'alaihi wasallam dengan melantunkan ihram untuk haji.\""
            },
            {
                "number": 2046,
                "arab": "حَدَّثَنِي حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ عَنْ عَاصِمٍ عَنْ أَبِي نَضْرَةَ قَالَكُنْتُ عِنْدَ جَابِرِ بْنِ عَبْدِ اللَّهِ فَأَتَاهُ آتٍ فَقَالَ إِنَّ ابْنَ عَبَّاسٍ وَابْنَ الزُّبَيْرِ اخْتَلَفَا فِي الْمُتْعَتَيْنِ فَقَالَ جَابِرٌ فَعَلْنَاهُمَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ نَهَانَا عَنْهُمَا عُمَرُ فَلَمْ نَعُدْ لَهُمَا",
                "id": "Telah menceritakan kepadaku [Hamid bin Umar Al Bakrawi] Telah menceritakan kepada kami [Abdul Wahid] dari [Ashim] dari [Abu Nadlrah] ia berkata; Aku berada di sisi [Jabir bin Abdullah], lalu ia didatangi oleh seseorang dan berkata, \"Sesungguhnya Ibnu Abbas dan Ibnu Zubair berselisih mengenai dua Mut'ah (haji tamattu' dan nikah mut'ah).\" Maka Jabir pun berkata, \"Kami pernah melakukan keduanya bersama Rasulullah shallallahu 'alaihi wasallam, kemudian Umar melarang kami, sehingga kami tidak lagi mengulangi keduanya.\""
            },
            {
                "number": 2047,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا ابْنُ مَهْدِيٍّ حَدَّثَنِي سَلِيمُ بْنُ حَيَّانَ عَنْ مَرْوَانَ الْأَصْفَرِ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُأَنَّ عَلِيًّا قَدِمَ مِنْ الْيَمَنِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَ أَهْلَلْتَ فَقَالَ أَهْلَلْتُ بِإِهْلَالِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْلَا أَنَّ مَعِي الْهَدْيَ لَأَحْلَلْتُو حَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عَبْدُ الصَّمَدِ ح و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمٍ حَدَّثَنَا بَهْزٌ قَالَا حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي رِوَايَةِ بَهْزٍ لَحَلَلْتُ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepadaku [Salim bin Hayyan] dari [Marwan Al Ashfar] dari [Anas] radliallahu 'anhu, bahwa Ali kembali dari negeri Yaman, lalu Nabi shallallahu 'alaihi wasallam bertanya kepadanya: \"Dengan bacaan apa kamu Ihlal (memulai ihram)?\" Ali menjawab, \"Saya memulai ihram dengan ihlal Nabi shallallahu 'alaihi wasallam.\" beliau bersabda: \"Sekiranya aku tidak membawa hadya (hewan kurban) niscaya aku akan tahallul.\" Dan telah meceritakannya kepadaku [Hajjaj bin Sya'ir] Telah menceritakan kepada kami [Abdush Shamad] -dalam riwayat lain- Dan telah menceritakan kepadaku [Abdullah bin Hasyim] Telah menceritakan kepada kami [Bahz] keduanya berkata, Telah menceritakan kepada kami [Salim bin Hayyan] dengan isnad ini, semisalnya. Hanya saja, di dalam riwayat Bahz ia mencantumkan; \"LAHALALLTU (niscaya aku akan bertahallul).\""
            },
            {
                "number": 2048,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ يَحْيَى بْنِ أَبِي إِسْحَقَ وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ وَحُمَيْدٍ أَنَّهُمْ سَمِعُوا أَنَسًا رَضِيَ اللَّهُ عَنْهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ بِهِمَا جَمِيعًا لَبَّيْكَ عُمْرَةً وَحَجًّا لَبَّيْكَ عُمْرَةً وَحَجًّا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] dari [Yahya bin Abu Ishaq] dan [Abdul Aziz bin Shuhaib] dan [Humaid] bahwa mereka mendengar [Anas] radliallahu 'anhu berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam ihram untuk haji dan umrah sekaligus: \"LABBAIKA UMRATAN WA HAJJAN LABBAIKA UMRATAN WA HAJJAN (Ya Allah, aku penuhi panggilan-Mu, untuk umrah dan haji. Ya Allah, aku penuhi panggilan-Mu, untuk umrah dan haji).\""
            },
            {
                "number": 2049,
                "arab": "و حَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ يَحْيَى بْنِ أَبِي إِسْحَقَ وَحُمَيْدٍ الطَّوِيلِ قَالَ يَحْيَى سَمِعْتُ أَنَسًا يَقُولُاسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَبَّيْكَ عُمْرَةً وَحَجًّاو قَالَ حُمَيْدٌ قَالَ أَنَسٌ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَبَّيْكَ بِعُمْرَةٍ وَحَجٍّ",
                "id": "Dan telah menceritakannya padaku [Ali bin Hujr] telah mengabarkan kepada kami [Isma'il bin Ibrahim] dari [Yahya bin Abu Ishaq] dan [Humaid Ath Thawil] - [Yahya] berkata- Saya mendengar [Anas] berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam mengucapkan: \"LABBAIKA 'UMRATAN WA HAJJAN (Ya Allah, aku memenuhi panggilan-Mu untuk Umrah dan Haji).\" -sementara Humaid berkata- Anas berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam membaca: \"LABBAIKA BI'UMRATIN WAHAJJIN (Ya Allah, aku memenuhi panggilan-Mu untuk Umrah dan Haji).\""
            },
            {
                "number": 2050,
                "arab": "و حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ سَعِيدٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنِي الزُّهْرِيُّ عَنْ حَنْظَلَةَ الْأَسْلَمِيِّ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَيُهِلَّنَّ ابْنُ مَرْيَمَ بِفَجِّ الرَّوْحَاءِ حَاجًّا أَوْ مُعْتَمِرًا أَوْ لَيَثْنِيَنَّهُمَاو حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ قَالَ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ و حَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ حَنْظَلَةَ بْنِ عَلِيٍّ الْأَسْلَمِيِّ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ يَقُولُا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ بِمِثْلِ حَدِيثِهِمَا",
                "id": "Dan Telah meceritakan kepada kami [Sa'id bin Manshur] dan [Amru An Naqid] dan [Zuhair bin Harb] semuanya dari [Ibnu Uyainah] - [Sa'id] berkata- Telah menceritakan kepada kami [Sufyan bin Uyainah] telah menceritakan kepadaku [Az Zuhri] dari [Hanzhalah Al Aslami] ia berkata, saya mendengar [Abu Hurairah] radliallahu 'anhu menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Demi Dzat yang jiwaku berada di Tangan-Nya, Ibnu Maryam benar-benar bertalbiyah memulai ihram di Fajjurraiha` dengan niat haji atau umrah, atau ia menggabunggkan keduanya.\" Dan Telah menceritakannya kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dengan isnad ini, semisalnya. Ia menyebutkan; \"Demi Dzat yang jiwa Muhammad ada di Tangan-Nya.\" Dan telah menceritakannya kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Hanzhalah bin Ali Aslami] bahwa ia mendengar [Abu Hurairah] radliallahu 'anhu, berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di Tangan-Nya.\" Yakni serupa dengan hadits keduanya."
            },
            {
                "number": 2051,
                "arab": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ أَنَّ أَنَسًا رَضِيَ اللَّهُ عَنْهُ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَمَرَ أَرْبَعَ عُمَرٍ كُلُّهُنَّ فِي ذِي الْقَعْدَةِ إِلَّا الَّتِي مَعَ حَجَّتِهِ عُمْرَةً مِنْ الْحُدَيْبِيَةِ أَوْ زَمَنَ الْحُدَيْبِيَةِ فِي ذِي الْقَعْدَةِ وَعُمْرَةً مِنْ الْعَامِ الْمُقْبِلِ فِي ذِي الْقَعْدَةِ وَعُمْرَةً مِنْ جِعْرَانَةَ حَيْثُ قَسَمَ غَنَائِمَ حُنَيْنٍ فِي ذِي الْقَعْدَةِ وَعُمْرَةً مَعَ حَجَّتِهِحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ قَالَ سَأَلْتُ أَنَسًا كَمْ حَجَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَجَّةً وَاحِدَةً وَاعْتَمَرَ أَرْبَعَ عُمَرٍ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ هَدَّابٍ",
                "id": "Telah menceritakan kepada kami [Haddab bin Khalid] Telah menceritakan kepada kami [Hammam] Telah menceritakan kepada kami [Qatadah] bahwa [Anas] radliallahu 'anhu telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam melakukan umrah sebanyak empat kali, semuanya beliau lakukan di bukan Dzulqa'dah kecuali umrah yang beliau kerjakan bersamaan dengan hajinya, yaitu umrah dari Hudaibiyah atau Umrah pada zaman Hudaibiyah tepatnya pada bulan Dzulqa'dah, dan umrah pada tahun sesudah itu juga dalam bulan Dzulqa'dah. Kemudian umrah yang beliau lakukan dari Ji'ranah ketika membagi-bagikan harta rampasan perang Hunain, juga di bulan Dzulqa'dah, dan sesudah itu umrah yang beliau lakukan bersamaan dengan haji. Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepadaku [Abdush Shamad] Telah menceritakan kepada kami [Hammam] Telah menceritakan kepada kami [Qatadah] ia berkata; Saya bertanya kepada [Anas], \"Berapa kali Rasulullah shallallahu 'alaihi wasallam mengerjakan ibadah haji?\" Anas menjawab, \"Beliau mengerjakan haji hanya sekali, dan umrah sebanyak empat kali.\" Kemudian ia pun menyebutkan hadits sebagaimana hadits Haddab."
            },
            {
                "number": 2052,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى أَخْبَرَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ قَالَ سَأَلْتُ زَيْدَ بْنَ أَرْقَمَكَمْ غَزَوْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَبْعَ عَشْرَةَ قَالَ وَحَدَّثَنِي زَيْدُ بْنُ أَرْقَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزَا تِسْعَ عَشْرَةَ وَأَنَّهُ حَجَّ بَعْدَ مَا هَاجَرَ حَجَّةً وَاحِدَةً حَجَّةَ الْوَدَاعِقَالَ أَبُو إِسْحَقَ وَبِمَكَّةَ أُخْرَى",
                "id": "Dan telah meceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Al Hasan bin Musa] telah mengabarkan kepada kami [Zuhair] dari [Abu Ishaq] ia berkata; saya bertanya kepada [Zaid bin Arqam], \"Berapa kali Anda berperang bersama dengan Rasulullah shallallahu 'alaihi wasallam?\" Ia menjawab, \"Tujuh belas kali.\" Abu Ishaq berkata; Dan telah menceritakan kepadaku Zaid bin Arqam bahwa Rasulullah shallallahu 'alaihi wasallam telah berperang sebanyak sembilan belas kali, dan setelah hijrah beliau mengerjakan haji hanya sekali, yaitu haji wada'. Abu Ishaq berkata; Dan lain lagi ketika beliau masih di Makkah."
            },
            {
                "number": 2053,
                "arab": "و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ عَطَاءً يُخْبِرُ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ قَالَكُنْتُ أَنَا وَابْنُ عُمَرَ مُسْتَنِدَيْنِ إِلَى حُجْرَةِ عَائِشَةَ وَإِنَّا لَنَسْمَعُ ضَرْبَهَا بِالسِّوَاكِ تَسْتَنُّ قَالَ فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ اعْتَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَجَبٍ قَالَ نَعَمْ فَقُلْتُ لِعَائِشَةَ أَيْ أُمَّتَاهُ أَلَا تَسْمَعِينَ مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ قَالَتْ وَمَا يَقُولُ قُلْتُ يَقُولُ اعْتَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَجَبٍ فَقَالَتْ يَغْفِرُ اللَّهُ لِأَبِي عَبْدِ الرَّحْمَنِ لَعَمْرِي مَا اعْتَمَرَ فِي رَجَبٍ وَمَا اعْتَمَرَ مِنْ عُمْرَةٍ إِلَّا وَإِنَّهُ لَمَعَهُ قَالَ وَابْنُ عُمَرَ يَسْمَعُ فَمَا قَالَ لَا وَلَا نَعَمْ سَكَتَ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah mengabarkan kepada kami [Muhammad bin Bakr Al Bursani] telah mengabarkan kepada kami [Ibnu Juraij] ia berkata, saya mendengar [Atha`] mengabarkan, ia berkata, telah mengabarkan kepadaku [Urwah bin Zubair] ia berkata; Saya dan Ibnu Zubair bersandar ke dinding kamar Aisyah, dan saat itu kami mendengar bunyi siwaknya. Kemudian aku bertanya kepada [Ibnu Umar], \"Wahai Abu Abdurrahman, apakah Nabi shallallahu 'alaihi wasallam pernah mengerjakan umrah di bulan Rajab? ' Ia menjawab, \"Ya, pernah.\" Lalu aku bertanya kepada Aisyah, \"Wahai Ummul Mukminin, tidakkah Anda mendengar apa yang dikatakan oleh Abu Abdurrahman?\" [Aisyah] balik bertanya, \"Memangnya apa yang ia katakan?\" Saya menjawab, \"Ia berkata bahwa Nabi shallallahu 'alaihi wasallam pernah mengerjakan umrah di bulan Rajab.\" Maka Aisyah pun berkata, \"Semoga Allah mengampuni Abu Abdurrahman. Beliau tidak pernah umrah di bulan Rajab, dan tidaklah beliau mengerjakan umrah kecuali selalu bersamanya.\" Atha` berkata, \"Ibnu Umar pasti mendengarnya, lalu apa komentarnya?\" Urwah bin Zubair menjawab, \"Ia tidak membantah dan tidak pula mengiyakan. Ia hanya terdiam.\""
            },
            {
                "number": 2054,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ قَالَ دَخَلْتُ أَنَا وَعُرْوَةُ بْنُ الزُّبَيْرِ الْمَسْجِدَ فَإِذَا عَبْدُ اللَّهِ بْنُ عُمَرَ جَالِسٌ إِلَى حُجْرَةِ عَائِشَةَ وَالنَّاسُ يُصَلُّونَ الضُّحَى فِي الْمَسْجِدِ فَسَأَلْنَاهُ عَنْ صَلَاتِهِمْ فَقَالَ بِدْعَةٌ فَقَالَ لَهُ عُرْوَةُ يَا أَبَا عَبْدِ الرَّحْمَنِ كَمْ اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَرْبَعَ عُمَرٍ إِحْدَاهُنَّ فِي رَجَبٍ فَكَرِهْنَا أَنْ نُكَذِّبَهُ وَنَرُدَّ عَلَيْهِ وَسَمِعْنَا اسْتِنَانَ عَائِشَةَ فِي الْحُجْرَةِ فَقَالَ عُرْوَةُ أَلَا تَسْمَعِينَ يَا أُمَّ الْمُؤْمِنِينَ إِلَى مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ فَقَالَتْ وَمَا يَقُولُ قَالَيَقُولُ اعْتَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ عُمَرٍ إِحْدَاهُنَّ فِي رَجَبٍ فَقَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ مَا اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا وَهُوَ مَعَهُ وَمَا اعْتَمَرَ فِي رَجَبٍ قَطُّ",
                "id": "Dan Telah meceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dari [Manshur] dari [Mujahid] ia berkata; Saya dan Urwah bin Zubair masuk Masjid, dan kami dapati ['Abdullah bin Umar] duduk di sisi kamar [Aisyah] sementara orang-orang sedang melaksanakan sholat Dluha di Masjid. Lalu kami bertanya kepada Ibnu Umar mengenai sholat yang mereka kerjakan itu, Maka Ibnu Umar pun menjawab: \"Itu adalah Bid'ah.\" Lalu Urwah bertanya kepadanya, \"Wahai Abu Abdurrahman, berapa kali Rasulullah shallallahu 'alaihi wasallam melakukan umrah?\" Ibnu Umar menjawab, \"Empat kali umrah, satu diantaranya adalah di bulan Rajab.\" Mendengar jawabannya, kami tidak enak untuk mendustakan dan membantahnya. Kemudian kami mendengar Aisyah yang sedang bersiwak di dalam kamar, maka Urwah pun bertanya, \"Bukankah Anda telah mendengar apa yang dikatakan oleh Abu Abdurrahman wahai Ummul Mukminin?\" Aisyah balik bertanya, \"Emang apa yang dikatakannya?\" Urwah berkata, \"Ia berkata, bahwa Nabi shallallahu 'alaihi wasallam telah melakukan umrah sebanyak empat kali, satu diantaranya adalah pada bulan Rajab.\" Aisyah berkata, \"Semoga Allah merahmati Abu Abdirrahman, tidaklah Rasulullah shallallahu 'alaihi wasallam melakukan umrah kecuali selau bersamanya, dan beliau sama sekali tidak pernah umrah di bulan Rajab.\""
            },
            {
                "number": 2055,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يُحَدِّثُنَا قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِامْرَأَةٍ مِنْ الْأَنْصَارِ سَمَّاهَا ابْنُ عَبَّاسٍ فَنَسِيتُ اسْمَهَا مَا مَنَعَكِ أَنْ تَحُجِّي مَعَنَا قَالَتْ لَمْ يَكُنْ لَنَا إِلَّا نَاضِحَانِ فَحَجَّ أَبُو وَلَدِهَا وَابْنُهَا عَلَى نَاضِحٍ وَتَرَكَ لَنَا نَاضِحًا نَنْضِحُ عَلَيْهِ قَالَ فَإِذَا جَاءَ رَمَضَانُ فَاعْتَمِرِي فَإِنَّ عُمْرَةً فِيهِ تَعْدِلُ حَجَّةً",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim bin Maimun] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Atha`] ia berkata, saya mendengar [Ibnu Abbas] menceritakan kepada kami, ia berkata; Rasulullah shallallahu 'alaihi wasallam bertanya kepada seorang wanita dari kalangan Anshar -Ibnu Abbas menyebutkan namnya, tetapi aku lupa: \"Apa yang menghalangimu untuk melaksanakan haji bersama kami?\" wanita itu menjawab, \"Kami tidak mempunyai apa-apa kecuali dua ekor Unta, yang satu ekor dipakai suamiku pergi haji bersama anaknya sedangkan yang satu lagi ia tinggalkan agar dipakai menyiram kebun.\" Beliau bersabda: \"Kalau bulan ramadhan tiba, maka tunaikanlah umrah, sebab umrah di bulan ramadhan menyamai ibadah haji.\""
            },
            {
                "number": 2056,
                "arab": "و حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِامْرَأَةٍ مِنْ الْأَنْصَارِ يُقَالُ لَهَا أُمُّ سِنَانٍ مَا مَنَعَكِ أَنْ تَكُونِي حَجَجْتِ مَعَنَا قَالَتْ نَاضِحَانِ كَانَا لِأَبِي فُلَانٍ زَوْجِهَا حَجَّ هُوَ وَابْنُهُ عَلَى أَحَدِهِمَا وَكَانَ الْآخَرُ يَسْقِي عَلَيْهِ غُلَامُنَا قَالَ فَعُمْرَةٌ فِي رَمَضَانَ تَقْضِي حَجَّةً أَوْ حَجَّةً مَعِي",
                "id": "Dan Telah menceritakan kepada kami [Ahmad bin Abdah Adl Dlabbi] Telah menceritakan kepada kami [Yazid bin Zurai'] Telah menceritakan kepada kami [Habib Al Mu'allim] dari [Atha`] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam bertanya kepada seorang wanita Anshar yang namanya Ummu Sinan: \"Apa yang menghalangimu untuk mengerjakan haji bersama kami?\" wanita itu menjawab, \"Kami hanya memiliki dua ekor unta. Yang satu dipakai suamiku pergi haji bersama anaknya, sedangkan yang satu lagi dipakai pembantu kami untuk menyiram kebun.\" Akhirnya beliau pun bersabda: \"Kalau begitu, kerjakanlah umrah nanti di bulan ramadhan, nilainya sama dengan naik haji bersamaku.\""
            },
            {
                "number": 2057,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ مِنْ طَرِيقِ الشَّجَرَةِ وَيَدْخُلُ مِنْ طَرِيقِ الْمُعَرَّسِ وَإِذَا دَخَلَ مَكَّةَ دَخَلَ مِنْ الثَّنِيَّةِ الْعُلْيَا وَيَخْرُجُ مِنْ الثَّنِيَّةِ السُّفْلَىو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ و قَالَ فِي رِوَايَةِ زُهَيْرٍ الْعُلْيَا الَّتِي بِالْبَطْحَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abdullah bin Numair] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwasanya; \"Rasulullah shallallahu 'alaihi wasallam biasanya keluar dari jalur Asy Syajarah (jalur yang banyak dikelilingi pepohonan) dan beliau masuk melalui jalur Al Mu'arras. Apabila beliau memasuki kota Makkah, maka beliau masuk dari dataran tinggi (yaitu Bathha`) dan bila keluar, beliau keluar melalui dataran rendah.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] keduanya berkata, Telah menceritakan kepada kami [Yahya Al Qaththan] dari [ubaidhullah] dengan isnad ini; Dan di dalam riwayatnya Zuhair disebutkan bahwa; Al Ulya maksudnya di Bathha`."
            },
            {
                "number": 2058,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا جَاءَ إِلَى مَكَّةَ دَخَلَهَا مِنْ أَعْلَاهَا وَخَرَجَ مِنْ أَسْفَلِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Abu Umar] semuanya dari [Ibnu Uyainah] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Sufyan] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] radliallahu 'anha, katanya; \"Bila Nabi shallallahu 'alaihi wasallam datang ke Makkah, beliau masuk kota dari tempat ketinggian dan keluar dari tempat kerendahan.\""
            },
            {
                "number": 2059,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَامَ الْفَتْحِ مِنْ كَدَاءٍ مِنْ أَعْلَى مَكَّةَ قَالَ هِشَامٌ فَكَانَ أَبِي يَدْخُلُ مِنْهُمَا كِلَيْهِمَا وَكَانَ أَبِي أَكْثَرَ مَا يَدْخُلُ مِنْ كَدَاءٍ",
                "id": "Dan Telah menceritakan kepada kami [Abu Kuraib] Telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [bapaknya] dari [Aisyah] bahwasanya; \"Ketika Fathu Makkah, Rasulullah shallallahu 'alaihi wasallam masuk dari Kada` yakni dataran tinggi kota Makkah.\" Hisyam berkata; \"Biasanya bapakku masuk Makkah dari kedua tempat itu, dan paling sering dari Kada`.\""
            },
            {
                "number": 2060,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَاتَ بِذِي طَوًى حَتَّى أَصْبَحَ ثُمَّ دَخَلَ مَكَّةَقَالَ وَكَانَ عَبْدُ اللَّهِ يَفْعَلُ ذَلِكَ وَفِي رِوَايَةِ ابْنِ سَعِيدٍ حَتَّى صَلَّى الصُّبْحَ قَالَ يَحْيَى أَوْ قَالَ حَتَّى أَصْبَحَ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] dan [ubaidhullah bin Sa'id] keduanya berkata, Telah menceritakan kepada kami [Yahya Al Qaththan] dari [ubaidhullah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bermalam di Dzi Thuwa hingga pagi. Setelah itu, baru beliau memasuki Makkah. Nafi' berkata; Abdullah juga berbuat seperti itu. Dan di dalam riwayat Sa'id tercantum; \"Sampai beliau sholat Shubuh.\" Yahya berkata; Atau ubaidhullah berkata; \"Sampai pagi.\""
            },
            {
                "number": 2061,
                "arab": "و حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَكَانَ لَا يَقْدَمُ مَكَّةَ إِلَّا بَاتَ بِذِي طَوًى حَتَّى يُصْبِحَ وَيَغْتَسِلَ ثُمَّ يَدْخُلُ مَكَّةَ نَهَارًا وَيَذْكُرُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَعَلَهُ",
                "id": "Dan Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] Telah menceritakan kepada kami [Hammad] Telah menceritakan kepada kami [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] tidak pernah memasuki kota Makkah kecuali ia bermalam terlebih dahulu di Dzi Thuwa sampai waktu pagi datang. Setelah itu, ia mandi dan baru memasuki kota Makkah pada siang harinya. Ia menyebutkan bahwa hal tersebut dari Nabi shallallahu 'alaihi wasallam, bahwa beliau melakukannya."
            },
            {
                "number": 2062,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ الْمُسَيَّبِيُّ حَدَّثَنِي أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْزِلُ بِذِي طَوًى وَيَبِيتُ بِهِ حَتَّى يُصَلِّيَ الصُّبْحَ حِينَ يَقْدَمُ مَكَّةَ وَمُصَلَّى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ عَلَى أَكَمَةٍ غَلِيظَةٍ لَيْسَ فِي الْمَسْجِدِ الَّذِي بُنِيَ ثَمَّ وَلَكِنْ أَسْفَلَ مِنْ ذَلِكَ عَلَى أَكَمَةٍ غَلِيظَةٍ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Ishaq Al Musayyabi] telah menceritakan kepadaku [Anas] yakni Ibnu Iyadl, dari [Musa bin Uqbah] dari [Nafi'] bahwa [Abdullah] telah menceritakan kepadanya bahwasanya; \"Rasulullah shallallahu 'alaihi wasallam berhenti dan bermalam di Dzi Thuwa, sehingga beliau sholat Shubuh terlebih dahulu di situ sebelum masuk kota Makkah. Tempat beliau sholat di situ bukanlah masjid yang telah dibangun kemudian, tetapi agak ke bawah sedikit, di sebuah bukit kecil yang lumayan tinggi.\""
            },
            {
                "number": 2063,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ الْمُسَيَّبِيُّ حَدَّثَنِي أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَقْبَلَ فُرْضَتَيْ الْجَبَلِ الَّذِي بَيْنَهُ وَبَيْنَ الْجَبَلِ الطَّوِيلِ نَحْوَ الْكَعْبَةِ يَجْعَلُ الْمَسْجِدَ الَّذِي بُنِيَ ثَمَّ يَسَارَ الْمَسْجِدِ الَّذِي بِطَرَفِ الْأَكَمَةِ وَمُصَلَّى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْفَلَ مِنْهُ عَلَى الْأَكَمَةِ السَّوْدَاءِ يَدَعُ مِنْ الْأَكَمَةِ عَشْرَةَ أَذْرُعٍ أَوْ نَحْوَهَا ثُمَّ يُصَلِّي مُسْتَقْبِلَ الْفُرْضَتَيْنِ مِنْ الْجَبَلِ الطَّوِيلِ الَّذِي بَيْنَكَ وَبَيْنَ الْكَعْبَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ishaq Al Musabbi] telah menceritakan kepadaku [Anas bin Iyadl] dari [Musa bin Uqbah] dari [Nafi'] bahwa [Abdullah] telah mengabarkan kepadanya, bahwasanya; Rasulullah shallallahu 'alaihi wasallam menghadap ke arah dua jalan yang menuju ke bukit, antara beliau dan Jabal Thawil tepat menghadap ke arah Ka'bah. Kemudian masjid yang dibangun kemudian berada di sebelah kiri Masjid yang berada di ujung bukit yang ditutupi tanah. Dan tempat Rasulullah shallallahu 'alaihi wasallam sholat berada di bawah sedikit, di sebuah bukit kecil yang berwarna hitam. Jarak dari bukit itu sekitar sepuluh hasta. Kemudian beliau sholat dengan menghadap ke arah dua jalan dari Jabal Thawil, yakni tepat antara termpat kamu berdiri dan Ka'bah."
            },
            {
                "number": 2064,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا طَافَ بِالْبَيْتِ الطَّوَافَ الْأَوَّلَ خَبَّ ثَلَاثًا وَمَشَى أَرْبَعًا وَكَانَ يَسْعَى بِبَطْنِ الْمَسِيلِ إِذَا طَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِوَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abdullah bin Numair] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwasanya; \"Apabila Rasulullah shallallahu 'alaihi wasallam thawaf awal (thawaf qudum), beliau berlari-lari kecil tiga kali putaran. Ketika Sa'i, beliau berlari pula bila melalui bekas banjir antara Shafa dan Marwa.\""
            },
            {
                "number": 2065,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَعِيلَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا طَافَ فِي الْحَجِّ وَالْعُمْرَةِ أَوَّلَ مَا يَقْدَمُ فَإِنَّهُ يَسْعَى ثَلَاثَةَ أَطْوَافٍ بِالْبَيْتِ ثُمَّ يَمْشِي أَرْبَعَةً ثُمَّ يُصَلِّي سَجْدَتَيْنِ ثُمَّ يَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Abbad] Telah menceritakan kepada kami [Hatim bin Isma'il] dari [Musa bin Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa; Apabila Rasulullah shallallahu 'alaihi wasallam melakukan thawaf qudum untuk haji dan umrah, beliau berlari-lari kecil tiga kali putaran dan berjalan empat kali putaran. Kemudian beliau sholat dua raka'at (di Maqam Ibrahim) dan sesudah itu sa'i antara Shafa dan Marwa.\""
            },
            {
                "number": 2066,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَ حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ يَقْدَمُ مَكَّةَ إِذَا اسْتَلَمَ الرُّكْنَ الْأَسْوَدَ أَوَّلَ مَا يَطُوفُ حِينَ يَقْدَمُ يَخُبُّ ثَلَاثَةَ أَطْوَافٍ مِنْ السَّبْعِ",
                "id": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah bin Yahya] -Harmalah berkata- telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] bahwa [Salim bin Abdullah] telah mengabarkan kepadanya bahwa [Abdullah bin Umar] berkata; \"Saya melihat Rasulullah shallallahu 'alaihi wasallam saat beliau datang ke Makkah. Bila beliau hendak mencium Hajar Aswad, maka pertama kali datang beliau thawaf qudum, dari tujuh kali putaran, beliau berlari-lari kecil sebanyak tiga kali putaran.\""
            },
            {
                "number": 2067,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ أَبَانٍ الْجُعْفِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَرَمَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْحَجَرِ إِلَى الْحَجَرِ ثَلَاثًا وَمَشَى أَرْبَعًا",
                "id": "Dan Telah menceritakan kepada kami [Abdullah bin Umar bin Aban Al Ju'fi] Telah menceritakan kepada kami [Ibnul Mubarak] telah mengabarkan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berlari-lari kecil dari Hajar Aswad ke Hajar Aswad sebanyak tiga kali putaran dan berjalan empat kali putaran.\""
            },
            {
                "number": 2068,
                "arab": "و حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا سُلَيْمُ بْنُ أَخْضَرَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ رَمَلَ مِنْ الْحَجَرِ إِلَى الْحَجَرِ وَذَكَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَهُ",
                "id": "Dan Telah menceritakan kepada kami [Abu Kamil Al Jahdari] Telah menceritakan kepada kami [Sulaim bin Akhdlar] Telah menceritakan kepada kami [ubaidhullah bin Umar] dari [Nafi'] bahwasanya; \" [Ibnu Umar] berlari-lari kecil dari Hajar Aswad ke Hajar Aswad, dan ia menuturkan bahwa Rasulullah shallallahu 'alaihi wasallam telah berbuat demikian.\""
            },
            {
                "number": 2069,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي مَالِكٌ وَابْنُ جُرَيْجٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَلَ الثَّلَاثَةَ أَطْوَافٍ مِنْ الْحَجَرِ إِلَى الْحَجَرِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Thahir] telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Malik] dan [Ibnu Juraij] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin Abdullah] bahwa \"Rasulullah shallallahu 'alaihi wasallam berlari-lari kecil sebanyak tiga kalian putaran, yakni dari Hajar Aswad ke Hajar Aswad.\""
            },
            {
                "number": 2070,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ أَبِي الطُّفَيْلِ قَالَقُلْتُ لِابْنِ عَبَّاسٍ أَرَأَيْتَ هَذَا الرَّمَلَ بِالْبَيْتِ ثَلَاثَةَ أَطْوَافٍ وَمَشْيَ أَرْبَعَةِ أَطْوَافٍ أَسُنَّةٌ هُوَ فَإِنَّ قَوْمَكَ يَزْعُمُونَ أَنَّهُ سُنَّةٌ قَالَ فَقَالَ صَدَقُوا وَكَذَبُوا قَالَ قُلْتُ مَا قَوْلُكَ صَدَقُوا وَكَذَبُوا قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ مَكَّةَ فَقَالَ الْمُشْرِكُونَ إِنَّ مُحَمَّدًا وَأَصْحَابَهُ لَا يَسْتَطِيعُونَ أَنْ يَطُوفُوا بِالْبَيْتِ مِنْ الْهُزَالِ وَكَانُوا يَحْسُدُونَهُ قَالَ فَأَمَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَرْمُلُوا ثَلَاثًا وَيَمْشُوا أَرْبَعًا قَالَ قُلْتُ لَهُ أَخْبِرْنِي عَنْ الطَّوَافِ بَيْنَ الصَّفَا وَالْمَرْوَةِ رَاكِبًا أَسُنَّةٌ هُوَ فَإِنَّ قَوْمَكَ يَزْعُمُونَ أَنَّهُ سُنَّةٌ قَالَ صَدَقُوا وَكَذَبُوا قَالَ قُلْتُ وَمَا قَوْلُكَ صَدَقُوا وَكَذَبُوا قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَثُرَ عَلَيْهِ النَّاسُ يَقُولُونَ هَذَا مُحَمَّدٌ هَذَا مُحَمَّدٌ حَتَّى خَرَجَ الْعَوَاتِقُ مِنْ الْبُيُوتِ قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُضْرَبُ النَّاسُ بَيْنَ يَدَيْهِ فَلَمَّا كَثُرَ عَلَيْهِ رَكِبَ وَالْمَشْيُ وَالسَّعْيُ أَفْضَلُو حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَزِيدُ أَخْبَرَنَا الْجُرَيْرِيُّ بِهَذَا الْإِسْنَادِ نَحْوَهُ غَيْرَ أَنَّهُ قَالَ وَكَانَ أَهْلُ مَكَّةَ قَوْمَ حَسَدٍ وَلَمْ يَقُلْ يَحْسُدُونَهُ",
                "id": "Telah menceritakan kepada kami [Abu Kamil Fudlail bin Husain Al Jahdari] Telah menceritakan kepada kami [Abdul Wahid bin Ziyad] Telah menceritakan kepada kami [Al Jurairi] dari [Abu Thufail] ia berkata; Aku pernah bertanya kepada [Ibnu Abbas], \"Tahukah Anda tentang berlari-lari kecil sebanyak tiga kali putaran di Baitullah dan berjalan empat kali putaran, apakah hal tersebut merupakan ajaran Rasulullah shallallahu 'alaihi wasallam? sebab, kaum Anda menganggap bahwa hal tersebut adalah ajaran Nabi shallallahu 'alaihi wasallam?.\" Ibnu Abbas menjawab, \"Mereka benar, namun mereka juga telah berdusta.\" Aku bertanya, \"Apa maksud ungkapanmu, bahwa mereka benar, namun dusta?\" Ibnu Abbas menjawab, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah datang ke Makkah, lalu orang-orang Musyrik mengatakan bahwa Muhammad dan para sahabatnya tidak mampu thawaf di Baitullah karena lemah. Orang-orang musyrik itu dengki kepada Rasulullah shallallahu 'alaihi wasallam.\" Ibnu Abbas melanjutkan; \"Karena itu, Rasulullah shallallahu 'alaihi wasallam memerintahkan para sahabat agar berlari-lari kecil tiga kali putaran dan empat kali putaran berjalan biasa.\" Aku bertanya lagi kepada Ibnu Abbas, \"Beritahukanlah aku tentang Sa'i antara Shafa dan Marwa dengan berkendaraan. Apakah hal tersebut juga termasuk ajaran Rasulullah shallallahu 'alaihi wasallam? Sebab, kaummu menganggap bahwa hal tersebut juga termasuk sunnah?.\" Ibnu Abbas menjawab, \"Mereka benar, tapi mereka dusta.\" Aku bertanya, \"Apa maksudmu?\" Ibnu Abbas menjawab, \"Rasulullah shallallahu 'alaihi wasallam pernah dikerumuni orang banyak, mereka mengatakan inilah Nabi Muhammad, inilah Nabi Muhammad, sehingga perempuan-perempuan keluar rumah.\" Ibnu Abbas melanjutkan, \"Pada awal mula beliau lakukan (sa'i), tidak banyak orang-orang dihadapan Rasulullah shallallahu 'alaihi wasallam berdatangan, hingga ketika jumlah manusia semakin banyak, maka beliau melakukan sa'i dengan naik kendaraan, namun melakukan sa'i dengan berjalan kaki dan berlari-lari kecil adalah lebih utama.\" Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Yazid] telah mengabarkan kepada kami [Al Jurairi] dengan isnad ini, semisalnya, hanya saja ia menyebutkan; \"Penduduk Makkah adalah suatu kaum yang pedengki (Qaumu Hasadin).\" Dan ia tidak menyebutkan; \"Yahsudun (terus menerus mereka dengki).\""
            },
            {
                "number": 2071,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا زُهَيْرٌ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ الْأَبْجَرِ عَنْ أَبِي الطُّفَيْلِ قَالَقُلْتُ لِابْنِ عَبَّاسٍ أُرَانِي قَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَصِفْهُ لِي قَالَ قُلْتُ رَأَيْتُهُ عِنْدَ الْمَرْوَةِ عَلَى نَاقَةٍ وَقَدْ كَثُرَ النَّاسُ عَلَيْهِ قَالَ فَقَالَ ابْنُ عَبَّاسٍ ذَاكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُمْ كَانُوا لَا يُدَعُّونَ عَنْهُ وَلَا يُكْرَهُونَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Yahya bin Adam] Telah menceritakan kepada kami [Zuhair] dari [Abdul Malik bin Sa'id bin Al Abjar] dari [Abu Thufail] ia berkata; Saya berkata kepada [Ibnu Abbas], \"Aku bermimpi melihat Rasulullah shallallahu 'alaihi wasallam.\" Ibnu Abbas berkata, \"Jelaskanlah kepadaku.\" Aku pun menjelaskan, \"Aku melihat beliau berada di atas kendaraannya, sementara di sekeliling beliau banyak sekali manusia.\" Ibnu Abbas pun berkata, \"Benar, itu adalah Rasulullah shallallahu 'alaihi wasallam. Sesungguhnya mereka tidak pernah dipisahkan dari beliau dan tidak pula dibenci.\""
            },
            {
                "number": 2072,
                "arab": "و حَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ أَيُّوبَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ مَكَّةَ وَقَدْ وَهَنَتْهُمْ حُمَّى يَثْرِبَ قَالَ الْمُشْرِكُونَ إِنَّهُ يَقْدَمُ عَلَيْكُمْ غَدًا قَوْمٌ قَدْ وَهَنَتْهُمْ الْحُمَّى وَلَقُوا مِنْهَا شِدَّةً فَجَلَسُوا مِمَّا يَلِي الْحِجْرَ وَأَمَرَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَرْمُلُوا ثَلَاثَةَ أَشْوَاطٍ وَيَمْشُوا مَا بَيْنَ الرُّكْنَيْنِ لِيَرَى الْمُشْرِكُونَ جَلَدَهُمْ فَقَالَ الْمُشْرِكُونَ هَؤُلَاءِ الَّذِينَ زَعَمْتُمْ أَنَّ الْحُمَّى قَدْ وَهَنَتْهُمْ هَؤُلَاءِ أَجْلَدُ مِنْ كَذَا وَكَذَاقَالَ ابْنُ عَبَّاسٍ وَلَمْ يَمْنَعْهُ أَنْ يَأْمُرَهُمْ أَنْ يَرْمُلُوا الْأَشْوَاطَ كُلَّهَا إِلَّا الْإِبْقَاءُ عَلَيْهِمْ",
                "id": "Telah menceritakan kepadaku [Abu Rabi' Az Zahrani] Telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam dan para sahabatnya datang ke Makkah untuk menunaikan ibadah haji dalam keadaan lemah oleh penyakit demam Madinah. Lalu orang-orang musyrik Makkah berkata kepada sesama mereka, \"Esok, akan datang ke sini suatu kaum yang lemah karena mereka diserang penyakit demam yang memayahkan.\" Karena itu, mereka duduk di dekat Hijr memperhatikan kaum muslimin thawaf. Nabi shallallahu 'alaihi wasallam memerintahkan mereka supaya berlari-lari tiga kali putaran dan berjalan biasa empat kali putaran antara dua sujud agar kaum musyrikin melihat ketangkasan mereka. Maka berkatalah kaum musyrikin kepada sesama mereka, \"Inikah orang-orang yang kamu katakan lemah karena sakit panas, ternyata mereka lebih kuat dari golongan ini dan itu.\" Ibnu Abbas berkata; \"Dan tidak ada yang menghalangi beliau untuk memerintahkan mereka berlari-lari pada semua putaran, kecuali karena kasih sayang beliau kepada mereka.\""
            },
            {
                "number": 2073,
                "arab": "و حَدَّثَنِي عَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ وَأَحْمَدُ بْنُ عَبْدَةَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ ابْنُ عَبْدَةَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَإِنَّمَا سَعَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَمَلَ بِالْبَيْتِ لِيُرِيَ الْمُشْرِكِينَ قُوَّتَهُ",
                "id": "Dan telah menceritakan kepadaku [Amru An Naqid] dan [Ibnu Abu Umar] dan [Ahmad bin Abdah] semuanya dari [Ibnu Uyainah] - [Ibnu Abdah] berkata- Telah menceritakan kepada kami [Sufyan] dari [Amru] dari [Atha`] dari [Ibnu Abbas] ia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam berlari-lari kecil thawaf di Baitullah, hanya untuk memperlihatkan kekuatan kaum muslimin kepada kaum musyrikin.\""
            },
            {
                "number": 2074,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَلَمْ أَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ مِنْ الْبَيْتِ إِلَّا الرُّكْنَيْنِ الْيَمَانِيَيْنِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Laits] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Abdullah bin Umar] bahwa ia berkata; \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam menyentuh Baitullah melainkan pada dua sudut, yaitu sudut hajar Aswad dan sudut Yamani.\""
            },
            {
                "number": 2075,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَلَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُ مِنْ أَرْكَانِ الْبَيْتِ إِلَّا الرُّكْنَ الْأَسْوَدَ وَالَّذِي يَلِيهِ مِنْ نَحْوِ دُورِ الْجُمَحِيِّينَ",
                "id": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah] - [Abu Thahir] berkata- telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim] dari [bapaknya] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam belum pernah mencium sujud-sujud Baitullah, kecuali rukun Aswad dan yang berada di dekatnya yakni rukun Yamani.\""
            },
            {
                "number": 2076,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ ذَكَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَسْتَلِمُ إِلَّا الْحَجَرَ وَالرُّكْنَ الْيَمَانِيَ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Khalid bin Harits] dari [ubaidhullah] dari [Nafi'] dari [Abdullah] ia menyebutkan bahwasanya; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah mencium (rukun-rukun di Baitullah) kecuali Hajar Aswad dan rukun Yamani.\""
            },
            {
                "number": 2077,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَزُهَيْرُ بْنُ حَرْبٍ وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ جَمِيعًا عَنْ يَحْيَى الْقَطَّانِ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَمَا تَرَكْتُ اسْتِلَامَ هَذَيْنِ الرُّكْنَيْنِ الْيَمَانِيَ وَالْحَجَرَ مُذْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُهُمَا فِي شِدَّةٍ وَلَا رَخَاءٍ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Zuhair bin Harb] dan [ubaidhullah bin Sa'id] semuanya dari [Yahya Al Qaththan] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Yahya] dari [ubaidhullah] telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] ia berkata; \"Aku tidak pernah meninggalkan meraba kedua sudut ini, yaitu sudut Yamani dan sudut Hajar Aswad, semenjak kulihat Rasulullah shallallahu 'alaihi wasallam merabanya, baik dalam keadaan sempit (kesulitan) maupun dalam keadaan lapang (longgar).\""
            },
            {
                "number": 2078,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ جَمِيعًا عَنْ أَبِي خَالِدٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ قَالَرَأَيْتُ ابْنَ عُمَرَ يَسْتَلِمُ الْحَجَرَ بِيَدِهِ ثُمَّ قَبَّلَ يَدَهُ وَقَالَ مَا تَرَكْتُهُ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ibnu Numair] semuanya dari [Abu Khalid] - [Abu Bakr] berkata- Telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [ubaidhullah] dari [Nafi'] ia berkata; Saya melihat [Ibnu Umar] mengusap Hajar Aswad dengan tangannya, lalu mencium tangannya, kemudian ia berkata, \"Saya tidak pernah meninggalkannya semenjak aku melihat Rasulullah shallallahu 'alaihi wasallam melakukannya.\""
            },
            {
                "number": 2079,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ قَتَادَةَ بْنَ دِعَامَةَ حَدَّثَهُ أَنَّ أَبَا الطُّفَيْلِ الْبَكْرِيَّ حَدَّثَهُ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُالَمْ أَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُ غَيْرَ الرُّكْنَيْنِ الْيَمَانِيَيْنِ",
                "id": "Dan telah menceritakan kepadaku [Abu Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami [Amru bin Harits] bahwa [Qatadah bin Di'amah] telah menceritakan kepadanya bahwa [Abu Thufail Al Bakri] telah menceritakan kepadanya, bahwa ia mendengar [Ibnu Abbas] berkata; \"Saya tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam mencium (bagian dari Baitullah) kecuali dua rukun Yamani.\""
            },
            {
                "number": 2080,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ وَعَمْرٌو ح و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنِي ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ أَنَّ أَبَاهُ حَدَّثَهُ قَالَقَبَّلَ عُمَرُ بْنُ الْخَطَّابِ الْحَجَرَ ثُمَّ قَالَ أَمَ وَاللَّهِ لَقَدْ عَلِمْتُ أَنَّكَ حَجَرٌ وَلَوْلَا أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُكَ مَا قَبَّلْتُكَزَادَ هَارُونُ فِي رِوَايَتِهِ قَالَ عَمْرٌو وَحَدَّثَنِي بِمِثْلِهَا زَيْدُ بْنُ أَسْلَمَ عَنْ أَبِيهِ أَسْلَمَ",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dan [Amru] -dalam riwayat lain- Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepadaku [Ibnu Wahb] telah mengabarkan kepadaku [Amru] dari [Ibnu Syihab] dari [Salim] bahwa [bapaknya] telah mengabarkan kepadanya, ia berkata; [Umar bin Khaththab] mencium Hajar Aswad. Kemudian Umar berkata, \"Ketahuilah, demi Allah, aku tahu kamu hanyalah batu. Kalaulah aku tidak melihat Rasulullah shallallahu 'alaihi wasallam menciummu, niscaya aku tidak akan menciummu.\" [Harun] menambahkan dalam riwayatnya, [Amru] berkata; dan telah menceritakan kepadaku seperti di atas, [Zaid bin Aslam] dari [Bapaknya, Aslam] "
            },
            {
                "number": 2081,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ عُمَرَ قَبَّلَ الْحَجَرَ وَقَالَ إِنِّي لَأُقَبِّلُكَ وَإِنِّي لَأَعْلَمُ أَنَّكَ حَجَرٌ وَلَكِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُكَ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Abu Bakr Al Muqaddami] Telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa [Umar] mencium Hajar Aswad, lalu ia berkata, \"Aku benar-benar menciummu, dan aku juga tahu pasti bahwa kamu hanyalah batu, akan tetapi aku telah melihat Rasulullah shallallahu 'alaihi wasallam menciummu.\""
            },
            {
                "number": 2082,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ وَالْمُقَدَّمِيُّ وَأَبُو كَامِلٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ كُلُّهُمْ عَنْ حَمَّادٍ قَالَ خَلَفٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ قَالَرَأَيْتُ الْأَصْلَعَ يَعْنِي عُمَرَ بْنَ الْخَطَّابِ يُقَبِّلُ الْحَجَرَ وَيَقُولُ وَاللَّهِ إِنِّي لَأُقَبِّلُكَ وَإِنِّي أَعْلَمُ أَنَّكَ حَجَرٌ وَأَنَّكَ لَا تَضُرُّ وَلَا تَنْفَعُ وَلَوْلَا أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبَّلَكَ مَا قَبَّلْتُكَوَفِي رِوَايَةِ الْمُقَدَّمِيِّ وَأَبِي كَامِلٍ رَأَيْتُ الْأُصَيْلِعَ",
                "id": "Telah menceritakan kepada kami [Khalaf bin Hisyam] dan [Al Muqaddami] dan [Abu Kamil] dan [Qutaibah bin Sa'id] semuanya dari [Hammad] - [Khalaf] berkata- Telah menceritakan kepada kami [Hammad bin Zaid] dari [Ashim Al Ahwal] dari [Abdullah bin Sajis] ia berkata; Aku pernah melihat al-Ashla' alias [Umar bin Al Khathab] mencium Hajar Aswad dan ia pun berkata, \"Demi Allah, aku benar-benar akan menciummu, meskipun aku tahu kamu hanyalah batu yang tidak dapat memberi madlarat dan tidak pula dapat memberi manfaat. Sekiranya aku tidak melihat Rasulullah shallallahu 'alaihi wasallam menciummu, niscaya aku tidak akan menciummu.\" Dan di dalam riwayat Al Muqaddami dan Abu Kamil tercantum; \"Aku melihat Al Ushaili'.\" "
            },
            {
                "number": 2083,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ قَالَ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَابِسِ بْنِ رَبِيعَةَ قَالَرَأَيْتُ عُمَرَ يُقَبِّلُ الْحَجَرَ وَيَقُولُ إِنِّي لَأُقَبِّلُكَ وَأَعْلَمُ أَنَّكَ حَجَرٌ وَلَوْلَا أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُكَ لَمْ أُقَبِّلْكَ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ibnu Numair] semuanya dari [Abu Mu'awiyah] - [Yahya] berkata- telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Abis bin Rabi'ah] ia berkata; Saya pernah melihat [Umar] mencium Hajar Aswad, dan setelah itu ia berkata, \"Aku menciummu, dan aku tahu bahwa kamu hanyalah batu, sekiranya aku tidak melihat Rasulullah shallallahu 'alaihi wasallam menciummu, niscaya aku tidak akan menciummu.\""
            },
            {
                "number": 2084,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ وَكِيعٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْأَعْلَى عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَرَأَيْتُ عُمَرَ قَبَّلَ الْحَجَرَ وَالْتَزَمَهُ وَقَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَ حَفِيًّاو حَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ بِهَذَا الْإِسْنَادِ قَالَ وَلَكِنِّي رَأَيْتُ أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَ حَفِيًّا وَلَمْ يَقُلْ وَالْتَزَمَهُ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] semuanya dari [Waki'] - [Abu Bakr] berkata- Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ibrahim bin Abdul A'la] dari [Suwaid bin Ghafalah] ia berkata; Aku melihat [Umar] mencium Hajar dan berdiri sejenak seraya berkata, \"Saya telah melihat Rasulullah shallallahu 'alaihi wasallam menghormatimu.\" Dan telah menceritakannya kepadaku [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dengan isnad ini, ia berkata; \"Akan tetapi aku telah melihat Abul Qasim bersikap hormat padamu.\" Dan ia tidak menyebutkan; \"iltazamahu (berhenti sejenak di situ).\""
            },
            {
                "number": 2085,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ",
                "id": "Telah menceritakan kepadaku [Abu Thahir] dan [Harmalah bin Yahya] ia berkata, telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah bin Utbah] dari [Ibnu Abbas] bahwasanya; \"Rasulullah shallallahu 'alaihi wasallam melakukan thawaf pada saat haji Wada' dengan naik kendaraan, kemudian beliau mencium rukun dengan menggunakan tongkatnya.\""
            },
            {
                "number": 2086,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَطَافَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْبَيْتِ فِي حَجَّةِ الْوَدَاعِ عَلَى رَاحِلَتِهِ يَسْتَلِمُ الْحَجَرَ بِمِحْجَنِهِ لِأَنْ يَرَاهُ النَّاسُ وَلِيُشْرِفَ وَلِيَسْأَلُوهُ فَإِنَّ النَّاسَ غَشُوهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] ia berkata, Telah menceritakan kepada kami [Ali bin Mushir] dari [Ibnu Juraij] dari [Abu Zubair] dari [Jabir] ia berkata; \"Pada waktu haji wada' Rasulullah Shallallahu'alaihiwasallam melaksanakan thawaf di Baitullah dengan mengendarai hewan tunggangan beliau, dan beliau menyentuh hajar aswad dengan tongkat beliau agar semua manusia melihat dan menyaksikan serta bisa menanyakan sesuatu kepada beliau, sebab pada saat itu orang-orang sedang mengerumuni beliau.\""
            }
        ]
    }
}