{
    "status": true,
    "data": {
        "start": 4918,
        "end": 5066,
        "total": 13,
        "book": "muslim",
        "hadits": [
            {
                "number": 4918,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ{ وَإِنْ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا }الْآيَةَ قَالَتْ أُنْزِلَتْ فِي الْمَرْأَةِ تَكُونُ عِنْدَ الرَّجُلِ فَتَطُولُ صُحْبَتُهَا فَيُرِيدُ طَلَاقَهَا فَتَقُولُ لَا تُطَلِّقْنِي وَأَمْسِكْنِي وَأَنْتَ فِي حِلٍّ مِنِّي فَنَزَلَتْ هَذِهِ الْآيَةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdah bin Sulaiman] telah menceritakan kepada kami [Hisyam] dari [ayahnya] dari [Aisyah]: \"Dan jika seorang wanita khawatir akan nusyuz atau sikap tidak acuh dari suaminya.\" (An Nisaa`: 128) Ia berkata: (ayat ini) turun berkenaan tentang wanita yang telah lama hidup bersama suaminya lalu ia (sang suami) ingin mencerainya, kemudian ia (sang istri) berkata: Janganlah engkau cerai daku dan pertahankan diriku dan engkau terbebas dariku, lalu turunlah ayat ini."
            },
            {
                "number": 4919,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَفِي قَوْلِهِ عَزَّ وَجَلَّ{ وَإِنْ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا }قَالَتْ نَزَلَتْ فِي الْمَرْأَةِ تَكُونُ عِنْدَ الرَّجُلِ فَلَعَلَّهُ أَنْ لَا يَسْتَكْثِرَ مِنْهَا وَتَكُونُ لَهَا صُحْبَةٌ وَوَلَدٌ فَتَكْرَهُ أَنْ يُفَارِقَهَا فَتَقُولُ لَهُ أَنْتَ فِي حِلٍّ مِنْ شَأْنِي",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hisyam] dari [ayahnya] dari [Aisyah] tentang firman Allah 'azza wajalla: \"Dan jika seorang wanita khawatir akan nusyuz atau sikap tidak acuh dari suaminya.\" (An Nisaa`: 128) Ia berkata: (ayat ini) turun berkenaan tentang wanita yang hidup bersama suaminya, mungkin ia tidak mau memperbanyak anak darinya, lalu ia (sang suami) ingin mencerainya, ia telah lama menemaninya dan telah punya anak, ia tidak ingin suaminya mencerainya lalu berkata: Engkau terbebas dari urusanku."
            },
            {
                "number": 4920,
                "arab": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى الصَّدَفِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ أَنَّ ابْنَ مَسْعُودٍ قَالَمَا كَانَ بَيْنَ إِسْلَامِنَا وَبَيْنَ أَنْ عَاتَبَنَا اللَّهُ بِهَذِهِ الْآيَةِ{ أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ }إِلَّا أَرْبَعُ سِنِينَ",
                "id": "Telah menceritakan kepadaku [Yunus bin Abdula'la Ash Shadafi] telah mengkhabarkan kepada kami [Abdulah bin Wahab] telah mengkhabarkan kepadaku [Amru bin Al Harits] dari [Sa'id bin Abu Hilal] dari [Aun bin Abdullah] dari [ayahnya] bahwasanya [Ibnu Mas'ud] berkata: Tidak ada selang waktu antara Islamnya kami dan ketika Allah menegur kami dengan ayat ini: \"Belumkah datang waktunya bagi orang-orang yang beriman, untuk tunduk hati mereka mengingat Allah.\" (Al Hadiid: 16) kecuali hanya empat tahun."
            },
            {
                "number": 4921,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ وَاللَّفْظُ لَهُ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَتْ الْمَرْأَةُ تَطُوفُ بِالْبَيْتِ وَهِيَ عُرْيَانَةٌ فَتَقُولُ مَنْ يُعِيرُنِي تِطْوَافًا تَجْعَلُهُ عَلَى فَرْجِهَا وَتَقُولُ الْيَوْمَ يَبْدُو بَعْضُهُ أَوْ كُلُّهُفَمَا بَدَا مِنْهُ فَلَا أُحِلُّهُفَنَزَلَتْ هَذِهِ الْآيَةُ{ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far]. Telah menceritakan kepadaku [Abu Bakr bin Nafi'] teks miliknya, telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail] dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu Abbas] berkata: Dahulu wanita berthawaf di baitullah dalam keadaan telanjang lalu ia berkata: Siapa yang meminjamkan kepadaku baju yang ia kenakan di atas kemaluannya? dan saat ini ia berkata: Telah nampak sebagian atau seluruhnya, maka apa yang nampak darinya tidaklah aku menghalalkannya. Lalu turunlah ayat ini: \"Ambillah oleh kalian pakaian dan perhiasan kalian setiap memasuki masjid.\" (Al A'raaf: 31) "
            },
            {
                "number": 4922,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ وَاللَّفْظُ لِأَبِي كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَكَانَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ ابْنُ سَلُولَ يَقُولُ لِجَارِيَةٍ لَهُ اذْهَبِي فَابْغِينَا شَيْئًا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَلَا تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ إِنْ أَرَدْنَ تَحَصُّنًا لِتَبْتَغُوا عَرَضَ الْحَيَاةِ الدُّنْيَا وَمَنْ يُكْرِهْهُنَّ فَإِنَّ اللَّهَ مِنْ بَعْدِ إِكْرَاهِهِنَّ }لَهُنَّ{ غَفُورٌ رَحِيمٌ }",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] dari [Abu Mu'awiyah], teks milik Abu Kuraib, telah menceritakan kepada kami Abu Mu'awiyuah telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir] berkata: Dahulu Abdullah bin Ubai bin Salul berkata kepada budak wanitanya: Pergilah dan melacurlah untuk kami. Maka Allah 'azza wajalla menurunkan ayat: \"Dan janganlah kamu paksa budak-budak wanitamu untuk melakukan pelacuran, sedang mereka sendiri mengingini kesucian, karena kamu hendak mencari keuntungan duniawi. dan barangsiapa yang memaksa mereka, maka sesungguhnya Allah adalah Maha Pengampun lagi Maha Penyayang (kepada mereka) sesudah mereka dipaksa itu.\" (An Nuur: 33)"
            },
            {
                "number": 4923,
                "arab": "و حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍأَنَّ جَارِيَةً لِعَبْدِ اللَّهِ بْنِ أُبَيٍّ ابْنِ سَلُولَ يُقَالُ لَهَا مُسَيْكَةُ وَأُخْرَى يُقَالُ لَهَا أُمَيْمَةُ فَكَانَ يُكْرِهُهُمَا عَلَى الزِّنَى فَشَكَتَا ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّهُ{ وَلَا تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ إِلَى قَوْلِهِ غَفُورٌ رَحِيمٌ }",
                "id": "Telah menceritakan kepadaku [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Abu Awanah] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir], budak wanita milik Abdullah bin Ubai bin Salul bernama Musaikah, ada juga yang menyebut Umaimah, dipaksa berzina lalu ia melaporkan hal itu kepada nabi Shallallahu 'alaihi wa Salam kemudian Allah menurunkan: \"Dan janganlah kamu paksa budak-budak wanitamu untuk melakukan pelacuran\" sampai \"Maha Pengampun lagi Maha Penyayang (kepada mereka) sesudah mereka dipaksa itu.\" (An Nuur: 33) "
            },
            {
                "number": 4924,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِفِي قَوْلِهِ عَزَّ وَجَلَّ{ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ }قَالَ كَانَ نَفَرٌ مِنْ الْجِنِّ أَسْلَمُوا وَكَانُوا يُعْبَدُونَ فَبَقِيَ الَّذِينَ كَانُوا يَعْبُدُونَ عَلَى عِبَادَتِهِمْ وَقَدْ أَسْلَمَ النَّفَرُ مِنْ الْجِنِّ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dari [Al A'masy] dari [Ibrahim] dari [Abu Ma'mar] dari [Abdullah] tentang firmanNya 'azza wajalla: \"Mereka itulah orang-orang yang selalu berdo'a dan mencari kepada Rabb mereka wasilah manakah di antara mereka yang lebih dekat.\" (Al Israa`: 57) ia berkata: Segolongan jin masuk Islam dan mereka disembah, mereka yang menyembah tetap berada dalam peribadatan mereka, sementara segolongan dari jin telah masuk Islam."
            },
            {
                "number": 4925,
                "arab": "حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي مَعْمَرٍ عَنْ عَبْدِ اللَّهِ{ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ }قَالَ كَانَ نَفَرٌ مِنْ الْإِنْسِ يَعْبُدُونَ نَفَرًا مِنْ الْجِنِّ فَأَسْلَمَ النَّفَرُ مِنْ الْجِنِّ وَاسْتَمْسَكَ الْإِنْسُ بِعِبَادَتِهِمْ فَنَزَلَتْ{ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ }و حَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Nafi' Al Abdi] telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari [Abu Ma'mar] dari [Abdullah]: \"Mereka itulah orang-orang yang selalu berdo'a dan mencari kepada Rabb mereka wasilah manakah di antara mereka yang lebih dekat.\" (Al Israa`: 57) Abdullah berkata: Segolongan manusia menyembah segolongan jin lalu segolongan jin itu masuk Islam sementara segolongan manusia tetap berpegang teguh pada peribadatan mereka, lalu turun ayat: \"Mereka itulah orang-orang yang selalu berdo'a dan mencari kepada Rabb mereka wasilah manakah di antara mereka yang lebih dekat.\" (Al Israa`: 57) Telah menceritakannya kepadaku [Bisyr bin Khalid] telah mengkhabarkan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Sulaiman] dengan sanad ini."
            },
            {
                "number": 4926,
                "arab": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنِي أَبِي حَدَّثَنَا حُسَيْنٌ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ{ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ }قَالَ نَزَلَتْ فِي نَفَرٍ مِنْ الْعَرَبِ كَانُوا يَعْبُدُونَ نَفَرًا مِنْ الْجِنِّ فَأَسْلَمَ الْجِنِّيُّونَ وَالْإِنْسُ الَّذِينَ كَانُوا يَعْبُدُونَهُمْ لَا يَشْعُرُونَ فَنَزَلَتْ{ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمْ الْوَسِيلَةَ }",
                "id": "Telah menceritakan kepadaku [Hajjaj bin Asy Sya'ir] telah menceritakan kepada kami [Abdushshamad bin Abdulwarits] telah menceritakan kepadaku [ayahku] telah menceritakan kepada kami [Husain] dari [Qatadah] dari [Abdullah bin Ma'bad Az ZImmani] dari [Abdullah bin Utbah] dari [Abdullah bin Mas'ud]: \"Mereka itulah orang-orang yang selalu berdo'a dan mencari kepada Rabb mereka wasilah.\" (Al Israa`: 57) Ia berkata: Turun berkenaan dengan segolongan orang arab, mereka menyembah sekelompok jin lalu para jin itu masuk Islam sementara orang-orangnya tetap menyembah mereka tanpa mereka sadari. Kemudian turun ayat: \"Mereka itulah orang-orang yang selalu berdo'a dan mencari kepada Rabb mereka wasilah.\" (Al Israa`: 57) "
            },
            {
                "number": 4927,
                "arab": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُطِيعٍ حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَقُلْتُ لِابْنِ عَبَّاسٍ سُورَةُ التَّوْبَةِ قَالَ آلتَّوْبَةِ قَالَ بَلْ هِيَ الْفَاضِحَةُ مَا زَالَتْ تَنْزِلُ وَمِنْهُمْ وَمِنْهُمْ حَتَّى ظَنُّوا أَنْ لَا يَبْقَى مِنَّا أَحَدٌ إِلَّا ذُكِرَ فِيهَا قَالَ قُلْتُ سُورَةُ الْأَنْفَالِ قَالَ تِلْكَ سُورَةُ بَدْرٍ قَالَ قُلْتُ فَالْحَشْرُ قَالَ نَزَلَتْ فِي بَنِي النَّضِيرِ",
                "id": "Telah menceritakan kepadaku [Abdullah bin Muthi'] telah menceritakan kepada kami [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] berkata: Saya berkata kepada [Ibnu 'Abbas]: Surat At Taubah, ia berkata: Apa At Taubah? Ia berkata: Bahkan ia adalah Al Fadhilah (yang menyibak rahasia orang-orang munafik, pent.) yang masih turun dan dari mereka dan dari mereka hingga mereka mengira tiada seorangpun dari kita yang masih tersisa kecuali telah disebutkan di dalamnya. Ia berkata: Aku berkata: Surat Al Anfaal, ia (Ibnu Abbas) berkata: Itu adalah surat perang Badar. Ia berkata: Lalu aku berkata: Surat Al Hasyr, ia (Ibnu Abbas) berkata: Ia turun berkenaan dengan Bani Nadhir."
            },
            {
                "number": 4928,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ أَبِي حَيَّانَ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عُمَرَ قَالَخَطَبَ عُمَرُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ أَلَا وَإِنَّ الْخَمْرَ نَزَلَ تَحْرِيمُهَا يَوْمَ نَزَلَ وَهِيَ مِنْ خَمْسَةِ أَشْيَاءَ مِنْ الْحِنْطَةِ وَالشَّعِيرِ وَالتَّمْرِ وَالزَّبِيبِ وَالْعَسَلِ وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ وَثَلَاثَةُ أَشْيَاءَ وَدِدْتُ أَيُّهَا النَّاسُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَهِدَ إِلَيْنَا فِيهَا الْجَدُّ وَالْكَلَالَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Abu Hayyan] dari [Asy Sya'bi] dari [Ibnu Umar] berkata: [Umar] berkhutbah di atas mimbar Rasulullah shallallahu 'alaihi wasallam, ia memuja dan memuji Allah kemudian berkata: Amma ba'du, sesungguhnya khamar itu telah turun pengharamannya saat turun waktu itu dan khamar terdiri lima hal; dari gandum, tepung, kurma, anggur, dan madu, Khamar adalah segala sesuatu yang menutupi akal. Ada tiga hal yang aku ingin (sampaikan) wahai para manusia: Rasulullah shallallahu 'alaihi wasallam telah mewasiatkan kepada kita; (warisan) kakek, kalalah (orang mati yang tidak meniggalkan anak maupun orang tua) dan sekian dari beberapa pintu riba."
            },
            {
                "number": 4929,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ إِدْرِيسَ حَدَّثَنَا أَبُو حَيَّانَ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولَأَمَّا بَعْدُ أَيُّهَا النَّاسُ فَإِنَّهُ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهِيَ مِنْ خَمْسَةٍ مِنْ الْعِنَبِ وَالتَّمْرِ وَالْعَسَلِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ وَثَلَاثٌ أَيُّهَا النَّاسُ وَدِدْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَهِدَ إِلَيْنَا فِيهِنَّ عَهْدًا نَنْتَهِي إِلَيْهِ الْجَدُّ وَالْكَلَالَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَاو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كِلَاهُمَا عَنْ أَبِي حَيَّانَ بِهَذَا الْإِسْنَادِ بِمِثْلِ حَدِيثِهِمَا غَيْرَ أَنَّ ابْنَ عُلَيَّةَ فِي حَدِيثِهِ الْعِنَبِ كَمَا قَالَ ابْنُ إِدْرِيسَ وَفِي حَدِيثِ عِيسَى الزَّبِيبِ كَمَا قَالَ ابْنُ مُسْهِرٍ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah mengkhabarkan kepada kami [Ibnu Idris] telah menceritakan kepada kami [Abu Hayyan] dari [Asy Sya'bi] dari [Ibnu Umar] berkata: Aku mendengar [Umar bin Al Khaththab] berkhutbah di atas mimbar Rasulullah Shallallahu 'alaihi wa Salam, ia berkata: Amma ba'du, sesungguhnya telah turun pengharaman khamar dan khamar terdiri lima hal; anggur kurma, madu, tepung dan gandum. Khamar adalah segala sesuatu yang menutupi akal. Ada tiga hal yang aku ingin (sampaikan) wahai para manusia: Rasulullah shallallahu 'alaihi wasallam telah mewasiatkan kepada kita yang harus kita perhatikan; (warisan) kakek, kalalah (orang mati yang tidak meniggalkan anak maupun orang tua) dan sekian dari beberapa pintu riba. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin Ulaiyah]. Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengkhabarkan kepada kami [Isa bin Yunus] keduanya dari [Abu Hayyan] dengan snad ini seperti hadits mereka berdua, hanya saja Ibnu Ulaiyah menyebutkan dalam haditsnya: Anggur. Seperti yang dikatakan oleh Ibnu Idris, dan dalam hadits Isa disebutkan: Kismis, seperti yang dikatakan Ibnu Mushir."
            },
            {
                "number": 4930,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي هَاشِمٍ عَنْ أَبِي مِجْلَزٍ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَسَمِعْتُ أَبَا ذَرٍّ يُقْسِمُ قَسَمًا إِنَّ { هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ } إِنَّهَا نَزَلَتْ فِي الَّذِينَ بَرَزُوا يَوْمَ بَدْرٍ حَمْزَةُ وَعَلِيٌّ وَعُبَيْدَةُ بْنُ الْحَارِثِ وَعُتْبَةُ وَشَيْبَةُ ابْنَا رَبِيعَةَ وَالْوَلِيدُ بْنُ عُتْبَةَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ جَمِيعًا عَنْ سُفْيَانَ عَنْ أَبِي هَاشِمٍ عَنْ أَبِي مِجْلَزٍ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَ سَمِعْتُ أَبَا ذَرٍّ يُقْسِمُ لَنَزَلَتْ { هَذَانِ خَصْمَانِ } بِمِثْلِ حَدِيثِ هُشَيْمٍ",
                "id": "Telah menceritakan kepada kami [Amru bin Zurarah] telah menceritakan kepada kami [Husyaim] dari [Abu Hasyim] dari [Abu Mijlaz] dari [Qais bin Ubad] berkata: Saya telah mendengar [Abu Dzar] benar-benar bersumpah: \"Inilah dua golongan (golongan mukmin dan golongan kafir) yang bertengkar, mereka saling bertengkar mengenai Rabb mereka.\" (Al Hajj: 19) sesungguhnya ia turun berkenaan orang-orang yang berbaris di hari Badar: Hamzah, Ali, Ubaidah bin Harits, Utbah, Syaibah putra dari Rabi'ah dan Al Walid bin Utbah. Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'], dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdurrahman], semuanya dari [Sufyan] dari [Abu Hasyim] dari [Abu Majliz] dari [Qais bin Ubad] berkata: Saya telah mendengar [Abu Dzar] bersumpah, sungguh \"Inilah dua golongan (golongan mukmin dan golongan kafir) yang bertengkar.\" (Al Hajj: 19) seperti hadits Husyaim."
            }
        ]
    }
}