{
    "status": true,
    "data": {
        "start": 2087,
        "end": 2235,
        "total": 149,
        "book": "muslim",
        "hadits": [
            {
                "number": 2087,
                "arab": "و حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ بَكْرٍ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاطَافَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ عَلَى رَاحِلَتِهِ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ لِيَرَاهُ النَّاسُ وَلِيُشْرِفَ وَلِيَسْأَلُوهُ فَإِنَّ النَّاسَ غَشُوهُوَلَمْ يَذْكُرْ ابْنُ خَشْرَمٍ وَلِيَسْأَلُوهُ فَقَطْ",
                "id": "Telah menceritakan kepada kami [Ali bin Khasyram] telah mengabarkan kepada kami [Isa bin Yunus] dari [Ibnu Juraij] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Muhammad bin Bakr] ia berkata, telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata; Pada saat haji wada', Rasulullah shallallahu 'alaihi wasallam melakukan thawaf di Baitullah dengan tetap berada di atas kendaraannya, demikian pula saat sa'i antara Shafa dan Marwa sehingga orang-orang dapat melihat dan menyaksikan beliau, serta mereka bisa bertanya tentang sesuatu pada beliau, sebab saat itu, beliau dikerumuni oleh orang-orang banyak.\" Ibnu Khasyram tidak menyebutkan; \"Agar mereka dapat bertanya kepada beliau.\""
            },
            {
                "number": 2088,
                "arab": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى الْقَنْطَرِيُّ حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَقَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْطَافَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ حَوْلَ الْكَعْبَةِ عَلَى بَعِيرِهِ يَسْتَلِمُ الرُّكْنَ كَرَاهِيَةَ أَنْ يُضْرَبَ عَنْهُ النَّاسُ",
                "id": "Telah menceritakan kepadaku [Al Hakam bin Musa Al Qanthari] Telah menceritakan kepada kami [Syu'aib bin Ishaq] dari [Hisyam bin Urwah] dari [Urwah] dari [Aisyah] ia berkata; \"Pada saat haji wada', Nabi shallallahu 'alaihi wasallam melaksanakan thawaf di sekitar Ka'bah dengan mengendarai Unta beliau, dan beliau hanya mengusap rukun (yamani-pent) karena khawatir kalau-kalau manusia akan memukulnya (rukun yamani).\""
            },
            {
                "number": 2089,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا مَعْرُوفُ بْنُ خَرَّبُوذَ قَالَ سَمِعْتُ أَبَا الطُّفَيْلِ يَقُولُارَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطُوفُ بِالْبَيْتِ وَيَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ مَعَهُ وَيُقَبِّلُ الْمِحْجَنَ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Sulaiman bin Dawud] Telah menceritakan kepada kami [Ma'ruf bin Kharrabudz] ia berkata, saya mendengar [Abu Thufail] berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam melakukan thawaf di Baitullah dan beliau mengusap rukun (Yamani) dengan menggunakan tongkat, lalu beliau mencium tongkat tersebut.\""
            },
            {
                "number": 2090,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ أَنَّهَا قَالَتْشَكَوْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي أَشْتَكِي فَقَالَ طُوفِي مِنْ وَرَاءِ النَّاسِ وَأَنْتِ رَاكِبَةٌ قَالَتْ فَطُفْتُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَئِذٍ يُصَلِّي إِلَى جَنْبِ الْبَيْتِ وَهُوَ يَقْرَأُ بِالطُّورِ وَكِتَابٍ مَسْطُورٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Muhammad bin Abdurrahman bin Naufal] dari [Urwah] dari [Zainab binti Abu Salamah] dari [Ummu Salamah] bahwa ia berkata; \"Aku mengadu kepada Rasulullah shallallahu 'alaihi wasallam bahwa aku sakit. Maka beliau pun bersabda: \"Thawaflah di belakang orang banyak sambil berkendaraan.\" Lalu aku melakukan thawaf, sementara Rasulullah shallallahu 'alaihi wasallam saat itu sholat di sisi Baitullah, beliau membaca surat Ath Thur.\""
            },
            {
                "number": 2091,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَقُلْتُ لَهَا إِنِّي لَأَظُنُّ رَجُلًا لَوْ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ مَا ضَرَّهُ قَالَتْ لِمَ قُلْتُ لِأَنَّ اللَّهَ تَعَالَى يَقُولُ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ }إِلَى آخِرِ الْآيَةِ فَقَالَتْ مَا أَتَمَّ اللَّهُ حَجَّ امْرِئٍ وَلَا عُمْرَتَهُ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَلَوْ كَانَ كَمَا تَقُولُ لَكَانَ فَلَا جُنَاحَ عَلَيْهِ أَنْ لَا يَطَّوَّفَ بِهِمَا وَهَلْ تَدْرِي فِيمَا كَانَ ذَاكَ إِنَّمَا كَانَ ذَاكَ أَنَّ الْأَنْصَارَ كَانُوا يُهِلُّونَ فِي الْجَاهِلِيَّةِ لِصَنَمَيْنِ عَلَى شَطِّ الْبَحْرِ يُقَالُ لَهُمَا إِسَافٌ وَنَائِلَةُ ثُمَّ يَجِيئُونَ فَيَطُوفُونَ بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ يَحْلِقُونَ فَلَمَّا جَاءَ الْإِسْلَامُ كَرِهُوا أَنْ يَطُوفُوا بَيْنَهُمَا لِلَّذِي كَانُوا يَصْنَعُونَ فِي الْجَاهِلِيَّةِ قَالَتْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ }إِلَى آخِرِهَا قَالَتْ فَطَافُوا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] radliallahu 'anha. Urwah berkata; Aku berkata kepada Aisyah, \"Aku berpendapat, jika seseorang tidak sa'i antara Shafa dan Marwah tidak membatalkan hajinya.\" Tanya Aisyah, \"Apa alasanmu?\" Aku menjawab, \"Yaitu firman Allah yang berbunyi: 'Sesugguhnya Shafa dan Marwa merupakan sebagian dari syi'ar-syi'ar agama Allah….'\" (Al Baqarah: 158), Aisyah berkata, \"Tidak sempurna haji dan umrah seseorang tanpa sa'i dan antara Shafa dan Marwa. Kalau benar apa yang kamu katakan, tentu firman Allah itu seharusnya berbunyi: 'Tidaklah berdosa orang yang tidak sa'i antara keduanya.' Tahukah kamu apa sebabnya? Sebabnya ialah; Di zaman Jahiliyah orang-orang Anshar menyembah dua berhala yang terletak di tepi pantai, yaitu berhala yang disebut Isaf dan Nailah. Sesudah mereka mendatangi kedua berhala tersebut, mereka sa'i antara Shafa dan Marwa dan sesudah itu, mereka bercukur. Setelah Islam datang, mereka enggan Sa'i antara keduanya, karena mereka tidak ingin mengingat perbuatan mereka semasa jahiliyah. Kemudian Allah menurunkan ayat: 'Sesungguhnya Shafa dan Marwa adalah sebagian dari syi'ar agama Allah….' (Al Baqarah: 158), Maka sejak itulah mereka sa'i antara keduanya.\""
            },
            {
                "number": 2092,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنِي أَبِي قَالَقُلْتُ لِعَائِشَةَ مَا أَرَى عَلَيَّ جُنَاحًا أَنْ لَا أَتَطَوَّفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَتْ لِمَ قُلْتُ لِأَنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ }الْآيَةَ فَقَالَتْ لَوْ كَانَ كَمَا تَقُولُ لَكَانَ فَلَا جُنَاحَ عَلَيْهِ أَنْ لَا يَطَّوَّفَ بِهِمَا إِنَّمَا أُنْزِلَ هَذَا فِي أُنَاسٍ مِنْ الْأَنْصَارِ كَانُوا إِذَا أَهَلُّوا أَهَلُّوا لِمَنَاةَ فِي الْجَاهِلِيَّةِ فَلَا يَحِلُّ لَهُمْ أَنْ يَطَّوَّفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَلَمَّا قَدِمُوا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحَجِّ ذَكَرُوا ذَلِكَ لَهُ فَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الْآيَةَ فَلَعَمْرِي مَا أَتَمَّ اللَّهُ حَجَّ مَنْ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abu Usamah] Telah menceritakan kepada kami [Hisyam bin Urwah] telah mengabarkan kepadaku [bapakku] ia berkata, saya pernah berkata kepada [Aisyah], \"Menurutku, aku tidak berdosa bila tidak melakukan Sa'i antara Shafa dan Marwa.\" Aisyah bertanya, \"Kenapa?\" Aku menjawab, \"Sebab Allah 'azza wajalla telah berfirman: 'Sesungguhnya Shafa dan Marwa adalah sebagian dari syi'ar agama Allah….'\" (Al Baqarah: 158) Aisyah berkata, \"Sekiranya benar apa yang kamu katakan, maka seharus ayat itu berbunyi: 'Tidaklah berdosa orang yang tidak sa'i antara keduanya.'\" Aisyah melanjutkan, \"Sesungguhnya ayat ini diturunkan berkenaan dengan orang-orang Anshar. Dulu ketika ihram, mereka ihram untuk Manat (sebuah batu besar berada di Qadid pada masa jahiliyah), dan mereka tidak tahallul, hingga mereka Sa'i antara Shafa dan Marwah. Maka ketika mereka datang untuk menunaikan haji bersama Rasulullah shallallahu 'alaihi wasallam, mereka pun teringat akan masa lalu, sehingga Allah pun menurunkan ayat ini. Karena itu, Allah tidak akan menyempurnakan haji seseorang yang tidak Sa'i antara Shafa dan Marwa.\""
            },
            {
                "number": 2093,
                "arab": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ الزُّهْرِيَّ يُحَدِّثُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ قَالَقُلْتُ لِعَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَرَى عَلَى أَحَدٍ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ شَيْئًا وَمَا أُبَالِي أَنْ لَا أَطُوفَ بَيْنَهُمَا قَالَتْ بِئْسَ مَا قُلْتَ يَا ابْنَ أُخْتِي طَافَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَطَافَ الْمُسْلِمُونَ فَكَانَتْ سُنَّةً وَإِنَّمَا كَانَ مَنْ أَهَلَّ لِمَنَاةَ الطَّاغِيَةِ الَّتِي بِالْمُشَلَّلِ لَا يَطُوفُونَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَلَمَّا كَانَ الْإِسْلَامُ سَأَلْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا }وَلَوْ كَانَتْ كَمَا تَقُولُ لَكَانَتْ فَلَا جُنَاحَ عَلَيْهِ أَنْ لَا يَطَّوَّفَ بِهِمَاقَالَ الزُّهْرِيُّ فَذَكَرْتُ ذَلِكَ لِأَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ فَأَعْجَبَهُ ذَلِكَ وَقَالَ إِنَّ هَذَا الْعِلْمُ وَلَقَدْ سَمِعْتُ رِجَالًا مِنْ أَهْلِ الْعِلْمِ يَقُولُونَ إِنَّمَا كَانَ مَنْ لَا يَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ مِنْ الْعَرَبِ يَقُولُونَ إِنَّ طَوَافَنَا بَيْنَ هَذَيْنِ الْحَجَرَيْنِ مِنْ أَمْرِ الْجَاهِلِيَّةِ و قَالَ آخَرُونَ مِنْ الْأَنْصَارِ إِنَّمَا أُمِرْنَا بِالطَّوَافِ بِالْبَيْتِ وَلَمْ نُؤْمَرْ بِهِ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ }قَالَ أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ فَأُرَاهَا قَدْ نَزَلَتْ فِي هَؤُلَاءِ وَهَؤُلَاءِ و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى حَدَّثَنَا لَيْثٌ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَنَّهُ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ قَالَ سَأَلْتُ عَائِشَةَ وَسَاقَ الْحَدِيثَ بِنَحْوِهِ وَقَالَ فِي الْحَدِيثِ فَلَمَّا سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَتَحَرَّجُ أَنْ نَطُوفَ بِالصَّفَا وَالْمَرْوَةِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا }قَالَتْ عَائِشَةُ قَدْ سَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الطَّوَافَ بَيْنَهُمَا فَلَيْسَ لِأَحَدٍ أَنْ يَتْرُكَ الطَّوَافَ بِهِمَا",
                "id": "Telah menceritakan kepada kami [Amru An Naqid] dan [Ibnu Abu Umar] semuanya dari [Ibnu Uyainah] - [Ibnu Abu Umar] berkata- Telah menceritakan kepada kami [Sufyan] ia berkata, saya mendengar [Az Zuhri] menceritakan dari [Urwah bin Zubair] ia berkata; Aku berkata kepada [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, \"Aku bependapat, tidaklah membatalkan, jika seseorang tidak sa'i antara Shafa dan Marwa. Dan aku sendiri tidak peduli untuk tidak sa'i antara keduanya.\" Maka Aisyah pun berkata, \"Pendapatmu itu salah. Wahai anak saudara perempuanku! Rasulullah shallallahu 'alaihi wasallam dan kaum muslimin semuanya melakukan sa'i antara Shafa dan Marwa. Dan yang demikian itu adalah sunnah. Dahulu, para penyembah berhala Manat yang berada di Musyallal, mereka memang tidak sa'i antara Shafa dan Marwa. Maka ketika Islam datang, hal itu kami tanyakan kepada Nabi shallallahu 'alaihi wasallam. Lalu Allah 'azza wajalla pun menurunkan ayat: 'Sesungguhnya Shafa dan Marwa termasuk lambang-lambang kebesaran Agama Allah. Maka siapa yang haji ke Bait, atau umrah, tidaklah berdosa mereka sa'i antara keduanya.' (Al Baqarah: 158). Sekiranya benar apa yang kamu katakan, maka seharus ayat itu berbunyi: 'Tidaklah berdosa orang yang tidak sa'i antara keduanya.' Az Zuhri berkata; Kemudian saya menuturkan hal kepada Abu Bakr bin Abdurrahman bin Harits bin Hisyam, lalu ia pun merasa ta'ajub seraya berkata, \"Sungguh, ini benar-benar merupakan ilmu. Saya telah mendengar seorang ahli ilmu yang mengatakan bahwa; Orang-orang yang tidak Sa'i antara Shafa dan Marwa adalah orang-orang Arab, mereka berkata, 'Sesungguhnya thawaf kita antara kedua batu ini termasuk perbuatan jahiliyah.' Sementara orang-orang Anshar mengatakan, 'Kita hanya diperintahkan untuk melakukan thawaf di Baitullah, dan tidak diperintahkan sa'i antara Shafa dan Marwa.' Maka Allah pun menurunkan ayat: 'Sesungguhnya Shafa dan Marwa termasuk lambang-lambang kebesaran Agama Allah.' \" Abu Bakr bin Abdurrahman berkata; Maka aku telah diberitahu, bahwa ayat itu turun kepada kelompok ini dan itu. Dan telah menceritakan kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Hujain bin Al Mutsanna] Telah menceritakan kepada kami [Laits] dari [Uqail] dari [Ibnu Syihab] bahwa ia berkata, telah mengabarkan kepadaku [Urwah bin Zubair] ia berkata; \"Aku bertanya kepada [Aisyah] …\" Ia pun menyebutkan hadits yang semisalnya. Kemudian ia menyebutkan di dalam hadits itu; Ketika mereka menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, mereka berkata, \"Wahai Rasulullah, kami merasa berdosa bila melakukan sa'i antara Shafa dan Marwa.\" Lalu Allah 'azza wajalla pun menurunkan ayat: \"Sesungguhnya Shafa dan Marwa termasuk lambang-lambang kebesaran Agama Allah. Maka siapa yang haji ke Bait, atau umrah, tidaklah berdosa mereka sa'i antara keduanya.\" (Al Baqarah: 158). Aisyah berkata, \"Rasulullah shallallahu 'alaihi wasallam telah memasukkannya sebagai perbuatan sunnah, maka tidak seorang pun yang boleh meninggalkan Sa'i antara keduanya.\""
            },
            {
                "number": 2094,
                "arab": "و حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ الْأَنْصَارَ كَانُوا قَبْلَ أَنْ يُسْلِمُوا هُمْ وَغَسَّانُ يُهِلُّونَ لِمَنَاةَ فَتَحَرَّجُوا أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ وَكَانَ ذَلِكَ سُنَّةً فِي آبَائِهِمْ مَنْ أَحْرَمَ لِمَنَاةَ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَإِنَّهُمْ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ حِينَ أَسْلَمُوا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِي ذَلِكَ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ }",
                "id": "Dan Telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Urwah bin Zubair] bahwa [Aisyah] telah mengabarkan kepadanya bahwasanya; Dahulu orang-orang Anshar sebelum memeluk Islam, mereka dan Bani Ghassan menyembah berhala Manat, sehingga mereka merasa berdosa untuk thawaf antara Shafa dan Marwa. Hal itu telah menjadi kebiasaan nenek moyang mereka, bahwa siapa yang ihram untuk Manat, maka ia tidak boleh thawaf antara Shafa dan Marwa. Dan saat mereka masuk Islam, mereka pun menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka Allah 'azza wajalla menurunkan ayat mengenai hal itu: \"Sesungguhnya Shafaa dan Marwa adalah sebahagian dari syi'ar Allah. Maka barangsiapa yang beribadah haji ke Baitullah atau ber-'umrah, Maka tidak ada dosa baginya mengerjakan sa'i antara keduanya. dan barangsiapa yang mengerjakan suatu kebajikan dengan kerelaan hati, Maka Sesungguhnya Allah Maha Mensyukuri kebaikan lagi Maha Mengetahui.\""
            },
            {
                "number": 2095,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ عَنْ أَنَسٍ قَالَكَانَتْ الْأَنْصَارُ يَكْرَهُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى نَزَلَتْ{ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا }",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Ashim] dari [Anas] ia berkata; Dulu kaum Anshar tidak mau melaksanakan thawaf (sa'i) antara shafa dan marwa hingga turunlah ayat; \"Sesungguhnya Shafaa dan Marwa adalah sebahagian dari syi'ar Allah. Maka barangsiapa yang beribadah haji ke Baitullah atau ber-'umrah, Maka tidak ada dosa baginya mengerjakan sa'i antara keduanya.\""
            },
            {
                "number": 2096,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُالَمْ يَطُفْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا أَصْحَابُهُ بَيْنَ الصَّفَا وَالْمَرْوَةِ إِلَّا طَوَافًا وَاحِدًاو حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَقَالَ إِلَّا طَوَافًا وَاحِدًا طَوَافَهُ الْأَوَّلَ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata; \"Tidaklah Nabi shallallahu 'alaihi wasallam melakukan Thawaf (Sa'i) antara Shafa dan Marwa kecuali hanya sekali thawaf.\" Dan Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] dengan isnad ini, semisalnya, dan ia menyebutkan; \"Keculai satu thawaf yaitu thawaf beliau yang pertama.\""
            },
            {
                "number": 2097,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ قَالَ أَخْبَرَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَرْمَلَةَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَرَدِفْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَرَفَاتٍ فَلَمَّا بَلَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشِّعْبَ الْأَيْسَرَ الَّذِي دُونَ الْمُزْدَلِفَةِ أَنَاخَ فَبَالَ ثُمَّ جَاءَ فَصَبَبْتُ عَلَيْهِ الْوَضُوءَ فَتَوَضَّأَ وُضُوءًا خَفِيفًا ثُمَّ قُلْتُ الصَّلَاةَ يَا رَسُولَ اللَّهِ فَقَالَ الصَّلَاةُ أَمَامَكَ فَرَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَى الْمُزْدَلِفَةَ فَصَلَّى ثُمَّ رَدِفَ الْفَضْلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدَاةَ جَمْعٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah bin Sa'id] dan [Ibnu Hujr] mereka berkata, Telah menceritakan kepada kami [Isma'il] -dalam riwyat lain Dan Telah menceritakan kepada kami [Yahya bin Yahya] -lafazh juga miliknya- ia berkata, telah mengabarkan kepada kami [Isma'il bin Ja'far] dari [Muhammad bin Abu Harmalah] dari [Kuraib] Maula Ibnu Abbas, dari [Usamah bin Zaid] ia berkata; Aku pernah membonceng di belakang Rasulullah shallallahu 'alaihi wasallam dari Arafah. Ketika Rasulullah shallallahu 'alaihi wasallam sampai di bukit sebelah kiri sebelum Muzdalifah, beliau mengistirahatkan hewan tunggangannya. Kemudian beliau kencing, setelah itu beliau datang, lalu aku menuangkan air wudlu untuknya, maka beliau pun berwudlu dengan wudlu ringan. Sesudah itu, aku berkata, \"Apakah Anda hendak sholat wahai Rasulullah?\" beliau bersabda: \"sholat (nanti) di depanmu (yakni Muzdalifah).\" Lalu Rasulullah shallallahu 'alaihi wasallam menaiki kembali kendaraannya hingga sampai di Muzdalifah, kemudian beliau sholat. setelah itu, Al Fadllu membonceng di belakang Rasulullah shallallahu 'alaihi wasallam dari Muzdalifah."
            },
            {
                "number": 2098,
                "arab": "قَالَ كُرَيْبٌ فَأَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ عَنْ الْفَضْلِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَزَلْ يُلَبِّي حَتَّى بَلَغَ الْجَمْرَةَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah bin Sa'id] dan [Ibnu Hujr] mereka berkata, Telah menceritakan kepada kami [Isma'il] -dalam riwyat lain Dan Telah menceritakan kepada kami [Yahya bin Yahya] -lafazh juga miliknya- ia berkata, telah mengabarkan kepada kami [Isma'il bin Ja'far] dari [Muhammad bin Abu Harmalah] dari [Kuraib] berkata; telah mengabarkan kepadaku [Abdullah bin Abbas] dari [Al Fadll] bahwasanya; Rasulullah shallallahu 'alaihi wasallam senantiasa membaca talbiyah sampai beliau melempar Jamrah."
            },
            {
                "number": 2099,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ كِلَاهُمَا عَنْ عِيسَى بْنِ يُونُسَ قَالَ ابْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ أَخْبَرَنِي ابْنُ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْدَفَ الْفَضْلَ مِنْ جَمْعٍ قَالَ فَأَخْبَرَنِي ابْنُ عَبَّاسٍ أَنَّ الْفَضْلَ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ",
                "id": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ali bin Khasyram] keduanya dari [Isa bin Yunus] -[Ibnu Khasyram] berkata- telah mengabarkan kepada kami [Isa] dari [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] telah mengabarkan kepadaku [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam membonceng Al Fadlla dari Jam'. Atha` berkata; bahwa [Al Fadla] telah mengabarkan kepadanya, bahwasanya; \"Nabi shallallahu 'alaihi wasallam terus bertalbiyah hingga beliau melempar Jamrah 'Aqabah.\""
            },
            {
                "number": 2100,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنِي اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ أَبِي مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍ وَكَانَ رَدِيفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهُ قَالَ فِي عَشِيَّةِ عَرَفَةَ وَغَدَاةِ جَمْعٍ لِلنَّاسِ حِينَ دَفَعُوا عَلَيْكُمْ بِالسَّكِينَةِ وَهُوَ كَافٌّ نَاقَتَهُ حَتَّى دَخَلَ مُحَسِّرًا وَهُوَ مِنْ مِنًى قَالَ عَلَيْكُمْ بِحَصَى الْخَذْفِ الَّذِي يُرْمَى بِهِ الْجَمْرَةُ وَقَالَ لَمْ يَزَلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ فِي الْحَدِيثِ وَلَمْ يَزَلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ وَزَادَ فِي حَدِيثِهِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشِيرُ بِيَدِهِ كَمَا يَخْذِفُ الْإِنْسَانُ",
                "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Laits] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepadaku [Laits] dari [Abu Zubair] dari [Abu Ma'bad] Maula Ibnu Abbas, dari [Ibnu Abbas] dari [Al Fadll bin Abbas] bahwa ia membonceng di belakang Rasulullah shallallahu 'alaihi wasallam. Dan ia berkata kepada orang-orang di sore hari Arafah dan pagi hari di Jam' yakni saat mereka berangkat, \"Hendaklah kalian berjalan dengan tenang.\" Dan ia senantiasa menjalankan Unta dengan pelan-pelan hingga beliau memasuki lembah Muhassir, dan saat itu ia datang dari Mina. Ia berkata, \"Hendaklah kalian mengambil kerikil untuk melempar Jumrah. Rasulullah shallallahu 'alaihi wasallam senantiasa membaca talbiyah hingga beliau selesai melempar jumrah.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] dengan isnad ini, hanya saja ia tidak menyebutkan di dalam hadits; \"shallallahu 'alaihi wasallam senantiasa membaca talbiyah hingga beliau selesai melempar jumrah.\" Dan ia menambahkan; \"Nabi shallallahu 'alaihi wasallam memberi isyarat dengan tangannya, sebagaimana manusia melempar.\" "
            },
            {
                "number": 2101,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ حُصَيْنٍ عَنْ كَثِيرِ بْنِ مُدْرِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَقَالَ عَبْدُ اللَّهِ وَنَحْنُ بِجَمْعٍ سَمِعْتُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ يَقُولُ فِي هَذَا الْمَقَامِ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abul Ahwash] dari [Hushain] dari [Katsir bin Mudrik] dari [Abdurrahman bin Yazid] ia berkata; [Abdullah] berkata saat kami berada di Jam'; Aku telah mendengar seorang yang telah diturunkan kepadanya surat Al Baqarah, yakni di tempat ini membaca: \"LABBAIKA ALLAHUMMA LABBAIKA (Aku penuhi panggilan-Mu, Ya Allah aku penuhi panggilan-Mu).\""
            },
            {
                "number": 2102,
                "arab": "و حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنْ كَثِيرِ بْنِ مُدْرِكٍ الْأَشْجَعِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَأَنَّ عَبْدَ اللَّهِ لَبَّى حِينَ أَفَاضَ مِنْ جَمْعٍ فَقِيلَ أَعْرَابِيٌّ هَذَا فَقَالَ عَبْدُ اللَّهِ أَنَسِيَ النَّاسُ أَمْ ضَلُّوا سَمِعْتُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ يَقُولُ فِي هَذَا الْمَكَانِ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَو حَدَّثَنَاه حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا سُفْيَانُ عَنْ حُصَيْنٍ بِهَذَا الْإِسْنَادِ",
                "id": "Dan Telah menceritakan kepada kami [Suraij bin Yunus] Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Hushain] dari [Katsir bin Mudrik Al Asyja'i] dari [Abdurrahman bin Yazid] bahwasanya; [Abdullah] membaca talbiyah (mulai ihram) saat ia berangkat dari Jam', lalu dikatakanlah kepadanya, \"Ini adalah seorang A'rabi.\" Maka Abdullah pun berkata, \"Apakah orang-orang telah lupa, ataukah mereka telah sesat. Aku telah mendengar seorang yang telah diturunkan surat Al Baqarah kepadanya di tempat ini, ia membaca: \"LABBAIKA ALLAHUMMA LABBAIKA (Aku penuhi panggilan-Mu, Ya Allah aku penuhi panggilan-Mu).\" Dan Telah menceritakannya kepada kami [Hasan Al Hulwani] Telah menceritakan kepada kami [Yahya bin Adam] Telah menceritakan kepada kami [Sufyan] dari [Hushain] dengan isnad ini."
            },
            {
                "number": 2103,
                "arab": "و حَدَّثَنِيهِ يُوسُفُ بْنُ حَمَّادٍ الْمَعْنِيُّ حَدَّثَنَا زِيَادٌ يَعْنِي الْبَكَّائِيَّ عَنْ حُصَيْنٍ عَنْ كَثِيرِ بْنِ مُدْرِكٍ الْأَشْجَعِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ وَالْأَسْوَدِ بْنِ يَزِيدَ قَالَا سَمِعْنَا عَبْدَ اللَّهِ بْنَ مَسْعُودٍيَقُولُ بِجَمْعٍ سَمِعْتُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ هَاهُنَا يَقُولُ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ ثُمَّ لَبَّى وَلَبَّيْنَا مَعَهُ",
                "id": "Dan telah menceritakannya kepadaku [Yusuf bin Hammad Al Ma'ni] Telah menceritakan kepada kami [Ziyad Al Bakka`i] dari [Hushain] dari [Katsir bin Mudrik Al Asyja'i] dari [Abdurrahman bin Yazid] dan [Al Aswad bin Yazid] keduanya berkata, kami mendengar [Abdullah bin Mas'ud] berkata di Jam'; Aku mendengar seorang yang telah diturunkan kepadanya surat Al Baqarah di tempat ini membaca: \"LABBAIKA ALLAHUMMA LABBAIKA (Aku penuhi panggilan-Mu, Ya Allah aku penuhi panggilan-Mu).\" Sesudah itu, ia membaca talbiyah, dan kami pun ikut bertalbiyah (memulai Ihram)."
            },
            {
                "number": 2104,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى الْأُمَوِيُّ حَدَّثَنِي أَبِي قَالَا جَمِيعًا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَغَدَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مِنًى إِلَى عَرَفَاتٍ مِنَّا الْمُلَبِّي وَمِنَّا الْمُكَبِّرُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Muhammad bin Al Mutsanna] keduanya berkata, Telah menceritakan kepada kami [Abdullah bin Numair] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Sa'id bin Yahya Al Umawi] telah menceritakan kepadaku [bapakku] semuanya berkata, Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Abdullah bin Abu Salamah] dari [Abdullah bin Abdullah bin Umar] dari [bapaknya] ia berkata; \"Kami berangkat pagi-pagi bersama Rasulullah shallallahu 'alaihi wasallam dari Mina ke Arafah. Dalam rombongan kami, ada yang membaca talbiyah, dan ada pula yang membaca takbir.\""
            },
            {
                "number": 2105,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَيَعْقُوبُ الدَّوْرَقِيُّ قَالُوا أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ عَنْ عُمَرَ بْنِ حُسَيْنٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَدَاةِ عَرَفَةَ فَمِنَّا الْمُكَبِّرُ وَمِنَّا الْمُهَلِّلُ فَأَمَّا نَحْنُ فَنُكَبِّرُ قَالَ قُلْتُ وَاللَّهِ لَعَجَبًا مِنْكُمْ كَيْفَ لَمْ تَقُولُوا لَهُ مَاذَا رَأَيْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] dan [Harun bin Abdullah] dan [Ya'qub Ad Dauraqi] mereka berkata, telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Abdul Aziz bin Abu Usamah] dari [Amru bin Husain] dari [Abdullah bin Abu Salamah] dari [Abdullah bin Abdullah bin Umar] dari [bapaknya] ia berkata; Pagi hari di Arafah, kami bersama Rasulullah shallallahu 'alaihi wasallam. Dan di antara rombongan kami ada yang membaca talbiyah, namun kami membaca takbir.\" Maka aku pun berkata, \"Demi Allah, sungguh mengherankan kalian ini, kenapa kalian tidak bertanya kepadanya, \"Apa yang diperbuat Rasulullah shallallahu 'alaihi wasallam?\""
            },
            {
                "number": 2106,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الثَّقَفِيِّأَنَّهُ سَأَلَ أَنَسَ بْنَ مَالِكٍ وَهُمَا غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَةَ كَيْفَ كُنْتُمْ تَصْنَعُونَ فِي هَذَا الْيَوْمِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَانَ يُهِلُّ الْمُهِلُّ مِنَّا فَلَا يُنْكَرُ عَلَيْهِ وَيُكَبِّرُ الْمُكَبِّرُ مِنَّا فَلَا يُنْكَرُ عَلَيْهِ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Muhammad bin Abu Bakr Ats Tsaqafi] bahwa ia pernah bertanya kepada [Anas bin Malik], yakni di waktu pagi saat keduanya berada berangkat dari Mina ke Arafah, \"Apa yang dulu kalian lakukan di hari ini bersama Rasulullah shallallahu 'alaihi wasallam?\" Anas menjawab, \"Dari rombongan kami ada yang membaca tahlil dan ia tidak diingkari, kemudian ada pula yang membaca takbir, dan ia pun tidak diingkari (oleh Rasulullah shallallahu 'alaihi wasallam).\""
            },
            {
                "number": 2107,
                "arab": "و حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ عَنْ مُوسَى بْنِ عُقْبَةَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ قَالَقُلْتُ لِأَنَسِ بْنِ مَالِكٍ غَدَاةَ عَرَفَةَ مَا تَقُولُ فِي التَّلْبِيَةِ هَذَا الْيَوْمَ قَالَ سِرْتُ هَذَا الْمَسِيرَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابِهِ فَمِنَّا الْمُكَبِّرُ وَمِنَّا الْمُهَلِّلُ وَلَا يَعِيبُ أَحَدُنَا عَلَى صَاحِبِهِ",
                "id": "Dan telah menceritakan kepadaku [Suraij bin Yunus] Telah menceritakan kepada kami [Abdullah bin Raja`] dari [Musa bin Uqbah] telah menceritakan kepadaku [Muhammad bin Abu Bakr] ia berkata; saya bertanya kepada [Anas] di waktu pagi saat berada di Arafah, \"Bagaimana menurut Anda mengenai talbiyah di hari ini?\" Anas menjawab, \"Aku menelusuri jalan ini bersama Nabi shallallahu 'alaihi wasallam, di antara kami ada yang membaca takbir dan ada pula yang membaca tahlil, namun tak seorang pun dari kami yang mencela temannya.\""
            },
            {
                "number": 2108,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ سَمِعَهُ يَقُولُدَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَرَفَةَ حَتَّى إِذَا كَانَ بِالشِّعْبِ نَزَلَ فَبَالَ ثُمَّ تَوَضَّأَ وَلَمْ يُسْبِغْ الْوُضُوءَ فَقُلْتُ لَهُ الصَّلَاةَ قَالَ الصَّلَاةُ أَمَامَكَ فَرَكِبَ فَلَمَّا جَاءَ الْمُزْدَلِفَةَ نَزَلَ فَتَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ثُمَّ أُقِيمَتْ الصَّلَاةُ فَصَلَّى الْمَغْرِبَ ثُمَّ أَنَاخَ كُلُّ إِنْسَانٍ بَعِيرَهُ فِي مَنْزِلِهِ ثُمَّ أُقِيمَتْ الْعِشَاءُ فَصَلَّاهَا وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Musa bin Uqbah] dari [Kuraib] Maula Ibnu Abbas, dari [Usamah bin Zaid] bahwa ia telah mendengarnya berkata; Rasulullah shallallahu 'alaihi wasallam berangkat dari Arafah. Ketika sampai di suatu Bukit, beliau turun hendak buang air kecil dan sesudah itu beliau wudlu dengan sederhana. Lalu aku bertanya kepada beliau, \"Apakah sekarang Anda akan sholat?\" beliau menjawab: \"Nanti saja, pada perhentian berikutnya.\" Kemudian beliau naik kendaraan kembali. setelah sampai di Muzdalifah beliau turun, lalu wudlu dengan sempurna. Kemudian iqamat, lalu beliau sholat Maghrib, dan semua orang berhenti di situ. Lalu diiqamatkan pula sholat isyak, tanpa sholat sunnah antara keduanya."
            },
            {
                "number": 2109,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُوسَى بْنِ عُقْبَةَ مَوْلَى الزُّبَيْرِ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَانْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ الدَّفْعَةِ مِنْ عَرَفَاتٍ إِلَى بَعْضِ تِلْكَ الشِّعَابِ لِحَاجَتِهِ فَصَبَبْتُ عَلَيْهِ مِنْ الْمَاءِ فَقُلْتُ أَتُصَلِّي فَقَالَ الْمُصَلَّى أَمَامَكَ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] dari [Yahya bin Sa'id] dari [Musa bin Uqbah] Maula Az Zubair, dari [Kuraib] Maula Ibnu Abbas, dari [Usamah bin Zaid] ia berkata; Rasulullah shallallahu 'alaihi wasallam beranjak dari Arafah. Dan setelah sampai di suatu bukit, beliau pergi untuk buang hajat. Sesudah itu, aku pun menuangkan air untuk beliau. Lalu aku bertanya, \"Apakah Anda akan menunaikan sholat?\" maka beliau menjawab: \"Tempat sholat masih di depanmu.\""
            },
            {
                "number": 2110,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا زُهَيْرٌ أَبُو خَيْثَمَةَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُقْبَةَ أَخْبَرَنِي كُرَيْبٌأَنَّهُ سَأَلَ أُسَامَةَ بْنَ زَيْدٍ كَيْفَ صَنَعْتُمْ حِينَ رَدِفْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةَ عَرَفَةَ فَقَالَ جِئْنَا الشِّعْبَ الَّذِي يُنِيخُ النَّاسُ فِيهِ لِلْمَغْرِبِ فَأَنَاخَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاقَتَهُ وَبَالَ وَمَا قَالَ أَهَرَاقَ الْمَاءَ ثُمَّ دَعَا بِالْوَضُوءِ فَتَوَضَّأَ وُضُوءًا لَيْسَ بِالْبَالِغِ فَقُلْتُ يَا رَسُولَ اللَّهِ الصَّلَاةَ فَقَالَ الصَّلَاةُ أَمَامَكَ فَرَكِبَ حَتَّى جِئْنَا الْمُزْدَلِفَةَ فَأَقَامَ الْمَغْرِبَ ثُمَّ أَنَاخَ النَّاسُ فِي مَنَازِلِهِمْ وَلَمْ يَحُلُّوا حَتَّى أَقَامَ الْعِشَاءَ الْآخِرَةَ فَصَلَّى ثُمَّ حَلُّوا قُلْتُ فَكَيْفَ فَعَلْتُمْ حِينَ أَصْبَحْتُمْ قَالَ رَدِفَهُ الْفَضْلُ بْنُ عَبَّاسٍ وَانْطَلَقْتُ أَنَا فِي سُبَّاقِ قُرَيْشٍ عَلَى رِجْلَيَّ",
                "id": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Yahya bin Adam] Telah menceritakan kepada kami [Zuhair Abu Khaitsamah] Telah menceritakan kepada kami [Ibrahim bin Uqbah] telah mengabarkan kepadaku [Kuraib] bahwa ia pernah bertanya kepada [Usamah bin Zaid], \"Apa yang kalian perbuat saat membonceng di belakang Rasulullah shallallahu 'alaihi wasallam saat sore hari di Arafah?\" Maka Usamah pun menjawab, \"Ketika kami sampai di suatu bukit tempat orang-orang menambatkan kendaraannya di situ untuk sholat Maghrib, Rasulullah shallallahu 'alaihi wasallam juga ikut manambatkan Untanya. Lalu beliau kencing -dan perawi tidak menyebutkan; Ahraqal Maa` (menuangkan air) - dan setelah itu meminta air, kemudian beliau pun berwudlu dengan tidak sempurna. Aku pun bertanya, \"Wahai Rasulullah, apakah Anda akan sholat?\" beliau menjawab: \"Nanti di persinggahan berikutnya.\" Kemudian beliau melanjutkan perjalanan hingga sampai di Muzdalifah. Maka iqamah sholat Maghrib dikumandangkan dan orang-orang pun menambatkan kendaraannya di persinggahan mereka tanpa menurunkan perbekalan yang mereka bawa hingga iqamah sholat Isya dikumandangkan. Setelah itu, barulah mereka menurunkan perbekalan. Kuraib berkata; Aku bertanya lagi, \"Apa yang kalian lakukan di pagi hari?\" Ia menjawab, \"Fadl bin Abbas gantian membonceng di belakang beliau, sementara aku berangkat berjalan bersama orang-orang Quraisy.\""
            },
            {
                "number": 2111,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ أُسَامَةَ بْنِ زَيْدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَتَى النَّقْبَ الَّذِي يَنْزِلُهُ الْأُمَرَاءُ نَزَلَ فَبَالَ وَلَمْ يَقُلْ أَهَرَاقَ ثُمَّ دَعَا بِوَضُوءٍ فَتَوَضَّأَ وُضُوءًا خَفِيفًا فَقُلْتُ يَا رَسُولَ اللَّهِ الصَّلَاةَ فَقَالَ الصَّلَاةُ أَمَامَكَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Uqbah] dari [Kuraib] dari [Usamah bin Zaid] bahwa ketika Rasulullah shallallahu 'alaihi wasallam sampai di jalan yang berada di atantara dua bukit -suatu tempat yang biasa digunakan sebagai persinggahan oleh para pemimpin-, beliau turun, dan kencing. Kemudian beliau minta air wudlu, lalu beliau pun berwudlu dengan ringan. Aku pun bertanya, \"Wahai Rasulullah, apakah Anda akan sholat?\" beliau menjawab: \"Tempat sholat masih di depanmu.\""
            },
            {
                "number": 2112,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَاضَ مِنْ عَرَفَةَ وَأُسَامَةُ رِدْفُهُ قَالَ أُسَامَةُ فَمَا زَالَ يَسِيرُ عَلَى هَيْئَتِهِ حَتَّى أَتَى جَمْعًا",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Abdul Malik bin Abu Sulaiman] dari [Atha`] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam berangkat dari Arafah, sementara Usamah membonceng di belakangnya. Usamah berkata, \"Beliau terus melanjutkan perjalanan hingga sampai di Jam'."
            },
            {
                "number": 2113,
                "arab": "و حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ جَمِيعًا عَنْ حَمَّادِ بْنِ زَيْدٍ قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ قَالَسُئِلَ أُسَامَةُ وَأَنَا شَاهِدٌ أَوْ قَالَ سَأَلْتُ أُسَامَةَ بْنَ زَيْدٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْدَفَهُ مِنْ عَرَفَاتٍ قُلْتُ كَيْفَ كَانَ يَسِيرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَفَاضَ مِنْ عَرَفَةَ قَالَ كَانَ يَسِيرُ الْعَنَقَ فَإِذَا وَجَدَ فَجْوَةً نَصَّو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ وَزَادَ فِي حَدِيثِ حُمَيْدٍ قَالَ هِشَامٌ وَالنَّصُّ فَوْقَ الْعَنَقِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] dan [Qutaibah bin Sa'id] semuanya dari [Hammad bin Zaid] - [Abu Rabi'] berkata- Telah menceritakan kepada kami [Hammad] Telah menceritakan kepada kami [Hisyam] dari [bapaknya] ia berkata; [Usamah] pernah ditanya -atau ia mengatakan- Saya pernah bertanya kepada Usamah bin Zaid, yang ia pernah membonceng di belakang Rasulullah shallallahu 'alaihi wasallam saat perjalanan dari Arafah. Saya bertanya, \"Bagaimana perjalanan Rasulullah shallallahu 'alaihi wasallam saat beliau berangkat dari Arafah?\" Usamah menjawab, \"Beliau berjalan dengan kecepatan sedang, dan apabila beliau mendapati jalan yang luas, maka beliau akan berjalan dengan cepat.\" Dan Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abdah bin Sulaiman] dan [Abdullah bin Numair] dan [Humaid bin Abdurrahman] dari [Hisyam bin Urwah] dengan isnad ini, dan ia menambahkan di dalam haditsnya Humaid; Hisyam berkata; \"An Nashshu Fauqal 'Anaq (berjalan cepat di atas kecepatan sedang).\""
            },
            {
                "number": 2114,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ أَخْبَرَنِي عَدِيُّ بْنُ ثَابِتٍ أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْخَطْمِيَّ حَدَّثَهُ أَنَّ أَبَا أَيُّوبَ أَخْبَرَهُأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِو حَدَّثَنَاه قُتَيْبَةُ وَابْنُ رُمْحٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ بِهَذَا الْإِسْنَادِ قَالَ ابْنُ رُمْحٍ فِي رِوَايَتِهِ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ وَكَانَ أَمِيرًا عَلَى الْكُوفَةِ عَلَى عَهْدِ ابْنِ الزُّبَيْرِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Sulaiman bin Bilal] dari [Yahya bin Sa'id] telah mengabarkan kepadaku [Adi bin Tsabit] bahwa [Abdullah bin Yazid Al Khathmi] telah menceritakan kepadanya, bahwa [Abu Ayyub] telah mengabarkan kepadanya, bahwa ia pernah sholat bersama Rasulullah shallallahu 'alaihi wasallam pada saat haji Wada', yaitu sholat Maghrib dan Isya` di Muzdalifah. Dan Telah menceritakannya kepada kami [Qutaibah] dan [Ibnu Rumh] dari [Laits bin Sa'id] dari [Yahya bin Sa'id] dengan Isnad ini. Ibnu Rumh berkata di dalam riwayatnya; Dari Abdullah bin Yazid Al Khathmi, ia adalah seorang gubernur Kufah pada masa pemerintahan Ibnu Zubair."
            },
            {
                "number": 2115,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ أَخْبَرَهُ أَنَّ أَبَاهُ قَالَجَمَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ لَيْسَ بَيْنَهُمَا سَجْدَةٌ وَصَلَّى الْمَغْرِبَ ثَلَاثَ رَكَعَاتٍ وَصَلَّى الْعِشَاءَ رَكْعَتَيْنِفَكَانَ عَبْدُ اللَّهِ يُصَلِّي بِجَمْعٍ كَذَلِكَ حَتَّى لَحِقَ بِاللَّهِ تَعَالَى",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] bahwa [ubaidhullah bin Abdullah bin Umar] telah mengabarkan kepadanya, bahwa [bapaknya] berkata; \"Rasulullah shallallahu 'alaihi wasallam menjamak antara sholat Maghrib dan Isya` di Jam'. Di antara keduanya tidak ada sholat (sunnah). Beliau sholat Maghrib tiga raka'at dan sholat Isya` dua raka'at.\" Abdullah selalu sholat seperti itu di Jam' hingga ia berjumpa dengan Allah (wafat)."
            },
            {
                "number": 2116,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ وَسَلَمَةَ بْنِ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍأَنَّهُ صَلَّى الْمَغْرِبَ بِجَمْعٍ وَالْعِشَاءَ بِإِقَامَةٍ ثُمَّ حَدَّثَ عَنْ ابْنِ عُمَرَ أَنَّهُ صَلَّى مِثْلَ ذَلِكَ وَحَدَّثَ ابْنُ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ مِثْلَ ذَلِكَو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ وَقَالَ صَلَّاهُمَا بِإِقَامَةٍ وَاحِدَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dan [Salamah bin Kuhail] dari [Sa'id bin Jubair] bahwa ia pernah sholat Maghrib di Jam' kemudian sholat Isya dengan satu Iqamah. Sesudah itu, ia menceritakan dari [Ibnu Umar] bahwasanya; Ia pernah sholat seperti itu. Kemudian Ibnu Umar menceritakan bahwa Nabi shallallahu 'alaihi wasallam melakukannya seperti itu. Dan telah menceritakannya kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Syu'bah] dengan isnad ini, dan ia menyebutkan; \"Beliau menunaikan sholat (Maghrib dan Isya`) dengan satu Iqamah.\""
            },
            {
                "number": 2117,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ أَبِي إِسْحَقَ قَالَ قَالَ سَعِيدُ بْنُ جُبَيْرٍأَفَضْنَا مَعَ ابْنِ عُمَرَ حَتَّى أَتَيْنَا جَمْعًا فَصَلَّى بِنَا الْمَغْرِبَ وَالْعِشَاءَ بِإِقَامَةٍ وَاحِدَةٍ ثُمَّ انْصَرَفَ فَقَالَ هَكَذَا صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْمَكَانِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abdullah bin Numair] Telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Abu Ishaq] ia berkata, [Sa'id bin Jubair] berkata; Kami berangkat bersama [Ibnu Umar] hingga sampai di Jam'. Lalu ia pun sholat Maghrib dan Isya` bersama kami dengan satu Iqamah. Dan setelah selesai ia berkata, \"Seperti inilah Rasulullah shallallahu 'alaihi wasallam sholat bersama kami ditempat ini.\""
            },
            {
                "number": 2118,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ قَالَ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةً إِلَّا لِمِيقَاتِهَا إِلَّا صَلَاتَيْنِ صَلَاةَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ وَصَلَّى الْفَجْرَ يَوْمَئِذٍ قَبْلَ مِيقَاتِهَاو حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ جَرِيرٍ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَقَالَ قَبْلَ وَقْتِهَا بِغَلَسٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] semuanya dari [Abu Mu'awiyah] - [Yahya] berkata- telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Umarah] dari [Abdurrahman bin Yazid] dari [Abdullah] ia berkata; \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam menunaikan sholat melainkan tepat pada waktunya, kecuali dua sholat, yaitu sholat Maghrib dan Isya`. Dan di hari itu, beliau sholat Shubuh sebelum waktunya.\" Dan Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] semuanya dari [Jarir] dari [Al A'masy] dengan isnad ini, dan ia menyebutkan; \"Sebelum waktunya, yakni saat kegelapan malam masih melekat.\""
            },
            {
                "number": 2119,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا أَفْلَحُ يَعْنِي ابْنَ حُمَيْدٍ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْاسْتَأْذَنَتْ سَوْدَةُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْمُزْدَلِفَةِ تَدْفَعُ قَبْلَهُ وَقَبْلَ حَطْمَةِ النَّاسِ وَكَانَتْ امْرَأَةً ثَبِطَةً يَقُولُ الْقَاسِمُ وَالثَّبِطَةُ الثَّقِيلَةُ قَالَ فَأَذِنَ لَهَا فَخَرَجَتْ قَبْلَ دَفْعِهِ وَحَبَسَنَا حَتَّى أَصْبَحْنَا فَدَفَعْنَا بِدَفْعِهِ وَلَأَنْ أَكُونَ اسْتَأْذَنْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا اسْتَأْذَنَتْهُ سَوْدَةُ فَأَكُونَ أَدْفَعُ بِإِذْنِهِ أَحَبُّ إِلَيَّ مِنْ مَفْرُوحٍ بِهِ",
                "id": "Dan Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] Telah menceritakan kepada kami [Aflah bin Humaid] dari [Qasim] dari [Aisyah] bahwa ia berkata; Saudah pernah meminta izin kepada Rasulullah shallallahu 'alaihi wasallam di malam Muzdalifah untuk berangkat mendahului beliau dan rombongan orang banyak -Saudah adalah seorang wanita gemuk yang lamban-. Aisyah berkata; Maka Rasulullah shallallahu 'alaihi wasallam pun mengizinkannya, lalu Saudah berangkat mendahului keberangkatan Rasulullah shallallahu 'alaihi wasallam. Lalu kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam. Seandainya aku meminta izin kepada beliau sebagaimana Saudah, lalu aku berangkat dengan izin beliau, adalah lebih aku senangi daripada aku berangkat bersama beliau."
            },
            {
                "number": 2120,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى جَمِيعًا عَنْ الثَّقَفِيِّ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا أَيُّوبُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْكَانَتْ سَوْدَةُ امْرَأَةً ضَخْمَةً ثَبِطَةً فَاسْتَأْذَنَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُفِيضَ مِنْ جَمْعٍ بِلَيْلٍ فَأَذِنَ لَهَا فَقَالَتْ عَائِشَةُ فَلَيْتَنِي كُنْتُ اسْتَأْذَنْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا اسْتَأْذَنَتْهُ سَوْدَةُ وَكَانَتْ عَائِشَةُ لَا تُفِيضُ إِلَّا مَعَ الْإِمَامِ",
                "id": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Al Mutsanna] semuanya dari [Ats Tsaqafi] - [Ibnul Mutsanna] berkata- Telah menceritakan kepada kami [Abdul Wahhab] Telah menceritakan kepada kami [Ayyub] dari [Abdurrahman bin Al Qasim] dari [Al Qasim] dari [Aisyah] ia berkata; Saudah adalah seorang wanita yang gemuk lagi lamban. Maka ia pun meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk berangkat lebih awal dari Jam' di malam hari, maka beliau pun mengizinkannya. Maka Aisyah pun berkata, \"Sekiranya aku meminta izin kepada Rasulullah shallallahu 'alaihi wasallam sebagaimana Saudah.\" Saat itu, Aisyah tidak berangkat kecuali bersama Imam (Rasulullah shallallahu 'alaihi wasallam)."
            },
            {
                "number": 2121,
                "arab": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْوَدِدْتُ أَنِّي كُنْتُ اسْتَأْذَنْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا اسْتَأْذَنَتْهُ سَوْدَةُ فَأُصَلِّي الصُّبْحَ بِمِنًى فَأَرْمِي الْجَمْرَةَ قَبْلَ أَنْ يَأْتِيَ النَّاسُ فَقِيلَ لِعَائِشَةَ فَكَانَتْ سَوْدَةُ اسْتَأْذَنَتْهُ قَالَتْ نَعَمْ إِنَّهَا كَانَتْ امْرَأَةً ثَقِيلَةً ثَبِطَةً فَاسْتَأْذَنَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَذِنَ لَهَاو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ كِلَاهُمَا عَنْ سُفْيَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Dan Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [ubaidhullah bin Umar] dari [Abdurrahman bin Qasim] dari [Al Qasim] dari [Aisyah] ia berkata; Aku ingin pula minta izin kepada Rasulullah shallallahu 'alaihi wasallam seperti halnya Saudah minta izin kepadsa beliau, supaya aku bisa sholat Shubuh di Mina, lalu melontar Jumrah sebelum orang banyak datang.\" Lalu Aisyah pun ditanya, \"Apakah Saudah pernah meminta izin seperti itu kepada Rasulullah shallallahu 'alaihi wasallam?\" Aisyah menjawab, \"Ya, pernah. Karena Saudah adalah seorang wanita gemuk yang menyebabkan gerakannya lamban. Lalu dia minta izin kepada Rasulullah shallallahu 'alaihi wasallam, maka diizinkan oleh beliau.\" Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Waki'] -dalam riwayat lain- Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Abdurrahman] keduanya dari [Sufyan] dari [Abdurrahman bin Qasim] dengan isnad ini, semisalnya."
            },
            {
                "number": 2122,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي عَبْدُ اللَّهِ مَوْلَى أَسْمَاءَ قَالَ قَالَتْ لِي أَسْمَاءُ وَهِيَ عِنْدَ دَارِ الْمُزْدَلِفَةِ هَلْ غَابَ الْقَمَرُ قُلْتُ لَا فَصَلَّتْ سَاعَةً ثُمَّ قَالَتْ يَا بُنَيَّ هَلْ غَابَ الْقَمَرُ قُلْتُ نَعَمْ قَالَتْ ارْحَلْ بِي فَارْتَحَلْنَا حَتَّى رَمَتْ الْجَمْرَةَ ثُمَّ صَلَّتْ فِي مَنْزِلِهَا فَقُلْتُ لَهَا أَيْ هَنْتَاهْ لَقَدْ غَلَّسْنَا قَالَتْ كَلَّاأَيْ بُنَيَّ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذِنَ لِلظُّعُنِو حَدَّثَنِيهِ عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ وَفِي رِوَايَتِهِ قَالَتْ لَا أَيْ بُنَيَّ إِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذِنَ لِظُعُنِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Bakr Al Muqaddami] Telah menceritakan kepada kami [Yahya Al Qaththan] dari [Ibnu Juraij] telah menceritakan kepadaku [Abdullah] Maula Asma`, ia berkata; [Asma`] bertanya kepadaku ketika dia bermalam di Muzdalifah, \"Apakah bulan telah hilang?\" Aku menjawab, \"Belum.\" Asma` kemudian sholat sejenak, lalu bertanya kembali, \"Hai anakku, apakah bulan telah hilang?\" aku menjawab, \"Sudah.\" Asma` berkata, \"Mari berangkat bersamaku.\" Maka kami pun berangkat hingga Asma` melempar Jumrah. Kemudian Asma` sholat di tempatnya, lalu aku bertanya kepadanya, \"Aduh! Kita terlalu awal, masih belum pagi.\" Asma` menjawab, \"Anakku jangan begitu! Sesungguhnya Nabi shallallahu 'alaihi wasallam mengizinkan para wanita untuk berangkat lebih awal.\" Dan telah menceritakannya kepadaku [Ali bin Khasyram] telah mengabarkan kepada kami [Isa bin Yunus] dari [Ibnu Juraij] dengan isnad ini. Dan di dalam riwayatnya ia menyebutkan; Asma` berkata; \"Tidak, wahai anakku, sesungguhnya Nabi shallallahu 'alaihi wasallam telah mengizinkan para isteri-isterinya (untuk berangkat lebih awal)."
            },
            {
                "number": 2123,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنِي عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى جَمِيعًا عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ أَنَّ ابْنَ شَوَّالٍ أَخْبَرَهُأَنَّهُ دَخَلَ عَلَى أُمِّ حَبِيبَةَ فَأَخْبَرَتْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بِهَا مِنْ جَمْعٍ بِلَيْلٍ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Yahya bin Sa'id] -dalam riwayat lain- Dan telah menceritakan kepadaku [Ali bin Khasyram] telah mengabarkan kepada kami [Isa] semuanya dari [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] bahwa [Ibnu Syawwal] telah mengabarkan kepadanya bahwasanya; Ia pernah menemui [Ummu Habibah], lalu ia pun mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam pernah mengutusnya dari Jam' pada malam hari."
            },
            {
                "number": 2124,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ ح و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَالِمِ بْنِ شَوَّالٍ عَنْ أُمِّ حَبِيبَةَ قَالَتْكُنَّا نَفْعَلُهُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُغَلِّسُ مِنْ جَمْعٍ إِلَى مِنًىوَفِي رِوَايَةِ النَّاقِدِ نُغَلِّسُ مِنْ مُزْدَلِفَةَ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Sufyan bin Uyainah] Telah menceritakan kepada kami [Amru bin Dinar] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Amru An Naqid] Telah menceritakan kepada kami [Sufyan] dari [Amru bin Dinar] dari [Salim bin Syawwal] dari [Ummu Habibah] ia berkata; Kami melakukannya di masa Nabi shallallahu 'alaihi wasallam, yaitu; Kami berangkat di akhir malam dari Jam' ke Mina. Sementara di dalam riwayatnya Naqid; Kami berangkat di akhir malam dari Muzdalifah."
            },
            {
                "number": 2125,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَقُتَيْبَةُ بْنُ سَعِيدٍ جَمِيعًا عَنْ حَمَّادٍ قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُابَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الثَّقَلِ أَوْ قَالَ فِي الضَّعَفَةِ مِنْ جَمْعٍ بِلَيْلٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Qutaibah bin Sa'id] semuanya dari [Hammad] - [Yahya] berkata- telah mengabarkan kepada kami [Hammad bin Zaid] dari [ubaidhullah bin Abu Yazid] ia berkata, saya mendengar [Ibnu Abbas] berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutusku membawa perbekalannya -atau ia mengatakan- bersama anggota keluarganya dari Jam' tepatnya pada malam hari.\""
            },
            {
                "number": 2126,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُاأَنَا مِمَّنْ قَدَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ضَعَفَةِ أَهْلِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Sufyan bin Uyainah] Telah menceritakan kepada kami [ubaidhullah bin Abu Yazid] bahwa ia mendengar [Ibnu Abbas] berkata; \"Aku termasuk yang didahulukan (untuk berangkat dari Muzdalifah) oleh Rasulullah shallallahu 'alaihi wasallam di antara anggota keluarganya.\""
            },
            {
                "number": 2127,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ أَنَّ ابْنَ عَبَّاسٍ قَالَبَعَثَ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَحَرٍ مِنْ جَمْعٍ فِي ثَقَلِ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ أَبَلَغَكَ أَنَّ ابْنَ عَبَّاسٍ قَالَ بَعَثَ بِي بِلَيْلٍ طَوِيلٍ قَالَ لَا إِلَّا كَذَلِكَ بِسَحَرٍ قُلْتُ لَهُ فَقَالَ ابْنُ عَبَّاسٍ رَمَيْنَا الْجَمْرَةَ قَبْلَ الْفَجْرِ وَأَيْنَ صَلَّى الْفَجْرَ قَالَ لَا إِلَّا كَذَلِكَ",
                "id": "Dan Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] bahwa [Ibnu Abbas] berkata; \"Nabi shallallahu 'alaihi wasallam mengutusku di waktu Sahur dari Jam' dengan membawa perbekalan beliau.\" Ibnu Juraij bertanya, \"Apakah telah sampai kepadamu bahwa Ibnu Abbas mengatakan; Beliau mengutusku di malam yang panjang?\" Atha` menjawab, \"Tidak. Kecuali seperti itu, yakni di waktu sahur.\" Kemudian Ibnu Abbas berkata, \"Kami melempar Jumrah sebelum fajar.\" Ibnu Juraij bertanya, \"Lalu di mana beliau sholat?\" Atha` menjawab, \"Aku tidak tahu, kecuali redaksinya memang seperti itu.\""
            },
            {
                "number": 2128,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يُقَدِّمُ ضَعَفَةَ أَهْلِهِ فَيَقِفُونَ عِنْدَ الْمَشْعَرِ الْحَرَامِ بِالْمُزْدَلِفَةِ بِاللَّيْلِ فَيَذْكُرُونَ اللَّهَ مَا بَدَا لَهُمْ ثُمَّ يَدْفَعُونَ قَبْلَ أَنْ يَقِفَ الْإِمَامُ وَقَبْلَ أَنْ يَدْفَعَ فَمِنْهُمْ مَنْ يَقْدَمُ مِنًى لِصَلَاةِ الْفَجْرِ وَمِنْهُمْ مَنْ يَقْدَمُ بَعْدَ ذَلِكَ فَإِذَا قَدِمُوا رَمَوْا الْجَمْرَةَ وَكَانَ ابْنُ عُمَرَ يَقُولُ أَرْخَصَ فِي أُولَئِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah bin Yahya] keduanya berkata, telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Ibnu Yunus] dari [Ibnu Syihab] bahwa [Salim bin Abdillah] telah mengkabarkan kepadanya, bahwasanya; [Abdullah bin Umar] selalu mendahulukan anggota keluarganya yang lemah hingga mereka dapat berhenti (beristirahat) di Masy'aril Haram di Muzdalifah di malam hari dan mereka dapat berdzikir kepada Allah di sana, kemudian setelah itu mereka dapat melanjutkan perjalanan lagi sebelum imam berdiri dan melanjutkan perjalanannya, sehingga di antara mereka ada yang telah sampai di Mina pada sa'at sholat fajar dan ada pula yang sampai setelahnya, dan jika telah sampai mereka segera melempar jumrah. Ibnu Umar berkata: Rasulullah shallallahu 'alaihi wasallam telah memberi rukhshah (pengecualian) kepada mereka."
            },
            {
                "number": 2129,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ رَمَى عَبْدُ اللَّهِ بْنُ مَسْعُودٍ جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ قَالَ فَقِيلَ لَهُ إِنَّ أُنَاسًا يَرْمُونَهَا مِنْ فَوْقِهَافَقَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ هَذَا وَالَّذِي لَا إِلَهَ غَيْرُهُ مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Abdurrahman bin Yazid] ia berkata; [Abdullah bin Mas'ud] melempar Jamrah Aqabah dari dalam lembah dengan tujuh butir kerikil. Dan setiap kali melempar satu kerikil diiringinya dengan tabkir. Kemudian dikatakanlah kepadanya, \"Sesungguhnya orang-orang melempar Jamrah dari atas lembah.\" Maka Abdullah bin Mas'ud berkata, \"Demi Dzat yang tidak ada Tuhan yang berhak disembah selain-Nya, inilah tempat berdirinya seorang yang diturunkan kepadanya surat Al Baqarah.\""
            },
            {
                "number": 2130,
                "arab": "و حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ أَخْبَرَنَا ابْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ قَالَ سَمِعْتُ الْحَجَّاجَ بْنَ يُوسُفَ يَقُولُ وَهُوَ يَخْطُبُ عَلَى الْمِنْبَرِ أَلِّفُوا الْقُرْآنَ كَمَا أَلَّفَهُ جِبْرِيلُ السُّورَةُ الَّتِي يُذْكَرُ فِيهَا الْبَقَرَةُ وَالسُّورَةُ الَّتِي يُذْكَرُ فِيهَا النِّسَاءُ وَالسُّورَةُ الَّتِي يُذْكَرُ فِيهَا آلُ عِمْرَانَ قَالَ فَلَقِيتُ إِبْرَاهِيمَ فَأَخْبَرْتُهُ بِقَوْلِهِ فَسَبَّهُ وَقَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَأَنَّهُ كَانَ مَعَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَأَتَى جَمْرَةَ الْعَقَبَةِ فَاسْتَبْطَنَ الْوَادِي فَاسْتَعْرَضَهَا فَرَمَاهَا مِنْ بَطْنِ الْوَادِي بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ قَالَ فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ النَّاسَ يَرْمُونَهَا مِنْ فَوْقِهَا فَقَالَ هَذَا وَالَّذِي لَا إِلَهَ غَيْرُهُ مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِو حَدَّثَنِي يَعْقُوبُ الدَّوْرَقِيُّ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ كِلَاهُمَا عَنْ الْأَعْمَشِ قَالَ سَمِعْتُ الْحَجَّاجَ يَقُولُ لَا تَقُولُوا سُورَةُ الْبَقَرَةِ وَاقْتَصَّا الْحَدِيثَ بِمِثْلِ حَدِيثِ ابْنِ مُسْهِرٍ",
                "id": "Dan Telah menceritakan kepada kami [Minjab bin Harits At Tamimi] telah mengabarkan kepada kami [Ibnu Mushir] dari [Al A'masy] ia berkata, saya mendengar Al Hajjaj bin Yusuf berkata saat ia sedang berkhutbah di atas mimbar, \"Biasakanlah membaca Al Qur`an sebagaimana yang dibacakan oleh Jibril, (yaitu) surah yang disebutkan di dalamnya Al Baqarah, An Nisa`, dan Ali Imram. Al A'masy berkata; Kemudian aku temui [Ibrahim], lalu aku sampaikan ucapan Al Hajjaj bin Yusuf itu, lalu ia mencelanya. Ibrahim berkata; [Abdurrahman bin Yazid] telah menceritakan kepadaku bahwasanya, ia pernah bersama [Abdullah bin Mas'ud], lalu ia menuju ke Jumratul 'Aqabah. Ia menuju ke tengah lembah dengan tujuh buah kerikil sambil diiringi membaca takbir pada setiap kali lantaran kerikil tersebut.\" Al A'masy berkata; Aku pun bertanya, \"Wahai Abu Abdurrahman, orang-orang pada melontar Jamrah dari atas?\" Ia menjawab, \"Demi Dzat yang tidak Tuhan yang berhak disembah selain-Nya, inilah tempat (melempar Jamrah) seorang yang telah diturunkan surat Al Baqarah kepadanya.\" Dan telah menceritakan kepadaku [Ya'qub Ad Dauraqi] Telah menceritakan kepada kami [Ibnu Abu Za`idah] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Abu Umar] Telah menceritakan kepada kami [Sufyan] keduanya dari [Al A'masy] ia berkata, saya mendengar Al Hajjaj berkata; \"Janganlah kalian mengatakan surat Al Baqarah…\" ia pun mengisahkan hadits sebagaimana haditsnya Ibnu Mushir."
            },
            {
                "number": 2131,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ أَنَّهُ حَجَّ مَعَ عَبْدِ اللَّهِ قَالَ فَرَمَى الْجَمْرَةَ بِسَبْعِ حَصَيَاتٍ وَجَعَلَ الْبَيْتَ عَنْ يَسَارِهِ وَمِنًى عَنْ يَمِينِهِوَقَالَ هَذَا مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِو حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَلَمَّا أَتَى جَمْرَةَ الْعَقَبَةِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Ghundar] dari [Syu'bah] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] keduanya berkata, Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari [Abdurrahman bin Yazid] bahwa ia pernah menunaikan haji bersama [Abdullah]. Kemudian Abdullah pun melempar Jamrah Aqabah dengan tujuh butir kerikil. (Posisinya), ia menempatkan Baitullah di sebelah kirinya sedangkan Mina di sebelah kanannya. Dan ia pun berkata, \"Inilah tempat (melempar Jamrah) orang yang telah diturunkan surat Al Baqarah kepadanya.\" Dan Telah menceritakan kepada kami [ubaidhullah bin Mu'adz] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Syu'bah] dengan Isnad ini, hanya saja ia menyebutkan; \"Dan ketika sampai di Jamrah Aqabah.\""
            },
            {
                "number": 2132,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْمُحَيَّاةِ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ أَخْبَرَنَا يَحْيَى بْنُ يَعْلَى أَبُو الْمُحَيَّاةِ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ قِيلَ لِعَبْدِ اللَّهِ إِنَّ نَاسًا يَرْمُونَ الْجَمْرَةَ مِنْ فَوْقِ الْعَقَبَةِ قَالَ فَرَمَاهَا عَبْدُ اللَّهِ مِنْ بَطْنِ الْوَادِي ثُمَّقَالَ مِنْ هَا هُنَا وَالَّذِي لَا إِلَهَ غَيْرُهُ رَمَاهَا الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abul Muhayyat] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Yahya bin Yahya] -lafazh juga miliknya- telah mengabarkan kepada kami [Yahya bin Ya'la Abul Muhayyat] dari [Salamah bin Kuhail] dari [Abdurrahman bin Yazid] ia berkata; Pernah dikatakan kepada [Abdullah], \"Sesungguhnya orang-orang pada melontar Jamrah dari atas 'Aqabah?\" Namun Abdullah kemudian melempar dari dalam lembah, dan ia pun berkata, \"Dari sinilah (tempatnya melempar) -Demi Dzat yang tidak ada Tuhan yang berhak disembah selain-Nya- seorang yang telah diturunkan surat Al Baqarah padanya.\""
            },
            {
                "number": 2133,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ جَمِيعًا عَنْ عِيسَى بْنِ يُونُسَ قَالَ ابْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُارَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي عَلَى رَاحِلَتِهِ يَوْمَ النَّحْرِ وَيَقُولُ لِتَأْخُذُوا مَنَاسِكَكُمْ فَإِنِّي لَا أَدْرِي لَعَلِّي لَا أَحُجُّ بَعْدَ حَجَّتِي هَذِهِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibarahim] dan [Ali bin Khasyram] semuanya dari [Isa bin Yunus] - [Ibnu Khasyram] berkata- telah mengabarkan kepada kami [Isa] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir] berkata; \"Aku pernah melihat Nabi shallallahu 'alaihi wasallam melempar Jamrah dari atas kendaraan beliau pada hari Nahr (penyembelihan hewan kurban). Beliau bersabda: \"Lakukanlah haji kalian, sebab aku tidak tahu, barangkali aku tidak berhaji lagi sesudah hajiku ini.\""
            },
            {
                "number": 2134,
                "arab": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ يَحْيَى بْنِ حُصَيْنٍ عَنْ جَدَّتِهِ أُمِّ الْحُصَيْنِ قَالَ سَمِعْتُهَا تَقُولُحَجَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّةَ الْوَدَاعِ فَرَأَيْتُهُ حِينَ رَمَى جَمْرَةَ الْعَقَبَةِ وَانْصَرَفَ وَهُوَ عَلَى رَاحِلَتِهِ وَمَعَهُ بِلَالٌ وَأُسَامَةُ أَحَدُهُمَا يَقُودُ بِهِ رَاحِلَتَهُ وَالْآخَرُ رَافِعٌ ثَوْبَهُ عَلَى رَأْسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الشَّمْسِ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَوْلًا كَثِيرًا ثُمَّ سَمِعْتُهُ يَقُولُ إِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ مُجَدَّعٌ حَسِبْتُهَا قَالَتْ أَسْوَدُ يَقُودُكُمْ بِكِتَابِ اللَّهِ تَعَالَى فَاسْمَعُوا لَهُ وَأَطِيعُوا",
                "id": "Dan telah menceritakan kepadaku [Salamah bin Syabib] Telah menceritakan kepada kami [Al Hasan bin A'yan] Telah menceritakan kepada kami [Ma'qil] dari [Zaid bin Abu Unaisah] dari [Yahya bin Hushain] dari [kakeknya] Ummul Hushain, ia berkata, saya mendengar mendengarnya berkata; Aku ikut menunaikan haji bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam ketika haji wada'. Aku melihat ketika beliau melempar Jamrah Aqabah. Sesudah itu, beliau pergi dengan kendaraannya bersama Bilal dan Usamah; yang satu memegang tali Unta, dan yang satu lagi memayungi Rasulullah shallallahu 'alaihi wasallam dengan bajunya dari terik matahari. Kata Ummul Hushain; Ketika itu, Rasulullah shallallahu 'alaihi wasallam banyak bicara. Yang aku dapat mendengarnya, beliau bersabda: \"Sekalipun yang memegang kekuasaan adalah seorang budak hitam, tetapi dia memerintah dengan Kitabullah, maka dengarkan dan patuhilah dia.\""
            },
            {
                "number": 2135,
                "arab": "و حَدَّثَنِي أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ أَبِي عَبْدِ الرَّحِيمِ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ يَحْيَى بْنِ الْحُصَيْنِ عَنْ أُمِّ الْحُصَيْنِ جَدَّتِهِ قَالَتْحَجَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّةَ الْوَدَاعِ فَرَأَيْتُ أُسَامَةَ وَبِلَالًا وَأَحَدُهُمَا آخِذٌ بِخِطَامِ نَاقَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ رَافِعٌ ثَوْبَهُ يَسْتُرُهُ مِنْ الْحَرِّ حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِقَالَ مُسْلِم وَاسْمُ أَبِي عَبْدِ الرَّحِيمِ خَالِدُ بْنُ أَبِي يَزِيدَ وَهُوَ خَالُ مُحَمَّدِ بْنِ سَلَمَةَ رَوَى عَنْهُ وَكِيعٌ وَحَجَّاجٌ الْأَعْوَرُ",
                "id": "Dan telah menceritakan kepadaku [Ahmad bin Hanbal] Telah menceritakan kepada kami [Muhammad bin Salamah] dari [Abu Abdurrahim] dari [Zaid bin Abu Unaisah] dari [Yahya bin Hushain] dari [Ummu Hushain] kakekknya, ia berkata; Aku ikut menunaikan haji bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam ketika haji wada'. Aku melihat Bilal dan Usamah; yang satu memegang tali Unta Nabi shallallahu 'alaihi wasallam, dan yang satu lagi memayungi Rasulullah shallallahu 'alaihi wasallam dengan bajunya dari terik matahari sampai beliau selesai melempar Jamrah Aqabah. Muslim berkata; Nama Abu Abdurrahman adalah Khalid bin Abu Yazid, ia adalah paman Muhammad bin Salamah. Waki', Hajjaj dan A'war telah meriwayatkan darinya."
            },
            {
                "number": 2136,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ ابْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنَا أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُارَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] dan [Abdu bin Humaid] - [Ibnu Hatim] berkata- Telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepada kami [Abu Zubair] bahw ia mendengar [Jabir bin Abdullah] berkata; \"Aku melihat Nabi shallallahu 'alaihi wasallam melempar Jamrah dengan kerikil seperti biji kacang.\""
            },
            {
                "number": 2137,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ وَابْنُ إِدْرِيسَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَرَمَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَمْرَةَ يَوْمَ النَّحْرِ ضُحًى وَأَمَّا بَعْدُ فَإِذَا زَالَتْ الشَّمْسُو حَدَّثَنَاه عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abu Khalid Al Ahmar] dan [Abu Idris] dari [Ibnu Juraij] dari [Abu Zubair] dari [Jabir] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melontar Jumrah pada hari Nahr (sepuluh Dzulhijjah) di waktu Dluha; dan sesudah itu (yaitu tanggal sebelas, dua belas dan tiga belas) sesudah matahari tergelincir.\" Dan Telah menceritakan kepada kami [Ali bin Khasyram] telah mengabarkan kepada kami [Isa] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata; Bahwasanya Nabi shallallahu 'alaihi wasallam. yakni dengan hadits semisalnya."
            },
            {
                "number": 2138,
                "arab": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللَّهِ الْجَزَرِيُّ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الِاسْتِجْمَارُ تَوٌّ وَرَمْيُ الْجِمَارِ تَوٌّ وَالسَّعْيُ بَيْنَ الصَّفَا وَالْمَرْوَةِ تَوٌّ وَالطَّوَافُ تَوٌّ وَإِذَا اسْتَجْمَرَ أَحَدُكُمْ فَلْيَسْتَجْمِرْ بِتَوٍّ",
                "id": "Dan telah menceritakan kepadaku [Salmah bin Syabib] Telah menceritakan kepada kami [Al Hasan bin A'yan] Telah menceritakan kepada kami [Ma'qil bin ubaidhullah Al Jazari] dari [Abu Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Istijmar (istinja') itu ganjil, melempar jumrah juga ganjil, Sa'i antara shafa dan marwa, serta thawaf (di Baitullah) juga ganjil. Maka apabila salah seorang di antara kalian beristijmar (bersuci dengan menggunakan batu), hendaklah ia bersuci dengan bilangan ganjil.\""
            },
            {
                "number": 2139,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ قَالَحَلَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَلَقَ طَائِفَةٌ مِنْ أَصْحَابِهِ وَقَصَّرَ بَعْضُهُمْ قَالَ عَبْدُ اللَّهِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَحِمَ اللَّهُ الْمُحَلِّقِينَ مَرَّةً أَوْ مَرَّتَيْنِ ثُمَّ قَالَ وَالْمُقَصِّرِينَ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Muhammad bin Rumh] keduanya berkata, telah mengabarkan kepada kami [Laits] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Laits] dari [Nafi'] bahwa [Abdullah] berkata; \"Rasulullah shallallahu 'alaihi wasallam mencukur rambut, lalu bercukur pula sebagian para sahabat, sedang yang sebagian yang lain hanya menggunting rambut saja.\" Abdullah selanjutnya berkata, \"Rasulullah shallallahu 'alaihi wasallam mendo'akan satu atau dua kali orang yang mencukur rambut, kemudian beliau mendo'akan pula mereka yang sekedar menggunting rambut.\""
            },
            {
                "number": 2140,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ ارْحَمْ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ اللَّهُمَّ ارْحَمْ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ وَالْمُقَصِّرِينَ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam berdo'a: \"ALLAHUMMARHAM LILMUHALLIQIIN (Ya Allah, ampunilah mereka yang mencukur rambutnya).\" Lalu mereka berkata, \"Dan bagi orang-orang yang menggunting rambutnya ya Rasulullah.\" Beliau berdo'a lagi: \"ALLAHUMMARHAM LILMUHALLIQIIN (Ya Allah, ampunilah mereka yang mencukur rambutnya).\" Mereka berkata lagi, \"Dan juga bagi mereka yang menggunting rambutnya ya Rasulullah.\" Kemudian beliau berdo'a: \"WAL MUQASHSHIRIIN (Dan juga bagi mereka yang sekedar menggunting rambutnya).\""
            },
            {
                "number": 2141,
                "arab": "أَخْبَرَنَا أَبُو إِسْحَقَ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ سُفْيَانَ عَنْ مُسْلِمِ بْنِ الْحَجَّاجِ قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَحِمَ اللَّهُ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ رَحِمَ اللَّهُ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ رَحِمَ اللَّهُ الْمُحَلِّقِينَ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ وَالْمُقَصِّرِينَو حَدَّثَنَاه ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا عُبَيْدُ اللَّهِ بِهَذَا الْإِسْنَادِ وَقَالَ فِي الْحَدِيثِ فَلَمَّا كَانَتْ الرَّابِعَةُ قَالَ وَالْمُقَصِّرِينَ",
                "id": "Telah menceritakan kepada kami Abu Ishaq Ibrahim bin Muhammad bin Sufyan dari Muslim bin Al Hajjaj ia berkata, Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah merahmati mereka yang mencukur rambutnya.\" Lalu mereka berkata, \"Dan juga bagi mereka yang menggunting rambutnya ya Rasulullah.\" Beliau berdo'a lagi: \"Semoga Allah merahmati mereka yang mencukur rambutnya.\" Mereka berkata lagi, \"Dan juga bagi mereka yang menggunting rambutnya ya Rasulullah.\" Namun beliau tetap berdo'a: \"Semoga Allah merahmati mereka yang mencukur rambutnya.\" Mereka berkata lagi, \"Dan juga bagi mereka yang menggunting rambutnya ya Rasulullah.\" Kemudian beliau berdo'a: \"Dan juga (semoga Allah merahmati) bagi mereka yang menggunting rambutnya.\" Dan Telah menceritakannya kepada kami [Ibnul Mutsanna] Telah menceritakan kepada kami [Abdul Wahhab] Telah menceritakan kepada kami [ubaidhullah] dengan isnad ini, dan ia berkata di dalam hadits itu; Maka pada kali yang ketiga beliau berdo'a: \"Dan semoga Allah juga merahmati mereka yang menggunting rambut (memendekkan rambut).\""
            },
            {
                "number": 2142,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ ابْنِ فُضَيْلٍ قَالَ زُهَيْرٌ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا عُمَارَةُ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ وَلِلْمُقَصِّرِينَو حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا رَوْحٌ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ibnu Numair] dan [Abu Kuraib] semuanya dari [Ibnu Fudlail] - [Zuhair] berkata- Telah menceritakan kepada kami [Muhammad bin Fudlail] Telah menceritakan kepada kami [Umarah] dari [Abu Zur'ah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam berdo'a: \"Semoga Allah mengampuni mereka yang mencukur rambutnya.\" Mereka berkata, \"Ya Rasulullah, juga bagi mereka yang menggunting rambutnya.\" Beliau berdo'a lagi: \"Semoga Allah mengampuni mereka yang mencukur rambutnya.\" Mereka berkata lagi, \"Ya Rasulullah, juga bagi mereka yang menggunting rambutnya.\" Beliau tetap berdo'a: \"Semoga Allah mengampuni mereka yang mencukur rambutnya.\" Maka mereka pun berkata, \"Ya Rasulullah, juga bagi mereka yang menggunting rambutnya.\" Akhirnya beliau berdo'a: \"Dan (semoga Allah juga merahmati) bagi mereka yang menggunting rambutnya.\" Dan telah menceritakan kepadaku [Umayyah bin Bistham] Telah menceritakan kepada kami [Yazid bin Zurai'] Telah menceritakan kepada kami [Rauh] dari [Al 'Ala`] dari [bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. semakna dengan haditsnya Abu Zur'ah dari Abu Hurairah."
            },
            {
                "number": 2143,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ وَأَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ شُعْبَةَ عَنْ يَحْيَى بْنِ الْحُصَيْنِ عَنْ جَدَّتِهِ أَنَّهَاسَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ دَعَا لِلْمُحَلِّقِينَ ثَلَاثًا وَلِلْمُقَصِّرِينَ مَرَّةًوَلَمْ يَقُلْ وَكِيعٌ فِي حَجَّةِ الْوَدَاعِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Waki'] dan [Abu Dawud Ath Thiyalisi] dari [Syu'bah] dari [Yahya bin Hushain] dari [kakeknya] bahwa ia pernah mendengar Nabi shallallahu 'alaihi wasallam pada saat haji wada'. Di tempat itu beliau mendo'akan bagi mereka yang mencukur rambutnya sebanyak tiga kali, dan sekali bagi mereka yang menggunting rambutnya. Namun Waki' tidak menyebutkan; \"Pada saat haji wada'.\""
            },
            {
                "number": 2144,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَعِيلَ كِلَاهُمَا عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَلَقَ رَأْسَهُ فِي حَجَّةِ الْوَدَاعِ",
                "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Ya'qub bin Abdurrahman Al Qari] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Hatim bin Isma'il] keduanya dari [Musa bin Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam mencukur rambutnya pada saat haji wada'."
            },
            {
                "number": 2145,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ هِشَامٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى مِنًى فَأَتَى الْجَمْرَةَ فَرَمَاهَا ثُمَّ أَتَى مَنْزِلَهُ بِمِنًى وَنَحَرَ ثُمَّ قَالَ لِلْحَلَّاقِ خُذْ وَأَشَارَ إِلَى جَانِبِهِ الْأَيْمَنِ ثُمَّ الْأَيْسَرِ ثُمَّ جَعَلَ يُعْطِيهِ النَّاسَو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ قَالُوا أَخْبَرَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ أَمَّا أَبُو بَكْرٍ فَقَالَ فِي رِوَايَتِهِ لِلْحَلَّاقِ هَا وَأَشَارَ بِيَدِهِ إِلَى الْجَانِبِ الْأَيْمَنِ هَكَذَا فَقَسَمَ شَعَرَهُ بَيْنَ مَنْ يَلِيهِ قَالَ ثُمَّ أَشَارَ إِلَى الْحَلَّاقِ وَإِلَى الْجَانِبِ الْأَيْسَرِ فَحَلَقَهُ فَأَعْطَاهُ أُمَّ سُلَيْمٍ وَأَمَّا فِي رِوَايَةِ أَبِي كُرَيْبٍ قَالَ فَبَدَأَ بِالشِّقِّ الْأَيْمَنِ فَوَزَّعَهُ الشَّعَرَةَ وَالشَّعَرَتَيْنِ بَيْنَ النَّاسِ ثُمَّ قَالَ بِالْأَيْسَرِ فَصَنَعَ بِهِ مِثْلَ ذَلِكَ ثُمَّ قَالَ هَا هُنَا أَبُو طَلْحَةَ فَدَفَعَهُ إِلَى أَبِي طَلْحَةَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Hafsh bin Ghiyats] dari [Hisyam] dari [Muhammad bin Sirin] dari [Anas bin Malik] bahwasanya; Setelah Rasulullah shallallahu 'alaihi wasallam sampai di Mina, beliau datang ke Jamratul 'Aqabah lalu melontarnya. Kemudian beliau pergi ke tempatnya di Mina, di sana beliau menyembelih hewan kurban. Sesudah itu, beliau bersabda kepada tukang cukur: \"Cukurlah rambutku.\" Sambil beliau memberi isyarat ke kepalanya sebelah kanan dan kiri. Sesudah itu, diberikannya rambutnya kepada orang banyak. Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ibnu Numair] dan [Abu Kuraib] mereka berkata, telah mengabarkan kepada kami [Hafsh bin Ghiyats] dari [Hisyam] dengan isnad ini. Adapun Abu Bakr, maka ia berkata dalam riwayatnya; (Beliau bersabda kepada tukang cukur): \"HAA (cukurlah rambutku).\" Beliau sambil memberi isyarat ke arah kepala bagian kanannya seperti ini. Lalu beliau membagi-bagikan rambutnya kepada mereka yang berada di dekat beliau. Setelah itu beliau memberi isyarat kembali ke arah kepadala bagian kiri, maka tukang cukur itu pun mencukurnya, dan beliau pun memberikan rambut itu kepada Ummu Sulaim. Adapun dalam riwayat Abu Kuraib ia menyebutkan; Tukang cukur itu pun memulainya dari rambut sebelah kanan seraya membagikannya kepada orang-orang, baru pindah ke sebelah kiri dan juga berbuat seperti itu. Kemudian beliau bersabda: \"Ambilah ini wahai Abu Thalhah.\" Akhirnya beliau pun memberikannya kepada Abu Thalhah."
            },
            {
                "number": 2146,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا هِشَامٌ عَنْ مُحَمَّدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى جَمْرَةَ الْعَقَبَةِ ثُمَّ انْصَرَفَ إِلَى الْبُدْنِ فَنَحَرَهَا وَالْحَجَّامُ جَالِسٌ وَقَالَ بِيَدِهِ عَنْ رَأْسِهِ فَحَلَقَ شِقَّهُ الْأَيْمَنَ فَقَسَمَهُ فِيمَنْ يَلِيهِ ثُمَّ قَالَ احْلِقْ الشِّقَّ الْآخَرَ فَقَالَ أَيْنَ أَبُو طَلْحَةَ فَأَعْطَاهُ إِيَّاهُ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Abdul A'la] Telah menceritakan kepada kami [Hisyam] dari [Muhammad] dari [Anas bin Malik] bahwasanya; Setelah Rasulullah shallallahu 'alaihi wasallam melempar Jamratul 'Aqabah, beliau langsung bergegas menuju Unta (hewan kurbannya) dan menyembelihnya. Sementarara tukang bekam sedang duduk di sekitar itu. Maka beliau memberi isyarat dengan tangannya ke arah kepala (agar ia mencukurnya). Lalu tukang cukur itu pun mencukur rambut beliau yang sebelah kanan dan kemudian beliau membagikannya kepada orang yang berada di dekatnya. Setelah itu, rambut yang sebelahnya lagi, kemudian beliau bertanya, \"Mana Abu Thalhah?\" maka beliau pun memberikan rambut itu padanya."
            },
            {
                "number": 2147,
                "arab": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ سَمِعْتُ هِشَامَ بْنَ حَسَّانَ يُخْبِرُ عَنْ ابْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا رَمَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَمْرَةَ وَنَحَرَ نُسُكَهُ وَحَلَقَ نَاوَلَ الْحَالِقَ شِقَّهُ الْأَيْمَنَ فَحَلَقَهُ ثُمَّ دَعَا أَبَا طَلْحَةَ الْأَنْصَارِيَّ فَأَعْطَاهُ إِيَّاهُ ثُمَّ نَاوَلَهُ الشِّقَّ الْأَيْسَرَ فَقَالَ احْلِقْ فَحَلَقَهُ فَأَعْطَاهُ أَبَا طَلْحَةَ فَقَالَ اقْسِمْهُ بَيْنَ النَّاسِ",
                "id": "Dan Telah menceritakan kepada kami [Ibnu Abu Umar] Telah menceritakan kepada kami [Sufyan] saya mendengar [Hisyam bin Hassan] mengabarkan dari [Ibnu Sirin] dari [Anas bin Malik] ia berkata; Setelah Rasulullah shallallahu 'alaihi wasallam melempar Jamrah, menyembelih hewan kurbannya dan setelah mencukur rambutnya, beliau meminta tukang cukur untuk mencukur kembali rambutnya yang sebelah kanan. Kemudian beliau memanggil Abu Thalhah Al Anshari dan memberikan rambut tersebut kepadanya. sesudah itu, beliau kembali meminta untuk dicukurkan rambutnya yang sebelah kiri seraya bersabda: \"Cukurlah.\" Maka ia pun mencukurnya, dan setelah itu, membagikannya kepada orang-orang."
            },
            {
                "number": 2148,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عِيسَى بْنِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَوَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بِمِنًى لِلنَّاسِ يَسْأَلُونَهُ فَجَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَنْحَرَ فَقَالَ اذْبَحْ وَلَا حَرَجَ ثُمَّ جَاءَهُ رَجُلٌ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ فَقَالَ ارْمِ وَلَا حَرَجَ قَالَ فَمَا سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَيْءٍ قُدِّمَ وَلَا أُخِّرَ إِلَّا قَالَ افْعَلْ وَلَا حَرَجَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Ibnu Syihab] dari [Isa bin Thalhah bin ubaidhullah] dari [Amru bin Amru bin 'Ash] ia berkata; Ketika haji wada', Rasulullah shallallahu 'alaihi wasallam pernah berhenti di Mina untuk menunggu orang-orang banyak agar bertanya kepada beliau. Maka tampillah seorang laki-laki dan bertanya, \"Wahai Rasulullah, aku sudah terlanjur bercukur sebelum menyembelih kurban, bagaimana itu?\" beliau menjawab: \"Sembelihlah, tidak mengapa.\" Kemudian datang pula laki-laki yang lain dan bertanya, \"Ya Rasulullah, aku sudah terlanjur menyembelih terlebih dahulu sebelum melontar, bagaimana itu?\" beliau menjawab: \"Lontarlah. Tidak mengapa.\" Abdullah berkata; Segala sesuatu yang ditanyakan kepada beliau, ialah hal-hal yang urutannya tidak tertib karena terlanjur atau lupa. Dijawab oleh beliau, \"Teruskanlah, kamu tidak berdosa.\""
            },
            {
                "number": 2149,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عِيسَى بْنُ طَلْحَةَ التَّيْمِيُّ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ يَقُولُاوَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَاحِلَتِهِ فَطَفِقَ نَاسٌ يَسْأَلُونَهُ فَيَقُولُ الْقَائِلُ مِنْهُمْ يَا رَسُولَ اللَّهِ إِنِّي لَمْ أَكُنْ أَشْعُرُ أَنَّ الرَّمْيَ قَبْلَ النَّحْرِ فَنَحَرْتُ قَبْلَ الرَّمْيِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَارْمِ وَلَا حَرَجَ قَالَ وَطَفِقَ آخَرُ يَقُولُ إِنِّي لَمْ أَشْعُرْ أَنَّ النَّحْرَ قَبْلَ الْحَلْقِ فَحَلَقْتُ قَبْلَ أَنْ أَنْحَرَ فَيَقُولُ انْحَرْ وَلَا حَرَجَ قَالَ فَمَا سَمِعْتُهُ يُسْأَلُ يَوْمَئِذٍ عَنْ أَمْرٍ مِمَّا يَنْسَى الْمَرْءُ وَيَجْهَلُ مِنْ تَقْدِيمِ بَعْضِ الْأُمُورِ قَبْلَ بَعْضٍ وَأَشْبَاهِهَا إِلَّا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ افْعَلُوا ذَلِكَ وَلَا حَرَجَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ بِمِثْلِ حَدِيثِ يُونُسَ عَنْ الزُّهْرِيِّ إِلَى آخِرِهِ",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [Isa bin Thalhah At Taimi] bahwa ia mendengar [Abdullah bin Amru bin Ash] berkata; Rasulullah shallallahu 'alaihi wasallam berhenti di atas kendaraannya, lalu orang-orang pun mulai bertanya kepada beliau. Salah seorang dari mereka bertanya, \"Sungguh, saya tidak mengerti, bahwa melempar jumrah itu sebelum menyembelih hewan kurban, sehingga saya menyembelih hewan kurban sebelum melontar jumrah.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak mengapa, sekarang melontarlah.\" Abdullah bin Amru berkata; Orang lain mulai bertanya, \"Sungguhnya saya tidak mengerti bahwa penyembelihan kurban itu sebelum mencukur rambut, sehingga saya mencukur rambut sebelum menyembelih kurban?\" beliau menjawab: \"Tidak mengapa, sekarang sembelihlah hewan kurbanmu.\" Abdullah bin Amru berkata; Pada hari itu, tidaklah aku mendengar beliau ditanya tentang sesuatu yang dilupakan atau tidak dimengerti oleh seseorang (seperti mendahulukan sebagian amalan sebelum amalan lain dan sebagainya) melainkan Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidaklah mengapa, lakukanlah itu sekarang.\" Telah menceritakan kepada kami [Hasan Al Hulwani] Telah menceritakan kepada kami [Ya'qub] Telah menceritakan kepada kami [bapakku] dari [Shalih] dari [Ibnu Syihab] sebagaimana hadits Yunus, dari Zuhri hingga akhir sanad."
            },
            {
                "number": 2150,
                "arab": "و حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى عَنْ ابْنِ جُرَيْجٍ قَالَ سَمِعْتُ ابْنَ شِهَابٍ يَقُولُ حَدَّثَنِي عِيسَى بْنُ طَلْحَةَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَا هُوَ يَخْطُبُ يَوْمَ النَّحْرِ فَقَامَ إِلَيْهِ رَجُلٌ فَقَالَ مَا كُنْتُ أَحْسِبُ يَا رَسُولَ اللَّهِ أَنَّ كَذَا وَكَذَا قَبْلَ كَذَا وَكَذَا ثُمَّ جَاءَ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ كُنْتُ أَحْسِبُ أَنَّ كَذَا قَبْلَ كَذَا وَكَذَا لِهَؤُلَاءِ الثَّلَاثِ قَالَ افْعَلْ وَلَا حَرَجَو حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ ح و حَدَّثَنِي سَعِيدُ بْنُ يَحْيَى الْأُمَوِيُّ حَدَّثَنِي أَبِي جَمِيعًا عَنْ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ أَمَّا رِوَايَةُ ابْنِ بَكْرٍ فَكَرِوَايَةِ عِيسَى إِلَّا قَوْلَهُ لِهَؤُلَاءِ الثَّلَاثِ فَإِنَّهُ لَمْ يَذْكُرْ ذَلِكَ وَأَمَّا يَحْيَى الْأُمَوِيُّ فَفِي رِوَايَتِهِ حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ وَأَشْبَاهُ ذَلِكَ",
                "id": "Dan Telah menceritakan kepada kami [Ali bin Khasyram] telah mengabarkan kepada kami [Isa] dari [Ibnu Juraij] ia berkata, saya mendengar [Ibnu Syihab] berkata, telah menceritakan kepadaku [Isa bin Thalhah] telah menceritakan kepadaku [Abdullah bin Amru bin Ash] bahwasanya; Ketika Nabi shallallahu 'alaihi wasallam menyampaikan khutbah pada hari Nahr (hari kurban), seorang laki-laki beranjak ke arah beliau seraya bertanya, \"Saya tidak menyangka wahai Rasulullah, bahwa amalan ini dan ini, sebelum amalan itu dan yang itu.\" kemudian yang lagi datang dan bertanya, \"Wahai Rasulullah, aku mengira bahwa amalan ini sebelum amalan itu.\" Demikianlah, tiga orang seperti itu pertanyaannya. Namun beliau bersabda: \"Lakukanlah sekarang, tidaklah mengapa.\" Dan Telah menceritakannya kepada kami [Abdu bin Humaid] Telah menceritakan kepada kami [Muhammad bin Bakr] Dan telah menceritakan kepadaku [Sa'id bin Yahya Al Umawi] telah menceritakan kepadaku [bapakku] dari [Ibnu Juraij] dengan isnad ini. Adapun riwayat Abu Bakr, maka sama halnya dengan riwayatnya Isa, kecuali pada ungkapannya; \"LIHAA`ULAA`I ATS TSALAATS (untuk ketiga orang itu).\" sebab, ia tidak menyebutkannya. Sedangkan Yahya Al Umawi, maka di dalam riwayatnya tercantum; Aku telah bercukur sebelum aku menyembelih hewan kurban, dan aku menyembelih sebelum melontar jumrah.\" Dan serupa dengan kalimat itu."
            },
            {
                "number": 2151,
                "arab": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَأَتَى النَّبِيَّ رَجُلٌ فَقَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ قَالَ فَاذْبَحْ وَلَا حَرَجَ قَالَ ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ قَالَ ارْمِ وَلَا حَرَجَو حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى نَاقَةٍ بِمِنًى فَجَاءَهُ رَجُلٌ بِمَعْنَى حَدِيثِ ابْنِ عُيَيْنَةَ",
                "id": "Dan Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] - [Abu Bakr] berkata- Telah menceritakan kepada kami [Ibnu Uyainah] dari [Az Zuhri] dari [Isa bin Thalhah] dari [Abdullah bin Amru] ia berkata; Seorang laki-laki datang menghadap Nabi shallallahu 'alaihi wasallam seraya bertanya, \"Aku telah bercukur sebelum menyembelih hewan kurban?\" beliau bersabda: \"Sembelihlah sekarang, tidaklah mengapa.\" Kemudian yang lain bertanya lagi, \"Aku telah menyembelih hewan kurban sebelum melontar jumrah?\" beliau bersabda: \"Sekarang melontarlah, tidak mengapa.\" Dan Telah menceritakan kepada kami [Ibnu Abu Umar] dan [Abdu bin Humaid] dari [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] dengan isnad ini; Aku melihat Rasulullah shallallahu 'alaihi wasallam berada di atas kendaraannya di Mina. Lalu seorang laki-laki mendatangi beliau. Yakni semakna dengan haditsnya Ibnu Uyainah."
            },
            {
                "number": 2152,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ أَخْبَرَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ عَنْ الزُّهْرِيِّ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَتَاهُ رَجُلٌ يَوْمَ النَّحْرِ وَهُوَ وَاقِفٌ عِنْدَ الْجَمْرَةِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي حَلَقْتُ قَبْلَ أَنْ أَرْمِيَ فَقَالَ ارْمِ وَلَا حَرَجَ وَأَتَاهُ آخَرُ فَقَالَ إِنِّي ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ قَالَ ارْمِ وَلَا حَرَجَ وَأَتَاهُ آخَرُ فَقَالَ إِنِّي أَفَضْتُ إِلَى الْبَيْتِ قَبْلَ أَنْ أَرْمِيَ قَالَ ارْمِ وَلَا حَرَجَ قَالَ فَمَا رَأَيْتُهُ سُئِلَ يَوْمَئِذٍ عَنْ شَيْءٍ إِلَّا قَالَ افْعَلُوا وَلَا حَرَجَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Abdullah bin Quhzadz] Telah menceritakan kepada kami [Ali bin Hasan] dari [Abdullah bin Mubarak] telah mengabarkan kepada kami [Muhammad bin Hafshah] dari [Az Zuhri] dari [Isa bin Thalhah] dari [Abdullah bin Amru bin Ash] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam ketika beliau didatangi oleh seseorang pada hari Nahr (kurban) dan saat itu beliau sedang berada di tempat melontar jumrah. Orang tersebut bertanya, \"Wahai Rasulullah, sungguh saya telah mencukur rambut sebelum melontar jumrah?\" beliau bersabda: \"Tidak apa-apa, sekarang melontarlah.\" Kemudian datanglah yang lain lagi dan bertanya, \"Sungguh, saya telah beranjak ke Baitullah sebelum melontar?\" beliau bersabda: \"Tidak apa-apa, sekarang melontarlah.\" Abdullah bin Amru berkata; Pada hari itu, aku tidak melihat beliau ditanya tentang sesuatu melainkan beliau menjawab: \"Tidak apa-apa, sekarang lakukanlah.\""
            },
            {
                "number": 2153,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِيلَ لَهُ فِي الذَّبْحِ وَالْحَلْقِ وَالرَّمْيِ وَالتَّقْدِيمِ وَالتَّأْخِيرِ فَقَالَ لَا حَرَجَ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Bahz] Telah menceritakan kepada kami [Wuhaib] Telah menceritakan kepada kami [Abdullah bin Thawus] dari [bapaknya] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam pernah ditanya mengenai penyembelihan hewan kurban, bercukur, dan melontar jumrah serta mendahulukan atau mengakhirkan (amalan tersebut), namun beliau bersabda: \"Tidaklah mengapa.\""
            },
            {
                "number": 2154,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَاضَ يَوْمَ النَّحْرِ ثُمَّ رَجَعَ فَصَلَّى الظُّهْرَ بِمِنًىقَالَ نَافِعٌ فَكَانَ ابْنُ عُمَرَ يُفِيضُ يَوْمَ النَّحْرِ ثُمَّ يَرْجِعُ فَيُصَلِّي الظُّهْرَ بِمِنًى وَيَذْكُرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَهُ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam berangkat pada hari Nahr, kemudian beliau kembali dan sholat di Mina. Nafi' berkata; Maka Ibnu Umar juga berangkat di hari Nahr (sepuluh Dzulhijjah), kemudian ia kembali dan menunaikan sholat Zhuhur di Mina. Sesudah itu, ia menuturkan bahwa Nabi shallallahu 'alaihi wasallam telah berbuat demikian."
            },
            {
                "number": 2155,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ الْأَزْرَقُ أَخْبَرَنَا سُفْيَانُ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ قَالَسَأَلْتُ أَنَسَ بْنَ مَالِكٍ قُلْتُ أَخْبِرْنِي عَنْ شَيْءٍ عَقَلْتَهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ صَلَّى الظُّهْرَ يَوْمَ التَّرْوِيَةِ قَالَ بِمِنًى قُلْتُ فَأَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ قَالَ بِالْأَبْطَحِ ثُمَّ قَالَ افْعَلْ مَا يَفْعَلُ أُمَرَاؤُكَ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Ishaq bin Yusuf Al Azraq] telah mengabarkan kepada kami [Sufyan] dari [Abdul Aziz bin Rufai'] ia berkata; Aku bertanya kepada [Anas bin Malik], aku katakan, \"Beritahukanlah padaku tentang sesuatu yang telah Anda pahami dari Rasulullah shallallahu 'alaihi wasallam. Di manakah beliau sholat Zhuhur pada hari Tarwiyah?\" Anas menjawab, \"Di Mina.\" Aku bertanya lagi, \"Lalu di mana beliau sholat Ashar pada hari Nafar?\" Anas menjawab, \"Di Abthah.\" Kemudian Anas pun berkata, \"lakukanlah, apa yang telah dilakukan oleh para pemimpinmu.\""
            },
            {
                "number": 2156,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا يَنْزِلُونَ الْأَبْطَحَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mihran Ar Razi] Telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam, Abu Bakar, dan Umar semuanya singgah di Abthah."
            },
            {
                "number": 2157,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ يَرَى التَّحْصِيبَ سُنَّةً وَكَانَ يُصَلِّي الظُّهْرَ يَوْمَ النَّفْرِ بِالْحَصْبَةِ قَالَ نَافِعٌ قَدْ حَصَّبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْخُلَفَاءُ بَعْدَهُ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim bin Maimun] Telah menceritakan kepada kami [Rauh bin Ubadah] Telah menceritakan kepada kami [Shakhr bin Juwairiyah] dari [Nafi'] bahwasanya; [Ibnu Umar] berpendapat bahwa At Tahshib (singgah di tempat pelemparan jumrah) adalah sunnah. Ibnu Umar sholat Zhuhur di Hashbah pada hari Nahar. Nafi' berkata; \"Sungguh, Rasulullah shallallahu 'alaihi wasallam telah singgah di tempat pelemparan Jumrah, setelah para Khulafa` Rasyidin setelah beliau.\""
            },
            {
                "number": 2158,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْنُزُولُ الْأَبْطَحِ لَيْسَ بِسُنَّةٍ إِنَّمَا نَزَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَنَّهُ كَانَ أَسْمَحَ لِخُرُوجِهِ إِذَا خَرَجَو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ ح و حَدَّثَنِيهِ أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ ح و حَدَّثَنَاه أَبُو كَامِلٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ كُلُّهُمْ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, Telah menceritakan kepada kami [Abdullah bin Numair] Telah menceritakan kepada kami [Hisyam] dari [bapaknya] dari [Aisyah] ia berkata; Singgah di Abthah, bukanlah sunnah. Rasulullah shallallahu 'alaihi wasallam singgah di tempat itu, hanya karena memang beliau bersikap lebih murah hati apabila keluar. Dan Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Hafsh bin Ghiyats] -dalam riwayat lain- Dan telah menceritakan kepadaku [Abu Rabi' Az Zahrani] Telah menceritakan kepada kami [Hammad bin Zaid] -dalam riwayat lain- Dan Telah menceritakannya kepada kami [Abu Kamil] Telah menceritakan kepada kami [Yazid bin Zurai'] Telah menceritakan kepada kami [Habib Al Mu'allim] semuanya dari [Hisyam] dengan isnad ini, semisalnya."
            },
            {
                "number": 2159,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ أَنَّ أَبَا بَكْرٍ وَعُمَرَ وَابْنَ عُمَرَ كَانُوا يَنْزِلُونَ الْأَبْطَحَ قَالَ الزُّهْرِيُّ وَأَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَأَنَّهَا لَمْ تَكُنْ تَفْعَلُ ذَلِكَ وَقَالَتْ إِنَّمَا نَزَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَنَّهُ كَانَ مَنْزِلًا أَسْمَحَ لِخُرُوجِهِ",
                "id": "Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari Salim bahwasanya; Abu Bakar, Umar dan Ibnu Umar semuanya singgah di Abthah. Zuhri berkata, telah mengabarkan kepadaku [Urwah], dari [Aisyah] bahwa ia tidak pernah melakukan hal itu. Aisyah berkata, \"Rasulullah shallallahu 'alaihi wasallam singgah, hanya karena tempat itu lebih luas dan leluasa untuk keluarnya belau.\""
            },
            {
                "number": 2160,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ وَأَحْمَدُ بْنُ عَبْدَةَ وَاللَّفْظُ لِأَبِي بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَيْسَ التَّحْصِيبُ بِشَيْءٍ إِنَّمَا هُوَ مَنْزِلٌ نَزَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ishaq bin Ibrahim] dan [Ibnu Abu Umar] dan [Ahmad bin Abdah] -lafazhnya dari Abu Bakr- Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru] dari [Atha`] dari [Ibnu Abbas] ia berkata; \"Berhenti di Hashbah bukanlah sesuatu yang diperintahkan, dan itu hanyalah sebuah tempat peristirahatan (persinggahan) Rasulullah shallallahu 'alaihi wasallam saja.\""
            },
            {
                "number": 2161,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ قَالَ أَبُو رَافِعٍلَمْ يَأْمُرْنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَنْزِلَ الْأَبْطَحَ حِينَ خَرَجَ مِنْ مِنًى وَلَكِنِّي جِئْتُ فَضَرَبْتُ فِيهِ قُبَّتَهُ فَجَاءَ فَنَزَلَقَالَ أَبُو بَكْرٍ فِي رِوَايَةِ صَالِحٍ قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ وَفِي رِوَايَةِ قُتَيْبَةَ قَالَ عَنْ أَبِي رَافِعٍ وَكَانَ عَلَى ثَقَلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] semuanya dari [Ibnu Uyainah] - [Zuhair] berkata- Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Shalih bin Kaisan] dari [Sulaiman bin Yasar] ia berkata, [Abu Rafi'] berkata; \"Ketika keluar dari Mina, Rasulullah shallallahu 'alaihi wasallam tidak menyuruhku untuk beristirahat di Abthah, akan tetapi aku datang untuk mendirikan kemahnya lalu beliaupun datang dan beristirahat di sana.\" Dalam hadits yang diriwayatkan Shalih, Abu Bakar berkata; Aku mendengar Sulaiman bin Yasar mengatakan dalam riwayat Qutaibah; Dari Abu Rafi': \"Dan ia berada di atas barang bawaan Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2162,
                "arab": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ نَنْزِلُ غَدًا إِنْ شَاءَ اللَّهُ بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ",
                "id": "Telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman bin Auf] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Esok hari, Insya Allah, kita akan singgah di Khaif (perbukitan) Bani Kinanah yang ditempat itulah mereka bersumpah dan mengadakan perjanjian di atas kekufuran.\""
            },
            {
                "number": 2163,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنِي الْأَوْزَاعِيُّ حَدَّثَنِي الزُّهْرِيُّ حَدَّثَنِي أَبُو سَلَمَةَ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ بِمِنًى نَحْنُ نَازِلُونَ غَدًا بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ وَذَلِكَ إِنَّ قُرَيْشًا وَبَنِي كِنَانَةَ تَحَالَفَتْ عَلَى بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ أَنْ لَا يُنَاكِحُوهُمْ وَلَا يُبَايِعُوهُمْ حَتَّى يُسْلِمُوا إِلَيْهِمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي بِذَلِكَ الْمُحَصَّبَ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepadaku [Al Auza'i] telah menceritakan kepadaku [Az Zuhri] telah menceritakan kepadaku [Abu Salamah] Telah menceritakan kepada kami [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami saat berada di Mina: \"Esok hari, Insya Allah, kita akan singgah di Khaif (daerah perbukitan) Bani Kinanah, sebuah tempat yang mereka pergunakan untuk bersumpah dan mengadakan perjanjian di atas kekufuran.\" Pastinya, dulu, orang-orang Quraisy dan Bani Kinanah telah mengadakan perjanjian atas Bani Hasyim dan Bani Al Muththalib, bahwa mereka tidak akan menikahi wanita-wanita mereka dan tidak pula berbai'at kepada mereka, hingga mereka menyerahkan Rasulullah shallallahu 'alaihi wasallam yakni di Al Muhashshab (tempat pelemparan Jumrah). "
            },
            {
                "number": 2164,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنِي وَرْقَاءُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْزِلُنَا إِنْ شَاءَ اللَّهُ إِذَا فَتَحَ اللَّهُ الْخَيْفُ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Syababah] telah menceritakan kepadaku [Warqa`] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tempat persinggahan kita Isnya Allah, jika Allah mengizinkan adalah Khaif, yakni tempat yang dipergunakan oleh (Bani Kinanah dan Quraisy) mengadakan perjanjian di atas kekufuran.\""
            },
            {
                "number": 2165,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ الْعَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ اسْتَأْذَنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيتَ بِمَكَّةَ لَيَالِي مِنًى مِنْ أَجْلِ سِقَايَتِهِ فَأَذِنَ لَهُو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ مُحَمَّدِ بْنِ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ كِلَاهُمَا عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Ibnu Numair] dan [Abu Usamah] keduanya berkata, Telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Numair] -lafazh juga miliknya- Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [ubaidhullah] telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Al Abbas bin Abdul Muthalib meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk bermalam di Makkah pada malam-malam di Mina, dengan tujuan agar ia dapat memberi minum jama'ah haji, maka beliau pun mengizinkannya. Dan Telah menceritakannya kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus] -dalam riwayat lain- Dan telah menceritakannya kepadaku [Muhammad bin Hatim] dan [Abdu bin Humaid] semuanya dari [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] keduanya dari [ubaidhullah bin Umar] dengan isnad ini, semisalnya."
            },
            {
                "number": 2166,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ قَالَكُنْتُ جَالِسًا مَعَ ابْنِ عَبَّاسٍ عِنْدَ الْكَعْبَةِ فَأَتَاهُ أَعْرَابِيٌّ فَقَالَ مَا لِي أَرَى بَنِي عَمِّكُمْ يَسْقُونَ الْعَسَلَ وَاللَّبَنَ وَأَنْتُمْ تَسْقُونَ النَّبِيذَ أَمِنْ حَاجَةٍ بِكُمْ أَمْ مِنْ بُخْلٍ فَقَالَ ابْنُ عَبَّاسٍ الْحَمْدُ لِلَّهِ مَا بِنَا مِنْ حَاجَةٍ وَلَا بُخْلٍ قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَاحِلَتِهِ وَخَلْفَهُ أُسَامَةُ فَاسْتَسْقَى فَأَتَيْنَاهُ بِإِنَاءٍ مِنْ نَبِيذٍ فَشَرِبَ وَسَقَى فَضْلَهُ أُسَامَةَ وَقَالَ أَحْسَنْتُمْ وَأَجْمَلْتُمْ كَذَا فَاصْنَعُوا فَلَا نُرِيدُ تَغْيِيرَ مَا أَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Al Minhal Adl Dlarir] Telah menceritakan kepada kami [Yazid bin Zurai'] Telah menceritakan kepada kami [Humaid Ath Thawil] dari [Bakr bin Abdullah Al Muzani] ia berkata; Aku duduk bersama [Ibnu Abbas] di dekat Ka'bah. Tiba-tiba datanglah seorang A'rabi dan bertanya, \"Aku lihat anak-anak paman Anda minum madu dan susu, sedangkan Anda minum anggur. Apakah hal itu karena suatu kepentingan-kepentingan tertentu ataukah karena bakhil?\" Ibnu Abbas menjawab, \"Segala puji bagi Allah, tidak ada kepentingan-kepentingan tertentu bagi kami dan tidak pula karena bakhil. Rasulullah shallallahu 'alaihi wasallam pernah datang berkendaraan dan di belakangnya membonceng Usamah. Beliau minta minum, lalu kami beri minum dengan anggur. Setelah beliau minum, sisanya diberikan kepada Usamah. Dan beliau pun bersabda: 'Perbuatanmu ini sangat baik dan bagus; teruskanlah seperti itu.' Aku tidak ingin merubah yang telah diperintahkan oleh Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2167,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ عَبْدِ الْكَرِيمِ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُومَ عَلَى بُدْنِهِ وَأَنْ أَتَصَدَّقَ بِلَحْمِهَا وَجُلُودِهَا وَأَجِلَّتِهَا وَأَنْ لَا أُعْطِيَ الْجَزَّارَ مِنْهَا قَالَ نَحْنُ نُعْطِيهِ مِنْ عِنْدِنَاو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا سُفْيَانُ وَقَالَ إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ أَخْبَرَنِي أَبِي كِلَاهُمَا عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ فِي حَدِيثِهِمَا أَجْرُ الْجَازِرِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abdul Karim] dari [Mujahid] dari [Abdurrahman bin Abu Laila] dari [Ali] ia berkata; \"Aku disuruh Rasulullah shallallahu 'alaihi wasallam mengurus penyembelihan hewan kurban, menyedekahkan daging dan kulitnya, serta mengurus segala sesuatu yang berhubungan dengan kesempurnaan kurban. Tetapi aku dilarang oleh beliau mengambil upah untuk tukang potong dari hewan kurban itu. Maka untuk upahnya kami ambilkan dari uang kami sendiri.\" Dan Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] dan [Amru An Naqid] dan [Zuhair bin Harb] mereka berkata, Telah menceritakan kepada kami [Ibnu Uyainah] dari [Abdul Karim Al Jazari] dengan isnad ini, semisalnya. Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Sufyan] - [Ishaq bin Ibrahim] berkata- telah mengabarkan kepada kami [Mu'adz bin Hisyam] ia berkata, telah mengabarkan kepadaku [bapakku] keduanya dari [Ibnu Abu Najih] dari [Mujahid] dari [Ibnu Abu Laila] dari [Ali] dari Nabi shallallahu 'alaihi wasallam. Dan di dalam hadits keduanya tidak tercantum; \"Ajrul Jazir (ongkos untuk tukang potong).\""
            },
            {
                "number": 2168,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ وَمُحَمَّدُ بْنُ مَرْزُوقٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ أَنَّ مُجَاهِدًا أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ أَخْبَرَهُأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يَقُومَ عَلَى بُدْنِهِ وَأَمَرَهُ أَنْ يَقْسِمَ بُدْنَهُ كُلَّهَا لُحُومَهَا وَجُلُودَهَا وَجِلَالَهَا فِي الْمَسَاكِينِ وَلَا يُعْطِيَ فِي جِزَارَتِهَا مِنْهَا شَيْئًاو حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَبْدُ الْكَرِيمِ بْنُ مَالِكٍ الْجَزَرِيُّ أَنَّ مُجَاهِدًا أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ بِمِثْلِهِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim bin Maimun] dan [Muhammad bin Marzuq] dan [Abdu bin Humaid] -Abdu berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- Telah menceritakan kepada kami [Muhamamd bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Al Hasan bin Muslim] bahwa [Mujahid] telah mengabarkan kepadanya bahwa [Abdurrahman bin Abu Laila] telah mengabarkan kepadanya bahwa [Ali bin Abu Thalib] telah mengabarkan kepadanya bahwasanya; Nabi shallallahu 'alaihi wasallam menyuruhnya untuk mengurusi penyembelihan hewan kurban, menyedekahkan daging dan kulitnya serta segala sesuatu yang berhubungan dengan kesempurnaan kurban kepada orang-orang miskin. Dan dagingnya tidak boleh diberikan kepada tukang potong sedikitpun sebagai upah. Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abdul Karim bin Malik Al Jazari] bahwa [Mujahid] telah mengabarkan kepadanya bahwa [Abdurrahman bin Abu Laila] telah mengabarkan kepadanya bahwa [Ali bin Abu Thalib] telah mengabarkan kepadanya, bahwasanya; Nabi shallallahu 'alaihi wasallam memerintahkannya.. Yakni serupa dengan hadits di atas."
            },
            {
                "number": 2169,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا مَالِكٌ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَحَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ الْبَدَنَةَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَةٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Malik] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Yahya bin Yahya] -lafazh darinya- ia berkata, saya telah membacakan kepada [Malik] dari [Abu Zubair] dari [Jabir bin Abdullah] ia berkata; \"Kami pernah menyembelih kurban bersama Rasulullah shallallahu 'alaihi wasallam di tahun perjanjian Hudaibiyah, untuk kurban seekor unta atau seekor sapi, kami bersekutu tujuh orang.\""
            },
            {
                "number": 2170,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ فَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَشْتَرِكَ فِي الْإِبِلِ وَالْبَقَرِ كُلُّ سَبْعَةٍ مِنَّا فِي بَدَنَةٍ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Zubair] dari [Jabir] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ahmad bin Yunus] Telah menceritakan kepada kami [Zuhair] Telah menceritakan kepada kami [Abu Zubair] dari [Jabir] ia berkata; \"Kami pergi haji bersama Rasulullah shallallahu 'alaihi wasallam. Lalu beliau menyuruh kami bersekutu tujuh orang untuk kurban seekor Unta atau seekor sapi bersekutu tujuh orang.\""
            },
            {
                "number": 2171,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَحَجَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَحَرْنَا الْبَعِيرَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَةٍ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Azrah bin Tsabit] dari [Abu Zubair] dari [Jabir bin Abdullah] ia berkata; \"Kami naik haji bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami menyembelih seekor unta dari tujuh orang yang bersekutu, dan seekor sapi juga hasil dari dari tujuh orang yang bersekutu.\""
            },
            {
                "number": 2172,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَاشْتَرَكْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَجِّ وَالْعُمْرَةِ كُلُّ سَبْعَةٍ فِي بَدَنَةٍ فَقَالَ رَجُلٌ لِجَابِرٍ أَيُشْتَرَكُ فِي الْبَدَنَةِ مَا يُشْتَرَكُ فِي الْجَزُورِ قَالَ مَا هِيَ إِلَّا مِنْ الْبُدْنِ وَحَضَرَ جَابِرٌ الْحُدَيْبِيَةَ قَالَ نَحَرْنَا يَوْمَئِذٍ سَبْعِينَ بَدَنَةً اشْتَرَكْنَا كُلُّ سَبْعَةٍ فِي بَدَنَةٍ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata; \"Kami bersekutu bersama Nabi shallallahu 'alaihi wasallam di dalam haji dan umrah, yakni tujuh orang berkurban seekor Unta atau seekor Sapi.\" Kemudian seorang laki-laki bertanya kepada Jabir, \"Bolehkah bersekutu dalam kambing sebagaimana bolehnya bersekutu dalam Unta atau sapi?\" Jabir menjawab, \"Tidaklah kami bersekutu, kecuali dalam Badanah (unta atau sapi).\" Jabir juga turut serata dalam peristiwa Hudaibiyah. Ia berkata, \"Di hari itu, kami menyembelih tujuh puluh ekor Badanah (Unta atau sapi). Setiap tujuh orang dari kami bersekutu untuk kurban seekor Badanah (unta atau sapi).\""
            },
            {
                "number": 2173,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنَا أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَفَأَمَرَنَا إِذَا أَحْلَلْنَا أَنْ نُهْدِيَ وَيَجْتَمِعَ النَّفَرُ مِنَّا فِي الْهَدِيَّةِ وَذَلِكَ حِينَ أَمَرَهُمْ أَنْ يَحِلُّوا مِنْ حَجِّهِمْ فِي هَذَا الْحَدِيثِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepada kami [Abu Zubair] bahwa ia mendengar [Jabir bin Abdullah] menceritakan tentang haji Nabi shallallahu 'alaihi wasallam. ia berkata; \"Beliau memerintahkan kami ketika bertahallul untuk menyembelih hewan kurban. Dan di antara kami ada sekelompok orang yang berkumpul\/berserikat untuk satu hewan kurban, tepatnya, saat beliau memerintahkan mereka bertahallul dari ibadah haji.\""
            },
            {
                "number": 2174,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ عَبْدِ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا نَتَمَتَّعُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعُمْرَةِ فَنَذْبَحُ الْبَقَرَةَ عَنْ سَبْعَةٍ نَشْتَرِكُ فِيهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] dari [Abdul Malik] dari [Atha`] dari [Jabir bin Abdullah] ia berkata; \"Kami pernah melaksanakan haji Tamattu' bersama Rasulullah shallallahu 'alaihi wasallam. Saat itu, kami menyembelih sapi hasil serikat dari tujuh orang dari kami.\""
            },
            {
                "number": 2175,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَذَبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَائِشَةَ بَقَرَةً يَوْمَ النَّحْرِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] Telah menceritakan kepada kami [Yahya bin Zakarinya bin Abu Za`idah] dari [Ibnu Juraij] dari [Abu Zubair] dari [Jabir] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam menyembelih seekor sapi pada hari Nahar untuk kurban Aisyah.\""
            },
            {
                "number": 2176,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنِي سَعِيدُ بْنُ يَحْيَى الْأُمَوِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُانَحَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِوَفِي حَدِيثِ ابْنِ بَكْرٍ عَنْ عَائِشَةَ بَقَرَةً فِي حَجَّتِهِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] -dalam riwayat lain- Dan telah menceritakan kepadaku [Sa'id bin Yahya Al Umawi] telah menceritakan kepadaku [bapakku] Telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata; \"Rasulullah shallallahu 'alaihi wasallam menyembelih hewan kurban untuk isteri-isterinya. -sedangkan di dalam hadits Ibnu Bakr tercantum- (beliau menyembelih) sapi untuk kurban Aisyah dalam ibadah hajinya.\""
            },
            {
                "number": 2177,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ يُونُسَ عَنْ زِيَادِ بْنِ جُبَيْرٍأَنَّ ابْنَ عُمَرَ أَتَى عَلَى رَجُلٍ وَهُوَ يَنْحَرُ بَدَنَتَهُ بَارِكَةً فَقَالَ ابْعَثْهَا قِيَامًا مُقَيَّدَةً سُنَّةَ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Khalid bin Abdullah] dari [Yunus] dari [Ziyad bin Jubair] bahwasanya; [Ibnu Umar] mendatangi seorang laki-laki yang sedang menyembelih Badanah (hewan kurban berupa Unta atau Sapi) dengan diderumkan, maka ia pun berkata, \"Sembelihlah dalam keadaan berdiri dan terikat, itulah sunnah Nabi kalian shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2178,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهْدِي مِنْ الْمَدِينَةِ فَأَفْتِلُ قَلَائِدَ هَدْيِهِ ثُمَّ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُو حَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ و حَدَّثَنَاه سَعِيدُ بْنُ مَنْصُورٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَخَلَفُ بْنُ هِشَامٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَأَنِّي أَنْظُرُ إِلَيَّ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Muhammad bin Rumh] keduanya berkata, telah mengabarkan kepada kami [Laits] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [Urwah bin Az Zubair] dan [Amrah binti Abdurrahman] bahwa [Aisyah] berkata; \"Rasulullah shallallahu 'alaihi wasallam menyerahkan hewan kurbannya dari Madinah, dan akulah yang mengalungkan tanda pada hewan kurbannya. Sesudah itu, beliau tidak lagi menjauhi sesuatu yang biasanya dijauhi oleh seorang yang sedang Ihram.\" Dan telah menceritakannya kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dengan isnad ini, semisalnya. Dan Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Zuhair bin Harb] keduanya berkata, Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Urwah] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam. -dalam riwayat lain- Dan Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Khalaf bin Hisyam] dan [Qutaibah bin Sa'id] mereka berkata, telah mengabarkan kepada kami [Hammad bin Zaid] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] ia berkata; Aku masih teringat, saat aku mengalungkan tanda hewan kurban pada hadya Rasulullah shallallahu 'alaihi wasallam. Yakni serupa dengan hadits di atas."
            },
            {
                "number": 2179,
                "arab": "و حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ قَالَ سَمِعْتُ عَائِشَةَ تَقُولُكُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ هَاتَيْنِ ثُمَّ لَا يَعْتَزِلُ شَيْئًا وَلَا يَتْرُكُهُ",
                "id": "Dan Telah menceritakan kepada kami [Sa'id bin Manshur] Telah menceritakan kepada kami [Sufyan] dari [Abdurrahman bin Al Qasim] dari [bapaknya] ia berkata, saya mendengar [Aisyah] berkata; \"Dulu akulah yang mengalungkan tanda pada hewan kurban Rasulullah shallallahu 'alaihi wasallam dengan kedua tanganku ini. Sesudah itu, tidak lagi menjauhkan diri dari sesuatu (yang sebelumnya dilarang), dan tidak pula meninggalkannya.\""
            },
            {
                "number": 2180,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا أَفْلَحُ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْفَتَلْتُ قَلَائِدَ بُدْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ ثُمَّ أَشْعَرَهَا وَقَلَّدَهَا ثُمَّ بَعَثَ بِهَا إِلَى الْبَيْتِ وَأَقَامَ بِالْمَدِينَةِ فَمَا حَرُمَ عَلَيْهِ شَيْءٌ كَانَ لَهُ حِلًّا",
                "id": "Dan Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] Telah menceritakan kepada kami [Aflah] dari [Al Qasim] dari [Aisyah] ia berkata; \"Aku mengalungkan tanda pada Unta (hewan kurban) milik Rasulullah shallallahu 'alaihi wasallam dengan tanganku sendiri, lalu aku menyisirinya. Sesudah itu, beliau membawa dan mengirimkannya ke Baitullah. Lalu beliau bermukim di Madinah, sehingga tidak lagi sesuatu yang haram, apa yang sebelumnya halal bagi beliau.\""
            },
            {
                "number": 2181,
                "arab": "و حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالَ ابْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ الْقَاسِمِ وَأَبِي قِلَابَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْعَثُ بِالْهَدْيِ أَفْتِلُ قَلَائِدَهَا بِيَدَيَّ ثُمَّ لَا يُمْسِكُ عَنْ شَيْءٍ لَا يُمْسِكُ عَنْهُ الْحَلَالُ",
                "id": "Dan Telah menceritakan kepada kami [Ali bin Hujr As Sa'di] dan [Ya'qub bin Ibrahim Ad Dauraqi] - [Ibnu Hajr] berkata- Telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ayyub] dari [Al Qasim] dan [Abu Qilabah] dari [Aisyah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutus hewan kurban dan akulah yang mengalungkan tanda padanya dengan tanganku sendiri. Sesudah itu, beliau tidak lagi menahan diri dari sesuatu yang telah diperbolehkan bagi seseorang yang telah bertahallul.\""
            },
            {
                "number": 2182,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا حُسَيْنُ بْنُ الْحَسَنِ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ الْقَاسِمِ عَنْ أُمِّ الْمُؤْمِنِينَ قَالَتْأَنَا فَتَلْتُ تِلْكَ الْقَلَائِدَ مِنْ عِهْنٍ كَانَ عِنْدَنَا فَأَصْبَحَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَلَالًا يَأْتِي مَا يَأْتِي الْحَلَالُ مِنْ أَهْلِهِ أَوْ يَأْتِي مَا يَأْتِي الرَّجُلُ مِنْ أَهْلِهِ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Husain bin Al Hasan] Telah menceritakan kepada kami [Ibnu Aun] dari [Al Qasim] dari [Ummul Mukminin] ia berkata; \"Akulah yang memberi tanda pada hewan kurban itu dengan tali yang terbuat dari Shuff. Dan Rasulullah shallallahu 'alaihi wasallam pun berada di tempat kami dalam keadaan halal, ia berbuat sebagaimana apa yang boleh diperbuat oleh seorang yang telah tahallul terhadap keluarganya. Atau seperti biasanya seorang suami yang mendatangi isterinya.\""
            },
            {
                "number": 2183,
                "arab": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْلَقَدْ رَأَيْتُنِي أَفْتِلُ الْقَلَائِدَ لِهَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْغَنَمِ فَيَبْعَثُ بِهِ ثُمَّ يُقِيمُ فِينَا حَلَالًا",
                "id": "Dan Telah menceritakan kepada kami [Zuhair bin Harb] Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] ia berkata; \"Aku masih ingat ketika aku mengalungkan tanda hewan kurban kepada kambing kurban Rasulullah shallallahu 'alaihi wasallam, lalu hewan itu dikirimkan, sedangkan beliau sendiri tetap bersama kami dalam keadaan halal.\""
            },
            {
                "number": 2184,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْرُبَّمَا فَتَلْتُ الْقَلَائِدَ لِهَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُقَلِّدُ هَدْيَهُ ثُمَّ يَبْعَثُ بِهِ ثُمَّ يُقِيمُ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُ",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] -Yahya berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] ia berkata; \"Aku mengalungkan tanda untuk hadya (hewan kurban) Rasulullah shallallahu 'alaihi wasallam, lalu beliau mengirimkannaya (ke tanah haram) dan bermukim dengan tidak lagi menjauhkan diri dari hal-hal yang biasanya dijauhi oleh seorang yang sedang ihram.\""
            },
            {
                "number": 2185,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنِي أَبِي حَدَّثَنِي مُحَمَّدُ بْنُ جُحَادَةَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْكُنَّا نُقَلِّدُ الشَّاءَ فَنُرْسِلُ بِهَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَلَالٌ لَمْ يَحْرُمْ عَلَيْهِ مِنْهُ شَيْءٌ",
                "id": "Dan Telah menceritakan kepada kami [Ishaq bin Manshur] Telah menceritakan kepada kami [Abush Shamad] telah menceritakan kepadaku [bapakku] telah menceritakan kepadaku [Muhammad bin Juhadah] dari [Al Hakam] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] ia berkata; \"Kami pernah mengalungkan tanda kurban pada kambing kurban Rasulullah shallallahu 'alaihi wasallam, lalu kambing itu dikirimkan ke tanah haram. Sedangkan Rasulullah shallallahu 'alaihi wasallam telah halal dari segala sesuatu (yang sebelumnya dilarang), tidak haram bagi beliau segala itu.\""
            },
            {
                "number": 2186,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهَا أَخْبَرَتْهُ أَنَّ ابْنَ زِيَادٍ كَتَبَ إِلَى عَائِشَةَ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَ مَنْ أَهْدَى هَدْيًا حَرُمَ عَلَيْهِ مَا يَحْرُمُ عَلَى الْحَاجِّ حَتَّى يُنْحَرَ الْهَدْيُ وَقَدْ بَعَثْتُ بِهَدْيِي فَاكْتُبِي إِلَيَّ بِأَمْرِكِ قَالَتْ عَمْرَةُ قَالَتْ عَائِشَةُ لَيْسَ كَمَا قَالَ ابْنُ عَبَّاسٍأَنَا فَتَلْتُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ ثُمَّ قَلَّدَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ ثُمَّ بَعَثَ بِهَا مَعَ أَبِي فَلَمْ يَحْرُمْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ أَحَلَّهُ اللَّهُ لَهُ حَتَّى نُحِرَ الْهَدْيُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Abdullah bin Abu Bakr] dari [Amrah binti Abdurrahman] bahwa ia telah mengabarkan kepadanya, bahwasanya; Ibnu Zaid menulis surat kepada [Aisyah] bahwa Abdullah bin Abbas telah mengatakan; Bahwa barangsiapa yang telah menyerahkan hewan kurbannya, maka telah haram baginya apa-apa yang haram bagi seorang yang melaksanakan haji sampai hewan kurban itu disembelih. Sementara aku sendiri telah mengirim hewan kurbanku. Karena itu, tuliskanlah padaku apa yang menjadi pendapat Anda. Amrah berkata; Aisyah berkata, \"Yang benar, tidak sebagaimana apa yang dikatakan Ibnu Abbas. Aku sendiri pernah mengalungkan tanda hewan kurban pada hadya milik Rasulullah shallallahu 'alaihi wasallam, lalu beliau menuntunnya dengan tangannya sendiri kemudian mengirimkannya bersama bapakku (ke tanah haram). Dan sesudah itu, tidak ada sesuatu lagi yang haram atas Rasulullah shallallahu 'alaihi wasallam, yang sebelumnya Allah halalkan hingga hewan kurbannya disembelih.\""
            },
            {
                "number": 2187,
                "arab": "و حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ قَالَسَمِعْتُ عَائِشَةَ وَهِيَ مِنْ وَرَاءِ الْحِجَابِ تُصَفِّقُ وَتَقُولُ كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ ثُمَّ يَبْعَثُ بِهَا وَمَا يُمْسِكُ عَنْ شَيْءٍ مِمَّا يُمْسِكُ عَنْهُ الْمُحْرِمُ حَتَّى يُنْحَرَ هَدْيُهُو حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا دَاوُدُ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا زَكَرِيَّاءُ كِلَاهُمَا عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ بِمِثْلِهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan Telah menceritakan kepada kami [Sa'id bin Manshur] Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Isma'il bin Abu Khalid] dari [Asy Sya'bi] dari [Masruq] ia berkata; Dari balik tabir, aku mendengar [Aisyah] menetuk tangannya lalu berkata; \"Aku pernah mengalungkan tanda hewan kurban Rasulullah shallallahu 'alaihi wasallam, lalu beliau mengirimnya (ke tanah haram). Sesudah itu, beliau tidak lagi menahan diri dari sesuatu, sebagaimana seorang muhrim (sedang ihram) menjauhkan diri daripadanya. Demikianlah hingga beliau menyembelih hewan kurbannya.\" Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Abdul Wahhab] Telah menceritakan kepada kami [Dawud] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Zakariya`] keduanya dari [Asy Sya'bi] dari [Masruq] dari [Aisyah] semisalnya, dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 2188,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً فَقَالَ ارْكَبْهَا قَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ فَقَالَ ارْكَبْهَا وَيْلَكَ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِو حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْحِزَامِيُّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ بِهَذَا الْإِسْنَادِ وَقَالَ بَيْنَمَا رَجُلٌ يَسُوقُ بَدَنَةً مُقَلَّدَةً",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwasanya; Rasulullah shallallahu 'alaihi wasallam pernah melihat seroang laki-laki yang sedang membawa Badanah (unta atau sapi), maka beliau bersabda: \"Kendarailah.\" Laki-laki itu berkata, \"Wahai Rasulullah, binatang ini adalah Badanah (Sapi\/unta untuk dijadikan hewan kurban).\" Beliau bersabda lagi: \"Kendarailah.\" Pada kali yang kedua atau ke tiga beliau ucapkan: \"Huss, kamu!\" Dan Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Al Mughirah bin Abdurrahman Al Hizami] dari [Abu Zinad] dari [Al A'raj] dengan isnad ini, ia berkata dengan redaksi; \"Ketika ada seseorang yang menuntun hewan kurbannya..\""
            },
            {
                "number": 2189,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَعَنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ بَيْنَمَا رَجُلٌ يَسُوقُ بَدَنَةً مُقَلَّدَةً قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيْلَكَ ارْكَبْهَا فَقَالَ بَدَنَةٌ يَا رَسُولَ اللَّهِ قَالَ وَيْلَكَ ارْكَبْهَا وَيْلَكَ ارْكَبْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] ia berkata; inilah yang telah diceritakan kepada kami oleh [Abu Hurairah] dari Muhammad Rasulullah shallallahu 'alaihi wasallam. Lalu ia pun menyebutkan beberapa hadits, diantaranya adalah; Abu Hurairah berkata; Ketika ada seseorang yang menuntun Badanah (sapi\/unta miliknya) yang telah dikalungkan sebagai tanda untuk hewan kurban, Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Huss kamu, kendarai saja.\" Maka laki-laki itu pun berkata, \"Ini adalah hewan kurban ya Rasulullah.\" Beliau bersabda: \"Huss kamu, hendarai saja! Huss kamu, kendarai saja!\""
            },
            {
                "number": 2190,
                "arab": "و حَدَّثَنِي عَمْرٌو النَّاقِدُ وَسُرَيْجُ بْنُ يُونُسَ قَالَا حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُمَيْدٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ وَأَظُنُّنِي قَدْ سَمِعْتُهُ مِنْ أَنَسٍ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ أَخْبَرَنَا هُشَيْمٌ عَنْ حُمَيْدٍ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسٍ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ يَسُوقُ بَدَنَةً فَقَالَ ارْكَبْهَا فَقَالَ إِنَّهَا بَدَنَةٌ قَالَ ارْكَبْهَا مَرَّتَيْنِ أَوْ ثَلَاثًا",
                "id": "Dan telah menceritakan kepadaku [Amru An Naqid] dan [Suraij bin Yunus] keduanya berkata, Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Humaid] dari [Tsabit] dari [Anas] ia berkata; Aku menduga kuat, bahwa aku telah mendengarnya dari Anas -dalam riwayat lain- Dan Telah menceritakan kepada kami [Yahya bin Yahya] -lafazh juga miliknya- telah mengabarkan kepada kami [Husyaim] dari [Humaid] dari [Tsabit Al Bunani] dari [Anas] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah melewati seorang laki-laki yang menuntun hewan kurbannya (berupa sapi atau unta), lalu beliau pun bersabda: \"Kendarailah.\" Laki-laki itu berkata, \"Ini adalah hewan kurban ya Rasulullah.\" Beliau bersabda lagi: \"Kendarai saja.\" Beliau mengucapkannya dua atau tiga kali."
            },
            {
                "number": 2191,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ أَنَسٍ قَالَ سَمِعْتُهُ يَقُولُمُرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَدَنَةٍ أَوْ هَدِيَّةٍ فَقَالَ ارْكَبْهَا قَالَ إِنَّهَا بَدَنَةٌ أَوْ هَدِيَّةٌ فَقَالَ وَإِنْو حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ بِشْرٍ عَنْ مِسْعَرٍ حَدَّثَنِي بُكَيْرُ بْنُ الْأَخْنَسِ قَالَ سَمِعْتُ أَنَسًا يَقُولُا مُرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَدَنَةٍ فَذَكَرَ مِثْلَهُ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Waki'] dari [Mis'ar] dari [Bukair bin Al Akhnas] dari [Anas] ia berkata; Saya mendengarnya berkata; Seorang laki-laki pernah melewati Nabi shallallahu 'alaihi wasallam dengan menuntun hewan kurbannya, maka beliau pun bersabda: \"Kendarailah.\" Laki-laki itu berkata, \"Hewan ini adalah hewan untuk kurban.\" Beliau bersabda: \"Meskipun hewan kurban.\" Dan Telah menceritakannya kepada kami [Abu Kuraib] Telah menceritakan kepada kami [Ibnu Bisyr] dari [Mis'ar] telah menceritakan kepadaku [Bukair bin Al Akhnas] ia berkata, saya mendengar [Anas] berkata; \"Nabi shallallahu 'alaihi wasallam pernah dilewati oleh seseorang yang menuntun hewan kurbannya..\" Maka ia pun menyebutkan hadits yang semisalnya."
            },
            {
                "number": 2192,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ قَالَسَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ سُئِلَ عَنْ رُكُوبِ الْهَدْيِ فَقَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ارْكَبْهَا بِالْمَعْرُوفِ إِذَا أُلْجِئْتَ إِلَيْهَا حَتَّى تَجِدَ ظَهْرًا",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] ia berkata, saya mendengar [Jabir bin Abdullah] bahwasanya; Ia pernah ditanya tentang mengendarai hewan kurban, maka ia pun menjawab; Aku telah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Kendarailah ia dengan baik (wajar) jika kamu memerlukannya sampai kamu memperoleh kendaraan yang lain.\""
            },
            {
                "number": 2193,
                "arab": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ قَالَسَأَلْتُ جَابِرًا عَنْ رُكُوبِ الْهَدْيِ فَقَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ارْكَبْهَا بِالْمَعْرُوفِ حَتَّى تَجِدَ ظَهْرًا",
                "id": "Dan Telah menceritakan kepada kami [Salamah bin Syabib] Telah menceritakan kepada kami [Al Hasan bin A'yan] Telah menceritakan kepada kami [Ma'qil] dari [Abu Zubair] ia berkata; Saya bertanya kepada [Jabir] tentang mengendarai hewan kurban, maka ia pun menjawab: \"Kendarailah dengan baik hingga kamu memperoleh kendaraan yang lain.\""
            },
            {
                "number": 2194,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ أَبِي التَّيَّاحِ الضُّبَعِيِّ حَدَّثَنِي مُوسَى بْنُ سَلَمَةَ الْهُذَلِيُّ قَالَ انْطَلَقْتُ أَنَا وَسِنَانُ بْنُ سَلَمَةَ مُعْتَمِرَيْنِ قَالَ وَانْطَلَقَ سِنَانٌ مَعَهُ بِبَدَنَةٍ يَسُوقُهَا فَأَزْحَفَتْ عَلَيْهِ بِالطَّرِيقِ فَعَيِيَ بِشَأْنِهَا إِنْ هِيَ أُبْدِعَتْ كَيْفَ يَأْتِي بِهَا فَقَالَ لَئِنْ قَدِمْتُ الْبَلَدَ لَأَسْتَحْفِيَنَّ عَنْ ذَلِكَ قَالَ فَأَضْحَيْتُ فَلَمَّا نَزَلْنَا الْبَطْحَاءَ قَالَ انْطَلِقْ إِلَى ابْنِ عَبَّاسٍ نَتَحَدَّثْ إِلَيْهِ قَالَ فَذَكَرَ لَهُ شَأْنَ بَدَنَتِهِ فَقَالَ عَلَى الْخَبِيرِ سَقَطْتَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسِتَّ عَشْرَةَ بَدَنَةً مَعَ رَجُلٍ وَأَمَّرَهُ فِيهَا قَالَ فَمَضَى ثُمَّ رَجَعَ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا أُبْدِعَ عَلَيَّ مِنْهَا قَالَ انْحَرْهَا ثُمَّ اصْبُغْ نَعْلَيْهَا فِي دَمِهَا ثُمَّ اجْعَلْهُ عَلَى صَفْحَتِهَا وَلَا تَأْكُلْ مِنْهَا أَنْتَ وَلَا أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَو حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ أَبِي التَّيَّاحِ عَنْ مُوسَى بْنِ سَلَمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بِثَمَانَ عَشْرَةَ بَدَنَةً مَعَ رَجُلٍ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ عَبْدِ الْوَارِثِ وَلَمْ يَذْكُرْ أَوَّلَ الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abdul Warits bin Sa'id] dari [Abu At Tayyah Adl Dluba'i] telah menceritakan kepadaku [Musa bin salamah Al Hudzali] ia berkata; Aku pernah menunaikan Umrah bersama Sinan bin Salamah. Sinan berangkat dengan membawa hewan kurban dengan menuntunnya. Namun, hewan kurban itu ternyata melelahkannya di tengah jalan, dan Sinan tidak tahu apa yang mesti dilakukan pada hewan kurbannya. Jika ia menelantarkannya, bagaimana ia akan membawanya nanti. Maka ia pun berkata, \"Kalau aku sampai di tanah haram, niscaya aku akan menanyakan permasalahan tersebut dan baru berkurban.\" Ketika kami sampai di Bathha`, ia berkata, \"Temuilah [Ibnu Abbas], ceritakanlah padanya.\" Maka Musa pun menuturkan perihal hewan kurban itu. Ibu Abbas berkata; Kamu telah berbuat salah, Rasulullah shallallahu 'alaihi wasallam pernah mengirimkan bersama seorang laki-laki (dan mengangkatnya sebagai pimpinan safar) sebanyak enam belas Badanah (hewan kurban berupa unta atau sapi). Kemudian laki-laki itu pergi, kemudian kembali lagi dan berkata, \"Wahai Rasulullah, apa yang mesti saya lakukan jika di antara hewan kurban itu ada yang sakit (sekarat)?\" beliau bersabda: \"Sembelihlah, kemudian rendamkan terompahnya ke darahnya dan sapukan ke badannya. Kemudian kamu dan siapa pun yang menyertaimu, tidak boleh memakannya.\" Dan Telah menceritakannya kepada kami [Yahya bin Yahya] dan [Abu Bakr bin Abu Syaibah] dan [Ali bin Hujr] -Yahya berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- Telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Abu At Tayyah] dari [Musa bin Salamah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam mengirimkan sepuluh Badanah (hewan kurban berupa sapi atau unta) bersama dengan seorang laki-laki. Kemudian ia pun menyebutkan hadits Abdul Warits, dan ia tidak menyebutkan bagian awal hadits."
            },
            {
                "number": 2195,
                "arab": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سِنَانِ بْنِ سَلَمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ ذُؤَيْبًا أَبَا قَبِيصَةَ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَبْعَثُ مَعَهُ بِالْبُدْنِ ثُمَّ يَقُولُ إِنْ عَطِبَ مِنْهَا شَيْءٌ فَخَشِيتَ عَلَيْهِ مَوْتًا فَانْحَرْهَا ثُمَّ اغْمِسْ نَعْلَهَا فِي دَمِهَا ثُمَّ اضْرِبْ بِهِ صَفْحَتَهَا وَلَا تَطْعَمْهَا أَنْتَ وَلَا أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَ",
                "id": "Telah menceritakan kepadaku [Abu Ghassan Al Misma'i] Telah menceritakan kepada kami [Abdul A'la] Telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Sinan bin Salamah] dari [Ibnu Abbas] bahwa [Dzuaiba Abu Qabishah] telah menceritakan keapdanya bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengirimkan hewan kurban kepadanya, lalu berliau bersabda: \"Jika ada di antara hewan-hewan kurban itu sakit, yang kamu khawatirkan akan mati, sembelihlah. Kemudian redamkan terompahnya ke darahnya lalu sapukan ke badannya. Kamu atau siapa pun yang menyertaimu tidak boleh memakannya.\""
            },
            {
                "number": 2196,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّاسُ يَنْصَرِفُونَ فِي كُلِّ وَجْهٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِقَالَ زُهَيْرٌ يَنْصَرِفُونَ كُلَّ وَجْهٍ وَلَمْ يَقُلْ فِي",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Zuhair bin Harb] keduanya berkata, Telah menceritakan kepada kami [Sufyan] dari [Sulaiman Al Ahwal] dari [Thawus] dari [Ibnu Abbas] ia berkata; Orang banyak telah pulang ke negerinya masing-masing. Maka bersabdalah Rasulullah shallallahu 'alaihi wasallam: \"Janganlah seseorang pulang sebelum dia thawaf wada' (akhir) di Baitullah.\" Zuhair berkata; \"Yansharifuuna Kulla wajhiin.\" Dan ia tidak menyebutkan; \"Fii.\""
            },
            {
                "number": 2197,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لِسَعِيدٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَأُمِرَ النَّاسُ أَنْ يَكُونَ آخِرُ عَهْدِهِمْ بِالْبَيْتِ إِلَّا أَنَّهُ خُفِّفَ عَنْ الْمَرْأَةِ الْحَائِضِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Abu Bakr bin Abu Syaibah] -lafazhnya miliknya Sa'id- keduanya berkata, Telah menceritakan kepada kami [Sufyan] dari [Ibnu Thawus] dari [bapaknya] dari [Ibnu Abbas] ia berkata; Orang banyak diperintahkan oleh Rasulullah shallallahu 'alaihi wasallam agar mereka melakukan thawaf terakhir di Baitullah sebelum pulang, kecuali yang diberi keringanan, yakni perempuan haid."
            },
            {
                "number": 2198,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ قَالَكُنْتُ مَعَ ابْنِ عَبَّاسٍ إِذْ قَالَ زَيْدُ بْنُ ثَابِتٍ تُفْتِي أَنْ تَصْدُرَ الْحَائِضُ قَبْلَ أَنْ يَكُونَ آخِرُ عَهْدِهَا بِالْبَيْتِ فَقَالَ لَهُ ابْنُ عَبَّاسٍ إِمَّا لَا فَسَلْ فُلَانَةَ الْأَنْصَارِيَّةَ هَلْ أَمَرَهَا بِذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَرَجَعَ زَيْدُ بْنُ ثَابِتٍ إِلَى ابْنِ عَبَّاسٍ يَضْحَكُ وَهُوَ يَقُولُ مَا أَرَاكَ إِلَّا قَدْ صَدَقْتَ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepadaku [Yahya bin Sa'id] dari [Ibnu Juraij] telah mengabarkan kepadaku [Al Hasan bin Muslim] dari [Thawus] ia berkata; Aku pernah bersama-sama dengan [Ibnu Abbas], tiba-tiba Zaid bin Tsabit berakata, \"Apakah Anda berfatwa bahwa seorang wanita yang sedang haid boleh pulang sebelum melakukan thawaf wada' di Baitullah?\" Ibnu Abbas menjawab, \"Kalau kamu tidak percaya, maka tanyakanlah kepada Si Fulanah Al Anshariyah. Apakah Rasulullah shallallahu 'alaihi wasallam menyuruhnya untuk berbuat seperti itu?\" Maka Zaid bin Tsabit pun kembali kepada Ibnu Abbas seraya tertawa dan berkata, \"Tidaklah aku melihatmu, kecuali pasti Anda telah berkata benar.\""
            },
            {
                "number": 2199,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ وَعُرْوَةَ أَنَّ عَائِشَةَ قَالَتْحَاضَتْ صَفِيَّةُ بِنْتُ حُيَيٍّ بَعْدَ مَا أَفَاضَتْ قَالَتْ عَائِشَةُ فَذَكَرْتُ حِيضَتَهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَابِسَتُنَا هِيَ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ كَانَتْ أَفَاضَتْ وَطَافَتْ بِالْبَيْتِ ثُمَّ حَاضَتْ بَعْدَ الْإِفَاضَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْتَنْفِرْحَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى وَأَحْمَدُ بْنُ عِيسَى قَالَ أَحْمَدُ حَدَّثَنَا وَقَالَ الْآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ قَالَتْ طَمِثَتْ صَفِيَّةُ بِنْتُ حُيَيٍّ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بَعْدَ مَا أَفَاضَتْ طَاهِرًا بِمِثْلِ حَدِيثِ اللَّيْثِ و حَدَّثَنَا قُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا أَيُّوبُ كُلُّهُمْ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا ذَكَرَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ صَفِيَّةَ قَدْ حَاضَتْ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ",
                "id": "Telah menceritakan kepadaku [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Laits] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Muhammad bin Rumh] Telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [Abu Salamah] dan [Urwah] bahwa ['Aisyah] berkata; Shafiyah binti Huyai mengalami haid setelah ia melaksanakan thawaf ifadhah. Maka aku pun mengadukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau pun bersabda: \"Memangnya dia menjadi penghalang bagi kami?\" Kukatakan, \"Ya Rasulullah, tapi ia telah melaksanakan thawaf ifadhah dan thawaf di Baitullah, setelah thawaf Ifadlah barulah ia haid, lalu ia mengalami haid!\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau begitu, dia berangkat bersama-sama dengan kita.\" Telah menceritakan kepadaku [Abu Thahir] dan [Harmalah bin Yahya] dan [Ahmad bin Isa] -Ahmad berkata- Telah menceritakan kepada kami -sementara dua orang yang lain berkata- telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dengan isnad ini, ia berkata; Shafiyyah binti Huyay isteri Nabi shallallahu 'alaihi wasallam mengalami haid setelah thawaf Ifadlah, yakni pada saat haji wada'. Yakni sebagaimana hadits Laits. Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Laits] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Zuhair bin Harb] Telah menceritakan kepada kami [Sufyan] -dalam riwayat lain- Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Abdul Wahhab] Telah menceritakan kepada kami [Ayyub] semuanya dari [Abdurrahman bin Al Qasim] dari [bapaknya] dari [Aisyah] bahwa ia menuturkan kepada Rasulullah shallallahu 'alaihi wasallam, bahwa Shafiyyah mengalami haid. Yakni semakna dengan hadits Az Zuhri."
            },
            {
                "number": 2200,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا أَفْلَحُ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْكُنَّا نَتَخَوَّفُ أَنْ تَحِيضَ صَفِيَّةُ قَبْلَ أَنْ تُفِيضَ قَالَتْ فَجَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَابِسَتُنَا صَفِيَّةُ قُلْنَا قَدْ أَفَاضَتْ قَالَ فَلَا إِذَنْ",
                "id": "Dan Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] Telah menceritakan kepada kami [Aflah] dari [Al Qasim bin Muhammad] dari [Aisyah] ia berkata; Kami khawatir Shafiyyah mengalami haid sebelum melakukan thawaf Ifadlah. Kemudian Rasulullah shallallahu 'alaihi wasallam pun menemui kami dan bertanya: \"Apakah kalian akan menangguhkan kita berangkat ke Madinah?\" Kami menjawab, \"Shafiyyah telah melakukan thawaf Ifadlah.\" Beliau bersabda: \"Tidak, kalau begitu.\""
            },
            {
                "number": 2201,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَأَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ إِنَّ صَفِيَّةَ بِنْتَ حُيَيٍّ قَدْ حَاضَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّهَا تَحْبِسُنَا أَلَمْ تَكُنْ قَدْ طَافَتْ مَعَكُنَّ بِالْبَيْتِ قَالُوا بَلَى قَالَ فَاخْرُجْنَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Abdullah bin Abu Bakr] dari [bapaknya] dari [Amrah binti Abdurrahman] dari [Aisyah] bahwa ia pernah berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah, sesungguhnya Shafiyyah binti Huyay mengalami haid.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sepertinya, ia kan menangguhkan perjalanan kita. Bukankah ia telah melakukan thawaf bersama kalian di Baitullah?\" mereka menjawab, \"Ya, benar.\" Beliau bersabda: \"Kalau begitu, hendaklah ia ikut berangkat sama-sama dengan kita.\""
            },
            {
                "number": 2202,
                "arab": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى حَدَّثَنِي يَحْيَى بْنُ حَمْزَةَ عَنْ الْأَوْزَاعِيِّ لَعَلَّهُ قَالَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَادَ مِنْ صَفِيَّةَ بَعْضَ مَا يُرِيدُ الرَّجُلُ مِنْ أَهْلِهِ فَقَالُوا إِنَّهَا حَائِضٌ يَا رَسُولَ اللَّهِ قَالَ وَإِنَّهَا لَحَابِسَتُنَا فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ زَارَتْ يَوْمَ النَّحْرِ قَالَ فَلْتَنْفِرْ مَعَكُمْ",
                "id": "Telah menceritakan kepadaku [Al Hakam bin Musa] telah menceritakan kepadaku [Yahya bin Hamrah] dari [Al Auza'i] sepertinya ia berkata, dari [Yahya bin Abu Katsir] dari [Muhammad bin Ibrahim At Taimi] dari [Abu Salamah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam menginginkan sesuatu dari Shafiyyah sebagaimana apa yang biasanya diinginkan oleh seorang laki-laki terhadap isterinya, maka mereka pun berkata, \"Sesungguhnya ia dalah keadaan haid ya Rasulullah.\" Beliau bersabda: \"Kalau bergitu, ia akan menangguhkan perjalanan kita?\" mereka berkata lagi, \"Ya Rasulullah, sesungguhnya ia telah melakukan thawaf pada hari Nahar.\" Akhirnya beliau bersabda: \"Hendaklah ia berangkat bersama-sama kalian.\""
            },
            {
                "number": 2203,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْلَمَّا أَرَادَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْفِرَ إِذَا صَفِيَّةُ عَلَى بَابِ خِبَائِهَا كَئِيبَةً حَزِينَةً فَقَالَ عَقْرَى حَلْقَى إِنَّكِ لَحَابِسَتُنَا ثُمَّ قَالَ لَهَا أَكُنْتِ أَفَضْتِ يَوْمَ النَّحْرِ قَالَتْ نَعَمْ قَالَ فَانْفِرِيو حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ جَمِيعًا عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ الْحَكَمِ غَيْرَ أَنَّهُمَا لَا يَذْكُرَانِ كَئِيبَةً حَزِينَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata, Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] -dalam riwayat lain- Dan Telah menceritakan kepada kami [ubaidhullah bin Mu'adz] -lafazh darinya- Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] ia berkata; Ketika Rasulullah shallallahu 'alaihi wasallam hendak pulang (ke Madinah), tiba-tiba Shafiyyah berdiri di depan pintu kemahnya dengan raut muka yang sedih, maka beliau pun bersabda: \"Kenapa memang?.\" Kemudian beliau bertanya padanya: \"Apakah kamu telah melakukan thawaf ifadlah pada hari Nahar?\" Shafiyyah menjawab, \"Ya.\" Beliau bersabda: \"Berangkatlah bersama-sama dengan kami.\" Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] dan [Abu Mu'awiyah] dari [Al A'masy] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Zuhair bin Harb] Telah menceritakan kepada kami [Jarir] dari [Manshur] semuanya dari [Al Aswad] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam sebagaimana haditsnya Al Hakam, hanya saja keduanya tidak menyebutkan, \"KA`IBATAN HAZIINATAN.\""
            },
            {
                "number": 2204,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ وَبِلَالٌ وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ فَأَغْلَقَهَا عَلَيْهِ ثُمَّ مَكَثَ فِيهَا قَالَ ابْنُ عُمَرَ فَسَأَلْتُ بِلَالًا حِينَ خَرَجَ مَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَعَلَ عَمُودَيْنِ عَنْ يَسَارِهِ وَعَمُودًا عَنْ يَمِينِهِ وَثَلَاثَةَ أَعْمِدَةٍ وَرَاءَهُ وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ ثُمَّ صَلَّى",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] ia berkata, saya telah membacakan kepada [Malik] dari [Nafi'] dari [Ibnu Umar] bahwasanya; Rasulullah shallallahu 'alaihi wasallam masuk ke Ka'bah bersama-sama dengan Usamah, Bilal, dan Usamah bin Thalhah Al Hajabi, lalu dikuncinya pintu dan mereka ditinggal di dalam beberapa lama. Ibnu Umar berkata; Aku bertanya kepada [Bilal] ketika ia keluar, \"Apa yang diperbuat Rasulullah shallallahu 'alaihi wasallam di dalam?\" Bilal menjawab, \"Beliau berdiri sholat antara dua tiang, yang satunya sebelah kiri dan yang satunya lagi sebelah kanan serta tiga tiang berada di belakangnya. Ketika itu Baitullah mempunyai enam tiang, lalu beliau sholat di situ.\""
            },
            {
                "number": 2205,
                "arab": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو كَامِلٍ الْجَحْدَرِيُّ كُلُّهُمْ عَنْ حَمَّادِ بْنِ زَيْدٍ قَالَ أَبُو كَامِلٍ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ فَنَزَلَ بِفِنَاءِ الْكَعْبَةِ وَأَرْسَلَ إِلَى عُثْمَانَ بْنِ طَلْحَةَ فَجَاءَ بِالْمِفْتَحِ فَفَتَحَ الْبَابَ قَالَ ثُمَّ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِلَالٌ وَأُسَامَةُ بْنُ زَيْدٍ وَعُثْمَانُ بْنُ طَلْحَةَ وَأَمَرَ بِالْبَابِ فَأُغْلِقَ فَلَبِثُوا فِيهِ مَلِيًّا ثُمَّ فَتَحَ الْبَابَ فَقَالَ عَبْدُ اللَّهِ فَبَادَرْتُ النَّاسَ فَتَلَقَّيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَارِجًا وَبِلَالٌ عَلَى إِثْرِهِ فَقُلْتُ لِبِلَالٍ هَلْ صَلَّى فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ قُلْتُ أَيْنَ قَالَ بَيْنَ الْعَمُودَيْنِ تِلْقَاءَ وَجْهِهِ قَالَ وَنَسِيتُ أَنْ أَسْأَلَهُ كَمْ صَلَّىو حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ أَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ عَلَى نَاقَةٍ لِأُسَامَةَ بْنِ زَيْدٍ حَتَّى أَنَاخَ بِفِنَاءِ الْكَعْبَةِ ثُمَّ دَعَا عُثْمَانَ بْنَ طَلْحَةَ فَقَالَ ائْتِنِي بِالْمِفْتَاحِ فَذَهَبَ إِلَى أُمِّهِ فَأَبَتْ أَنْ تُعْطِيَهُ فَقَالَ وَاللَّهِ لَتُعْطِينِهِ أَوْ لَيَخْرُجَنَّ هَذَا السَّيْفُ مِنْ صُلْبِي قَالَ فَأَعْطَتْهُ إِيَّاهُ فَجَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَهُ إِلَيْهِ فَفَتَحَ الْبَابَ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ",
                "id": "Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] dan [Qutaibah bin Sa'id] dan [Abu Kamil Al Jahdari] semuanya dari [Hammad bin Zaid] - [Abu Kamil] berkata- Telah menceritakan kepada kami [Hammad] Telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata; Ketika Rasulullah shallallahu 'alaihi wasallam tiba di Makkah di hari penaklukannya, beliau turun di halaman Ka'bah dan menyuruh Utsman bin Thalhah mengambil kunci, lalu dibukanya pintu Ka'bah. Kemudian masuklah Nabi shallallahu 'alaihi wasallam disusul Bilal, Zaid dan Utsman bin Thalhah. Kemudian pintu Ka'bah pun di tutup, lalu mereka tinggal di dalam beberapa saat lamanya. Dan setelah Usman membuka pintu, kata Abdullah, aku segera mendahului orang banyak menemui Rasulullah shallallahu 'alaihi wasallam. Beliau keluar dengan diiringi Bilal, maka aku pun bertanya kepada [Bilal], \"Apakah Rasulullah shallallahu 'alaihi wasallam menunaikan sholat di dalam?\" Bilal menjawab, \"Ya.\" Aku bertanya lagi, \"Di mana?\" Bilal menjawab, \"Di antara dua tiang.\" Ibnu Umar berkata; Aku lupa untuk menanyakan berapa lama beliau sholat. Dan Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Ayyub As Sakhtiyani] dari [Nafi'] dari [Ibnu Umar] ia berkata; Pada saat Fathu Makkah (pembebasana kota Makkah) Rasulullah shallallahu 'alaihi wasallam datang dengan mengendarai Unta milik Usamah bin Zaid hingga beliau menambatkan untanya di halaman Ka'bah. Kemudian beliau memanggil Utsman bin Thalhah dan bersabda: \"Berikanlah kunci (Ka'bah) padaku.\" Ia pun pergi menemui ibunya, namun ibunya enggan untuk memberikan, maka ia pun berkata, \"Demi Allah, ibu menyerahkan kunci itu, atau aku akan menghunuskan pedang ini.\" Lalu wanita itu pun memberikan kuncinya. Utsman bin Thalhah kemudian menghadap Nabi shallallahu 'alaihi wasallam, dan beliau langsung membuka pintu Ka'bah. Lalu ia pun menyebutkan hadits sebagaimana haditsnya Hammad bin Zaid."
            },
            {
                "number": 2206,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ وَمَعَهُ أُسَامَةُ وَبِلَالٌ وَعُثْمَانُ بْنُ طَلْحَةَ فَأَجَافُوا عَلَيْهِمْ الْبَابَ طَوِيلًا ثُمَّ فُتِحَ فَكُنْتُ أَوَّلَ مَنْ دَخَلَ فَلَقِيتُ بِلَالًا فَقُلْتُ أَيْنَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَيْنَ الْعَمُودَيْنِ الْمُقَدَّمَيْنِ فَنَسِيتُ أَنْ أَسْأَلَهُ كَمْ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Yahya Al Qaththan] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abu Usamah] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Numair] -lafazh miliknya- Telah menceritakan kepada kami [Abdah] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam memasuki Baitullah bersama Usamah, Bilal, dan Utsman bin Thalhah. Lalu mereka menutup pintu agak lama, dan membukanya kembali. Dan akulah yang pertama kali masuk dan langsung menemui Bilal. Aku tanyakan padanya, \"Di manakah Rasulullah shallallahu 'alaihi wasallam sholat?\" [Bilal] menjawab, \"Diantara dua tiang bagian depan.\" Dan aku lupa untuk menanyakan padanya, Rasulullah shallallahu 'alaihi wasallam sholat berapa raka'at."
            },
            {
                "number": 2207,
                "arab": "و حَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَوْنٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ انْتَهَى إِلَى الْكَعْبَةِ وَقَدْ دَخَلَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِلَالٌ وَأُسَامَةُ وَأَجَافَ عَلَيْهِمْ عُثْمَانُ بْنُ طَلْحَةَ الْبَابَ قَالَ فَمَكَثُوا فِيهِ مَلِيًّا ثُمَّ فُتِحَ الْبَابُ فَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَقِيتُ الدَّرَجَةَ فَدَخَلْتُ الْبَيْتَ فَقُلْتُ أَيْنَ صَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا هَا هُنَا قَالَ وَنَسِيتُ أَنْ أَسْأَلَهُمْ كَمْ صَلَّى",
                "id": "Dan telah menceritakan kepadaku [Humaid bin Mas'adah] Telah menceritakan kepada kami [Khalid bin Al Harits] Telah menceritakan kepada kami [Abdullah bin Aun] dari [Nafi'] dari [Abdullah bin Umar] bahwasanya; Ketika ia sampai di Ka'bah, ternyata Rasulullah shallallahu 'alaihi wasallam telah masuk ke dalamnya beserta [Bilal], [Usamah] dan yang terakhir dan menutup pintu adalah [Utsman bin Thalhah]. Lalu mereka berdiam diri beberapa lama di dalamnya. Kemudian pintu Ka'bah di buka kembali, dan keluarlah Nabi shallallahu 'alaihi wasallam, lalu aku pun segera naik dan masuk ke dalam Baitullah kemudian aku tanyakan, \"Di manakah Nabi shallallahu 'alaihi wasallam sholat?\" Mereka menjawab, \"Di sini (yakni di atara dua tiang).\" Dan aku lupa untuk menanyakan kepada mereka, berapa raka'atkah beliau sholat."
            },
            {
                "number": 2208,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّهُ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَبِلَالٌ وَعُثْمَانُ بْنُ طَلْحَةَ فَأَغْلَقُوا عَلَيْهِمْ فَلَمَّا فَتَحُوا كُنْتُ فِي أَوَّلِ مَنْ وَلَجَ فَلَقِيتُ بِلَالًا فَسَأَلْتُهُ هَلْ صَلَّى فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ صَلَّى بَيْنَ الْعَمُودَيْنِ الْيَمَانِيَيْنِ",
                "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Laits] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepada kami [Laits] dari [Ibnu Syihab] dari [Salim] dari [bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam masuk ke dalam Baitullah beserta Usamah bin Zaid, Bilal dan Utsman bin Thalhah, lalu mereka menutup pintunya. Ketika mereka membukanya kembali, maka akulah yang pertama kali menemui mereka. Kutemui [Bilal] dan bertanya padanya, \"Apakah Rasulullah shallallahu 'alaihi wasallam sholat di dalamnya?\" Bilal menjawab, \"Ya. Beliau sholat di antara dua tiang Yamani.\""
            },
            {
                "number": 2209,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَبِلَالٌ وَعُثْمَانُ بْنُ طَلْحَةَ وَلَمْ يَدْخُلْهَا مَعَهُمْ أَحَدٌ ثُمَّ أُغْلِقَتْ عَلَيْهِمْقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَأَخْبَرَنِي بِلَالٌ أَوْ عُثْمَانُ بْنُ طَلْحَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي جَوْفِ الْكَعْبَةِ بَيْنَ الْعَمُودَيْنِ الْيَمَانِيَيْنِ",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Salim bin Abdullah] dari [bapaknya] ia berkata; Aku melihat Rasulullah shallallahu 'alaihi wasallam masuk ke dalam Ka'bah beserta Usamah bin Zaid, Bilal dan Utsman bin Thalhah. Tidak ada orang lain yang masuk selain mereka, lalu mereka pun menutup pintunya. [Abdullah bin Umar] berkata; Lalu [Bilal] atau [Utsman] mengabarkan padaku bahwa Rasulullah shallallahu 'alaihi wasallam sholat di dalam Ka'bah yakni di antara dua tiang Yamani."
            },
            {
                "number": 2210,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ ابْنِ بَكْرٍ قَالَ عَبْدٌ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ قُلْتُ لِعَطَاءٍ أَسَمِعْتَ ابْنَ عَبَّاسٍ يَقُولُاإِنَّمَا أُمِرْتُمْ بِالطَّوَافِ وَلَمْ تُؤْمَرُوا بِدُخُولِهِ قَالَ لَمْ يَكُنْ يَنْهَى عَنْ دُخُولِهِ وَلَكِنِّي سَمِعْتُهُ يَقُولُ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا دَخَلَ الْبَيْتَ دَعَا فِي نَوَاحِيهِ كُلِّهَا وَلَمْ يُصَلِّ فِيهِ حَتَّى خَرَجَ فَلَمَّا خَرَجَ رَكَعَ فِي قُبُلِ الْبَيْتِ رَكْعَتَيْنِ وَقَالَ هَذِهِ الْقِبْلَةُ قُلْتُ لَهُ مَا نَوَاحِيهَا أَفِي زَوَايَاهَا قَالَ بَلْ فِي كُلِّ قِبْلَةٍ مِنْ الْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Abdu bin Humaid] semuanya dari [Ibnu Bakr] - [Abdu] berkata- telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] ia berkata; Aku bertanya kepada [Atha`], \"Apakah Anda pernah mendengar [Ibnu Abbas] berkata, 'Kalian diperintahkan untuk melakukan thawaf, dan kalian tidak diperintahkan untuk memasuki Ka'bah? '\" Atha` menjawab, \"Ia tidaklah melarang untuk memasukinya. Tetapi saya mendengarnya berkata; [Usamah bin Zaid] mengabarkan kepadaku, bahwa Nabi shallallahu 'alaihi wasallam masuk ke dalam Baitullah kemudian beliau berdo'a di setiap sudutnya, dan beliau tidak sholat di dalam sampai beliau keluar kembali. setelah di luar, beliau sholat dua raka'at di hadapannya. Kemudian beliau bersabda: 'Inilah kiblat.' Aku bertanya, 'Salah satu sisinya, ataukah seluruh sisinya? ' beliau menjawab: 'Bahkan setiap sisinya.'\""
            },
            {
                "number": 2211,
                "arab": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا عَطَاءٌ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ وَفِيهَا سِتُّ سَوَارٍ فَقَامَ عِنْدَ سَارِيَةٍ فَدَعَا وَلَمْ يُصَلِّ",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farrukh] Telah menceritakan kepada kami [Hammam] Telah menceritakan kepada kami [Atha`] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam masuk ke dalam Ka'bah. Saat itu, di dalam Ka'bah terdapat enam batang tiang. Lalu beliau berdiri di satu tiang, kemudian berdo'a dan beliau tidak sholat."
            },
            {
                "number": 2212,
                "arab": "و حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ حَدَّثَنِي هُشَيْمٌ أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ قَالَقُلْتُ لِعَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ فِي عُمْرَتِهِ قَالَ لَا",
                "id": "Dan telah menceritakan kepadaku [Suraij bin Yunus] telah menceritakan kepadaku [Husyaim] telah mengabarkan kepada kami [Isma'il bin Abu Khalid] ia berkata; Aku bertanya kepada [Abdullah bin Abu Aufa] salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam, \"Apakah Nabi shallallahu 'alaihi wasallam masuk ke dalam Baitullah saat melaksanakan Umrah?\" Abdullah bin Abu Aufa menjawab, \"Tidak.\""
            },
            {
                "number": 2213,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا حَدَاثَةُ عَهْدِ قَوْمِكِ بِالْكُفْرِ لَنَقَضْتُ الْكَعْبَةَ وَلَجَعَلْتُهَا عَلَى أَسَاسِ إِبْرَاهِيمَ فَإِنَّ قُرَيْشًا حِينَ بَنَتْ الْبَيْتَ اسْتَقْصَرَتْ وَلَجَعَلْتُ لَهَا خَلْفًاو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Kalau bukanlah karena kaummu yang baru saja meninggalkan kekufuran, akan kurombak Ka'bah dan kubangun di atas pondasi Ibrahim. Sebab, dulu orang-orang Quraisy mempersimpatnya saat mereka membangunnya. Dan aku akan membuatkannya pintu belakang.\" Dan Telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, Telah menceritakan kepada kami [Ibnu Numair] dari [Hisyam] dengan isnad ini."
            },
            {
                "number": 2214,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ أَخْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَمْ تَرَيْ أَنَّ قَوْمَكِ حِينَ بَنَوْا الْكَعْبَةَ اقْتَصَرُوا عَنْ قَوَاعِدِ إِبْرَاهِيمَ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَلَا تَرُدُّهَا عَلَى قَوَاعِدِ إِبْرَاهِيمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا حِدْثَانُ قَوْمِكِ بِالْكُفْرِ لَفَعَلْتُفَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَئِنْ كَانَتْ عَائِشَةُ سَمِعَتْ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أُرَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرَكَ اسْتِلَامَ الرُّكْنَيْنِ اللَّذَيْنِ يَلِيَانِ الْحِجْرَ إِلَّا أَنَّ الْبَيْتَ لَمْ يُتَمَّمْ عَلَى قَوَاعِدِ إِبْرَاهِيمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Ibnu Syihab] dari [Salim bin Abdullah] bahwa [Abdullah bin Muhammad bin Abu Bakr Ash Shiddiq] telah mengabarkan kepada [Abdullah bin Umar] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bertanya: \"Tidakkah kamu lihat, bahwa ketika kaummu membangun Ka'bah, mereka mempersempitnya dari Asas Ibrahim?\" Aisyah berkata; Kukatakan, \"Apakah Anda akan mengembalikannya pada Asas Ibrahim?\" maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sekiranya bukan karena kaummu yang baru saja meninggalkan kekufuran, niscaya aku akan melakukannya.\" Abdullah bin Umar berkata; Duh sekiranya Aisyah mendengar hal ini langsung dari Rasulullah shallallahu 'alaihi wasallam!\" Setahuku Rasulullah shallallahu 'alaihi wasallam tidak pernah terlihat meninggalkan pengusapan dua rukun dekat Hijr, hanya saja pembangunan Baitullah di atas Asas Ibrahim belum sempurna ketika itu."
            },
            {
                "number": 2215,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ مَخْرَمَةَ ح و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ نَافِعًا مَوْلَى ابْنِ عُمَرَ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي بَكْرِ بْنِ أَبِي قُحَافَةَ يُحَدِّثُ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْلَا أَنَّ قَوْمَكِ حَدِيثُو عَهْدٍ بِجَاهِلِيَّةٍ أَوْ قَالَ بِكُفْرٍ لَأَنْفَقْتُ كَنْزَ الْكَعْبَةِ فِي سَبِيلِ اللَّهِ وَلَجَعَلْتُ بَابَهَا بِالْأَرْضِ وَلَأَدْخَلْتُ فِيهَا مِنْ الْحِجْرِ",
                "id": "Telah menceritakan kepadaku [Abu Thahir] telah mengabarkan kepada kami [Abdullah bin Wahb] dari [Makhramah] -dalam riwayat lain- Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili] Telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Makhramah bin Bukair] dari [bapaknya] ia berkata, saya mendengar [Nafi'] Maula Ibnu Umar berkata, saya mendengar [Abdullah bin Abu Bakr bin Abu Quhafah] menceritakan dari Abdullah bin Umar dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwa ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau bukanlah karena kaummu yang baru saja meninggalkan masa jahiliyah, akan kupakai dana Ka'bah untuk memperbaikinya; pintunya akan kubuat sampai ke tanah, dan hijir kumasukkan ke dalamnya.\""
            },
            {
                "number": 2216,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنِي ابْنُ مَهْدِيٍّ حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ عَنْ سَعِيدٍ يَعْنِي ابْنَ مِينَاءَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ يَقُولُ حَدَّثَتْنِي خَالَتِي يَعْنِي عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَائِشَةُ لَوْلَا أَنَّ قَوْمَكِ حَدِيثُو عَهْدٍ بِشِرْكٍ لَهَدَمْتُ الْكَعْبَةَ فَأَلْزَقْتُهَا بِالْأَرْضِ وَجَعَلْتُ لَهَا بَابَيْنِ بَابًا شَرْقِيًّا وَبَابًا غَرْبِيًّا وَزِدْتُ فِيهَا سِتَّةَ أَذْرُعٍ مِنْ الْحِجْرِ فَإِنَّ قُرَيْشًا اقْتَصَرَتْهَا حَيْثُ بَنَتْ الْكَعْبَةَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepadaku [Ibnu Mahdi] Telah menceritakan kepada kami [Salim bin Hayyan] dari [Sa'id bin Mina`] ia berkata, saya mendengar [Abdullah bin Zubair] berkata, telah menceritakan kepadaku [bibikku] yakni Aisyah, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Aisyah! Kalaulah bukan karena kaummu baru saja keluar dari syirik, akan kupugar Ka'bah kembali. Kubuat pintunya dua buah, satu menghadap ke timur dan satu lagi ke barat. Kemudian akan kutambah lebarnya enam hasta dari hijir. Sesungguhnya orang-orang Quraisy telah memperkecilnya ketika dahulu mereka memugarnya.\""
            },
            {
                "number": 2217,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ أَخْبَرَنِي ابْنُ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ قَالَ لَمَّا احْتَرَقَ الْبَيْتُ زَمَنَ يَزِيدَ بْنِ مُعَاوِيَةَ حِينَ غَزَاهَا أَهْلُ الشَّامِ فَكَانَ مِنْ أَمْرِهِ مَا كَانَ تَرَكَهُ ابْنُ الزُّبَيْرِ حَتَّى قَدِمَ النَّاسُ الْمَوْسِمَ يُرِيدُ أَنْ يُجَرِّئَهُمْ أَوْ يُحَرِّبَهُمْ عَلَى أَهْلِ الشَّامِ فَلَمَّا صَدَرَ النَّاسُ قَالَ يَا أَيُّهَا النَّاسُ أَشِيرُوا عَلَيَّ فِي الْكَعْبَةِ أَنْقُضُهَا ثُمَّ أَبْنِي بِنَاءَهَا أَوْ أُصْلِحُ مَا وَهَى مِنْهَا قَالَ ابْنُ عَبَّاسٍ فَإِنِّي قَدْ فُرِقَ لِي رَأْيٌ فِيهَا أَرَى أَنْ تُصْلِحَ مَا وَهَى مِنْهَا وَتَدَعَ بَيْتًا أَسْلَمَ النَّاسُ عَلَيْهِ وَأَحْجَارًا أَسْلَمَ النَّاسُ عَلَيْهَا وَبُعِثَ عَلَيْهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ابْنُ الزُّبَيْرِ لَوْ كَانَ أَحَدُكُمْ احْتَرَقَ بَيْتُهُ مَا رَضِيَ حَتَّى يُجِدَّهُ فَكَيْفَ بَيْتُ رَبِّكُمْ إِنِّي مُسْتَخِيرٌ رَبِّي ثَلَاثًا ثُمَّ عَازِمٌ عَلَى أَمْرِي فَلَمَّا مَضَى الثَّلَاثُ أَجْمَعَ رَأْيَهُ عَلَى أَنْ يَنْقُضَهَا فَتَحَامَاهُ النَّاسُ أَنْ يَنْزِلَ بِأَوَّلِ النَّاسِ يَصْعَدُ فِيهِ أَمْرٌ مِنْ السَّمَاءِ حَتَّى صَعِدَهُ رَجُلٌ فَأَلْقَى مِنْهُ حِجَارَةً فَلَمَّا لَمْ يَرَهُ النَّاسُ أَصَابَهُ شَيْءٌ تَتَابَعُوا فَنَقَضُوهُ حَتَّى بَلَغُوا بِهِ الْأَرْضَ فَجَعَلَ ابْنُ الزُّبَيْرِ أَعْمِدَةً فَسَتَّرَ عَلَيْهَا السُّتُورَ حَتَّى ارْتَفَعَ بِنَاؤُهُ وَقَالَ ابْنُ الزُّبَيْرِ إِنِّي سَمِعْتُ عَائِشَةَ تَقُولُإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْلَا أَنَّ النَّاسَ حَدِيثٌ عَهْدُهُمْ بِكُفْرٍ وَلَيْسَ عِنْدِي مِنْ النَّفَقَةِ مَا يُقَوِّي عَلَى بِنَائِهِ لَكُنْتُ أَدْخَلْتُ فِيهِ مِنْ الْحِجْرِ خَمْسَ أَذْرُعٍ وَلَجَعَلْتُ لَهَا بَابًا يَدْخُلُ النَّاسُ مِنْهُ وَبَابًا يَخْرُجُونَ مِنْهُقَالَ فَأَنَا الْيَوْمَ أَجِدُ مَا أُنْفِقُ وَلَسْتُ أَخَافُ النَّاسَ قَالَ فَزَادَ فِيهِ خَمْسَ أَذْرُعٍ مِنْ الْحِجْرِ حَتَّى أَبْدَى أُسًّا نَظَرَ النَّاسُ إِلَيْهِ فَبَنَى عَلَيْهِ الْبِنَاءَ وَكَانَ طُولُ الْكَعْبَةِ ثَمَانِيَ عَشْرَةَ ذِرَاعًا فَلَمَّا زَادَ فِيهِ اسْتَقْصَرَهُ فَزَادَ فِي طُولِهِ عَشْرَ أَذْرُعٍ وَجَعَلَ لَهُ بَابَيْنِ أَحَدُهُمَا يُدْخَلُ مِنْهُ وَالْآخَرُ يُخْرَجُ مِنْهُ فَلَمَّا قُتِلَ ابْنُ الزُّبَيْرِ كَتَبَ الْحَجَّاجُ إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ يُخْبِرُهُ بِذَلِكَ وَيُخْبِرُهُ أَنَّ ابْنَ الزُّبَيْرِ قَدْ وَضَعَ الْبِنَاءَ عَلَى أُسٍّ نَظَرَ إِلَيْهِ الْعُدُولُ مِنْ أَهْلِ مَكَّةَ فَكَتَبَ إِلَيْهِ عَبْدُ الْمَلِكِ إِنَّا لَسْنَا مِنْ تَلْطِيخِ ابْنِ الزُّبَيْرِ فِي شَيْءٍ أَمَّا مَا زَادَ فِي طُولِهِ فَأَقِرَّهُ وَأَمَّا مَا زَادَ فِيهِ مِنْ الْحِجْرِ فَرُدَّهُ إِلَى بِنَائِهِ وَسُدَّ الْبَابَ الَّذِي فَتَحَهُ فَنَقَضَهُ وَأَعَادَهُ إِلَى بِنَائِهِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sariya] Telah menceritakan kepada kami [Ibnu Abu Zaidah] telah mengabarkan kepadaku [Ibnu Abu Sulaiman] dari [Atha`] ia berkata; Ketika Baitullah terbakar pada masa Yazid bin Mu'awiyah tatkala diperangi oleh penduduk Syam, dia perintahkan agar Baitullah dibiarkan apa adanya. [Ibnu Zubair] juga membiarkannya hingga orang-orang datang pada musim haji dengan maksud agar Ibnu Zubair bisa menggerakkan orang-orang itu untuk melawan penduduk Syam. Setelah orang-orang pergi ke Baitullah, Ibnu Zubair berkata, \"Saudara-saudara, berilah aku petunjuk (saran) tentang Ka'bah! Apakah aku harus membongkarnya lalu aku membangun kembali, akau aku perbaiki bagian-baigian yang rusak saja?\" Ibnu Abbas menjawab, \"Aku mempunyai pendapat tentang Ka'bah tersebut. Menurutku, sebaiknya Anda memperbaiki bagian-bagian yang rusak saja dan biarkanlah Baitullah dalam keadaan seperti ketika orang-orang dulu baru mulai memeluk Islam. Biarkan pula batu-batu seperti ketika orang-orang baru mulai memeluk Islam dan seperti ketika Nabi shallallahu 'alaihi wasallam diutus.\" Ibnu Zubair mengingatkan, \"Seandainya salah seorang diantara kalian rumahnya terbakar, tentu ia tidak akan rela sehingga dia membangunnya kembali dengan sebaik-baiknya, padahal ini adalah rumah Rabb kalian. sesungguhnya aku akan beristikharah untuk meminta petunjuk kepada Rabb-ku selama tiga kali, baru kemudian aku akan menetunkan keputusanku.\" Setelah tiga kali istikharah, maka Ibnu Zubair memastikan pendapatnya untuk membongkar Ka'bah. Orang-orang menghindari dari Baitullah, jangan-jangan ada bencana dari atas yang akan menimpa orang yang naik ke Baitullah kali pertama, sehingga ada seorang memanjat lalu menjatuhkan batunya. Setelah orang-orang melihat tidak ada sesuatu yang menimpa pemanjat tersebut, barulah orang-orang berduyun-duyun merobohkannya hingga rata dengan tanah. Kemudian Ibnu Zubair memancangkan beberapa tiang lalu memasang tabir sampai kemudian bangunan tersebut meninggi. Ibnu Zubair berkata; Aku pernah mendengar [Aisyah] berkata bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Seandainya orang-orang tidak baru saja meninggalkan kekufuran dan seandainya aku mempunyai biaya yang cukup untuk membangun Baitullah sekarang ini, maka tentu aku sudah memasukkan hijr dan aku buat satu pintu masuk serta satu pintu keluar.\" Ibnu Zubair berkata, \"Sekarang aku sudah mempunyai biaya dan aku tidak khawatir terhadap keimanan kaum muslimin.\" Atha berkata; Lalu Ibnu Zubair menambah luas Baitullah sebanyak lima hasta di bagian Hijr, kemudian ia menjelaskan posisi pondasi dengan dilihat orang banyak., lalu diantas pondasi itu didirikan bangunan. Panjang Ka'bah semual dua belas hasta tetapi setelah diperluas maka panjangnya tampak pendek, sehingga panjangnya ditambah sepuluh hasta. Lalu dibuat dua pintu, satu pintu masuk, dan satu pintu keluar. Setelah Ibnu Zubair terbunuh, Al Hajjaj mengirim surat kepada Abdul Malik bin Marwan untuk memberitahukan hal itu kepadanya, juga untuk memberitahukan bahwa Ibnu Zubair telah membuat bangunan di pondasi yang telah dilihat oleh kebanyakan penduduk Makkah. Jadi Abdul Malik membalas surat Al Hajjaj; \"Kami sedikit pun tidak mengikuti kesalahan Ibnu Zubair. Tentang penambahan panjang Ka'bah oleh Ibnu Zubair, maka aku tetapkan, adapun penambahan luas Ka'bah di Hijr oleh Ibnu Zubair, maka kembalikanlah seperti keadaan sebelumnya dan tutuplah pintu yang dibuat oleh Ibnu Zubair.\" Lalu Ibnu Hajjaj pun membongkar Ka'bah dan mengembalikannya seperti keadaan semula."
            },
            {
                "number": 2218,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُبَيْدِ بْنِ عُمَيْرٍ وَالْوَلِيدَ بْنَ عَطَاءٍ يُحَدِّثَانِ عَنْ الْحَارِثِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ قَالَ عَبْدُ اللَّهِ بْنُ عُبَيْدٍ وَفَدَ الْحَارِثُ بْنُ عَبْدِ اللَّهِ عَلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ فِي خِلَافَتِهِ فَقَالَ عَبْدُ الْمَلِكِ مَا أَظُنُّ أَبَا خُبَيْبٍ يَعْنِي ابْنَ الزُّبَيْرِ سَمِعَ مِنْ عَائِشَةَ مَا كَانَ يَزْعُمُ أَنَّهُ سَمِعَهُ مِنْهَا قَالَ الْحَارِثُ بَلَى أَنَا سَمِعْتُهُ مِنْهَاقَالَ سَمِعْتَهَا تَقُولُ مَاذَا قَالَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ قَوْمَكِ اسْتَقْصَرُوا مِنْ بُنْيَانِ الْبَيْتِ وَلَوْلَا حَدَاثَةُ عَهْدِهِمْ بِالشِّرْكِ أَعَدْتُ مَا تَرَكُوا مِنْهُ فَإِنْ بَدَا لِقَوْمِكِ مِنْ بَعْدِي أَنْ يَبْنُوهُ فَهَلُمِّي لِأُرِيَكِ مَا تَرَكُوا مِنْهُ فَأَرَاهَا قَرِيبًا مِنْ سَبْعَةِ أَذْرُعٍهَذَا حَدِيثُ عَبْدِ اللَّهِ بْنِ عُبَيْدٍ وَزَادَ عَلَيْهِ الْوَلِيدُ بْنُ عَطَاءٍ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَجَعَلْتُ لَهَا بَابَيْنِ مَوْضُوعَيْنِ فِي الْأَرْضِ شَرْقِيًّا وَغَرْبِيًّا وَهَلْ تَدْرِينَ لِمَ كَانَ قَوْمُكِ رَفَعُوا بَابَهَا قَالَتْ قُلْتُ لَا قَالَ تَعَزُّزًا أَنْ لَا يَدْخُلَهَا إِلَّا مَنْ أَرَادُوا فَكَانَ الرَّجُلُ إِذَا هُوَ أَرَادَ أَنْ يَدْخُلَهَا يَدَعُونَهُ يَرْتَقِي حَتَّى إِذَا كَادَ أَنْ يَدْخُلَ دَفَعُوهُ فَسَقَطَ قَالَ عَبْدُ الْمَلِكِ لِلْحَارِثِ أَنْتَ سَمِعْتَهَا تَقُولُ هَذَا قَالَ نَعَمْ قَالَ فَنَكَتَ سَاعَةً بِعَصَاهُ ثُمَّ قَالَ وَدِدْتُ أَنِّي تَرَكْتُهُ وَمَا تَحَمَّلَ و حَدَّثَنَاه مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ حَدَّثَنَا أَبُو عَاصِمٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ كِلَاهُمَا عَنْ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ ابْنِ بَكْرٍ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] ia berkata, saya mendengar [Abdullah bin Ubaid bin Umair] dan [Al Walid bin Atha`] keduanya menceritakan dari [Al Harits bin Abdullah bin Abu Rabi'ah] -Abdullah bin Ubaid berkata- Al Harits bin Abdullah datang sebagai utusan kepada Abdul Malik bin Marwan pada masa pemerintahannya. Abdul Malik berkata, \"Aku tidak menduga bahwa Abu Khubaib yakni Ibnu Zubair mendengar dari Aisyah, yang ia berdalih bahwa ia mendengarnya dari Aisyah.\" Al Harits berkata, \"Benar, saya juga telah mendengar tentang hal itu dari Aisyah. [Aisyah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya kaummu telah memperkecil bangunan Baitullah. Sekiranya bukan karena mereka baru saja meninggalkan kesyirikan, niscaya saya akan mengembalikan apa yang mereka tinggalkan. Maka jika kaummu akan membangunnya sepeninggalku, maka kemarilah akan kuperlihatkan seberapa panjang yang mereka tinggalkan itu.' Maka aku pun melihatnya, yakni kurang lebih sepanjang tujuh hasta.\" Ini adalah haditsnya Abdullah bin Ubaid. Kemudian Al Walid bin Atha` menambahkan; Nabi shallallahu 'alaihi wasallam bersabda: \"Dan aku benar-benar akan membuatkannya dua pintu yang keduanya sampai ke tanah. Yakni sebelah Timur dan Barat. Tahukah kamu, kenapa kaummu meninggikan pintunya?\" Aisyah berkta; Aku menjawab, \"Tidak.\" Beliau bersabda: \"Yaitu, agar tidak ada yang dapat masuk ke dalamnya kecuali orang-orang tertentu yang mereka izinkan. Jika ada seseorang yang ingin masuk ke dalamnya, mereka membiarkannya memanjat hingga hampir saja akan memasukinya, baru kemudian mereka menghalanginya hingga orang tersebut terjatuh.\" Abdul Malik bertanya kepada Al Harits, \"Apakah kamu mendengar Aisyah mengatakan hal ini?\" Al Harits menjawab, \"Ya.\" Kemudian Abdul Malik pun memukul-mukulkan tongkatnya sesaat lalu berkata, \"Aku lebih suka kalau aku meninggalkannya dan apa yang menjadi bebannya.\" Dan Telah menceritakannya kepada kami [Muhammad bin Amru bin Jablah] Telah menceritakan kepada kami [Abu Ashim] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazzaq] keduanya dari [Ibnu Juraij] dengan isnad ini, yakni sebagaimana hadits Ibnu Bakr."
            },
            {
                "number": 2219,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ السَّهْمِيُّ حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ عَنْ أَبِي قَزَعَةَ أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ بَيْنَمَا هُوَ يَطُوفُ بِالْبَيْتِ إِذْ قَالَ قَاتَلَ اللَّهُ ابْنَ الزُّبَيْرِ حَيْثُ يَكْذِبُ عَلَى أُمِّ الْمُؤْمِنِينَ يَقُولُ سَمِعْتُهَا تَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَائِشَةُ لَوْلَا حِدْثَانُ قَوْمِكِ بِالْكُفْرِ لَنَقَضْتُ الْبَيْتَ حَتَّى أَزِيدَ فِيهِ مِنْ الْحِجْرِ فَإِنَّ قَوْمَكِ قَصَّرُوا فِي الْبِنَاءِفَقَالَ الْحَارِثُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ لَا تَقُلْ هَذَا يَا أَمِيرَ الْمُؤْمِنِينَ فَأَنَا سَمِعْتُ أُمَّ الْمُؤْمِنِينَ تُحَدِّثُ هَذَا قَالَ لَوْ كُنْتُ سَمِعْتُهُ قَبْلَ أَنْ أَهْدِمَهُ لَتَرَكْتُهُ عَلَى مَا بَنَى ابْنُ الزُّبَيْرِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] Telah menceritakan kepada kami [Abdullah bin Bakr As Sahmi] Telah menceritakan kepada kami [Hatim bin Abu Shaghirah] dari [Abu Qaza'ah] bahwasanya; Ketika Abdul Malik bin Marwan thawaf di Baitullah, tiba-tiba dia berkata, \"Semoga Allah mencelakai Ibnu Zubir, karena dia mendustakan Ummul Mukminin.\" Ibnu Zubair berkata; Aku pernah mendengar Aisyah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Aisyah, kalau saja bukan karena kaummu yang baru saja meninggalkan kekufuran, tentu aku sudah membongkar Baitullah sehingga aku tambah luasnya di bagian Hijr, karena kaummu telah mempersempit bangunannya (bila diukur dengan pondasi yang dibuat oleh Nabi Ibrahim.\" [Al Harits bin Abdullah bin Abu Rabi'ah] berkata, \"Jangan berkata begitu wahai [Amirul mukminin], karena aku pernah mendengar Amirul Mukminin telah berkata yang demikian itu.\" Abdul Malik bin Marwan berkata, \"Seandainya aku pernah mendengar hadits tersebut sebelum aku merombak Ka'bah, tentu aku biarkan saja bangunan yang telah diperbaiki oleh Ibnu Zubair.\""
            },
            {
                "number": 2220,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا أَشْعَثُ بْنُ أَبِي الشَّعْثَاءِ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ عَائِشَةَ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَدْرِ أَمِنْ الْبَيْتِ هُوَ قَالَ نَعَمْ قُلْتُ فَلِمَ لَمْ يُدْخِلُوهُ فِي الْبَيْتِ قَالَ إِنَّ قَوْمَكِ قَصَّرَتْ بِهِمْ النَّفَقَةُ قُلْتُ فَمَا شَأْنُ بَابِهِ مُرْتَفِعًا قَالَ فَعَلَ ذَلِكِ قَوْمُكِ لِيُدْخِلُوا مَنْ شَاءُوا وَيَمْنَعُوا مَنْ شَاءُوا وَلَوْلَا أَنَّ قَوْمَكِ حَدِيثٌ عَهْدُهُمْ فِي الْجَاهِلِيَّةِ فَأَخَافُ أَنْ تُنْكِرَ قُلُوبُهُمْ لَنَظَرْتُ أَنْ أُدْخِلَ الْجَدْرَ فِي الْبَيْتِ وَأَنْ أُلْزِقَ بَابَهُ بِالْأَرْضِو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ مُوسَى حَدَّثَنَا شَيْبَانُ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ عَائِشَةَ قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحِجْرِ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ أَبِي الْأَحْوَصِ وَقَالَ فِيهِ فَقُلْتُ فَمَا شَأْنُ بَابِهِ مُرْتَفِعًا لَا يُصْعَدُ إِلَيْهِ إِلَّا بِسُلَّمٍ وَقَالَ مَخَافَةَ أَنْ تَنْفِرَ قُلُوبُهُمْ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] Telah menceritakan kepada kami [Abul Ahwash] Telah menceritakan kepada kami [Asy'ats bin Abu Sya'tsa`] dari [Al Aswad bin Yazid] dari [Aisyah] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai dinding Ka'bah, apakah termasuk Baitullah atau tidak?. Beliau menjawab: \"Ya, termasuk.\" Aku bertanya, \"Kenapa tidak dimasukkan mereka?\" beliau bersabda: \"Kaummu kekurangan dana.\" Aku bertanya lagi, \"Kenapa pintunya tinggi begitu?\" beliau menjawab: \"Itu siasat bangsamu, supaya mereka dapat memasukkan orang yang disukainya dan melarang orang yang tidak disukainya. Kalau bukanlah karena bangsamu yang baru saja meninggalkan masa jahiliyah, yang menyebabkan kekhawatiran hati mereka akan menjadi ingkar, aku telah berpikir akan memasukkan dinding itu ke Baitullah dan membuat pintu sampai ke tanah.\" Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [ubaidhullah bin Musa] Telah menceritakan kepada kami [Syaiban] dari [Asy'ats bin Abu Asy Sya'tsa`] dari [Al Aswad bin Yazid] dari [Aisyah] ia berkata; Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai dinding (Ka'bah). Maka ia pun menuturkan hadits yang semakna dengan hadits Abul Ahwash, dan ia menyebutkan di dalamnya; \"Bagaimana dengan pintunya yang tinggi dan tidak mampu dinaiki kecuali dengan tangga?\" dan ia juga menyebutkan; \"Karena khawatir hati mereka akan liar kembali.\""
            },
            {
                "number": 2221,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّهُ قَالَكَانَ الْفَضْلُ بْنُ عَبَّاسٍ رَدِيفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَتْهُ امْرَأَةٌ مِنْ خَثْعَمَ تَسْتَفْتِيهِ فَجَعَلَ الْفَضْلُ يَنْظُرُ إِلَيْهَا وَتَنْظُرُ إِلَيْهِ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْرِفُ وَجْهَ الْفَضْلِ إِلَى الشِّقِّ الْآخَرِ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَلَى عِبَادِهِ فِي الْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لَا يَسْتَطِيعُ أَنْ يَثْبُتَ عَلَى الرَّاحِلَةِ أَفَأَحُجُّ عَنْهُ قَالَ نَعَمْ وَذَلِكَ فِي حَجَّةِ الْوَدَاعِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Ibnu Syihab] dari [Sulaiman bin Yasar] dari [Abdullah bin Abbas] bahwa ia berkata; Fadl bin Abbas pernah membonceng di belakang Rasulullah shallallahu 'alaihi wasallam, tiba-tiba seorang wanita dari Khats'am meminta fatwa kepada beliau. Fadll menengok kepada perempuan itu dan perempuan itu pun menengok Fadll. Maka Rasulullah shallallahu 'alaihi wasallam memalingkan wajah Fadll ke arah lain. Perempuan itu berkata, \"Wahai Rasulullah! Kewajiban untuk menunaikan haji terpikul atas bapakku yang sudah tua renta. Ia tidak lagi sanggup duduk di atas kendaraan. Bolehkah aku menggantikannya?\" beliau menjawab: \"Boleh.\" Dan hal itu terjadi pada saat haji wada'. "
            },
            {
                "number": 2222,
                "arab": "حَدَّثَنِي عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ شِهَابٍ حَدَّثَنَا سُلَيْمَانُ بْنُ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِأَنَّ امْرَأَةً مِنْ خَثْعَمَ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ عَلَيْهِ فَرِيضَةُ اللَّهِ فِي الْحَجِّ وَهُوَ لَا يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى ظَهْرِ بَعِيرِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحُجِّي عَنْهُ",
                "id": "Telah menceritakan kepadaku [Ali bin Khasyram] telah mengabarkan kepada kami [Isa] dari [Ibnu Juraij] dari [Ibnu Syihab] Telah menceritakan kepada kami [Sulaiman bin Yasar] dari [Ibnu Abbas] dari [Al Fadll] bahwasanya; Seorang wanita dari Khats'am berkata, \"Wahai Rasulullah, sesungguhnya bapakku adalah seorang yang sudah tua renta, ia masih memiliki kewajiban haji, sementara ia tidak mampu lagi menunggang di atas Untaranya.\" Maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Kalau begitu, hajikanlah ia.\""
            },
            {
                "number": 2223,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِيَ رَكْبًا بِالرَّوْحَاءِ فَقَالَ مَنْ الْقَوْمُ قَالُوا الْمُسْلِمُونَ فَقَالُوا مَنْ أَنْتَ قَالَ رَسُولُ اللَّهِ فَرَفَعَتْ إِلَيْهِ امْرَأَةٌ صَبِيًّا فَقَالَتْ أَلِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ibnu Abu Umar] semuanya dari [Ibnu Uyainah] - [Abu Bakr] berkata- Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibrahim bin Uqbah] dari [Kuraib] Maula Ibnu Abbas, dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bertemu dengan serombongan pengendara di Rauha`, lalu beliau bertanya: \"Rombongan siapakah kalian?\" mereka menjawab, \"Kami rombongan kaum muslimin; dan Anda siapa?\" beliau menjawab: \"Aku adalah Rasulullah.\" Tiba-tiba seorang wanita datang kepada beliau dengan menggendong anak kecil, kemudian ia bertanya, \"Wahai Rasulullah, sudah sahkah haji anak ini?\" beliau menjawab: \"Sah, dan kamu juga mendapatkan pahala.\""
            },
            {
                "number": 2224,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ سُفْيَانَ عَنْ مُحَمَّدِ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَرَفَعَتْ امْرَأَةٌ صَبِيًّا لَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ أَلِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala`] Telah menceritakan kepada kami [Abu Usamah] dari [Sufyan] dari [Muhammad bin Uqbah] dari [Kuraib] dari [Ibnu Abbas] ia berkata; Ada seorang wanita yang menggendong anak kecil lalu bertanya, \"Wahai Rasulullah, apakah anak kecil ini juga memiliki keharusan menunaikan haji.\" Beliau menjawab: \"Ya, dan kamu juga mendapatkan pahala.\""
            },
            {
                "number": 2225,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍأَنَّ امْرَأَةً رَفَعَتْ صَبِيًّا فَقَالَتْ يَا رَسُولَ اللَّهِ أَلِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌو حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ بِمِثْلِهِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Abdurrahman] Telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Uqbah] dari [Kuraib] bahwasanya; Ada seorang wanita yang sedang menggendong anaknya dan berkata, \"Apakah bagi anak ini juga memiliki keharusan haji?\" beliau menjawab: \"Ya, dan kamu juga menjadapkan ganjaran pahala.\" Dan Telah menceritakan kepada kami [Ibnul Mutsanna] Telah menceritakan kepada kami [Abdurrahman] Telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Uqbah] dari [Kuraib] dari [Ibnu Abbas] semisalnya."
            },
            {
                "number": 2226,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الرَّبِيعُ بْنُ مُسْلِمٍ الْقُرَشِيُّ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيُّهَا النَّاسُ قَدْ فَرَضَ اللَّهُ عَلَيْكُمْ الْحَجَّ فَحُجُّوا فَقَالَ رَجُلٌ أَكُلَّ عَامٍ يَا رَسُولَ اللَّهِ فَسَكَتَ حَتَّى قَالَهَا ثَلَاثًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ قُلْتُ نَعَمْ لَوَجَبَتْ وَلَمَا اسْتَطَعْتُمْ ثُمَّ قَالَ ذَرُونِي مَا تَرَكْتُكُمْ فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِكَثْرَةِ سُؤَالِهِمْ وَاخْتِلَافِهِمْ عَلَى أَنْبِيَائِهِمْ فَإِذَا أَمَرْتُكُمْ بِشَيْءٍ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ وَإِذَا نَهَيْتُكُمْ عَنْ شَيْءٍ فَدَعُوهُ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Ar Rabi' bin Muslim Al Qarasyi] dari [Muhammad bin Ziyad] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam menyampaikan khutbah kepada kami seraya bersabda: \"Wahai sekalian manusia, Allah telah mewajibkan atas kalian untuk menunaikan ibadah haji. Karena itu, tunaikanlah ibadah haji.\" Kemudian seorang laki-laki bertanya, \"Apakah setiap tahun ya Rasulullah?\" beliau terdiam beberapa saat, hingga laki-laki itu mengulanginya hingga tiga kali. Maka beliau pun bersabda: \"Sekiranya aku menjawab, 'Ya' niscaya akan menjadi kewajiban setiap tahun dan kalian tidak akan sanggup melaksanakannya. Karena itu, biarkanlah apa adanya masalah yang kutinggalkan untuk kalian. Sesungguhnya orang-orang yang sebelum kamu mendapat celaka karena mereka banyak tanya dan suka mendebat para Nabi mereka. karena itu, bila kuperintahkan mengerjakan sesuatu, laksanakanlah sebisa-bisanya, dan apabila kularang kalian mengerjakan sesuatu, maka hentikanlah segera.\""
            },
            {
                "number": 2227,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُسَافِرْ الْمَرْأَةُ ثَلَاثًا إِلَّا وَمَعَهَا ذُو مَحْرَمٍو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي جَمِيعًا عَنْ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ فِي رِوَايَةِ أَبِي بَكْرٍ فَوْقَ ثَلَاثٍ و قَالَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ عَنْ أَبِيهِ ثَلَاثَةً إِلَّا وَمَعَهَا ذُو مَحْرَمٍ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] keduanya berkata, Telah menceritakan kepada kami [Yahya Al Qaththan] dari [ubaidhullah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita tidak boleh bepergian selama tiga hari kecuali disertai mahramnya.\" Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] Telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Usamah] -dalam riwayat lain- Dan Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [bapakku] dari [ubaidhullah] dengan isnad ini. Dan di dalam riwayatnya Abu Bakr tercantum; \"Di atas tiga (hari).\" Dan ia juga berkata di dalam riwayatnya, dari bapaknya; \"Kecuali bila ia bersama mahramnya.\""
            },
            {
                "number": 2228,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ تُسَافِرُ مَسِيرَةَ ثَلَاثِ لَيَالٍ إِلَّا وَمَعَهَا ذُو مَحْرَمٍ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Rafi'] Telah menceritakan kepada kami [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Adl Dlahak] dari [Nafi'] dari [Abdullah bin Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhirat selama tiga hari, kecuali disertai mahramnya.\""
            },
            {
                "number": 2229,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنْ جَرِيرٍ قَالَ قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ عَبْدِ الْمَلِكِ وَهُوَ ابْنُ عُمَيْرٍ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ قَالَسَمِعْتُ مِنْهُ حَدِيثًا فَأَعْجَبَنِي فَقُلْتُ لَهُ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَأَقُولُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَمْ أَسْمَعْ قَالَ سَمِعْتُهُ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَشُدُّوا الرِّحَالَ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ مَسْجِدِي هَذَا وَالْمَسْجِدِ الْحَرَامِ وَالْمَسْجِدِ الْأَقْصَى وَسَمِعْتُهُ يَقُولُ لَا تُسَافِرْ الْمَرْأَةُ يَوْمَيْنِ مِنْ الدَّهْرِ إِلَّا وَمَعَهَا ذُو مَحْرَمٍ مِنْهَا أَوْ زَوْجُهَاو حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَ سَمِعْتُ قَزَعَةَ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعًا فَأَعْجَبْنَنِي وَآنَقْنَنِي نَهَى أَنْ تُسَافِرَ الْمَرْأَةُ مَسِيرَةَ يَوْمَيْنِ إِلَّا وَمَعَهَا زَوْجُهَا أَوْ ذُو مَحْرَمٍ وَاقْتَصَّ بَاقِيَ الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Utsman bin Abu Syaibah] semuanya dari [Jarir] - [Qutaibah] berkata- Telah menceritakan kepada kami [Jarir] dari [Abdullah bin Umair] dari [Qaza'ah] dari [Abu Sa'id] ia berkata; Saya mendengar suatu hadits darinya, lalu aku pun terkagum dan bertanya kepadanya, \"Apakah Anda mendengar hadits ini langsung dari Rasulullah shallallahu 'alaihi wasallam?\" Ia pun menjawab, \"Apakah aku akan mengatakan sesuatu yang belum pernah aku dengar?\" Aku mendengarnya berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian bersusah payah mempersiapkan perjalanan kecuali ke tiga Masjid. Yaitu; Masjidku ini (Masjid Nabawi), Masjidil Haram, dan Masjid Al Aqsha.\" Dan saya juga mendengar beliau bersabda: \"Seorang wanita tidak boleh bersafar selama dua hari, kecuali disertai mahramnya atau pun suaminya.\" Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik bin Umair] ia berkata, saya mendengar [Qaza'ah] ia berkata, saya mendengar [Abu Sa'id Al Khudri] berkata; Saya mendengar dari Rasulullah shallallahu 'alaihi wasallam empat hal, lalu aku pun begitu terkesan. Beliau melarang seorang wanita untuk mengadakan perjalanan selama dua hari, kecuali disertai suaminya atau mahramnya. Dan ia pun mengisahkan hadits itu."
            },
            {
                "number": 2230,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ عَنْ سَهْمِ بْنِ مِنْجَابٍ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُسَافِرْ الْمَرْأَةُ ثَلَاثًا إِلَّا مَعَ ذِي مَحْرَمٍ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] Telah menceritakan kepada kami [Jarir] dari [Mughirah] dari [Ibrahim] dari [Sahm bin Minjab] dari [Qaza'ah] dari [Abu Sa'id Al Khudri] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita tidak boleh bepergian selama tiga hari kecuali bersama mahramnya.\""
            },
            {
                "number": 2231,
                "arab": "و حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ بَشَّارٍ جَمِيعًا عَنْ مُعَاذِ بْنِ هِشَامٍ قَالَ أَبُو غَسَّانَ حَدَّثَنَا مُعَاذٌ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُسَافِرْ امْرَأَةٌ فَوْقَ ثَلَاثِ لَيَالٍ إِلَّا مَعَ ذِي مَحْرَمٍو حَدَّثَنَاه ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ وَقَالَ أَكْثَرَ مِنْ ثَلَاثٍ إِلَّا مَعَ ذِي مَحْرَمٍ",
                "id": "Dan telah menceritakan kepadaku [Abu Ghassan Al Misma'i] dan [Muhammad bin Basysyar] semuanya dari [Mu'adz bin Hisyam] - [Abu Ghassan] berkata- [Muadz] telah menceritakan kepadaku [bapakku] dari [Qatadah] dari [Qaza'ah] dari [Abu Sa'id Al Khudri] bahwa Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita tidak boleh mengadakan perjalanan di atas tiga malam, kecuali disertai mahramnya.\" Dan Telah menceritakannya kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu Adi] dari [Sa'id] dari [Qatadah] dengan isnad ini dan ia menyebutkan; \"Lebih dari tiga hari, kecuali bersama mahramnya.\""
            },
            {
                "number": 2232,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ أَنَّ أَبَا هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ لِامْرَأَةٍ مُسْلِمَةٍ تُسَافِرُ مَسِيرَةَ لَيْلَةٍ إِلَّا وَمَعَهَا رَجُلٌ ذُو حُرْمَةٍ مِنْهَا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Laits] dari [Sa'id bin Abu Sa'id] dari [bapaknya] bahwa [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita muslimah untuk bersafar sejauh sehari perjalanan, kecuali ditemani seorang laki-laki yang dari mahramnya.\""
            },
            {
                "number": 2233,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ أَبِي ذِئْبٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ تُسَافِرُ مَسِيرَةَ يَوْمٍ إِلَّا مَعَ ذِي مَحْرَمٍ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Abu Dzi`b] Telah menceritakan kepada kami [Sa'id bin Abu Sa'id] dari [bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhirat untuk mengadakan perjalanan sejauh sehari perjalanan kecuali disertai mahramnya.\""
            },
            {
                "number": 2234,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ لِامْرَأَةٍ أَنْ تُسَافِرَ ثَلَاثًا إِلَّا وَمَعَهَا ذُو مَحْرَمٍ مِنْهَا",
                "id": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari] Telah menceritakan kepada kami [Bisyr bin Mufadldlal] Telah menceritakan kepada kami [Suhail bin Abu Shalih] dari [bapaknya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita untuk mengadakan perjalanan selama tiga hari kecuali disertai mahramnya.\""
            },
            {
                "number": 2235,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ قَالَ أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُسَافِرَ سَفَرًا يَكُونُ ثَلَاثَةَ أَيَّامٍ فَصَاعِدًا إِلَّا وَمَعَهَا أَبُوهَا أَوْ ابْنُهَا أَوْ زَوْجُهَا أَوْ أَخُوهَا أَوْ ذُو مَحْرَمٍ مِنْهَاو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] semuanya dari [Abu Mu'awiyah] - [Abu Kuraib] berkata- Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Sa'id Al Khudri] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhirat untuk mengadakan perjalanan selama tiga hari atau lebih kecuali ia bersama bapaknya atau anaknya atau suaminya atau saudaranya atau mahramnya yang lain.\" Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Sa'id Al Asyaj] keduanya berkata, Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Al A'masy] dengan isnad ini, semisalnya."
            }
        ]
    }
}