{
    "status": true,
    "data": {
        "start": 1193,
        "end": 1341,
        "total": 149,
        "book": "muslim",
        "hadits": [
            {
                "number": 1193,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ فِيهِ بِعَزِيمَةٍ فَيَقُولُ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِفَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْأَمْرُ عَلَى ذَلِكَ ثُمَّ كَانَ الْأَمْرُ عَلَى ذَلِكَ فِي خِلَافَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلَافَةِ عُمَرَ عَلَى ذَلِكَ",
                "id": "Telah menceritakan kepada kami ['Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memberikan motivasi untuk mengerjakan (sholat pada malam) ramadhan dengan tidak mewajibkannya. Beliau bersabda: \"Barangsiapa yang menunaikan (sholat pada malam) ramadhan dengan penuh keimanan dan mengharap (pahala dari Allah), maka dosa-dosanya yang telah berlalu akan diampuni.\" Kemudian Rasulullah shallallahu 'alaihi wasallam wafat, sementara perkara itu tetap seperti itu. Demikian pula pada kekhilafahan Abu Bakar hingga permulaan kekhilafahan Umar."
            },
            {
                "number": 1194,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ حَدَّثَهُمْأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [bapakku] dari [Yahya bin Abu Katsir] ia berkata, telah menceritakan kepada kami [Abu Salamah bin Abdurrahman] bahwa [Abu Hurairah] telah menceritakan kepada mereka, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa pada bulan ramadhan dengan penuh keimanan dan mengharap (pahala dari Allah), maka dosa-dosanya yang telah lalu akan diampuni. Dan siapa yang menegakkan (sholat pada malam) Lailatul Qadr dengan keimanan dan mengharap (pahala dari Allah), maka dosa-dosanya yang telah lalu akan diampuni.\""
            },
            {
                "number": 1195,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنِي وَرْقَاءُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يَقُمْ لَيْلَةَ الْقَدْرِ فَيُوَافِقُهَا أُرَاهُ قَالَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Syababah] telah menceritakan kepadaku [Warqa`] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang menegakkan (sholat dengan mengharap) malam Lailatul Qadr, lalu ia mendapatinya, -menurutku ia mengatakan- dengan penuh keimanan dan pengharapan (akan pahala dari Allah), maka ia akan diampuni.\""
            },
            {
                "number": 1196,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي الْمَسْجِدِ ذَاتَ لَيْلَةٍ فَصَلَّى بِصَلَاتِهِ نَاسٌ ثُمَّ صَلَّى مِنْ الْقَابِلَةِ فَكَثُرَ النَّاسُ ثُمَّ اجْتَمَعُوا مِنْ اللَّيْلَةِ الثَّالِثَةِ أَوْ الرَّابِعَةِ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَصْبَحَ قَالَ قَدْ رَأَيْتُ الَّذِي صَنَعْتُمْ فَلَمْ يَمْنَعْنِي مِنْ الْخُرُوجِ إِلَيْكُمْ إِلَّا أَنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ قَالَ وَذَلِكَ فِي رَمَضَانَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Ibnu Syihab] dari [Urwah] dari [Aisyah] bahwasanya; Pada suatu malam (di bulan ramadhan), Rasulullah shallallahu 'alaihi wasallam sholat di Masjid, lalu diikuti oleh beberapa orang sahabat. Kemudian (pada malam kedua) beliau sholat lagi, dan ternyata diikuti oleh banyak orang. Dan pada malam ketiga atau keempat mereka berkumpul, namun Rasulullah shallallahu 'alaihi wasallam tidak keluar sholat bersama mereka. Maka setelah pagi, beliau bersabda: \"Sesungguhnya aku tahu apa yang kalian lakukan semalam. Tiada sesuatu pun yang menghalangiku untuk keluar dan sholat bersama kalian, hanya saja aku khawatir (sholat tarawih itu) akan diwajibkan atas kalian.\""
            },
            {
                "number": 1197,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ جَوْفِ اللَّيْلِ فَصَلَّى فِي الْمَسْجِدِ فَصَلَّى رِجَالٌ بِصَلَاتِهِ فَأَصْبَحَ النَّاسُ يَتَحَدَّثُونَ بِذَلِكَ فَاجْتَمَعَ أَكْثَرُ مِنْهُمْ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي اللَّيْلَةِ الثَّانِيَةِ فَصَلَّوْا بِصَلَاتِهِ فَأَصْبَحَ النَّاسُ يَذْكُرُونَ ذَلِكَ فَكَثُرَ أَهْلُ الْمَسْجِدِ مِنْ اللَّيْلَةِ الثَّالِثَةِ فَخَرَجَ فَصَلَّوْا بِصَلَاتِهِ فَلَمَّا كَانَتْ اللَّيْلَةُ الرَّابِعَةُ عَجَزَ الْمَسْجِدُ عَنْ أَهْلِهِ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَفِقَ رِجَالٌ مِنْهُمْ يَقُولُونَ الصَّلَاةَ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى خَرَجَ لِصَلَاةِ الْفَجْرِ فَلَمَّا قَضَى الْفَجْرَ أَقْبَلَ عَلَى النَّاسِ ثُمَّ تَشَهَّدَ فَقَالَ أَمَّا بَعْدُ فَإِنَّهُ لَمْ يَخْفَ عَلَيَّ شَأْنُكُمْ اللَّيْلَةَ وَلَكِنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ صَلَاةُ اللَّيْلِ فَتَعْجِزُوا عَنْهَا",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] ia berkata, telah mengabarkan kepadaku [Urwah bin Zubair] bahwa [Aisyah] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam pernah keluar di tengah malam lalu beliau sholat di Masjid dan diikuti oleh beberapa orang, akhirnya mereka saling menceritakan tentang hal tersebut sehingga orang yang sholat bersama beliau semakin banyak. Pada malam ke dua, Rasulullah shallallahu 'alaihi wasallam keluar menunaikan sholat dan orang-orang pun sholat bersama beliau, kemudian mereka pun menyebut-nyebut kejadian itu sehingga pada malam ketiga jama'ah masjid semakin banyak dan mereka pun sholat bersama beliau. Pada malam ke empat masjid penuh sesak dan tidak dapat menampung jama'ahnya, tetapi Rasulullah shallallahu 'alaihi wasallam tidak keluar hingga beliau menunaikan sholat Fajar. Usai menunaikan sholat Fajar, beliau menghadap jama'ah, membaca syahadat kemudian bersabda: \"Amma ba'd, sesungguhnya tidak ada kekhawatiran yang menimpaku terkait dengan keadaan kalian semalam, akan tetapi saya hanya khawatir (sholat malam itu) akan diwajibkan atas kalian, sehingga kalian tidak sanggup melaksanakannya.\""
            },
            {
                "number": 1198,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي عَبْدَةُ عَنْ زِرٍّ قَالَ سَمِعْتُ أُبَيَّ بْنَ كَعْبٍ يَقُولُا وَقِيلَ لَهُ إِنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ يَقُولُا مَنْ قَامَ السَّنَةَ أَصَابَ لَيْلَةَ الْقَدْرِ فَقَالَ أُبَيٌّ وَاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ إِنَّهَا لَفِي رَمَضَانَ يَحْلِفُ مَا يَسْتَثْنِي وَ وَاللَّهِ إِنِّي لَأَعْلَمُ أَيُّ لَيْلَةٍ هِيَهِيَ اللَّيْلَةُ الَّتِي أَمَرَنَا بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِيَامِهَا هِيَ لَيْلَةُ صَبِيحَةِ سَبْعٍ وَعِشْرِينَ وَأَمَارَتُهَا أَنْ تَطْلُعَ الشَّمْسُ فِي صَبِيحَةِ يَوْمِهَا بَيْضَاءَ لَا شُعَاعَ لَهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mihran Ar Razi] telah menceritakan kepada kami [Al Walid bin Muslim] Telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepadaku [Abdah] dari [Zirr] ia berkata, saya mendengar [Ubay bin Ka'ab] berkata, dan telah dikatakan kepadanya bahwa Abdullah bin Mas'ud berkata, \"Siapa yang melakukan sholat malam sepanjang tahun, niscaya ia akan menemui malam Lailatul Qadr.\" Ubay berkata, \"Demi Allah yang tidak ada ilah yang berhak disembah selain Allah, sesungguhnya malam itu terdapat dalam bulan ramadhan. Dan demi Allah, sesungguhnya aku tahu malam apakah itu. Lailatul Qadr itu adalah malam, dimana Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menegakkan sholat di dalamnya, malam itu adalah malam yang cerah yaitu malam ke dua puluh tujuh (dari bulan ramadhan). Dan tanda-tandanya ialah, pada pagi harinya matahari terbit berwarna putih tanpa sinar yang menyorot.\""
            },
            {
                "number": 1199,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَبْدَةَ بْنَ أَبِي لُبَابَةَ يُحَدِّثُ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَقَالَ أُبَيٌّ فِي لَيْلَةِ الْقَدْرِ وَاللَّهِ إِنِّي لَأَعْلَمُهَا وَأَكْثَرُ عِلْمِي هِيَ اللَّيْلَةُ الَّتِي أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِيَامِهَا هِيَ لَيْلَةُ سَبْعٍ وَعِشْرِينَوَإِنَّمَا شَكَّ شُعْبَةُ فِي هَذَا الْحَرْفِ هِيَ اللَّيْلَةُ الَّتِي أَمَرَنَا بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَحَدَّثَنِي بِهَا صَاحِبٌ لِي عَنْهُ و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَلَمْ يَذْكُرْ إِنَّمَا شَكَّ شُعْبَةُ وَمَا بَعْدَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Abdah bin Abu Lubabah] menceritakan dari [Zirr bin Hubaisy] dari [Ubay bin Ka'ab] ia berkata; Ubay berkata mengenai Lailatul Qadr, \"Demi Allah, saya benar-benar mengetahuinya. Sejauh ilmu yang saya ketahui, lailatul Qadar adalah malam yang Rasulullah shallallahu 'alaihi wasallam telah memerintahkan kami untuk menegakkan (sholat di dalamnya), tepatnya adalah malam ke dua puluh tujuh.\" Syu'bah hanya ragu terkait dengan kalimat ini, \"Ia adalah malam yang Rasulullah shallallahu 'alaihi wasallam telah memerintahkan kami.\" Ia berkata, dan telah menceritakannya kepadaku darinya. Dan telah menceritakan kepadaku [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Syu'bah] dengan isnad ini, hadits semisalnya. Namun ia tidak menyebutkan; \"Syu'bah hanya ragu terkait.\" dan selanjutnya."
            },
            {
                "number": 1200,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُأَنَّهُ بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ أُمِّ الْمُؤْمِنِينَ وَهِيَ خَالَتُهُ قَالَ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ وَاضْطَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ فِي طُولِهَا فَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ اسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ ثُمَّ قَرَأَ الْعَشْرَ الْآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا فَأَحْسَنَ وُضُوءَهُ ثُمَّ قَامَ فَصَلَّى قَالَ ابْنُ عَبَّاسٍ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا فَصَلَّى رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ أَوْتَرَ ثُمَّ اضْطَجَعَ حَتَّى جَاءَ الْمُؤَذِّنُ فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَو حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ الْفِهْرِيِّ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ بِهَذَا الْإِسْنَادِ وَزَادَ ثُمَّ عَمَدَ إِلَى شَجْبٍ مِنْ مَاءٍ فَتَسَوَّكَ وَتَوَضَّأَ وَأَسْبَغَ الْوُضُوءَ وَلَمْ يُهْرِقْ مِنْ الْمَاءِ إِلَّا قَلِيلًا ثُمَّ حَرَّكَنِي فَقُمْتُ وَسَائِرُ الْحَدِيثِ نَحْوُ حَدِيثِ مَالِكٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata: Aku telah membacakan kepada [Malik] dari [Makhramah bin Sulaiman] dari [Kuraib] Maula Ibnu Abbas, bahwa [Ibnu Abbas] telah mengabarkan kepadanya bahwasanya; Pada suatu malam dia tidur di rumah bibinya, Maimunah, Ummul Mukminin. Dia tidur melintang kasur, sedangkan Rasulullah shallallahu 'alaihi wasallam dan isterinya memanjang kasur. Beliau tidur hingga lebih kurang sampai pertengan malam. Setelah itu, beliau bangun sambil menyapu kantuk dari mukanya. Kemudian beliau membaca sepuluh ayat penghabisan dari surat Ali Imran. Sesudah itu, beliau pergi ke tempat air, lalu beliau berwudlu dengan menyempurnakan wudlunya, dan sesudah itu beliau sholat. Ibnu Abbas berkata, \"Aku pun bangun kemudian melakukan sebagaimana yang dilakukan oleh Nabi shallallahu 'alaihi wasallam. Kemudian aku berdiri di samping kiri beliau. Tetapi beliau memegang kepalaku dengan tangannya dan memindahkanku ke sebelah kanannya. Mula-mula beliau sholat dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian dua raka'at dan kemudian witir satu raka'at. Sesudah itu, beliau berbaring hingga terdengar muadzin mengumandangkan adzan Shubuh. Rasulullah shallallahu 'alaihi wasallam bangun, lalu sholat ringkas dua raka'at, sesudah itu beliau pergi ke (masjid) untuk mengerjakan sholat Shubuh.\" Dan telah menceritakan kepadaku [Muhammad bin Salamah Al Muradi] telah menceritakan kepada kami [Abdullah bin Wahb] dari [Iyadl bin Abdullah Al Fihri] dari [Makhramah bin Sulaiman] dengan isnad ini. dan ia menambahkan; \"Kemudian beliau pergi ke tempat air, bersiwak dan berwudlu dengan menyempurnakan wudlunya. Dan beliau tidaklah menggunakan air kecuali hanya sedikit. Sesudah itu, beliau menggerakkanku, hingga aku pun bangun.\" Semua hadits (tentang ini) menyerupai haditsnya Malik."
            },
            {
                "number": 1201,
                "arab": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا عَمْرٌو عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَنِمْتُ عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَهَا تِلْكَ اللَّيْلَةَ فَتَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَامَ فَصَلَّى فَقُمْتُ عَنْ يَسَارِهِ فَأَخَذَنِي فَجَعَلَنِي عَنْ يَمِينِهِ فَصَلَّى فِي تِلْكَ اللَّيْلَةِ ثَلَاثَ عَشْرَةَ رَكْعَةً ثُمَّ نَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى نَفَخَ وَكَانَ إِذَا نَامَ نَفَخَ ثُمَّ أَتَاهُ الْمُؤَذِّنُ فَخَرَجَ فَصَلَّى وَلَمْ يَتَوَضَّأْقَالَ عَمْرٌو فَحَدَّثْتُ بِهِ بُكَيْرَ بْنَ الْأَشَجِّ فَقَالَ حَدَّثَنِي كُرَيْبٌ بِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahb] Telah menceritakan kepada kami [Amru] dari [Abdu Rabbih bin Sa'id] dari [Makhramah bin Sulaiman] dari [Kuraib] Maula Ibnu Abbas, dari [Ibnu Abbas] bahwa ia berkata; \"Saya pernah menginap di rumah Maimunah, isteri Nabi shallallahu 'alaihi wasallam, sementara pada malam itu Rasulullah shallallahu 'alaihi wasallam bermalam di rumahnya. Kemudian Rasulullah shallallahu 'alaihi wasallam berwudlu lalu berdiri dan sholat. Maka saya pun berdiri (sholat) di samping kirinya, lalu beliau memegangku dan meletakkanku di sebelah kanannya. Pada malam itu, beliau sholat sebanyak tiga belas raka'at. Sesudah itu, Rasulullah shallallahu 'alaihi wasallam tidur hingga beliau mendengkur. Memang, jika tidur beliau mendengkur. Kemudian seorang muadzin pun mendatangi beliau (untuk mengumandangkan adzan), hingga beliau keluar dan menunaikan sholat dengan tidak berwudlu lagi.\" [Amru] berkata; Saya menceritakannya kepada [Bukair bin Al Asyaj], ia berkata, telah menceritakan kepadaku [Kuraib] dengan hadits itu."
            },
            {
                "number": 1202,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ قَالَبِتُّ لَيْلَةً عِنْدَ خَالَتِي مَيْمُونَةَ بِنْتِ الْحَارِثِ فَقُلْتُ لَهَا إِذَا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَيْقِظِينِي فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُمْتُ إِلَى جَنْبِهِ الْأَيْسَرِ فَأَخَذَ بِيَدِي فَجَعَلَنِي مِنْ شِقِّهِ الْأَيْمَنِ فَجَعَلْتُ إِذَا أَغْفَيْتُ يَأْخُذُ بِشَحْمَةِ أُذُنِي قَالَ فَصَلَّى إِحْدَى عَشْرَةَ رَكْعَةً ثُمَّ احْتَبَى حَتَّى إِنِّي لَأَسْمَعُ نَفَسَهُ رَاقِدًا فَلَمَّا تَبَيَّنَ لَهُ الْفَجْرُ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Rafi'] Telah menceritakan kepada kami [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Adl Dlahak] dari [Makhramah bin Sulaiman] dari [Kuraib] Maula Ibnu Abbas, dari [Ibnu Abbas] ia berkata; \"Pada suatu malam saya nginap di rumah bibiku Maimunah binti Al Harits. Saya berkata kepadanya, 'Jika Rasulullah shallallahu 'alaihi wasallam bangun (malam), maka bangunkanlah aku.' Kemudian Rasulullah shallallahu 'alaihi wasallam bangun (menunaikan sholat malam), dan aku pun ikut bangun dan sholat di sisi kirinya. Namun beliau memegang tanganku dan memindahkanku ke sebelah kanannya. Jika kantuk menyerangku, beliau memegang cuping telingaku. (pada malam itu) beliau sholat sebanyak sebelas raka'at. Sesudah itu beliau berbaring hingga saya mendengar hembusan nafasnya saat beliau tidur. Ketika waktu Fajar tiba, beliau mengerjakan sholat dua raka'at ringan."
            },
            {
                "number": 1203,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَبِتُّ فِي بَيْتِ خَالَتِي مَيْمُونَةَ فَبَقَيْتُ كَيْفَ يُصَلِّي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَامَ فَبَالَ ثُمَّ غَسَلَ وَجْهَهُ وَكَفَّيْهِ ثُمَّ نَامَ ثُمَّ قَامَ إِلَى الْقِرْبَةِ فَأَطْلَقَ شِنَاقَهَا ثُمَّ صَبَّ فِي الْجَفْنَةِ أَوْ الْقَصْعَةِ فَأَكَبَّهُ بِيَدِهِ عَلَيْهَا ثُمَّ تَوَضَّأَ وُضُوءًا حَسَنًا بَيْنَ الْوُضُوءَيْنِ ثُمَّ قَامَ يُصَلِّي فَجِئْتُ فَقُمْتُ إِلَى جَنْبِهِ فَقُمْتُ عَنْ يَسَارِهِ قَالَ فَأَخَذَنِي فَأَقَامَنِي عَنْ يَمِينِهِ فَتَكَامَلَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَ عَشْرَةَ رَكْعَةً ثُمَّ نَامَ حَتَّى نَفَخَ وَكُنَّا نَعْرِفُهُ إِذَا نَامَ بِنَفْخِهِ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ فَصَلَّى فَجَعَلَ يَقُولُ فِي صَلَاتِهِ أَوْ فِي سُجُودِهِ اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَفِي سَمْعِي نُورًا وَفِي بَصَرِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ شِمَالِي نُورًا وَأَمَامِي نُورًا وَخَلْفِي نُورًا وَفَوْقِي نُورًا وَتَحْتِي نُورًا وَاجْعَلْ لِي نُورًا أَوْ قَالَ وَاجْعَلْنِي نُورًاو حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ أَخْبَرَنَا شُعْبَةُ حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ عَنْ بُكَيْرٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سَلَمَةُ فَلَقِيتُ كُرَيْبًا فَقَالَ قَالَ ابْنُ عَبَّاسٍ كُنْتُ عِنْدَ خَالَتِي مَيْمُونَةَ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ غُنْدَرٍ وَقَالَ وَاجْعَلْنِي نُورًا وَلَمْ يَشُكَّ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي رِشْدِينٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ وَاقْتَصَّ الْحَدِيثَ وَلَمْ يَذْكُرْ غَسْلَ الْوَجْهِ وَالْكَفَّيْنِ غَيْرَ أَنَّهُ قَالَ ثُمَّ أَتَى الْقِرْبَةَ فَحَلَّ شِنَاقَهَا فَتَوَضَّأَ وُضُوءًا بَيْنَ الْوُضُوءَيْنِ ثُمَّ أَتَى فِرَاشَهُ فَنَامَ ثُمَّ قَامَ قَوْمَةً أُخْرَى فَأَتَى الْقِرْبَةَ فَحَلَّ شِنَاقَهَا ثُمَّ تَوَضَّأَ وُضُوءًا هُوَ الْوُضُوءُ وَقَالَ أَعْظِمْ لِي نُورًا وَلَمْ يَذْكُرْ وَاجْعَلْنِي نُورًا و حَدَّثَنِي أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَلْمَانَ الْحَجْرِيِّ عَنْ عُقَيْلِ بْنِ خَالِدٍ أَنَّ سَلَمَةَ بْنَ كُهَيْلٍ حَدَّثَهُ أَنَّ كُرَيْبًا حَدَّثَهُ أَنَّ ابْنَ عَبَّاسٍ بَاتَ لَيْلَةً عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْقِرْبَةِ فَسَكَبَ مِنْهَا فَتَوَضَّأَ وَلَمْ يُكْثِرْ مِنْ الْمَاءِ وَلَمْ يُقَصِّرْ فِي الْوُضُوءِ وَسَاقَ الْحَدِيثَ وَفِيهِ قَالَ وَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَتَئِذٍ تِسْعَ عَشْرَةَ كَلِمَةً قَالَ سَلَمَةُ حَدَّثَنِيهَا كُرَيْبٌ فَحَفِظْتُ مِنْهَا ثِنْتَيْ عَشْرَةَ وَنَسِيتُ مَا بَقِيَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ اجْعَلْ لِي فِي قَلْبِي نُورًا وَفِي لِسَانِي نُورًا وَفِي سَمْعِي نُورًا وَفِي بَصَرِي نُورًا وَمِنْ فَوْقِي نُورًا وَمِنْ تَحْتِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ شِمَالِي نُورًا وَمِنْ بَيْنِ يَدَيَّ نُورًا وَمِنْ خَلْفِي نُورًا وَاجْعَلْ فِي نَفْسِي نُورًا وَأَعْظِمْ لِي نُورًا و حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَقَ أَخْبَرَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ أَخْبَرَنِي شَرِيكُ بْنُ أَبِي نَمِرٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَ رَقَدْتُ فِي بَيْتِ مَيْمُونَةَ لَيْلَةَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَهَا لِأَنْظُرَ كَيْفَ صَلَاةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ قَالَ فَتَحَدَّثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ أَهْلِهِ سَاعَةً ثُمَّ رَقَدَ وَسَاقَ الْحَدِيثَ وَفِيهِ ثُمَّ قَامَ فَتَوَضَّأَ وَاسْتَنَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad] yaitu anak Ja'far, telah menceritakan kepada kami [Syu'bah] dari [Salamah] dari [Kuraib] dari [Ibnu Abbas] ia berkata; \"Saya bermalan di rumah bibiku, Maimunah. Maka saya pun ingin melihat bagaimana Rasulullah shallallahu 'alaihi wasallam menunaikan sholat malam. (Maka pada malam itu) beliau bangun dan kencing. Kemudian beliau membasuh wajahnya, kedua tangannya dan tidur kembali. Kemudian beliau bangun dan langsung beranjak menuju qirbah (tempat air). Beliau membuka tutupnya dan menuangkannya ke dalam mangkuk kecil. Kemudian beliau menciduk dengan tangannya dan berwudlu dengan menyempurnakan wudlunya. Setelah itu beliau sholat, dan saya pun ikut sholat bersama beliau dengan berdiri di sebelah kirinya. Namun beliau memegang dan memindahkanku ke sebelah kanannya. (Pada malam itu) sholat Rasulullah shallallahu 'alaihi wasallam sempurna tiga belas raka'at. Sesudah itu beliau tidur hingga mendengku. Dan kami tahu jika tidur beliau mendengkur. Setelah itu, beliau keluar untuk menunaikan sholat Subuh. Kemudian beliau membaca di dalam sholat atau di dalam sujudnya: \"ALLAHUMMAJ'AL FII QALBII NUURAN WA FII SAM'II NUURAN WA FII BASHARII NUURAN WA 'AN YAMIINII NUURAN WA 'AN SYIMAALII NUURAN WA AMAAMII NUURAN WA KHALFII NUURAN WA FAUQII NUURAN WA TAHTII NUURAN WAJ'AL LII NUURAN -atau beliau mengatakan- WAJ'ALNII NUURAN (Ya Allah, berilah cahaya pada hatiku, cahaya dalam pendengaranku, cahaya dalam penglihatanku, cahaya dari sebelah kananku, cahaya dari sebelah kiriku, cahaya dari depanku, cahaya dari belakangku, cahanya dari atasku, cahaya dari bawahku, dan berilah aku cahaya).\" Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah menceritakan kepada kami [An Nadlru bin Syumail] telah mengabarkan kepada kami [Syu'bah] Telah menceritakan kepada kami [Salamah bin Kuhail] dari [Bukair] dari [Kuraib] dari [Ibnu Abbas]. [Salamah berkata]; Saya menjumpai [Kuraib] maka ia pun berkata, [Ibnu Abbas] berkata; Saya berada di rumah bibiku, Maimunah kemudian datanglah Rasulullah shallallahu 'alaihi wasallam. Kemudian ia pun menyebutkan hadits serupa dengan hadits Ghundar, dan ia mengatakan; \"WAJ'ALNII NUURAN (Dan berilah aku cahaya).\" Tanpa keraguan. Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Hannad bin As Sariya] keduanya berkata, Telah menceritakan kepada kami [Abu Ahwash] dari [Sa'id bin Masruq] dari [Salamah bin Kuhail] dari [Abu Risydin] Maula Ibnu Abbas, dari [Ibnu Abbas] ia berkata; Saya bermalam di rumah bibiku, Maimunah. Ia pun mengkisahkan hadits, namun ia tidak menyebutkan Ghaslul Wajh wal Kaffain (membasuh wajah dan kedua telapak tangan). Hanya saja ia mengatakan; \"Kemudian beliau mendatangi qirbah dan membuka tutupnya, lalu beliau berwudlu di antara dua wudlu, kemudian beliau beranjak ke tempat tidurnya dan tidur. Setelah itu, beliau bangun kembali, lalu beranjak menuju qirbah (tempat air) lalu membuka tutupnya, kemudian berwudlu.\" Kemudian beliau membaca: \"A'ZHIM LII NUURA (Ya Allah, perbesarlah cahaya untukku).\" Dan ia tidak mengatakan; \"WAJ'AlNII NUURA.\" Dan telah menceritakan kepadaku [Abu Thahir] Telah menceritakan kepada kami [Ibnu Wahb] dari [Abdurrahman bin Salman Al Hajri] dari [Uqail bin Khalid] bahwa [Salamah bin Kuhail] telah menceritakan kepadanya bahwa [Kuraib] telah menceritakan kepadanya bahwa [Ibnu Abbas] pernah bermalam bersama Rasulullah shallallahu 'alaihi wasallam, ia berkata; Rasulullah shallallahu 'alaihi wasallam beranjak menuju qirbah (tempat air), menuangkan air darinya dan berwudlu dengan tidak banyak menggunakan air, namun beliau juga tidak mengurangi wudlunya. Ia pun menyebutkan hadits. Kemudian di dalam hadits itu ia mengatakan; Pada malam itu, Rasulullah shallallahu 'alaihi wasallam berdo'a dengan sembilan belas kata. Salamah berkata, telah menceritakannya kepadaku Kuraib, dan saya menghafal darinya dua belas kata dan sisanya lupa. Rasulullah shallallahu 'alaihi wasallam berdo'a: \"ALLAHUMMAJ'AL LII FI QALBII NUURAN WA FII LISAANII NUURAN, WA FII SAM'II NUURAN WA FII BASHARI NUURAN WA MIN FAUQII NUURAN WA MIN TAHTII NUURAN WA 'AN YAMIINII NUURAN WA 'AN SYIMAALII NUURAN WA MIN BAINI YADAYYA NUURAN WA MIN KHALFII NUURAN WAJ'AL FII NAFSII NUURAN WA A'ZHIM LII NUURAAN (Ya Allah jadikanlah cahaya di dalam hatiku, cahaya di dalam lisanku, cahaya dalam pendengaranku, cahaya dalam penglihatanku, cahaya dari atasku, cahaya dari bawahku, cahaya dari arah kananku, cahaya dari sebelah kiriku, cahaya dari arah depanku, cahaya dari belakangku, dan berilah cahaya di dalam jiwaku dan perbesarlah cahaya untukku).\" Dan telah menceritakan kepadaku [Abu Bakr bin Ishaq] telah mengabarkan kepada kami [Ibnu Abu Maryam] telah mengabarkan kepada kami [Muhammad bin Ja'far] telah mengabarkan kepadaku [Syarik bin Abu Namir] dari [Kuraib] dari [Ibnu Abbas] bahwa ia berkata; \"Saya bermalam di rumah Maimunah, yang saat itu Nabi shallallahu 'alaihi wasallam berada di rumahnya. Demikian itu, agar saya dapat melihat bagaimana sholat malam Rasulullah shallallahu 'alaihi wasallam. Nabi shallallahu 'alaihi wasallam berbincang-bincang bersama isterinya sejenak, kemudian beliau tidur.\" Ia pun menuturkan hadits. Dan di dalamnya ia mengatakan; \"Kemudian beliau bangun lalu berwudlu dan bersiwak.\""
            },
            {
                "number": 1204,
                "arab": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّهُ رَقَدَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَيْقَظَ فَتَسَوَّكَ وَتَوَضَّأَ وَهُوَ يَقُولُ{ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِأُولِي الْأَلْبَابِ }فَقَرَأَ هَؤُلَاءِ الْآيَاتِ حَتَّى خَتَمَ السُّورَةَ ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ فَأَطَالَ فِيهِمَا الْقِيَامَ وَالرُّكُوعَ وَالسُّجُودَ ثُمَّ انْصَرَفَ فَنَامَ حَتَّى نَفَخَ ثُمَّ فَعَلَ ذَلِكَ ثَلَاثَ مَرَّاتٍ سِتَّ رَكَعَاتٍ كُلَّ ذَلِكَ يَسْتَاكُ وَيَتَوَضَّأُ وَيَقْرَأُ هَؤُلَاءِ الْآيَاتِ ثُمَّ أَوْتَرَ بِثَلَاثٍ فَأَذَّنَ الْمُؤَذِّنُ فَخَرَجَ إِلَى الصَّلَاةِ وَهُوَ يَقُولُ اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَفِي لِسَانِي نُورًا وَاجْعَلْ فِي سَمْعِي نُورًا وَاجْعَلْ فِي بَصَرِي نُورًا وَاجْعَلْ مِنْ خَلْفِي نُورًا وَمِنْ أَمَامِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَمِنْ تَحْتِي نُورًا اللَّهُمَّ أَعْطِنِي نُورًا",
                "id": "Telah menceritakan kepada kami [Washil bin Abdul A'la] Telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Hushain bin Abdurrahman] dari [Habib bin Abu Tsabit] dari [Muhammad bin Abu 'Ali bin Abdullah bin Abbas] dari [bapaknya] dari [Abdullah bin Abbas] bahwa ia pernah bermalam di sisi Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau bangun dan langsung bersiwak kemudian berwudlu. Lalu beliau membaca: \"Sesungguhnya dalam penciptaan langit dan bumi, dan silih bergantinya malam dan siang terdapat tanda-tanda bagi orang-orang yang berakal.\" Beliau membaca ayat itu hingga selesai satu surat (Ali Imran). Kemudian beliau sholat dua raka'at dengan memanjangkannya berdirinya, ruku', dan sujudnya. Sesudah itu beliau tidur hingga terdengar hembusan nafasnya. Beliau melakukan hal itu hingga tiga kali yakni enam raka'at, dan setiap kalinya beliau mesti bersiwak dan berwudlu dan membaca ayat tadi, kemudian beliau sholat witir dengan tiga raka'at. Hingga sang muadzin mengumandangkan adzan. Maka beliau pun keluar untuk menunaikan sholat Shubuh seraya berdo'a: \"ALLAHUMMAJ 'AL FII QALBII NUURAN WA FII LISAANII NUURAN WAJ'AL FII SAM'I NUURAN WAJ'AL FII BASHARII NUURAN WAJ'AL MIN KHALFII NUURAN, WA MIN AMAAMII NUURAN, WAJ'AL MIN FAUQII NUURAN, WA MIN TAHTI NUURAAN, ALLAHUMMA'THINII NUURAN (Ya Allah berilah cahaya dalam hatiku, cahaya di lisanku, berilah cahaya dalam pendengaranku, berilah cahaya dalam penglihatanku, berilah aku cahaya dari belakangku, dari arah depanku, dan berikanlah cahaya dari atasku, dan arah bawahku. Ya Allah berilah aku cahaya).\""
            },
            {
                "number": 1205,
                "arab": "و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ وَمُحَمَّدُ بْنُ رَافِعٍ قَالَا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ أَخْبَرَنِي أَبِي قَالَ سَمِعْتُ قَيْسَ بْنَ سَعْدٍ يُحَدِّثُ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَبَعَثَنِي الْعَبَّاسُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِ خَالَتِي مَيْمُونَةَ فَبِتُّ مَعَهُ تِلْكَ اللَّيْلَةَ فَقَامَ يُصَلِّي مِنْ اللَّيْلِ فَقُمْتُ عَنْ يَسَارِهِ فَتَنَاوَلَنِي مِنْ خَلْفِ ظَهْرِهِ فَجَعَلَنِي عَلَى يَمِينِهِو حَدَّثَنِي ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ نَحْوَ حَدِيثِ ابْنِ جُرَيْجٍ وَقَيْسِ بْنِ سَعْدٍ",
                "id": "Dan telah menceritakan kepadaku [Harun bin Abdullah] dan [Muhammad bin Rafi'] keduanya berkata, telah menceritakan kepada kami [Wahb bin Jarir] telah mengabarkan kepadaku [bapakku] ia berkata, saya mendengar [Qais bin Sa'd] ia menceritakan dari ['Atha`] dari [Ibnu Abbas] ia berkata; \"Al Abbas mengutusku menemui Nabi shallallahu 'alaihi wasallam, sementara beliau berada di rumah bibiku Maimunah. Maka pada malam itu aku menginap bersama beliau. Kemudian beliau bangun dan menunaikan sholat malam. Lalu saya ikut sholat di sebelah kiri beliau, namun beliau memindahkanku dari arah belakangnya dan menempatkanku di samping kanannya.\" Dan telah menceritakan kepadaku [Ibnu Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Abdul Malik] dari [Atha`] dari [Ibnu Abbas] ia berkata; Saya bermalan di rumah bibiku, Maimunah. Yakni sebagaimana hadits Ibnu Juraij dan Qais bin Sa'd."
            },
            {
                "number": 1206,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي جَمْرَةَ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُاكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] -kemudian dalam jalur periwatan lain- Dan telah menceritakan kepada kami [Ibnul Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Jamrah] ia berkata, saya mendengar [Ibnu Abbas] berkata; \"Biasanya Rasulullah shallallahu 'alaihi wasallam sholat malam sebanyak tiga belas raka'at.\""
            },
            {
                "number": 1207,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَنَّهُ قَالَلَأَرْمُقَنَّ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّيْلَةَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ أَوْتَرَ فَذَلِكَ ثَلَاثَ عَشْرَةَ رَكْعَةً",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari [Abdullah bin Abu Bakr] dari [bapaknya] bahwa [Abdullah bin Qais bin Makhramah] telah mengabarkan kepadanya dari [Zaid bin Khalid Al Juhani] bahwa ia berkata; Saya benar-benar akan memperhatikan sholat Rasulullah shallallahu 'alaihi wasallam pada malam ini. (Maka saya melihat) beliau sholat dua raka'at ringan. Kemudian beliau sholat dua raka'at yang sangat panjang. Kemudian beliau sholat dua raka'at lagi selain dua raka'at sebelumnya. Kemudian beliau sholat dua raka'at lagi selain dua raka'at sebelumnya. Kemudian beliau sholat lagi selain dua raka'at sebelumnya. Kemudian beliau sholat dua raka'at lagi selain dua raka'at sebelumnya. Dan sesudah itu beliau sholat witir, hingga bilangan semua raka'atnya adalah tiga belas raka'at."
            },
            {
                "number": 1208,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِي الزُّبَيْرِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ إِذَا قَامَ إِلَى الصَّلَاةِ مِنْ جَوْفِ اللَّيْلِ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالْأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ أَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَقَوْلُكَ الْحَقُّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَأَخَّرْتُ وَأَسْرَرْتُ وَأَعْلَنْتُ أَنْتَ إِلَهِي لَا إِلَهَ إِلَّا أَنْتَحَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ نُمَيْرٍ وَابْنُ أَبِي عُمَرَ قَالُوا حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ كِلَاهُمَا عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا حَدِيثُ ابْنِ جُرَيْجٍ فَاتَّفَقَ لَفْظُهُ مَعَ حَدِيثِ مَالِكٍ لَمْ يَخْتَلِفَا إِلَّا فِي حَرْفَيْنِ قَالَ ابْنُ جُرَيْجٍ مَكَانَ قَيَّامُ قَيِّمُ وَقَالَ وَمَا أَسْرَرْتُ وَأَمَّا حَدِيثُ ابْنِ عُيَيْنَةَ فَفِيهِ بَعْضُ زِيَادَةٍ وَيُخَالِفُ مَالِكًا وَابْنَ جُرَيْجٍ فِي أَحْرُفٍ و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا مَهْدِيٌّ وَهُوَ ابْنُ مَيْمُونٍ حَدَّثَنَا عِمْرَانُ الْقَصِيرُ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ وَاللَّفْظُ قَرِيبٌ مِنْ أَلْفَاظِهِمْ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari [Abu Zubair] dari [Thawus] dari [Ibnu Abbas] bahwa; Rasulullah shallallahu 'alaihi wasallam jika bangun untuk mengerjakan sholat di tengah malam, beliau membaca: \"ALLAHUMMA LAKAL HAMDU ANTA NUURUS SAMAAWAATI WAL ARDLI WALAKAL HAMDU ANTA QAYYAMUS SAMAAWAATI WAL ARDLI WALAKAL HAMDU ANTA RABBUS SAMAAWAATI WAL ARDLI WA MAN FIIHINNA ANTAL HAQQU WA WA'DUKAL HAQQU WA QAULUKAL HAQQU WA LIQAA`UKA HAQQU WAL JANNATU HAQQU WAN NAARU HAQQU WAS SAA'ATU HAQQU. ALLAHUMMA LAKA ASLAMTU WA BIKA AAMANTU WA 'ALAIKA TAWAKKALTU WA ILAIKA ANABTU WA BIKA KHAASHAMTU WA ILAIKA HAAKAMTU FAGHFIRLII MAA QADDAMTU WA AKHKHARTU WA ASRARTU WA A'LANTU ANTA ILAAHI LAA ILAAHA ILLAA ANTA (Ya Allah, untukMu segala puji; Engkau cahaya langit dan bumi; untukMu segala puji, Engkau pendiri langit dan bumi; dan untukMu segala puji, Engkau Tuhan langit dan bumi dan segala isinya. Engkau Maha Benar! JanjiMu benar, firmanMu benar, hari perjumpaan denganMu benar, surga benar, neraka benar dan hari kiamat adalah benar. Ya Allah, kepadaMulah aku berserah diri, denganMu aku beriman, kepadaMu au bertawakkal, dan kepadaMu aku kembali; karena membela agamaMu aku bermusuhan, dan kepadaMu aku bertahkim (memohon keadilan). Karena itu, ampunilah segala dosa-dosaku, yang lama dan yang baru, yang rahasia dan yang nyata; Engkaulah ilahku, tidak ada ilah yang berhak disembah selain Engkau).\" Telah menceritakan kepada kami [Amru An Naqid] dan [Ibnu Numair] dan [Ibnu Abu Umar] mereka berkata, telah menceritakan kepada kami [Sufyan] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Rafi'] ia berkata, telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] keduanya dari [Sulaiman Al Ahwali] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam. Adapun hadits Ibnu Juraij, maka lafazhnya sama dengan hadits Malik kecuali pada dua huruf. Kalau Ibnu Juraij kata Qayyam menjadi Qayyim. Dan ia juga menyebutkan, \"WA MAA ASRARTU (dan juga dosa yang aku sembunyikan). Adapun hadits Ibnu 'Uyainah, maka di dalamnya terdapat tambahan dan menyelisihi Malik dan Ibnu Juraid pada banyak kata. Dan Telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Mahdi] ia adalah Ibnu Maimun, telah menceritakan kepada kami [Imran Al Qashir] dari [Qais bin Sa'd] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini, sedangkan lafazhnya hampir sama dengan lafazh mereka."
            },
            {
                "number": 1209,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ حَدَّثَنَا يُوسُفُ الْمَاجِشُونُ حَدَّثَنِي أَبِي عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا قَامَ إِلَى الصَّلَاةِ قَالَ وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا وَمَا أَنَا مِنْ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنْ الْمُسْلِمِينَ اللَّهُمَّ أَنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أَنْتَ أَنْتَ رَبِّي وَأَنَا عَبْدُكَ ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعًا إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ وَاهْدِنِي لِأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ كُلُّهُ فِي يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ أَنَا بِكَ وَإِلَيْكَ تَبَارَكْتَ وَتَعَالَيْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ وَإِذَا رَكَعَ قَالَ اللَّهُمَّ لَكَ رَكَعْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ سَمْعِي وَبَصَرِي وَمُخِّي وَعَظْمِي وَعَصَبِي وَإِذَا رَفَعَ قَالَ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا بَيْنَهُمَا وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ وَإِذَا سَجَدَ قَالَ اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ ثُمَّ يَكُونُ مِنْ آخِرِ مَا يَقُولُ بَيْنَ التَّشَهُّدِ وَالتَّسْلِيمِ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَو حَدَّثَنَاه زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو النَّضْرِ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَمِّهِ الْمَاجِشُونِ بْنِ أَبِي سَلَمَةَ عَنْ الْأَعْرَجِ بِهَذَا الْإِسْنَادِ وَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَفْتَحَ الصَّلَاةَ كَبَّرَ ثُمَّ قَالَ وَجَّهْتُ وَجْهِي وَقَالَ وَأَنَا أَوَّلُ الْمُسْلِمِينَ وَقَالَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ وَقَالَ وَصَوَّرَهُ فَأَحْسَنَ صُوَرَهُ وَقَالَ وَإِذَا سَلَّمَ قَالَ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ إِلَى آخِرِ الْحَدِيثِ وَلَمْ يَقُلْ بَيْنَ التَّشَهُّدِ وَالتَّسْلِيمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bukair Al Muqaddami] telah menceritakan kepada kami [Yusuf Al Majisyun] telah menceritakan kepadaku [bapakku] dari [Abdurrahman Al A'raj] dari [ubaidhullah bin Abu Rafi'] dari [Ali bin Abu Thalib] dari Rasulullah shallallahu 'alaihi wasallam; Biasanya apabila Rasulullah shallallahu 'alaihi wasallam sholat, beliau membaca (do'a iftitah) sebagai berikut: \"WAJJAHTU WAJHIYA LILLADZII FATHARAS SAMAAWAATI WAL ARDLA HANIIFAN WAMAA ANAA MINAL MUSYRIKIIN, INNA SHALAATII WA NUSUKII WA MAHYAAYA WA MAMAATII LILLAHI RABBIL 'AALAMIIN LAA SYARIIKA LAHU WA BIDZAALIKA UMIRTU WA ANAA MINAL MUSLIMIIN ALLAHUMMA ANTAL MALIKU LAA ILAAHA ILLAA ANTA, ANTA RABBII WA ANAA 'ABDUKA ZHALAMTU NAFSII WA'TARAFTU BI DZANBII FAGHFIL LII DZUNUUBII JAMII'AN INNAHU LAA YAGHFIRUDZ DZUNUUB ILLAA ANTA WAH DINII LIAHSANAIL AKHLAAQ LAA YAHDII LIAHSANIHAA ILLAA ANTA WASHRIF 'ANNII SAYYI`AHAA LAA YASHRIFU 'ANNII SAYYI`AHAA ILLAA ANTA LABBAIKA WA SA'DAIKA WAL KHAIRU KULLUHU FII YADAIK WASY SYARRU LAISA ILAIKA ANAA BIKA WA ILAIKA TABAARAKTA WA TA'AALAITA ASTAGHFIRUKA WA ATUUBU ILAIKA (Aku hadapkan wajahku kepada Allah, Maha pencipta langit dan bumi dengan keadaan ikhlas dan tidak mempersekutukanNya. Sesungguhnya sholatku, segala ibadahku, hidupku dan matiku, hanya semata-mata untuk Allah Rabb semesta alam. Tidak ada sekutu bagiNya, dan karena itu aku patuh kepada perintahNya, dan berserah diri kepadaNya. Ya Allah, Engkaulah Maha Penguasa. Tidak ada Ilah yang berhak disembah selain Engkau. Engkaulah Tuhanku dan aku adalah hambaMu. Aku telah menzhalimi diriku dan aku mengakui dosa-dosaku. Karena itu ampunilah dosa-dosaku semuanya. Sesungguhnya tidak ada yang berwenang untuk mengampuni segala dosa melainkan Engkau. Dan tunjukilah kepadaku akhlak yang paling bagus. Sesungguhnya tidak ada yang dapat menunjukkannya melainkan hanya Engkau. Dan jauhkanlah akhlak yang buruk dariku, karena sesungguhnya tidak ada yang sanggup menjauhkannya melainkan hanya Engkau. Labbaik wa sa'daik (Aku patuhi segala perintahMu, dan aku tolong agamaMu). Segala kebaikan berada di tanganMu. Sedangkan kejahatan tidak datang daripadaMu. Aku berpegang teguh denganMu dan kepadaMu. Maha Suci Engkau dan Maha Tinggi. Kumohon ampun dariMu dan aku bertobat kepadaMu).\" Dan jika beliau ruku' beliau membaca: \"ALLAHUMMA LAKA RAKA'TU WA BIKA AAMANTU WA LAKA ASLAMTU KHASYA'A LAKA SAM'II WA BASHARII WA MUKHKHII WA 'AZHMII WA 'ASHABII (Ya Allah, kepadaMu aku ruku', denganMu aku beriman, kepadaMu aku berserah diri, patuh dan tunduk kepadau pendengaranku, penglihatanku, otakku, tulang-tulangku dan otot-ototku semuanya).\" Kemudian bila beliau bangkit dari ruku' beliau membaca: \"ALLAHUMMA RABBANAA LAKAL HAMDU MIL`AS SAMAAWAATI WA MIL`AL ARDLI WA MIL`A MAA BAINAHUMAA WA MIL`A MAAS YI`TA MIN SYAI`IN BA'DU (Ya Allah, Tuhan kami, untuk-Mulah segala puji sepenuh langit dan bumi, dan sepenuh ruang antara keduanya, dan sepenuh apa yang Engkau kehendaki setelah itu).\" Kemudian apabila beliau sujud beliau membaca: \"ALLAHUMMA LAKA SAJADTU WA BIKA AAMANTU WA LAKA ASLAMTU SAJADA WAJHIY LILLADZII KHALAQAHU WA SHAWWARAHU WA SYAQQA SYAM'AHU WA BASHARAHU TABAARAKALLAHU AHSANUL KHALIQIIN (Ya Allah, kepada Engkau aku sujud, dengan Engkau aku beriman, dan kepada Engkau aku berserah diri. Mukaku sujud kepada Tuhan yang menciptakan dan membentuknya, yang membukakan pendengaran dan penglihatannya. Maha suci Allah sebaik-baik Maha pencipta).\" Kemudian pada akhir tasyahud sebelum memberi salam beliau membaca: \"ALLAHUMMAGH FIRLII MAA QADDAMTU WA MAA AKHKHARTU WAMAA ASRARTU WA MAA A'LANTU WA ASRAFTU WA MAA ANTA A'LAMU BIHI MINNII ANTAL MUQADDiMU WA ANTAL MU`AKHKHIRU LAA ILAAHA ILLAA ANTA (Ya Allah, ampunilah dosa-dosaku yang lama dan yang baru yang tersembunyi dan nyata, yang aku lakukan keterlaluan dan engkau lebih tahu daripadaku. Engkaulah yang memajukan dan memundurkan. Tidak ada ilah selain Engkau).\" Dan telah menceritakannya kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Abdurrahman bin Mahdi] -dalam jalur periwayatan yang lain- Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abu An Nadlr] keduanya berkata, telah menceritakan kepada kami [Abdul Aziz bin Abdullah bin Abu Salamah] dari [pamannya] Al Majisyuna bin Abu Salamah dari [Al A'raj] dengan isnad ini, dan ia berkata; Apabila Rasulullah shallallahu 'alaihi wasallam memulai sholat, beliau bertakbir dan membaca (do'a iftitah): \"WAJJAHTU WAJHIYA.\" Beliau juga membaca: \"WA ANA AWWALUL MUSLIMIN.\" Dan ketika beliau bangkit dari ruku', beliau membaca: \"ALLAHUMMA RABBANAA LAKAL HAMDU.\" Beliau juga melanjutkan: \"WA SHAWWARAHU FAAHSANA SHUWARAHU.\" Dan setelah setelah salam beliau membaca: \"ALLAHUMMAGHFIR LII MAA QADAMTU.\" hingga akhir hadits. Dan ia tidak mengatakan; \"Antara tasyahud dan salam.\""
            },
            {
                "number": 1210,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ جَرِيرٍ كُلُّهُمْ عَنْ الْأَعْمَشِ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَافْتَتَحَ الْبَقَرَةَ فَقُلْتُ يَرْكَعُ عِنْدَ الْمِائَةِ ثُمَّ مَضَى فَقُلْتُ يُصَلِّي بِهَا فِي رَكْعَةٍ فَمَضَى فَقُلْتُ يَرْكَعُ بِهَا ثُمَّ افْتَتَحَ النِّسَاءَ فَقَرَأَهَا ثُمَّ افْتَتَحَ آلَ عِمْرَانَ فَقَرَأَهَا يَقْرَأُ مُتَرَسِّلًا إِذَا مَرَّ بِآيَةٍ فِيهَا تَسْبِيحٌ سَبَّحَ وَإِذَا مَرَّ بِسُؤَالٍ سَأَلَ وَإِذَا مَرَّ بِتَعَوُّذٍ تَعَوَّذَ ثُمَّ رَكَعَ فَجَعَلَ يَقُولُ سُبْحَانَ رَبِّيَ الْعَظِيمِ فَكَانَ رُكُوعُهُ نَحْوًا مِنْ قِيَامِهِ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ قَامَ طَوِيلًا قَرِيبًا مِمَّا رَكَعَ ثُمَّ سَجَدَ فَقَالَ سُبْحَانَ رَبِّيَ الْأَعْلَى فَكَانَ سُجُودُهُ قَرِيبًا مِنْ قِيَامِهِقَالَ وَفِي حَدِيثِ جَرِيرٍ مِنْ الزِّيَادَةِ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Mu'awiyah] -dalam jalur lain- Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] semuanya dari [Jarir] mereka semua dari [Al A'masy] -dalam jalur lain- telah menceritakan kepada kami [Ibnu Numair] -dan lafazh ini adalah darinya- telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Al A'masy] dari [Sa'id bin Ubaidah] dari [Al Mustaurid bin Al Ahnaf] dari [Shilah bin Zufar] dari [Hudzaifah] ia berkata; Pada suatu malam, saya sholat (Qiyamul Lail) bersama Rasulullah shallallahu 'alaihi wasallam, lalu beliau mulai membaca surat Al Baqarah. Kemudian saya pun berkata (dalam hati bahwa beliau) akan ruku' pada ayat yang ke seratus. Kemudian (seratus ayat pun) berlalu, lalu saya berkata (dalam hati bahwa) beliau akan sholat dengan (surat itu) dalam satu raka'at. Namun (surat Al Baqarah pun) berlalu, maka saya berkata (dalam hati bahwa) beliau akan segera sujud. Ternyata beliau melanjutkan dengan mulai membaca surat An Nisa` hingga selesai membacanya. Kemudian beliau melanjutkan ke surat Ali Imran hingga selesai hingga beliau selesai membacanya. Bila beliau membaca ayat tasbih, beliau bertasbih dan bila beliau membaca ayat yang memerintahkan untuk memohon, beliau memohon, dan bila beliau membaca ayat ta'awwudz (ayat yang memerintahkan untuk memohon perlindungan) beliau memohon perlindungan. Kemudian beliau ruku'. Dalam ruku', beliau membaca: \"SUBHAANA RABBIYAL 'AZHIIM (Maha Suci Tuhanku yang Maha Agung).\" Dan lama beliau ruku' hampir sama dengan berdirinya. Kemudian beliau membaca: \"SAMI'ALLAHU LIMAN HAMIDAH (Maha Mendengar Allah akan orang yang memuji-Nya).\" Kemudian beliau berdiri dan lamanya berdiri lebih kurang sama dengan lamanya ruku'. Sesudah itu beliau sujud, dan dalam sujud beliau membaca: \"SUBHAANA RABBIYAL A'LAA (Maha Suci Tuhanku Yang Maha Tinggi).\" Lama beliau sujud hampir sama dengan lamanya berdiri. Sementara di dalam hadits Jarir terdapat tambahan; Beliau membaca: \"SAMI'ALLAHU LIMAN HAMIDAH RABBANAA LAKAL HAMDU (Allah Maha Mendengar akan orang yang memuji-Nya, Ya Tuhan kami bagi-Mu segala puji).\""
            },
            {
                "number": 1211,
                "arab": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرٍ قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَقَالَ عَبْدُ اللَّهِ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَطَالَ حَتَّى هَمَمْتُ بِأَمْرِ سَوْءٍ قَالَ قِيلَ وَمَا هَمَمْتَ بِهِ قَالَ هَمَمْتُ أَنْ أَجْلِسَ وَأَدَعَهُو حَدَّثَنَاه إِسْمَعِيلُ بْنُ الْخَلِيلِ وَسُوَيْدُ بْنُ سَعِيدٍ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Dan telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] keduanya dari [Jarir] -dalam jalur lain [Utsman] berkata- telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Wa`il] ia berkata, [Abdullah] berkata; \"Saya pernah sholat bersama Rasulullah shallallahu 'alaihi wasallam lalu beliau memanjangkannya hingga saya berkeinginan untuk berbuat sesuatu yang tidak baik.\" Ditanyakan kepadanya, \"Perbuatan apa yang hendak kamu lakukan?\" Abdullah menjawab, \"Saya hendak duduk dan meninggalkannya.\" Dan telah menceritakannya kepada kami [Isma'il bin Khalil] dan [Suwaid bin Sa'id] dari [Ali bin Mushir] dari [Al A'masy] dengan isnad ini semisalnya."
            },
            {
                "number": 1212,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ نَامَ لَيْلَةً حَتَّى أَصْبَحَ قَالَ ذَاكَ رَجُلٌ بَالَ الشَّيْطَانُ فِي أُذُنَيْهِ أَوْ قَالَ فِي أُذُنِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ishaq] -Utsman- berkata, telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wa`il] dari [Abdullah] ia berkata; Suatu ketika Rasulullah shallallahu 'alaihi wasallam mendengarkan cerita bahwa ada laki-laki yang tidur hingga pagi. Maka beliau bersabda: \"Itulah laki-laki yang telah dikencingi kedua telinganya oleh syetan.\" Atau beliau mengatakan; \"Di telinganya.\""
            },
            {
                "number": 1213,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ أَنَّ الْحُسَيْنَ بْنَ عَلِيٍّ حَدَّثَهُ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَرَقَهُ وَفَاطِمَةَ فَقَالَ أَلَا تُصَلُّونَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ فَإِذَا شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا فَانْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قُلْتُ لَهُ ذَلِكَ ثُمَّ سَمِعْتُهُ وَهُوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ وَيَقُولُ{ وَكَانَ الْإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلًا }",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Uqail] dari [Az Zuhri] dari [Ali bin Husain] bahwa [Al Husain bin Ali] telah menceritakan kepadanya dari [Ali bin Abu Thalib] bahwa pada suatu malam tiba-tiba Nabi shallallahu 'alaihi wasallam mendatangi rumah kami -yakni rumahku bersama Fathimah- seraya berkata: \"Apakah kalian tidak sholat?\" jawabku, \"Wahai Rasulullah, sesungguhnya jiwa kami berada di tangan Allah. Bila Dia menghendaki kami bangun, tentu kami bangun.\" Mendengar jawaban itu beliau pergi. Kemudian terdengarlah olehku beliau memukul pahanya sambil bersabda: \"Memang, manusia itu suka membantah.\""
            },
            {
                "number": 1214,
                "arab": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ ثَلَاثَ عُقَدٍ إِذَا نَامَ بِكُلِّ عُقْدَةٍ يَضْرِبُ عَلَيْكَ لَيْلًا طَوِيلًا فَإِذَا اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ وَإِذَا تَوَضَّأَ انْحَلَّتْ عَنْهُ عُقْدَتَانِ فَإِذَا صَلَّى انْحَلَّتْ الْعُقَدُ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ وَإِلَّا أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلَانَ",
                "id": "Telah menceritakan kepada kami [Amru An Naqid] dan [Zuhair bin Harb] -Amru- berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] sampai pada Nabi shallallahu 'alaihi wasallam (bahwa beliau bersabda): \"Syetan akan mengikat tengkuk salah seorang dari kalian saat ia tidur dengan tiga ikatan. Dengan setiap ikatan ia akan membisikkan padamu bahwa malam masih panjang. Jika ia terbangun lalu berdzikir kepada Allah, lepaslah satu ikatan, jika ia berwudlu maka lepaslah dua ikatan. Dan jika ia melanjutkan dengan sholat, maka lepaslah seluruh ikatan itu, sehingga pada pagi harinya ia mulai dengan penuh kesemangatan dan jiwanya pun sehat. Namun jika tidak, maka dia akan memasuki waktu pagi dengan jiwa yang keji dan penuh kemalasan.\""
            },
            {
                "number": 1215,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اجْعَلُوا مِنْ صَلَاتِكُمْ فِي بُيُوتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya] dari [ubaidhullah] ia berkata, telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jadikanlah sebagian sholat kalian (dilakukan) di rumah-rumah kalian, dan janganlah kalian menjadikannya sebagai kuburan.\""
            },
            {
                "number": 1216,
                "arab": "و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ أَخْبَرَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلُّوا فِي بُيُوتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا",
                "id": "Dan Telah menceritakan kepada kami [Ibnul Mutsanna] telah menceritakan kepada kami [Abdul Wahhab] telah mengabarkan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholatlah di rumah-rumah kalian, dan janganlah kalian menjadikannya sebagai kuburan.\""
            },
            {
                "number": 1217,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَضَى أَحَدُكُمْ الصَّلَاةَ فِي مَسْجِدِهِ فَلْيَجْعَلْ لِبَيْتِهِ نَصِيبًا مِنْ صَلَاتِهِ فَإِنَّ اللَّهَ جَاعِلٌ فِي بَيْتِهِ مِنْ صَلَاتِهِ خَيْرًا",
                "id": "Dan Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian telah menunaikan sholat di Masjidnya, hendaknya ia menyisakan sebagian sholatnya untuk (dikerjakan) di rumahnya, karena dari sholatnya itu, Allah akan menjadikan kebaikan di dalam rumahnya.\""
            },
            {
                "number": 1218,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَثَلُ الْبَيْتِ الَّذِي يُذْكَرُ اللَّهُ فِيهِ وَالْبَيْتِ الَّذِي لَا يُذْكَرُ اللَّهُ فِيهِ مَثَلُ الْحَيِّ وَالْمَيِّتِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Barrad Al Asy'ari] dan [Muhammad bin Al 'Ala`] keduanya berkata, telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Perumpamaan rumah yang di dalamnya selalu disebut nama Allah Ta'ala dengan rumah yang di dalamnya tidak pernah disebut nama Allah adalah sebagaimana orang hidup dan orang mati.\""
            },
            {
                "number": 1219,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَجْعَلُوا بُيُوتَكُمْ مَقَابِرَ إِنَّ الشَّيْطَانَ يَنْفِرُ مِنْ الْبَيْتِ الَّذِي تُقْرَأُ فِيهِ سُورَةُ الْبَقَرَةِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub bin Abdurrahman Al Qariy] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian jadikan rumah-rumah kalian sebagai kuburan, sesungguhnya syetan itu akan lari dari rumah yang di dalamnya dibacakan surat Al Baqarah.\""
            },
            {
                "number": 1220,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا سَالِمٌ أَبُو النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَاحْتَجَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُجَيْرَةً بِخَصَفَةٍ أَوْ حَصِيرٍ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِيهَا قَالَ فَتَتَبَّعَ إِلَيْهِ رِجَالٌ وَجَاءُوا يُصَلُّونَ بِصَلَاتِهِ قَالَ ثُمَّ جَاءُوا لَيْلَةً فَحَضَرُوا وَأَبْطَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُمْ قَالَ فَلَمْ يَخْرُجْ إِلَيْهِمْ فَرَفَعُوا أَصْوَاتَهُمْ وَحَصَبُوا الْبَابَ فَخَرَجَ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُغْضَبًا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا زَالَ بِكُمْ صَنِيعُكُمْ حَتَّى ظَنَنْتُ أَنَّهُ سَيُكْتَبُ عَلَيْكُمْ فَعَلَيْكُمْ بِالصَّلَاةِ فِي بُيُوتِكُمْ فَإِنَّ خَيْرَ صَلَاةِ الْمَرْءِ فِي بَيْتِهِ إِلَّا الصَّلَاةَ الْمَكْتُوبَةَو حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ قَالَ سَمِعْتُ أَبَا النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ حُجْرَةً فِي الْمَسْجِدِ مِنْ حَصِيرٍ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا لَيَالِيَ حَتَّى اجْتَمَعَ إِلَيْهِ نَاسٌ فَذَكَرَ نَحْوَهُ وَزَادَ فِيهِ وَلَوْ كُتِبَ عَلَيْكُمْ مَا قُمْتُمْ بِهِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Salim Abu Nadlr] maula Umar bin ubaidhullah, dari [Busr bin Sa'id] dari [Zaid bin Tsabit] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memasang tenda dari tikar pada sebuah tempat di Masjid, sehingga merupakan sebuah kamar tempat beliau sholat (malam). Melihat hal itu, beberapa orang sahabat mendatangi tempat itu dan mereka sholat pula mengikuti Nabi shallallahu 'alaihi wasallam sholat. Pada suatu malam mereka datang pula, tetapi Rasulullah shallallahu 'alaihi wasallam terlambat, sehingga beliau tidak keluar sama sekali menemui mereka. Oleh karena itu, mereka mengeraskan suara dan melempar pintu dengan kerikil, untuk memberi tahu Nabi shallallahu 'alaihi wasallam, karena mereka menyangka kalau-kalau beliau lupa. Maka dalam keadaan marah Rasulullah shallallahu 'alaihi wasallam keluar menemui mereka sambil bersabda: \"Janganlah kalian berbuat demikian, karena aku mengira bahwa sholat malam itu akan diwajibkan kepada kalian. Karena itu, sholatlah kalian di rumah kalian masing-masing, karena sebaik-baik sholat seseorang adalah yang dilakukan di rumahnya sendiri, kecuali sholat wajib.\" Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Musa bin Uqbah] ia berkata, saya mendengar [Abu An Nadlr] dari [Busr bin Sa'id] dari [Zaid bin Tsabit] bahwa Nabi shallallahu 'alaihi wasallam memasang tenda dari tikar pada sebuah tempat di Masjid, sehingga merupakan sebuah kamar tempat beliau sholat (malam). Melihat hal itu, beberapa orang sahabat mendatangi tempat itu. Maka ia pun menyebutkan hadits yang serupa dengannya. Dan ia menambahkan di dalamnya; \"Jika (sholat malam) itu diwajibkan atas kalian, niscaya kalian tidak akan mampu melakukannya.\""
            },
            {
                "number": 1221,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَصِيرٌ وَكَانَ يُحَجِّرُهُ مِنْ اللَّيْلِ فَيُصَلِّي فِيهِ فَجَعَلَ النَّاسُ يُصَلُّونَ بِصَلَاتِهِ وَيَبْسُطُهُ بِالنَّهَارِ فَثَابُوا ذَاتَ لَيْلَةٍ فَقَالَ يَا أَيُّهَا النَّاسُ عَلَيْكُمْ مِنْ الْأَعْمَالِ مَا تُطِيقُونَ فَإِنَّ اللَّهَ لَا يَمَلُّ حَتَّى تَمَلُّوا وَإِنَّ أَحَبَّ الْأَعْمَالِ إِلَى اللَّهِ مَا دُووِمَ عَلَيْهِ وَإِنْ قَلَّ وَكَانَ آلُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا عَمِلُوا عَمَلًا أَثْبَتُوهُ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul Wahhab] yakni Ats Tsaqafi, telah menceritakan kepada kami [ubaidhullah] dari [Sa'id bin Abu Sa'id] dari [Abu Salamah] dari [Aisyah] bahwa ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mempunyai sehelai tikar yang dibentangkannya pada malam hari, sehingga merupakan tabir sebuah kamar tempat beliau sholat. Lalu orang-orang pun sholat pula bersama beliau. Dan dibentangkannya di siang hari. Pada suatu malam mereka kembali berkumpul mengikuti beliau. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: 'Wahai sekalian manusia, hendaklah kalian beramal menurut kemampuan kalian, sebab Allah tidak akan pernah bosan hingga kalian bosan sendiri. Sesungguhnya amalan yang paling disukai Allah, adalah amalan yang dikerjakan secara terus menerus meskipun sedikit. Dan bila keluarga Muhammad shallallahu 'alaihi wasallam melakukan suatu amalan, maka mereka akan menekuninya.'\""
            },
            {
                "number": 1222,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ أَنَّهُ سَمِعَ أَبَا سَلَمَةَ يُحَدِّثُ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْعَمَلِ أَحَبُّ إِلَى اللَّهِ قَالَ أَدْوَمُهُ وَإِنْ قَلَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Ibrahim] bahwa ia mendengar [Abu Salamah] menceritakan dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya, \"Amal yang bagaimanakah yang paling dicintai oleh Allah?\" Aisyah menjawab, \"Amalan yang dikerjakan secara kontinyu meskipun sedikit.\""
            },
            {
                "number": 1223,
                "arab": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ زُهَيْرٌ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَ سَأَلْتُ أُمَّ الْمُؤْمِنِينَ عَائِشَةَ قَالَقُلْتُ يَا أُمَّ الْمُؤْمِنِينَ كَيْفَ كَانَ عَمَلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ كَانَ يَخُصُّ شَيْئًا مِنْ الْأَيَّامِ قَالَتْ لَا كَانَ عَمَلُهُ دِيمَةً وَأَيُّكُمْ يَسْتَطِيعُ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَطِيعُ",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] -Zuhari berkata- telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Alqamah] ia berkata; Saya bertanya kepada Ummul mukminin [Aisyah], \"Wahai Ummul mukminin, bagaimanah amalan Rasulullah shallallahu 'alaihi wasallam? Apakah beliau mengkhususkan suatu amalan pada hari tertentu?\" Aisyah menjawab, \"Tidak, amalan beliau adalah terus menerus. Dan siapa pun kalian, pasti akan mampu melakukan amalan yang Rasulullah shallallahu 'alaihi wasallam mampu melakukannya.\""
            },
            {
                "number": 1224,
                "arab": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سَعْدُ بْنُ سَعِيدٍ أَخْبَرَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ الْأَعْمَالِ إِلَى اللَّهِ تَعَالَى أَدْوَمُهَا وَإِنْ قَلَّ قَالَ وَكَانَتْ عَائِشَةُ إِذَا عَمِلَتْ الْعَمَلَ لَزِمَتْهُ",
                "id": "Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Sa'd bin Sa'id] telah mengabarkan kepadaku [Al Qasim bin Muhammad] dari [Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Amalan yang paling dicintai Allah adalah yang terus-menerus (dilakukan) meskipun sedikit.\" Al Qasim berkata; Dan Aisyah, bila ia mengerjakan suatu amalan, maka ia kan menekuninya."
            },
            {
                "number": 1225,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ عُلَيَّةَ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ وَحَبْلٌ مَمْدُودٌ بَيْنَ سَارِيَتَيْنِ فَقَالَ مَا هَذَا قَالُوا لِزَيْنَبَ تُصَلِّي فَإِذَا كَسِلَتْ أَوْ فَتَرَتْ أَمْسَكَتْ بِهِ فَقَالَ حُلُّوهُ لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ فَإِذَا كَسِلَ أَوْ فَتَرَ قَعَدَوَفِي حَدِيثِ زُهَيْرٍ فَلْيَقْعُدْ و حَدَّثَنَاه شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Ulayyah] -dalam jalur lain- Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] dari [Abdul Aziz bin Shuhaib] dari [Anas] ia berkata; \"Suatu ketika, Rasulullah shallallahu 'alaihi wasallam masuk Masjid. Lalu beliau melihat seuntai tali yang terbentang di antara dua tiang, maka beliau pun bertanya: 'Tali apa ini? ' Mereka menjawab, 'Tali yang dibentangkan oleh Zainab dan digunakannya sholat. Bila ia malas atau letih, maka dia akan berpegangan dengan tali itu.' Maka Nabi shallallahu 'alaihi wasallam bersabda: 'Lepaskanlah tali itu. Hendaklah salah seorang dari kalian sholat ketika kondisi semangat. Sedangkan ika ia malas atau letih, hendaklah ia duduk.'\" Sedangkan dalam haditsnya Zuhair tertera; \"Hendaklah ia duduk.\" Dan telah menceritakannya kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Abdul Warits] dari [Abdul Aziz] dari [Anas] dari Nabi shallallahu 'alaihi wasallam semisalnya."
            },
            {
                "number": 1226,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُأَنَّ الْحَوْلَاءَ بِنْتَ تُوَيْتِ بْنِ حَبِيبِ بْنِ أَسَدِ بْنِ عَبْدِ الْعُزَّى مَرَّتْ بِهَا وَعِنْدَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ هَذِهِ الْحَوْلَاءُ بِنْتُ تُوَيْتٍ وَزَعَمُوا أَنَّهَا لَا تَنَامُ اللَّيْلَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنَامُ اللَّيْلَ خُذُوا مِنْ الْعَمَلِ مَا تُطِيقُونَ فَوَاللَّهِ لَا يَسْأَمُ اللَّهُ حَتَّى تَسْأَمُوا",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] dan [Muhammad bin Salamah Al Muradi] ia berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] ia berkata, telah mengabarkan kepadaku [Urwah bin Zubair] bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya bahwa Al Haula`a binti Tuwait bin Habib bin Asad bin Abdul 'Uzza melewatinya, sementara di sisinya ada Rasulullah shallallahu 'alaihi wasallam. Aisyah pun berkata; Saya berkata, \"Wanita ini adalah Al Haula` binti Tuwait, orang-orang menganggap bahwa ia tidak pernah tidur malam.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Benarkan ia tidak tidur malam? Hendaklah kalian beramal sesuai dengan kemampuan kalian, karena demi Allah, Allah tidak akan bosan hingga kalian sendiri yang bosan.\""
            },
            {
                "number": 1227,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظ لَهُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ قَالَ أَخْبَرَنِي أَبِي عَنْ عَائِشَةَ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدِي امْرَأَةٌ فَقَالَ مَنْ هَذِهِ فَقُلْتُ امْرَأَةٌ لَا تَنَامُ تُصَلِّي قَالَ عَلَيْكُمْ مِنْ الْعَمَلِ مَا تُطِيقُونَ فَوَاللَّهِ لَا يَمَلُّ اللَّهُ حَتَّى تَمَلُّوا وَكَانَ أَحَبَّ الدِّينِ إِلَيْهِ مَا دَاوَمَ عَلَيْهِ صَاحِبُهُوَفِي حَدِيثِ أَبِي أُسَامَةَ أَنَّهَا امْرَأَةٌ مِنْ بَنِي أَسَدٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin Urwah] -dalam jalur lain- Dan telah menceritakan kepadaku [Zuhair bin Harb] -dan lafazh hadits darinya- telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] ia berkata, telah mengabarkan kepadaku [bapakku] dari [Aisyah] ia berkata; \"Suatu ketika Rasulullah shallallahu 'alaihi wasallam masuk ke dalam rumahku, yang saat itu saya bersama dengan seorang wanita. Maka beliau pun bertanya: 'Siapa wanita ini? ' Saya menjawab, 'Ia adalah seorang wanita yang tidak pernah tidur karena selalu menunaikan sholat sepanjang malam.' Maka beliau bersabda: 'Beribadahlah kalian sesuai dengan kemampuan kalian. Demi Allah, Dia tidak akan pernah bosan hingga kalian sendiri yang bosan. Dan amalan agama yang paling dicintai olehNya adalah yang dikerjakan dengan kontinyu oleh pelakunya.'\" Dalam hadits Usamah bahwa wanita itu berasal dari Bani Asad."
            },
            {
                "number": 1228,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَعَسَ أَحَدُكُمْ فِي الصَّلَاةِ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبُّ نَفْسَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] -dalam jalur periwayatan lain- Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] -dalam jalur lain- Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] semuanya dari [Hisyam bin Urwah] -dalam jalur lain- Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] -lafazh darinya- dari [Malik bin Anas] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian mengantuk di dalam sholatnya, maka hendaklah ia tidur hingga rasa kantuknya hilang. Karena jika salah seorang dari kalian sholat dalam keadaan mengantuk, mungkin saja ia memohon ampunan, namun ternyata justru mencaci-maki dirinya sendiri.\""
            },
            {
                "number": 1229,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَعَنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ مِنْ اللَّيْلِ فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ فَلَمْ يَدْرِ مَا يَقُولُ فَلْيَضْطَجِعْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] ia berkata, ini yang diceritakan kepada kami oleh [Abu Hurairah] dari Muhammad Rasulullah shallallahu 'alaihi wasallam. Ia pun menyebutkan hadits di antaranya adalah; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang diantara kalian mengerjakan sholat malam kemudian tidak mampu membaca Al Qur`an (karena ngantuk), sehingga tidak mengerti apa yang ia baca maka hendaknya ia tidur dahulu.\""
            },
            {
                "number": 1230,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ رَجُلًا يَقْرَأُ مِنْ اللَّيْلِ فَقَالَ يَرْحَمُهُ اللَّهُ لَقَدْ أَذْكَرَنِي كَذَا وَكَذَا آيَةً كُنْتُ أَسْقَطْتُهَا مِنْ سُورَةِ كَذَا وَكَذَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [bapaknya] dari [Aisyah] bahwasanya; Pada suatu malam Nabi shallallahu 'alaihi wasallam mendengar seroang laki-laki membaca (Al Qur`an), maka beliau pun bersabda: \"Semoga Allah memberinya rahmat. Ia telah mengingatkanku ayat ini dan ini. Yakni ayat yang aku lupa dari surat ini dan surat itu.\""
            },
            {
                "number": 1231,
                "arab": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا عَبْدَةُ وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَمِعُ قِرَاءَةَ رَجُلٍ فِي الْمَسْجِدِ فَقَالَ رَحِمَهُ اللَّهُ لَقَدْ أَذْكَرَنِي آيَةً كُنْتُ أُنْسِيتُهَا",
                "id": "Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Abdah] dan [Abu Mu'awiyah] dari [Hisyam] dari [bapaknya] dari [Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam mendengar bacaan seorang laki-laki di Masjid, maka beliau pun bersabda: \"Semoga Allah memberinya rahmat. Dia telah mengingatkanku akan suatu ayat, yang aku telah dilupakan daripadanya.\""
            },
            {
                "number": 1232,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا مَثَلُ صَاحِبِ الْقُرْآنِ كَمَثَلِ الْإِبِلِ الْمُعَقَّلَةِ إِنْ عَاهَدَ عَلَيْهَا أَمْسَكَهَا وَإِنْ أَطْلَقَهَا ذَهَبَتْحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ الْمُسَيَّبِيُّ حَدَّثَنَا أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ جَمِيعًا عَنْ مُوسَى بْنِ عُقْبَةَ كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ مَالِكٍ وَزَادَ فِي حَدِيثِ مُوسَى بْنِ عُقْبَةَ وَإِذَا قَامَ صَاحِبُ الْقُرْآنِ فَقَرَأَهُ بِاللَّيْلِ وَالنَّهَارِ ذَكَرَهُ وَإِذَا لَمْ يَقُمْ بِهِ نَسِيَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan orang yang hafal Al Qur`an, ialah seperti unta yang ditambatkan. Jika ia tetap diawasi, dia akan tetap tertambat, tetapi jika ia dibiarkan maka akan lepas.\" telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] dan [ubaidhullah bin Sa'id] mereka berkata, telah menceritakan kepada kami [Yahya Al Qaththan] -dalam jalur lain- telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abu Khalid Al Ahmar] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] semuanya dari [ubaidhullah] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] -dalam jalur lain- Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub] yakni Ibnu Abdurrahman. -Dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Ishaq Al Musayyibi] Telah menceritakan kepada kami [Anas] yakni Ibnu Iyadl, semuanya dari [Musa bin Uqbah] mereka semua dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam yang semakna dengan hadits Malik. Dan ia menambahkan di dalam hadits Musa bin Uqbah; \"Jika seorang penghafal Al Qur`an sholat lalu ia membacanya pada malam dan siang hari, niscaya ia akan senantiasa mengingatnya. Namun, jika ia tidak melakukan hal itu, niscaya ia akan melupakannya.\""
            },
            {
                "number": 1233,
                "arab": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَمَا لِأَحَدِهِمْ يَقُولُ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ هُوَ نُسِّيَ اسْتَذْكِرُوا الْقُرْآنَ فَلَهُوَ أَشَدُّ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنْ النَّعَمِ بِعُقُلِهَا",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] -Ishaq- berkata, telah mengabarkan kepada kami -dua orang yang lain- berkata telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wa`il] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Alangkah buruknya seorang yang berkata, 'Aku lupa ayat ini dan itu.' Akan tetapi ia telah dilupakan Allah. Sering-seringlah mengingat (membaca) Al Qur`an, karena ia lebih cepat hilangnya dari dada seseorang, daripada unta yang lepas dari ikatannya.\""
            },
            {
                "number": 1234,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ قَالَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ قَالَ عَبْدُ اللَّهِتَعَاهَدُوا هَذِهِ الْمَصَاحِفَ وَرُبَّمَا قَالَ الْقُرْآنَ فَلَهُوَ أَشَدُّ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنْ النَّعَمِ مِنْ عُقُلِهِ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُلْ أَحَدُكُمْ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ هُوَ نُسِّيَ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] dan [Abu Mu'awiyah] -dalam jalur lain- Dan telah menceritakan kepada kami [Yahya bin Yahya] -lafazh adalah miliknya- ia berkata, telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] ia berkata, [Abdullah] berkata; \"Sering-seringlah kalian membaca Mushhaf ini -sepertinya ia juga mengatakan- Al Qur`an, karena ia lebih cepat hilangnya dari dada para penghafalnya daripada unta dari ikatannya.\" Abdullah berkata; Dan Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Janganlah salah seorang dari kalian mengatakan, 'Saya telah lupa ayat ini dan itu.' akan tetapi ia telah dilupakan.\""
            },
            {
                "number": 1235,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي عَبْدَةُ بْنُ أَبِي لُبَابَةَ عَنْ شَقِيقِ بْنِ سَلَمَةَ قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ يَقُولُاسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِئْسَمَا لِلرَّجُلِ أَنْ يَقُولَ نَسِيتُ سُورَةَ كَيْتَ وَكَيْتَ أَوْ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ هُوَ نُسِّيَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Abdah bin Abu Lubabah] dari [Syaqiq bin Salamah] ia berkata, saya mendengar [Ibnu Mas'ud] berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Alangkah buruknya bagi seorang yang berkata, 'Saya telah lupa surat ini dan itu atau saya lupa ayat ini dan itu.' Akan tetapi ia dilupakan.\""
            },
            {
                "number": 1236,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَعَاهَدُوا هَذَا الْقُرْآنَ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَهُوَ أَشَدُّ تَفَلُّتًا مِنْ الْإِبِلِ فِي عُقُلِهَاوَلَفْظُ الْحَدِيثِ لِابْنِ بَرَّادٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Barrad Al Asy'ari] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jagalah oleh kalian Al Qur`an ini (dengan banyak membacanya), karena demi Dzat yang jiwa Muhammad berada di tangan-Nya, ia lebih cepat hilangnya daripada unta dari tambatannya.\" Lafazh hadits ini dari Ibnu Barrad."
            },
            {
                "number": 1237,
                "arab": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِو حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو كِلَاهُمَا عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ قَالَ كَمَا يَأْذَنُ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Amru An Naqid] dan [Zuhair bin Harb] keduanya berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] hingga sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Allah tidak menaruh perhatian terhadap sesuatu, seperti perhatiannya terhadap Nabi yang melagukan Al Qur`an dengan suara yang indah.\" Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] -dalam jalur lain- Dan telah menceritakan kepadaku [Yunus bin Abdul A'la] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru] keduanya dari [Ibnu Syihab] dengan isnad ini. Ia mengatakan; \"Sebagaimana perhatianNya terhadap Nabi saat melagukan Al Qur`an.\""
            },
            {
                "number": 1238,
                "arab": "حَدَّثَنِي بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ حَسَنِ الصَّوْتِ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِو حَدَّثَنِي ابْنُ أَخِي ابْنِ وَهْبٍ حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عُمَرُ بْنُ مَالِكٍ وَحَيْوَةُ بْنُ شُرَيْحٍ عَنْ ابْنِ الْهَادِ بِهَذَا الْإِسْنَادِ مِثْلَهُ سَوَاءً وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ سَمِعَ",
                "id": "Telah menceritakan kepadaku [Bisyr bin Al Hakam] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] telah menceritakan kepada kami [Yazid] ia adalah Ibnul Hadi, dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Abu Hurairah] bahwa mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah tidak menaruh perhatian terhadap sesuatu, seperti perhatianNya terhadap Nabi ketika melagukan Al Qur`an dengan suara yang indah dan nyaring.\" Dan telah menceritakan kepadaku [Anak saudara Ibnu Wahab] telah menceritakan kepada kami [pamanku] Abdullah bin Wahb, telah mengabarkan kepadaku [Umar bin Malik] dan [Haiwah bin Syuraih] dari [Ibnul Hadi] dengan isnad ini semisalnya. Dan ia mengatakan; Bahwa Rasulullah shallallahu 'alaihi wasallam tidak mengatakan; \"Mendengar.\""
            },
            {
                "number": 1239,
                "arab": "و حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا هِقْلٌ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَذِنَ اللَّهُ لِشَيْءٍ كَأَذَنِهِ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِو حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ غَيْرَ أَنَّ ابْنَ أَيُّوبَ قَالَ فِي رِوَايَتِهِ كَإِذْنِهِ",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Hiql] dari [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah tidak menaruh perhatian terhadap sesuatu pun seperti perhatianNya terhadap Nabi saat melagukan Al Qur`an dengan menyaringkan suaranya.\" Dan telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah bin Sa'id] dan [Ibnu Hujr] mereka berkata, telah menceritakan kepada kami [Isma'il] ia adalah Ibnu Ja'far, dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti haditsnya Yahya bin Abu Katsir. Hanya saja Ayyub mengatakan dalam riwayatnya, \"Seperti perhatianNya.\""
            },
            {
                "number": 1240,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا مَالِكٌ وَهُوَ ابْنُ مِغْوَلٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عَبْدَ اللَّهِ بْنَ قَيْسٍ أَوْ الْأَشْعَرِيَّ أُعْطِيَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Malik bin Mighwal] dari [Abdullah bin Buraidah] dari [bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Abdullah bin Qais atau Al Asy'ari telah diberikan salah satu mizmar (suara yang merdu) dari mizmar yang dimiliki keluarga Dawud.\""
            },
            {
                "number": 1241,
                "arab": "و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا طَلْحَةُ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَبِي مُوسَى لَوْ رَأَيْتَنِي وَأَنَا أَسْتَمِعُ لِقِرَاءَتِكَ الْبَارِحَةَ لَقَدْ أُوتِيتَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ",
                "id": "Dan telah menceritakan kepada kami [Dawud bin Rusyaid] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Thalhah] dari [Abu Burdah] dari [Abu Musa] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abu Musa: \"Seandainya saja semalam kamu mengetahuiku sedang mendengarkan bacaanmu. Sungguh engkau telah diberi suara yang bagus sebagaimana yang telah diberikan kepada keluarga Daud.\""
            },
            {
                "number": 1242,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَوَكِيعٌ عَنْ شُعْبَةَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ الْمُزَنِيَّ يَقُولُاقَرَأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فِي مَسِيرٍ لَهُ سُورَةَ الْفَتْحِ عَلَى رَاحِلَتِهِ فَرَجَّعَ فِي قِرَاءَتِهِقَالَ مُعَاوِيَةُ لَوْلَا أَنِّي أَخَافُ أَنْ يَجْتَمِعَ عَلَيَّ النَّاسُ لَحَكَيْتُ لَكُمْ قِرَاءَتَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dan [Waki'] dari [Syu'bah] dari [Mu'awiyah bin Qurrah] ia berkata, saya mendengar [Abdullah bin Mughaffal Al Muzani] berkata; Nabi shallallahu 'alaihi wasallam membaca surat Al Fath pada tahun Al Fath (penaklukan kota Makkah) dalam suatu perjalanan disaat beliau berada di atas kendaraannya. Kemudian beliau mengulang-mengulang bacaannya. Mu'awiyah berkata; \"Sekiranya aku tidak khawatir manusia akan berkumpul mengerumuniku, niscaya akan saya ceritakan kepada kalian seperti apa bacaan beliau.\""
            },
            {
                "number": 1243,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ عَلَى نَاقَتِهِ يَقْرَأُ سُورَةَ الْفَتْحِقَالَ فَقَرَأَ ابْنُ مُغَفَّلٍ وَرَجَّعَ فَقَالَ مُعَاوِيَةُ لَوْلَا النَّاسُ لَأَخَذْتُ لَكُمْ بِذَلِكَ الَّذِي ذَكَرَهُ ابْنُ مُغَفَّلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و حَدَّثَنَاه يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي قَالَا حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَفِي حَدِيثِ خَالِدِ بْنِ الْحَارِثِ قَالَ عَلَى رَاحِلَةٍ يَسِيرُ وَهُوَ يَقْرَأُ سُورَةَ الْفَتْحِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] -Ibnul Mutsanna- berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Mu'awiyah bin Qurrah] ia berkata, saya mendengar [Abdullah bin Mughaffal], ia berkata; Pada hari Fathu Makkah, saya melihat Rasulullah shallallahu 'alaihi wasallam di atas untanya membaca surat Al Fath. Ibnu Mughaffal pun membacanya dan mengulangi bacaannya kembali. Kemudian Mu'awiyah berkata, \"Sekiranya bukan karena (akan berkumpulnya) manusia, niscaya saya melakukan seperti yang telah disebutkan oleh Ibnu Mughaffal dari Nabi shallallahu 'alaihi wasallam.\" Dan telah menceritakannya kepada kami [Yahya bin Habib Al Haritsi] telah menceritakan kepada kami [Khalid bin Harits] -dalam jalur lain- Dan telah menceritakan kepada kami [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [bapakku] ia berkata, telah menceritakan kepada kami [Syu'bah] dengan isnad ini semisalnya. Dan di dalam hadits Khalid bin Harits, ia berkata; \"Di atas kendaraannya yang berjalan, sementara beliau membaca surat Al Fath.\""
            },
            {
                "number": 1244,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَكَانَ رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ وَعِنْدَهُ فَرَسٌ مَرْبُوطٌ بِشَطَنَيْنِ فَتَغَشَّتْهُ سَحَابَةٌ فَجَعَلَتْ تَدُورُ وَتَدْنُو وَجَعَلَ فَرَسُهُ يَنْفِرُ مِنْهَا فَلَمَّا أَصْبَحَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ تِلْكَ السَّكِينَةُ تَنَزَّلَتْ لِلْقُرْآنِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Ishaq] dari [Al Baraa`] ia berkata; Ada seorang laki-laki membaca surat Al Kahfi, sementara di sampingnya terdapat seekor kuda yang terikat dengan dua tali ikatan. Tiba-tiba ia dinaungi oleh gumpalan awan. Awan tersebut kemudian berputar-putar dan mendekat, hingga kuda itu pun lari. Ketika pagi, laki-laki itu mendatangi Nabi shallallahu 'alaihi wasallam dan menuturkan hal itu kepada beliau, maka beliau pun bersabda: \"Itulah As sakinah (ketenangan) yang turun bagi (pembaca) Al Qur`an.\""
            },
            {
                "number": 1245,
                "arab": "و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ الْبَرَاءَ يَقُولُاقَرَأَ رَجُلٌ الْكَهْفَ وَفِي الدَّارِ دَابَّةٌ فَجَعَلَتْ تَنْفِرُ فَنَظَرَ فَإِذَا ضَبَابَةٌ أَوْ سَحَابَةٌ قَدْ غَشِيَتْهُ قَالَ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اقْرَأْ فُلَانُ فَإِنَّهَا السَّكِينَةُ تَنَزَّلَتْ عِنْدَ الْقُرْآنِ أَوْ تَنَزَّلَتْ لِلْقُرْآنِو حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَأَبُو دَاوُدَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ الْبَرَاءَ يَقُولُا فَذَكَرَا نَحْوَهُ غَيْرَ أَنَّهُمَا قَالَا تَنْقُزُ",
                "id": "Dan telah menceritakan kepada kami [Ibnul Mutsanna] dan [Ibnu Basysyar] -sedangkan lafazh dari Ibnul Mutsanna- keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] ia berkata, saya mendengar [Al Baraa`] berkata; Seorang laki-laki membaca surat Al Kahfi, sementara di dalam rumahnya terdapat seekor Kuda. Tiba-tiba kuda itu lari, maka ia pun melihat dan ternyata ada awan yang menaunginya. Maka laki-laki itu pun menuturkan kejadikan itu kepada Nabi shallallahu 'alaihi wasallam. Beliau bersabda: \"Itu adalah As Sakinah (ketenangan) yang turun saat (membaca Al Qur`an) atau untuk (pembaca) Al Qur`an.\" Dan telah menceritakan kepada kami [Ibnul Mutsanna] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dan [Abu Dawud] keduanya berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] ia berkata, saya mendengar [Al Baraa`] berkata. Maka ia pun menyebutkan hadits semisalnya. Hanya saja keduanya mengatakan; \"(Kuda itu) meloncat lari.\""
            },
            {
                "number": 1246,
                "arab": "و حَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَحَجَّاجُ بْنُ الشَّاعِرِ وَتَقَارَبَا فِي اللَّفْظِ قَالَا حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ أَنَّ عَبْدَ اللَّهِ بْنَ خَبَّابٍ حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ حَدَّثَهُأَنَّ أُسَيْدَ بْنَ حُضَيْرٍ بَيْنَمَا هُوَ لَيْلَةً يَقْرَأُ فِي مِرْبَدِهِ إِذْ جَالَتْ فَرَسُهُ فَقَرَأَ ثُمَّ جَالَتْ أُخْرَى فَقَرَأَ ثُمَّ جَالَتْ أَيْضًا قَالَ أُسَيْدٌ فَخَشِيتُ أَنْ تَطَأَ يَحْيَى فَقُمْتُ إِلَيْهَا فَإِذَا مِثْلُ الظُّلَّةِ فَوْقَ رَأْسِي فِيهَا أَمْثَالُ السُّرُجِ عَرَجَتْ فِي الْجَوِّ حَتَّى مَا أَرَاهَا قَالَ فَغَدَوْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ بَيْنَمَا أَنَا الْبَارِحَةَ مِنْ جَوْفِ اللَّيْلِ أَقْرَأُ فِي مِرْبَدِي إِذْ جَالَتْ فَرَسِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَقَرَأْتُ ثُمَّ جَالَتْ أَيْضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَقَرَأْتُ ثُمَّ جَالَتْ أَيْضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ ابْنَ حُضَيْرٍ قَالَ فَانْصَرَفْتُ وَكَانَ يَحْيَى قَرِيبًا مِنْهَا خَشِيتُ أَنْ تَطَأَهُ فَرَأَيْتُ مِثْلَ الظُّلَّةِ فِيهَا أَمْثَالُ السُّرُجِ عَرَجَتْ فِي الْجَوِّ حَتَّى مَا أَرَاهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ الْمَلَائِكَةُ كَانَتْ تَسْتَمِعُ لَكَ وَلَوْ قَرَأْتَ لَأَصْبَحَتْ يَرَاهَا النَّاسُ مَا تَسْتَتِرُ مِنْهُمْ",
                "id": "Dan telah menceritakan kepadaku [Hasan bin Ali Al Hulwani] dan [Hajjaj bin Asy Sya'ir] -kedua lafazhnya hampir sama- keduanya berkata, telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Yazid bin Al Hadi] bahwa [Abdullah bin Khabbab] telah menceritakan kepadanya bahwa [Abu Sa'id Al Khudri] telah menceritakan kepadanya bahwasanya; Pada suatu malam, Usaid bin Hudlair membaca (surat Al Kahfi) di tempat penambatan kudanya. Tiba-tiba kudanya meloncat, ia membaca lagi, dan kuda itupun meloncat lagi. Kemudian ia membaca lagi, dan kuda itu meloncat kembali. Usaid berkata, \"Saya khawatir kuda itu akan menginjak Yahya, maka aku pun berdiri ke arahnya. Ternyata (aku melihat) sepertinya ada Zhullah (sesuatu yang menaungi) di atas kepalaku, di dalamnya terdapat cahaya yang menjulang ke angkasa hingga aku tidak lagi melihatnya. Maka pada pagi harinya, aku menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, semalam saya membaca (Al Qur`an) di tempat penambatan kudaku namun tiba-tiba kudaku meloncat.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bacalah wahai Ibnu Hudlair.\" Kemudian aku pun membacanya lagi, dan kuda itu juga meloncat kembali. Beliau bersabda: \"Bacalah wahai Ibnu Hudlair.\" Kemudian aku pun membacanya lagi, dan kuda itu juga meloncat kembali. Beliau bersabda lagi, \"Bacalah wahai Ibnu Hudlair.\" Ibnu Hudlair berkata; Maka sesudah itu, akhirnya saya beranjak. Saat itu Yahya dekat dengan kuda, maka saya khawatir kuda itu akan menginjaknya. Kemudian saya melihat sesuatu seperti Zhullah (sesuatu yang menaungi) yang di dalamnya terdapat cahaya yang naik ke atas angkasa hingga saya tidak lagi melihatnya. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Itu adalah Malaikat yang sedang menyimak bacaanmu, sekiranya kamu terus membaca, niscaya pada pagi harinya manusia akan melihatnya dan Malaikat itu tidak bisa menutup diri dari pandangan mereka.\""
            },
            {
                "number": 1247,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو كَامِلٍ الْجَحْدَرِيُّ كِلَاهُمَا عَنْ أَبِي عَوَانَةَ قَالَ قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الْأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ مَثَلُ التَّمْرَةِ لَا رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْمُنَافِقِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّو حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ كِلَاهُمَا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ هَمَّامٍ بَدَلَ الْمُنَافِقِ الْفَاجِرِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Kamil Al Jahdari] keduanya dari [Abu 'Awanah] -Qutaibah- berkata telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] dari [Abu Musa Al Asy'ari] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan orang mukmin yang membaca Al Qur`an adalah seperti buah Utrujah, baunya harum dan rasanya juga enak. Dan perumpamaan orang mukmin yang tidak membaca Al Qur`an adalah seperti buah kurma, baunya tidak semerbak, namun rasanya manis. Sedangkan perumpamaan orang munafik yang membaca Al Qur`an adalah laksana buah Raihanah yang baunya harum namun rasanya pahit. Dan perumpamaan orang munafik yang tidak membaca Al Qur`an adalah seperti buah Hanzhalah, baunya tidak wangi dan rasanya juga pahit.\" Dan telah menceritakan kepada kami [Haddab bin Khalid] telah menceritakan kepada kami [Hammam] -dan dalam jalur lain- telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] keduanya dari [Qatadah] dengan isnad ini semisalnya. Hanya saja di dalam hadits Hammam, kata munafik ia ganti dengan Fajir (orang yang berdosa)."
            },
            {
                "number": 1248,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ جَمِيعًا عَنْ أَبِي عَوَانَةَ قَالَ ابْنُ عُبَيْدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَاهِرُ بِالْقُرْآنِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَأُ الْقُرْآنَ وَيَتَتَعْتَعُ فِيهِ وَهُوَ عَلَيْهِ شَاقٌّ لَهُ أَجْرَانِو حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ الدَّسْتَوَائِيِّ كِلَاهُمَا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ و قَالَ فِي حَدِيثِ وَكِيعٍ وَالَّذِي يَقْرَأُ وَهُوَ يَشْتَدُّ عَلَيْهِ لَهُ أَجْرَانِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin Ubaid Al Ghubari] semuanya dari [Abu 'Awanah] - [Ibnu Ubaid] - berkata, telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari ['Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang mukmin yang mahir membaca Al Qur`an, maka kedudukannya di akhirat ditemani oleh para malaikat yang mulia. Dan orang yang membaca Al Qur`an dengan gagap, ia sulit dalam membacanya, maka ia mendapat dua pahala.\" Dalam jalur lain; telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Sa'id] dan diganti dengan jalur periwayatan lain, dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Hisyam Ad Dastawa`i] keduanya dari [Qatadah] dengan isnad ini. Dan ia berkata dalam haditsnya Waki'; \"Dan orang yang membaca Al Qur`an sedang ia kesulitan dalam membacanya, maka baginya dua pahala.\""
            },
            {
                "number": 1249,
                "arab": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأُبَيٍّ إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ قَالَ آللَّهُ سَمَّانِي لَكَ قَالَ اللَّهُ سَمَّاكَ لِي قَالَ فَجَعَلَ أُبَيٌّ يَبْكِي",
                "id": "Telah menceritakan kepada kami [Haddab bin Khalid] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ubay: \"Sesungguhnya Allah telah memerintahkan kepadaku untuk membacakan kepadamu.\" Ubay bertanya, \"Apakah Allah menyebut namaku kepada Anda?\" beliau menjawab: \"Ya, Allah menyebut namamu kepadaku.\" Maka Ubay pun menangis karenanya."
            },
            {
                "number": 1250,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيِّ بْنِ كَعْبٍ إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ لَمْ يَكُنْ الَّذِينَ كَفَرُوا قَالَ وَسَمَّانِي لَكَ قَالَ نَعَمْ قَالَ فَبَكَىحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًا يَقُولُا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيٍّ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Qatadah] menceritakan dari [Anas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ubay bin Ka'ab: \"Allah memerintahkan kepadaku untuk membacakan kepadamu, 'LAM YAKUNILLADZIINA KAFARUU..' (surat Al Bayyinah).\" Ubay bertanya, \"Apakah Allah menyebut namaku kepada Anda?\" beliau menjawab: \"Ya.\" Maka Ubay pun menangis karenanya. Telah menceritakan kepada kami [Yahya bin Habib Al Haritsi] telah menceritakan kepada kami [Khalid] yakni Ibnul Harits, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] ia berkata, saya mendengar [Anas] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ubay. Dengan hadits semisalnya."
            },
            {
                "number": 1251,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ حَفْصٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ عَنْ عَبْدِ اللَّهِ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ عَلَيَّ الْقُرْآنَ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ إِنِّي أَشْتَهِي أَنْ أَسْمَعَهُ مِنْ غَيْرِي فَقَرَأْتُ النِّسَاءَ حَتَّى إِذَا بَلَغْتُ{ فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدًا }رَفَعْتُ رَأْسِي أَوْ غَمَزَنِي رَجُلٌ إِلَى جَنْبِي فَرَفَعْتُ رَأْسِي فَرَأَيْتُ دُمُوعَهُ تَسِيلُحَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ وَمِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ جَمِيعًا عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَزَادَ هَنَّادٌ فِي رِوَايَتِهِ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ اقْرَأْ عَلَيَّ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] semuanya dari [Hafsh] -[Abu Bakr]- berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Al A'masy] dari [Ibrahim] dari [Abidah] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Bacakanlah Al Qur`an kepadaku.\" Abdullah berkata; saya bertanya, \"Wahai Rasulullah, apakah saya membacakannya kepada Anda, sementara Al Qur`an diturunkan kepada Anda?\" beliau bersabda: \"Saya suka untuk mendengarnya dari orang lain.\" Maka saya pun membaca surat An Nisa`, hingga (bacaanku) sampai pada ayat: \"Dan kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu).\" Aku mengangkat kepalaku -atau- seorang laki-laki datang ke sampingku, dan aku pun mengangkat kepala, maka aku melihat air mata beliau menetes. Telah menceritakan kepada kami [Hannad bin As Sariy] dan [Mindab bin Harits At Tamimi] semuanya dari [Ali bin Mushir] dari [Al A'masy] dengan isnad ini. Hannad menambahkan dalam riwayatnya; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku sementara beliau berada di atas mimbar: \"Bacakanlah (Al Qur`an) untukku.\""
            },
            {
                "number": 1252,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنِي مِسْعَرٌ وَقَالَ أَبُو كُرَيْبٍ عَنْ مِسْعَرٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ إِبْرَاهِيمَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ اقْرَأْ عَلَيَّ قَالَ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي قَالَ فَقَرَأَ عَلَيْهِ مِنْ أَوَّلِ سُورَةِ النِّسَاءِ إِلَى قَوْلِهِ{ فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدًا }فَبَكَىقَالَ مِسْعَرٌ فَحَدَّثَنِي مَعْنٌ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهِيدًا عَلَيْهِمْ مَا دُمْتُ فِيهِمْ أَوْ مَا كُنْتُ فِيهِمْ شَكَّ مِسْعَرٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepadaku [Mis'ar] - [Abu Kuraib] - berkata, dari [Mis'ari] dari [Amru bin Murrah] dari [Ibrahim] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda kepada [Abdullah bin Mas'ud]: \"Bacakanlah Al Qur`an kepadaku.\" Abdullah bertanya, \"Apakah saya akan membacakannya kepada Anda, sementara Al Qur`an diturunkan kepada Anda?\" beliau bersabda: \"Saya suka untuk mendengarnya dari orang lain.\" Maka Abdullah bin Mas'ud pun membaca ayat pertama surat An Nisa` hingga ayat: \"Maka bagaimanakah (halnya orang kafir nanti), apabila kami mendatangkan seseorang saksi (rasul) dari tiap-tiap umat dan kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu).\" Maka beliau pun menangis. [Mis'ar] berkata; telah menceritakan kepadaku [Ma'n] dari [Ja'far bin Amru bin Huraits] dari [bapaknya] dari [Ibnu Mas'ud] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda kepada: \"(Saya) menjadi saksi, selama aku hidup di tengah-tengah mereka. -atau- selama aku masih berada di tengah-tengah mereka.\" Mis'ar ragu (diantara dua pernyataan tersebut)."
            },
            {
                "number": 1253,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ كُنْتُ بِحِمْصَ فَقَالَ لِي بَعْضُ الْقَوْمِ اقْرَأْ عَلَيْنَا فَقَرَأْتُ عَلَيْهِمْ سُورَةَ يُوسُفَ قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ وَاللَّهِ مَا هَكَذَا أُنْزِلَتْ قَالَقُلْتُ وَيْحَكَ وَاللَّهِ لَقَدْ قَرَأْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي أَحْسَنْتَفَبَيْنَمَا أَنَا أُكَلِّمُهُ إِذْ وَجَدْتُ مِنْهُ رِيحَ الْخَمْرِ قَالَ فَقُلْتُ أَتَشْرَبُ الْخَمْرَ وَتُكَذِّبُ بِالْكِتَابِ لَا تَبْرَحُ حَتَّى أَجْلِدَكَ قَالَ فَجَلَدْتُهُ الْحَدَّ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ جَمِيعًا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ فَقَالَ لِي أَحْسَنْتَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata; Saya berada di Himsh, lalu salah seorang dari suatu kaum berkata kepadaku, \"Bacakanlah Al Qur`an kepada kami.\" Maka aku pun membacakan surat Yusuf kepada mereka. Lalu salah seorang dari mereka berkata, \"Demi Allah, tidaklah seperti itu (bacaannya) ayat ini diturunkan. Abdullah berkata; Saya berkata, \"Celaka kamu, demi Allah, sungguh, saya telah membacakannya kepada Rasulullah shallallahu 'alaihi wasallam lalu beliau bersabda kepadaku: 'Kamu telah membacanya dengan benar.'\" Di tengah-tengah pembicaraanku, saya mencium aroma khamer darinya, maka saya pun bertanya, \"Apakah kamu meminum khamer lalu mendustakan kitab? Kamu tidak boleh meninggalkan tempat ini hingga saya menderamu.\" Akhirnya aku pun menegakkan had atasnya. Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ali bin Khasyram] keduanya berkata, telah mengabarkan kepada kami [Isa bin Yunus] -dalam jalur lain- Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Mu'awiyah] semuanya dari [Al A'masy] dengan isnad ini, dan di dalam hadits Mu'awiyah tidak tercantum; \"Lalu beliau bersabda kepadaku: 'AHSANTA (kamu telah membacanya dengan benar).'\""
            },
            {
                "number": 1254,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُحِبُّ أَحَدُكُمْ إِذَا رَجَعَ إِلَى أَهْلِهِ أَنْ يَجِدَ فِيهِ ثَلَاثَ خَلِفَاتٍ عِظَامٍ سِمَانٍ قُلْنَا نَعَمْ قَالَ فَثَلَاثُ آيَاتٍ يَقْرَأُ بِهِنَّ أَحَدُكُمْ فِي صَلَاتِهِ خَيْرٌ لَهُ مِنْ ثَلَاثِ خَلِفَاتٍ عِظَامٍ سِمَانٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Sa'id Al Asyaj] keduanya berkata, telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah salah seorang dari kalian suka, bila ia kembali kepada isterinya akan mendapatkan tiga ekor unta yang sedang bunting lagi gemuk-gemuk?\" kami menjawab, \"Ya.\" Beliau bersabda: \"Tiga ayat yang dibaca oleh salah seorang dari kalian di dalam sholatnya adalah lebih baik daripada ketiga ekor unta yang bunting dan gemuk itu.\""
            },
            {
                "number": 1255,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ عَنْ مُوسَى بْنِ عُلَيٍّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي الصُّفَّةِ فَقَالَ أَيُّكُمْ يُحِبُّ أَنْ يَغْدُوَ كُلَّ يَوْمٍ إِلَى بُطْحَانَ أَوْ إِلَى الْعَقِيقِ فَيَأْتِيَ مِنْهُ بِنَاقَتَيْنِ كَوْمَاوَيْنِ فِي غَيْرِ إِثْمٍ وَلَا قَطْعِ رَحِمٍ فَقُلْنَا يَا رَسُولَ اللَّهِ نُحِبُّ ذَلِكَ قَالَ أَفَلَا يَغْدُو أَحَدُكُمْ إِلَى الْمَسْجِدِ فَيَعْلَمُ أَوْ يَقْرَأُ آيَتَيْنِ مِنْ كِتَابِ اللَّهِ عَزَّ وَجَلَّ خَيْرٌ لَهُ مِنْ نَاقَتَيْنِ وَثَلَاثٌ خَيْرٌ لَهُ مِنْ ثَلَاثٍ وَأَرْبَعٌ خَيْرٌ لَهُ مِنْ أَرْبَعٍ وَمِنْ أَعْدَادِهِنَّ مِنْ الْإِبِلِ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Al Fadlu bin Dukain] dari [Musa bin Ulay] ia berkata, saya mendengar [bapakku] menceritakan dari [Uqbah bin Amir] ia berkata; Rasulullah shallallahu 'alaihi wasallam keluar sementara kami sedang berada di Shuffah (tempat berteduhnya para Fuqara dari kalangan muhajirin), kemudian beliau bertanya: \"Siapakah di antara kalian yang suka pergi ke Buthhan atau ke Aqiq, lalu ia pulang dengan membawa dua ekor unta yang gemuk-gemuk dengan tanpa membawa dosa dan tidak pula memutuskan silaturahmi?\" Maka kami pun menjawab, \"Kami semua menyukai hal itu.\" beliau melanjutkan sabdanya: \"Sungguh, salah seorang dari kalian pergi ke masjid lalu ia mempelajari atau membaca dua ayat dari kitabullah 'azza wajalla adalah lebih baik baginya daripada dua unta. Tiga (ayat) lebih baik dari tiga ekot unta, empat ayat lebih baik daripada empat ekor unta. Dan berapa pun jumlah unta.\""
            },
            {
                "number": 1256,
                "arab": "حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو تَوْبَةَ وَهُوَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ عَنْ زَيْدٍ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ يَقُولُ حَدَّثَنِي أَبُو أُمَامَةَ الْبَاهِلِيُّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اقْرَءُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ اقْرَءُوا الزَّهْرَاوَيْنِ الْبَقَرَةَ وَسُورَةَ آلِ عِمْرَانَ فَإِنَّهُمَا تَأْتِيَانِ يَوْمَ الْقِيَامَةِ كَأَنَّهُمَا غَمَامَتَانِ أَوْ كَأَنَّهُمَا غَيَايَتَانِ أَوْ كَأَنَّهُمَا فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ تُحَاجَّانِ عَنْ أَصْحَابِهِمَا اقْرَءُوا سُورَةَ الْبَقَرَةِ فَإِنَّ أَخْذَهَا بَرَكَةٌ وَتَرْكَهَا حَسْرَةٌ وَلَا تَسْتَطِيعُهَا الْبَطَلَةُقَالَ مُعَاوِيَةُ بَلَغَنِي أَنَّ الْبَطَلَةَ السَّحَرَةُ و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ حَدَّثَنَا مُعَاوِيَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ وَكَأَنَّهُمَا فِي كِلَيْهِمَا وَلَمْ يَذْكُرْ قَوْلَ مُعَاوِيَةَ بَلَغَنِي",
                "id": "Telah menceritakan kepadaku [Al Hasan bin Ali Al Hulwani] telah menceritakan kepada kami [Abu Taubah] ia adalah Ar Rabi' bin Nafi', telah menceritakan kepada kami [Mu'awiyah] yakni Ibnu Sallam, dari [Zaid] bahwa ia mendengar [Abu Sallam] berkata, telah menceritakan kepadaku [Abu Umamah Al Bahili] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bacalah Al Qur`an, karena ia akan datang memberi syafa'at kepada para pembacanya pada hari kiamat nanti. Bacalah Zahrawain, yakni surat Al Baqarah dan Ali Imran, karena keduanya akan datang pada hari kiamat nanti, seperti dua tumpuk awan menaungi pembacanya, atau seperti dua kelompok burung yang sedang terbang dalam formasi hendak membela pembacanya. Bacalah Al Baqarah, karena dengan membacanya akan memperoleh barokah, dan dengan tidak membacanya akan menyebabkan penyesalan, dan pembacanya tidak dapat dikuasai (dikalahkan) oleh tukang-tukang sihir.\" Mu'awiyah berkata; \"Telah sampai (khabar) kepadaku bahwa, Al Bathalah adalah tukang-tukang sihir.\" Dan telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Yahya] yakni Ibnu Hassan, Telah menceritakan kepada kami [Mu'awiyah] dengan isnad ini, hanya saja ia mentatakan; \"Wa Ka`annahumaa fii Kilaihimaa.\" dan ia tidak menyebutkan ungkapan Mu'awiyah, \"Telah sampai (khabar) padaku.\""
            },
            {
                "number": 1257,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ مُهَاجِرٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجُرَشِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ قَالَ سَمِعْتُ النَّوَّاسَ بْنَ سَمْعَانَ الْكِلَابِيَّ يَقُولُاسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُؤْتَى بِالْقُرْآنِ يَوْمَ الْقِيَامَةِ وَأَهْلِهِ الَّذِينَ كَانُوا يَعْمَلُونَ بِهِ تَقْدُمُهُ سُورَةُ الْبَقَرَةِ وَآلُ عِمْرَانَ وَضَرَبَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ أَمْثَالٍ مَا نَسِيتُهُنَّ بَعْدُ قَالَ كَأَنَّهُمَا غَمَامَتَانِ أَوْ ظُلَّتَانِ سَوْدَاوَانِ بَيْنَهُمَا شَرْقٌ أَوْ كَأَنَّهُمَا حِزْقَانِ مِنْ طَيْرٍ صَوَافَّ تُحَاجَّانِ عَنْ صَاحِبِهِمَا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Yazid bin Abdu Rabbih] telah menceritakan kepada kami [Al Walid bin Muslim] dari [Muhammad bin Muhajir] dari [Al Walid bin Abdurrahman Al Jurasyi] dari [Jubair bin Nufair] ia berkata, saya mendengar [An Nawwas bin Sam'an Al Kilabi] berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Al Qur`an akan didatangkan pada hari kiamat bersama Ahlinya yang telah beramal dengannya, dan yang pertama kali adalah surat Al Baqarah dan Ali Imran.\" Kemudian Rasulullah shallallahu 'alaihi wasallam memberikan tiga permisalan terkait dengan keduanya, aku tidak akan melupakannya setelah itu. yakni: \"Seperti dua tumpuk awan hitam yang diantara keduanya terdapat cahaya, atau seperti dua kelompok burung yang sedang terbang dalam formasi hendak membela pembacanya.\""
            },
            {
                "number": 1258,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ وَأَحْمَدُ بْنُ جَوَّاسٍ الْحَنْفِيُّ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَمَّارِ بْنِ رُزَيْقٍ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَبَيْنَمَا جِبْرِيلُ قَاعِدٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ نَقِيضًا مِنْ فَوْقِهِ فَرَفَعَ رَأْسَهُ فَقَالَ هَذَا بَابٌ مِنْ السَّمَاءِ فُتِحَ الْيَوْمَ لَمْ يُفْتَحْ قَطُّ إِلَّا الْيَوْمَ فَنَزَلَ مِنْهُ مَلَكٌ فَقَالَ هَذَا مَلَكٌ نَزَلَ إِلَى الْأَرْضِ لَمْ يَنْزِلْ قَطُّ إِلَّا الْيَوْمَ فَسَلَّمَ وَقَالَ أَبْشِرْ بِنُورَيْنِ أُوتِيتَهُمَا لَمْ يُؤْتَهُمَا نَبِيٌّ قَبْلَكَ فَاتِحَةُ الْكِتَابِ وَخَوَاتِيمُ سُورَةِ الْبَقَرَةِ لَنْ تَقْرَأَ بِحَرْفٍ مِنْهُمَا إِلَّا أُعْطِيتَهُ",
                "id": "Telah menceritakan kepada kami [Hasan bin Rabi'] dan [Ahmad bin Jawwas Al Hanfi] keduanya berkata, telah menceritakan kepada kami [Abul Ahwash] dari [Ammar bin Ruzaiq] dari [Abdullah bin Isa] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata; Ketika malaikat Jibril sedang duduk di samping Nabi shallallahu 'alaihi wasallam tiba-tiba ia mendengar suara pintu dibuka dari arah atas kepalanya. Lalu malaikat Jibril berkata: \"Itu adalah suara salah satu pintu langit yang dibuka, sebelumnya ia belum pernah dibuka sama sekali kecuali pada hari ini.\" Lalu keluarlah daripadanya malaikat. Jibril berkata: \"Ini adalah malaikat yang hendak turun ke bumi, sebelumnya ia belum pernah turun ke bumi sama sekali kecuali pada hari ini saja.\" Lalu ia memberi salam dan berkata: \"Bergembiralah atas dua cahaya yang diberikan kepadamu dan belum pernah diberikan kepada seorang Nabipun sebelummu, yaitu pembuka Al Kitab (surat Al Fatihah) dan penutup surat Al Baqarah. Tidaklah kamu membaca satu huruf dari kedua surat itu kecuali pasti akan diberikan kepadamu.\""
            },
            {
                "number": 1259,
                "arab": "و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ لَقِيتُ أَبَا مَسْعُودٍ عِنْدَ الْبَيْتِفَقُلْتُ حَدِيثٌ بَلَغَنِي عَنْكَ فِي الْآيَتَيْنِ فِي سُورَةِ الْبَقَرَةِ فَقَالَ نَعَمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْآيَتَانِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ مَنْ قَرَأَهُمَا فِي لَيْلَةٍ كَفَتَاهُو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ كِلَاهُمَا عَنْ مَنْصُورٍ بِهَذَا الْإِسْنَادِ",
                "id": "Dan telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Manshur] dari [Ibrahim] dari [Abdurrahman bin Yazid] ia berkata; Saya menjumpai [Abu Mas'ud] di Baitullah, maka saya pun berkata, \"Ada satu hadits dari Anda yang telah sampai kepadaku tentang dua ayat yang terdapat di dalam surat Al Baqarah.\" Abu Mas'ud berkata; Ya, Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Siapa yang membaca kedua ayat itu, yakni akhir dari surat Al Baqarah, niscaya keduanya akan memeliharanya dari bencana.\" Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] keduanya dari [Manshur] dengan isnad ini."
            },
            {
                "number": 1260,
                "arab": "و حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ أَخْبَرَنَا ابْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَلْقَمَةَ بْنِ قَيْسٍ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ هَاتَيْنِ الْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُقَالَ عَبْدُ الرَّحْمَنِ فَلَقِيتُ أَبَا مَسْعُودٍ وَهُوَ يَطُوفُ بِالْبَيْتِ فَسَأَلْتُهُ فَحَدَّثَنِي بِهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و حَدَّثَنِي عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ جَمِيعًا عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ وَعَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصٌ وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Dan telah menceritakan kepada kami [Minjab bin Harits At Tamimi] telah mengabarkan kepada kami [Ibnu Mushir] dari [Al A'masy] dari [Ibrahim] dari [Abdurrahman bin Yazid] dari [Alqamah bin Qais] dari [Abu Mas'ud Al Anshari] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membaca dua ayat ini, yakni dari akhir surat Al Baqarah di suatu malam, maka keduanya akan menjaganya dari bencana.\" Abdurrahman berkata; Saya menjumpai Abu Mas'ud yang sedang melakukan thawaf di Baitullah, maka saya bertanya kepadanya. Maka ia pun menceritakannya kepadaku dari Nabi shallallahu 'alaihi wasallam. Dan telah menceritakan kepadaku [Ali bin Khasyram] telah mengabarkan kepada kami [Isa] yakni Ibnu Yunus. -dalam jalur lain- Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] semuanya dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dan [Abdurrahman bin Yazid] dari [Abu Mas'ud] dari Nabi shallallahu 'alaihi wasallam semisalnya. -dalam jalur lain- Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Hafsh] dan [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Abdurrahman bin Yazid] dari [Abu Mas'ud] dari Nabi shallallahu 'alaihi wasallam semisalnya."
            },
            {
                "number": 1261,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ الْغَطَفَانِيِّ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ عَنْ أَبِي الدَّرْدَاءِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَفِظَ عَشْرَ آيَاتٍ مِنْ أَوَّلِ سُورَةِ الْكَهْف عُصِمَ مِنْ الدَّجَّالِو حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا هَمَّامٌ جَمِيعًا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ قَالَ شُعْبَةُ مِنْ آخِرِ الْكَهْفِ و قَالَ هَمَّامٌ مِنْ أَوَّلِ الْكَهْف كَمَا قَالَ هِشَامٌ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [bapakku] dari [Qatadah] dari [Salim bin Abul Ja'd Al Ghathafani] dari [Ma'dan bin Abu Thalhah Al Ya'mari] dari [Abu Darda`] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa yang menghafal sepuluh ayat dari awal surat Al Kahfi, maka ia akan terpelihara dari (kejahatan) Dajjall.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] -dalam jalur lain- Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Hammam] semuanya dari [Qatadah] dengan isnad ini. Syu'bah berkata; \"Dari akhir surat Al Kahfi.\" Hammam berkata; \"Dari awal surat Al Kahfi.\" Sebagaimana yang dikatakan Hisyam."
            },
            {
                "number": 1262,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى عَنْ الْجُرَيْرِيِّ عَنْ أَبِي السَّلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ الْأَنْصَارِيِّ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَقَالَ رَسُولُ اللَّهِ يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَيُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَكَ أَعْظَمُ قَالَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَيُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَكَ أَعْظَمُ قَالَ قُلْتُ{ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ }قَالَ فَضَرَبَ فِي صَدْرِي وَقَالَ وَاللَّهِ لِيَهْنِكَ الْعِلْمُ أَبَا الْمُنْذِرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la bin Abdul A'la] dari [Al Jurairi] dari [Abu As Salil] dari [Abdullah bin Rabah Al Anshari] dari [Ubay bin Ka'ab] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hai Abu Mundzir! tahukah kamu, ayat manakah di antara ayat-ayat Al Qur`an yang ada padamu yang paling utama?\" Abu Mundzir berkata; saya menjawab, \"Allah dan Rasul-Nya yang lebih mengetahui.\" Beliau bertanya lagi: \"Hai Abu Mundzir, tahukah kamu, ayat manakah di antara ayat-ayat Al Qur`an yang ada padamu yang paling utama?\" Abu Mundzir berkata; Saya menjawab, \"ALLAHU LAA ILAAHA ILLAA HUWAL HAYYUL QAYYUUM.\" Abu Mundzir berkata; lalu beliau menepuk dadaku seraya bersabda: \"Demi Allah, semoga dadamu dipenuhi dengan ilmu, wahai Abu Mundzir.\""
            },
            {
                "number": 1263,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَ زُهَيْرٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيَعْجِزُ أَحَدُكُمْ أَنْ يَقْرَأَ فِي لَيْلَةٍ ثُلُثَ الْقُرْآنِ قَالُوا وَكَيْفَ يَقْرَأْ ثُلُثَ الْقُرْآنِ قَالَ قُلْ هُوَ اللَّهُ أَحَدٌ تَعْدِلُ ثُلُثَ الْقُرْآنِو حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ الْعَطَّارُ جَمِيعًا عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِمَا مِنْ قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ جَزَّأَ الْقُرْآنَ ثَلَاثَةَ أَجْزَاءٍ فَجَعَلَ قُلْ هُوَ اللَّهُ أَحَدٌ جُزْءًا مِنْ أَجْزَاءِ الْقُرْآنِ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] dan [Muhammad bin Basysyar] - [Zuhair] berkata- telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] dari [Qatadah] dari [Salim bin Abul Ja'd] dari [Ma'dan bin Abu Thalhah] dari [Abu Darda`] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak sanggupkah salah seorang dari kalian membaca sepertiga Al Qur`an dalam semalam?\" Mereka balik bertanya, \"Bagaimana cara membaca sepertiganya?\" Nabi shallallahu 'alaihi wasallam menjawab: \"'QUL HUWALLAHU AHAD' (surat Al Ikhlash) sama dengan sepertiga Al Qur`an.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Muhammad bin Bakr] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] -dalam jalur lain- Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Aban Al Aththar] semuanya dari [Qatadah] dengan isnad ini. Dan di dalam hadits keduanya adalah dari sabda Nabi shallallahu 'alaihi wasallam: \"Sesungguhnya Allah 'azza wajalla menjadikan Al Qur`an itu tiga bagian. Lalu Dia menjadikan, 'QUL HUWALLAHU AHAD.' Sebagai satu bagian dari bagian-bagian Al Qur`an.\""
            },
            {
                "number": 1264,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ يَحْيَى قَالَ ابْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ حَدَّثَنَا أَبُو حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْشُدُوا فَإِنِّي سَأَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ فَحَشَدَ مَنْ حَشَدَ ثُمَّ خَرَجَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ ثُمَّ دَخَلَ فَقَالَ بَعْضُنَا لِبَعْضٍ إِنِّي أُرَى هَذَا خَبَرٌ جَاءَهُ مِنْ السَّمَاءِ فَذَاكَ الَّذِي أَدْخَلَهُ ثُمَّ خَرَجَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي قُلْتُ لَكُمْ سَأَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ أَلَا إِنَّهَا تَعْدِلُ ثُلُثَ الْقُرْآنِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] dan [Ya'qub bin Ibrahim] semuanya dari [Yahya] - [Ibnu Hatim] - berkata; telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Yazid bin Kaisan] telah menceritakan kepada kami [Abu Hazim] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berkumpullah kamu semuanya, karena aku akan membacakan kepada kalian sepertiga Al Qur`an.\" Maka berkumpullah kami, yang sempat berkumpul, kemudian Nabi shallallahu 'alaihi wasallam keluar dan membaca: \"QUL HUWALLAHU AHAD.\" Setelah itu, beliau masuk kembali. Maka kami saling berkata satu sama lain.\"Aku mengira bahwa wahyu ini baru diturunkan dari langit, sehingga Nabi shallallahu 'alaihi wasallam segera masuk ke dalam kamarnya.\" Tak berapa lama kemudian Nabi shallallahu 'alaihi wasallam keluar seraya bersabda: \"Tadi aku berjanji akan membacakan sepertiga Al Qur`an kepada kalian. Ketahuilah bahwa, 'QUL HUWALLAHU AHAD' adalah sama nilainya dengan sepertiga Al Qur`an.\""
            },
            {
                "number": 1265,
                "arab": "و حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ بَشِيرٍ أَبِي إِسْمَعِيلَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ فَقَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ حَتَّى خَتَمَهَا",
                "id": "Dan telah menceritakan kepada kami [Washil bin Abdul A'la] telah menceritakan kepada kami [Ibnu Fudlail] dari [Basyir bin Abu Isma'il] dari [Abu Hazim] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam keluar dan bersa bda: \"Saya akan membacakan kepada kalian (surat yang menyamai) sepertiga Al Qur`an.\" Maka beliau pun membaca: \"QUL HUWALLAHU AHAD.\" Beliau membacanya hingga selesai."
            },
            {
                "number": 1266,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ أَنَّ أَبَا الرِّجَالِ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ أُمِّهِ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ وَكَانَتْ فِي حَجْرِ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ رَجُلًا عَلَى سَرِيَّةٍ وَكَانَ يَقْرَأُ لِأَصْحَابِهِ فِي صَلَاتِهِمْ فَيَخْتِمُ بِقُلْ هُوَ اللَّهُ أَحَدٌ فَلَمَّا رَجَعُوا ذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَلُوهُ لِأَيِّ شَيْءٍ يَصْنَعُ ذَلِكَ فَسَأَلُوهُ فَقَالَ لِأَنَّهَا صِفَةُ الرَّحْمَنِ فَأَنَا أُحِبُّ أَنْ أَقْرَأَ بِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبِرُوهُ أَنَّ اللَّهَ يُحِبُّهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdurrahman bin Wahb] telah menceritakan kepada kami pamanku yaitu [Abdullah bin Wahb], telah menceritakan kepada kami [Amru bin Harits] dari [Sa'id bin Abu Hilal] bahwa [Abu Rijal] Muhammad bin Abdurrahman, telah menceritakan kepadanya dari ibunya [Amrah binti Abdurrahman], saat itu ia berada di rumah Aisyah, isteri Nabi shallallahu 'alaihi wasallam, dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam mengutus seorang lelaki dalam suatu sariyyah (pasukan khusus yang ditugaskan untuk operasi tertentu). Laki-laki tersebut ketika menjadi imam sholat bagi para sahabatnya selalu mengakhiri bacaan suratnya dengan \"QUL HUWALLAHU AHAD.\" Ketika mereka pulang, disampaikan berita tersebut kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau bersabda: \"Tanyakanlah kepadanya kenapa ia melakukan hal itu?\" Lalu merekapun menanyakan kepadanya. Ia menjawab, \"Karena didalamnya terdapat sifat Ar Rahman, dan aku senang untuk selalu membacanya.\" Mendengar itu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Beritahukanlah kepadanya bahwa Allah Ta'ala juga mencintainya.\""
            },
            {
                "number": 1267,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ بَيَانٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَمْ تَرَ آيَاتٍ أُنْزِلَتْ اللَّيْلَةَ لَمْ يُرَ مِثْلُهُنَّ قَطُّ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ وَقُلْ أَعُوذُ بِرَبِّ النَّاسِ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Bayan] dari [Qais bin Abu Hazim] dari [Uqbah bin Amir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah kalian lihat beberapa ayat yang diturunkah semalam, belum ada ayat yang serupa dengannya. Yaitu; 'QUL A'UUDZU BIRABBIL FALAQ dan QUL A'UUDZU BIRABBINNAAS' (surat Al Falaq dan An Nas)."
            },
            {
                "number": 1268,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا إِسْمَعِيلُ عَنْ قَيْسٍ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُنْزِلَ أَوْ أُنْزِلَتْ عَلَيَّ آيَاتٌ لَمْ يُرَ مِثْلُهُنَّ قَطُّ الْمُعَوِّذَتَيْنِو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ كِلَاهُمَا عَنْ إِسْمَعِيلَ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَفِي رِوَايَةِ أَبِي أُسَامَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ وَكَانَ مِنْ رُفَعَاءِ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [bapakku] dari [Isma'il] dari [Qais] dari [Uqbah bin Amir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Telah diturunkan kepadaku beberapa ayat yang belum pernah ada ayat yang menyerupainya. Yaitu Al Mu'awwidzatain (surat Al Falaq dan An Nas).\" Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Waki'] -dalam jalur lain- Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abu Usamah] keduanya dari [Isma'il] dengan isnad ini semisalnya. Dan dalam riwayat Abu Usamah dari Uqbah bin Amir Al Juhani. Dan ia dalah termasuk salah seorang yang 'arif dari kalangan sahabat Muhammad shallallahu 'alaihi wasallam."
            },
            {
                "number": 1269,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ كُلُّهُمْ عَنْ ابْنِ عُيَيْنَةَ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهُوَ يَقُومُ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَهُوَ يُنْفِقُهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Amru An Naqid] dan [Zuhair bin Harb] semuanya dari [Ibnu Uyainah] -[Zuhair]- berkata; Telah menceritakan kepada kami [Sufyan bin Uyainah] Telah menceritakan kepada kami [Az Zuhri] dari [Salim] dari [bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak boleh dengki kecuali pada dua hal. (Pertama) kepada seorang yang telah diberi Allah (hafalan) Al Qur`an, sehingga ia membacanya siang dan malam. (Kedua) kepada seorang yang dikaruniakan Allah harta kekayaan, lalu dibelanjakannya harta itu siang dan malam (di jalan Allah), \""
            },
            {
                "number": 1270,
                "arab": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَسَدَ إِلَّا عَلَى اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ هَذَا الْكِتَابَ فَقَامَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَتَصَدَّقَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata, telah mengabarkan kepadaku [Salim bin Abdullah bin Umar] dari [bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh dengki kecuali pada dua hal. (Pertama) kepada seorang yang telah diberi Allah (hafalan) Al Qur`an, hingga ia membacanya siang dan malam. (Kedua) kepada seorang yang dikaruniakan Allah harta kekayaan, lalu dibelanjakannya harta itu siang dan malam (di jalan Allah), \""
            },
            {
                "number": 1271,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَعِيلَ عَنْ قَيْسٍ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ عَنْ قَيْسٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَسَدَ إِلَّا فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالًا فَسَلَّطَهُ عَلَى هَلَكَتِهِ فِي الْحَقِّ وَرَجُلٌ آتَاهُ اللَّهُ حِكْمَةً فَهُوَ يَقْضِي بِهَا وَيُعَلِّمُهَا",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Isma'il] dari [Qais] ia berkata, [Abdullah bin Mas'ud] berkata; -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] dan [Muhammad bin Bisyr] keduanya berkata, telah menceritakan kepada kami [Isma'il] dari [Qais] ia berkata, aku mendengar [Abdullah bin Mas'ud] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh hasad (dengki) kecuali pada dua hal. (Pertama) kepada seorang yang dikaruniakan Allah harta kekayaan, lalu ia membelanjakannya dalam kebenaran. (Dan yang kedua) kepada seorang laki-laki yang diberi Allah hikmah (ilmu), hingga ia memberi keputusan dengannya dan juga mengajarkannya.\""
            },
            {
                "number": 1272,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنِي أَبِي عَنْ ابْنِ شِهَابٍ عَنْ عَامِرِ بْنِ وَاثِلَةَ أَنَّ نَافِعَ بْنَ عَبْدِ الْحَارِثِ لَقِيَ عُمَرَ بِعُسْفَانَ وَكَانَ عُمَرُ يَسْتَعْمِلُهُ عَلَى مَكَّةَ فَقَالَ مَنْ اسْتَعْمَلْتَ عَلَى أَهْلِ الْوَادِي فَقَالَ ابْنَ أَبْزَى قَالَ وَمَنْ ابْنُ أَبْزَى قَالَ مَوْلًى مِنْ مَوَالِينَا قَالَ فَاسْتَخْلَفْتَ عَلَيْهِمْ مَوْلًى قَالَ إِنَّهُ قَارِئٌ لِكِتَابِ اللَّهِ عَزَّ وَجَلَّ وَإِنَّهُ عَالِمٌ بِالْفَرَائِضِقَالَ عُمَرُ أَمَا إِنَّ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ قَالَ إِنَّ اللَّهَ يَرْفَعُ بِهَذَا الْكِتَابِ أَقْوَامًا وَيَضَعُ بِهِ آخَرِينَو حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ وَأَبُو بَكْرِ بْنُ إِسْحَقَ قَالَا أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي عَامِرُ بْنُ وَاثِلَةَ اللَّيْثِيُّ أَنَّ نَافِعَ بْنَ عَبْدِ الْحَارِثِ الْخُزَاعِيَّ لَقِيَ عُمَرَ بْنَ الْخَطَّابِ بِعُسْفَانَ بِمِثْلِ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ الزُّهْرِيِّ",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepadaku [bapakku] dari [Ibnu Syihab] dari [Amir bin Watsilah] bahwasanya; Nafi' bin Abdul Harits, pada suatu ketika bertemu dengan Khalifah [Umar] di 'Usfan. Ketika itu, Nafi' bertugas sebagai pejabat di kota Makkah. Umar bertanya kepada Nafi', \"Siapa yang Anda angkat sebagai kepala bagi penduduk Wadli?\" Nafi' menjawab, \"Ibnu Abza.\" Umar bertanya lagi, \"Siapakah itu Ibnu Abza?\" Nafi' menjawab, \"Salah seorang Maula (budak yang telah dimerdekakan) di antara beberapa Maula kami.\" Umar bertanya, \"Kenapa Maula yang diangkat?\" Nafi' menjawab, \"Karena ia adalah seorang yang pintar tentang Kitabullah dan pandai tentang ilmu fara`idl (ilmu tentang pembagian harta warisan).\" Umar berkata, \"Benar, Nabi kalian shallallahu 'alaihi wasallam telah bersabda: 'Sesungguhnya Allah akan memuliakan suatu kaum dengan kitab ini (Al Qur`an) dan menghinakan yang lain.'\" Dan telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] dan [Abu Bakar bin Ishaq] keduanya berkata, telah mengabarkan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] ia berkata, telah menceritakan kepadaku [Amir bin Watsilah Al Laitsi] bahwa Nafi' bin Abdul Harits Al Khuza'i menjumpai [Umar bin Al Khaththab] di 'Usfan. Yakni serupa dengan hadits Ibrahim bin Sa'd dari Az Zuhri."
            },
            {
                "number": 1273,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُاسَمِعْتُ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَؤُهَا وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَنِيهَا فَكِدْتُ أَنْ أَعْجَلَ عَلَيْهِ ثُمَّ أَمْهَلْتُهُ حَتَّى انْصَرَفَ ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ فَجِئْتُ بِهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَأْتَنِيهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسِلْهُ اقْرَأْ فَقَرَأَ الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَأُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا أُنْزِلَتْ ثُمَّ قَالَ لِي اقْرَأْ فَقَرَأْتُ فَقَالَ هَكَذَا أُنْزِلَتْ إِنَّ هَذَا الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُو حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ الْمِسْوَرَ بْنَ مَخَرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ الْقَارِيَّ أَخْبَرَاهُ أَنَّهُمَا سَمِعَا عُمَرَ بْنَ الْخَطَّابِ يَقُولُا سَمِعْتُ هِشَامَ بْنَ حَكِيمٍ يَقْرَأُ سُورَةَ الْفُرْقَانِ فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَاقَ الْحَدِيثَ بِمِثْلِهِ وَزَادَ فَكِدْتُ أُسَاوِرُهُ فِي الصَّلَاةِ فَتَصَبَّرْتُ حَتَّى سَلَّمَ حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ كَرِوَايَةِ يُونُسَ بِإِسْنَادِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Ibnu Syihab] dari [Urwah bin Zubair] dari [Abdurrahman bin Abdul Qari] ia berkata, saya mendengar [Umar bin Al Khaththab] berkata; Aku mendengar Hisyam bin Hakim bin Hizam membaca surat Al Furqan, tidak seperti bacaan (qiraat) yang pernah beliau shallallahu 'alaihi wasallam bacakan kepadaku. Karena itu hampir saja aku bertindak kasar terhadapnya. Tetapi kubiarkan saja dia hingga pergi. Namun kupegang bajunya, lalu kubawa dia ke hadapan Rasulullah shallallahu 'alaihi wasallam. Ujarku, \"Wahai Rasulullah, aku mendengar orang ini membaca surat Al Furqan tidak seperti yang Anda bacakan kepadaku, bagaimana ini?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Lepaskanlah ia, suruh ia membacanya kembali.\" Lalu Hisyam membacakan kembali seperti yang dibacanya tadi. Setelah itu, Nabi shallallahu 'alaihi wasallam bersabda: \"Memang seperti inilah ia diturunkan.\" Kemudian Nabi shallallahu 'alaihi wasallam menyuruhku pula untuk membaca. Lalu kubaca seperti bacaan yang biasa kubaca. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Ya, ayat itu memang diturunkan seperti itu. Sesungguhnya Al Qur`an itu diturunkan dengan tujuh huruf (tujuh dialek bahasa). Karena itu, bacalah dengan huruf yang mudah bagi kalian.\" Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Urwah bin Zubair] bahwa [Miswar bin Makhramah] dan [Abdurrahman bin Abdul Qari] telah mengarbarkan kepadanya, bahwa keduanya telah mendengar [Umar bin Al Khaththab] berkata; Saya mendengar Hisyam bin Hakim membaca surat Al Furqan pada masa Rasulullah shallallahu 'alaihi wasallam. Ia pun menyebutkan hadits yang serupa. Dan ia menambahkan; \"Dan aku hampir saja berbuat kasar terhadapnya di saat sholat. Namun aku berusaha bersabar hingga ia mengucapkan salam.\" Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Abd bin Humaid] keduanya berkata, telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] sebagaimana riwayat Yunus dengan Isnadnya."
            },
            {
                "number": 1274,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ ابْنَ عَبَّاسٍ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَقْرَأَنِي جِبْرِيلُ عَلَيْهِ السَّلَام عَلَى حَرْفٍ فَرَاجَعْتُهُ فَلَمْ أَزَلْ أَسْتَزِيدُهُ فَيَزِيدُنِي حَتَّى انْتَهَى إِلَى سَبْعَةِ أَحْرُفٍقَالَ ابْنُ شِهَابٍ بَلَغَنِي أَنَّ تِلْكَ السَّبْعَةَ الْأَحْرُفَ إِنَّمَا هِيَ فِي الْأَمْرِ الَّذِي يَكُونُ وَاحِدًا لَا يَخْتَلِفُ فِي حَلَالٍ وَلَا حَرَامٍ و حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [ubaidhullah bin Abdullah bin Utbah] bahwa [Ibnu Abbas] telah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mula-mula Jibril membacakan Al Qur`an padaku dengan satu huruf (bacaan dengan satu lahjah) saja. Lalu saya memohon agar ditambahkan. Maka Jibril pun menambahkannya hingga menjadi tujuh huruf (lahjah bacaan).\" Ibnu Syihab berkata; \"Telah sampai khabar kepadaku bahwa tujuh huruf itu, dalam masalah hukum adalah satu, tidak ada pertentangan di dalamnya mengenai halal dan haram.\" Dan telah menceritakannya kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdur Razaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dengan Isnad ini."
            },
            {
                "number": 1275,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ جَدِّهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَكُنْتُ فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ يُصَلِّي فَقَرَأَ قِرَاءَةً أَنْكَرْتُهَا عَلَيْهِ ثُمَّ دَخَلَ آخَرُ فَقَرَأَ قِرَاءَةً سِوَى قَرَاءَةِ صَاحِبِهِ فَلَمَّا قَضَيْنَا الصَّلَاةَ دَخَلْنَا جَمِيعًا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ هَذَا قَرَأَ قِرَاءَةً أَنْكَرْتُهَا عَلَيْهِ وَدَخَلَ آخَرُ فَقَرَأَ سِوَى قِرَاءَةِ صَاحِبِهِ فَأَمَرَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَا فَحَسَّنَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَأْنَهُمَا فَسَقَطَ فِي نَفْسِي مِنْ التَّكْذِيبِ وَلَا إِذْ كُنْتُ فِي الْجَاهِلِيَّةِ فَلَمَّا رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَدْ غَشِيَنِي ضَرَبَ فِي صَدْرِي فَفِضْتُ عَرَقًا وَكَأَنَّمَا أَنْظُرُ إِلَى اللَّهِ عَزَّ وَجَلَّ فَرَقًا فَقَالَ لِي يَا أُبَيُّ أُرْسِلَ إِلَيَّ أَنْ اقْرَأْ الْقُرْآنَ عَلَى حَرْفٍ فَرَدَدْتُ إِلَيْهِ أَنْ هَوِّنْ عَلَى أُمَّتِي فَرَدَّ إِلَيَّ الثَّانِيَةَ اقْرَأْهُ عَلَى حَرْفَيْنِ فَرَدَدْتُ إِلَيْهِ أَنْ هَوِّنْ عَلَى أُمَّتِي فَرَدَّ إِلَيَّ الثَّالِثَةَ اقْرَأْهُ عَلَى سَبْعَةِ أَحْرُفٍ فَلَكَ بِكُلِّ رَدَّةٍ رَدَدْتُكَهَا مَسْأَلَةٌ تَسْأَلُنِيهَا فَقُلْتُ اللَّهُمَّ اغْفِرْ لِأُمَّتِي اللَّهُمَّ اغْفِرْ لِأُمَّتِي وَأَخَّرْتُ الثَّالِثَةَ لِيَوْمٍ يَرْغَبُ إِلَيَّ الْخَلْقُ كُلُّهُمْ حَتَّى إِبْرَاهِيمُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنِي إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عِيسَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى أَخْبَرَنِي أُبَيُّ بْنُ كَعْبٍ أَنَّهُ كَانَ جَالِسًا فِي الْمَسْجِدِ إِذْ دَخَلَ رَجُلٌ فَصَلَّى فَقَرَأَ قِرَاءَةً وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Abdullah bin Isa bin Abdurrahman bin Abu Laila] dari [kakeknya] dari [Ubay bin Ka'ab] ia berkata; Suatu ketika saya sedang berada di dalam Masjid, tiba-tiba datanglah seorang laki-laki dan sholat. Lalu ia membaca (Al Qur`an) dengan dengan qiraah (bacaan) yang saya ingkari. Kemudian datanglah seorang laki-laki lain dan membaca (Al Qur`an) dengan qiraah yang lain lagi. Usai menunaikan sholat, kami semua menemui Rasulullah shallallahu 'alaihi wasallam. Ujarku, \"Sesungguhnya orang ini membaca (Al Qur`an) dengan qiraah yang saya ingkari. kemudian datanglah laki-laki lain lalu ia membaca (Al Qur`an) dengan qiraah yang lain lagi.\" Maka Rasulullah shallallahu 'alaihi wasallam pun memerintahkan keduanya untuk mengulangi bacaannya masing-masing, lalu Nabi shallallahu 'alaihi wasallam membenarkannya. Setelah itu, hilanglah prasangka dusta di dalam hatiku dan juga perasaan saat aku masih jahiliyah dulu. Maka ketika Rasulullah shallallahu 'alaihi wasallam melihat sesuatu yang telah menimpaku, beliau menepuk-nepuk dadaku, dan terbukalah bagiku suatu pengetahuan yang seakan-akan aku melihat Allah dengan penuh ketakutan. Kemudian beliau bersabda: \"Wahai Ubay, (Jibril) telah diutus kepadaku agar aku membaca Al Qur`an dengan satu huruf (lahjah bacaan) saja, maka saya pun terus mendesaknya agar memberikan keringanan atas umatku. Maka ia pun kembali kepadaku agar aku membacanya dengan dua huruf. Aku masih terus mendesaknya lagi agar memberikan keringanan atas umatku. Maka ia pun kembali lagi (dan memberikan keringanan) agar aku membacanya dengan tujuh huruf. Jibril berkata, 'Begitulah setiap kamu kembali, kuperkenankan permintaanmu.' Maka aku pun berdo'a: 'ALLAHUMMAGHFIR LI UMMATII (Ya Allah ampunilah umatku).' Dan saya mengakhirkan yang ketiga untuk suatu hari, dimana seluruh makhluk mengharap padaku, hingga Ibrahim shallallahu 'alaihi wasallam.\" Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepadaku [Isma'il bin Abu Khalid] telah menceritakan kepadaku [Abdullah bin Isa] dari [Abdurrahman bin Abu Laila] telah mengabarkan kepadaku [Ubay bin Ka'ab] bahwa suatu ketika ia duduk di dalam masjid, tiba-tiba masuklah seorang laki-laki kemudian sholat dan membaca (Al Qur`an) dengan sebuah qiraah. Ia pun mengkisahkan hadits yang serupa dengan hadits Ibnu Numair."
            },
            {
                "number": 1276,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَاه ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أُبَيِّ بْنِ كَعْبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عِنْدَ أَضَاةِ بَنِي غِفَارٍ قَالَ فَأَتَاهُ جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تَقْرَأَ أُمَّتُكَ الْقُرْآنَ عَلَى حَرْفٍ فَقَالَ أَسْأَلُ اللَّهَ مُعَافَاتَهُ وَمَغْفِرَتَهُ وَإِنَّ أُمَّتِي لَا تُطِيقُ ذَلِكَ ثُمَّ أَتَاهُ الثَّانِيَةَ فَقَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تَقْرَأَ أُمَّتُكَ الْقُرْآنَ عَلَى حَرْفَيْنِ فَقَالَ أَسْأَلُ اللَّهَ مُعَافَاتَهُ وَمَغْفِرَتَهُ وَإِنَّ أُمَّتِي لَا تُطِيقُ ذَلِكَ ثُمَّ جَاءَهُ الثَّالِثَةَ فَقَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تَقْرَأَ أُمَّتُكَ الْقُرْآنَ عَلَى ثَلَاثَةِ أَحْرُفٍ فَقَالَ أَسْأَلُ اللَّهَ مُعَافَاتَهُ وَمَغْفِرَتَهُ وَإِنَّ أُمَّتِي لَا تُطِيقُ ذَلِكَ ثُمَّ جَاءَهُ الرَّابِعَةَ فَقَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تَقْرَأَ أُمَّتُكَ الْقُرْآنَ عَلَى سَبْعَةِ أَحْرُفٍ فَأَيُّمَا حَرْفٍ قَرَءُوا عَلَيْهِ فَقَدْ أَصَابُواو حَدَّثَنَاه عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] -dalam jalur lain- Dan telah menceritakannya kepada kami [Ibnul Mutsanna] dan [Ibnu Basysyar] - [Ibnul Mutsanna] - berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Mujahid] dari [Ibnu Abu Laila] dari [Ubay bin Ka'ab] bahwasanya Nabi shallallahu 'alaihi wasallam berada di kolam air Bani Ghifar. Kemudian beliau didatangi Jibril 'Alaihis salam seraya berkata, \"Sesungguhnya Allah memerintahkanmu untuk membacakan Al Qur`an kepada umatmu dengan satu huruf (lahjah bacaan).\" Beliau pun bersabda: \"Saya memohon kasih sayang dan ampunan-Nya, sesungguhnya umatku tidak akan mampu akan hal itu.\" kemudian Jibril datang untuk kedua kalinya dan berkata, \"Sesungguhnya Allah memerintahkanmu untuk membacakan Al Qur`an kepada umatmu dengan dua huruf.\" Beliau pun bersabda: \"Saya memohon kasih sayang dan ampunan-Nya, sesungguhnya umatku tidak akan mampu akan hal itu.\" Lalu Jibril mendatanginya untuk ketiga kalinya seraya berkata, \"Sesungguhnya Allah memerintahkanmu untuk membacakan Al Qur`an kepada umatmu dengan tiga huruf.\" Beliau bersabda \"Saya memohon kasih sayang dan ampunan-Nya, sesungguhnya umatku tidak akan mampu akan hal itu.\" Kemudian Jibril datang untuk yang keempat kalinya dan berkata, \"Sesungguhnya Allah memerintahkanmu untuk membacakan Al Qur`an kepada umatmu dengan tujuh huruf. Dengan huruf yang manapun yang mereka gunakan untuk membaca, maka bacaan mereka benar.\" Dan telah menceritakannya kepada kami [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Syu'bah] dengan isnad ini semisalnya."
            },
            {
                "number": 1277,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ جَمِيعًا عَنْ وَكِيعٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ جَاءَ رَجُلٌ يُقَالُ لَهُ نَهِيكُ بْنُ سِنَانٍ إِلَى عَبْدِ اللَّهِ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ كَيْفَ تَقْرَأُ هَذَا الْحَرْفَ أَلِفًا تَجِدُهُ أَمْ يَاءً{ مِنْ مَاءٍ غَيْرِ آسِنٍ }أَوْ{ مِنْ مَاءٍ غَيْرِ يَاسِنٍ }قَالَ فَقَالَ عَبْدُ اللَّهِ وَكُلَّ الْقُرْآنِ قَدْ أَحْصَيْتَ غَيْرَ هَذَا قَالَ إِنِّي لَأَقْرَأُ الْمُفَصَّلَ فِي رَكْعَةٍ فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِ إِنَّ أَقْوَامًا يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ وَلَكِنْ إِذَا وَقَعَ فِي الْقَلْبِ فَرَسَخَ فِيهِ نَفَعَ إِنَّ أَفْضَلَ الصَّلَاةِ الرُّكُوعُ وَالسُّجُودُإِنِّي لَأَعْلَمُ النَّظَائِرَ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرُنُ بَيْنَهُنَّ سُورَتَيْنِ فِي كُلِّ رَكْعَةٍ ثُمَّ قَامَ عَبْدُ اللَّهِ فَدَخَلَ عَلْقَمَةُ فِي إِثْرِهِ ثُمَّ خَرَجَ فَقَالَ قَدْ أَخْبَرَنِي بِهَاقَالَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ جَاءَ رَجُلٌ مِنْ بَنِي بَجِيلَةَ إِلَى عَبْدِ اللَّهِ وَلَمْ يَقُلْ نَهِيكُ بْنُ سِنَانٍ و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ جَاءَ رَجُلٌ إِلَى عَبْدِ اللَّهِ يُقَالُ لَهُ نَهِيكُ بْنُ سِنَانٍ بِمِثْلِ حَدِيثِ وَكِيعٍ غَيْرَ أَنَّهُ قَالَ فَجَاءَ عَلْقَمَةُ لِيَدْخُلَ عَلَيْهِ فَقُلْنَا لَهُ سَلْهُ عَنْ النَّظَائِرِ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهَا فِي رَكْعَةٍ فَدَخَلَ عَلَيْهِ فَسَأَلَهُ ثُمَّ خَرَجَ عَلَيْنَا فَقَالَ عِشْرُونَ سُورَةً مِنْ الْمُفَصَّلِ فِي تَأْلِيفِ عَبْدِ اللَّهِ و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَعْمَشُ فِي هَذَا الْإِسْنَادِ بِنَحْوِ حَدِيثِهِمَا وَقَالَ إِنِّي لَأَعْرِفُ النَّظَائِرَ الَّتِي كَانَ يَقْرَأُ بِهِنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اثْنَتَيْنِ فِي رَكْعَةٍ عِشْرِينَ سُورَةً فِي عَشْرِ رَكَعَاتٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ibnu Numair] semuanya dari [Waki'] - [Abu Bakar] berkata- telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Abu Wa`il] ia berkata; Seorang laki-laki yang namanya Nahik bin Sinan mendatangi [Abdullah] dan berkata, \"Wahai Abu Abdurrrahman, bagaimana Anda membaca huruf ini, dengan huruf Alif ataukah Yaa`, yaitu: \"MIN MAA`IN GHAIRI `AASIN\" ataukah, \"MIN MAA`IN GHARI YAASIN.\" Maka Abdullah menjawab, \"Apakah setiap Al Qur`an telah kamu hitung selain ini?\" Nahik berkata lagi, \"Sesungguhnya aku benar-benar telah membaca Al Mufashshal dalam satu raka'at.\" Abdullah berkata, \"Cepatnya beliau membaca adalah seperti cepatnya membaca sya'ir. Ada suatu kaum yang membaca Al Qur`an, namun bacaan mereka tidak sampai melewati batas tenggorokan. Bacaan yang terpatri di dalam hati dan menancap kuat di dalamnya, baru akan bermanfaat. Bagian sholat yang paling utama adalah ruku' dan sujud. Aku benar-benar telah mengetahui An Nazha`ir (surat-surat yang hampir sama baik panjangnya atau pun maknanya), yang mana Rasulullah shallallahu 'alaihi wasallam membacanya pada setiap raka'at.\" Kemudian Abdullah berdiri, lalu masuklah Alqamah ke belakang kemudian keluar dan berkata, \"Ia telah mengabarkannya kepadaku.\" Ibnu Numair berkata dalam riwayatnya; Seorang laki-laki dari Bani Bajilah datang kepada Abdullah.\" Ia tidak menyebutkan Nahik bin Sinan. Dan telah menceritakan kepada kami [Abu Kuraib] Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Wa`il] ia berkata; \"Seorang laki-laki yang bernama Nahik bin Sinan datang kepada [Abdullah].\" Yakni serupa dengan haditsnya Waki', hanya saja ia menyebutkan; Kemudian datanglah Alqamah untuk menemui Abdullah, maka kami pun berkata kepadanya, \"Tanyakanlah padanya tentang An Nazha`ir (surat-surat yang hampir sama baik panjangnya atau pun maknanya) dimana Rasulullah shallallahu 'alaihi wasallam telah membacanya dalam satu raka'at.\" Lalu ia pun masuk menemuinya dan bertanya kepadanya. Sesudah itu, ia keluar dan berkata, \"Yaitu dua puluh surat dari Al Mufashshal dalam Ta`lifnya Abdullah. Dan telah meceritakannya kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus] Telah menceritakan kepada kami [Al A'masy] dalam isnad ini sebagaimana hadits keduanya. Dan ia menyebutkan; Sungguh, saya benar-benar telah mengetahui An Nazha`ir (surat-surat yang hampir sama baik panjangnya atau pun maknanya) yang telah dibaca oleh Rasulullah shallallahu 'alaihi wasallam dua surat dalam satu raka'at, yakni dua puluh surat dalam sepuluh raka'at."
            },
            {
                "number": 1278,
                "arab": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا وَاصِلٌ الْأَحْدَبُ عَنْ أَبِي وَائِلٍ قَالَ غَدَوْنَا عَلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ يَوْمًا بَعْدَ مَا صَلَّيْنَا الْغَدَاةَ فَسَلَّمْنَا بِالْبَابِ فَأَذِنَ لَنَا قَالَ فَمَكَثْنَا بِالْبَابِ هُنَيَّةً قَالَ فَخَرَجَتْ الْجَارِيَةُ فَقَالَتْ أَلَا تَدْخُلُونَ فَدَخَلْنَا فَإِذَا هُوَ جَالِسٌ يُسَبِّحُ فَقَالَ مَا مَنَعَكُمْ أَنْ تَدْخُلُوا وَقَدْ أُذِنَ لَكُمْ فَقُلْنَا لَا إِلَّا أَنَّا ظَنَنَّا أَنَّ بَعْضَ أَهْلِ الْبَيْتِ نَائِمٌ قَالَ ظَنَنْتُمْ بِآلِ ابْنِ أُمِّ عَبْدٍ غَفْلَةً قَالَ ثُمَّ أَقْبَلَ يُسَبِّحُ حَتَّى ظَنَّ أَنَّ الشَّمْسَ قَدْ طَلَعَتْ فَقَالَ يَا جَارِيَةُ انْظُرِي هَلْ طَلَعَتْ قَالَ فَنَظَرَتْ فَإِذَا هِيَ لَمْ تَطْلُعْ فَأَقْبَلَ يُسَبِّحُ حَتَّى إِذَا ظَنَّ أَنَّ الشَّمْسَ قَدْ طَلَعَتْ قَالَ يَا جَارِيَةُ انْظُرِي هَلْ طَلَعَتْ فَنَظَرَتْ فَإِذَا هِيَ قَدْ طَلَعَتْ فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي أَقَالَنَا يَوْمَنَا هَذَا فَقَالَ مَهْدِيٌّ وَأَحْسِبُهُ قَالَ وَلَمْ يُهْلِكْنَا بِذُنُوبِنَا قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ قَرَأْتُ الْمُفَصَّلَ الْبَارِحَةَ كُلَّهُ قَالَ فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِإِنَّا لَقَدْ سَمِعْنَا الْقَرَائِنَ وَإِنِّي لَأَحْفَظُ الْقَرَائِنَ الَّتِي كَانَ يَقْرَؤُهُنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيَةَ عَشَرَ مِنْ الْمُفَصَّلِ وَسُورَتَيْنِ مِنْ آلِ حم",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Mahdi bin Maimun] telah menceritakan kepada kami [Washil Al Ahdab] dari [Abu Wa`il] ia berkata; Pada suatu hari setelah menunaikan sholat Shubuh, kami pergi menemui [Abdullah bin Mas'ud]. Kami mengucapkan salam di depan pintu, lalu ia pun mengizinkan kami, namun kami tetap berada di dekat pintu sejenak lalu keluarlah seorang budak wanita dan berkata, \"Tidakkah kalian masuk?” Maka kami segera masuk, dan ternyata kami dapati Ibnu Mas'ud sedang duduk bertasbih. Ibnu Mas'ud bertanya, \"Apa yang menghalangi kalian untuk masuk, padahal kalian telah diizinkan?” Kami menjawab, \"Tidak ada, melainkan kami hanya menyangka bahwa sebagian penghuni rumah masih tidur.\" Ibnu Mas'ud berkata, \"Kalian menyangka bahwa keluarga Ibnu Ummi Abdu adalah para pemalas?” Dia kemudian meneruskan bacaan tasbihnya hingga kami mengira bahwa matahari telah terbit. Lalu ia bertanya, \"Wahai Jariyah (budak wanita), lihatlah apakah matahari telah terbit?” budak wanita itu pun melihat, ternyata matahari belum terbit. Maka Ibnu Mas'ud kembali bertasbih hingga ia merasa bahwa matahari telah terbit, lalu ia pun bertanya lagi, \"Wahai Jariyah, apakah matahari telah terbit?” budak wanita itu pun melihatnya, dan ternyata matahari telah terbit. Maka Ibnu Mas'ud berkata, \"Segala puji bagi Allah Yang telah membangkitkan kami di hari ini.\" Mahdi berkata; Aku menduga bahwa ia berkata, \"Dan Dia tidak membinasakan kami lantaran dosa-dosa kami.\" Lalu berkatalah seorang laki-laki dari kaum itu, \"Semalam, saya telah membaca Al Mufashshal seluruhnya.\" Maka Abdullah bin Mas'ud pun berkata, \"Cepatnya beliau membaca adalah seperti cepatnya membaca sya'ir. Saya telah mengetahui An Nazha`ir (surat-surat yang hampir sama baik panjangnya atau pun maknanya), yang mana Rasulullah shallallahu 'alaihi wasallam membacanya yaitu delapan belas surat dari Al Mufashshal dan dua surat dari Alif Lamm Hammim.\""
            },
            {
                "number": 1279,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ مَنْصُورٍ عَنْ شَقِيقٍ قَالَ جَاءَ رَجُلٌ مِنْ بَنِي بَجِيلَةَ يُقَالُ لَهُ نَهِيكُ بْنُ سِنَانٍ إِلَى عَبْدِ اللَّهِ فَقَالَ إِنِّي أَقْرَأُ الْمُفَصَّلَ فِي رَكْعَةٍ فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِلَقَدْ عَلِمْتُ النَّظَائِرَ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِنَّ سُورَتَيْنِ فِي رَكْعَةٍ",
                "id": "Telah menceritakan kepada kami [Abdu bin Humaid] telah menceritakan kepada kami [Husain bin Ali Al Ju'fi] dari [Za`idah] dari [Manshur] dari [Syaqiq] ia berkata; Seorang laki-laki dari Bani Bajilah yang biada dipanggil Nahik bin Sinan datang menemui [Abdullah] dan berkata, \"Saya membaca Al Mufashshal (surat-surat yang berada di antara surat Qaaf -atau Hujurat- hingga akhir mushhaf) dalam satu raka'at.\" Maka Abdullah pun berkata, \"Engkau membaca seperti cepatnya pembacaan sya'ir. Saya telah mengetahui An Nazha`ir (surat-surat yang hampir sama baik panjangnya atau pun maknanya), yang mana Rasulullah shallallahu 'alaihi wasallam membacanya dua surat pada setiap raka'at.\""
            },
            {
                "number": 1280,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ أَنَّهُ سَمِعَ أَبَا وَائِلٍ يُحَدِّثُ أَنَّ رَجُلًا جَاءَ إِلَى ابْنِ مَسْعُودٍ فَقَالَ إِنِّي قَرَأْتُ الْمُفَصَّلَ اللَّيْلَةَ كُلَّهُ فِي رَكْعَةٍ فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِفَقَالَ عَبْدُ اللَّهِ لَقَدْ عَرَفْتُ النَّظَائِرَ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرُنُ بَيْنَهُنَّ قَالَ فَذَكَرَ عِشْرِينَ سُورَةً مِنْ الْمُفَصَّلِ سُورَتَيْنِ سُورَتَيْنِ فِي كُلِّ رَكْعَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] -[Ibnul Mutsanna]- berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Amru bin Murrah] bahwa ia mendengar [Abu wa`il] menceritakan; bahwa seorang laki-laki menemui [Ibnu Mas'ud] seraya berkata, \"Tadi malam saya membaca Al Mufashshal (surat-surat yang berada di antara surat Qaaf -atau Hujurat- hingga akhir mushhaf) seluruhnya dalam satu raka'at.\" Maka Abdullah pun berkata, \"Cepatnya beliau membaca adalah seperti pembacaan sya'ir yang jauh dari ketergesa-gesaan.\" Abdullah berkata; \"Saya telah mengetahui An Nazha`ir (surat-surat yang hampir sama baik panjangnya atau pun maknanya), yang mana Rasulullah shallallahu 'alaihi wasallam membacanya.\" Lalu ia pun menyebutkan dua puluh surat dari Al Mufashshal. Yakni dua surat dua surat pada setiap raka'atnya."
            },
            {
                "number": 1281,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ قَالَ رَأَيْتُ رَجُلًا سَأَلَ الْأَسْوَدَ بْنَ يَزِيدَ وَهُوَ يُعَلِّمُ الْقُرْآنَ فِي الْمَسْجِدِ فَقَالَكَيْفَ تَقْرَأُ هَذِهِ الْآيَةَ{ فَهَلْ مِنْ مُدَّكِرٍ }أَدَالًا أَمْ ذَالًا قَالَ بَلْ دَالًا سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ{ مُدَّكِرٍ }دَالًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Ishaq] ia berkata, saya melihat seorang laki-laki bertanya [Al Aswad bin Yazid] yang sedang mengajarkan Al Qur`an di masjid, \"Bagaimana Anda membaca ayat ini, 'FAHAL MIM MUDDAKIR' apakah dengan huruf Dal ataukah Dzal?.\" Al Aswad menjawab, \"Yang benar adalah dengan huruf Dal. Saya mendengar [Ibnu Mas'ud] berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam membaca: \"MUDDAKIR (Yakni dengan huruf Dal).\""
            },
            {
                "number": 1282,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقْرَأُ هَذَا الْحَرْفَ{ فَهَلْ مِنْ مُدَّكِرٍ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] -Ibnul Mutsanna- berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Aswad] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, bahwasanya beliau membaca huruf ini: \"FAHAL MIM MUDDAKIR.\""
            },
            {
                "number": 1283,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي بَكْرٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَقَدِمْنَا الشَّامَ فَأَتَانَا أَبُو الدَّرْدَاءِ فَقَالَ أَفِيكُمْ أَحَدٌ يَقْرَأُ عَلَى قِرَاءَةِ عَبْدِ اللَّهِ فَقُلْتُ نَعَمْ أَنَا قَالَ فَكَيْفَ سَمِعْتَ عَبْدَ اللَّهِ يَقْرَأُ هَذِهِ الْآيَةَ{ وَاللَّيْلِ إِذَا يَغْشَى }قَالَ سَمِعْتُهُ يَقْرَأُ{ وَاللَّيْلِ إِذَا يَغْشَى }وَالذَّكَرِ وَالْأُنْثَى قَالَ وَأَنَا وَاللَّهِ هَكَذَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَا وَلَكِنْ هَؤُلَاءِ يُرِيدُونَ أَنْ أَقْرَأَ وَمَا خَلَقَ فَلَا أُتَابِعُهُمْو حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ أَتَى عَلْقَمَةُ الشَّامَ فَدَخَلَ مَسْجِدًا فَصَلَّى فِيهِ ثُمَّ قَامَ إِلَى حَلْقَةٍ فَجَلَسَ فِيهَا قَالَ فَجَاءَ رَجُلٌ فَعَرَفْتُ فِيهِ تَحَوُّشَ الْقَوْمِ وَهَيْئَتَهُمْ قَالَ فَجَلَسَ إِلَى جَنْبِي ثُمَّ قَالَ أَتَحْفَظُ كَمَا كَانَ عَبْدُ اللَّهِ يَقْرَأُ فَذَكَرَ بِمِثْلِهِ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] -sedang lafazhnya dari Abu Bakr- keduanya berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] ia berkata; Kami mendatangi negeri Syam, lalu [Abu Darda] menjumpai kami seraya bertanya, \"Adakah di antara kalian yang membaca dengan qiraahnya Abdullah bin Mas'ud?\" Saya menjawab, \"Ya. Sayalah orangnya.\" Ia bertanya, \"Lalu bagaimana engkau mendengar Ibnu Mas'ud membaca ayat ini: 'WAL LAILI IDZAA YAGHSYAA.'?\" Saya menjawab, \"Saya mendengarnya membaca; 'WAL LAILI IDZAA YAGHSYAA WADZDZAKARI WAL UNTSAA.'\" Ia (Abu Darda') berkata, adapun saya, demi Allah, saya telah mendengar Rasulullah shallallahu 'alaihi wasallam membacanya seperti itu. Akan tetapi mereka menginginkan agar aku membaca; 'WA MAA KHALAQA', namun saya tidak menuruti mereka.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Mughirah] dari [Ibrahim] ia berkata; [Alqamah] mendatangi negeri Syam, lalu ia masuk Masjid, dan sholat di dalamnya. Kemudian ia berdiri menuju Halaqah dan duduk di situ. Kemudian datanglah [seorang laki-laki] dan saya pun tahu akan reaksi dan sikap orang-orang padanya. Lalu laki-laki itu duduk di sampingku dan bertanya, \"Apakah kamu hafal sebagaimana Abdullah membaca (Al Qur`an)?\" maka ia pun menyebutkan hadits semisalnya."
            },
            {
                "number": 1284,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ عَلْقَمَةَ قَالَ لَقِيتُ أَبَا الدَّرْدَاءِفَقَالَ لِي مِمَّنْ أَنْتَ قُلْتُ مِنْ أَهْلِ الْعِرَاقِ قَالَ مِنْ أَيِّهِمْ قُلْتُ مِنْ أَهْلِ الْكُوفَةِ قَالَ هَلْ تَقْرَأُ عَلَى قِرَاءَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قُلْتُ نَعَمْ قَالَ فَاقْرَأْ{ وَاللَّيْلِ إِذَا يَغْشَى }قَالَ فَقَرَأْتُ{ وَاللَّيْلِ إِذَا يَغْشَى وَالنَّهَارِ إِذَا تَجَلَّى }وَالذَّكَرِ وَالْأُنْثَى قَالَ فَضَحِكَ ثُمَّ قَالَ هَكَذَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَؤُهَاو حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الْأَعْلَى حَدَّثَنَا دَاوُدُ عَنْ عَامِرٍ عَنْ عَلْقَمَةَ قَالَ أَتَيْتُ الشَّامَ فَلَقِيتُ أَبَا الدَّرْدَاءِ فَذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Dawud bin Abu Hind] dari [Asy Sya'bi] dari [Alqamah] ia berkata; Saya berjumpa dengan [Abu Darda`], lalu ia bertanya kepadaku, \"Dari manakah kamu?\" Saya menjawab, \"Dari penduduk Iraq.\" Ia bertanya lagi, \"Dari daerah mana?\" Saya menjawab, \"Dari penduduk Kufah.\" Ia bertanya lagi, \"Apakah kamu membaca Al Qur`an dengan qira`ahnya Abdullah bin Mas'ud?\" Saya menjawab, \"Ya.\" Ia berkata, \"Kalau begitu, bacalah: 'WAL LAILI IDZAA YAGHSYAA.'\" Maka saya pun membacakannya, \"WAL LAILI IDZAA YAGHSYAA WAN NAHAARI IDZAA TAJALLAA WADZ DZAKARI WAL UNTSAA.\" Lalu Abu Darda` pun tertawa kemudian berkata; \"Seperti inilah saya mendengar Rasulullah shallallahu 'alaihi wasallam membacanya.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepadaku [Abdul A'la] telah menceritakan kepada kami [Dawud] dari [Amir] dari [Alqamah] ia berkata; Saya mendatangi negeri Syam dan bertemu dengan [Abu Darda`]. Ia pun menyebutkan hadits yang serupa dengan haditsnya Ibnu Ulayyah."
            },
            {
                "number": 1285,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَعَنْ الصَّلَاةِ بَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Muhammad bin Yahya bin Habban] dari [Al A'raj] dari [Abu Hurairah] bahwasanya; \"Rasulullah shallallahu 'alaihi wasallam melarang sholat sesudah sholat Asar hingga matahari terbenam, dan sesudah sholat Shubuh hingga matahari terbit.\""
            },
            {
                "number": 1286,
                "arab": "و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ وَإِسْمَعِيلُ بْنُ سَالِمٍ جَمِيعًا عَنْ هُشَيْمٍ قَالَ دَاوُدُ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مَنْصُورٌ عَنْ قَتَادَةَ قَالَ أَخْبَرَنَا أَبُو الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ قَالَسَمِعْتُ غَيْرَ وَاحِدٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ عُمَرُ بْنُ الْخَطَّابِ وَكَانَ أَحَبَّهُمْ إِلَيَّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ ح و حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي كُلُّهُمْ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِ سَعِيدٍ وَهِشَامٍ بَعْدَ الصُّبْحِ حَتَّى تَشْرُقَ الشَّمْسُ",
                "id": "Dan telah menceritakan kepada kami [Dawud bin Rusyaid] dan [Isma'il bin Salim] semuanya dari [Husyaim] -[Dawud]- berkata, telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Manshur] dari [Qatadah] ia berkata, telah mengabarkan kepada kami [Abul 'Aliyah] dari [Ibnu Abbas] ia berkata, \"Saya mendengar lebih dari seorang dari kalangan sahabat Rasulullah shallallahu 'alaihi wasallam termasuk di ataranya adalah [Umar bin Al Khaththab] -dan ia adalah yang paling saya cintai di antara mereka- bahwa Rasulullah shallallahu 'alaihi wasallam melarang sholat sesudah sholat Shubuh hingga matahari terbit dan sesudah sholat Asar hingga matahari terbenam.\" Dan telah menceritakannya kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] -dalam jalur lain- Dan telah menceritakan kepadaku [Abu Ghassan Al Misma'i] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] -dalam jalur lain- Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [bapakku] mereka semua dari [Qatadah] dengan isnad ini, hanya saja di dalam haditsnya Sa'id dan Hisyam; \"Setelah sholat Shubuh hingga matahari terbit.\""
            },
            {
                "number": 1287,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُ قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ بَعْدَ صَلَاةِ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ صَلَاةِ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] bahwa [Ibnu Syihab] telah mengabarkan kepadanya, ia berkata, telah mengabarkan kepadaku ['Atha` bin Yazid Al Laitsi] bahwa ia mendengar [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh sholat sesudah Ashar hingga matahari terbenam dan tidak boleh sholat sesudah sholat Fajar hingga matahari terbit.\""
            },
            {
                "number": 1288,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَحَرَّى أَحَدُكُمْ فَيُصَلِّيَ عِنْدَ طُلُوعِ الشَّمْسِ وَلَا عِنْدَ غُرُوبِهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu menunggu-nunggu waktu sholat sehingga mengerjakan sholat ketika matahari terbit, dan jangan pula pada waktu matahari terbenam.\""
            },
            {
                "number": 1289,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا جَمِيعًا حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحَرَّوْا بِصَلَاتِكُمْ طُلُوعَ الشَّمْسِ وَلَا غُرُوبَهَا فَإِنَّهَا تَطْلُعُ بِقَرْنَيْ شَيْطَانٍ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] Telah menceritakan kepada kami [bapakku] dan [Muhammad bin Bisyr] keduanya berkata, Telah menceritakan kepada kami [Hisyam] dari [bapaknya] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menunda-nunda sholat sehingga mengerjakannya saat matahari terbit, dan jangan pula saat terbenamnya, karena matahari itu terbit di antara dua tanduk syetan.\""
            },
            {
                "number": 1290,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَابْنُ بِشْرٍ قَالُوا جَمِيعًا حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَدَا حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلَاةَ حَتَّى تَبْرُزَ وَإِذَا غَابَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلَاةَ حَتَّى تَغِيبَ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] Telah menceritakan kepada kami [bapakku] dan [Ibnu Bisyr] mereka berkata, Telah menceritakan kepada kami [Hisyam] dari [bapaknya] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila sebagian matahari mulai terbit, maka tundalah sholat sampai matahari itu benar-benar terbit (dengan sempurna). Dan bila sebagian matahari itu mulai terbenam, maka tundalah sholat sampai matahari tersebut benar-benar terbenam.\""
            },
            {
                "number": 1291,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ خَيْرِ بْنِ نُعَيْمٍ الْحَضْرَمِيِّ عَنْ ابْنِ هُبَيْرَةَ عَنْ أَبِي تَمِيمٍ الْجَيْشَانِيِّ عَنْ أَبِي بَصْرَةَ الْغِفَارِيِّ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ بِالْمُخَمَّصِ فَقَالَ إِنَّ هَذِهِ الصَّلَاةَ عُرِضَتْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَضَيَّعُوهَا فَمَنْ حَافَظَ عَلَيْهَا كَانَ لَهُ أَجْرُهُ مَرَّتَيْنِ وَلَا صَلَاةَ بَعْدَهَا حَتَّى يَطْلُعَ الشَّاهِدُ وَالشَّاهِدُ النَّجْمُو حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ خَيْرِ بْنِ نُعَيْمٍ الْحَضْرَمِيِّ عَنْ عَبْدِ اللَّهِ بْنِ هُبَيْرَةَ السَّبَائِيِّ وَكَانَ ثِقَةً عَنْ أَبِي تَمِيمٍ الْجَيْشَانِيِّ عَنْ أَبِي بَصْرَةَ الْغِفَارِيِّ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ بِمِثْلِهِ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Khair bin Nu'aim Al Hadlrami] dari [Ibnu Hubairah] dari [Abu Tamim Al Jaisyani] dari [Abu Bashrah Al Ghifari] ia berkata; Suatu ketika Rasulullah shallallahu 'alaihi wasallam mengimami kami sholat Ashar di Mukhammas. Maka beliau bersabda: \"Sesungguhnya sholat Ashar ini pernah diwajibkan kepada orang-orang yang sebelum kalian, tetapi mereka sia-siakan. Karena itu, siapa yang memelihara sholat ini, dia akan mendapatkan pahala ganda. Dan tidak boleh sholat sesudahnya, hingga bintang terbit.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] Telah menceritakan kepada kami [Ya'qub bin Ibrahim] Telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] ia berkata, telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Khair bin Nu'aim Al Hadlrami] dari [Abdullah bin Hubairah As Saba`i] -ia adalah seorang yang tsiqqah (terpercaya) - dari [Abu Tamim Al Jaisyani] dari [Abu Bashrah Al Ghifari] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah sholat Ashar bersama kami. Yakni hadits semisalnya."
            },
            {
                "number": 1292,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ مُوسَى بْنِ عُلَيٍّ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ يَقُولُاثَلَاثُ سَاعَاتٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَانَا أَنْ نُصَلِّيَ فِيهِنَّ أَوْ أَنْ نَقْبُرَ فِيهِنَّ مَوْتَانَا حِينَ تَطْلُعُ الشَّمْسُ بَازِغَةً حَتَّى تَرْتَفِعَ وَحِينَ يَقُومُ قَائِمُ الظَّهِيرَةِ حَتَّى تَمِيلَ الشَّمْسُ وَحِينَ تَضَيَّفُ الشَّمْسُ لِلْغُرُوبِ حَتَّى تَغْرُبَ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah menceritakan kepada kami [Abdullah bin Wahb] dari [Musa bin Ali] dari [bapaknya] ia berkata, saya mendengar [Uqbah bin Amir Al Juhani] berkata; \"Ada tiga waktu, yang mana Rasulullah shallallahu 'alaihi wasallam telah melarang kita untuk sholat atau menguburkan jenazah pada waktu-waktu tersebut. (Pertama), saat matahari terbit hingga ia agak meninggi. (Kedua), saat matahari tepat berada di pertengahan langit (tengah hari tepat) hingga ia telah condong ke barat, (Ketiga), saat matahari hampir terbenam, hingga ia terbenam sama sekali.\""
            },
            {
                "number": 1293,
                "arab": "حَدَّثَنِي أَحْمَدُ بْنُ جَعْفَرٍ الْمَعْقِرِيُّ حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا شَدَّادُ بْنُ عَبْدِ اللَّهِ أَبُو عَمَّارٍ وَيَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي أُمَامَةَ قَالَ عِكْرِمَةُ وَلَقِيَ شَدَّادٌ أَبَا أُمَامَةَ وَوَاثِلَةَ وَصَحِبَ أَنَسًا إِلَى الشَّامِ وَأَثْنَى عَلَيْهِ فَضْلًا وَخَيْرًا عَنْ أَبِي أُمَامَةَ قَالَ قَالَ عَمْرُو بْنُ عَبَسَةَ السُّلَمِيُّكُنْتُ وَأَنَا فِي الْجَاهِلِيَّةِ أَظُنُّ أَنَّ النَّاسَ عَلَى ضَلَالَةٍ وَأَنَّهُمْ لَيْسُوا عَلَى شَيْءٍ وَهُمْ يَعْبُدُونَ الْأَوْثَانَ فَسَمِعْتُ بِرَجُلٍ بِمَكَّةَ يُخْبِرُ أَخْبَارًا فَقَعَدْتُ عَلَى رَاحِلَتِي فَقَدِمْتُ عَلَيْهِ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَخْفِيًا جُرَءَاءُ عَلَيْهِ قَوْمُهُ فَتَلَطَّفْتُ حَتَّى دَخَلْتُ عَلَيْهِ بِمَكَّةَ فَقُلْتُ لَهُ مَا أَنْتَ قَالَ أَنَا نَبِيٌّ فَقُلْتُ وَمَا نَبِيٌّ قَالَ أَرْسَلَنِي اللَّهُ فَقُلْتُ وَبِأَيِّ شَيْءٍ أَرْسَلَكَ قَالَ أَرْسَلَنِي بِصِلَةِ الْأَرْحَامِ وَكَسْرِ الْأَوْثَانِ وَأَنْ يُوَحَّدَ اللَّهُ لَا يُشْرَكُ بِهِ شَيْءٌ قُلْتُ لَهُ فَمَنْ مَعَكَ عَلَى هَذَا قَالَ حُرٌّ وَعَبْدٌ قَالَ وَمَعَهُ يَوْمَئِذٍ أَبُو بَكْرٍ وَبِلَالٌ مِمَّنْ آمَنَ بِهِ فَقُلْتُ إِنِّي مُتَّبِعُكَ قَالَ إِنَّكَ لَا تَسْتَطِيعُ ذَلِكَ يَوْمَكَ هَذَا أَلَا تَرَى حَالِي وَحَالَ النَّاسِ وَلَكِنْ ارْجِعْ إِلَى أَهْلِكَ فَإِذَا سَمِعْتَ بِي قَدْ ظَهَرْتُ فَأْتِنِي قَالَ فَذَهَبْتُ إِلَى أَهْلِي وَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَكُنْتُ فِي أَهْلِي فَجَعَلْتُ أَتَخَبَّرُ الْأَخْبَارَ وَأَسْأَلُ النَّاسَ حِينَ قَدِمَ الْمَدِينَةَ حَتَّى قَدِمَ عَلَيَّ نَفَرٌ مِنْ أَهْلِ يَثْرِبَ مِنْ أَهْلِ الْمَدِينَةَ فَقُلْتُ مَا فَعَلَ هَذَا الرَّجُلُ الَّذِي قَدِمَ الْمَدِينَةَ فَقَالُوا النَّاسُ إِلَيْهِ سِرَاعٌ وَقَدْ أَرَادَ قَوْمُهُ قَتْلَهُ فَلَمْ يَسْتَطِيعُوا ذَلِكَ فَقَدِمْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَعْرِفُنِي قَالَ نَعَمْ أَنْتَ الَّذِي لَقِيتَنِي بِمَكَّةَ قَالَ فَقُلْتُ بَلَى فَقُلْتُ يَا نَبِيَّ اللَّهِ أَخْبِرْنِي عَمَّا عَلَّمَكَ اللَّهُ وَأَجْهَلُهُ أَخْبِرْنِي عَنْ الصَّلَاةِ قَالَ صَلِّ صَلَاةَ الصُّبْحِ ثُمَّ أَقْصِرْ عَنْ الصَّلَاةِ حَتَّى تَطْلُعَ الشَّمْسُ حَتَّى تَرْتَفِعَ فَإِنَّهَا تَطْلُعُ حِينَ تَطْلُعُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَحِينَئِذٍ يَسْجُدُ لَهَا الْكُفَّارُ ثُمَّ صَلِّ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ مَحْضُورَةٌ حَتَّى يَسْتَقِلَّ الظِّلُّ بِالرُّمْحِ ثُمَّ أَقْصِرْ عَنْ الصَّلَاةِ فَإِنَّ حِينَئِذٍ تُسْجَرُ جَهَنَّمُ فَإِذَا أَقْبَلَ الْفَيْءُ فَصَلِّ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ مَحْضُورَةٌ حَتَّى تُصَلِّيَ الْعَصْرَ ثُمَّ أَقْصِرْ عَنْ الصَّلَاةِ حَتَّى تَغْرُبَ الشَّمْسُ فَإِنَّهَا تَغْرُبُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَحِينَئِذٍ يَسْجُدُ لَهَا الْكُفَّارُ قَالَ فَقُلْتُ يَا نَبِيَّ اللَّهِ فَالْوُضُوءَ حَدِّثْنِي عَنْهُ قَالَ مَا مِنْكُمْ رَجُلٌ يُقَرِّبُ وَضُوءَهُ فَيَتَمَضْمَضُ وَيَسْتَنْشِقُ فَيَنْتَثِرُ إِلَّا خَرَّتْ خَطَايَا وَجْهِهِ وَفِيهِ وَخَيَاشِيمِهِ ثُمَّ إِذَا غَسَلَ وَجْهَهُ كَمَا أَمَرَهُ اللَّهُ إِلَّا خَرَّتْ خَطَايَا وَجْهِهِ مِنْ أَطْرَافِ لِحْيَتِهِ مَعَ الْمَاءِ ثُمَّ يَغْسِلُ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ إِلَّا خَرَّتْ خَطَايَا يَدَيْهِ مِنْ أَنَامِلِهِ مَعَ الْمَاءِ ثُمَّ يَمْسَحُ رَأْسَهُ إِلَّا خَرَّتْ خَطَايَا رَأْسِهِ مِنْ أَطْرَافِ شَعْرِهِ مَعَ الْمَاءِ ثُمَّ يَغْسِلُ قَدَمَيْهِ إِلَى الْكَعْبَيْنِ إِلَّا خَرَّتْ خَطَايَا رِجْلَيْهِ مِنْ أَنَامِلِهِ مَعَ الْمَاءِ فَإِنْ هُوَ قَامَ فَصَلَّى فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَمَجَّدَهُ بِالَّذِي هُوَ لَهُ أَهْلٌ وَفَرَّغَ قَلْبَهُ لِلَّهِ إِلَّا انْصَرَفَ مِنْ خَطِيئَتِهِ كَهَيْئَتِهِ يَوْمَ وَلَدَتْهُ أُمُّهُ فَحَدَّثَ عَمْرُو بْنُ عَبَسَةَ بِهَذَا الْحَدِيثِ أَبَا أُمَامَةَ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ أَبُو أُمَامَةَ يَا عَمْرَو بْنَ عَبَسَةَ انْظُرْ مَا تَقُولُ فِي مَقَامٍ وَاحِدٍ يُعْطَى هَذَا الرَّجُلُ فَقَالَ عَمْرٌو يَا أَبَا أُمَامَةَ لَقَدْ كَبِرَتْ سِنِّي وَرَقَّ عَظْمِي وَاقْتَرَبَ أَجَلِي وَمَا بِي حَاجَةٌ أَنْ أَكْذِبَ عَلَى اللَّهِ وَلَا عَلَى رَسُولِ اللَّهِ لَوْ لَمْ أَسْمَعْهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مَرَّةً أَوْ مَرَّتَيْنِ أَوْ ثَلَاثًا حَتَّى عَدَّ سَبْعَ مَرَّاتٍ مَا حَدَّثْتُ بِهِ أَبَدًا وَلَكِنِّي سَمِعْتُهُ أَكْثَرَ مِنْ ذَلِكَ",
                "id": "Telah menceritakan kepadaku [Ahmad bin Ja'far Al Ma'qiri] telah menceritakan kepada kami [An Nadlr bin Muhammad] telah menceritakan kepada kami [Ikrimah bin Ammar] telah menceritakan kepada kami [Syaddad bin Abdullah Abu Ammar] dan [Yahya bin Abu Katsir] dari [Abu Umamah] - Ikrimah berkata; Syaddad telah berjumpa dengan Abu Umamah dan Watsilah, juga pernah menemani Anas ke negeri Syam, ia telah memujinya dengan keutamaan dan kebaikan- Dari Abu Umamah ia berkata, [Amru bin Abasah As Sulami] berkata; Pada masa jahiliyah dulu, saya mengira bahwa manusia ketika itu berada dalam kesesatan. Mereka tidaklah memiliki sesuatu pun (yang patut dibanggakan), mereka saat itu menyembah berhala. Lalu saya mendengar tentang sosok seorang laki-laki di Makkah yang sedang menyampaikan beberapa kabar berita. Kemudian aku duduk di atas hewan tungganganku. Saya mendatangi Rasulullah shallallahu 'alaihi wasallam ketika beliau di 'Ukadz, lalu aku bertanya, “Siapa tuan?” Beliau menjawab: “Seorang Nabi.” Aku bertanya lagi, “Nabi yang bagimana?” Beliau menjawab: “Allah telah mengutusku.” Aku bertanya lagi, “Engkau diutus dengan apa?” Beliau menjawab: “Aku diutus untuk menyambung tali silaturahmi, menghancurkan berhala, dan agar Allah ditauhidkan dan tidak dipersekutukan.” Lalu aku bertanya lagi, \"Siapakah orang yang menjadi pengikut Anda dalam perkara ini (Din Islam)?” Beliau menjawab: \"Seorang yang merdeka dan juga sorang budak.\" Sementara saat itu beliau bersama Abu Bakar dan Bilal radliallahu 'anhuma. Kemudian beliau bersabda kepadaku: \"Pulanglah kamu hingga Allah menguatkan Rasul-Nya.\" Setelah itu, saya mendatangi beliau dan berkata, \"Semoga Allah menjadikanku sebagai tebusanmu. Ajarkanlah aku sesuatu yang Anda ketahui sementara aku tidak mengetahuinya, yaitu sesuatu yang tidak membahayakanmu dan Allah juga memberikan aku manfaat dengannya. Apakah ada suatu waktu yang lebih utama dari waktu yang lain, dan adakah suatu waktu yang harus kita waspadai?” Beliau menjawab: \"Sungguh, kamu telah bertanya kepadaku tentang sesuatu yang belum pernah ditanyakan oleh seorang pun sebelummu. Sesungguhnya Allah 'azza wajalla turun pada sepertiga akhir malam, dan Dia mengampuni dosa apa saja kecuali syirik dan perbuatan yang melampaui batas. sholat adalah suatu ibadah yang disaksikan dan dihadiri (oleh para malaikat) maka hendaklah kamu sholat hingga matahari terbit. Dan apabila matahari telah terbit, maka janganlah kamu sholat hingga matahari meninggi, karena matahari terbit diantara dua tanduk syetan, dan sholat pada waktu itu adalah sholatnya orang-orang kafir. Kemudian, jika matahari sudah meninggi, maka sholatlah, karena sholat pada waktu itu disaksikan dan dihadiri (oleh para malaikat) hingga pertengahan siang. Saat matahari berada di pertengahan langit, maka janganlah kamu sholat, karena pada waktu itu api neraka sedang dinyalahkan hingga bayangan kembali muncul. Dan apabila bayangan sudah kembali maka sholatlah kamu, karena sholat pada waktu itu disaksikan dan dihadiri (oleh para malaikat) hingga matahari turun untuk terbenam. Ketika matahari hari hendak terbenam, maka janganlah kamu sholat hingga benar-benar terbenam, Karena matahari terbenam diantara dua tanduk syetan dan pada waktu itulah orang-orang kafir beribadah.\" Aku berkata, \"Wahai Nabi Allah, beritahulah aku tentang wudlu.\" Beliau bersabda: \"Tidaklah salah seorang dari kalian yang menyempurnakan wudlu, lalu ia berkumur-kumur dan beristinsyaq (menghirup air ke dalam hidung lalu menghembuskannya) kecuali dosa-dosa wajahnya, bibirnya dan hidungnya akan turut melebur. Kemudian, bila ia membasuh wajahnya sebagaimana yang diperintahkan Allah, niscaya dosa-dosa wajahnya akan melebur bersama air dari ujung-ujung jenggotnya. Dan tidaklah ia membasuh kedua tangannya hingga pergelangan siku kecuali dosa-dosa kedua tangannya akan melebur bersama air dari jari-jemarinya. Dan tidaklah ia membasuh kepalanya kecuali dosa-dosa kepalanya akan melebur bersama air dari ujung-ujung rambutnya. Dan tidaklah ia membasuh kedua kakinya hingga mata kaki kecuali dosa-dosa kedua kakinya juga melebur bersama air dari jari-jari kakinya. Dan bila ia berdiri dan sholat lalu memuji Allah serta menyanjung-Nya dan juga memujinya dengan sesuatu yang memang Dialah yang berhak atasnya lalu mengkhusyukkan hatinya semata-semata hanya untuk Allah, maka niscaya ia akan belepas diri dari dosa-dosanya sebagaimana hari ia dilahirkan oleh ibunya.\" Amru bin Habasyah menceritakan hadits ini kepada Abu Umamah salah seorang dari sahabat Rasulullallah shallallahu 'alaihi wasallam. Maka Abu Umamah pun berkata padanya, \"Wahai Amru bin Abasah, lihatlah apa yang telah kamu katakana di tempat yang sama, 'Laki-laki ini akan diberi.'\" Amru berkata, \"Wahai Abu Umamah, sungguh usiaku telah lanjut dan tulang-tulangku juga telah rapuh sementara ajalku pun telah dekat, maka tidaklah aku berhajat untuk berdusta atas nama Allah dan tidak juga atas nama Rasulullah shallallahu 'alaihi wasallam. Sekiranya aku tidak mendengarnya dari Rasulullah shallallahu 'alaihi wasallam kecuali hanya sekali atau dua kali, atau tiga kali -hingga ia menghitungnya sendiri sampai tujuh kali- niscaya aku tidak akan menceritakannya selama-lamanya. Akan tetapi aku telah mendengarnya lebih dari itu.\""
            },
            {
                "number": 1294,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِعَنْ عَائِشَةَ أَنَّهَا قَالَتْ وَهِمَ عُمَرُ إِنَّمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَحَرَّى طُلُوعُ الشَّمْسِ وَغُرُوبُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Abdullah bin Thawus] dari [bapaknya] dari [Aisyah] bahwa ia berkata; Umar telah keliru, hanyasanya Rasulullah shallallahu 'alaihi wasallam melarang melaksanakan sholat pada disaat matahari terbit dan disaat terbenam adalah jika dikerjakan dengan sengaja dan dengan anggapan bahwa hal itu lebih baik."
            },
            {
                "number": 1295,
                "arab": "و حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْلَمْ يَدَعْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ قَالَ فَقَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَتَحَرَّوْا طُلُوعَ الشَّمْسِ وَلَا غُرُوبَهَا فَتُصَلُّوا عِنْدَ ذَلِكَ",
                "id": "Dan telah menceritakan kepada kami [Hasan Al Hulwani] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [bapaknya] dari [Aisyah] bahwa ia berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah meninggalkan dua raka'at sesudah Ashar.\" Thawus berkata; Aisyah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu menunggu-nunggu waktu saat matahari terbit, dan jangan pula pada waktu matahari terbenam hingga kalian sholat pada waktu itu.\""
            },
            {
                "number": 1296,
                "arab": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ عَنْ بُكَيْرٍ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍأَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَرْسَلُوهُ إِلَى عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا اقْرَأْ عَلَيْهَا السَّلَامَ مِنَّا جَمِيعًا وَسَلْهَا عَنْ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ وَقُلْ إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا وَقَدْ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُمَا قَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أَضْرِبُ مَعَ عُمَرَ بْنِ الْخَطَّابِ النَّاسَ عَلَيْهَا قَالَ كُرَيْبٌ فَدَخَلْتُ عَلَيْهَا وَبَلَّغْتُهَا مَا أَرْسَلُونِي بِهِ فَقَالَتْ سَلْ أُمَّ سَلَمَةَ فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي بِهِ إِلَى عَائِشَةَ فَقَالَتْ أُمُّ سَلَمَةَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُمَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا أَمَّا حِينَ صَلَّاهُمَا فَإِنَّهُ صَلَّى الْعَصْرَ ثُمَّ دَخَلَ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنْ الْأَنْصَارِ فَصَلَّاهُمَا فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ فَقُلْتُ قُومِي بِجَنْبِهِ فَقُولِي لَهُ تَقُولُ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ إِنِّي أَسْمَعُكَ تَنْهَى عَنْ هَاتَيْنِ الرَّكْعَتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ قَالَ فَفَعَلَتْ الْجَارِيَةُ فَأَشَارَ بِيَدِهِ فَاسْتَأْخَرَتْ عَنْهُ فَلَمَّا انْصَرَفَ قَالَ يَا بِنْتَ أَبِي أُمَيَّةَ سَأَلْتِ عَنْ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ إِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ بِالْإِسْلَامِ مِنْ قَوْمِهِمْ فَشَغَلُونِي عَنْ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ",
                "id": "Telah menceritakan kepadaku [Harmalah bin Yahya At Tujibi] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Amru bin Harits] dari [Bukair] dari [Kuraib] Maula Ibnu Abbas, bahwa Abdullah bin Abbas dan Abdurrahman bin Azhar dan Al Miswar bin Makhramah mereka mengutusnya agar menemui Aisyah isteri Nabi shallallahu 'alaihi wasallam seraya berpesan, \"Sampaikan salam kami kepadanya dan tanyakan mengenai dua raka'at setelah Ashar kemudian katakanlah bahwa kami telah mendengar kabar bahwa Anda menunaikannya padahal telah sampai kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang dua raka'at itu.\" Ibnu Abbas berkata, \"Saya dan Umar pernah memukul beberapa orang karena menunaikan dua raka'at setelah Ashar.\" Kuraib berkata; Maka saya pun menemui Aisyah dan menyampaikan pesan-pesan mereka. Lalu Aisyah pun berkata, \"Tanyakanlah kepada [Ummu Salamah].\" Akhirnya aku pun kembali kepada mereka, dan menyampaikan komentar Aisyah. Kemudian mereka kembali mengutusku untuk menemui Ummu Aisyah dan menanyakan pertanyaan yang sama. Ummu Salamah menjawab, \"Saya telah mendengar Rasulullah shallallahu 'alaihi wasallam melarang sholat dua raka'at sesudah Ashar itu. Namun setelah itu, saya melihat beliau melakukannya. Dan memang sebelum menunaikannya, terlebih dahulu menunaikan sholat Ashar. Sesudah itu, beliau masuk menemuiku, sementara di sisiku terdapat beberapa orang wanita Anshar dari Bani Haram, kemudian beliau melaksanakan dua raka'at (Setelah Ashar itu). Lalu saya mengutus seorang budak wanita seraya berkata padanya, \"Berdirilah kamu di samping beliau, dan katakanlah padanya, 'Ummu Salamah berkata; Wahai Rasulullah, saya telah mendengar tuan melarang dua raka'at ini, namun saya melihat Anda melakukannya.' Dan jika ia memberi isyarat dengan tangannya, maka mundurlah.\" Budak wanita itu pun melakukannya, kemudian beliau memberi isyarat, maka budak wanita itu pun mundur. Usai menunaikan sholat, beliau bersabda: \"Wahai binti Abu Umayyah, kamu tadi menanyakan tentang dua raka'at setelah Ashar. Sesungguhnya saya telah didatangi oleh beberapa orang dari Bani Abdul Qais dengan menyatakan keIslaman kaumnya hingga mereka menyibukkanku untuk menunaikan dua raka'at setelah Zhuhur, maka dua raka'at ini sebagai penggantinya.\""
            },
            {
                "number": 1297,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَعَلِيُّ بْنُ حُجْرٍ قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ أَخْبَرَنِي مُحَمَّدٌ وَهُوَ ابْنُ أَبِي حَرْمَلَةَ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَأَنَّهُ سَأَلَ عَائِشَةَ عَنْ السَّجْدَتَيْنِ اللَّتَيْنِ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيهِمَا بَعْدَ الْعَصْرِ فَقَالَتْ كَانَ يُصَلِّيهِمَا قَبْلَ الْعَصْرِ ثُمَّ إِنَّهُ شُغِلَ عَنْهُمَا أَوْ نَسِيَهُمَا فَصَلَّاهُمَا بَعْدَ الْعَصْرِ ثُمَّ أَثْبَتَهُمَا وَكَانَ إِذَا صَلَّى صَلَاةً أَثْبَتَهَاقَالَ يَحْيَى بْنُ أَيُّوبَ قَالَ إِسْمَعِيلُ تَعْنِي دَاوَمَ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ali bin Hujr] -Ibnu Ayyub- berkata, telah menceritakan kepada kami [Isma'il] ia adalah -Ibnu Ja'far- telah mengabarkan kepadaku [Muhammad] -ia adalah Ibnu Abu Harmalah- ia berkata, telah mengabarkan kepadaku [Abu Salamah] bahwa ia pernah bertanya kepada [Aisyah] mengenai dua sujud yang dilakukan oleh Rasulullah shallallahu 'alaihi wasallam sesudah sholat Ashar, maka ia menjawab; \"Dulu beliau melakukannya sebelum Ashar, kemudian beliau tersibukkan darinya atau lupa, sehingga beliau melaksanakannya sesudah sholat Ashar kemudian beliau selalu menunaikannya. Dan biasanya, bila beliau melaksanakan suatu sholat, maka beliau menekuninya.\" Yahya bin Ayyub berkata; Isma'il berkata, \"Yakni beliau selalu menunaikannya.\""
            },
            {
                "number": 1298,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْمَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ بَعْدَ الْعَصْرِ عِنْدِي قَطُّ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] semuanya dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] ia berkata; Menurutku, Rasulullah shallallahu 'alaihi wasallam sama sekali tidak pernah meninggalkan dua raka'at sesudah Ashar.\""
            },
            {
                "number": 1299,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ وَاللَّفْظُ لَهُ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ أَخْبَرَنَا أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْصَلَاتَانِ مَا تَرَكَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي قَطُّ سِرًّا وَلَا عَلَانِيَةً رَكْعَتَيْنِ قَبْلَ الْفَجْرِ وَرَكْعَتَيْنِ بَعْدَ الْعَصْرِ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] -dalam jalur lain- Dan telah menceritakan kepada kami [Ali bin Hujr] -dengan lafazh hadits darinya- telah mengabarkan kepada kami [Ali bin Mushir] telah mengabarkan kepada kami [Abu Ishaq Asy Syaibani] dari [Abdurrahman bin Al Aswad] dari [bapaknya] dari [Aisyah] ia berkata; \"Ada dua sholat yang sama sekali tidak pernah ditinggalkan oleh Rasulullah shallallahu 'alaihi wasallam di rumahku, baik secara sembunyi maupun terang-terangan, yaitu dua raka'at sebelum subuh dan dua raka'at sesudah asar.\""
            },
            {
                "number": 1300,
                "arab": "و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ وَمَسْرُوقٍ قَالَا نَشْهَدُ عَلَى عَائِشَةَ أَنَّهَا قَالَتْمَا كَانَ يَوْمُهُ الَّذِي كَانَ يَكُونُ عِنْدِي إِلَّا صَلَّاهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي تَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ",
                "id": "Telah menceritakan kepada kami [Ibnul Mutsanna] dan [Ibnu Basysyar] -Ibnul Mutsanna- berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Aswad] dan [Masruq] keduanya berkata, kami menyaksikan [Aisyah] bahwa ia berkata, \"Tidak ada satu hari pun dari hari-hari Rasulullah shallallahu 'alaihi wasallam yang beliau habiskan di tempatku, kecuali beliau menunaikan dua raka'at itu, yakni dua raka'at sesudah asar.\""
            },
            {
                "number": 1301,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ ابْنِ فُضَيْلٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ مُخْتَارِ بْنِ فُلْفُلٍ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ التَّطَوُّعِ بَعْدَ الْعَصْرِ فَقَالَ كَانَ عُمَرُ يَضْرِبُ الْأَيْدِي عَلَى صَلَاةٍ بَعْدَ الْعَصْرِوَكُنَّا نُصَلِّي عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ بَعْدَ غُرُوبِ الشَّمْسِ قَبْلَ صَلَاةِ الْمَغْرِبِ فَقُلْتُ لَهُ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّاهُمَا قَالَ كَانَ يَرَانَا نُصَلِّيهِمَا فَلَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] semuanya dari [Ibnu Fudlail], [Abu Bakar] berkata, telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Mukhtar bin Fulful] ia berkata, saya bertanya kepada [Anas bin Malik] mengenai sholat tathawwu' sesudah sholat asar. Maka ia menjawab, \"Dulu Umar memukul tangan seseorang karena sholat sesudah Asar. Dan pada masa Rasulullah shallallahu 'alaihi wasallam kami biasa menunaikan dua raka'at setelah terbenamnya matahari dan sebelum sholat Maghrib.\" Saya bertanya lagi padanya, \"Apakah Rasulullah shallallahu 'alaihi wasallam pernah melakukannya?\" Ia menjawab, \"Beliau melihat kami melakukannya, namun beliau tidak memerintahkan kami dan tidak pula melarang.\""
            },
            {
                "number": 1302,
                "arab": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ وَهُوَ ابْنُ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنَّا بِالْمَدِينَةِ فَإِذَا أَذَّنَ الْمُؤَذِّنُ لِصَلَاةِ الْمَغْرِبِ ابْتَدَرُوا السَّوَارِيَ فَيَرْكَعُونَ رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى إِنَّ الرَّجُلَ الْغَرِيبَ لَيَدْخُلُ الْمَسْجِدَ فَيَحْسِبُ أَنَّ الصَّلَاةَ قَدْ صُلِّيَتْ مِنْ كَثْرَةِ مَنْ يُصَلِّيهِمَا",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Abdul Warits] dari [Abdul Aziz] dan ia adalah Ibnu Shuhaib dari [Anas bin Malik] ia berkata; \"Dulu, ketika kami di Madinah, bila sang muadzin telah mengumandangkan adzan Maghrib, maka para sahabat segera mendekati tiang-tiang masjid lalu mereka melaksanakan sholat dua rakaat-dua rakaat, sampai sekiranya ada orang asing masuk masjid, niscaya akan menyangka bahwa sholat telah ditunaikan karena banyaknya orang yang melakukannya.\""
            },
            {
                "number": 1303,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَوَكِيعٌ عَنْ كَهْمَسٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ قَالَهَا ثَلَاثًا قَالَ فِي الثَّالِثَةِ لِمَنْ شَاءَو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ فِي الرَّابِعَةِ لِمَنْ شَاءَ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dan [Waki'] dari [Kahmas] ia berkata, telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Abdullah bin Mughaffal Al Muzani] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diantara setiap dua adzan itu ada sholat tathawwu'.\" Beliau mengulanginya hingga tiga kali. Dan pada kali yang ketiga beliau bersabda: \"Bagi siapa saja yang mau mengerjakannya.\" Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la] dari [Al Jurairi] dari [Abdullah bin Buraidah] dari [Abdullah bin Mughaffal] dari Nabi shallallahu 'alaihi wasallam semisalnya. Hanya saja ia mengatakan; Pada kali yang keempat, \"Bagi siapa yang mau.\""
            },
            {
                "number": 1304,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَةً وَالطَّائِفَةُ الْأُخْرَى مُوَاجِهَةُ الْعَدُوِّ ثُمَّ انْصَرَفُوا وَقَامُوا فِي مَقَامِ أَصْحَابِهِمْ مُقْبِلِينَ عَلَى الْعَدُوِّ وَجَاءَ أُولَئِكَ ثُمَّ صَلَّى بِهِمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً ثُمَّ سَلَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَضَى هَؤُلَاءِ رَكْعَةً وَهَؤُلَاءِ رَكْعَةًو حَدَّثَنِيهِ أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا فُلَيْحٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّهُ كَانَ يُحَدِّثُ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْخَوْفِ وَيَقُولُ صَلَّيْتُهَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْمَعْنَى",
                "id": "Telah menceritakan kepada kami [Abdu bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah sholat Khauf bersama kami. Mula-mula satu kelompok pasukan mengikuti beliau sholat satu raka'at, sedangkan kelompok yang lain berjaga-jaga menghadap ke arah musuh. Setelah selesai satu raka'at, kelompok pertama pergi berjaga-jaga, menggantikan kelompok kedua, sedangkan kelompok kedua sholat bersama Rasulullah shallallahu 'alaihi wasallam. Kemudian setelah Rasulullah shallallahu 'alaihi wasallam selesai sholat, masing-masing rombongan menyempurnakan sholat mereka satu raka'at lagi.\" Dan telah menceritakannya kepadaku [Abu Rabi' Az Zhahrani] telah menceritakan kepada kami [Fulaih] dari [Az Zuhri] dari [Salim bin Abdullah bin Umar] dari [bapaknya] bahwa ia menceritakan tentang sholat Khauf Rasulullah shallallahu 'alaihi wasallam. Dan ia berkata; Saya pernah sholat Khauf bersama Rasulullah shallallahu 'alaihi wasallam. Yakni semakna dengan ini."
            },
            {
                "number": 1305,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فِي بَعْضِ أَيَّامِهِ فَقَامَتْ طَائِفَةٌ مَعَهُ وَطَائِفَةٌ بِإِزَاءِ الْعَدُوِّ فَصَلَّى بِالَّذِينَ مَعَهُ رَكْعَةً ثُمَّ ذَهَبُوا وَجَاءَ الْآخَرُونَ فَصَلَّى بِهِمْ رَكْعَةً ثُمَّ قَضَتْ الطَّائِفَتَانِ رَكْعَةً رَكْعَةًقَالَ وَقَالَ ابْنُ عُمَرَ فَإِذَا كَانَ خَوْفٌ أَكْثَرَ مِنْ ذَلِكَ فَصَلِّ رَاكِبًا أَوْ قَائِمًا تُومِئُ إِيمَاءً",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yahya bin Adam] dari [Sufyan] dari [Musa bin Uqbah] dari [Nafi'] dari [Ibnu Umar] ia berkata; \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam pernah mengimami sholat khauf. Mula-mula beliau sholat satu raka'at dengan satu kelompok pasukan, sedangkan pasukan yang lain berjaga-jaga menghadapi musuh. Usai satu raka'at, kelompok pertama berjaga-jaga dan kelompok kedua sholat mengikuti Rasulullah shallallahu 'alaihi wasallam satu raka'at. Sesudah itu, masing-masing kelompok menyempurnakan sholat mereka satu raka'at lagi.\" Ibnu Umar berkata, \"Apabila situasi kemanan lebih parah dari itu, maka beliau sholat di atas kendaraan atau sambil berdiri, dengan cara menggunakan isyarat (kepala atau mata).\""
            },
            {
                "number": 1306,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَشَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَصَفَّنَا صَفَّيْنِ صَفٌّ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْعَدُوُّ بَيْنَنَا وَبَيْنَ الْقِبْلَةِ فَكَبَّرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَبَّرْنَا جَمِيعًا ثُمَّ رَكَعَ وَرَكَعْنَا جَمِيعًا ثُمَّ رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَرَفَعْنَا جَمِيعًا ثُمَّ انْحَدَرَ بِالسُّجُودِ وَالصَّفُّ الَّذِي يَلِيهِ وَقَامَ الصَّفُّ الْمُؤَخَّرُ فِي نَحْرِ الْعَدُوِّ فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السُّجُودَ وَقَامَ الصَّفُّ الَّذِي يَلِيهِ انْحَدَرَ الصَّفُّ الْمُؤَخَّرُ بِالسُّجُودِ وَقَامُوا ثُمَّ تَقَدَّمَ الصَّفُّ الْمُؤَخَّرُ وَتَأَخَّرَ الصَّفُّ الْمُقَدَّمُ ثُمَّ رَكَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَكَعْنَا جَمِيعًا ثُمَّ رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَرَفَعْنَا جَمِيعًا ثُمَّ انْحَدَرَ بِالسُّجُودِ وَالصَّفُّ الَّذِي يَلِيهِ الَّذِي كَانَ مُؤَخَّرًا فِي الرَّكْعَةِ الْأُولَى وَقَامَ الصَّفُّ الْمُؤَخَّرُ فِي نُحُورِ الْعَدُوِّ فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السُّجُودَ وَالصَّفُّ الَّذِي يَلِيهِ انْحَدَرَ الصَّفُّ الْمُؤَخَّرُ بِالسُّجُودِ فَسَجَدُوا ثُمَّ سَلَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَلَّمْنَا جَمِيعًا قَالَ جَابِرٌ كَمَا يَصْنَعُ حَرَسُكُمْ هَؤُلَاءِ بِأُمَرَائِهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Abdul Malik bin Abu Sulaiman] dari [Atha`] dari [Jabir bin Abdullah] ia berkata; \"Aku pernah ikut menunaikan sholat Khauf bersama Rasulullah shallallahu 'alaihi wasallam. Kami berbaris dua shaf di belakang Rasulullah shallallahu 'alaihi wasallam, sedangkan musuh berada tepat antara kami dan kiblat (di hadapan kami). Mula-mula Nabi shallallahu 'alaihi wasallam bertakbir, lalu kami semua ikut bertakbir. Kemudian beliau ruku' dan kami pun ikut ruku' semua. Kemudian beliau I'tidal (bangkit) dari ruku', maka kami bangkit pula semuanya. Sesudah itu, beliau turun untuk sujud bersama-sama dengan shaf yang pertama, sedangkan shaf kedua tetap berdiri untuk berjaga-jaga. Ketika Nabi shallallahu 'alaihi wasallam bersama shaf pertama telah selesai sujud dan telah berdiri, barulah shaf kedua turun untuk sujud, dan mereka terus bangun kembali. Sesudah itu, shaf kedua maju ke depan, sedangkan shaf pertama mundur. Kemudian Nabi shallallahu 'alaihi wasallam ruku' dan kami ruku' pula semuanya. Kemudian beliau bangkit dari ruku', lalu kami bangkit pula semuanya. Kemudian beliau turun untuk sujud diikuti oleh shaf yang berada di belakang beliau. Sedangkan shaf yang setelahnya (tadinya shaf pertama) tetap berdiri untuk berjaga-jaga ke arah musuh. Ketika Nabi shallallahu 'alaihi wasallam dan shaf yang berada di belakangnya telah selesai sujud, barulah shaf yang kedua turun untuk sujud. Kemudian Nabi shallallahu 'alaihi wasallam mengucapkan salam, dan kami pun mengucapkan salam semuanya.\" Jabir berkata; Sebagaimana yang dilakukan oleh para penjaga kalian bersama para pemimpinnya."
            },
            {
                "number": 1307,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَغَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَوْمًا مِنْ جُهَيْنَةَ فَقَاتَلُونَا قِتَالًا شَدِيدًا فَلَمَّا صَلَّيْنَا الظُّهْرَ قَالَ الْمُشْرِكُونَ لَوْ مِلْنَا عَلَيْهِمْ مَيْلَةً لَاقْتَطَعْنَاهُمْ فَأَخْبَرَ جِبْرِيلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ فَذَكَرَ ذَلِكَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَقَالُوا إِنَّهُ سَتَأْتِيهِمْ صَلَاةٌ هِيَ أَحَبُّ إِلَيْهِمْ مِنْ الْأَوْلَادِ فَلَمَّا حَضَرَتْ الْعَصْرُ قَالَ صَفَّنَا صَفَّيْنِ وَالْمُشْرِكُونَ بَيْنَنَا وَبَيْنَ الْقِبْلَةِ قَالَ فَكَبَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَبَّرْنَا وَرَكَعَ فَرَكَعْنَا ثُمَّ سَجَدَ وَسَجَدَ مَعَهُ الصَّفُّ الْأَوَّلُ فَلَمَّا قَامُوا سَجَدَ الصَّفُّ الثَّانِي ثُمَّ تَأَخَّرَ الصَّفُّ الْأَوَّلُ وَتَقَدَّمَ الصَّفُّ الثَّانِي فَقَامُوا مَقَامَ الْأَوَّلِ فَكَبَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَبَّرْنَا وَرَكَعَ فَرَكَعْنَا ثُمَّ سَجَدَ مَعَهُ الصَّفُّ الْأَوَّلُ وَقَامَ الثَّانِي فَلَمَّا سَجَدَ الصَّفُّ الثَّانِي ثُمَّ جَلَسُوا جَمِيعًا سَلَّمَ عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو الزُّبَيْرِ ثُمَّ خَصَّ جَابِرٌ أَنْ قَالَ كَمَا يُصَلِّي أُمَرَاؤُكُمْ هَؤُلَاءِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Zubair] dari [Jabir] ia berkata; Kami pernah berperang bersama Rasulullah shallallahu 'alaihi wasallam menghadapi orang-orang Juhainah. Mereka menyerang kami dengan serangan yang dahsyat. Ketika kami menunaikan sholat Zhuhur, orang-orang musyrik itu berkata, \"Seandainya kita menyerang mereka, pasti kita akan mengalahkan mereka.\" Maka Malaikat Jibril memberitahukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam pun memberitakannya kepada kami. Para sahabat mengatakan bahwa akan tiba kepada mereka suatu sholat yang lebih mereka senangi daripada anak-anak. Ketika waktu Asar tiba, beliau membariskan kami untuk sholat dalam dua shaf, sementara orang-orang musyrik berada di antara kami dan kiblat. Lalu Rasulullah shallallahu 'alaihi wasallam bertakbir, dan kami pun ikut bertakbir. Beliau ruku' kami pun ruku'. Kemudian beliau sujud, kami pun sujud. Lalu shaf pertama mundur dan shaf kedua maju (tukar posisi) untuk berdiri di tempat shaf pertama. Kemudian Rasulullah shallallahu 'alaihi wasallam bertakbir, kami ikut bertakbir, dan beliau ruku' kami pun ruku', lalu beliau sujud dengan diikuti shaf pertama sedangkan shaf kedua tetap berdiri. Setelah shaf kedua sujud, kemudian mereka semuanya duduk, maka Rasulullah shallallahu 'alaihi wasallam mengucapkan salam.\" Abu Zubair berkata; Jabir mengkhususkan, \"Sebagaimana shalaf (Khauf) yang dilakukan oleh para pemimpin kalian.\""
            },
            {
                "number": 1308,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ خَوَّاتِ بْنِ جُبَيْرٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِأَصْحَابِهِ فِي الْخَوْفِ فَصَفَّهُمْ خَلْفَهُ صَفَّيْنِ فَصَلَّى بِالَّذِينَ يَلُونَهُ رَكْعَةً ثُمَّ قَامَ فَلَمْ يَزَلْ قَائِمًا حَتَّى صَلَّى الَّذِينَ خَلْفَهُمْ رَكْعَةً ثُمَّ تَقَدَّمُوا وَتَأَخَّرَ الَّذِينَ كَانُوا قُدَّامَهُمْ فَصَلَّى بِهِمْ رَكْعَةً ثُمَّ قَعَدَ حَتَّى صَلَّى الَّذِينَ تَخَلَّفُوا رَكْعَةً ثُمَّ سَلَّمَ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Mu'adz Al 'Anbari] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Syu'bah] dari [Abdurrahman bin Qasim] dari [bapaknya] dari [Shalih bin Khawwat bin Jubair] dari [Sahl bin Abu Hatsmah] bahwasanya; Rasulullah shallallahu 'alaihi wasallam pernah sholat Khauf bersama para sahabatnya. Maka beliau membariskan mereka menjadi dua shaf di belakangnya. Kemudian beliau sholat satu raka'at bersama shaf yang tepat berada di belakang beliau. Setelah menunaikan satu raka'at, mereka pun berdiri dan terus berdiri, hingga shaf kedua selesai sholat satu raka'at. Setelah shaf kedua selesai sholat raka'at, mereka maju ke depan sementara shaf yang tadinya di depan mundur, maka beliau shalaf bersama mereka satu raka'at. Kemudian beliau duduk hingga shaf yang dibelakang sholat satu raka'at, setelah itu baru beliau salam.\""
            },
            {
                "number": 1309,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَمَّنْ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ ذَاتِ الرِّقَاعِ صَلَاةَ الْخَوْفِأَنَّ طَائِفَةً صَفَّتْ مَعَهُ وَطَائِفَةٌ وِجَاهَ الْعَدُوِّ فَصَلَّى بِالَّذِينَ مَعَهُ رَكْعَةً ثُمَّ ثَبَتَ قَائِمًا وَأَتَمُّوا لِأَنْفُسِهِمْ ثُمَّ انْصَرَفُوا فَصَفُّوا وِجَاهَ الْعَدُوِّ وَجَاءَتْ الطَّائِفَةُ الْأُخْرَى فَصَلَّى بِهِمْ الرَّكْعَةَ الَّتِي بَقِيَتْ ثُمَّ ثَبَتَ جَالِسًا وَأَتَمُّوا لِأَنْفُسِهِمْ ثُمَّ سَلَّمَ بِهِمْ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Yazid bin Ruman] dari [Shalih bin Khawwat] dari [seorang] yang pernah sholat Khauf bersama Rasulullah shallallahu 'alaihi wasallam pada hari Dzatur Riqa'. Bahwa satu kelompok berbaris satu shaf di belakang beliau, sementara kelompok yang lain berjaga-jaga dengan menghadap ke arah musuh. Maka beliau pun sholat satu raka'at bersama kelompok pertama, kemudian beliau berdiri dan tetap berdiri, lalu kelompok pertama tadi menyempurnakan sholatnya masing-masing dan bubar kemudian membuat shaf untuk menghadapi musuh. Setelah itu, datanglah kelompok kedua sehingga beliau sholat bersama mereka satu raka'at, kemudian beliau duduk, sementara mereka menyempurnakan sholatnya masing-masing, baru kemudian beliau salam bersama mereka."
            },
            {
                "number": 1310,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَأَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كُنَّا بِذَاتِ الرِّقَاعِ قَالَ كُنَّا إِذَا أَتَيْنَا عَلَى شَجَرَةٍ ظَلِيلَةٍ تَرَكْنَاهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَجَاءَ رَجُلٌ مِنْ الْمُشْرِكِينَ وَسَيْفُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُعَلَّقٌ بِشَجَرَةٍ فَأَخَذَ سَيْفَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَرَطَهُ فَقَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَخَافُنِي قَالَ لَا قَالَ فَمَنْ يَمْنَعُكَ مِنِّي قَالَ اللَّهُ يَمْنَعُنِي مِنْكَ قَالَ فَتَهَدَّدَهُ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَغْمَدَ السَّيْفَ وَعَلَّقَهُ قَالَ فَنُودِيَ بِالصَّلَاةِ فَصَلَّى بِطَائِفَةٍ رَكْعَتَيْنِ ثُمَّ تَأَخَّرُوا وَصَلَّى بِالطَّائِفَةِ الْأُخْرَى رَكْعَتَيْنِ قَالَ فَكَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعُ رَكَعَاتٍ وَلِلْقَوْمِ رَكْعَتَانِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Aban bin Yazid] telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Jabir] ia berkata; Kami berangkat bersama Rasulullah shallallahu 'alaihi wasallam hingga sampailah kami di Dzatur Riqa'. Biasanya, bila kami mendapati sebatang pohon yang bisa digunakan untuk berteduh, maka kami menjadikannya sebagai tempat peristirahatan Rasulullah shallallahu 'alaihi wasallam. Di kala itu, datanglah seorang laki-laki dari kaum musyrikin, sementara pedang Rasulullah shallallahu 'alaihi wasallam tergantung di pohon. Maka laki-laki musyrik itu pun mengambil pedang Rasulullah shallallahu 'alaihi wasallam dan menghunuskannya seraya berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Apakah kamu takut padaku?\" beliau menjawab: \"Tidak.\" Laki-laki itu bertanya lagi, \"Lalu siapa yang akan menolongmu dari ancamanku?\" beliau menjawab: \"Allah-lah yang akan menolongku dari ancamanmu.\" Lalu para sahabat pun menakuti-nakutinya hingga ia memasukkan kembali pedang itu ke dalam sarungnya dan menggantungnya. Setelah itu, dikumandangkanlah adzan untuk mengerjakan sholat. Maka mula-mula beliau sholat dengan satu kelompok sebanyak dua raka'at, setelah itu, mereka pun mundur. Kemudian datanglah kelompok lain dan sholat bersama beliau dua raka'at. Sehingga Rasulullah shallallahu 'alaihi wasallam mengerjakannya empat raka'at, sementara masing-masing kelompok dua raka'at."
            },
            {
                "number": 1311,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ أَخْبَرَنِي يَحْيَى أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ جَابِرًا أَخْبَرَهُأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَتَيْنِ ثُمَّ صَلَّى بِالطَّائِفَةِ الْأُخْرَى رَكْعَتَيْنِ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ رَكَعَاتٍ وَصَلَّى بِكُلِّ طَائِفَةٍ رَكْعَتَيْنِ",
                "id": "Dan telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Yahya] -yaitu putranya Hassan- telah menceritakan kepada kami [Mu'awiyah] -yaitu putranya Sallam- telah mengabarkan kepadaku [Yahya] telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] bahwa [Jabir] telah mengabarkan kepadanya, bahwasanya; Dia pernah sholat Khauf bersama Rasulullah shallallahu 'alaihi wasallam. Mula-mula beliau sholat dua rakaat bersama dengan salah satu dari dua pasukan. Kemudian beliau sholat dua raka'at pula dengan pasukan yang lain. Sehingga beliau shallallahu 'alaihi wasallam mengerjakan sholat empat raka'at, dimana beliau mengerjakan sholat bersama masing-masing pasukan sebanyak dua raka'at."
            },
            {
                "number": 1312,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَأْتِيَ الْجُمُعَةَ فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Muhammad bin Rumh bin Al Muhajir] keduanya berkata, telah mengabarkan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Laits] dari [Nafi'] dari [Abdullah] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian hendak menunaikan sholat Jum'at, hendaklah ia mandi terlebih dahulu.\""
            },
            {
                "number": 1313,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ وَهُوَ قَائِمٌ عَلَى الْمِنْبَرِ مَنْ جَاءَ مِنْكُمْ الْجُمُعَةَ فَلْيَغْتَسِلْو حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ سَالِمٍ وَعَبْدِ اللَّهِ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepada kami [Laits] dari [Ibnu Syihab] dari [Abdullah bin Abdullah bin Umar] dari [Abdullah bin Umar] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda disaat berada di atas mimbar: \"Barangsiapa di antara kalian ingin mendatangi sholat Jum'at hendaklah ia mandi.\" Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dari [Salim] dan [Abdullah] -keduanya adalah anak Abdullah bin Umar- dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan hadits semisalnya. Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [bapaknya] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda. Yakni dengan hadits yang serupa."
            },
            {
                "number": 1314,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ بَيْنَا هُوَ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَادَاهُ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ إِنِّي شُغِلْتُ الْيَوْمَ فَلَمْ أَنْقَلِبْ إِلَى أَهْلِي حَتَّى سَمِعْتُ النِّدَاءَ فَلَمْ أَزِدْ عَلَى أَنْ تَوَضَّأْتُقَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِالْغُسْلِ",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [Salim bin Abdullah] dari [bapaknya] bahwa; Ketika [Umar bin Al Khaththab] sedang berkhuthbah pada hari jum'at dihadapan jama'ah, masuklah seorang laki-laki dari sahabat Rasulullah shallallahu 'alaihi wasallam, lalu Umar pun memanggilnya seraya bertanya, \"Sudah jam berapakah ini?\" Laki-laki itu menjawab, \"Aku sangat sibuk hari ini. Aku tidak sempat pulang, sehingga ketika kedengaran adzan, tidak ada yang dapat aku lakukan kecuali berwudlu.\" Umar berkata, \"Engkau hanya berwudlu?. Bukankah Engkau tahu bahwa Rasulullah shallallahu 'alaihi wasallam juga memerintahkan untuk mandi?\""
            },
            {
                "number": 1315,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ بَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ عُثْمَانُ بْنُ عَفَّانَ فَعَرَّضَ بِهِ عُمَرُ فَقَالَ مَا بَالُ رِجَالٍ يَتَأَخَّرُونَ بَعْدَ النِّدَاءِ فَقَالَ عُثْمَانُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا زِدْتُ حِينَ سَمِعْتُ النِّدَاءَ أَنْ تَوَضَّأْتُ ثُمَّ أَقْبَلْتُفَقَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا أَلَمْ تَسْمَعُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا جَاءَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Al Walid bin Muslim] dari [Al Auza'i] ia berkata, telah menceritakan kepadaku [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] telah menceritakan kepadaku [Abu Hurairah] ia berkata; Ketika [Umar bin Al Khathab] berkhutbah di hadapan manusia pada hari Jum'at, tiba-tiba masuklah Utsman bin Affan, maka Umar pun memanggilnya seraya bertanya, \"Bagaimana orang-orang pada terlambat setelah mendengar adza?\" Utsman pun menjawab, \"Wahai Amirul Mukminin, saya tidak berbuat lagi setelah mendengar adzan kecuali langsung berwudlu dan berangkat.\" Umar berkata, \"Wudlu juga harus. Tetapi, bukankan kalian telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Jika salah seorang dari kalian hendak menunaikan sholat Jum'at, hendaklah ia mandi terlebih dahulu.'\""
            },
            {
                "number": 1316,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Shafwan bin Sulaim] dari [Atha` bin Yasar] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari jum'at adalah wajib bagi setiap muhtalim (yang telah beranjak dewasa).\""
            },
            {
                "number": 1317,
                "arab": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكَانَ النَّاسُ يَنْتَابُونَ الْجُمُعَةَ مِنْ مَنَازِلِهِمْ مِنْ الْعَوَالِي فَيَأْتُونَ فِي الْعَبَاءِ وَيُصِيبُهُمْ الْغُبَارُ فَتَخْرُجُ مِنْهُمْ الرِّيحُ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْسَانٌ مِنْهُمْ وَهُوَ عِنْدِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّكُمْ تَطَهَّرْتُمْ لِيَوْمِكُمْ هَذَا",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] dan [Ahmad bin Isa] keduanya berkata. Telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru] dari [ubaidhullah bin Ja'far] bahwa [Muhammad bin Ja'far] telah menceritakan kepadanya dari [Urwah bin Zubair] dari [Aisyah] bahwa ia berkata; \"Ada orang-orang yang bergiliran datang untuk menunaikan sholat Jum'at dari rumah-rumah mereka di pegunungan. Mereka datang dengan memakai mantel lalu dipenuhi debu (hingga berbau tidak sedap). Beberapa orang di antara mereka mendatangi Rasulullah shallallahu 'alaihi wasallam yang ketika itu beliau berada di dekatku. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda kepada mereka: \"Alangkah baiknya, jika kalian pada hari ini mandi yang bersih.\""
            },
            {
                "number": 1318,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكَانَ النَّاسُ أَهْلَ عَمَلٍ وَلَمْ يَكُنْ لَهُمْ كُفَاةٌ فَكَانُوا يَكُونُ لَهُمْ تَفَلٌ فَقِيلَ لَهُمْ لَوْ اغْتَسَلْتُمْ يَوْمَ الْجُمُعَةِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] dari [Yahya bin Sa'id] dari [Amrah] dari [Aisyah] bahwa ia berkata; Dulu pada pekerja tidak memiliki pelayan hingga tubuh mereka mengeluarkan aroma yang tidak sedap, maka dikatakanlah kepada mereka, \"Sekiranya, kalian semua mandi pada hari jum'at.\""
            },
            {
                "number": 1319,
                "arab": "و حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ سَعِيدَ بْنَ أَبِي هِلَالٍ وَبُكَيْرَ بْنَ الْأَشَجِّ حَدَّثَاهُ عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ وَسِوَاكٌ وَيَمَسُّ مِنْ الطِّيبِ مَا قَدَرَ عَلَيْهِإِلَّا أَنَّ بُكَيْرًا لَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ وَقَالَ فِي الطِّيبِ وَلَوْ مِنْ طِيبِ الْمَرْأَةِ",
                "id": "Dan telah menceritakan kepada kami [Amru bin Sawwad Al Amiri] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepada kami [Amru bin Harits] bahwa [Sa'id bin Abu Hilal] dan [Bukair bin Al Asyaj] keduanya telah menceritakan kepadanya dari [Abu Bakr bin Al Munkadir] dari [Amru bin Sulaim] dari [Abdurrahman bin Abu Sa'id Al Khudri] dari [bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari jum'at adalah wajib bagi setiap muslim yang muhtalim (telah dewasa). Begitu pula menggosok gigi, memakai wewangian sekedar yang dapat ia lakukan.\" Kemudian Bukair tidak menyebutkan Abdurrahman. Dan ia berkata, berkenaan dengan wewangian; \"Meskipun dengan wewangian wanita.\""
            },
            {
                "number": 1320,
                "arab": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّهُ ذَكَرَ قَوْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْغُسْلِ يَوْمَ الْجُمُعَةِقَالَ طَاوُسٌ فَقُلْتُ لِابْنِ عَبَّاسٍ وَيَمَسُّ طِيبًا أَوْ دُهْنًا إِنْ كَانَ عِنْدَ أَهْلِهِ قَالَ لَا أَعْلَمُهُ و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ ح و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ كِلَاهُمَا عَنْ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepada kami [Hasan Al Hulwani] telah menceritakan kepada kami [Rauh bin Ubadah] telah menceritakan kepada kami [Ibnu Juraij] -dalam jalur lain- Dan telah menceritakan kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibrahim bin Maisarah] dari [Thawus] dari [Ibnu Abbas] bahwa ia menyebutkan sabda Nabi shallallahu 'alaihi wasallam mengenai mandi pada hari Jum'at. [Thawus] berkata; Lalu saya bertanya kepada [Ibnu Abbas], \"Apakah beliau memakai wewangian atau minyak wangi saat berada bersama keluarganya?\" Ibnu Abbas menjawab, \"Saya tidak tahu.\" Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Muhammad bin Bakar] -dalam jalur lain- Dan Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Adl Dlahhak bin Makhlad] keduanya dari [Ibnu Juraij] dengan isnad ini."
            },
            {
                "number": 1321,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَقٌّ لِلَّهِ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَغْسِلُ رَأْسَهُ وَجَسَدَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Abdullah bin Thawus] dari [bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Merupakan hak Allah atas setiap muslim untuk mandi di setiap tujuh hari, dengan mencuci kepala dan seluruh badannya.\""
            },
            {
                "number": 1322,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الْإِمَامُ حَضَرَتْ الْمَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَ",
                "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] -sesuai yang telah dibacakan kepadanya- dari [Sumayy] Maula Abu Bakar, dari [Abu Shalih As Samman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mandi seperti mandi junub atau  junub pada hari jum'at, kemudian ia pergi ke masjid pada waktu yang pertama, maka pahalanya seperti pahala berkurban seekor unta. Siapa yang pergi ke masjid pada waktu kedua, maka pahalanya seperti berkorban seekor sapi. Dan siapa yang pergi ke masjid pada waktu yang ketiga, maka pahalanya seperti berkurban seekor kambing. Dan siapa yang pergi ke masjid pada waktu yang keempat, maka pahalanya seperti pahala berkorban dengan seekor ayam. Dan siapa yang tiba di masjid pada waktu yang kelima, maka pahalanya seperti berkurban sebutir telur. Apabila imam telah keluar, para malaikat hadir untuk mendengarkan khutbah (dan tidak ada lagi yang mencatat setelah itu).\""
            },
            {
                "number": 1323,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ قَالَ ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَو حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ وَعَنْ ابْنِ الْمُسَيَّبِ أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِهِ و حَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ بِالْإِسْنَادَيْنِ جَمِيعًا فِي هَذَا الْحَدِيثِ مِثْلَهُ غَيْرَ أَنَّ ابْنَ جُرَيْجٍ قَالَ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ قَارِظٍ",
                "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin Rumh bin Muhajir] -[Ibnu Rumh]- berkata, telah mengabarkan kepada kami [Laits] dari [Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bila kamu berkata kepada temanmu, 'Diamlah, ' pada hari jum'at padahal Imam sedang berkhutbah, maka sungguh telah sia-sialah ibadah Jum'atmu.\" Dan telah menceritakan kepadaku [Abdul Malik bin Syu'aib bin Laits] telah menceritakan kepadaku [bapakku] dari [kakekku] Uqail bin Khalid, dari [Ibnu Syihab] dari [Umar bin Abdul Aziz] dari [Abdullah bin Ibrahim bin Qarizh] dan dari [Ibnul Musayyab] bahwa keduanya telah menceritakan kepadanya bahwa [Abu Hurairah] berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda. Yakni dengan hadits semisalnya. Dan telah menceritakannya kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dengan dua sanad, yakni semua yang terdapat dalam haditsnya ini adalah serupa dengannya. Hanya saja [Ibnu Juraij] berkata; [Ibrahim bin Abdullah bin Qarizh]."
            },
            {
                "number": 1324,
                "arab": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغِيتَقَالَ أَبُو الزِّنَادِ هِيَ لُغَةُ أَبِي هُرَيْرَةَ وَإِنَّمَا هُوَ فَقَدْ لَغَوْتَ",
                "id": "Dan Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila kamu mengatakan kepada temanmu pada hari Jum'at, 'Diamlah, ' padahal Imam sedang berkhutbah, maka sungguh kamu telah berbuat kesia-siaan.\" Abu Zinad berkata; Kata, 'FAQAD LAGHIITA' adalah menurut bahasanya Abu Hurairah, namun yang benar adalah, 'FAQAD LAGHAUTA.'"
            },
            {
                "number": 1325,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ فِيهِ سَاعَةٌ لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُزَادَ قُتَيْبَةُ فِي رِوَايَتِهِ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا",
                "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] -dalam jalur lain- Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam menyebutkan tentang hari Jum'at, maka beliau bersabda: \"Di dalamnya terdapat satu waktu, tidaklah seorang muslim mendapati waktu itu lalu berdoa memohon kebaikan kepada Allah, kecuali Allah akan mengabulkan permohonannya.\" Qutaibah menambahkan di dalam riwayatnya; Beliau memberikan isyarat dengan tangannya, yakni waktunya sempit."
            },
            {
                "number": 1326,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجُمُعَةِ لَسَاعَةً لَا يُوَافِقُهَا مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ خَيْرًا إِلَّا أَعْطَاهُ إِيَّاهُ وَقَالَ بِيَدِهِ يُقَلِّلُهَا يُزَهِّدُهَاحَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ و حَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ حَدَّثَنَا سَلَمَةُ وَهُوَ ابْنُ عَلْقَمَةَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Abu Hurairah] ia berkata; Abul Qasim shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya pada hari Jum'at terdapat satu waktu, tidaklah seorang mukmin mendapati saat itu dengan berdo'a, memohon kebaikan kepada Allah, kecuali Allah akan mengabulkan permohonannya.\" Kemudian beliau memberikan isyarat dengan tangannya, yakni mempersempitnya. Telah menceritakan kepada kami [Ibnul Mutsanna] Telah menceritakan kepada kami [Ibnu Abu Adi] dari [Ibnu Aun] dari [Muhammad] dari [Abu Hurairah] ia berkata; Abul Qasim shallallahu 'alaihi wasallam bersabda: Yakni dengan hadits semisalnya. Dan telah menceritakan kepadaku [Humaid bin Mas'adah Al Bahili] Telah menceritakan kepada kami [Bisyr] yakni Ibnu Mufadldlal, Telah menceritakan kepada kami [Salamah bin Alqamah] dari [Muhammad] dari [Abu Hurairah] ia berkata; Abul Qasim shallallahu 'alaihi wasallam bersabda: Yakni dengan hadits yang semisalnya."
            },
            {
                "number": 1327,
                "arab": "و حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلَّامٍ الْجُمَحِيُّ حَدَّثَنَا الرَّبِيعُ يَعْنِي ابْنَ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ فِي الْجُمُعَةِ لَسَاعَةً لَا يُوَافِقُهَا مُسْلِمٌ يَسْأَلُ اللَّهَ فِيهَا خَيْرًا إِلَّا أَعْطَاهُ إِيَّاهُ قَالَ وَهِيَ سَاعَةٌ خَفِيفَةٌو حَدَّثَنَاه مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ وَهِيَ سَاعَةٌ خَفِيفَةٌ",
                "id": "Dan Telah menceritakan kepada kami [Abdurrahman bin Sallam Al Jumahi] Telah menceritakan kepada kami [Ar Rabi'] yakni Ibnu Muslim, dari [Muhammad bin Ziyad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Sesungguhnya pada hari Jum'at terdapat satu waktu, tidaklah seorang mukmin mendapati waktu tersebut dengan berdo'a, memohon kebaikan kepada Allah, kecuali Allah akan mengabulkan permohonannya. Dan waktu itu sangatlah singkat.\" Dan telah menceritakannya kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam; namun ia tidak mengatakan; \"Dan saat itu sangatlah sempit.\""
            },
            {
                "number": 1328,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَعَلِيُّ بْنُ خَشْرَمٍ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ مَخْرَمَةَ بْنِ بُكَيْرٍ ح و حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا مَخْرَمَةُ عَنْ أَبِيهِ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ أَسَمِعْتَ أَبَاكَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَأْنِ سَاعَةِ الْجُمُعَةِ قَالَ قُلْتُ نَعَمْ سَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هِيَ مَا بَيْنَ أَنْ يَجْلِسَ الْإِمَامُ إِلَى أَنْ تُقْضَى الصَّلَاةُ",
                "id": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Ali bin Khasyram] keduanya berkata, telah mengabarkan kepada kami [Ibnu Wahb] dari [Makhramah bin Bukair] -dalam jalur lain- Dan telah menceritakan kepada kami [Harun bin Sa'id Al Aili] dan [Ahmad bin Isa] keduanya berkata, telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami [Makhramah] dari [bapaknya] dari [Abu Burdah bin Abu Musa Al Asy'ari] ia berkata; Abdullah bin Umar bertanya padaku, \"Apakah kamu pernah mendengar [ayahmu] meriwayatkan hadits dari Rasulullah shallallahu 'alaihi wasallam perihal satu waktu (yang mustajab) pada hari Jum'at?\" Abu Burdah berkata; Saya menjawab, \"Ya, aku mendengarnya berkata: Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Waktunya ialah antara imam duduk (di mimbar) hingga selesai sholat Jum'at.\""
            },
            {
                "number": 1329,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ الْأَعْرَجُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abdurrahman bin Al A'raj] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik hari adalah hari Jum'at, karena pada hari itulah Adam diciptakan. Pada hari itu pula ia dimasukkan ke dalam surga dan pada hari itu pula ia dikeluarkan daripadanya.\""
            },
            {
                "number": 1330,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا وَلَا تَقُومُ السَّاعَةُ إِلَّا فِي يَوْمِ الْجُمُعَةِ",
                "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Al Mughirah] yakni Al Hizami, dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik hari adalah hari Jum'at, karena pada hari itulah Adam diciptakan. Pada hari itu pula ia dimasukkan ke dalam surga dan pada hari itu pula ia dikeluarkan daripadanya. Dan hari kiamat tidak terjadi kecuali pada hari Jum'at.\""
            },
            {
                "number": 1331,
                "arab": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّ كُلَّ أُمَّةٍ أُوتِيَتْ الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ ثُمَّ هَذَا الْيَوْمُ الَّذِي كَتَبَهُ اللَّهُ عَلَيْنَا هَدَانَا اللَّهُ لَهُ فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍو حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ وَابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بِمِثْلِهِ",
                "id": "Dan Telah menceritakan kepada kami [Amru An Naqid] Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita (umat Muhammad) adalah umat yang terakhir (datang ke dunia), tetapi kita adalah umat yang terdahulu (diadili) pada hari kiamat. Padahal seluruh umat telah diberi kitab sebelum kita, sedangkan kita (diberi kitab) setelah mereka. Kemudian pada hari ini, yakni hari yang telah ditetapkan oleh Allah untuk kita, Allah telah memberikan petunjuk kepada kita. Dan umat-umat lain terkait dengan hari itu adalah pengikut, bagi orang-orang Yahudi adalah esok, sementara bagi orang-orang Nasrani adalah esok lusa.\" Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] dan [Ibnu Thawus] dari [bapaknya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita (umat Muhammad) adalah umat yang terakhir (datang ke dunia), tetapi kita adalah umat yang terdahulu (diadili) pada hari kiamat.\" Yakni dengan hadits semisalnya."
            },
            {
                "number": 1332,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ الْأَوَّلُونَ يَوْمَ الْقِيَامَةِ وَنَحْنُ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ فَاخْتَلَفُوا فَهَدَانَا اللَّهُ لِمَا اخْتَلَفُوا فِيهِ مِنْ الْحَقِّ فَهَذَا يَوْمُهُمْ الَّذِي اخْتَلَفُوا فِيهِ هَدَانَا اللَّهُ لَهُ قَالَ يَوْمُ الْجُمُعَةِ فَالْيَوْمَ لَنَا وَغَدًا لِلْيَهُودِ وَبَعْدَ غَدٍ لِلنَّصَارَى",
                "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Zuhair bin Harb] keduanya berkata, telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita (umat Muhammad) adalah yang terakhir (datang ke dunia), tetapi yang terdahulu (diadili) pada hari kiamat. Kita adalah yang paling dahulu masuk surga, padahal mereka diberi kitab lebih dahulu dari kita, sedangkan kita sesudah mereka. Lalu mereka berselisih, kemudian Allah memberikan petunjuk kepada kita, yakni kebenaran dari apa yang mereka perselisihkan. Inilah hari yang mereka perselisihkan, sedangkan Allah telah menunjukkannya kepada kita.\" Beliau bersabda lagi: \"Maka hari ini (Jum'at) adalah untuk kita. Esok (hari Sabtu) untuk kaum Yahudi, dan lusa (Ahad) untuk kaum Nasrani.\""
            },
            {
                "number": 1333,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ أَخِي وَهْبِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَعَنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ الْآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ وَهَذَا يَوْمُهُمْ الَّذِي فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ لَهُ فَهُمْ لَنَا فِيهِ تَبَعٌ فَالْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ",
                "id": "Dan Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] saudaranya Wahb bin Munabbih, ia berkata, telah menceritakan kepada kami [Abu Hurairah] dari Muhammad shallallahu 'alaihi wasallam, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita (umat Muhammad) adalah yang terakhir (datang ke dunia), tetapi yang terdahulu (diadili) pada hari kiamat. Padahal mereka diberi kitab lebih dahulu dari kita, sedangkan kita sesudah mereka. Dan hari ini (Jum'at) adalah hari yang telah diwajibkan atas mereka, namun mereka berselisih tentangnya. Kemudian Allah menunjukkannya pada kita. Karena itu, umat-umat lain terkait dengan hari Jum'at adalah pengikut. Bagi kaum Yahudi, besok. Sedangkan bagi kaum Nasrani lusa.\""
            },
            {
                "number": 1334,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ وَوَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ وَعَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَضَلَّ اللَّهُ عَنْ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا فَكَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ وَكَانَ لِلنَّصَارَى يَوْمُ الْأَحَدِ فَجَاءَ اللَّهُ بِنَا فَهَدَانَا اللَّهُ لِيَوْمِ الْجُمُعَةِ فَجَعَلَ الْجُمُعَةَ وَالسَّبْتَ وَالْأَحَدَ وَكَذَلِكَ هُمْ تَبَعٌ لَنَا يَوْمَ الْقِيَامَةِ نَحْنُ الْآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالْأَوَّلُونَ يَوْمَ الْقِيَامَةِ الْمَقْضِيُّ لَهُمْ قَبْلَ الْخَلَائِقِوَفِي رِوَايَةِ وَاصِلٍ الْمَقْضِيُّ بَيْنَهُمْ حَدَّثَنَا أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ عَنْ سَعْدِ بْنِ طَارِقٍ حَدَّثَنِي رِبْعِيُّ بْنُ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُدِينَا إِلَى الْجُمُعَةِ وَأَضَلَّ اللَّهُ عَنْهَا مَنْ كَانَ قَبْلَنَا فَذَكَرَ بِمَعْنَى حَدِيثِ ابْنِ فُضَيْلٍ",
                "id": "Dan telah menceritakan kepada kami [Abu Kuraib] dan [Washil bin Abdul A'la] keduanya berkata, telah menceritakan kepada kami [Ibnu Fudlail] dari [Abu Malik Al Asyja'i] dari [Abu Hazim] dari [Abu Hurairah] dari [Rab'i bin Hirasy] dari [Hudzaifah] keduanya berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menyesatkan orang-orang yang sebelum kita tentang hari Jumat. Bagi orang Yahudi jatuhnya pada hari Sabtu, dan bagi orang Nasrani jatuhnya pada hari Ahad. Lalu Allah menunjuki kita yaitu pada hari Jum'at. Karena itu, terjadilah berturut-turut tiga hari berkumpul (hari besar), yaitu Jum'at, Sabtu dan Ahad. Hari kiamat kelak, mereka pun mengikuti kita juga, kita yang terakhir ke dunia, tetapi kitalah yang lebih dahulu diadili sebelum umat-umat yang lain.\" Sementara dalam riwayat Washil; \"Yang diadili di antara mereka.\" Telah menceritakan kepada kami [Abu Kuraib] telah mengabarkan kepada kami [Ibnu Abu Za`idah] dari [Sa'd bin Thariq] telah menceritakan kepadaku [Rib'i bin Hirasy] dari [Hudzaifah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita ditunjukkan dengan hari Jum'at, sementara Allah telah menyesatkan umat-umat sebelum kita darinya.\" Dan ia pun menyebutkan hadits yang semakna dengan hadits Ibnu Fudlail."
            },
            {
                "number": 1335,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو عَبْدِ اللَّهِ الْأَغَرُّ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَائِكَةٌ يَكْتُبُونَ الْأَوَّلَ فَالْأَوَّلَ فَإِذَا جَلَسَ الْإِمَامُ طَوَوْا الصُّحُفَ وَجَاءُوا يَسْتَمِعُونَ الذِّكْرَ وَمَثَلُ الْمُهَجِّرِ كَمَثَلِ الَّذِي يُهْدِي الْبَدَنَةَ ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً ثُمَّ كَالَّذِي يُهْدِي الْكَبْشَ ثُمَّ كَالَّذِي يُهْدِي الدَّجَاجَةَ ثُمَّ كَالَّذِي يُهْدِي الْبَيْضَةَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَعَمْرٌو النَّاقِدُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah] dan [Amru bin Sawwad Al Amiri] - [Abu Thahir] berkata- telah menceritakan kepada kami -sementara yang lain mengatakan- telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abu Abdullah Al Agharr] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila hari Jum'at telah tiba, para Malaikat berdiri di setiap pintu Masjid, mencatat orang yang pertama-tama datang dan seterusnya. Apabila Imam telah datang (naik mimbar), maka mereka pun menutup shuhuf (buku catatan) dan bersegera untuk mendengarkan khutbah. Perumpamaan orang yang pertama-tama datang adalah seperti berkorban dengan seekor unta. Kemudian orang yang datang sesudah itu, seperti orang yang berkurban dengan seekor lembu. Kemudian seperti orang yang berkurban kibas. Kemudian seperti orang yang berkurban dengan seekor ayam. Dan kemudian seperti orang yang berkurban dengan sebutir telur.\" Telah menceritakan kepada kami [Yahya bin Yahya] dan [Amru An Naqid] dari [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam semisalnya."
            },
            {
                "number": 1336,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَكٌ يَكْتُبُ الْأَوَّلَ فَالْأَوَّلَ مَثَّلَ الْجَزُورَ ثُمَّ نَزَّلَهُمْ حَتَّى صَغَّرَ إِلَى مَثَلِ الْبَيْضَةِ فَإِذَا جَلَسَ الْإِمَامُ طُوِيَتْ الصُّحُفُ وَحَضَرُوا الذِّكْرَ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub bin Abdurrahman] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Di setiap pintu Masjid terdapat Malaikat yang akan mencatat orang yang pertama kali datang dan seterusnya. Beliau mempermisalkan mereka seperti orang berkurban dengan seekor unta, kemudian diturunkannya lagi hingga seperti seorang yang berkurban dengan sebutir telur. Dan ketika Imam telah duduk, maka shuhuf (lembaran catatan) ditutup, dan para Malaikat pun menyimak khutbah.\""
            },
            {
                "number": 1337,
                "arab": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا رَوْحٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ ثُمَّ أَتَى الْجُمُعَةَ فَصَلَّى مَا قُدِّرَ لَهُ ثُمَّ أَنْصَتَ حَتَّى يَفْرُغَ مِنْ خُطْبَتِهِ ثُمَّ يُصَلِّي مَعَهُ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى وَفَضْلُ ثَلَاثَةِ أَيَّامٍ",
                "id": "Telah menceritakan kepada kami [Umayyah bin Bistham] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Rauh] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang mandi kemudian mendatangi Jum'at, lalu ia sholat semampuannya dan diam (mendengarkan khutbah) hingga selesai, kemudian ia lanjutkan dengan sholat bersama Imam, maka ia akan diampuni (dosa-dosa yang dilakukannya) antara hari itu dan hari jum'at yang lain. Dan bahkan hingga lebih tiga hari.\""
            },
            {
                "number": 1338,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَاسْتَمَعَ وَأَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ وَزِيَادَةُ ثَلَاثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] -Yahya berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berwudlu, lalu ia menyempurnakan wudlunya, kemudian mendatangi Jum'at, mendengarkan (khutbah) tanpa berkata-kata, maka akan diampuni (dosa-dosa yang dilakukannya) antara hari itu dengan hari jum'at yang lain, ditambah tiga hari. Dan barangsiapa yang memegang-megang batu kerikil, maka ia telah berbuat kesia-siaan.\""
            },
            {
                "number": 1339,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا قَالَ حَسَنٌ فَقُلْتُ لِجَعْفَرٍ فِي أَيِّ سَاعَةٍ تِلْكَ قَالَ زَوَالَ الشَّمْسِ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Hasan bin Ayyasy] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin Abdullah] ia berkata; Kami pernah sholat (Jum'at) bersama Rasulullah shallallahu 'alaihi wasallam, kemudian kami pulang dan mengistirahatkan ternak kami. Hasan berkata; Saya bertanya kepada Ja'far, \"Kapankah waktunya?\" ia menjawab, \"Saat tergelincirnya matahari.\""
            },
            {
                "number": 1340,
                "arab": "و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ ح و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ قَالَا جَمِيعًا حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ أَنَّهُ سَأَلَ جَابِرَ بْنَ عَبْدِ اللَّهِمَتَى كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْجُمُعَةَ قَالَ كَانَ يُصَلِّي ثُمَّ نَذْهَبُ إِلَى جِمَالِنَا فَنُرِيحُهَازَادَ عَبْدُ اللَّهِ فِي حَدِيثِهِ حِينَ تَزُولُ الشَّمْسُ يَعْنِي النَّوَاضِحَ",
                "id": "Dan telah menceritakan kepadaku [Al Qasim bin Zakariya] telah menceritakan kepada kami [Khalid bin Makhlad] -dalam jalur lain- Dan telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah menceritakan kepada kami [Yahya bin Hassan] keduanya berkata, telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Ja'far] dari [bapaknya] bahwa ia bertanya kepada [Jabir], \"Kapan Rasulullah shallallahu 'alaihi wasallam menunaikan sholat Jum'at?\" Ia menjawab, \"Bisanya beliau sholat Jum'at, kemudian setelah itu kami pulang ke ternak unta kami, dan mengistirahatkannya.\" Abdullah menambahkan di dalam haditsnya; \"Saat matahari tergelincir, yakni setelah unta diberi minum.\""
            },
            {
                "number": 1341,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ وَيَحْيَى بْنُ يَحْيَى وَعَلِيُّ بْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ سَهْلٍ قَالَمَا كُنَّا نَقِيلُ وَلَا نَتَغَدَّى إِلَّا بَعْدَ الْجُمُعَةِزَادَ ابْنُ حُجْرٍ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] dan [Yahya bin Yahya] dan [Ali bin Hujr] - [Yahya] berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [bapaknya] dari [Sahl] ia berkata; \"Biasanya kami tidak pernah tidur siang, dan tidak pula makan siang kecuali setelah menunaikan sholat Jum'at.\" Ibnu Hujr berkata; \"(Yakni) pada masa Rasulullah shallallahu 'alaihi wasallam.\""
            }
        ]
    }
}