{
    "status": true,
    "data": {
        "start": 448,
        "end": 596,
        "total": 149,
        "book": "muslim",
        "hadits": [
            {
                "number": 448,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ وَهُشَيْمٌ عَنْ الْأَعْمَشِ عَنْ مُنْذِرِ بْنِ يَعْلَى وَيُكْنَى أَبَا يَعْلَى عَنْ ابْنِ الْحَنَفِيَّةِ عَنْ عَلِيٍّ قَالَكُنْتُ رَجُلًا مَذَّاءً وَكُنْتُ أَسْتَحْيِي أَنْ أَسْأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمَكَانِ ابْنَتِهِ فَأَمَرْتُ الْمِقْدَادَ بْنَ الْأَسْوَدِ فَسَأَلَهُ فَقَالَ يَغْسِلُ ذَكَرَهُ وَيَتَوَضَّأُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Waki'] dan [Abu Muawiyah] serta [Husyaim] dari [al-A'masy] dari [Mundzir bin Ya'la], dan dia diberi gelar Abu Ya'la dari [Ibnu al-Hanafiyyah] dari [Ali] dia berkata, \"Aku adalah lelaki yang sering keluar madzi, tetapi aku malu untuk bertanya Nabi Shallallahu'alaihiwasallam karena puteri beliau adalah istriku sendiri. Maka kusuruh al-Miqdad bin al-Aswad supaya bertanya beliau, lalu beliau bersabda, \"Hendaklah dia membasuh kemaluannya dan berwudhu.\""
            },
            {
                "number": 449,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي سُلَيْمَانُ قَالَ سَمِعْتُ مُنْذِرًا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيٍّ أَنَّهُ قَالَاسْتَحْيَيْتُ أَنْ أَسْأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَذْيِ مِنْ أَجْلِ فَاطِمَةَ فَأَمَرْتُ الْمِقْدَادَ فَسَأَلَهُ فَقَالَ مِنْهُ الْوُضُوءُ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Habib al-Haritsi] telah menceritakan kepada kami [Khalid, yaitu bin Harits] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Sulaiman] dia berkata, Saya mendengar [Mundzir] dari [Muhammad bin Ali] dari [Ali] bahwa dia berkata, \"Saya malu untuk bertanya Nabi shallallahu 'alaihi wasallam tentang madzi karena (posisiku sebagai suami) Fathimah. Maka saya perintahkan al-Miqdad, lalu dia bertanya kepada beliau. Maka beliau bersabda, 'Karena madzi, juga harus berwudhu'.\""
            },
            {
                "number": 450,
                "arab": "و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَحْمَدُ بْنُ عِيسَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ عَنْ أَبِيهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍأَرْسَلْنَا الْمِقْدَادَ بْنَ الْأَسْوَدِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ الْمَذْيِ يَخْرُجُ مِنْ الْإِنْسَانِ كَيْفَ يَفْعَلُ بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأْ وَانْضَحْ فَرْجَكَ",
                "id": "Telah menceritakan kepadaku [Harun bin Sa'id al-Aili] dan [Ahmad bin Isa] keduanya berkata, telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Makhramah bin Bukair] dari [bapaknya] dari [Sulaiman bin Yasar] dari [Ibnu Abbas] dia berkata, \" [Ali bin Abi Thalib] berkata, 'Kami mengutus al-Miqdad bin al-Aswad kepada Rasulullah Shallallahu'alaihiwasallam, lalu dia menanyakan beliau tentang madzi yang keluar dari manusia, apa yang (harus) ia perbuat? ' Maka Rasulullah shallallahu 'alaihi wasallam bersabda, 'Berwudhulah, dan siramlah kemaluanmu'.\""
            },
            {
                "number": 451,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ مِنْ اللَّيْلِ فَقَضَى حَاجَتَهُ ثُمَّ غَسَلَ وَجْهَهُ وَيَدَيْهِ ثُمَّ نَامَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Salamah bin Kuhail] dari [Kuraib] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam pernah bangun di suatu malam untuk buang hajat, lalu beliau membasuh wajahnya dan mencuci tangannya kemudian tidur lagi."
            },
            {
                "number": 452,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ قَبْلَ أَنْ يَنَامَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya at-Tamimi] dan [Muhammad bin Rumh] keduanya berkata, telah mengabarkan kepada kami [al-Laits] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam berkata, \"Apabila Rasulullah Shallallahu'alaihiwasallam ingin tidur, sedangkan beliau masih dalam keadaan berjunub, maka beliau berwudhu dengan wudhu untuk mengerjakan sholat sebelum tidur.\""
            },
            {
                "number": 453,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ عُلَيَّةَ وَوَكِيعٌ وَغُنْدَرٌ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ جُنُبًا فَأَرَادَ أَنْ يَأْكُلَ أَوْ يَنَامَ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ قَالَ حَدَّثَنَا أَبِي قَالَا حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ قَالَ ابْنُ الْمُثَنَّى فِي حَدِيثِهِ حَدَّثَنَا الْحَكَمُ سَمِعْتُ إِبْرَاهِيمَ يُحَدِّثُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ibnu Ulayyah] dan [Waki'] serta [Ghundar] dari [Syu'bah] dari [al-Hakam] dari [Ibrahim] dari [al-Aswad] dari [Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam apabila dalam keadaan junub, lalu ingin makan atau tidur, maka beliau berwudhu dengan wudhu untuk sholat.\" Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [ubaidhullah bin Mu'adz] dia berkata, telah menceritakan kepada kami [bapakku] keduanya berkata, telah menceritakan kepada kami [Syu'bah] dengan sanad ini, berkata [Ibnu al-Mutsanna] dalam haditsnya, telah menceritakan kepada kami [al-Hakami] saya mendengar [Ibrahim] menceritakannya."
            },
            {
                "number": 454,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَاللَّفْظُ لَهُمَا قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي وَقَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو أُسَامَةَ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ عُمَرَ قَالَ يَا رَسُولَ اللَّهِ أَيَرْقُدُ أَحَدُنَا وَهُوَ جُنُبٌ قَالَ نَعَمْ إِذَا تَوَضَّأَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Abu Bakar al-Muqaddami] dan [Zuhair bin Harb] keduanya berkata, telah menceritakan kepada kami [Yahya, yaitu Ibnu Sa'id] dan [ubaidhullah] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Ibnu Numair] dan lafazh tersebut milik keduanya, berkata [Ibnu Numair] telah menceritakan kepada kami [bapakku] dan berkata [Abu Bakar] telah menceritakan kepada kami [Abu Usamah] keduanya berkata, telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Umar berkata, \"Wahai Rasulullah, apa (boleh) salah seorang dari kita tidur sedangkan dia dalam keadaan junub?\" Beliau menjawab, \"Ya boleh, apabila dia telah berwudhu.\""
            },
            {
                "number": 455,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ عُمَرَ اسْتَفْتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَلْ يَنَامُ أَحَدُنَا وَهُوَ جُنُبٌ قَالَ نَعَمْ لِيَتَوَضَّأْ ثُمَّ لِيَنَمْ حَتَّى يَغْتَسِلَ إِذَا شَاءَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] dari [Ibnu Juraij] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Umar berkata, \"Wahai Rasulullah, apa (boleh) salah seorang dari kita tidur sedangkan dia dalam keadaan junub?\" Beliau menjawab, \"Ya boleh, apabila dia berwudhu.\"….."
            },
            {
                "number": 456,
                "arab": "و حَدَّثَنِي يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَذَكَرَ عُمَرُ بْنُ الْخَطَّابِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ تُصِيبُهُ جَنَابَةٌ مِنْ اللَّيْلِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata, saya membaca di hadapan [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] dia berkata, \"Umar bin al-Khaththab menyebutkan kepada Rasulullah shallallahu 'alaihi wasallam bahwa dia mengalami junub sejak malam. Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya, 'Berwudhulah, dan cucilah kemaluanmu, kemudian tidurlah'.\""
            },
            {
                "number": 457,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ قَالَ سَأَلْتُ عَائِشَةَعَنْ وِتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ قُلْتُ كَيْفَ كَانَ يَصْنَعُ فِي الْجَنَابَةِ أَكَانَ يَغْتَسِلُ قَبْلَ أَنْ يَنَامَ أَمْ يَنَامُ قَبْلَ أَنْ يَغْتَسِلَ قَالَتْ كُلُّ ذَلِكَ قَدْ كَانَ يَفْعَلُ رُبَّمَا اغْتَسَلَ فَنَامَ وَرُبَّمَا تَوَضَّأَ فَنَامَ قُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الْأَمْرِ سَعَةًو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ح و حَدَّثَنِيهِ هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ جَمِيعًا عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin SA\"id] telah menceritakan kepada kami [Laits] dari [Muawiyah bin Shalih] dari [Abdullah bin Abi Qais] dia berkata, \"Saya bertanya kepada [Aisyah] tentang witir Rasulullah Shallallahu'alaihiwasallam. Lalu dia menyebutkan suatu hadits. Aku bertanya, 'Bagaimana (yang harus) dia perbuat ketika dalam keadaan junub, apakah dia harus mandi sebelum tidur atau tidur tanpa mandi? ' Aisyah menjawab, 'Sungguh semuanya telah dilakukan beliau, boleh jadi dia mandi lalu tidur, boleh jadi dia berwudhu lalu tidur.' Aku berkata, 'Segala puji bagi Allah yang menciptakan dalam perkara tersebut suatu keleluasaan'.\" Dan telah menceritakannya kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Abdurrahman bin Mahdi] --lewat jalur periwayatan lain-- dan telah menceritakannya kepadaku [Harun bin Sa'id al-Aili] telah menceritakan kepada kami [Ibnu Wahb] semuanya dari [Muawiyah bin Shalih] dengan isnad ini hadits semisalnya."
            },
            {
                "number": 458,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ ح و حَدَّثَنِي عَمْرٌو النَّاقِدُ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ كُلُّهُمْ عَنْ عَاصِمٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ ثُمَّ أَرَادَ أَنْ يَعُودَ فَلْيَتَوَضَّأْزَادَ أَبُو بَكْرٍ فِي حَدِيثِهِ بَيْنَهُمَا وُضُوءًا وَقَالَ ثُمَّ أَرَادَ أَنْ يُعَاوِدَ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Hafsh bin Ghiyats] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Abu Kuraib] telah mengabarkan kepada kami [Ibnu Abi Zaidah] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Amru an-Naqid] dan [Ibnu Numair] keduanya berkata, telah menceritakan kepada kami [Marwan bin Mu'awiyah al-Fazari] semuanya dari [Ashim] dari [Abu al-Mutawakkil] dari [Abu Sa'id al-Khudri] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, \"Apabila salah seorang dari kalian menyenggamai istrinya, kemudian berkehendak untuk mengulanginya lagi maka hendaklah dia berwudhu.\" Abu Bakar menambahkan dalam haditsnya, \"Antara keduanya ada wudhu.\" Dan dia berkata, \"Kemudian dia ingin mengulanginya.\""
            },
            {
                "number": 459,
                "arab": "و حَدَّثَنَا الْحَسَنُ بْنُ أَحْمَدَ بْنِ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا مِسْكِينٌ يَعْنِي ابْنَ بُكَيْرٍ الْحَذَّاءَ عَنْ شُعْبَةَ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَطُوفُ عَلَى نِسَائِهِ بِغُسْلٍ وَاحِدٍ",
                "id": "Dan telah menceritakan kepada kami [al-Hasan bin Ahmad bin Abi Syu'aib al-Harrani] telah menceritakan kepada kami [Miskin, yaitu Ibnu Bukair al-Hadzdza'] dari [Syu'bah] dari [Hisyam bin Zaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam menggilir istri-istrinya dengan satu kali mandi."
            },
            {
                "number": 460,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْحَنَفِيُّ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ قَالَ قَالَ إِسْحَقُ بْنُ أَبِي طَلْحَةَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ قَالَجَاءَتْ أُمُّ سُلَيْمٍ وَهِيَ جَدَّةُ إِسْحَقَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ لَهُ وَعَائِشَةُ عِنْدَهُ يَا رَسُولَ اللَّهِ الْمَرْأَةُ تَرَى مَا يَرَى الرَّجُلُ فِي الْمَنَامِ فَتَرَى مِنْ نَفْسِهَا مَا يَرَى الرَّجُلُ مِنْ نَفْسِهِ فَقَالَتْ عَائِشَةُ يَا أُمَّ سُلَيْمٍ فَضَحْتِ النِّسَاءَ تَرِبَتْ يَمِينُكِ فَقَالَ لِعَائِشَةَ بَلْ أَنْتِ فَتَرِبَتْ يَمِينُكِ نَعَمْ فَلْتَغْتَسِلْ يَا أُمَّ سُلَيْمٍ إِذَا رَأَتْ ذَاكِ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Umar bin Yunus al-Hanafi] telah menceritakan kepada kami [Ikrimah bin Ammar] dia berkata, [Ishaq bin Abi Thalhah] berkata, telah menceritakan kepadaku [Anas bin Malik] dia berkata, \"Ummu Sulaim mendatangi -dan dia adalah nenek Ishaq- Rasulullah shallallahu 'alaihi wasallam seraya berkata kepadanya -sedangkan aisyah berada di sisi beliau, 'Wahai Rasulullah, seorang wanita bermimpi sesuatu yang juga dimimpikan seorang laki-laki dalam tidurnya, lalu dia bermimpi dirinya (melakukan sesuatu) sebagaimana laki-laki bermimpi dirinya (melakukan sesuatu).' Maka Aisyah berkata, 'Kamu telah membuka (aib) wanita, serius itu.\" Maka beliau bersabda kepada Aisyah, 'Bahkan kamu juga, aku juga serius.\" Ya benar, (wanita juga bermimpi seperti laki-laki), maka hendaklah kamu mandi wahai Ummu Sulaim apabila kamu bermimpi bersenggama'.\""
            },
            {
                "number": 461,
                "arab": "حَدَّثَنَا عَبَّاسُ بْنُ الْوَلِيدِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ أَنَّ أُمَّ سُلَيْمٍ حَدَّثَتْأَنَّهَا سَأَلَتْ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَتْ ذَلِكِ الْمَرْأَةُ فَلْتَغْتَسِلْ فَقَالَتْ أُمُّ سُلَيْمٍ وَاسْتَحْيَيْتُ مِنْ ذَلِكَ قَالَتْ وَهَلْ يَكُونُ هَذَا فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ فَمِنْ أَيْنَ يَكُونُ الشَّبَهُ إِنَّ مَاءَ الرَّجُلِ غَلِيظٌ أَبْيَضُ وَمَاءَ الْمَرْأَةِ رَقِيقٌ أَصْفَرُ فَمِنْ أَيِّهِمَا عَلَا أَوْ سَبَقَ يَكُونُ مِنْهُ الشَّبَهُ",
                "id": "Telah menceritakan kepada kami [Abbas bin al-Walid] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] bahwa [Anas bin Malik] telah menceritakan kepada mereka bahwa [Ummu Sulaim] pernah bercerita bahwa dia bertanya kepada Nabi Shallallahu'alaihiwasallam tentang wanita yang bermimpi (bersenggama) sebagaimana yang terjadi pada seorang lelaki. Maka Rasulullah Shallallahu'alaihiwasallam bersabda, \"Apabila perempuan tersebut bermimpi keluar mani, maka dia wajib mandi hadas.\" Ummu Sulaim berkata, \"Aku malu untuk bertanya perkara tersebut\". Ummu Sulaim bertanya, \"Apakah perkara ini berlaku pada perempuan?\" Nabi Shallallahu'alaihiwasallam bersabda, \"Ya (wanita juga keluar mani, kalau dia tidak keluar) maka dari mana terjadi kemiripan?. Ketahuilah bahwa mani lelaki itu kental dan berwarna putih, sedangkan mani perempuan itu encer dan berwarna kuning. Manapun mani dari salah seorang mereka yang lebih mendominasi atau menang, niscaya kemiripan terjadi karenanya."
            },
            {
                "number": 462,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا صَالِحُ بْنُ عُمَرَ حَدَّثَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَسَأَلَتْ امْرَأَةٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ فِي مَنَامِهِ فَقَالَ إِذَا كَانَ مِنْهَا مَا يَكُونُ مِنْ الرَّجُلِ فَلْتَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Dawud bin Rusyaid] telah menceritakan kepada kami [Shalih bin Umar] telah menceritakan kepada kami [Abu Malik al-Asyja'i] dari [Anas bin Malik] dia berkata, \"Seorang wanita bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang wanita yang bermimpi (bersenggama) dalam tidurnya sebagaimana seorang laki-laki bermimpi dalam tidurnya. Maka beliau menjawab, 'Apabila dia mengalami sesuatu yang dialami oleh seorang laki-laki, hendaklah dia mandi'.\""
            },
            {
                "number": 463,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْجَاءَتْ أَمُّ سُلَيْمٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لَا يَسْتَحْيِي مِنْ الْحَقِّ فَهَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا احْتَلَمَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ إِذَا رَأَتْ الْمَاءَ فَقَالَتْ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ وَتَحْتَلِمُ الْمَرْأَةُ فَقَالَ تَرِبَتْ يَدَاكِ فَبِمَ يُشْبِهُهَا وَلَدُهَاحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ مِثْلَ مَعْنَاهُ وَزَادَ قَالَتْ قُلْتُ فَضَحْتِ النِّسَاءَ و حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ أَنَّهُ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ أَنَّ أُمَّ سُلَيْمٍ أُمَّ بَنِي أَبِي طَلْحَةَ دَخَلَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ هِشَامٍ غَيْرَ أَنَّ فِيهِ قَالَ قَالَتْ عَائِشَةُ فَقُلْتُ لَهَا أُفٍّ لَكِ أَتَرَى الْمَرْأَةُ ذَلِكِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya at-Tamimi] telah mengabarkan kepada kami [Abu Muawiyah] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Zainab binti Abi Salamah] dari [Ummu Salamah], dia berkata, \"Ummu Sulaim mengunjungi Nabi Shallallahu'alaihiwasallam, dia berkata; 'Wahai Rasulullah! Allah tidak malu terhadap kebenaran. Apakah seorang wanita wajib mandi bila dia bermimpi? ' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Ya, apabila dia melihat air (mani).' Ummu Salamah berkata; 'Apakah Seorang wanita juga bermimpi (dan keluar mani)? ' Beliau bersabda: 'Bagaimana kamu, lantas dengan apa anaknya bisa menyerupai dirinya?\" telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata; telah menceritakan kepada kami [Waki']. (dan diriwayatkan dari jalur lain) telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Hisyam bin 'Urwah] dengan sanad dan maksud yang sama, dan dia menambahkan; \"Ummu Salamah berkata; aku berkata; \"Kamu telah membuka aib wanita.\" Dan telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits] telah menceritakan kepadaku [Ayahku] dari [Kakekku] telah menceritakan kepadaku ['Uqail bin Khalid] dari [Ibnu Syihab] bahwa dia berkata; telah mengabarkan kepadaku [Urwah bin Az Zubair] bahwa ['Aisyah isteri Nabi shallallahu 'alaihi wasallam] telah mengabarkan kepadanya, bahwa Ummu Sulaim yaitu Ummu Bani Thalhah menemui Rasulullah shallallahu 'alaihi wasallam…\" semakna dengan hadits Hisyam, namun dalam hadits Hisyam terdapat tambahan; 'Aisyah berkata; lalu aku berkata kepadanya; \"Cukup, apakah seorang wanita juga bermimpi seperti itu?.\""
            },
            {
                "number": 464,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ وَسَهْلُ بْنُ عُثْمَانَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَ سَهْلٌ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ عَنْ أَبِيهِ عَنْ مُصْعَبِ بْنِ شَيْبَةَ عَنْ مُسَافِعِ بْنِ عَبْدِ اللَّهِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ امْرَأَةً قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ تَغْتَسِلُ الْمَرْأَةُ إِذَا احْتَلَمَتْ وَأَبْصَرَتْ الْمَاءَ فَقَالَ نَعَمْ فَقَالَتْ لَهَا عَائِشَةُ تَرِبَتْ يَدَاكِ وَأُلَّتْ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعِيهَا وَهَلْ يَكُونُ الشَّبَهُ إِلَّا مِنْ قِبَلِ ذَلِكِ إِذَا عَلَا مَاؤُهَا مَاءَ الرَّجُلِ أَشْبَهَ الْوَلَدُ أَخْوَالَهُ وَإِذَا عَلَا مَاءُ الرَّجُلِ مَاءَهَا أَشْبَهَ أَعْمَامَهُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa ar-Razi] dan [Sahl bin Utsman] serta [Abu Kuraib] dan lafaz tersebut milik Abu Kuraib, Sahl berkata, telah menceritakan kepada kami, sedangkan dua orang yang lainnya berkata, telah mengabarkan kepada kami [Ibnu Abi Zaidah] dari [bapaknya] dari [Mush'ab bin Syaibah] dari [Musafi' bin Abdullah] dari [Urwah bin az-Zubair] dari [Aisyah] bahwa seorang wanita berkata kepada Rasulullah Shallallahu'alaihiwasallam, \"Apakah seorang wanita harus mandi apabila bermimpi dan melihat air mani?\" Beliau menjawab, \"Ya.\" Maka Aisyah berkata kepadanya, \"Serius kamu akan bertanya?.\" Aisyah berkata, \"Maka Rasulullah shallallahu 'alaihi wasallam bersabda, 'Biarkanlah dia (bertanya). Tidaklah kemiripan gen terjadi melainkan dari sisi tersebut. Apabila air mani wanita tersebut mengalahkan air mani suaminya maka anaknya mirip dengan garis keturunan ibunya. Dan apabila air mani suaminya mengalahkan air maninya maka anaknya mirip dengan garis keturunan bapaknya'.\""
            },
            {
                "number": 465,
                "arab": "حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو تَوْبَةَ وَهُوَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ عَنْ زَيْدٍ يَعْنِي أَخَاهُ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ قَالَ حَدَّثَنِي أَبُو أَسْمَاءَ الرَّحَبِيُّ أَنَّ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُ قَالَكُنْتُ قَائِمًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ حِبْرٌ مِنْ أَحْبَارِ الْيَهُودِ فَقَالَ السَّلَامُ عَلَيْكَ يَا مُحَمَّدُ فَدَفَعْتُهُ دَفْعَةً كَادَ يُصْرَعُ مِنْهَا فَقَالَ لِمَ تَدْفَعُنِي فَقُلْتُ أَلَا تَقُولُ يَا رَسُولَ اللَّهِ فَقَالَ الْيَهُودِيُّ إِنَّمَا نَدْعُوهُ بِاسْمِهِ الَّذِي سَمَّاهُ بِهِ أَهْلُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اسْمِي مُحَمَّدٌ الَّذِي سَمَّانِي بِهِ أَهْلِي فَقَالَ الْيَهُودِيُّ جِئْتُ أَسْأَلُكَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيَنْفَعُكَ شَيْءٌ إِنْ حَدَّثْتُكَ قَالَ أَسْمَعُ بِأُذُنَيَّ فَنَكَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُودٍ مَعَهُ فَقَالَ سَلْ فَقَالَ الْيَهُودِيُّ أَيْنَ يَكُونُ النَّاسُ{ يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَوَاتُ }فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُمْ فِي الظُّلْمَةِ دُونَ الْجِسْرِ قَالَ فَمَنْ أَوَّلُ النَّاسِ إِجَازَةً قَالَ فُقَرَاءُ الْمُهَاجِرِينَ قَالَ الْيَهُودِيُّ فَمَا تُحْفَتُهُمْ حِينَ يَدْخُلُونَ الْجَنَّةَ قَالَ زِيَادَةُ كَبِدِ النُّونِ قَالَ فَمَا غِذَاؤُهُمْ عَلَى إِثْرِهَا قَالَ يُنْحَرُ لَهُمْ ثَوْرُ الْجَنَّةِ الَّذِي كَانَ يَأْكُلُ مِنْ أَطْرَافِهَا قَالَ فَمَا شَرَابُهُمْ عَلَيْهِ قَالَ مِنْ عَيْنٍ فِيهَا تُسَمَّى سَلْسَبِيلًا قَالَ صَدَقْتَ قَالَ وَجِئْتُ أَسْأَلُكَ عَنْ شَيْءٍ لَا يَعْلَمُهُ أَحَدٌ مِنْ أَهْلِ الْأَرْضِ إِلَّا نَبِيٌّ أَوْ رَجُلٌ أَوْ رَجُلَانِ قَالَ يَنْفَعُكَ إِنْ حَدَّثْتُكَ قَالَ أَسْمَعُ بِأُذُنَيَّ قَالَ جِئْتُ أَسْأَلُكَ عَنْ الْوَلَدِ قَالَ مَاءُ الرَّجُلِ أَبْيَضُ وَمَاءُ الْمَرْأَةِ أَصْفَرُ فَإِذَا اجْتَمَعَا فَعَلَا مَنِيُّ الرَّجُلِ مَنِيَّ الْمَرْأَةِ أَذْكَرَا بِإِذْنِ اللَّهِ وَإِذَا عَلَا مَنِيُّ الْمَرْأَةِ مَنِيَّ الرَّجُلِ آنَثَا بِإِذْنِ اللَّهِ قَالَ الْيَهُودِيُّ لَقَدْ صَدَقْتَ وَإِنَّكَ لَنَبِيٌّ ثُمَّ انْصَرَفَ فَذَهَبَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ سَأَلَنِي هَذَا عَنْ الَّذِي سَأَلَنِي عَنْهُ وَمَا لِي عِلْمٌ بِشَيْءٍ مِنْهُ حَتَّى أَتَانِيَ اللَّهُ بِهِو حَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ كُنْتُ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ زَائِدَةُ كَبِدِ النُّونِ وَقَالَ أَذْكَرَ وَآنَثَ وَلَمْ يَقُلْ أَذْكَرَا وَآنَثَا",
                "id": "Telah menceritakan kepada kami [al-Hasan bin Ali al-Hulwani] telah menceritakan kepada kami [Abu Taubah, yaitu ar-Rabi' bin Nafi'] telah menceritakan kepada kami [Mua'wiyah, yaitu Ibnu Sallam] dari [Zaid, yaitu saudaranya] bahwa dia mendengar [Abu Sallam] berkata, telah menceritakan kepada kami [Abu Asma' ar-Rahabi] bahwa [Tsauban, budak Rasulullah Shallallahu'alaihiwasallam] bercerita kepadanya, dia berkata, \"Aku pernah berdiri di dekat Rasulullah Shallallahu'alaihiwasallam, tiba-tiba datanglah salah seorang rahib dari orang-orang Yahudi seraya berkata, 'Semoga keselamatan tercurah atasmu wahai Muhammad. Maka akupun mendorongnya dengan keras hingga dia hampir saja terjungkal karenanya.' Lantas dia bertanya, 'Kenapa kamu mendorongku? ' Aku menjawab, 'Tidak bisakah kamu memanggilnya dengan panggilan \"Rasulullah\"? ' Rahib Yahudi itu menjawab, 'Cukuplah kami memanggilnya dengan nama yang diberikan keluarganya kepadanya.' Lantas Rasulullah shallallahu 'alaihi wasallam berkata, ' namaku ialah Muhammad, nama yang diberikan keluargaku kepadaku.' Yahudi itu berkata, 'Aku datang untuk bertanya beberapa pertanyaan kepadamu.' Rasulullah shallallahu 'alaihi wasallam balik bertanya, 'Adakah sesuatu yang bermanfaat bagimu jika aku berbicara denganmu.' Dia menjawab, 'Aku akan mendengarkan dengan kedua telingaku ini'. Lalu Rasulullah shallallahu 'alaihi wasallam membuat garis-garis ke tanah dengan tongkat yang ada di tangan beliau seraya berkata, 'Bertanyalah! ' Yahudi itu berucap, '(Hari ketika bumi diganti dengan bumi dan langit yang lain…) (QS. Ibrahim 48), kala itu manusia berada di mana? ' Rasulullah shallallahu 'alaihi wasallam menjawab, 'Mereka berada dalam kegelapan di bawah shirath (jembatan).' Dia bertanya, 'Lalu siapakah orang yang paling pertama diizinkan untuk menyeberangi jembatan itu? ' Beliau menjawab, 'Orang-orang fakir dari kaum Muhajirin'. Yahudi itu bertanya lagi, 'Apa hidangan spesial bagi mereka ketika memasuki surga? ' Beliau menjawab, 'Organ yang paling bagus dari hati ikan hiu'. Dia bertanya lagi, 'Setelah itu hidangan apa lagi yang disuguhkan untuk mereka? ' Beliau menjawab, 'Mereka disembelihkan sapi surga yang dimakan dari sisi-sisinya'. Dia bertanya lagi, 'Apa minuman mereka? ' Beliau menjawab, 'Minuman yang diambil dari mata air yang bernama Salsabila'. Dia berkata, 'Kamu benar'. Kemudian dia melanjutkan ucapannya, 'Aku juga datang untuk mengajukan beberapa pertanyaan yang jawabannya tidak diketahui seorang pun di muka bumi ini kecuali seorang Nabi atau seorang atau dua orang lelaki saja'. Beliau berkata, 'Apakah akan memberikan manfaat kepadamu jika aku menjawabnya? ' Dia menjawab, 'Aku akan mendengarkannya dengan kedua telingaku'. Dia berkata, 'Aku datang dengan sebuah pertanyaan mengenai anak'. Beliau menjawab, 'Air mani seorang lelaki berwarna putih dan air mani seorang wanita berwarna kuning, jika keduanya menyatu lalu air mani si lelaki lebih dominan atas air mani wanita maka janin itu akan berkelamin laki-laki dengan izin Allah. Namun jika air mani wanita lebih dominan atas air mani si lelaki maka janin itu akan berkelamin wanita dengan izin Allah.' Yahudi itu berkata, 'Kamu benar, dan kamu memang benar-benar seorang Nabi'. Lalu lelaki Yahudi itupun beranjak pergi. Setelah itu Rasulullah shallallahu 'alaihi wasallam bersabda, 'Sungguh aku pernah ditanya seseorang tentang pertanyaan yang dia juga menanyakannya kepadaku, dan aku sama sekali tidak tahu jawabannya sampai Allah memberitahukannya kepadaku'. [Abdullah bin Abdurrahman ad-Darimi] memberitahukan hadits ini kepadaku, [Yahya bin Hassan] mengkabarkan kepada kami, [Mu'awiyah bin Sallam] menceritakan seperti itu kepada kami dengan sanad yang sama, tapi bedanya; ia mengatakan: aku pernah duduk di dekat Rasulullah Shallallahu'alaihiwasallam. Dan perbedaan lafadz; \"Zaidatu kabidin nun\" (hati ikan hiu), \"adzkara\" dan \"ânatsa\" (dengan bentuk mufrad\/tunggal), dan bukan \"adzkarâ\" dan \"ânatsâ\" (dengan bentuk mutsanna)."
            },
            {
                "number": 466,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اغْتَسَلَ مِنْ الْجَنَابَةِ يَبْدَأُ فَيَغْسِلُ يَدَيْهِ ثُمَّ يُفْرِغُ بِيَمِينِهِ عَلَى شِمَالِهِ فَيَغْسِلُ فَرْجَهُ ثُمَّ يَتَوَضَّأُ وُضُوءَهُ لِلصَّلَاةِ ثُمَّ يَأْخُذُ الْمَاءَ فَيُدْخِلُ أَصَابِعَهُ فِي أُصُولِ الشَّعْرِ حَتَّى إِذَا رَأَى أَنْ قَدْ اسْتَبْرَأَ حَفَنَ عَلَى رَأْسِهِ ثَلَاثَ حَفَنَاتٍ ثُمَّ أَفَاضَ عَلَى سَائِرِ جَسَدِهِ ثُمَّ غَسَلَ رِجْلَيْهِو حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ نُمَيْرٍ كُلُّهُمْ عَنْ هِشَامٍ فِي هَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِهِمْ غَسْلُ الرِّجْلَيْنِ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَ مِنْ الْجَنَابَةِ فَبَدَأَ فَغَسَلَ كَفَّيْهِ ثَلَاثًا ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ أَبِي مُعَاوِيَةَ وَلَمْ يَذْكُرْ غَسْلَ الرِّجْلَيْنِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya at-Tamimi] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] dia berkata, \"Dahulu apabila Rasulullah Shallallahu'alaihiwasallam mandi hadas karena junub, maka beliau memulainya dengan membasuh kedua tangan. Beliau menuangkan air dengan menuangkan air dengan tangan kanan ke atas tangan kiri, kemudian membasuh kemaluan dan berwudhu dengan wudhu untuk sholat. Kemudian beliau menyiram rambut sambil memasukkan jari ke pangkal rambut sehingga rata. Hingga ketika selesai, beliau membasuh kepala sebanyak tiga kali, lalu beliau membasuh seluruh tubuh dan akhirnya membasuh kedua kaki. Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Zuhair bin Harb] keduanya berkata, telah menceritakan kepada kami [Jarir] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Ali bin Mushir] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Ibnu Numair] semuanya dari [Hisyam] dalam sanad ini, dan dalam lafazh mereka tidak ada ungkapan, 'Membasuh kedua kakinya', dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Hisyam] dari [bapaknya] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam mandi karena junub, maka beliau memulainya dengan mencuci kedua telapak tangannya tiga kali, kemudian menyebutkan sebagaimana hadits Abu Mu'awiyah, namun tidak menyebut, 'membasuh kedua kakinya.'"
            },
            {
                "number": 467,
                "arab": "و حَدَّثَنَاه عَمْرٌو النَّاقِدُ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا زَائِدَةُ عَنْ هِشَامٍ قَالَ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اغْتَسَلَ مِنْ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ قَبْلَ أَنْ يُدْخِلَ يَدَهُ فِي الْإِنَاءِ ثُمَّ تَوَضَّأَ مِثْلَ وُضُوئِهِ لِلصَّلَاةِ",
                "id": "Dan telah menceritakan kepada kami [Amru an-Naqid] telah menceritakan kepada kami [Mu'awiyah bin Amru] telah menceritakan kepada kami [Zaidah] dari [Hisyam] dia berkata, telah mengabarkan kepada kami [Urwah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam apabila mandi hadas karena junub, maka beliau memulainya dengan membasuh kedua tangan sebelum memasukkannya ke dalam bejana, kemudian berwudhu dengan wudhu untuk sholat."
            },
            {
                "number": 468,
                "arab": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنِي عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَعْمَشُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ حَدَّثَتْنِي خَالَتِي مَيْمُونَةُ قَالَتْأَدْنَيْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُسْلَهُ مِنْ الْجَنَابَةِ فَغَسَلَ كَفَّيْهِ مَرَّتَيْنِ أَوْ ثَلَاثًا ثُمَّ أَدْخَلَ يَدَهُ فِي الْإِنَاءِ ثُمَّ أَفْرَغَ بِهِ عَلَى فَرْجِهِ وَغَسَلَهُ بِشِمَالِهِ ثُمَّ ضَرَبَ بِشِمَالِهِ الْأَرْضَ فَدَلَكَهَا دَلْكًا شَدِيدًا ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ ثُمَّ أَفْرَغَ عَلَى رَأْسِهِ ثَلَاثَ حَفَنَاتٍ مِلْءَ كَفِّهِ ثُمَّ غَسَلَ سَائِرَ جَسَدِهِ ثُمَّ تَنَحَّى عَنْ مَقَامِهِ ذَلِكَ فَغَسَلَ رِجْلَيْهِ ثُمَّ أَتَيْتُهُ بِالْمِنْدِيلِ فَرَدَّهُو حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَالْأَشَجُّ وَإِسْحَقُ كُلُّهُمْ عَنْ وَكِيعٍ ح و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَلَيْسَ فِي حَدِيثِهِمَا إِفْرَاغُ ثَلَاثِ حَفَنَاتٍ عَلَى الرَّأْسِ وَفِي حَدِيثِ وَكِيعٍ وَصْفُ الْوُضُوءِ كُلِّهِ يَذْكُرُ الْمَضْمَضَةَ وَالِاسْتِنْشَاقَ فِيهِ وَلَيْسَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ ذِكْرُ الْمِنْدِيلِ",
                "id": "Telah menceritakan kepadaku [Ali bin Hujras-Sa'di] telah menceritakan kepadaku [Isa bin Yunus] telah menceritakan kepada kami [al-A'masy] dari [Salim bin Abi al-Ja'di] dari [Kuraib] dari [Ibnu Abbas] dia berkata, \"Bibiku, [Maimunah] telah menceritakan kepadaku, dia berkata, 'Aku pernah membawa air mandi kepada Rasulullah Shallallahu'alaihiwasallam karena junub, Lalu beliau membasuh dua tapak tangan sebanyak dua atau tiga kali. Kemudian beliau memasukkan tangan ke dalam wadah berisi air, lalu menyiramkan air tersebut ke atas kemaluan serta membasuhnya dengan tangan kiri. Setelah itu, beliau menggosokkan tangan kiri ke tanah dengan pijatan yang kuat, lalu berwudhu sebagaimana yang biasa dilakukan untuk mendirikan sholat. Kemudian beliau menuangkan air yang diciduk dengan dua telapak tangan ke kepala sebanyak tiga kali sepenuh telapak tangan. Lalu beliau membasuh seluruh tubuh, lalu beralih dari tempat tersebut dan membasuh kedua kaki, kemudian aku mengambilkan handuk untuk beliau, tetapi beliau menolaknya.\" Dan telah menceritakan kepada kami [Muhammad bin ash-Shabbah], [Abu Bakar bin Abi Syaibah], [Abu Kuraib], [al-Asyajj], dan [Ishaq] semuanya dari [Waki'] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami tentangnya [Yahya bin Yahya] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Muawiyah] keduanya dari [al-A'masy] dengan sanad ini, dan tidaklah dalam hadits keduanya lafazh, \"Menyiramkan air tiga kali sepenuh telapak tangan pada kepala.\" Dan dalam hadits Waki' terdapat gambaran wudhu seluruhnya. Dia menyebutkan berkumur-kumur dan memasukkan air ke hidung. Dan dalam hadits Abu Mu'awiyah tidak menyebutkan handuk."
            },
            {
                "number": 469,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ سَالِمٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِمِنْدِيلٍ فَلَمْ يَمَسَّهُ وَجَعَلَ يَقُولُ بِالْمَاءِ هَكَذَا يَعْنِي يَنْفُضُهُ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dari [al-A'masy] dari [Salim] dari [Kuraib] dari [Ibnu Abbas] dari [Maimunah] bahwa Nabi shallallahu 'alaihi wasallam dibawakan handuk, namun beliau tidak mengusapnya, dan mulai bersabda, \"(Cara membersihkannya) demikian, maksudnya dipercikkan.\""
            },
            {
                "number": 470,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنِي أَبُو عَاصِمٍ عَنْ حَنْظَلَةَ بْنِ أَبِي سُفْيَانَ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اغْتَسَلَ مِنْ الْجَنَابَةِ دَعَا بِشَيْءٍ نَحْوَ الْحِلَابِ فَأَخَذَ بِكَفِّهِ بَدَأَ بِشِقِّ رَأْسِهِ الْأَيْمَنِ ثُمَّ الْأَيْسَرِ ثُمَّ أَخَذَ بِكَفَّيْهِ فَقَالَ بِهِمَا عَلَى رَأْسِهِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna al-Anazi] telah menceritakan kepada kami [Abu Ashim] dari [Hanzhalah bin Abi Sufyan] dari [al-Qasim] dari [Aisyah] dia berkata, \"Rasulullah apabila mandi karena junub, maka beliau meminta air pada bejana, lalu beliau mengambil air dengan telapak tangannya, beliau memulainya dengan sebelah bagian kepalanya yang sebelah kanan, kemudian kiri, kemudian mengambil air dengan kedua telapan tangannya, lalu Aisyah berkata, 'Dengan (siraman) keduanya pada kepalanya'.\""
            },
            {
                "number": 471,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا سُفْيَانُ كِلَاهُمَا عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ فِي الْقَدَحِ وَهُوَ الْفَرَقُ وَكُنْتُ أَغْتَسِلُ أَنَا وَهُوَ فِي الْإِنَاءِ الْوَاحِدِوَفِي حَدِيثِ سُفْيَانَ مِنْ إِنَاءٍ وَاحِدٍ قَالَ قُتَيْبَةُ قَالَ سُفْيَانُ وَالْفَرَقُ ثَلَاثَةُ آصُعٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] --lewat jalur periwayatan lain-- telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepada kami [al-Laits] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu bakar bin Abi Syaibah], [Amr bin an-Naqid], [Zuhair bin Harb] mereka berkata, telah menceritakan kepada kami [Sufyan] keduanya dari [az-Zuhri] dari [Urwah] dari [Aisyah] dia berkata, \"Rasulullah dahulu mandi dalam baskom, yaitu satu faraq. Sedangkan saya pernah mandi bersama beliau dalam satu bejana.\" Dan dalam hadits Sufyan, \"Dari satu bejana\". Qutaibah berkata, \"Sufyan berkata, 'Satu faraq adalah tiga Sha'.\""
            },
            {
                "number": 472,
                "arab": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَدَخَلْتُ عَلَى عَائِشَةَ أَنَا وَأَخُوهَا مِنْ الرَّضَاعَةِ فَسَأَلَهَا عَنْ غُسْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْجَنَابَةِ فَدَعَتْ بِإِنَاءٍ قَدْرِ الصَّاعِ فَاغْتَسَلَتْ وَبَيْنَنَا وَبَيْنَهَا سِتْرٌ وَأَفْرَغَتْ عَلَى رَأْسِهَا ثَلَاثًا قَالَ وَكَانَ أَزْوَاجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْخُذْنَ مِنْ رُءُوسِهِنَّ حَتَّى تَكُونَ كَالْوَفْرَةِ",
                "id": "Telah menceritakan kepadaku [ubaidhullah bin Muadz al-Anbari] dia berkata, telah menceritakan kepada kami [bapakku] dia berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Bakar bin Hafs] dari [Abu Salamah bin Abdurrahman] dia berkata, \"Aku mampir pada [Aisyah] bersama saudara sesusuannya. Lalu dia menanyakan kepadanya tentang mandi Nabi shallallahu 'alaihi wasallam karena junub. Lantas Aisyah meminta wadah yang memuat satu gantang air, lalu dia mandi dengan meletakkan tabir di antara kami dan dia. Aisyah menuangkan air ke atas kepalanya sebanyak tiga kali sambil berkata, 'Isteri-isteri Nabi Shallallahu'alaihiwasallam biasanya menuang air ke kepala mereka sehingga seakan-akan banyak (basah sekali) '.\""
            },
            {
                "number": 473,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنَا لَيْثٌ عَنْ يَزِيدَ عَنْ عِرَاكٍ عَنْ حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ وَكَانَتْ تَحْتَ الْمُنْذِرِ بْنِ الزُّبَيْرِ أَنَّ عَائِشَةَأَخْبَرَتْهَا أَنَّهَا كَانَتْ تَغْتَسِلُ هِيَ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِنَاءٍ وَاحِدٍ يَسَعُ ثَلَاثَةَ أَمْدَادٍ أَوْ قَرِيبًا مِنْ ذَلِكَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Syababah] telah menceritakan kepada kami [Laits] dari [Yazid] dari ['Irak] dari [Hafshah binti Abdurrahman bin Abi Bakar] sedangkan dia ketika itu menjadi istri al-Mundzir bin az-Zubair bahwa [Aisyah] mengabarkan kepadanya bahwa dia mandi bersama Nabi shallallahu 'alaihi wasallam dalam satu bejana yang lebarnya tiga mud atau mendekati itu."
            },
            {
                "number": 474,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ قَالَ حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ تَخْتَلِفُ أَيْدِينَا فِيهِ مِنْ الْجَنَابَةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] dia berkata, telah menceritakan kepada kami [Aflah bin Humaid] dari [al-Qasim bin Muhammad] dari [Aisyah] dia berkata, \"Saya mandi bersama Rasulullah shallallahu 'alaihi wasallam dalam satu bejana, tangan kami terpisah padanya karena junub.\""
            },
            {
                "number": 475,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ مُعَاذَةَ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ بَيْنِي وَبَيْنَهُ وَاحِدٍ فَيُبَادِرُنِي حَتَّى أَقُولَ دَعْ لِي دَعْ لِي قَالَتْ وَهُمَا جُنُبَانِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Ashim al-Ahwal] dari [Mu'adzah] dari [Aisyah] dia berkata, \"Saya mandi bersama Rasulullah shallallahu 'alaihi wasallam pada satu bejana, lalu beliau segera mendekatiku hingga aku berkata, 'Tinggalkanlah aku, tinggalkanlah aku.' Dia berkata lagi, 'Sedangkan keduanya dalam keadaan junub.'"
            },
            {
                "number": 476,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ حَاتِمٍ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ ابْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ قَالَ أَكْبَرُ عِلْمِي وَالَّذِي يَخْطِرُ عَلَى بَالِي أَنَّ أَبَا الشَّعْثَاءِ أَخْبَرَنِي أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ بِفَضْلِ مَيْمُونَةَ",
                "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Hatim] berkata Ishaq, telah mengabarkan kepada kami, sedangkan Ibnu Hatim berkata, telah menceritakan kepada kami [Muhammad bin Bakar] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Amru bin Dinar] dia berkata, \"Ilmuku yang terbesar dan yang membekas dalam hatiku adalah bahwa [Abu asy-Sya'tsa'] telah mengabarkan kepadaku bahwa [Ibnu Abbas] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam pernah mandi dengan sisa air mandi Maimunah.\""
            },
            {
                "number": 477,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا قَالَتْكَانَتْ هِيَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلَانِ فِي الْإِنَاءِ الْوَاحِدِ مِنْ الْجَنَابَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Mu'adz bin Hisyam] dia berkata, telah menceritakan kepada kami [bapakku] dari [Yahya bin Abi Katsir] telah menceritakan kepada kami [Abu Salamah bin Abdurrahman] bahwa [Zainab bintu Ummi Salamah] telah menceritakan kepadanya bahwa [Ummu Salamah] telah menceritakan kepadanya, dia berkata, \"Dia pernah bersama Rasulullah mandi bersama dalam satu bejana karena junub.\""
            },
            {
                "number": 478,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ ابْنِ جَبْرٍ عَنْ أَنَسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ بِالْمُدِّ وَيَغْتَسِلُ بِالصَّاعِ إِلَى خَمْسَةِ أَمْدَادٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Waki'] dari [Mis'ar] dari [Ibnu Jabr] dari [Anas] dia berkata, \"Nabi shallallahu 'alaihi wasallam berwudhu dengan satu mud dan mandi dengan satu sha' (empat mud) hingga lima mud.\""
            },
            {
                "number": 479,
                "arab": "و حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ وَعَمْرُو بْنُ عَلِيٍّ كِلَاهُمَا عَنْ بِشْرِ بْنِ الْمُفَضَّلِ قَالَ أَبُو كَامِلٍ حَدَّثَنَا بِشْرٌ حَدَّثَنَا أَبُو رَيْحَانَةَ عَنْ سَفِينَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُغَسِّلُهُ الصَّاعُ مِنْ الْمَاءِ مِنْ الْجَنَابَةِ وَيُوَضِّئُهُ الْمُدُّ",
                "id": "Dan telah menceritakan kepada kami [Abu Kamil al-Jahdari] dan [Amru bin Ali] keduanya dari [Bisyr bin al-Mufadhdhal] berkata [Abu Kamil] telah menceritakan kepada kami [Bisyr] telah menceritakan kepada kami [Abu Raihanah] dari [Safinah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memandikannya dengan satu sha' air karena junub dan mewudhukannya dengan satu mud air"
            },
            {
                "number": 480,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ عُلَيَّةَ ح و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَبِي رَيْحَانَةَ عَنْ سَفِينَةَقَالَ أَبُو بَكْرٍ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ بِالصَّاعِ وَيَتَطَهَّرُ بِالْمُدِّوَفِي حَدِيثِ ابْنِ حُجْرٍ أَوْ قَالَ وَيُطَهِّرُهُ الْمُدُّ و قَالَ وَقَدْ كَانَ كَبِرَ وَمَا كُنْتُ أَثِقُ بِحَدِيثِهِ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ibnu Ulayah] --lewat jalur periwayatan lain-- dan telah menceritakan kepadaku [Ali bin Hujr] telah menceritakan kepada kami [Ismail] dari [Abu Raihanah] dari [Safinah] dia berkata, \"Abu Bakar, sahabat Rasulullah shallallahu 'alaihi wasallam berkata, \"Dahulu Rasulullah shallallahu 'alaihi wasallam mandi dengan satu sha' air (empat mud), dan bersuci (wudhu) dengan satu mud.\" Dan dalam hadits Ibnu Hujur, \"Atau dia berkata, \"Dan satu mud (air) mensucikannya.\" Dan dia berkata, \"Sungguh dia telah tua, dan aku tidak percaya dengan haditsnya.\""
            },
            {
                "number": 481,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَقُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ سُلَيْمَانَ بْنِ صُرَدٍ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَتَمَارَوْا فِي الْغُسْلِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُ الْقَوْمِ أَمَّا أَنَا فَإِنِّي أَغْسِلُ رَأْسِي كَذَا وَكَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَنَا فَإِنِّي أُفِيضُ عَلَى رَأْسِي ثَلَاثَ أَكُفٍّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Qutaibah bin Sa'id] serta [Abu Bakar bin Abi Syaibah] berkata Yahya, telah mengabarkan kepada kami, sedangkan dua orang yang lainnya mengatakan, telah menceritakan kepada kami [Abu al-Ahwash] dari [Abu Ishaq] dari [Sulaiman bin Shurad] dari [Jubair bin Muth'im] dia berkata, \"Orang-orang berselisih dalam masalah mandi di sisi Rasulullah Shallallahu'alaihiwasallam, maka sebagian kaum berkata, 'Adapun saya maka sungguh saya membasuh kepalaku demikian dan demikian.' Maka Rasulullah shallallahu 'alaihi wasallam bersabda, 'Adapun saya, maka sungguh saya mengguyurkan pada kepalaku tiga cidukan telapak tangan'.\""
            },
            {
                "number": 482,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ سُلَيْمَانَ بْنِ صُرَدٍ عَنْ جُبَيْرِ بْنِ مُطْعِمٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ ذُكِرَ عِنْدَهُ الْغُسْلُ مِنْ الْجَنَابَةِ فَقَالَ أَمَّا أَنَا فَأُفْرِغُ عَلَى رَأْسِي ثَلَاثًا",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Sulaiman bin Shurad] dari [Jubair bin Muth'im] dari Nabi shallallahu 'alaihi wasallam bahwa disebutkan di sisi beliau tentang mandi karena junub, maka beliau bersabda, \"Adapun aku, maka aku menyiramkan pada kepalaku tiga kali.\""
            },
            {
                "number": 483,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَإِسْمَعِيلُ بْنُ سَالِمٍ قَالَا أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ وَفْدَ ثَقِيفٍ سَأَلُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا إِنَّ أَرْضَنَا أَرْضٌ بَارِدَةٌ فَكَيْفَ بِالْغُسْلِ فَقَالَ أَمَّا أَنَا فَأُفْرِغُ عَلَى رَأْسِي ثَلَاثًاقَالَ ابْنُ سَالِمٍ فِي رِوَايَتِهِ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو بِشْرٍ وَقَالَ إِنَّ وَفْدَ ثَقِيفٍ قَالُوا يَا رَسُولَ اللَّهِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Ismail bin Salim] keduanya berkata, telah mengabarkan kepada kami [Husyaim] dari [Abu Bisyr] dari [Abu Sufyan] dari [Jabir bin Abdullah] bahwa utusan Tsaqif bertanya kepada Nabi Shallallahu'alaihiwasallam, seraya mereka berkata, \" Tanah kami adalah tanah yang sangat dingin, maka bagaimana caranya mandi?\" Lalu beliau bersabda, \"Adapun aku, maka aku menyiramkan pada kepalaku tiga kali.\" [Ibnu Salim] berkata dalam riwayatnya, telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abu Bisyr] dan dia berkata, \" utusan Tsaqif bertanya, 'Wahai Rasulullah'.\""
            },
            {
                "number": 484,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ حَدَّثَنَا جَعْفَرٌ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اغْتَسَلَ مِنْ جَنَابَةٍ صَبَّ عَلَى رَأْسِهِ ثَلَاثَ حَفَنَاتٍ مِنْ مَاءٍ فَقَالَ لَهُ الْحَسَنُ بْنُ مُحَمَّدٍ إِنَّ شَعْرِي كَثِيرٌ قَالَ جَابِرٌ فَقُلْتُ لَهُ يَا ابْنَ أَخِي كَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرَ مِنْ شَعْرِكَ وَأَطْيَبَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Abdul Wahhab, yaitu ats-Tsaqafi] telah menceritakan kepada kami [Ja'far] dari [bapaknya] dari [Jabir bin Abdullah] dia berkata, \"Rasulullah dahulu apabila mandi karena junub maka beliau menyiramkan air pada kepalanya tiga kali telapak tangan, maka al-Hasan bin Muhammad berkata kepadanya, ' rambutku lebat'.\" Maka Jabir berkata, \"Aku berkata kepadanya, 'Wahai anak saudaraku, rambut Rasulullah adalah lebih banyak dan lebih bagus daripada rambutmu'.\""
            },
            {
                "number": 485,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ كُلُّهُمْ عَنْ ابْنِ عُيَيْنَةَ قَالَ إِسْحَقُ أَخْبَرَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أَشُدُّ ضَفْرَ رَأْسِي فَأَنْقُضُهُ لِغُسْلِ الْجَنَابَةِ قَالَ لَا إِنَّمَا يَكْفِيكِ أَنْ تَحْثِيَ عَلَى رَأْسِكِ ثَلَاثَ حَثَيَاتٍ ثُمَّ تُفِيضِينَ عَلَيْكِ الْمَاءَ فَتَطْهُرِينَو حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ قَالَا أَخْبَرَنَا الثَّوْرِيُّ عَنْ أَيُّوبَ بْنِ مُوسَى فِي هَذَا الْإِسْنَادِ وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ فَأَنْقُضُهُ لِلْحَيْضَةِ وَالْجَنَابَةِ فَقَالَ لَا ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ ابْنِ عُيَيْنَةَ و حَدَّثَنِيهِ أَحْمَدُ الدَّارِمِيُّ حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ عَنْ رَوْحِ بْنِ الْقَاسِمِ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى بِهَذَا الْإِسْنَادِ وَقَالَ أَفَأَحُلُّهُ فَأَغْسِلُهُ مِنْ الْجَنَابَةِ وَلَمْ يَذْكُرْ الْحَيْضَةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah], [Amr an-Naqid], [Ishaq bin Ibrahim], dan [Ibnu Abi Umar] semuanya meriwayatkan dari [Ibnu Uyainah] [Ishaq] berkata, telah mengabarkan kepada kami [Sufyan] dari [Ayyub bin Musa] dari [Sa'id bin Abi Sa'id al-Maqburi] dari [Abdullah bin Rafi' budak Ummu Salamah] dari [Ummu Salamah] dia berkata, \"Saya berkata, wahai Rasulullah, aku seorang wanita yang mengepang rambut kepalaku, lalu aku membukanya untuk mandi junub.\" Beliau bersabda, \"Jangan (kamu buka), cukuplah kamu menumpahkan air pada kepalamu tiga kali, kemudian kamu mencurahkan air padamu, maka kamu telah suci.\" Dan telah menceritakan kepada kami [Amru an-Naqid] telah menceritakan kepada kami [Yazid bin Harun] dan telah menceritakan kepada kami ['Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazzaq] keduanya berkata, telah menceritakan kepada kami [ats-Tsauri] dari [Ayyub bin Musa] dalam isnad ini, dan pada hadits Abdurrazzaq, \"Lalu aku membukanya karena mandi haid dan junub. Lalu beliau bersabda, \"Jangan (kamu membukanya) \" Kemudian dia menyebutkan dengan makna hadits Ibnu Uyainah. Dan telah menceritakannya kepadaku [Ahmad ad-Darimi] telah menceritakan kepada kami [Zakariya' bin 'Adi] telah menceritakan kepada kami [Yazid, yaitu Ibnu Zurai'] dari [Rauh bin al-Qasim] telah menceritakan kepada kami [Ayyub bin Musa] dengan isnad ini, dan dia berkata, \"Apakah aku harus membukanya, lalu aku mandi karena junub.\" Dan dia tidak menyebutkan, \"Haid.\""
            },
            {
                "number": 486,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ حُجْرٍ جَمِيعًا عَنْ ابْنِ عُلَيَّةَ قَالَ يَحْيَى أَخْبَرَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ قَالَ بَلَغَ عَائِشَةَأَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَأْمُرُ النِّسَاءَ إِذَا اغْتَسَلْنَ أَنْ يَنْقُضْنَ رُءُوسَهُنَّ فَقَالَتْ يَا عَجَبًا لِابْنِ عَمْرٍو هَذَا يَأْمُرُ النِّسَاءَ إِذَا اغْتَسَلْنَ أَنْ يَنْقُضْنَ رُءُوسَهُنَّ أَفَلَا يَأْمُرُهُنَّ أَنْ يَحْلِقْنَ رُءُوسَهُنَّ لَقَدْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَلَا أَزِيدُ عَلَى أَنْ أُفْرِغَ عَلَى رَأْسِي ثَلَاثَ إِفْرَاغَاتٍ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya], [Abu Bakar bin Abi Syaibah] dan [Ali bin Hujr] semuanya meriwayatkan dari [Ibnu Ulayah] [Yahya] berkata, telah mengabarkan kepada kami [Ismail bin Ulayah] dari [Ayyub] dari [Abu az-Zubair] dari [Ubaid bin Umair] dia berkata, \" [Aisyah] pernah mendengar Abdullah bin Amru memerintahkan orang-orang perempuan agar membuka tali ikatan rambut mereka apabila mereka mandi. Lalu Aisyah berkata, 'Mengapa dia tidak menyuruh mereka agar mencukur rambut saja? Aku pernah mandi bersama-sama Rasulullah Shallallahu'alaihiwasallam menggunakan air dari wadah yang sama. Aku tidak menyiram kepalaku lebih dari tiga kali siram'.\""
            },
            {
                "number": 487,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَنْصُورِ بْنِ صَفِيَّةَ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْسَأَلَتْ امْرَأَةٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ تَغْتَسِلُ مِنْ حَيْضَتِهَا قَالَ فَذَكَرَتْ أَنَّهُ عَلَّمَهَا كَيْفَ تَغْتَسِلُ ثُمَّ تَأْخُذُ فِرْصَةً مِنْ مِسْكٍ فَتَطَهَّرُ بِهَا قَالَتْ كَيْفَ أَتَطَهَّرُ بِهَا قَالَ تَطَهَّرِي بِهَا سُبْحَانَ اللَّهِ وَاسْتَتَرَ وَأَشَارَ لَنَا سُفْيَانُ بْنُ عُيَيْنَةَ بِيَدِهِ عَلَى وَجْهِهِ قَالَ قَالَتْ عَائِشَةُ وَاجْتَذَبْتُهَا إِلَيَّ وَعَرَفْتُ مَا أَرَادَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ تَتَبَّعِي بِهَا أَثَرَ الدَّمِو قَالَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ فَقُلْتُ تَتَبَّعِي بِهَا آثَارَ الدَّمِ و حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا حَبَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا مَنْصُورٌ عَنْ أُمِّهِ عَنْ عَائِشَةَ أَنَّ امْرَأَةً سَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ أَغْتَسِلُ عِنْدَ الطُّهْرِ فَقَالَ خُذِي فِرْصَةً مُمَسَّكَةً فَتَوَضَّئِي بِهَا ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ سُفْيَانَ",
                "id": "Telah menceritakan kepada kami [Amr bin Muhammad an-Naqid] dan [Ibnu Abi Umar] semuanya meriwayatkan dari [Ibnu Uyainah] berkata [Amru], telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Manshur bin Shafiyyah] dari [Ibunya] dari [Aisyah] dia berkata, \"Seorang perempuan bertanya Nabi Shallallahu'alaihiwasallam, 'Bagaimanakah cara orang perempuan mandi dari haidnya?\" Perawi Hadits berkata, \"Kemudian Aisyah menyebutkan bahwa beliau mengajarkan cara mandi kepada perempuan tersebut. Kemudian beliau bersabda, 'Kamu ambil kapas misk (kasturi), lalu kamu bersucilah dengannya'. Perempuan itu berkata, 'Bagaimana cara bersuci dengannya? ' Beliau bersabda, 'Maha suci Allah! Kamu bersucilah dengannya dan beliau pun bersembunyi. Sufyan bin Uyainah memberi isyarat kepada kami dengan meletakkan tangan pada wajahnya.\" Perawi Hadits melanjutkan ceritanya, \"Lalu Aisyah berkata, 'Maka kutarik perempuan itu karena aku sudah tahu apa yang dikehendaki oleh Nabi Shallallahu'alaihiwasallam. Dan kukatakan kepada perempuan tersebut, 'Sapulah tempat keluar darah haidmu dengan kapas itu'.\" Dan berkata [Ibnu Abi Umar] dalam riwayatnya, \"Lalu aku berkata, 'Sapulah dengan kapas itu sisa-sisa darah'.\" Dan telah menceritakan kepada kami [Ahmad bin Sa'id ad-Darimi] telah menceritakan kepada kami [Habban] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Manshur] dari [ibunya] dari [Aisyah] bahwa seorang perempuan bertanya kepada Nabi Shallallahu'alaihiwasallam, \"Bagaimana (cara) aku mandi ketika bersuci?\" Maka beliau bersabda, \"Ambillah kapas yang diberi minyak misk, lalu berwudhulah dengannya.\" Kemudian dia menyebutkan semisal hadits Sufyan."
            },
            {
                "number": 488,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ إِبْرَاهِيمَ بْنِ الْمُهَاجِرِ قَالَ سَمِعْتُ صَفِيَّةَ تُحَدِّثُ عَنْ عَائِشَةَأَنَّ أَسْمَاءَ سَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ غُسْلِ الْمَحِيضِ فَقَالَ تَأْخُذُ إِحْدَاكُنَّ مَاءَهَا وَسِدْرَتَهَا فَتَطَهَّرُ فَتُحْسِنُ الطُّهُورَ ثُمَّ تَصُبُّ عَلَى رَأْسِهَا فَتَدْلُكُهُ دَلْكًا شَدِيدًا حَتَّى تَبْلُغَ شُؤُونَ رَأْسِهَا ثُمَّ تَصُبُّ عَلَيْهَا الْمَاءَ ثُمَّ تَأْخُذُ فِرْصَةً مُمَسَّكَةً فَتَطَهَّرُ بِهَا فَقَالَتْ أَسْمَاءُ وَكَيْفَ تَطَهَّرُ بِهَا فَقَالَ سُبْحَانَ اللَّهِ تَطَهَّرِينَ بِهَا فَقَالَتْ عَائِشَةُ كَأَنَّهَا تُخْفِي ذَلِكَ تَتَبَّعِينَ أَثَرَ الدَّمِ وَسَأَلَتْهُ عَنْ غُسْلِ الْجَنَابَةِ فَقَالَ تَأْخُذُ مَاءً فَتَطَهَّرُ فَتُحْسِنُ الطُّهُورَ أَوْ تُبْلِغُ الطُّهُورَ ثُمَّ تَصُبُّ عَلَى رَأْسِهَا فَتَدْلُكُهُ حَتَّى تَبْلُغَ شُؤُونَ رَأْسِهَا ثُمَّ تُفِيضُ عَلَيْهَا الْمَاءَ فَقَالَتْ عَائِشَةُ نِعْمَ النِّسَاءُ نِسَاءُ الْأَنْصَارِ لَمْ يَكُنْ يَمْنَعُهُنَّ الْحَيَاءُ أَنْ يَتَفَقَّهْنَ فِي الدِّينِو حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ فِي هَذَا الْإِسْنَادِ نَحْوَهُ وَقَالَ قَالَ سُبْحَانَ اللَّهِ تَطَهَّرِي بِهَا وَاسْتَتَرَ و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ كِلَاهُمَا عَنْ أَبِي الْأَحْوَصِ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ قَالَتْ دَخَلَتْ أَسْمَاءُ بِنْتُ شَكَلٍ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ كَيْفَ تَغْتَسِلُ إِحْدَانَا إِذَا طَهُرَتْ مِنْ الْحَيْضِ وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فِيهِ غُسْلَ الْجَنَابَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar] [Ibnu al-Mutsanna] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Ibrahim bin al-Muhajir] dia berkata, saya mendengar [Shafiyyah] menceritakan dari [Aisyah] bahwa Asma' bertanya kepada Nabi shallallahu 'alaihi wasallam tentang mandinya orang yang haid. Maka beliau bersabda, \"Salah seorang dari kalian hendaklah mengambil airnya dan tanaman bidaranya, lalu dia bersuci, lalu membaguskan bersucinya, kemudian menyiramkan air pada kepalanya, lalu memijat-mijatnya dengan keras hingga mencapai akar rambut kepalanya, kemudian menyiramkan air padanya, kemudian dia mengambil kapas bermisik, lalu bersuci dengannya. Lalu Asma' berkata, 'Bagaimana dia bersuci dengannya? ' Beliau bersabda, 'Subhanallah, bersucilah kamu dengannya.' Lalu Aisyah berkata -seakan-akan dia menutupi hal tersebut-, 'Kamu sapu bekas-bekas darah.' Dan dia bertanya kepada beliau tentang mandi junub, maka beliau bersabda, 'Hendaklah kamu mengambil air lalu bersuci dengan sebaik-baiknya bersuci, atau bersangat-sangat dalam bersuci kemudian kamu siramkan air pada kepala, lalu memijatnya hingga mencapai dasar kepalanya, kemudian mencurahkan air padanya.' Lalu Aisyah berkata, 'Sebaik-baik wanita adalah wanita Anshar yang rasa malu tidak menghalangi mereka untuk mendalami masalah agamanya'.\" Dan telah menceritakan kepada kami [ubaidhullah bin Muadz] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Syu'bah] dalam isnad ini hadits semisalnya, dan perawi berkata, beliau bersabda, \"Subhanallah, bersucilah dengannya, dan beliau bersembunyi (karena malu).\" Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abi Syaibah] keduanya meriwayatkan dari [Abu al-Ahwash] dari [Ibrahim bin Muhajir] dari [Shafiyyah binti Syaibah] dari [Aisyah] dia berkata, \"Asma' bintu Syakal mengunjungi Rasulullah shallallahu 'alaihi wasallam seraya berkata, 'Wahai Rasulullah, bagaimana cara salah seorang di antara kami mandi apabila dia ingin bersuci dari haid? '.\" Lalu dia membawakan hadits tersebut tanpa menyebutkan, \"Mandi Junub.\""
            },
            {
                "number": 489,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْجَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلَا أَطْهُرُ أَفَأَدَعُ الصَّلَاةَ فَقَالَ لَا إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتْ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّيحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ بِمِثْلِ حَدِيثِ وَكِيعٍ وَإِسْنَادِهِ وَفِي حَدِيثِ قُتَيْبَةَ عَنْ جَرِيرٍ جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشِ بْنِ عَبْدِ الْمُطَّلِبِ بْنِ أَسَدٍ وَهِيَ امْرَأَةٌ مِنَّا قَالَ وَفِي حَدِيثِ حَمَّادِ بْنِ زَيْدٍ زِيَادَةُ حَرْفٍ تَرَكْنَا ذِكْرَهُ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Waki'] dari [Hisyam bin Urwah] dari [bapaknya] dari [Aisyah] dia berkata, \"Fathimah binti Abi Hubaisy mendatangi Nabi shallallahu 'alaihi wasallam seraya berkata, 'Wahai Rasulullah, aku adalah seorang perempuan berdarah istihadhah, maka aku tidak suci, apakah aku harus meninggalkan sholat? ' Maka beliau bersabda, \"Darah tersebut ialah darah penyakit bukan haid, apabila kamu didatangi haid hendaklah kamu meninggalkan sholat. Apabila darah haid berhenti dari keluar, hendaklah kamu mandi dan mendirikan sholat.\" Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abdul Aziz bin Muhammad] dan [Abu Mu'awiyah] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Khalaf bin Hisyam] telah menceritakan kepada kami [Hammad bin Zaid] semuanya dari [Hisyam bin Urwah] dengan semisal hadits Waki' dan sanadnya, sedangkan dalam hadits Qutaibah dari Jarir, Fathimah binti Abi Hubais bin Abdul Muththalib bin Asad datang, sedangkan dia adalah perempuan dari kalangan kami. Perawi berkata, dan dalam hadits Hammad bin Zaid ada tambahan huruf yang tidak kami sebutkan."
            },
            {
                "number": 490,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْاسْتَفْتَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنِّي أُسْتَحَاضُ فَقَالَ إِنَّمَا ذَلِكِ عِرْقٌ فَاغْتَسِلِي ثُمَّ صَلِّي فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلَاةٍقَالَ اللَّيْثُ بْنُ سَعْدٍ لَمْ يَذْكُرْ ابْنُ شِهَابٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ أَنْ تَغْتَسِلَ عِنْدَ كُلِّ صَلَاةٍ وَلَكِنَّهُ شَيْءٌ فَعَلَتْهُ هِيَ و قَالَ ابْنُ رُمْحٍ فِي رِوَايَتِهِ ابْنَةُ جَحْشٍ وَلَمْ يَذْكُرْ أُمَّ حَبِيبَةَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [al-Laits] dari [Ibnu Syihab] dari [Urwah] dari [Aisyah] bahwa dia berkata, \"Ummu Habibah binti Jahsy telah meminta fatwa dari Rasulullah Shallallahu'alaihiwasallam kemudian berkata, 'Aku ini perempuan yang berdarah istihadhah. Maka Rasulullah Shallallahu'alaihiwasallam menjawab dengan bersabda, ' itu adalah darah penyakit, maka hendaklah kamu mandi kemudian sholatlah, maka dia mandi pada setiap waktu sholat'.\" Al-Laits bin Sa'd berkata, \"Ibnu Syihab tidak menyebutkan bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan Ummu Habibah bintu Jahsy untuk mandi pada setiap waktu sholat, akan tetapi itu adalah sesuatu yang dia perbuat sendiri.\" Ibnu Rumh berkata dalam riwayatnya, \"Ibnah Jahsy.\" Dan tidak menyebutkan, \"Ummu Habibah.\""
            },
            {
                "number": 491,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ خَتَنَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ اسْتُحِيضَتْ سَبْعَ سِنِينَ فَاسْتَفْتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذِهِ لَيْسَتْ بِالْحَيْضَةِ وَلَكِنَّ هَذَا عِرْقٌ فَاغْتَسِلِي وَصَلِّيقَالَتْ عَائِشَةُ فَكَانَتْ تَغْتَسِلُ فِي مِرْكَنٍ فِي حُجْرَةِ أُخْتِهَا زَيْنَبَ بِنْتِ جَحْشٍ حَتَّى تَعْلُوَ حُمْرَةُ الدَّمِ الْمَاءَ قَالَ ابْنُ شِهَابٍ فَحَدَّثْتُ بِذَلِكَ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ فَقَالَ يَرْحَمُ اللَّهُ هِنْدًا لَوْ سَمِعَتْ بِهَذِهِ الْفُتْيَا وَاللَّهِ إِنْ كَانَتْ لَتَبْكِي لِأَنَّهَا كَانَتْ لَا تُصَلِّي و حَدَّثَنِي أَبُو عِمْرَانَ مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ أَخْبَرَنَا إِبْرَاهِيمُ يَعْنِى ابْنَ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْ جَاءَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَتْ اسْتُحِيضَتْ سَبْعَ سِنِينَ بِمِثْلِ حَدِيثِ عَمْرِو بْنِ الْحَارِثِ إِلَى قَوْلِهِ تَعْلُوَ حُمْرَةُ الدَّمِ الْمَاءَ وَلَمْ يَذْكُرْ مَا بَعْدَهُ و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّ ابْنَةَ جَحْشٍ كَانَتْ تُسْتَحَاضُ سَبْعَ سِنِينَ بِنَحْوِ حَدِيثِهِمْ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Salamah al-Muradi] telah menceritakan kepada kami [Abdullah bin Wahb] dari [Amr bin al-Harits] dari [Ibnu Syihab] dari [Urwah bin az-Zubair] dan [Amrah binti Abdurrahman] dari [Aisyah istri Nabi shallallahu 'alaihi wasallam] bahwa Ummu Habibah binti Jahsy (kerabat dekat dari pihak istri) Rasulullah shallallahu 'alaihi wasallam -sedangkan ketika itu dia berada di bawah tali pernikahan dengan Abdurrahman bin Auf- sedang istihadhah tujuh tahun, lalu dia meminta fatwa Rasulullah shallallahu 'alaihi wasallam dalam masalah hal tersebut. Maka Rasulullah shallallahu 'alaihi wasallam bersabda, \" ini bukanlah darah haid, akan tetapi darah penyakit, maka mandilah dan sholatlah.\" Aisyah berkata, \"Maka dia mandi di baskom besar di kamar saudarinya, Zainab bintu Jahsy hingga merahnya darah naik ke permukaan air.\" Ibnu Syihab berkata, \"Lalu aku menceritakan hal tersebut kepada Abu Bakar bin Abdurrahman bin al-Harits bin Hisyam maka dia berkata, 'Semoga Allah merahmati Hindun kalau dia mendengar fatwa ini. Demi Allah, jika dia dulu mendengar, niscaya dia akan menangis karena dia tidak melakukan sholat'.\" Dan telah menceritakan kepadaku [Abu Imran Muhammad bin Ja'far bin Ziyad] telah mengabarkan kepada kami [Ibrahim yaitu Ibnu Sa'ad] dari [Ibnu Syihab] dari [Amrah binti Abdurrahman] dari [Aisyah radhiyallahu'anhu] dia berkata, \"Ummu Habibah bintu Jahsy mendatangi Rasulullah Shallallahu'alaihiwasallam, dan dia dalam keadaan istihadhah selama tujuh tahun\" sebagaimana hadits Amru bin al-Harits hingga perkataannya, \"Merahnya naik naik ke permukaan air.\" Dan dia tidak menyebutkan kalimat sesudahnya. Dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [az-Zuhri] dari [Amrah] dari [Aisyah] \"bahwa putrid Jahsy dahulu mengalami istihadhah selama tujuh tahun\" sebagaimana hadits mereka."
            },
            {
                "number": 492,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ جَعْفَرٍ عَنْ عِرَاكٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْإِنَّ أَمَّ حَبِيبَةَ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّمِ فَقَالَتْ عَائِشَةُ رَأَيْتُ مِرْكَنَهَا مَلْآنَ دَمًا فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْكُثِي قَدْرَ مَا كَانَتْ تَحْبِسُكِ حَيْضَتُكِ ثُمَّ اغْتَسِلِي وَصَلِّي",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [al-Laits] --lewat jalur periwayatan lain-- Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Yazid bin Abi Habib] dari [Ja'far] dari ['Irak] dari [Urwah] dari [Aisyah] bahwasanya dia berkata, \" Ummu Habibah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang darah.\" Lalu Aisyah berkata lagi, \"Saya melihat baskom besarnya penuh dengan darah.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya, \"Tetap tahanlah dirimu selama kadar haidmu menahanmu, kemudian mandilah dan sholatlah.\""
            },
            {
                "number": 493,
                "arab": "حَدَّثَنِي مُوسَى بْنُ قُرَيْشٍ التَّمِيمِيُّ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرِ بْنِ مُضَرَ حَدَّثَنِي أَبِي حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْإِنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ الَّتِي كَانَتْ تَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ شَكَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّمَ فَقَالَ لَهَا امْكُثِي قَدْرَ مَا كَانَتْ تَحْبِسُكِ حَيْضَتُكِ ثُمَّ اغْتَسِلِي فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلَاةٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Quraisy at-Tamimi] telah menceritakan kepada kami [Ishaq bin Bakar bin Mudhar] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Ja'far bin Rabi'ah] dari ['Irak bin Malik] dari [Urwah bin az-Zubair] dari [Aisyah, istri Nabi Shallallahu'alaihiwasallam] bahwa dia berkata, \" Ummu Habibah binta Jahsy yang menjadi istri Abdurrahman bin Auf mengadu kepada Rasulullah shallallahu 'alaihi wasallam tentang darah. Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya, 'Diamlah sejarak waktu ketika haid menghalangimu (untuk sholat), kemudian mandilah.' Maka dia mandi ketika setiap waktu sholat.\""
            },
            {
                "number": 494,
                "arab": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ مُعَاذَةَ ح و حَدَّثَنَا حَمَّادٌ عَنْ يَزِيدَ الرِّشْكِ عَنْ مُعَاذَةَ أَنَّامْرَأَةً سَأَلَتْ عَائِشَةَ فَقَالَتْ أَتَقْضِي إِحْدَانَا الصَّلَاةَ أَيَّامَ مَحِيضِهَا فَقَالَتْ عَائِشَةُ أَحَرُورِيَّةٌ أَنْتِ قَدْ كَانَتْ إِحْدَانَا تَحِيضُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ لَا تُؤْمَرُ بِقَضَاءٍ",
                "id": "Telah menceritakan kepada kami [Abu ar-Rabi' az-Zahrani] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Abu Qilabah] dari [Mu'adzah] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Hammad] dari [Yazid ar-Rasyk] dari [Mu'adzah] bahwa seorang perempuan bertanya kepada [Aisyah] seraya berkata, \"Apakah salah seorang di antara kami harus mengqadha' sholat semasa didatangi haid kami?\" Aisyah menjawab, \"Apakah kamu dari golongan Haruriyyah? Suatu ketika dulu ada di antara kami yang didatangi haid pada masa Rasulullah Shallallahu'alaihiwasallam tetapi kami tidak diperintahkan mengqadha sholat.\""
            },
            {
                "number": 495,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ قَالَ سَمِعْتُ مُعَاذَةَأَنَّهَا سَأَلَتْ عَائِشَةَ أَتَقْضِي الْحَائِضُ الصَّلَاةَ فَقَالَتْ عَائِشَةُ أَحَرُورِيَّةٌ أَنْتِ قَدْ كُنَّ نِسَاءُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحِضْنَ أَفَأَمَرَهُنَّ أَنْ يَجْزِينَقَالَ مُحَمَّدُ بْنُ جَعْفَرٍ تَعْنِي يَقْضِينَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yazid] dia berkata, saya mendengar [Mu'adzah] bahwa dia bertanya kepada [Aisyah], \"Apakah wanita haid harus mengqadha sholat?\" Aisyah menjawab, \"Apakah kamu dari golongan Haruriyyah? Sungguh kami dulu, para istri Nabi shallallahu 'alaihi wasallam haid, apakah beliau memerintahkan mereka untuk mengqadha sholat?\" Muhammad bin Ja'far berkata, maksudnya mengqadha'nya."
            },
            {
                "number": 496,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عَاصِمٍ عَنْ مُعَاذَةَ قَالَتْسَأَلْتُ عَائِشَةَ فَقُلْتُ مَا بَالُ الْحَائِضِ تَقْضِي الصَّوْمَ وَلَا تَقْضِي الصَّلَاةَ فَقَالَتْ أَحَرُورِيَّةٌ أَنْتِ قُلْتُ لَسْتُ بِحَرُورِيَّةٍ وَلَكِنِّي أَسْأَلُ قَالَتْ كَانَ يُصِيبُنَا ذَلِكَ فَنُؤْمَرُ بِقَضَاءِ الصَّوْمِ وَلَا نُؤْمَرُ بِقَضَاءِ الصَّلَاةِ",
                "id": "Dan telah menceritakan kepada kami [Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Ashim] dari [Mu'adzah] dia berkata, \"Saya bertanya kepada [Aisyah] seraya berkata, 'Kenapa gerangan wanita yang haid mengqadha' puasa dan tidak mengqadha' sholat? ' Maka Aisyah menjawab, 'Apakah kamu dari golongan Haruriyah? ' Aku menjawab, 'Aku bukan Haruriyah, akan tetapi aku hanya bertanya.' Dia menjawab, 'Kami dahulu juga mengalami haid, maka kami diperintahkan untuk mengqadha' puasa dan tidak diperintahkan untuk mengqadha' sholat'.\""
            },
            {
                "number": 497,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي النَّضْرِ أَنَّ أَبَا مُرَّةَ مَوْلَى أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ تَقُولُذَهَبْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ ابْنَتُهُ تَسْتُرُهُ بِثَوْبٍ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata, saya membaca di hadapan [Malik] dari [Abu an-Nadhar] bahwa [Abu Murrah, maula Ummu Hani' bintu Abi Thalib] telah mengabarkan kepadanya bahwa dia mendengar [Ummu Hani' bintu Abi Thalib] berkata, \"Aku pergi menuju Rasulullah shallallahu 'alaihi wasallam pada tahun Fath al-Makkah, maka aku mendapatkannya sedang mandi, sedangkan Fathimah, putrinya menutupinya dengan baju.\""
            },
            {
                "number": 498,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ أَنَّ أَبَا مُرَّةَ مَوْلَى عَقِيلٍ حَدَّثَهُ أَنَّ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ حَدَّثَتْهُ أَنَّهُلَمَّا كَانَ عَامُ الْفَتْحِ أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِأَعْلَى مَكَّةَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى غُسْلِهِ فَسَتَرَتْ عَلَيْهِ فَاطِمَةُ ثُمَّ أَخَذَ ثَوْبَهُ فَالْتَحَفَ بِهِ ثُمَّ صَلَّى ثَمَانَ رَكَعَاتٍ سُبْحَةَ الضُّحَىو حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ بِهَذَا الْإِسْنَادِ وَقَالَ فَسَتَرَتْهُ ابْنَتُهُ فَاطِمَةُ بِثَوْبِهِ فَلَمَّا اغْتَسَلَ أَخَذَهُ فَالْتَحَفَ بِهِ ثُمَّ قَامَ فَصَلَّى ثَمَانَ سَجَدَاتٍ وَذَلِكَ ضُحًى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh bin al-Muhajir] telah mengabarkan kepada kami [al-Laits] dari [Yazid bin Abi Habib] dari [Sa'id bin Abi Hind] bahwa [Abu Murrah, maula 'Aqil] telah menceritakan kepadanya \"Bahwa [Ummu Hani' bintu Abi Thalib] telah menceritakan kepadanya bahwa dia ketika tahun Fath al-Makkah mendatangi Rasulullah Shallallahu'alaihiwasallam, sedangkan beliau di bagian dataran teratas dari Makkah, Rasulullah sedang mandi, lalu Fathimah menutupinya, kemudian beliau mengambil bajunya, lalu berselimut dengannya, kemudian sholat delapan raka'at pada pagi dhuha.\" Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] dari [al-Walid bin Katsir] dari [Sa'id bin Abi Hind] dengan sanad ini, seraya dia berkata, 'Lalu putrinya, Fathimah menutupinya dengan bajunya, ketika beliau telah mandi maka beliau mengambil bajunya dan berselimut dengannya, kemudian melakukan sholat delapan sujud, dan itulah sholat dhuha.\""
            },
            {
                "number": 499,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا مُوسَى الْقَارِئُ حَدَّثَنَا زَائِدَةُ عَنْ الْأَعْمَشِ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ قَالَتْوَضَعْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاءً وَسَتَرْتُهُ فَاغْتَسَلَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim al-Hanzhali] telah mengabarkan kepada kami [Musa al-Qari'] telah menceritakan kepada kami [Zaidah] dari [al-A'masy] dari [Salim bin Abi Ja'd] dari [Kuraib] dari [Ibnu Abbas] dari [Maimunah] dia berkata, \"Aku meletakkan air untuk Nabi Shallallahu'alaihiwasallam, dan aku menutupinya, lalu beliau mandi.\""
            },
            {
                "number": 500,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ قَالَ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْظُرُ الرَّجُلُ إِلَى عَوْرَةِ الرَّجُلِ وَلَا الْمَرْأَةُ إِلَى عَوْرَةِ الْمَرْأَةِ وَلَا يُفْضِي الرَّجُلُ إِلَى الرَّجُلِ فِي ثَوْبٍ وَاحِدٍ وَلَا تُفْضِي الْمَرْأَةُ إِلَى الْمَرْأَةِ فِي الثَّوْبِ الْوَاحِدِو حَدَّثَنِيهِ هَارُونُ بْنُ عَبْدِ اللَّهِ وَمُحَمَّدُ بْنُ رَافِعٍ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ بْنُ عُثْمَانَ بِهَذَا الْإِسْنَادِ وَقَالَا مَكَانَ عَوْرَةِ عُرْيَةِ الرَّجُلِ وَعُرْيَةِ الْمَرْأَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Zaid bin al-Hubab] dari [adh-Dhahhak bin Utsman] dia berkata, telah mengabarkan kepadaku [Zaid bin Aslam] dari [Abdurrahman bin Abi Sa'id al-Khudri] dari [bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda, \"Tidaklah (boleh) seorang laki-laki melihat aurat laki-laki, dan perempuan melihat aurat perempuan, dan tidaklah (boleh) seorang laki-laki bersatu dengan laki-laki lain dalam satu baju. Dan tidaklah (boleh) seorang wanita bersatu dengan wanita lain dalam satu baju.\" Dan telah menceritakannya kepadaku tentangnya [Harun bin Abdullah] dan [Muhammad bin Rafi'] keduanya berkata, telah menceritakan kepada kami [Ibnu Abi Fudhaik] telah mengabarkan kepada kami [adh-Dhahhak bin Utsman] dengan isnad ini dan keduanya berkata dengan menggantikan kata \"aurat\" dengan \"telanjang\" seorang laki-laki dan perempuan."
            },
            {
                "number": 501,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَاوَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ بَنُو إِسْرَائِيلَ يَغْتَسِلُونَ عُرَاةً يَنْظُرُ بَعْضُهُمْ إِلَى سَوْأَةِ بَعْضٍ وَكَانَ مُوسَى عَلَيْهِ السَّلَام يَغْتَسِلُ وَحْدَهُ فَقَالُوا وَاللَّهِ مَا يَمْنَعُ مُوسَى أَنْ يَغْتَسِلَ مَعَنَا إِلَّا أَنَّهُ آدَرُ قَالَ فَذَهَبَ مَرَّةً يَغْتَسِلُ فَوَضَعَ ثَوْبَهُ عَلَى حَجَرٍ فَفَرَّ الْحَجَرُ بِثَوْبِهِ قَالَ فَجَمَحَ مُوسَى بِإِثْرِهِ يَقُولُ ثَوْبِي حَجَرُ ثَوْبِي حَجَرُ حَتَّى نَظَرَتْ بَنُو إِسْرَائِيلَ إِلَى سَوْأَةِ مُوسَى قَالُوا وَاللَّهِ مَا بِمُوسَى مِنْ بَأْسٍ فَقَامَ الْحَجَرُ حَتَّى نُظِرَ إِلَيْهِ قَالَ فَأَخَذَ ثَوْبَهُ فَطَفِقَ بِالْحَجَرِ ضَرْبًا قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنَّهُ بِالْحَجَرِ نَدَبٌ سِتَّةٌ أَوْ سَبْعَةٌ ضَرْبُ مُوسَى بِالْحَجَرِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dia berkata, ini adalah sesuatu yang diceritakan [Abu Hurairah] dari Muhammad, Rasulullah Shallallahu'alaihiwasallam maka dia menyebutkan beberapa hadits darinya. Dan Rasulullah Shallallahu'alaihiwasallam pernah bersabda, \"Dahulu, orang-orang Bani Israil mandi telanjang. Sebagian mereka melihat aurat sebagian yang lain. Dahulu Musa 'Alaihissalam juga mandi sendirian. Lalu Mereka berkata, 'Demi Allah, sesuatu yang menyebabkan Musa tidak mau mandi bersama dengan kita ialah karena penyakit pada zakar yang menjadikannya mengembang.' Suatu ketika Musa mandi. Dia letakkan pakaiannya di atas sebuah batu. Tiba-tiba batu tadi bergerak dengan membawa pakaiannya. Musa berlari mengejarnya sambil berteriak, 'Hai batu! Tinggalkan pakaianku! Hai batu! Tinggalkan pakaianku! Sehingga orang-orang Bani Israil dapat melihat aurat Musa.' Kemudian mereka berkata, 'Demi Allah ternyata Musa tiada sedikit pun aib penyakit.' Setelah itu batu tersebut berhenti lalu Musa mengambil pakaiannya kemudian memukul batu tadi'.\" Abu Hurairah berkata, \"Demi Allah, pada batu tadi terdapat bekas pukulan Musa, tujuh atau enam kali pukulan.\""
            },
            {
                "number": 502,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ وَمُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ جَمِيعًا عَنْ مُحَمَّدِ بْنِ بَكْرٍ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ وَمُحَمَّدُ بْنُ رَافِعٍ وَاللَّفْظُ لَهُمَا قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُالَمَّا بُنِيَتْ الْكَعْبَةُ ذَهَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَبَّاسٌ يَنْقُلَانِ حِجَارَةً فَقَالَ الْعَبَّاسُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلْ إِزَارَكَ عَلَى عَاتِقِكَ مِنْ الْحِجَارَةِ فَفَعَلَ فَخَرَّ إِلَى الْأَرْضِ وَطَمَحَتْ عَيْنَاهُ إِلَى السَّمَاءِ ثُمَّ قَامَ فَقَالَ إِزَارِي إِزَارِي فَشَدَّ عَلَيْهِ إِزَارَهُقَالَ ابْنُ رَافِعٍ فِي رِوَايَتِهِ عَلَى رَقَبَتِكَ وَلَمْ يَقُلْ عَلَى عَاتِقِكَ",
                "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim al-Hanzhali] dan [Muhammad bin Hatim bin Maimun] semuanya meriwayatkan dari [Muhammad bin Bakr] dia berkata, telah mengabarkan kepada kami [Ibnu Juraij] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Ishaq bin Manshur] dan [Muhammad bin Rafi'] dan lafazh tersebut milik keduanya. Ishaq berkata, telah mengabarkan kepada kami sedangkan Ibnu Rafi' berkata, telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Amr bin Dinar] bahwa dia mendengar [Jabir bin Abdullah] dia berkata, \"Ketika Ka'bah dibangun, Nabi Shallallahu'alaihiwasallam. bersama Abbas pergi untuk mengangkat batu. Maka Abbas berkata kepada Nabi Shallallahu'alaihiwasallam, 'Angkatkan kainmu ke bahumu untuk alas batu. Maka beliau melakukannya, lalu beliau jatuh tersungkur lalu beliau mendongakkan kedua matanya ke langit, kemudian berdiri sambil berkata, 'Kainku, kainku'. Kemudian Beliau memakai kain tersebut.\" Ibnu Rafi' berkata dalam riwayatnya, \"Angkatlah di atas lehermu\" dan bukan berkata, \"Di atas pundakmu.\""
            },
            {
                "number": 503,
                "arab": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَقَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْقُلُ مَعَهُمْ الْحِجَارَةَ لِلْكَعْبَةِ وَعَلَيْهِ إِزَارُهُ فَقَالَ لَهُ الْعَبَّاسُ عَمُّهُ يَا ابْنَ أَخِي لَوْ حَلَلْتَ إِزَارَكَ فَجَعَلْتَهُ عَلَى مَنْكِبِكَ دُونَ الْحِجَارَةِ قَالَ فَحَلَّهُ فَجَعَلَهُ عَلَى مَنْكِبِهِ فَسَقَطَ مَغْشِيًّا عَلَيْهِ قَالَ فَمَا رُئِيَ بَعْدَ ذَلِكَ الْيَوْمِ عُرْيَانًا",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin harb] telah menceritakan kepada kami [Rauh bin Ubadah] telah menceritakan kepada kami [Zakariya' bin Ishaq] telah menceritakan kepada kami [Amru bin Dinar] dia berkata, \"Saya mendengar [Jabir bin Abdullah] bercerita bahwa Rasulullah shallallahu 'alaihi wasallam memindahkan batu untuk Ka'bah bersama mereka, dan beliau dalam keadaan memakai sarung, maka al-Abbas, pamannya berkata kepadanya, 'Wahai anak saudaraku, kalau seandainya kamu berkenan melepas sarungmu dan meletakkannya di atas tengkukmu di bawah batu'.\" Perawi berkata, \"Lalu beliau melepaskannya dan meletakkannya di atas bahunya. Lalu beliau jatuh pingsan. Dia berkata, \"Setelah itu beliau tak pernah lagi tampak telanjang.\""
            },
            {
                "number": 504,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى الْأُمَوِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمِ بْنِ عَبَّادِ بْنِ حُنَيْفٍ الْأَنْصَارِيُّ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَأَقْبَلْتُ بِحَجَرٍ أَحْمِلُهُ ثَقِيلٍ وَعَلَيَّ إِزَارٌ خَفِيفٌ قَالَ فَانْحَلَّ إِزَارِي وَمَعِيَ الْحَجَرُ لَمْ أَسْتَطِعْ أَنْ أَضَعَهُ حَتَّى بَلَغْتُ بِهِ إِلَى مَوْضِعِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْجِعْ إِلَى ثَوْبِكَ فَخُذْهُ وَلَا تَمْشُوا عُرَاةً",
                "id": "Telah menceritakan kepada kami [Sa'id bin Yahya al-Umawi] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Utsman bin Hakim bin Abbad bin Hunaif al-Anshari] telah mengabarkan kepadaku [Abu Umamah bin Sahal bin Hunaif] dari [al-Miswar bin Makhramah] dia berkata, \"Aku pernah menghadap batu yang sangat berat untuk membawanya sedang saat itu aku memakai sehelai sarung yang ringan dan tipis.\" Dia berkata lagi, \"Lalu sarung yang aku pakai itu terlepas dariku tapi aku tidak bisa meletakkan batu itu dan harus terus membawanya sampai ke tempatnya.' Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda, 'Kembalilah ke pakaianmu (sarungmu), pakailah ia dan janganlah kamu berjalan sambil telanjang\"."
            },
            {
                "number": 505,
                "arab": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ قَالَا حَدَّثَنَا مَهْدِيٌّ وَهُوَ ابْنُ مَيْمُونٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ عَنْ الْحَسَنِ بْنِ سَعْدٍ مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَأَرْدَفَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ خَلْفَهُ فَأَسَرَّ إِلَيَّ حَدِيثًا لَا أُحَدِّثُ بِهِ أَحَدًا مِنْ النَّاسِ وَكَانَ أَحَبَّ مَا اسْتَتَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَتِهِ هَدَفٌ أَوْ حَائِشُ نَخْلٍقَالَ ابْنُ أَسْمَاءَ فِي حَدِيثِهِ يَعْنِي حَائِطَ نَخْلٍ",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farrukh] dan [Abdullah bin Muhammad bin Asma adh-Dhuba'i] keduanya berkata, \"Telah menceritakan kepada kami [Mahdi] dan dia adalah Ibnu Maimun telah menceritakan kepada kami [Muhammad bin Abdullah bin Abi Ya'qub] dari [al-Hasan bin Sa'd budak al-Hasan bin Ali] dari [Abdullah bin Ja'far] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memboncengku di belakangnya pada suatu hari, lalu beliau membisikkan suatu hadis yang tidak aku ceritakan kepada seorang pun manusia, 'Sesuatu yang paling disukai Rasulullah shallallahu 'alaihi wasallam untuk dijadikan alat bersembunyi untuk menunaikan hajatnya adalah bangunan WC dan kebun pohon kurma.' Ibnu Asma' berkata dalam haditsnya, 'Yaitu Kebun kurma'.\""
            },
            {
                "number": 506,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرُونَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ شَرِيكٍ يَعْنِي ابْنَ أَبِي نَمِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ قَالَخَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الِاثْنَيْنِ إِلَى قُبَاءَ حَتَّى إِذَا كُنَّا فِي بَنِي سَالِمٍ وَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى بَابِ عِتْبَانَ فَصَرَخَ بِهِ فَخَرَجَ يَجُرُّ إِزَارَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْجَلْنَا الرَّجُلَ فَقَالَ عِتْبَانُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الرَّجُلَ يُعْجَلُ عَنْ امْرَأَتِهِ وَلَمْ يُمْنِ مَاذَا عَلَيْهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْمَاءُ مِنْ الْمَاءِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya], [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] Yahya bin Yahya berkata, telah mengabarkan kepada kami, sedangkan dua orang yang lainnya berkata, telah menceritakan kepada kami [Ismail yaitu Ibnu Ja'far] dari [Syarik yaitu Ibnu Abi Namir] dari [Abdurrahman bin Abi Sa'id al-Khudri] dari [bapaknya] dia berkata, \"Aku keluar bersama Rasulullah shallallahu 'alaihi wasallam pada hari Senin ke Quba' hingga kita berada pada Bani Salim, maka Rasulullah shallallahu 'alaihi wasallam berhenti pada pintu Itban, lalu berteriak di sampingnya, maka dia keluar dengan menyeret sarungnya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda, 'Kami telah membuat tergesa seorang laki-laki.' Maka Itban berkata, 'Wahai Rasulullah, apa pendapatmu terhadap seorang laki-laki yang ditimpa sesuatu sehingga mengharuskannya bersegera meninggalkan istrinya, sedangkan dia belum mengeluarkan mani, apa yang harus dilakukannya? ' Rasulullah shallallahu 'alaihi wasallam bersabda, ' air (mandi wajib) itu disebabkan karena (keluarnya) air mani'.\""
            },
            {
                "number": 507,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ حَدَّثَهُ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّمَا الْمَاءُ مِنْ الْمَاءِ",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id al-Aili] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru bin al-Harits] dari [Ibnu Syihab] telah menceritakan kepadanya bahwa [Abu Salamah bin Abdurrahman] telah meriwayatkan kepadanya dari [Abu Sa'id al-Khudri] dari Nabi shallallahu 'alaihi wasallam bahwa air (mandi wajib) itu disebabkan karena (keluarnya) air mani."
            },
            {
                "number": 508,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا الْمُعْتَمِرُ حَدَّثَنَا أَبِي حَدَّثَنَا أَبُو الْعَلَاءِ بْنُ الشِّخِّيرِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْسَخُ حَدِيثُهُ بَعْضُهُ بَعْضًا كَمَا يَنْسَخُ الْقُرْآنُ بَعْضُهُ بَعْضًا",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Mu'adz al-Anbari] telah menceritakan kepada kami [al-Mu'tamir] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Abu al-Ala' bin asy-Syikhkhir] dia berkata, \"Sebagian hadits Rasulullah shallallahu 'alaihi wasallam menasakh (menghapus) sebahagian hadits beliau yang lain sebagaimana sebahagian al-qur'an menasakh sebahagian yang lain.\""
            },
            {
                "number": 509,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ذَكْوَانَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى رَجُلٍ مِنْ الْأَنْصَارِ فَأَرْسَلَ إِلَيْهِ فَخَرَجَ وَرَأْسُهُ يَقْطُرُ فَقَالَ لَعَلَّنَا أَعْجَلْنَاكَ قَالَ نَعَمْ يَا رَسُولَ اللَّهِ قَالَ إِذَا أُعْجِلْتَ أَوْ أَقْحَطْتَ فَلَا غُسْلَ عَلَيْكَ وَعَلَيْكَ الْوُضُوءُو قَالَ ابْنُ بَشَّارٍ إِذَا أُعْجِلْتَ أَوْ أُقْحِطْتَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [al-Hakam] dari [Dzakwan] dari [Abu Said al-Khudri] bahwa Rasulullah Shallallahu'alaihiwasallam pernah melalui sebuah rumah seorang Sahabat dari Anshar. Kemudian beliau menyuruh seseorang untuk memanggilnya. Lalu sahabat tadi keluar dalam keadaan kepalanya meneteskan (air keringat). Beliau bersabda, \"Barangkali kami yang membuat kamu tergesa-gesa.\" Sahabat itu menjawab, \"Benar, wahai Rasulullah.\" Beliau bersabda, \"Apabila kamu tergesa-gesa atau kamu tidak mengeluarkan mani semasa mengauli isteri maka kamu tidak perlu mandi. Kamu hanya wajib berwudhu.\" Ibnu Basysyar berkata dengan redaksi, \"Apabila kamu tergesa-gesa atau kamu tidak mengeluarkan mani.\""
            },
            {
                "number": 510,
                "arab": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ ح و حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ أَبِي أَيُّوبَ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يُصِيبُ مِنْ الْمَرْأَةِ ثُمَّ يُكْسِلُ فَقَالَ يَغْسِلُ مَا أَصَابَهُ مِنْ الْمَرْأَةِ ثُمَّ يَتَوَضَّأُ وَيُصَلِّي",
                "id": "Telah menceritakan kepada kami [Abu ar-Rabi' az-Zahrani] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Hisyam bin Urwah] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Abu Kuraib Muhammad bin al-Ala'] dan lafazh tersebut miliknya, telah menceritakan kepada kami [Abu Muawiyah] telah menceritakan kepada kami [Hisyam] dari [bapaknya] dari [Abu Ayyub] dari [Ubaiy bin Ka'ab] dia berkata, \"Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang seorang laki-laki yang mencumbu istrinya, kemudian dia tidak keluar air mani.\" Maka beliau menjawab, \"Hendaklah dia mandi disebabkan menyenggamai istrinya, kemudian berwudhu dan sholat.\""
            },
            {
                "number": 511,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مَحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ حَدَّثَنِي أَبِي عَنْ الْمَلِيِّ عَنْ الْمَلِيِّ يَعْنِي بِقَوْلِهِ الْمَلِيِّ عَنْ الْمَلِيِّ أَبُو أَيُّوبَ عَنْ أُبَيِّ بْنِ كَعْبٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي الرَّجُلِ يَأْتِي أَهْلَهُ ثُمَّ لَا يُنْزِلُ قَالَ يَغْسِلُ ذَكَرَهُ وَيَتَوَضَّأُ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Hisyam bin Urwah] telah menceritakan kepada kami [bapakku] dari al-Mali dari al-Mali yaitu dengan perkataanya al-Mali, dari al-Mali [Abu Ayyub] dari [Ubaiy bin Ka'ab] dari Rasulullah Shallallahu'alaihiwasallam, bahwa beliau berkata pada seorang laki-laki yang menyenggamai istrinya, kemudian tidak keluar mani. Beliau berkata lagi, \"Hendaklah dia mencuci dzakarnya dan berwudhu.\""
            },
            {
                "number": 512,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ ح و حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ وَاللَّفْظُ لَهُ حَدَّثَنِي أَبِي عَنْ جَدِّي عَنْ الْحُسَيْنِ بْنِ ذَكْوَانَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ أَخْبَرَنِي أَبُو سَلَمَةَ أَنَّ عَطَاءَ بْنَ يَسَارٍ أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّهُ سَأَلَ عُثْمَانَ بْنَ عَفَّانَ قَالَقُلْتُ أَرَأَيْتَ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ وَلَمْ يُمْنِ قَالَ عُثْمَانُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلَاةِ وَيَغْسِلُ ذَكَرَهُ قَالَ عُثْمَانُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَو حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ حَدَّثَنِي أَبِي عَنْ جَدِّي عَنْ الْحُسَيْنِ قَالَ يَحْيَى وَأَخْبَرَنِي أَبُو سَلَمَةَ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ أَخْبَرَهُ أَنَّهُ سَمِعَ ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] dan ['Abd bin Humaid] keduanya berkata, telah menceritakan kepada kami [Abd ash-Shamad bin Abdul Waris] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Abdul Waris bin Abd ash-Shamad] dan lafazh ini miliknya, Telah menceritakan kepadaku [bapakku] dari [kakekku] dari [al-Husain bin Dzakwan] dari [Yahya bin Abi Katsir] telah mengabarkan kepadaku [Abu Salamah] bahwa ['Atha' bin Yasar] telah mengabarkannya bahwa [Zaid bin Khalid al-Juhani] telah mengabarkannya bahwa dia bertanya kepada [Utsman bin Affan], dia berkata, \"Saya berkata, 'Apa pendapatmu jika seorang laki-laki menyenggamai istrinya, namun dia tidak sampai mengeluarkan mani? ' Utsman menjawab, 'Hendaklah dia berwudhu sebagaimana dia berwudhu untuk mendirikan sholat dan membasuh kemaluannya'. Utsman berkata lagi, 'Aku pernah mendengar hal ini dari Rasulullah Shallallahu'alaihiwasallam'.\" Dan telah menceritakan kepada kami [Abd al-Warits bin Abd ash-Shamad] telah menceritakan kepada kami [bapakku] dari [kakekku] dari [al-Husain] berkata [Yahya] dan telah mengabarkan kepada kami [Abu Salamah] bahwa [Urwah bin az-Zubair] telah mengabarkan kepadanya bahwa [Abu Ayyub] mengabarkan kepadanya bahwa dia mendengar hal tersebut dari Rasulullah Shallallahu'alaihiwasallam."
            },
            {
                "number": 513,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَأَبُو غَسَّانَ الْمِسْمَعِيُّ ح و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالُوا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ وَمَطَرٌ عَنْ الْحَسَنِ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الْأَرْبَعِ ثُمَّ جَهَدَهَا فَقَدْ وَجَبَ عَلَيْهِ الْغُسْلُوَفِي حَدِيثِ مَطَرٍ وَإِنْ لَمْ يُنْزِلْ قَالَ زُهَيْرٌ مِنْ بَيْنِهِمْ بَيْنَ أَشْعُبِهَا الْأَرْبَعِ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ كِلَاهُمَا عَنْ شُعْبَةَ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ شُعْبَةَ ثُمَّ اجْتَهَدَ وَلَمْ يَقُلْ وَإِنْ لَمْ يُنْزِلْ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] dan [Abu Ghassan al-Misma'i] --lewat jalur periwayatan lain-- dan telah menceritakannya kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar] mereka berkata, telah menceritakan kepada kami [Muadz bin Hisyam] dia berkata, telah menceritakan kepadaku [bapakku] dari [Qatadah] dan [Mathar] dari [al-Hasan] dari [Abu Rafi'] dari [Abu Hurairah Radhiyallahu'anhu] bahwa Nabi Shallallahu'alaihiwasallam bersabda, \"Apabila seorang lelaki duduk di antara empat cabang milik perempuan (maksudnya kedua paha dan kedua tangan), kemudian menekannya maka sungguh dia wajib mandi.\" Dan dalam hadits Mathar, \"Walaupun dia belum keluar mani.\" Zuhair berkata, \"Duduk di antara mereka dan empat cabang wanita.\" Telah menceritakan kepada kami [Muhammad bin Amr bin 'Abbad bin Jabalah] telah menceritakan kepada kami [Muhammad bin Abi 'Adi] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepadaku [Wahb bin Jarir] keduanya meriwayatkan dari [Syu'bah] dari [Qatadah] dengan isnad ini hadits semisalnya, hanya saja dalam hadits Syu'bah \"Kemudian melakukan adegan yang serius\", dan tidak mengatakan \"Walaupun tidak keluar air mani.\""
            },
            {
                "number": 514,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ عِبْدِ اللَّهِ الْأَنْصَارِيُّ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى وَهَذَا حَدِيثُهُ حَدَّثَنَا هِشَامٌ عَنْ حُمَيْدِ بْنِ هِلَالٍ قَالَ وَلَا أَعْلَمُهُ إِلَّا عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَاخْتَلَفَ فِي ذَلِكَ رَهْطٌ مِنْ الْمُهَاجِرِينَ وَالْأَنْصَارِ فَقَالَ الْأَنْصَارِيُّونَ لَا يَجِبُ الْغُسْلُ إِلَّا مِنْ الدَّفْقِ أَوْ مِنْ الْمَاءِ وَقَالَ الْمُهَاجِرُونَ بَلْ إِذَا خَالَطَ فَقَدْ وَجَبَ الْغُسْلُ قَالَ قَالَ أَبُو مُوسَى فَأَنَا أَشْفِيكُمْ مِنْ ذَلِكَ فَقُمْتُ فَاسْتَأْذَنْتُ عَلَى عَائِشَةَ فَأُذِنَ لِي فَقُلْتُ لَهَا يَا أُمَّاهْ أَوْ يَا أُمَّ الْمُؤْمِنِينَ إِنِّي أُرِيدُ أَنْ أَسْأَلَكِ عَنْ شَيْءٍ وَإِنِّي أَسْتَحْيِيكِ فَقَالَتْ لَا تَسْتَحْيِي أَنْ تَسْأَلَنِي عَمَّا كُنْتَ سَائِلًا عَنْهُ أُمَّكَ الَّتِي وَلَدَتْكَ فَإِنَّمَا أَنَا أُمُّكَ قُلْتُ فَمَا يُوجِبُ الْغُسْلَ قَالَتْ عَلَى الْخَبِيرِ سَقَطْتَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الْأَرْبَعِ وَمَسَّ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Muhammad bin Abdullah al-Anshari] telah menceritakan kepada kami [Hisyam bin Hassan] telah menceritakan kepada kami [Humaid bin Hilal] dari [Abu Burdah] dari [Abu Musa al-Asy'ari] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Abdul A'la] dan ini adalah haditsnya, Telah menceritakan kepada kami [Hisyam] dari [Humaid bin Hilal] dia berkata, \"Dan saya tidak mengetahuinya melainkan dari riwayat [Abu Burdah] dari [Abu Musa] dia berkata, \"Sejumlah Muhajirin dan Anshar berselisih dalam hal tersebut. Kaum Anshar berpendapat bahwa tidak wajib mandi kecuali disebabkan mengucurnya air mani atau keluarnya air mani. Sedangkan kaum Muhajirin berpendapat, 'Bahkan apabila seseorang telah mencampuri istrinya (sekalipun tidak keluar mani), maka dia telah wajib mandi.' Perawi berkata, \"Abu Musa berkata, 'Aku adalah yang paling sehat dari pertikaian tersebut, lalu aku berdiri untuk meminta izin [Aisyah], lalu dia memberikanku izin. Lalu aku berkata kepadanya, 'Wahai ibu atau wahai Ummul Mukminin, sesungguhnya aku berkeinginan untuk menanyakan kepadamu tentang sesuatu, dan sungguh aku malu kepadamu.' Lalu dia berkata, 'Janganlah kamu malu untuk bertanya kepadaku tentang sesuatu yang kamu dahulu pernah bertanya kepada ibumu yang melahirkanmu. aku adalah ibumu.' Aku bertanya, 'Apa yang mewajibkan mandi? ' Dia menjawab, 'Sungguh telah kau temukan manusia arif terhadap pertanyaan yang kau ajukan, Rasulullah shallallahu 'alaihi wasallam bersabda, 'Apabila seorang laki-laki duduk di antara cabang empat wanita (maksudnya kedua paha dan kedua tangan) dan bertemulah kelamin laki-laki dengan kelamin wanita maka sungguh telah wajib mandi'.\""
            },
            {
                "number": 515,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَهَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عِيَاضُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أُمِّ كُلْثُومٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْإِنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يُجَامِعُ أَهْلَهُ ثُمَّ يُكْسِلُ هَلْ عَلَيْهِمَا الْغُسْلُ وَعَائِشَةُ جَالِسَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَفْعَلُ ذَلِكَ أَنَا وَهَذِهِ ثُمَّ نَغْتَسِلُ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] dan [Harun bin Sa'id al-Aili] keduanya berkata, telah menceritakan kepada kami [Ibnu Wahab] telah mengabarkan kepada kami ['Iyadh bin Abdullah] dari [Abu az-Zubair] dari [Jabir bin Abdullah] dari [Ummu Kultsum] dari [Aisyah, istri Nabi Shallallahu'alaihiwasallam] dia berkata, \" seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang seorang laki-laki yang menyenggamai istrinya kemudian dia tidak keluar air mani, apakah keduanya wajib mandi, sedangkan Aisyah sedang duduk di samping, maka Rasulullah shallallahu 'alaihi wasallam bersabda, \" Aku sendiri melakukan hal tersebut dengan wanita ini, kemudian kami mandi.\""
            },
            {
                "number": 516,
                "arab": "و حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ قَالَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّ خَارِجَةَ بْنَ زَيْدٍ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّ أَبَاهُ زَيْدَ بْنَ ثَابِتٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْوُضُوءُ مِمَّا مَسَّتْ النَّارُ",
                "id": "Dan telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin al-Laits] dia berkata, telah menceritakan kepada kami [bapakku] dari [kakekku] telah menceritakan kepada kami [Uqail bin Khalid] dia berkata, telah berkata [Ibnu Syihab] telah mengabarkan kepadaku [Abdul Malik bin Abi Bakar bin Abdurrahman bin al-Harits bin Hisyam] bahwa [Kharijah bin Zaid al-Anshari] telah mengabarkan kepadanya bahwa [bapaknya, Zaid bin Tsabit] dia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, 'Wudhu (diwajibkan) karena (memakan daging) yang dibakar api'.\""
            },
            {
                "number": 517,
                "arab": "قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُمَرُ بْنُ عَبْدِ الْعَزِيزِ أَنَّ عَبْدَ اللَّهِ بْنَ إِبْرَاهِيمَ بْنِ قَارِظٍ أَخْبَرَهُأَنَّهُ وَجَدَ أَبَا هُرَيْرَةَ يَتَوَضَّأُ عَلَى الْمَسْجِدِ فَقَالَ إِنَّمَا أَتَوَضَّأُ مِنْ أَثْوَارِ أَقِطٍ أَكَلْتُهَا لِأَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya), [Ibnu Syihab] berkata, telah mengabarkan kepadaku [Umar bin Abdul Aziz] bahwa [Abdullah bin Ibrahim bin Qarizh] telah mengabarkan kepadanya bahwa dia mendapatkan [Abu Hurairah] berwudhu di masjid, maka dia berkata, \"Aku hanya berwudhu karena aku makan sepotong keju karena aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, 'Berwudhulah kalian, disebabkan makan (daging) yang dibakar'.\""
            },
            {
                "number": 518,
                "arab": "قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ خَالِدِ بْنِ عَمْرِو بْنِ عُثْمَانَ وَأَنَا أُحَدِّثُهُ هَذَا الْحَدِيثَ أَنَّهُ سَأَلَ عُرْوَةَ بْنَ الزُّبَيْرِ عَنْ الْوُضُوءِ مِمَّا مَسَّتْ النَّارُ فَقَالَ عُرْوَةُ سَمِعْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya) [Ibnu Syihab] berkata, telah mengabarkan kepadaku [Sa'id bin Khalid bin Amru bin Utsman], dan saya menceritakan kepadanya hadits ini bahwa dia berkata kepada [Urwah bin Az Zubair] tentang wudhu dikarenakan (memakan daging) yang dibakar, maka Urwah berkata, Aku mendengar [Aisyah], istri Nabi shallallahu 'alaihi wasallam berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, 'Berwudhulah kalian, disebabkan makan (daging) yang dibakar'.\""
            },
            {
                "number": 519,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ كَتِفَ شَاةٍ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Malik] dari [Zaid bin Aslam] dari ['Atha' bin Yasar] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam makan pundak kambing, kemudian melakukan sholat, dan beliau tidak berwudhu."
            },
            {
                "number": 520,
                "arab": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ أَخْبَرَنِي وَهْبُ بْنُ كَيْسَانَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ ح و حَدَّثَنِي الزُّهْرِيُّ عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ عَلِيٍّ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ عَرْقًا أَوْ لَحْمًا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ وَلَمْ يَمَسَّ مَاءً",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam bin Urwah] telah mengabarkan kepadaku [Wahab bin Kaisan] dari [Muhammad bin Amru bin 'Atha'] dari [Ibnu Abbas] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [az-Zuhri] dari [Ali bin Abdullah bin Abbas] dari [Ibnu Abbas] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Muhammad bin Ali] dari [bapaknya] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam makan pangkal atau daging, kemudian beliau sholat, dan tanpa berwudhu, dan beliau juga tidak menyentuh air."
            },
            {
                "number": 521,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ حَدَّثَنَا الزُّهْرِيُّ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَزُّ مِنْ كَتِفٍ يَأْكُلُ مِنْهَا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin ash-Shabbah] telah menceritakan kepada kami [Ibrahim bin Sa'd] telah menceritakan kepada kami [az-Zuhri] dari [Ja'far bin Amru bin Umayyah adh-Dhamri] dari [bapaknya] bahwa dia melihat Rasulullah shallallahu 'alaihi wasallam memotong sebagian pundak (kambing) untuk memakannya, kemudian sholat, dan tanpa berwudhu."
            },
            {
                "number": 522,
                "arab": "حَدَّثَنِي أَحْمَدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فَأَكَلَ مِنْهَا فَدُعِيَ إِلَى الصَّلَاةِ فَقَامَ وَطَرَحَ السِّكِّينَ وَصَلَّى وَلَمْ يَتَوَضَّأْقَالَ ابْنُ شِهَابٍ وَحَدَّثَنِي عَلِيُّ بْنُ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Isa] telah menceritakan kepada kami [Ibnu Wahab] telah mengabarkan kepadaku [Amru bin al-Harits] dari [Ibnu Syihab] dari [Ja'far bin Amru bin Umayyah adh-Dhamri] dari [bapaknya] dia berkata, \"Saya melihat Rasulullah shallallahu 'alaihi wasallam memotong sebagian pundak kambing, lalu beliau makan sebagiannya, lalu sholat diserukan, maka beliau berdiri dan membuang pisau, dan sholat tanpa berwudhu. [Ibnu Syihab] berkata, dan telah menceritakan kepadaku [Ali bin Abdullah bin Abbas] dari [bapaknya] dari Rasulullah shallallahu 'alaihi wasallam dengan hal tersebut."
            },
            {
                "number": 523,
                "arab": "قَالَ عَمْرٌو وَحَدَّثَنِي بُكَيْرُ بْنُ الْأَشَجِّ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ عِنْدَهَا كَتِفًا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْقَالَ عَمْرٌو حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ عَنْ يَعْقُوبَ بْنِ الْأَشَجِّ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ",
                "id": "Berkata [Amru] dan telah menceritakan kepada kami [Bukair bin Al Asyajj] dari [Kuraib, maula Ibnu Abbas] dari [Maimunah, istri Nabi Shallallahu'alaihiwasallam] bahwa Nabi shallallahu 'alaihi wasallam makan pundak (kambing) di sisinya, kemudian sholat tanpa berwudhu lagi. Berkata [Amru] telah menceritakan kepada kami [Ja'far bin Rabi'ah] dari [Ya'kub bin Al Asyajj] dari [Kuraib, maula Ibnu Abbas] dari [Maimunah, istri Nabi] dengan hal tersebut."
            },
            {
                "number": 524,
                "arab": "قَالَ عَمْرٌو وَحَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِي غَطَفَانَ عَنْ أَبِي رَافِعٍ قَالَأَشْهَدُ لَكُنْتُ أَشْوِي لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَطْنَ الشَّاةِ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Berkata [Amru] dan telah menceritakan kepada kami [Sa'id bin Abi Hilal] dari [Abdullah bin Ubaidillah bin Abi Rafi'] dari [Abu Ghathafan] dari [Abu Rafi'] dia berkata, \"Saya bersaksi aku pernah membakar perut kambing untuk Rasulullah Shallallahu'alaihiwasallam, kemudian beliau sholat tanpa berwudhu lagi.\""
            },
            {
                "number": 525,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا ثُمَّ دَعَا بِمَاءٍ فَتَمَضْمَضَ وَقَالَ إِنَّ لَهُ دَسَمًاو حَدَّثَنِي أَحْمَدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ وَهْبٍ وَأَخْبَرَنِي عَمْرٌو ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ الْأَوْزَاعِيِّ ح و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي يُونُسُ كُلُّهُمْ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِ عُقَيْلٍ عَنْ الزُّهْرِيِّ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Uqail] dari [az-Zuhri] dari [ubaidhullah bin Abdullah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam minum susu, kemudian meminta air, lalu berkumur-kumur, seraya bersabda, \" ia memiliki lemak.\" Dan telah menceritakan kepada kami [Ahmad bin Isa] telah menceritakan kepada kami [Ibnu Wahab] dan telah mengabarkan kepada kami [Amru] --lewat jalur periwayatan lain--, dan telah mengabarkan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Yahya bin Sa'id] dari [al-Auza'i] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Harmalah bin Yahya] dan telah mengabarkan kepadaku [Ibnu Wahab] telah menceritakan kepada kami [Yunus] semuanya dari [Ibnu Syihab] dengan sanad Uqail dari az-Zuhari semisalnya."
            },
            {
                "number": 526,
                "arab": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ عَلَيْهِ ثِيَابَهُ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ فَأُتِيَ بِهَدِيَّةٍ خُبْزٍ وَلَحْمٍ فَأَكَلَ ثَلَاثَ لُقَمٍ ثُمَّ صَلَّى بِالنَّاسِ وَمَا مَسَّ مَاءًو حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ قَالَ كُنْتُ مَعَ ابْنِ عَبَّاسٍ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ ابْنِ حَلْحَلَةَ وَفِيهِ أَنَّ ابْنَ عَبَّاسٍ شَهِدَ ذَلِكَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ صَلَّى وَلَمْ يَقُلْ بِالنَّاسِ",
                "id": "Dan telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Ismail bin Ja'far] telah menceritakan kepada kami [Muhammad bin Amru bin Halhalah] dari [Muhammad bin Amru bin Atha'] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam mengumpulkan pakaiannya kemudian pergi menuju sholat, lalu beliau dibawakan hadiah roti dan daging, maka beliau memakannya tiga suap, kemudian sholat mengimami manusia, dan beliau tidak menyentuh air. Dan telah menceritakan kepada kami tentangnya [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] dari [al-Walid bin Katsir] telah menceritakan kepada kami [Muhammad bin Amru bin 'Atha'] dia berkata, \"Saya bersama [Ibnu Abbas] \", lalu dia membawakan hadits tersebut dengan makna hadits Ibnu Halhalah, dan di dalamnya disebutkan bahwa Ibnu Abbas menyaksikan hal tersebut dari Nabi Shallallahu'alaihiwasallam, seraya dia berkata, \"Beliau sholat dan tidak berbicara dengan manusia.\""
            },
            {
                "number": 527,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ عَنْ جَابِرِ بْنِ سَمُرَةَأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَأَتَوَضَّأُ مِنْ لُحُومِ الْغَنَمِ قَالَ إِنْ شِئْتَ فَتَوَضَّأْ وَإِنْ شِئْتَ فَلَا تَوَضَّأْ قَالَ أَتَوَضَّأُ مِنْ لُحُومِ الْإِبِلِ قَالَ نَعَمْ فَتَوَضَّأْ مِنْ لُحُومِ الْإِبِلِ قَالَ أُصَلِّي فِي مَرَابِضِ الْغَنَمِ قَالَ نَعَمْ قَالَ أُصَلِّي فِي مَبَارِكِ الْإِبِلِ قَالَ لَاحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا زَائِدَةُ عَنْ سِمَاكٍ ح و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ وَأَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ كُلُّهُمْ عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي كَامِلٍ عَنْ أَبِي عَوَانَةَ",
                "id": "Telah menceritakan kepada kami [Abu Kamil Fudhail bin Husain al-Jahdari] telah menceritakan kepada kami [Abu 'Awanah] dari [Utsman bin Abdullah bin Mauhab] dari [Ja'far bin Abi Tsaur] dari [Jabir bin Samurah] bahwa seorang laki-laki bertanya kepada Rasulullah Shallallahu'alaihiwasallam, \"Apakah kami harus berwudhu karena makan daging kambing?\" Beliau menjawab, \"Jika kamu berkehendak maka berwudhulah, dan jika kamu tidak berkehendak maka janganlah kamu berwudhu.\" Dia bertanya lagi, \"Apakah harus berwudhu disebabkan (makan) daging unta?\" Beliau menjawab, \"Ya. Berwudhulah disebabkan (makan) daging unta.\" Dia bertanya, \"Apakah aku boleh sholat di kandang kambing?\" Beliau menjawab, \"Ya boleh.\" Dia bertanya, \"Apakah aku boleh sholat di kandang unta?\" Beliau menjawab, \"Tidak.\" Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Muawiyah bin Amr] dan telah menceritakan kepada kami [Zaidah] dari [Simak] --lewat jalur periwayatan lain-- dan telah menceritakan kepadaku [al-Qasim bin Zakariya'] telah menceritakan kepada kami [ubaidhullah bin Musa] dari [Syaiban] dari [Utsman bin Abdullah bin Mauhab] dan [Asy'ats bin Abi asy-Sya'tsa'] mereka semuanya meriwayatkan dari [Ja'far bin Abi Tsaur] dari [Jabir bin Samurah] dari Nabi shallallahu 'alaihi wasallam semisal hadits Abu Kamil dari Abu 'Awanah."
            },
            {
                "number": 528,
                "arab": "و حَدَّثَنِي عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ وَعَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِشُكِيَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلُ يُخَيَّلُ إِلَيْهِ أَنَّهُ يَجِدُ الشَّيْءَ فِي الصَّلَاةِ قَالَ لَا يَنْصَرِفُ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًاقَالَ أَبُو بَكْرٍ وَزُهَيْرُ بْنُ حَرْبٍ فِي رِوَايَتِهِمَا هُوَ عَبْدُ اللَّهِ بْنُ زَيْدٍ",
                "id": "Dan telah menceritakan kepadaku [Amru an-Naqid] dan [Zuhair bin Harb] (tahwilSanad) dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] semuanya meriwayatkan dari [Ibnu Uyainah] berkata [Amru], telah menceritakan kepada kami [Sufyan bin Uyainah] dari [az-Zuhri] dari [Sa'id] dan ['Abbad bin Tamim] dari [pamannya] Seorang lelaki mengadukan kepada Nabi Shallallahu'alaihiwasallam. bahwa dia seolah-olah mendapati sesuatu (kentut) ketika sholatnya. Beliau bersabda, \"Dia tidak perlu membatalkan sholatnya sehingga dia mendengar suara atau mencium bau.\" [Abu Bakar] dan [Zuhair bin Harb] berkata dalam riwayat keduanya, \"Dia adalah Abdullah bin Zaid.\""
            },
            {
                "number": 529,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَجَدَ أَحَدُكُمْ فِي بَطْنِهِ شَيْئًا فَأَشْكَلَ عَلَيْهِ أَخَرَجَ مِنْهُ شَيْءٌ أَمْ لَا فَلَا يَخْرُجَنَّ مِنْ الْمَسْجِدِ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, \"Apabila salah seorang dari kalian mendapatkan sesuatu yang kurang beres dalam perutnya, lalu rancu baginya perkara tersebut, apakah keluar atau tidak, maka janganlah dia keluar dari masjid hingga dia mendengar suara (kentut) atau mendapatkan baunya.\""
            },
            {
                "number": 530,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَتُصُدِّقَ عَلَى مَوْلَاةٍ لِمَيْمُونَةَ بِشَاةٍ فَمَاتَتْ فَمَرَّ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَلَّا أَخَذْتُمْ إِهَابَهَا فَدَبَغْتُمُوهُ فَانْتَفَعْتُمْ بِهِ فَقَالُوا إِنَّهَا مَيْتَةٌ فَقَالَ إِنَّمَا حَرُمَ أَكْلُهَاقَالَ أَبُو بَكْرٍ وَابْنُ أَبِي عُمَرَ فِي حَدِيثِهِمَا عَنْ مَيْمُونَةَ رَضِيَ اللَّهُ عَنْهَا",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya], [Abu Bakar bin Abi Syaibah], [Amru an-Naqid] dan [Ibnu Abi Umar] semuanya meriwayatkan dari [Ibnu Uyainah] [Yahya] berkata, telah mengabarkan kepada kami [Sufyan bin Uyainah] dari [az-Zuhri] dari [ubaidhullah bin Abdullah] dari [Ibnu Abbas], \"Hamba milik Maimunah radhiyallahu'anha pernah diberi sedekah seekor kambing, kemudian kambing tersebut mati. (Tidak berapa lama kemudian) Rasulullah Shallallahu'alaihiwasallam melalui tempat tersebut dan bersabda, \"Mengapa kamu tidak mengambil kulit bangkai tersebut dan menyamaknya agar kamu bisa memanfaatkannya?\" Mereka berkata, \"Ia sudah menjadi bangkai.\" Beliau bersabda, \" yang diharamkan hanyalah memakannya.\" [Abu Bakar] dan [Ibnu Abi Umar] berkata dalam hadits keduanya dari [Maimunah radhiyallahu'anha]."
            },
            {
                "number": 531,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَدَ شَاةً مَيْتَةً أُعْطِيَتْهَا مَوْلَاةٌ لِمَيْمُونَةَ مِنْ الصَّدَقَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلَّا انْتَفَعْتُمْ بِجِلْدِهَا قَالُوا إِنَّهَا مَيْتَةٌ فَقَالَ إِنَّمَا حَرُمَ أَكْلُهَاحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ بِنَحْوِ رِوَايَةِ يُونُسَ",
                "id": "Dan telah menceritakan kepadaku [Abu ath-Thahir] dan [Harmalah] keduanya berkata, telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah bin Utbah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam mendapati kambing mati yang telah diberikan sebagai sedekah kepada maula Maimunah, maka Rasulullah shallallahu 'alaihi wasallam bersabda, \"Mengapa kalian tidak memanfaatkannya dengan menyamaknya?\" Mereka berkata, \"Ia sudah menjadi bangkai.\" Maka beliau bersabda, \"Yang diharamkan hanyalah memakannya.\" Telah menceritakan kepada kami [Hasan al-Hulwani] dan ['Abd bin Humaid] semuanya meriwayatkan dari [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepadaku [bapakku] dari [Shalih] dari [Ibnu Syihab] dengan isnad ini dengan riwayat semisal Yunus."
            },
            {
                "number": 532,
                "arab": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَعَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِشَاةٍ مَطْرُوحَةٍ أُعْطِيَتْهَا مَوْلَاةٌ لِمَيْمُونَةَ مِنْ الصَّدَقَةِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَّا أَخَذُوا إِهَابَهَا فَدَبَغُوهُ فَانْتَفَعُوا بِهِ",
                "id": "Dan telah menceritakan kepada kami [Ibnu Abi Umar] dan [Abdullah bin Muhammad az-Zuhri] dan lafazh tersebut milik Ibnu Abi Umar. Keduanya berkata, telah menceritakan kepada kami [Sufyan] dari [Amru] dari ['Atha'] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam melewati kambing yang dibuang yang telah diberikan kepada budak Maimunah sebagai sedekah. Maka Nabi shallallahu 'alaihi wasallam bersabda, \"Mengapa kalian tidak mengambil kulitnya, lalu menyamaknya, sehingga kalian bisa memanfaatkannya.\""
            },
            {
                "number": 533,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَخْبَرَنِي عَطَاءٌ مُنْذُ حِينٍ قَالَ أَخْبَرَنِي ابْنُ عَبَّاسٍ أَنَّ مَيْمُونَةَ أَخْبَرَتْهُأَنَّ دَاجِنَةً كَانَتْ لِبَعْضِ نِسَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَاتَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَّا أَخَذْتُمْ إِهَابَهَا فَاسْتَمْتَعْتُمْ بِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Utsman an-Naufali] telah menceritakan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Amru bin Dinar] telah mengabarkan kepadaku ['Atha'] sejak dahulu, dia berkata, telah mengabarkan kepadaku [Ibnu Abbas] bahwa [Maimunah] telah mengabarkan kepadanya bahwa hewan ternak milik sebagian istri Rasulullah shallallahu 'alaihi wasallam meninggal, maka Rasulullah shallallahu 'alaihi wasallam bersabda, \"Mengapa kalian tidak mengambil kulitnya, lalu kalian mengambil manfaatnya.\""
            },
            {
                "number": 534,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِشَاةٍ لِمَوْلَاةٍ لِمَيْمُونَةَ فَقَالَ أَلَّا انْتَفَعْتُمْ بِإِهَابِهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Abdul Malik bin Abi Sulaiman] dari [Atha'] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam melewati kambing milik mauliyat Maimunah, maka beliau bersabda, \"Mengapa kamu tidak memanfaatkan kulitnya?.\" "
            },
            {
                "number": 535,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ زَيْدِ بْنِ أَسْلَمَ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ وَعْلَةَ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا دُبِغَ الْإِهَابُ فَقَدْ طَهُرَو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالَا حَدَّثَنَا ابْنُ عُيَيْنَةَ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ وَكِيعٍ عَنْ سُفْيَانَ كُلُّهُمْ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ يَعْنِي حَدِيثَ يَحْيَى بْنِ يَحْيَى",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Sulaiman bin Bilal] dari [Zaid bin Aslam] bahwa [Abdurrahman bin Wa'lah] telah mengabarkan kepadanya dari [Abdullah bin Abbas] dia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, \"Apabila kulit telah disamak, maka sungguh ia telah suci.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Amru an-Naqid] keduanya berkata, telah menceritakan kepada kami [Ibnu Uyainah] -lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz, yaitu Ibnu Muhammad] --lewat jalur periwayatan lain-- dan Telah menceritakan kepada kami [Abu Kuraib] dan [Ishaq bin Ibrahim] semuanya meriwayatkan dari [Waki'] dar [Sufyan] semuanya meriwayatkan dari [Zaid bin Aslam] dari [Abdurrahman bin Wa'lah] dari [Ibnu Abbas] dari Nabi Shallallahu'alaihiwasallam dengan semisalnya, yaitu hadits Yahya bin Yahya."
            },
            {
                "number": 536,
                "arab": "حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ وَأَبُو بَكْرِ بْنُ إِسْحَقَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَقَالَ ابْنُ مَنْصُورٍ أَخْبَرَنَا عَمْرُو بْنُ الرَّبِيعِ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ أَنَّ أَبَا الْخَيْرِ حَدَّثَهُ قَالَ رَأَيْتُ عَلَى ابْنِ وَعْلَةَ السَّبَإِيِّ فَرْوًا فَمَسِسْتُهُ فَقَالَ مَا لَكَ تَمَسُّهُ قَدْ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قُلْتُإِنَّا نَكُونُ بِالْمَغْرِبِ وَمَعَنَا الْبَرْبَرُ وَالْمَجُوسُ نُؤْتَى بِالْكَبْشِ قَدْ ذَبَحُوهُ وَنَحْنُ لَا نَأْكُلُ ذَبَائِحَهُمْ وَيَأْتُونَا بِالسِّقَاءِ يَجْعَلُونَ فِيهِ الْوَدَكَ فَقَالَ ابْنُ عَبَّاسٍ قَدْ سَأَلْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ دِبَاغُهُ طَهُورُهُ",
                "id": "Telah menceritakan kepadaku [Ishaq bin Manshur] dan [Abu Bakar bin Ishaq] Abu Bakar berkata, telah menceritakan kepada kami, sedangkan Ibnu Manshur berkata, telah mengabarkan kepada kami [Amru bin ar-Rabi'] telah mengabarkan kepada kami [Yahya Bin Ayyub] dari [Yazid bin Abi Habib] bahwa [Abu al-Khair] telah menceritakan kepadannya, dia berkata, \"Aku melihat baju kulit [Ibnu Wa'lah as-Saba'i], lalu aku memegangnya. Maka dia bertanya, 'Mengapa kamu memegangnya? Aku telah bertanya kepada [Abdullah bin Abbas]. Aku berkata, 'Aku berada di Maroko, dan kami bersama kaum Barbar dan Majusi, ketika itu dibawakan domba yang telah mereka sembelih, sedangkan kami tidak memakan sembelihan mereka. Dan mereka telah mendatangi kami dengan membawa geriba yang mereka gunakan untuk menyimpan lemak.\" Maka Ibnu Abbas berkata, \"Kami telah menanyakan Rasulullah shallallahu 'alaihi wasallam tentang hal tersebut, maka beliau menjawab, 'Menyamaknya adalah cara menyucikannya'.\""
            },
            {
                "number": 537,
                "arab": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ وَأَبُو بَكْرِ بْنُ إِسْحَقَ عَنْ عَمْرِو بْنِ الرَّبِيعِ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ أَبِي الْخَيْرِ حَدَّثَهُ قَالَ حَدَّثَنِي ابْنُ وَعْلَةَ السَّبَإِيُّ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قُلْتُإِنَّا نَكُونُ بِالْمَغْرِبِ فَيَأْتِينَا الْمَجُوسُ بِالْأَسْقِيَةِ فِيهَا الْمَاءُ وَالْوَدَكُ فَقَالَ اشْرَبْ فَقُلْتُ أَرَأْيٌ تَرَاهُ فَقَالَ ابْنُ عَبَّاسٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ دِبَاغُهُ طَهُورُهُ",
                "id": "Dan telah menceritakan kepadaku [Ishaq bin Manshur] dan [Abu Bakar bin Ishaq] dari [Amru bin ar-Rabi'] telah mengabarkan kepada kami [Yahya bin Ayyub] dari [Ja'far bin Rabi'ah] dari [Abu al-Khair] dia telah menceritakan kepadanya, dia berkata, telah menceritakan kepadaku [Ibnu Wa'lah as-Saba'i] dia berkata, \"Saya bertanya kepada [Abdullah bin Abbas], Saya berkata, 'Kami berada di Maroko, lalu orang Majusi mendatangi kami dengan geriba yang mana di dalamnya terdapat air dan lemak, maka dia berkata, 'Minumlah! ' Maka aku bertanya, 'Apakah yang kamu ucapkan adalah suatu pendapat saja? ' Lalu Ibnu Abbas menjawab, 'Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, 'Menyamaknya adalah (cara) mensucikannya'.\""
            },
            {
                "number": 538,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ أَوْ بِذَاتِ الْجَيْشِ انْقَطَعَ عِقْدٌ لِي فَأَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْتِمَاسِهِ وَأَقَامَ النَّاسُ مَعَهُ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ فَقَالُوا أَلَا تَرَى إِلَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِالنَّاسِ مَعَهُ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسَ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ قَالَتْ فَعَاتَبَنِي أَبُو بَكْرٍ وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ وَجَعَلَ يَطْعُنُ بِيَدِهِ فِي خَاصِرَتِي فَلَا يَمْنَعُنِي مِنْ التَّحَرُّكِ إِلَّا مَكَانُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى فَخِذِي فَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ فَتَيَمَّمُوا فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ وَهُوَ أَحَدُ النُّقَبَاءِ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ فَقَالَتْ عَائِشَةُ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَوَجَدْنَا الْعِقْدَ تَحْتَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata, \"Saya membaca di hadapan [Malik] dari [Abdurrahman bin al-Qasim] dari [bapaknya] dari [Aisyah radhiyallahu'anha] bahwa dia berkata, \"Kami pernah keluar bersama-sama Rasulullah Shallallahu'alaihiwasallam dalam sebagian perjalanan beliau. Hingga ketika kami tiba di al-Baida' atau di Zatul Jaisy, kalung leherku terputus dan Rasulullah Shallallahu'alaihiwasallam pun mulai mencarinya. Orang-orang juga turut mencarinya bersama Rasulullah Shallallahu'alaihiwasallam sedangkan mereka tidak di tempat yang ada airnya dan mereka tidak mempunyai air sedikit pun. Kemudian orang-orang datang menemui Abu Bakar lalu berkata, 'Tidakkah kamu melihat sesuatu yang telah dilakukan oleh Aisyah? ' Dia telah menyebabkan Rasulullah Shallallahu'alaihiwasallam, dan orang-orang mencari kalung lehernya sedangkan mereka tidak di tempat yang ada airnya dan mereka juga tidak mempunyai air sedikit pun? Kemudian Abu Bakar mendatangiku dan ketika itu Rasulullah Shallallahu'alaihiwasallam. sedang tidur dengan meletakkan kepala beliau di atas pahaku. Dia berkata, 'Kamu telah menahan Rasulullah Shallallahu'alaihiwasallam dan orang-orang, sedangkan mereka semuanya tidak berada di tempat yang ada airnya dan mereka juga tidak mempunyai air sedikit pun'. Aisyah berkata, 'Abu bakar mencelaku dengan kata-kata \"Maa-syaa-Allaah\" hingga dia memencet pangkal pahaku dengan tangannya. Aku tidak dapat bergerak karena Rasulullah Shallallahu'alaihiwasallam berada di atas pahaku. Rasulullah Shallallahu'alaihiwasallam tidur hingga keesokan harinya bangun tanpa ada air sedikit pun. Kemudian Allah menurunkan ayat tayamum. Mereka pun bertayamum. Sehubungan dengan itu, Usaid bin al-Hudhair, salah seorang pemimpin berkata, \"Ini bukanlah keberkatan yang pertama kali bagi kamu, wahai keluarga Abu Bakar! Lalu Aisyah pun berkata, \"Kemudian kami mencari unta yang aku naiki maka kami menemui kalung itu di bawahnya\"."
            },
            {
                "number": 539,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ وَابْنُ بِشْرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلَادَةً فَهَلَكَتْ فَأَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاسًا مِنْ أَصْحَابِهِ فِي طَلَبِهَا فَأَدْرَكَتْهُمْ الصَّلَاةُ فَصَلَّوْا بِغَيْرِ وُضُوءٍ فَلَمَّا أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَكَوْا ذَلِكَ إِلَيْهِ فَنَزَلَتْ آيَةُ التَّيَمُّمِ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ جَزَاكِ اللَّهُ خَيْرًا فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ إِلَّا جَعَلَ اللَّهُ لَكِ مِنْهُ مَخْرَجًا وَجَعَلَ لِلْمُسْلِمِينَ فِيهِ بَرَكَةً",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abu Usamah] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] dan [Ibnu Bisyr] dari [Hisyam] dari [bapaknya] dari [Aisyah] bahwa dia meminjam kalung dari Asma', lalu kalung itu hilang. Maka Rasulullah shallallahu 'alaihi wasallam mengutus orang dari kalangan sahabatnya untuk mencarinya. Lalu tiba waktu sholat, maka mereka sholat tanpa berwudhu. Ketika mereka mendatangi Nabi Shallallahu'alaihiwasallam, maka mereka mengadukan hal tersebut kepada beliau, maka turunlah ayat tayammum. Lalu Usaid bin Hudhair berkata, \"Semoga Allah memberikan pahala kepadamu. Demi Allah, tidaklah suatu perkara turun padamu melainkan Allah menjadikan jalan keluar untukmu, dan menjadikan keberkahan bagi kaum mukminin di dalamnya.\""
            },
            {
                "number": 540,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ قَالَ كُنْتُ جَالِسًا مَعَ عَبْدِ اللَّهِ وَأَبِي مُوسَى فَقَالَ أَبُو مُوسَىيَا أَبَا عَبْدِ الرَّحْمَنِ أَرَأَيْتَ لَوْ أَنَّ رَجُلًا أَجْنَبَ فَلَمْ يَجِدْ الْمَاءَ شَهْرًا كَيْفَ يَصْنَعُ بِالصَّلَاةِ فَقَالَ عَبْدُ اللَّهِ لَا يَتَيَمَّمُ وَإِنْ لَمْ يَجِدْ الْمَاءَ شَهْرًا فَقَالَ أَبُو مُوسَى فَكَيْفَ بِهَذِهِ الْآيَةِ فِي سُورَةِ الْمَائِدَةِ{ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا }فَقَالَ عَبْدُ اللَّهِ لَوْ رُخِّصَ لَهُمْ فِي هَذِهِ الْآيَةِ لَأَوْشَكَ إِذَا بَرَدَ عَلَيْهِمْ الْمَاءُ أَنْ يَتَيَمَّمُوا بِالصَّعِيدِ فَقَالَ أَبُو مُوسَى لِعَبْدِ اللَّهِ أَلَمْ تَسْمَعْ قَوْلَ عَمَّارٍ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَاجَةٍ فَأَجْنَبْتُ فَلَمْ أَجِدْ الْمَاءَ فَتَمَرَّغْتُ فِي الصَّعِيدِ كَمَا تَمَرَّغُ الدَّابَّةُ ثُمَّ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَقُولَ بِيَدَيْكَ هَكَذَا ثُمَّ ضَرَبَ بِيَدَيْهِ الْأَرْضَ ضَرْبَةً وَاحِدَةً ثُمَّ مَسَحَ الشِّمَالَ عَلَى الْيَمِينِ وَظَاهِرَ كَفَّيْهِ وَوَجْهَهُفَقَالَ عَبْدُ اللَّهِ أَوَلَمْ تَرَ عُمَرَ لَمْ يَقْنَعْ بِقَوْلِ عَمَّارٍ و حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ قَالَ قَالَ أَبُو مُوسَى لِعَبْدِ اللَّهِ وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ أَبِي مُعَاوِيَةَ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَقُولَ هَكَذَا وَضَرَبَ بِيَدَيْهِ إِلَى الْأَرْضِ فَنَفَضَ يَدَيْهِ فَمَسَحَ وَجْهَهُ وَكَفَّيْهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya], [Abu Bakar bin Abi Syaibah] dan [Ibnu Numair] semuanya meriwayatkan dari [Abu Muawiyah] [Abu Bakar] berkata, telah menceritakan kepada kami [Abu Muawiyah] dari [al-A'masy] dari [Syaqiq] dia berkata, dia berkata, \"Aku duduk bersama Abdullah dan Abu Musa al-Asy'ari. Kemudian [Abu Musa] berkata kepada [Abdullah], 'Wahai ayah Abdurrahman, seandainya seorang lelaki berjunub lalu dia tidak mendapatkan air selama sebulan, bagaimanakah yang harus dia lakukan dengan sholatnya? ' Maka Abdullah berkata, 'Dia tidak boleh bertayamum, sekalipun dia tidak mendapati air selama sebulan'. Abu Musa berkata, 'Bagaimana dengan ayat di dalam surah al-Maidah, \"Lalu kamu tidak mendapat air (untuk berwudhu dan mandi) maka hendaklah kamu bertayamum dengan tanah yang suci.\" (QS. Almaidah; 6), Abdullah berkata, 'Andai mereka diberi keringanan dengan ayat tersebut, niscaya apabila mereka merasakan air itu dingin maka mereka akan bertayamum dengan tanah.' Maka Abu Musa berkata kepada Abdullah, 'Tidakkah kamu telah mendengar kata-kata Ammar, 'Rasulullah Shallallahu'alaihiwasallam telah mengutusku untuk suatu keperluan kemudian aku berjunub, lalu aku tidak mendapati air, maka aku menggulingkan badan ke tanah sebagaimana binatang melata menggulingkan badannya?. Kemudian kutemui Nabi Shallallahu'alaihiwasallam dan kuceritakan perkara tersebut kepada beliau Shallallahu'alaihiwasallam. Maka Beliau bersabda, 'Sudah cukup memadai bagi kamu dengan kamu menepukkan tangan kamu begini, kemudian beliau menepukkan tangan beliau ke tanah dengan satu tepukan, kemudian beliau menyapu tangan kiri beliau pada tangan kanan dan belakang kedua tapak tangan serta wajah beliau.\" Abdullah berkata, \"Apakah kamu tidak melihat bahwa Umar tidak puas dengan perkataan [Ammar]?.\" Dan telah menceritakan kepada kami [Abu Kamil al-Jahdari] telah menceritakan kepada kami [Abdu Wahid] telah menceritakan kepada kami [al-A'masy] dari [Syaqiq] dia berkata, [Abu Musa] berkata kepada Abdullah, dan ia menggiring hadits tersebut dengan kisahnya semisal hadits Abu Mu'awiyah, hanya saja dia berkata, \"Maka Rasulullah shallallahu 'alaihi wasallam bersabda, 'Cukup memadai bagi kamu untuk mengatakan demikian, lalu beliau memukulkan kedua tangannya pada tanah, lalu mengibaskan kedua tangannya, lalu dia mengusap wajah dan kedua telapak tangannya'.\""
            },
            {
                "number": 541,
                "arab": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمٍ الْعَبْدِيُّ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ الْقَطَّانَ عَنْ شُعْبَةَ قَالَ حَدَّثَنِي الْحَكَمُ عَنْ ذَرٍّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِأَنَّ رَجُلًا أَتَى عُمَرَ فَقَالَ إِنِّي أَجْنَبْتُ فَلَمْ أَجِدْ مَاءً فَقَالَ لَا تُصَلِّ فَقَالَ عَمَّارٌ أَمَا تَذْكُرُ يَا أَمِيرَ الْمُؤْمِنِينَ إِذْ أَنَا وَأَنْتَ فِي سَرِيَّةٍ فَأَجْنَبْنَا فَلَمْ نَجِدْ مَاءً فَأَمَّا أَنْتَ فَلَمْ تُصَلِّ وَأَمَّا أَنَا فَتَمَعَّكْتُ فِي التُّرَابِ وَصَلَّيْتُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَضْرِبَ بِيَدَيْكَ الْأَرْضَ ثُمَّ تَنْفُخَ ثُمَّ تَمْسَحَ بِهِمَا وَجْهَكَ وَكَفَّيْكَ فَقَالَ عُمَرُ اتَّقِ اللَّهَ يَا عَمَّارُ قَالَ إِنْ شِئْتَ لَمْ أُحَدِّثْ بِهِقَالَ الْحَكَمُ وَحَدَّثَنِيهِ ابْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ مِثْلَ حَدِيثِ ذَرٍّ قَالَ وَحَدَّثَنِي سَلَمَةُ عَنْ ذَرٍّ فِي هَذَا الْإِسْنَادِ الَّذِي ذَكَرَ الْحَكَمُ فَقَالَ عُمَرُ نُوَلِّيكَ مَا تَوَلَّيْتَ و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ أَخْبَرَنَا شُعْبَةُ عَنْ الْحَكَمِ قَالَ سَمِعْتُ ذَرًّا عَنْ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى قَالَ قَالَ الْحَكَمُ وَقَدْ سَمِعْتَهُ مِنْ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ أَنَّ رَجُلًا أَتَى عُمَرَ فَقَالَ إِنِّي أَجْنَبْتُ فَلَمْ أَجِدْ مَاءً وَسَاقَ الْحَدِيثَ وَزَادَ فِيهِ قَالَ عَمَّارٌ يَا أَمِيرَ الْمُؤْمِنِينَ إِنْ شِئْتَ لِمَا جَعَلَ اللَّهُ عَلَيَّ مِنْ حَقِّكَ لَا أُحَدِّثُ بِهِ أَحَدًا وَلَمْ يَذْكُرْ حَدَّثَنِي سَلَمَةُ عَنْ ذَرٍّ",
                "id": "Telah menceritakan kepadaku [Abdullah bin Hasyim al-'Abdi] telah menceritakan kepada kami [Yahya yaitu Ibnu sa'id al-Qaththan] dari [Syu'bah] dia berkata, telah menceritakan kepadaku [al-Hakam] dari [Dzarr] dari [Sa'id bin Abdurrahman bin Abza] dari [bapaknya] bahwa seorang laki-laki mendatangi Umar seraya berkata, \" aku berjunub, lalu tidak mendapatkan air.\" Maka dia berkata, \"Janganlah kamu sholat!\" Lalu [Ammar] berkata, \"Tidakkah kamu ingat wahai Amirul Mukminin ketika saya dan kamu berada dalam suatu laskar, lalu kita berjunub, lalu kita tidak mendapatkan air. Adapun kamu, maka kamu tidak melakukan sholat, sedangkan saya maka saya berguling-guling di tanah, lalu aku sholat. Maka Nabi shallallahu 'alaihi wasallam bersabda, \"Sudah cukup memadai bagi kamu untuk memukulkan kedua tanganmu pada tanah, kemudian meniupnya, kemudian kamu mengusap wajah dan kedua tanganmu dengan keduanya.\" Maka Umar berkata, \"Bertaqwalah kepada Allah wahai Ammar!\" Dia berkata, \"Jika kamu tidak berkenan maka aku tidak akan menceritakannya.\" [Al-Hakam] berkata, dan telah menceritakannya kepadaku [Ibnu Abdirrahman bin Abza] dari [bapaknya] semisal hadits Dzarr, dia berkata, dan telah menceritakan kepadaku [Salamah] dari [Dzarr] dalam isnad ini yang disebutkan oleh al-Hakam seraya Umar berkata, \"Kami mengangkatmu menjadi wali atas sesuatu yang kamu kuasai (ungkapan persetujuan untuk disampaikannya hadits tersebut, pent).\" Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah menceritakan kepada kami [an-Nadhar bin Syumail] telah mengabarkan kepada kami [Syu'bah] dari [al-Hakam] dia berkata, \"Saya mendengar [Dzarr] dari [Ibnu Abdurrahman bin Abza] dia berkata, [al-Hakam] berkata, dan kamu telah mendengarnya dari [Ibnu Abdurrahman bin Abza] dari [bapaknya] bahwa seorang laki-laki mendatangi Umar seraya berkata, \" Aku junub, lalu aku tidak mendapatkan air.\" Lalu dia membawakan hadits tersebut, dan menambahinya. [Ammar] berkata, \"Wahai Amirul Mukminin, jika kamu berkenan terhadap hakmu yang Allah jadikan atasku, aku tidak akan menceritakannya kepada (semua) orang (kecuali hanya sebagian saja).\" Dan dia tidak menyebutkan telah menceritakan kepada kami Salamah dari Dzarr."
            },
            {
                "number": 542,
                "arab": "قَالَ مُسْلِم وَرَوَى اللَّيْثُ بْنُ سَعْدٍ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ عَنْ عُمَيْرٍ مَوْلَى ابْنِ عَبَّاسٍ أَنَّهُ سَمِعَهُ يَقُولُأَقْبَلْتُ أَنَا وَعَبْدُ الرَّحْمَنِ بْنُ يَسَارٍ مَوْلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى دَخَلْنَا عَلَى أَبِي الْجَهْمِ بْنِ الْحَارِثِ بْنِ الصِّمَّةِ الْأَنْصَارِيِّ فَقَالَ أَبُو الْجَهْمِ أَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ نَحْوِ بِئْرِ جَمَلٍ فَلَقِيَهُ رَجُلٌ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ حَتَّى أَقْبَلَ عَلَى الْجِدَارِ فَمَسَحَ وَجْهَهُ وَيَدَيْهِ ثُمَّ رَدَّ عَلَيْهِ السَّلَامَ",
                "id": "Muslim berkata, dan [al-Laits bin Sa'd] meriwayatkan dari [Ja'far bin Rabi'ah] dari [Abdurrahman bin Hurmuz] dari [Umair maula Ibnu Abbas] bahwasanya dia mendengarnya berkata, aku dan Abdurrahman bin Yasar, maula Maimunah, istri Nabi shallallahu 'alaihi wasallam menghadap Rasulullah, hingga kami mampir pada [Abu al-Jahm bin al-Harits bin ash-Shammah al-Anshari]. Maka Abu al-Jahm berkata, \"Rasulullah Shallallahu'alaihiwasallam datang dari arah sumur Jamal, lalu seorang laki-laki bertemu dengannya, dan ia ucapkan salam kepada beliau, tetapi Rasulullah Shallallahu'alaihiwasallam tidak menjawabnya hingga beliau sampai di dinding, lalu beliau usap wajahnya dan kedua tangannya, barulah beliau menjawab salam tersebut.\""
            },
            {
                "number": 543,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سُفْيَانُ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَجُلًا مَرَّ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبُولُ فَسَلَّمَ فَلَمْ يَرُدَّ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhamad bin Abdullah bin Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Sufyan] dari [adh-Dhahhak bin Utsman] dari [Nafi'] dari [Ibnu Umar] bahwa seorang laki-laki pernah melewati Rasulullah shallallahu 'alaihi wasallam yang saat itu sedang buang air kecil, lalu dia mengucapkan salam kepada beliau, namun beliau tidak menjawabnya."
            },
            {
                "number": 544,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ قَالَ حُمَيْدٌ حَدَّثَنَا ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لَهُ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ حُمَيْدٍ الطَّوِيلِ قَالَ حَدَّثَنَا بَكْرُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّهُ لَقِيَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ وَهُوَ جُنُبٌ فَانْسَلَّ فَذَهَبَ فَاغْتَسَلَ فَتَفَقَّدَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا جَاءَهُ قَالَ أَيْنَ كُنْتَ يَا أَبَا هُرَيْرَةَ قَالَ يَا رَسُولَ اللَّهِ لَقِيتَنِي وَأَنَا جُنُبٌ فَكَرِهْتُ أَنْ أُجَالِسَكَ حَتَّى أَغْتَسِلَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُبْحَانَ اللَّهِ إِنَّ الْمُؤْمِنَ لَا يَنْجُسُ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Yahya yaitu Ibnu Sa'id] berkata [Humaid], telah menceritakan kepada kami, --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] sedangkan lafazh tersebut miliknya, telah menceritakan kepada kami [Ismail bin Ulayah] dari [Humaid ath-Thawil] dia berkata, telah menceritakan kepada kami [Bakar bin Abdullah] dari [Abu Rafi'] dari [Abu Hurairah] bahwasanya dia bertemu Nabi Shallallahu'alaihiwasallam di salah satu jalan di Madinah, sedangkan beliau dalam keadaan berjunub. Maka dia menyelinap yaitu mengelakkan diri dari bertemu Rasulullah Shallallahu'alaihiwasallam dan pergi untuk mandi sehingga Rasulullah Shallallahu'alaihiwasallam mencari-carinya. Ketika beliau datang kembali, beliau pun bertanya, \"Ke mana kamu pergi wahai Abu Hurairah! Dia menjawab, \"Wahai Rasulullah! Kamu ingin menemuiku sedangkan aku dalam keadaan berjunub. Aku merasa tidak suka untuk duduk bersama kamu hingga aku mandi. Lalu Rasulullah Shallallahu'alaihiwasallam bersabda, \"Maha Suci Allah! orang mukmin itu tidak najis.\""
            },
            {
                "number": 545,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ وَاصِلٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِيَهُ وَهُوَ جُنُبٌ فَحَادَ عَنْهُ فَاغْتَسَلَ ثُمَّ جَاءَ فَقَالَ كُنْتُ جُنُبًا قَالَ إِنَّ الْمُسْلِمَ لَا يَنْجُسُ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Waki'] dari [Mis'ar] dari [Washil] dari [Abu Wa'il] dari [Hudzaifah] bahwa Rasulullah shallallahu 'alaihi wasallam menemuinya, sedangkan dia dalam keadaan junub, maka dia menjauhkan diri, lalu mandi, kemudian dia mendatangi Rasulullah Shallallahu'alaihiwasallam, seraya berkata, \"Saya tadi sedang junub.\" Rasulullah shallallahu 'alaihi wasallam bersabda, \" Seorang muslim tidak najis.\""
            },
            {
                "number": 546,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ وَإِبْرَاهِيمُ بْنُ مُوسَى قَالَا حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ أَبِيهِ عَنْ خَالِدِ بْنِ سَلَمَةَ عَنْ الْبَهِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ اللَّهَ عَلَى كُلِّ أَحْيَانِهِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin al-'Ala'] dan [Ibrahim bin Musa] keduanya berkata, telah menceritakan kepada kami [Ibnu Abi Zaidah] dari [bapaknya] dari [Khalid bin Salamah] dari [al-Bahi] dari [Urwah] dari [Aisyah] dia berkata, \"Dahulu Nabi shallallahu 'alaihi wasallam berdzikir kepada Allah dalam setiap keadaannya.\""
            },
            {
                "number": 547,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ وَقَالَ أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْخَلَاءِ فَأُتِيَ بِطَعَامٍ فَذَكَرُوا لَهُ الْوُضُوءَ فَقَالَ أُرِيدُ أَنْ أُصَلِّيَ فَأَتَوَضَّأَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya at-Tamimi] dan [Abu ar-Rabi' az-Zahrani] berkata [Yahya] telah mengabarkan kepada kami [Hammad bin Zaid] dan berkata [Abu ar-Rabi'] telah menceritakan kepada kami [Hammad] dari [Amru bin Dinar] dari [Sa'id bin al-Huwairits] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam keluar dari WC, lalu beliau dibawakan makanan, maka mereka mengingatkan beliau untuk berwudhu, maka beliau bersabda, \"Saya ingin sholat, maka saya berwudhu.\""
            },
            {
                "number": 548,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُاكُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ مِنْ الْغَائِطِ وَأُتِيَ بِطَعَامٍ فَقِيلَ لَهُ أَلَا تَوَضَّأُ فَقَالَ لِمَ أَأُصَلِّي فَأَتَوَضَّأَ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru] dari [Sa'id bin al-Huwairits] saya mendengar [Ibnu Abbas] berkata, \"Kami pernah di sisi Nabi Shallallahu'alaihiwasallam, lalu beliau datang dari WC, dan beliau dibawakan makanan, maka dikatakan kepada beliau, 'Tidakkah kamu berwudhu?.' Maka beliau bersabda, 'Mengapa harus berwudhu, apakah saya akan sholat sehingga harus berwudhu'.\""
            },
            {
                "number": 549,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ مَوْلَى آلِ السَّائِبِ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْغَائِطِ فَلَمَّا جَاءَ قُدِّمَ لَهُ طَعَامٌ فَقِيلَ يَا رَسُولَ اللَّهِ أَلَا تَوَضَّأُ قَالَ لِمَ أَلِلصَّلَاةِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Muhammad bin Muslim ath-Thaifi] dari [Amru bin Dinar] dari [Sa'id bin al-Huwairits, maula Ali as-Sa'ib] bahwa dia mendengar [Abdullah bin Abbas] berkata, \"Rasulullah pernah ke WC, ketika beliau datang, maka dibawakanlah makanan kepadanya, maka dikatakan kepada beliau, 'Wahai Rasulullah, tidakkah kamu berwudhu? ' Beliau menjawab, 'Kenapa, apakah untuk sholat? '.\""
            },
            {
                "number": 550,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ حُوَيْرِثٍ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُاإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى حَاجَتَهُ مِنْ الْخَلَاءِ فَقُرِّبَ إِلَيْهِ طَعَامٌ فَأَكَلَ وَلَمْ يَمَسَّ مَاءًقَالَ وَزَادَنِي عَمْرُو بْنُ دِينَارٍ عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِيلَ لَهُ إِنَّكَ لَمْ تَوَضَّأْ قَالَ مَا أَرَدْتُ صَلَاةً فَأَتَوَضَّأَ وَزَعَمَ عَمْرٌو أَنَّهُ سَمِعَ مِنْ سَعِيدِ بْنِ الْحُوَيْرِثِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Amru bin Abbad bin Jabalah] telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dia berkata, telah menceritakan kepada kami [Sa'id bin Huwairits] bahwa dia mendengar [Ibnu Abbas] berkata, \" Nabi shallallahu 'alaihi wasallam membuang hajatnya dari WC, lalu didekatkan kepadanya makanan, lalu beliau makan tanpa mengusap air (wudhu).\" Dia berkata, dan menambahkan kepadaku [Amru bin Dinar] dari [Sa'id bin al-Huwairits] bahwa Nabi shallallahu 'alaihi wasallam dikatakan kepada beliau, \"Kamu belum berwudhu.\" Beliau menjawab, \"Aku tidak berkeinginan untuk sholat, maka (mengapa aku harus) berwudhu?.\" Amru mengklaim bahwa dia mendengar dari Sa'id bin al-Huwairits."
            },
            {
                "number": 551,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ وَقَالَ يَحْيَى أَيْضًا أَخْبَرَنَا هُشَيْمٌ كِلَاهُمَا عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍفِي حَدِيثِ حَمَّادٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ وَفِي حَدِيثِ هُشَيْمٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْكَنِيفَ قَالَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْخُبْثِ وَالْخَبَائِثِو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بِهَذَا الْإِسْنَادِ وَقَالَ أَعُوذُ بِاللَّهِ مِنْ الْخُبْثِ وَالْخَبَائِثِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Hammad bin Zaid] dan [Yahya] berkata juga telah mengabarkan kepada kami [Husyaim] keduanya meriwayatkan dari [Abdul Aziz bin Shuhaib] dari [Anas] dalam hadits Hammad, \"Dahulu Rasulullah shallallahu 'alaihi wasallam apabila masuk WC\" --Sedangkan dalam hadis Husyaim dengan redaksi \"Bahwa Rasulullah apabila masuk tempat buang hajat--, maka beliau membaca, 'ALLOOHUMMA INNI A'UUDZU BIKA MINAL KHUBUTSI WALKHOBA'ITS\" Ya Allah, sesungguhnya aku berlindung kepadaMu dari setan laki-laki dan setan perempuan'.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Zuhair bin Harb] keduanya berkata, telah menceritakan kepada kami [Ismail, yaitu Ibnu Ulayyah] dari [Abdul Aziz] dengan sanad ini, dan dia berkata, ' A'UUDZU BILLAH MINAL KHUBUTSI WALKHOBA'ITS Aku berlindung kepada Allah dari gangguan setan laki-laki dan setan perempuan'.\""
            },
            {
                "number": 552,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ ح و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْوَارِثِ كِلَاهُمَا عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ قَالَ أُقِيمَتْ الصَّلَاةُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَجِيٌّ لِرَجُلٍ وَفِي حَدِيثِ عَبْدِ الْوَارِثِ وَنَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيُنَاجِي الرَّجُلَ فَمَا قَامَ إِلَى الصَّلَاةِ حَتَّى نَامَ الْقَوْمُ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Ismail bin Ulayyah] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Abdul Warits] keduanya meriwayatkan dari [Abdul Aziz] dari [Anas] dia berkata, \"sholat diiqamatkan, sedangkan Rasulullah shallallahu 'alaihi wasallam membisiki seorang laki-laki.\" Dan dalam hadits Abdul Warits, \"Dan Nabi Allah membisiki seorang laki-laki, lalu beliau tidak mendirikan sholat hingga kaum tersebut tertidur.\""
            },
            {
                "number": 553,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ سَمِعَ أَنَسَ بْنَ مَالِكٍ قَالَأُقِيمَتْ الصَّلَاةُ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَاجِي رَجُلًا فَلَمْ يَزَلْ يُنَاجِيهِ حَتَّى نَامَ أَصْحَابُهُ ثُمَّ جَاءَ فَصَلَّى بِهِمْ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Muadz al-'Anbari] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Syu'bah] dari [Abdul Aziz bin Shuhaib] dia mendengar [Anas bin Malik] berkata, \"sholat telah diiqamatkan, sedangkan Nabi shallallahu 'alaihi wasallam membisiki seorang laki-laki, lalu beliau terus membisikinya hingga para sahabatnya tertidur, lalu beliau datang dan sholat mengimami mereka.\""
            },
            {
                "number": 554,
                "arab": "و حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًا يَقُولُاكَانَ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنَامُونَ ثُمَّ يُصَلُّونَ وَلَا يَتَوَضَّئُونَ قَالَ قُلْتُ سَمِعْتَهُ مِنْ أَنَسٍ قَالَ إِي وَاللَّهِ",
                "id": "Dan telah menceritakan kepadaku [Yahya bin Habib al-Haritsi] telah menceritakan kepada kami [Khalid, yaitu Ibnu al-Harits] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dia berkata, saya mendengar [Anas] berkata, \"Dahulu para sahabat Rasulullah shallallahu 'alaihi wasallam tertidur, kemudian mereka sholat tanpa berwudhu.\" Dia berkata, \"Aku berkata, 'Aku mendengarnya dari Anas. Dia berkata, 'Ya, demi Allah'.\""
            },
            {
                "number": 555,
                "arab": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ حَدَّثَنَا حَبَّانُ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّهُ قَالَأُقِيمَتْ صَلَاةُ الْعِشَاءِ فَقَالَ رَجُلٌ لِي حَاجَةٌ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَاجِيهِ حَتَّى نَامَ الْقَوْمُ أَوْ بَعْضُ الْقَوْمِ ثُمَّ صَلَّوْا",
                "id": "Telah menceritakan kepadaku [Ahmad bin Sa'id bin Shakhr ad-Darimi] telah menceritakan kepada kami [Habban] telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas] bahwasanya dia berkata, \"sholat Isya' telah diiqamatkan, lalu seorang laki-laki berkata, 'Aku mempunyai keperluan.' Maka Nabi shallallahu 'alaihi wasallam membisikinya hingga para sahabatnya tertidur, atau sebagian sahabatnya. Kemudian mereka sholat (berjama'ah) '.\""
            },
            {
                "number": 556,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَا أَخْبَرَنَا ابْنُ جُرَيْجٍ ح حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ وَاللَّفْظُ لَهُ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي نَافِعٌ مَوْلَى ابْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَكَانَ الْمُسْلِمُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَجْتَمِعُونَ فَيَتَحَيَّنُونَ الصَّلَوَاتِ وَلَيْسَ يُنَادِي بِهَا أَحَدٌ فَتَكَلَّمُوا يَوْمًا فِي ذَلِكَ فَقَالَ بَعْضُهُمْ اتَّخِذُوا نَاقُوسًا مِثْلَ نَاقُوسِ النَّصَارَى وَقَالَ بَعْضُهُمْ قَرْنًا مِثْلَ قَرْنِ الْيَهُودِ فَقَالَ عُمَرُ أَوَلَا تَبْعَثُونَ رَجُلًا يُنَادِي بِالصَّلَاةِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بِلَالُ قُمْ فَنَادِ بِالصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim al-Hanzhali] telah menceritakan kepada kami [Muhammad bin Bakar] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazzaq] keduanya berkata, telah mengabarkan kepada kami [Ibnu Juraij] --lewat jalur periwayatan lain-- telah menceritakan kepada kami [Harun bin Abdullah] dan lafazh tersebut miliknya, dia berkata, telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata, [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Nafi' maula Ibnu Umar] dari [Abdullah bin Umar] bahwasanya dia berkata, \"Dahulu kaum muslimin ketika tiba di Madinah, mereka berkumpul, lalu memperkirakan waktu sholat lima waktu, dan tidak ada seorang pun yang memanggil adzan untuk sholat. Lalu mereka membicarakan hal tersebut di suatu hari. Sebagian mereka berkata, 'Jadikanlah lonceng (sebagai alat pemanggil) sebagaimana lonceng orang-orang Nashrani.' Dan sebagian mereka berkata, 'Jadikanlah terompet (sebagai alat pemanggil) seperti terompet orang-orang Yahudi.' Lalu Umar berkata, 'Mengapa kalian tidak mengutus seorang laki-laki yang menyerukan sholat.' Rasulullah shallallahu 'alaihi wasallam bersabda, 'Berdirilah wahai Bilal, lalu serukanlah sholat'.\""
            },
            {
                "number": 557,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ جَمِيعًا عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ قَالَأُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَيُوتِرَ الْإِقَامَةَزَادَ يَحْيَى فِي حَدِيثِهِ عَنْ ابْنِ عُلَيَّةَ فَحَدَّثْتُ بِهِ أَيُّوبَ فَقَالَ إِلَّا الْإِقَامَةَ",
                "id": "Telah menceritakan kepada kami [Khalaf bin Hisyam] telah menceritakan kepada kami [Hammad bin Zaid] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Ismail bin Ulayyah] semuanya meriwayatkan dari [Khalid al-Hadzdza'] dari [Abu Qilabah] dari [Anas] dia berkata, \"Bilal diperintahkan untuk menggenapkan adzan, dan mengganjilkan iqamah.\" [Yahya] menambahkan dalam haditsnya, dari [Ibnu Ulayyah], lalu aku menceritakannya pada [Ayyub], maka dia berkata, \"Kecuali iqamah.\""
            },
            {
                "number": 558,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَذَكَرُوا أَنْ يُعْلِمُوا وَقْتَ الصَّلَاةِ بِشَيْءٍ يَعْرِفُونَهُ فَذَكَرُوا أَنْ يُنَوِّرُوا نَارًا أَوْ يَضْرِبُوا نَاقُوسًا فَأُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَيُوتِرَ الْإِقَامَةَو حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ بِهَذَا الْإِسْنَادِ لَمَّا كَثُرَ النَّاسُ ذَكَرُوا أَنْ يُعْلِمُوا بِمِثْلِ حَدِيثِ الثَّقَفِيِّ غَيْرَ أَنَّهُ قَالَ أَنْ يُورُوا نَارًا",
                "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim al-Hanzhali] telah mengabarkan kepada kami [Abdul Wahab ats-Tsaqafi] telah menceritakan kepada kami [Khalid al-Hadzdza'] dari [Abu Qilabah] dari [Anas bin Malik] dia berkata, \"Orang-orang ramai membicarakan untuk mengumumkan waktu sholat dengan sesuatu yang mereka kenal, lalu mereka ungkapkan, 'Membuat cahaya api saja, atau memukul lonceng.' Lalu Bilal diperintahkan untuk menggenapkan adzan dan mengganjilkan iqamah.\" Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Khalid al-Hadzdza'] dengan isnad ini, \"Ketika orang-orang telah berjumlah banyak, maka mereka menyebutkan agar mengumumkan (sholat) seperti hadits ats-Tsaqafi, hanya saja dia berkata, \"Agar mereka memberikan cahaya api.\""
            },
            {
                "number": 559,
                "arab": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ وَعَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ قَالَا حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ قَالَأُمِرَ بِلَالٌ أَنْ يَشْفَعَ الْأَذَانَ وَيُوتِرَ الْإِقَامَةَ",
                "id": "Dan telah menceritakan kepada kami [ubaidhullah bin Umar al-Qawariri] telah menceritakan kepada kami [Abdul Warits bin Sa'id] dan [Abdul Wahab bin Abdul Majid] keduanya berkata, telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Anas] dia berkata, \"Bilal diperintahkan untuk menggenapkan adzan dan mengganjilkan iqamah.\""
            },
            {
                "number": 560,
                "arab": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ مَالِكُ بْنُ عَبْدِ الْوَاحِدِ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو غَسَّانَ حَدَّثَنَا مُعَاذٌ وَقَالَ إِسْحَقُ أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ صَاحِبِ الدَّسْتَوَائِيِّ و حَدَّثَنِي أَبِي عَنْ عَامِرٍ الْأَحْوَلِ عَنْ مَكْحُولٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ عَنْ أَبِي مَحْذُورَةَأَنَّ نَبِيَّ اللَّهِ عَلَّمَهُ هَذَا الْأَذَانَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ثُمَّ يَعُودُ فَيَقُولُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَيَّ عَلَى الصَّلَاةِ مَرَّتَيْنِ حَيَّ عَلَى الْفَلَاحِ مَرَّتَيْنِزَادَ إِسْحَقُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah menceritakan kepada kami [Abu Ghassan al-Misma'i Malik bin Abdul Wahid] dan [Ishaq bin Ibrahim] berkata [Abu Ghassan] telah menceritakan kepada kami [Mu'adz] dan berkata [Ishaq] telah mengabarkan kepada kami [Mu'adz bin Hisyam, sahabat ad-Dastawa'i] dan telah menceritakan kepada kami [bapakku] dari [Amir al-Ahwal] dari [Makhul] dari [Abdullah bin Muhairiz] dari [Abu Mahdzurah] bahwa Nabi shallallahu 'alaihi wasallam mengajarkan kepada bapaknya adzan ini, \"Allah Mahabesar, Allah Mahabesar, saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, saya bersaksi bahwa Muhammad utusan Allah, saya bersaksi bahwa Muhammad utusan Allah, kemudian dia mengulanginya lagi seraya berkata, saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, saya bersaksi bahwa Muhammad utusan Allah, saya bersaksi bahwa Muhammad utusan Allah, marilah kita mendirikan sholat dua kali, marilah menuju kebahagiaan dua kali.\" Ishaq menambahkan, \"Allah Mahabesar, Allah Mahabesar, tidak ada tuhan (yang berhak disembah) selain Allah.\""
            },
            {
                "number": 561,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُؤَذِّنَانِ بِلَالٌ وَابْنُ أُمِّ مَكْتُومٍ الْأَعْمَىو حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنَا الْقَاسِمُ عَنْ عَائِشَةَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Rasulullah dahulu mempunyai dua mu'adzdzin, Bilal dan Ibnu Ummi Maktum yang buta.\" Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [ubaidhullah] telah menceritakan kepada kami [al-Qasim] dari [Aisyah] semisalnya."
            },
            {
                "number": 562,
                "arab": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ مَخْلَدٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ ابْنُ أُمِّ مَكْتُومٍ يُؤَذِّنُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ أَعْمَىو حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ وَسَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin al-Ala' al-Hamdani] telah menceritakan kepada kami [Khalid, yaitu Ibnu Makhlad] dari [Muhammad bin Ja'far] telah menceritakan kepada kami [Hisyam] dari [bapaknya] dari [Aisyah] dia berkata, \"Dahulu Ibnu Ummi Maktum mengumandangkan adzan untuk Rasulullah Shallallahu'alaihiwasallam, sedangkan dia buta.\" Dan telah menceritakan kepada kami [Muhammad bin Salamah al-Muradi] telah menceritakan kepada kami [Abdullah bin Wahab] dari [Yahya bin Abdullah] dan [Sa'id bin Abdurrahman] dari [Hisyam] dengan isnad ini semisalnya."
            },
            {
                "number": 563,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُغِيرُ إِذَا طَلَعَ الْفَجْرُ وَكَانَ يَسْتَمِعُ الْأَذَانَ فَإِنْ سَمِعَ أَذَانًا أَمْسَكَ وَإِلَّا أَغَارَ فَسَمِعَ رَجُلًا يَقُولُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْفِطْرَةِ ثُمَّ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجْتَ مِنْ النَّارِ فَنَظَرُوا فَإِذَا هُوَ رَاعِي مِعْزًى",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Yahya, yaitu Ibnu Sa'id] dari [Hammad bin Salamah] telah menceritakan kepada kami [Tsabit] dari [Anas bin Malik] dia berkata, \"Kebiasaan Rasulullah shallallahu 'alaihi wasallam melakukan agresi militer (penyerbuan) apabila fajar telah terbit. Beliau memasang telinga mendengarkan adzan. Jika beliau mendengarkan adzan, niscaya beliau menahan agresi militer (penyerbuannya), namun apabila tidak, niscaya beliau akan teruskan agresi militernya. Lalu beliau mendengar seorang laki-laki mengucapkan, 'Allah Mahabesar, Allah Mahabesar. Maka Rasulullah shallallahu 'alaihi wasallam bersabda, \"Dia berada pada fithrah (Islam). Kemudian dia mengucapkan, 'Saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah', maka Rasulullah shallallahu 'alaihi wasallam bersabda, 'Dia telah keluar dari neraka, lalu mereka melihat (siapa laki-laki tersebut), ternyata dia adalah penggembala kambing'.\""
            },
            {
                "number": 564,
                "arab": "حَدَّثَنِي يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَمِعْتُمْ النِّدَاءَ فَقُولُوا مِثْلَ مَا يَقُولُ الْمُؤَذِّنُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata, saya membaca di hadapan [Malik] dari [Ibnu Syihab] dari [Atha' bin Yazid al-Laitsi] dari [Abu Sa'id al-Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda, \"Jika kalian mendengar seruan (adzan), maka katakanlah seperti yang dikatakan mu'adzdzin.\""
            },
            {
                "number": 565,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ حَيْوَةَ وَسَعِيدِ بْنِ أَبِي أَيُّوبَ وَغَيْرِهِمَا عَنْ كَعْبِ بْنِ عَلْقَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَمِعْتُمْ الْمُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ ثُمَّ صَلُّوا عَلَيَّ فَإِنَّهُ مَنْ صَلَّى عَلَيَّ صَلَاةً صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْرًا ثُمَّ سَلُوا اللَّهَ لِي الْوَسِيلَةَ فَإِنَّهَا مَنْزِلَةٌ فِي الْجَنَّةِ لَا تَنْبَغِي إِلَّا لِعَبْدٍ مِنْ عِبَادِ اللَّهِ وَأَرْجُو أَنْ أَكُونَ أَنَا هُوَ فَمَنْ سَأَلَ لِي الْوَسِيلَةَ حَلَّتْ لَهُ الشَّفَاعَةُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Salamah al-Muradi] telah menceritakan kepada kami [Abdullah bin Wahab] dari [Haiwah] dan [Sa'id bin Abi Ayyub] serta selain keduanya dari [Ka'ab bin Alqamah] dari [Abdurrahman bin Jubair] dari [Abdullah bin Amru bin al-Ash] bahwa dia mendengar Nabi shallallahu 'alaihi wasallam bersabda, \"Apabila kalian mendengar mu'adzdzin (mengumandangkan adzan) maka ucapkanlah seperti yang dia ucapkan, kemudian bershalawatlah atasku, karena orang yang bershalawat atasku dengan satu shalawat, niscaya Allah akan bershalawat atasnya dengannya sepuluh kali, kemudian mintalah kepada Allah wasilah untukku, karena ia adalah suatu tempat di surga, tidaklah layak tempat tersebut kecuali untuk seorang hamba dari hamba-hamba Allah, dan saya berharap agar saya menjadi hamba tersebut. Dan barangsiapa memintakan wasilah untukku, maka syafa'at halal untuknya.\""
            },
            {
                "number": 566,
                "arab": "حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ جَهْضَمٍ الثَّقَفِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ إِسَافٍ عَنْ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ أَبِيهِ عَنْ جَدِّهِ عُمَرَ بْنِ الْخَطَّابِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَالَ الْمُؤَذِّنُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ فَقَالَ أَحَدُكُمْ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ثُمَّ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ ثُمَّ قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ثُمَّ قَالَ حَيَّ عَلَى الصَّلَاةِ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ ثُمَّ قَالَ حَيَّ عَلَى الْفَلَاحِ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ ثُمَّ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ثُمَّ قَالَ لَا إِلَهَ إِلَّا اللَّهُ قَالَ لَا إِلَهَ إِلَّا اللَّهُ مِنْ قَلْبِهِ دَخَلَ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Abu Ja'far Muhammad bin Jahdham ats-Tsaqafi] telah menceritakan kepada kami [Ismail bin Ja'far] dari [Umarah bin Ghaziyyah] dari [Khubaib bin Abdurrahman bin Isaf] dari [Hafsh bin Ashim bin Umar bin al-Khaththab] dari [bapaknya] dari [kakeknya, Umar bin al-Khaththab] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, \"Jika seorang mu'adzin mengumandangkan adzan seraya berseru, 'Allah Mahabesar, Allah Mahabesar', lalu salah seorang di antara kalian mengucap, 'Allah Mahabesar, Allah Mahabesar', kemudian mu'adzin berseru, 'Saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, lalu dia berucap, 'Saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah, kemudian mu'adzin melanjutkan, 'Saya bersaksi bahwa Muhammad utusan Allah', lalu dia mengucap, 'Saya bersaksi bahwa Muhammad utusan Allah', kemudian mu'adzin berseru, 'Marilah sholat', dan dia membaca, 'Tidak ada daya dan upaya kecuali dengan Allah', kemudian mu'adzin berseru, 'Marilah menuju kebahagiaan, ' lalu dia menjawab, 'Tidak ada daya dan upaya kecuali dengan Allah', kemudian mu'adzin berkata, 'Allah Mahabesar, Allah Mahabesar', lalu dia menjawab, 'Allah Mahabesar, Allah Mahabesar', kemudian (menutup adzannya) dengan lafadz, 'Tidak ada tuhan (yang berhak disembah) selian Allah', lalu dia menjawab dengan lafadz, 'Tidak ada tuhan (yang berhak disembah) selian Allah'. (Jika dia melakukan hal itu) dengan sepenuh hati, niscaya dia masuk surga\"."
            },
            {
                "number": 567,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ الْقُرَشِيِّ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ رَضِيتُ بِاللَّهِ رَبًّا وَبِمُحَمَّدٍ رَسُولًا وَبِالْإِسْلَامِ دِينًا غُفِرَ لَهُ ذَنْبُهُقَالَ ابْنُ رُمْحٍ فِي رِوَايَتِهِ مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ وَأَنَا أَشْهَدُ وَلَمْ يَذْكُرْ قُتَيْبَةُ قَوْلَهُ وَأَنَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [al-Laits] dari [al-Hukaim bin Abdullah bin Qais al-Qurasyi] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [al-Hukaim bin Abdullah] dari [Amir bin Sa'ad bin Abi Waqqash] dari [Sa'ad bin Abi Waqqash] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda, \"Barangsiapa membaca ketika mendengar muadzdzin, 'Saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah semata, tidak ada sekutu bagiNya, dan bahwa Muhammad adalah hamba dan RasulNya, saya ridha Allah sebagai Rabb, dan Muhammad sebagai rasul, serta Islam sebagai agama, ' niscaya dosanya akan diampuni.\" Ibnu Rumh berkata dalam riwayatnya, \"Barangsiapa membaca ketika mendengar muadzdzin, 'Dan saya bersaksi, ' sedangkan Qutaibah tidak menyebutkan ungkapan, 'Saya'.\""
            },
            {
                "number": 568,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدَةُ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عَمِّهِ قَالَ كُنْتُ عِنْدَ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ فَجَاءَهُ الْمُؤَذِّنُ يَدْعُوهُ إِلَى الصَّلَاةِ فَقَالَ مُعَاوِيَةُ سَمِعْتُرَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمُؤَذِّنُونَ أَطْوَلُ النَّاسِ أَعْنَاقًا يَوْمَ الْقِيَامَةِو حَدَّثَنِيهِ إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو عَامِرٍ حَدَّثَنَا سُفْيَانُ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عِيسَى بْنِ طَلْحَةَ قَالَ سَمِعْتُ مُعَاوِيَةَ يَقُولُا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Abdah] dari [Thalhah bin Yahya] dari [pamannya] dia berkata, \"Saya berada di samping [Mu'awiyah bin Abi Sufyan], lalu datanglah muadzdzin yang menyerukan sholat, maka Mu'awiyah berkata, 'Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, 'Para mu'adzdzin adalah orang yang paling panjang lehernya (ungkapan bahwa mereka mulia di akhirat pent) pada hari kiamat'.\" Dan telah menceritakan kepadaku tentangnya [Ishaq bin Manshur] telah mengabarkan kepada kami [Abu Amir] telah menceritakan kepada kami [Sufyan] dari [Thalhah bin Yahya] dari [Isa bin Thalhah] dia berkata, saya mendengar [Mu'awiyah] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda dengan semisalnya."
            },
            {
                "number": 569,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الشَّيْطَانَ إِذَا سَمِعَ النِّدَاءَ بِالصَّلَاةِ ذَهَبَ حَتَّى يَكُونَ مَكَانَ الرَّوْحَاءِقَالَ سُلَيْمَانُ فَسَأَلْتُهُ عَنْ الرَّوْحَاءِ فَقَالَ هِيَ مِنْ الْمَدِينَةِ سِتَّةٌ وَثَلَاثُونَ مِيلًا و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Utsman bin Abi Syaibah] serta [Ishaq bin Ibrahim] berkata Ishaq telah mengabarkan kepada kami, sedangkan dua orang lainnya berkata, telah menceritakan kepada kami [Jarir] dari [al-A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata, \"Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda, ' setan apabila mendengar adzan untuk sholat, maka dia pergi hingga tempat ar-Rauha'.' Sulaiman berkata, maka aku bertanya kepada beliau tentang ar-Rauha', maka beliau bersabda, 'Ia adalah tempat yang berjarak tiga puluh enam mil dari Madinah.' Dan telah menceritakan kepada kami tentangnya [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [al-A'masy] dengan sanad ini."
            },
            {
                "number": 570,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِقُتَيْبَةَ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الشَّيْطَانَ إِذَا سَمِعَ النِّدَاءَ بِالصَّلَاةِ أَحَالَ لَهُ ضُرَاطٌ حَتَّى لَا يَسْمَعَ صَوْتَهُ فَإِذَا سَكَتَ رَجَعَ فَوَسْوَسَ فَإِذَا سَمِعَ الْإِقَامَةَ ذَهَبَ حَتَّى لَا يَسْمَعَ صَوْتَهُ فَإِذَا سَكَتَ رَجَعَ فَوَسْوَسَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Zuhair bin Harb] serta [Ishaq bin Ibrahim] sedangkan lafazh tersebut milik Qutaibah, berkata Ishaq, telah mengabarkan kepada kami, sedangkan dua orang yang lainnya berkata, telah menceritakan kepada kami [Jarir] dari [al-A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi Shallallahu'alaihiwasallam, beliau bersabda, \"Setan apabila mendengar adzan, maka kentut akan membuatnya lari terbirit-birit sehingga tidak mendengar suaranya lagi. Setelah adzan selesai, dia kembali lagi untuk mengganggu. Begitu juga apabila mendengar iqamat. Dia akan lari sehingga tidak mendengarnya lagi, dan apabila iqamat selesai, dia kembali sekali lagi untuk mengganggu.\""
            },
            {
                "number": 571,
                "arab": "حَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ عَبْدِ اللَّهِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَذَّنَ الْمُؤَذِّنُ أَدْبَرَ الشَّيْطَانُ وَلَهُ حُصَاصٌ",
                "id": "Telah menceritakan kepada kami [Abdul Hamid bin Bayan al-Wasithi] telah menceritakan kepada kami [Khalid, yaitu Ibnu Abdullah] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, \"Apabila seorang muadzdzin mengumandangkan adzan, maka setan berpaling, dan dia memiliki kentut.\""
            },
            {
                "number": 572,
                "arab": "حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا رَوْحٌ عَنْ سُهَيْلٍ قَالَأَرْسَلَنِي أَبِي إِلَى بَنِي حَارِثَةَ قَالَ وَمَعِي غُلَامٌ لَنَا أَوْ صَاحِبٌ لَنَا فَنَادَاهُ مُنَادٍ مِنْ حَائِطٍ بِاسْمِهِ قَالَ وَأَشْرَفَ الَّذِي مَعِي عَلَى الْحَائِطِ فَلَمْ يَرَ شَيْئًا فَذَكَرْتُ ذَلِكَ لِأَبِي فَقَالَ لَوْ شَعَرْتُ أَنَّكَ تَلْقَ هَذَا لَمْ أُرْسِلْكَ وَلَكِنْ إِذَا سَمِعْتَ صَوْتًا فَنَادِ بِالصَّلَاةِ فَإِنِّي سَمِعْتُ أَبَا هُرَيْرَةَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ أَنَّهُ قَالَ إِنَّ الشَّيْطَانَ إِذَا نُودِيَ بِالصَّلَاةِ وَلَّى وَلَهُ حُصَاصٌ",
                "id": "Telah menceritakan kepada kami [Umayyah bin Bistham] telah menceritakan kepada kami [Yazid, yaitu Ibnu Zurai'] telah menceritakan kepada kami [Rauh] dari [Suhail] dia berkata, \"[Bapakku] telah mengutusku kepada bani Haritsah\", dia berkata lagi, \"Saya pergi bersama budak kami -atau sahabat kami- lalu seorang penyeru menyeru dari kebun dengan namanya.\" Dia berkata lagi, \"Orang yang bersama kami memeriksa kebun, namun dia tidak melihat sesuatu pun, maka aku menyebutkan hal itu kepada bapakku, maka dia berkata, \"Kalau saya merasa bahwa kamu menemui ini, niscaya aku tidak akan mengutusmu, akan tetapi apabila kamu mendengar suara, lalu penyeru menyeru untuk sholat maka aku mendengar [Abu Hurairah] menceritakan dari Rasululah shallallahu 'alaihi wasallam bersabda, ' setan apabila seorang muadzdzin mengumandangkan adzan sholat, maka dia berpaling, dan dia memiliki kentut'.\""
            },
            {
                "number": 573,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نُودِيَ لِلصَّلَاةِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ حَتَّى لَا يَسْمَعَ التَّأْذِينَ فَإِذَا قُضِيَ التَّأْذِينُ أَقْبَلَ حَتَّى إِذَا ثُوِّبَ بِالصَّلَاةِ أَدْبَرَ حَتَّى إِذَا قُضِيَ التَّثْوِيبُ أَقْبَلَ حَتَّى يَخْطُرَ بَيْنَ الْمَرْءِ وَنَفْسِهِ يَقُولُ لَهُ اذْكُرْ كَذَا وَاذْكُرْ كَذَا لِمَا لَمْ يَكُنْ يَذْكُرُ مِنْ قَبْلُ حَتَّى يَظَلَّ الرَّجُلُ مَا يَدْرِي كَمْ صَلَّىحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ حَتَّى يَظَلَّ الرَّجُلُ إِنْ يَدْرِي كَيْفَ صَلَّى",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [al-Mughirah yaitu al-Hizami] dari [Abu az-Zinad] dari [al-A'raj] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda, \"Apabila diserukan untuk sholat, maka setan berpaling, dia memiliki kentut hingga dia tidak mendengarkan suara adzan. Dan apabila adzan telah selesai, maka dia kembali hingga apabila sholat telah diiqamatkan, maka dia berpaling hingga apabila iqamah telah selesai, maka dia kembali hingga mengingatkan antara seseorang dengan dirinya, dia berkata, 'Ingat demikian, ingat demikian untuk sesuatu yang tidak dia ingat sebelumnya hingga senantiasa seorang laki-laki tidak mengetahui berapa raka'at dia sholat'.\" Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan yang semisalnya hanya saja dia berkata, \"Hingga seorang laki-laki senantiasa tidak tahu bagaimana dia sholat.\""
            },
            {
                "number": 574,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَسَعِيدُ بْنُ مَنْصُورٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ وَاللَّفْظُ لِيَحْيَى قَالَ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ مَنْكِبَيْهِ وَقَبْلَ أَنْ يَرْكَعَ وَإِذَا رَفَعَ مِنْ الرُّكُوعِ وَلَا يَرْفَعُهُمَا بَيْنَ السَّجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya at-Tamimi], [Sa'id bin Manshur], [Abu Bakar bin Abi Syaibah], [Amru an-Naqid], dan [Zuhair bin Harb], serta [Ibnu Numair] semuanya dari [Sufyan bin Uyainah] dan lafazh tersebut milik Yahya, dia berkata, telah mengabarkan kepada kami [Sufyan bin Uyainah] dari [az-Zuhri] dari [Salim] dari [bapaknya] dia berkata, \"Saya melihat Rasulullah shallallahu 'alaihi wasallam apabila memulai sholat, maka beliau mengangkat kedua tangannya hingga sejajar dengan kedua pundaknya dan mengangkat tangan sebelum rukuk dan ketika berdiri dari rukuk, namun beliau tidak mengangkat kedua tangannya antara dua sujud.\""
            },
            {
                "number": 575,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي ابْنُ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ ابْنَ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ لِلصَّلَاةِ رَفَعَ يَدَيْهِ حَتَّى تَكُونَا حَذْوَ مَنْكِبَيْهِ ثُمَّ كَبَّرَ فَإِذَا أَرَادَ أَنْ يَرْكَعَ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ مِنْ الرُّكُوعِ فَعَلَ مِثْلَ ذَلِكَ وَلَا يَفْعَلُهُ حِينَ يَرْفَعُ رَأْسَهُ مِنْ السُّجُودِحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا حُجَيْنٌ وَهُوَ ابْنُ الْمُثَنَّى حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ حَدَّثَنَا سَلَمَةُ بْنُ سُلَيْمَانَ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا يُونُسُ كِلَاهُمَا عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ كَمَا قَالَ ابْنُ جُرَيْجٍ كَانَ رَسُولُ اللَّهِ إِذَا قَامَ لِلصَّلَاةِ رَفَعَ يَدَيْهِ حَتَّى تَكُونَا حَذْوَ مَنْكِبَيْهِ ثُمَّ كَبَّرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Ibnu Syihab] dari [Salim bin Abdullah] bahwa [Ibnu Umar] berkata, \"Rasululllah apabila mendirikan sholat maka beliau mengangkat kedua tangannya hingga menjadi sejajar dengan kedua pundaknya, kemudian bertakbir, lalu jika beliau ingin rukuk maka beliau mengerjakan seperti itu, dan apabila berdiri dari rukuk maka beliau mengerjakan seperti itu, namun beliau tidak mengerjakannya ketika mengangkat kepalanya dari sujud.\" Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Hujain, yaitu Ibnu al-Mutsanna] telah menceritakan kepada kami [al-Laits] dari [Uqail] --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Quhzad] telah menceritakan kepada kami [Salamah bin Sulaiman] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus] keduanya dari [az-Zuhri] dengan sanad ini sebagaimana dikatakan Ibnu Juraij, \"Rasulullah shallallahu 'alaihi wasallam apabila mendirikan sholat maka beliau mengangkat kedua tangannya hingga menjadi sejajar dengan kedua pundaknya, kemudian bertakbir.\""
            },
            {
                "number": 576,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ أَنَّهُ رَأَى مَالِكَ بْنَ الْحُوَيْرِثِإِذَا صَلَّى كَبَّرَ ثُمَّ رَفَعَ يَدَيْهِ وَإِذَا أَرَادَ أَنْ يَرْكَعَ رَفَعَ يَدَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَ يَدَيْهِ وَحَدَّثَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ هَكَذَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Khalid bin Abdullah] dari [Khalid] dari [Abu Qilabah] bahwa dia melihat [Malik bin al-Huwairits] apabila sholat maka dia bertakbir kemudian mengangkat kedua tangannya, dan apabila berkehendak untuk rukuk maka dia mengangkat kedua tangannya, dan apabila mengangkat kepalanya dari rukuk maka dia mengangkat kedua tangannya, dan dia menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam dahulu melakukan hal tersebut."
            },
            {
                "number": 577,
                "arab": "حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا كَبَّرَ رَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا أُذُنَيْهِ وَإِذَا رَكَعَ رَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا أُذُنَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَعَلَ مِثْلَ ذَلِكَو حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ أَنَّهُ رَأَى نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ حَتَّى يُحَاذِيَ بِهِمَا فُرُوعَ أُذُنَيْهِ",
                "id": "Telah menceritakan kepadaku [Abu Kamil al-Jahdari] telah menceritakan kepada kami [Abu Awanah] dari [Qatadah] dari [Nashr bin Ashim] dari [Malik bin al-Huwairits] bahwa Rasulullah shallallahu 'alaihi wasallam apabila bertakbir maka beliau mengangkat kedua tangannya hingga sejajar dengan kedua telinganya, dan apabila rukuk maka beliau mengangkat kedua tangannya hingga sejajar dengan kedua telinganya, dan apabila mengangkat kepalanya dari rukuk seraya mengucapkan, 'Semoga Allah mendengarkan orang yang memujiNya', maka beliau melakukan seperti itu.\" Dan telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Ibnu Abi Adi] dari [Sa'id] dari [Qatadah] dengan sanad ini bahwa dia melihat Nabi Allah shallallahu 'alaihi wasallam seraya berkata, hingga kedua tangannya sejajar dengan cabang telinganya."
            },
            {
                "number": 578,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَكَانَ يُصَلِّي لَهُمْ فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ فَلَمَّا انْصَرَفَ قَالَ وَاللَّهِ إِنِّي لَأَشْبَهُكُمْ صَلَاةً بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata, saya membaca di hadapan [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] bahwa [Abu Hurairah] pernah sholat mengimami mereka, lalu bertakbir setiap kali turun dan naik. Dan ketika dia berpaling maka dia berkata, \"Demi Allah, aku adalah orang yang paling mirip sholatnya dengan Rasulullah Shallallahu'alaihiwasallam.\""
            },
            {
                "number": 579,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُاكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ يُكَبِّرُ حِينَ يَقُومُ ثُمَّ يُكَبِّرُ حِينَ يَرْكَعُ ثُمَّ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ حِينَ يَرْفَعُ صُلْبَهُ مِنْ الرُّكُوعِ ثُمَّ يَقُولُ وَهُوَ قَائِمٌ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ يُكَبِّرُ حِينَ يَهْوِي سَاجِدًا ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ ثُمَّ يُكَبِّرُ حِينَ يَسْجُدُ ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ ثُمَّ يَفْعَلُ مِثْلَ ذَلِكَ فِي الصَّلَاةِ كُلِّهَا حَتَّى يَقْضِيَهَا وَيُكَبِّرُ حِينَ يَقُومُ مِنْ الْمَثْنَى بَعْدَ الْجُلُوسِ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ إِنِّي لَأَشْبَهُكُمْ صَلَاةً بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا حُجَيْنٌ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ يُكَبِّرُ حِينَ يَقُومُ بِمِثْلِ حَدِيثِ ابْنِ جُرَيْجٍ وَلَمْ يَذْكُرْ قَوْلَ أَبِي هُرَيْرَةَ إِنِّي أَشْبَهُكُمْ صَلَاةً بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ كَانَ حِينَ يَسْتَخْلِفُهُ مَرْوَانُ عَلَى الْمَدِينَةِ إِذَا قَامَ لِلصَّلَاةِ الْمَكْتُوبَةِ كَبَّرَ فَذَكَرَ نَحْوَ حَدِيثِ ابْنِ جُرَيْجٍ وَفِي حَدِيثِهِ فَإِذَا قَضَاهَا وَسَلَّمَ أَقْبَلَ عَلَى أَهْلِ الْمَسْجِدِ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَشْبَهُكُمْ صَلَاةً بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dari [Abu Bakar bin Abdurrahman] bahwa dia mendengar [Abu Hurairah] berkata, \"Rasulullah apabila mendirikan sholat, maka beliau bertakbir ketika berdiri kemudian bertakbir ketika rukuk kemudian mengucapkan, 'Semoga Allah mendengar orang yang memujinya' ketika mengangkat tulang rusuknya dari rukuk, kemudian dia membaca -dalam keadaan berdiri-, 'Wahai Rabb kami, bagiMu segala puji' kemudian beliau bertakbir ketika turun sujud, kemudian bertakbir ketika mengangkat kepalanya kemudian bertakbir ketika sujud kemudian bertakbir ketika mengangkat kepalanya, kemudian melakukan seperti itu dalam sholat semuanya hingga menyelesaikannya, dan bertakbir ketika berdiri dari rakaat kedua setelah duduk. Kemudian Abu Hurairah berkata, 'aku adalah orang yang paling mirip sholatnya dengan Rasulullah Shallallahu'alaihiwasallam.' Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Hujain] telah menceritakan kepada kami [al-Laits] dari [Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abu Bakar bin Abdurrahman bin al-Harits] bahwa dia mendengar [Abu Hurairah] berkata, \"Rasululah shallallahu 'alaihi wasallam apabila mendirikan sholat, maka bertakbir ketika berdiri\" seperti hadits Ibnu Juraij, namun dia tidak menyebutkan perkataan Abu Hurairah, 'aku adalah orang yang sholatnya paling mirip dengan Rasulullah Shallallahu'alaihiwasallam.' Dan telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahab] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] bahwa [Abu Hurairah] ketika Marwan mengangkatnya sebagai pengganti imam pada Madinah, apabila dia mendirikan sholat wajib maka dia bertakbir. Lalu dia menyebutkan semisal hadits Ibnu Juraij. Dan dalam haditsnya, 'Ketika dia menyelesaikannya dan mengucapkan salam maka dia menghadap penghuni masjid seraya berkata, 'Demi Dzat yang jiwaku berada di TanganNya, aku adalah orang yang paling mirip sholatnya dengan Rasulullah Shallallahu'alaihiwasallam'.\""
            },
            {
                "number": 580,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَكَانَ يُكَبِّرُ فِي الصَّلَاةِ كُلَّمَا رَفَعَ وَوَضَعَ فَقُلْنَا يَا أَبَا هُرَيْرَةَ مَا هَذَا التَّكْبِيرُ قَالَ إِنَّهَا لَصَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mihran ar-Razi] telah menceritakan kepada kami [al-Walid bin Muslim] telah menceritakan kepada kami [al-Auza'i] dari [Yahya bin Abi Katsir] dari [Abu Salamah] bahwa [Abu Hurairah] bertakbir dalam sholat setiap kali mengangkat dan meletakkan, maka kami bertanya, \"Wahai Abu Hurairah, apa takbir ini?\" Dia menjawab, \"Takbir ini adalah sholat Rasulullah Shallallahu'alaihiwasallam.\""
            },
            {
                "number": 581,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّهُ كَانَ يُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ وَيُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'kub, yaitu Ibnu Abdurrahman] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] bahwa dia bertakbir setiap kali turun dan naik, dan dia menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam dahulu melakukan hal tersebut."
            },
            {
                "number": 582,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَخَلَفُ بْنُ هِشَامٍ جَمِيعًا عَنْ حَمَّادٍ قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ غَيْلَانَ عَنْ مُطَرِّفٍ قَالَصَلَّيْتُ أَنَا وَعِمْرَانُ بْنُ حُصَيْنٍ خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَكَانَ إِذَا سَجَدَ كَبَّرَ وَإِذَا رَفَعَ رَأْسَهُ كَبَّرَ وَإِذَا نَهَضَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ فَلَمَّا انْصَرَفْنَا مِنْ الصَّلَاةِ قَالَ أَخَذَ عِمْرَانُ بِيَدِي ثُمَّ قَالَ لَقَدْ صَلَّى بِنَا هَذَا صَلَاةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ قَدْ ذَكَّرَنِي هَذَا صَلَاةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Khalaf bin Hisyam] semuanya dari [Hammad] berkata [Yahya] telah mengabarkan kepada kami [Hammad bin Zaid] dari [Ghailan] dari [Mutharrif] dia berkata, \"Saya sholat bersama [Imran bin Hushain] di belakang Ali bin Abi Thalib, dahulu apabila dia bersujud maka bertakbir, dan apabila mengangkat kepalanya maka dia bertakbir, serta apabila berdiri dari dua raka'at maka dia bertakbir. Lalu ketika kami pulang dari sholat. Dia berkata, 'Imran memegang tanganku kemudian berkata, 'Sungguh orang ini telah mengimami kami dengan sholat Muhammad shallallahu 'alaihi wasallam atau orang ini telah mengingatkanku tentang sholat Muhammad Shallallahu'alaihiwasallam.\""
            },
            {
                "number": 583,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ سُفْيَانَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ مَحْمُودِ بْنِ الرَّبِيعِ عَنْ عُبَادَةَ بْنِ الصَّامِتِيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ لِمَنْ لَمْ يَقْرَأْ بِفَاتِحَةِ الْكِتَابِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Amru an-Naqid] serta [Ishaq bin Ibrahim] semuanya dari [Sufyan] berkata [Abu Bakar] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [az-Zuhri] dari [Mahmud bin ar-Rabi'] dari [Ubadah bin ash-Shamit] menyatakan hadits tersebut marfu' kepada Nabi Shallallahu'alaihiwasallam, \"Tidak sah sholat seseorang yang tidak membaca al-Fatihah.\""
            },
            {
                "number": 584,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ ح و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ لِمَنْ لَمْ يَقْتَرِئْ بِأُمِّ الْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Abu ath-Thahir] telah menceritakan kepada kami [Ibnu Wahab] dari [Yunus] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Harmalah bin Yahya] telah menceritakan kepada kami [Ibnu Wahab] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Mahmud bin ar-Rabi'] dari [Ubadah bin ash-Shamit] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, \"Tidak sah sholat seseorang yang tidak membaca Ummul Qur'an.\""
            },
            {
                "number": 585,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ مَحْمُودَ بْنَ الرَّبِيعِ الَّذِي مَجَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَجْهِهِ مِنْ بِئْرِهِمْ أَخْبَرَهُ أَنَّ عُبَادَةَ بْنَ الصَّامِتِ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا صَلَاةَ لِمَنْ لَمْ يَقْرَأْ بِأُمِّ الْقُرْآنِو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَزَادَ فَصَاعِدًا",
                "id": "Telah menceritakan kepada kami [al-Hasan bin Ali al-Hulwani] telah menceritakan kepada kami [Ya'kub bin Ibrahim bin Sa'ad] telah menceritakan kepada kami [bapakku] dari [Shalih] dari [Ibnu Syihab] bahwa [Mahmud bin ar-Rabi'], -yang Rasulullah shallallahu 'alaihi wasallam pernah menyemprotkan air di wajahnya dari sumur mereka- mengabarkan kepadanya bahwa [Ubadah bin ash-Shamit] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda, \"Tidak sah sholat seseorang yang tidak membaca Ummu Qur'an.\" Dan telah menceritakan kepada kami tentangnya [Ishaq bin Ibrahim] dan [Abd bin Humaid] keduanya berkata, telah mengabarkan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [az-Zuhri] dengan sanad semisalnya, dan menambahkan, \"Atau lebih banyak.\" "
            },
            {
                "number": 586,
                "arab": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى صَلَاةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَهِيَ خِدَاجٌ ثَلَاثًا غَيْرُ تَمَامٍ فَقِيلَ لِأَبِي هُرَيْرَةَ إِنَّا نَكُونُ وَرَاءَ الْإِمَامِ فَقَالَ اقْرَأْ بِهَا فِي نَفْسِكَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ تَعَالَى قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ وَلِعَبْدِي مَا سَأَلَ فَإِذَا قَالَ الْعَبْدُ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ }قَالَ اللَّهُ تَعَالَى حَمِدَنِي عَبْدِي وَإِذَا قَالَ{ الرَّحْمَنِ الرَّحِيمِ }قَالَ اللَّهُ تَعَالَى أَثْنَى عَلَيَّ عَبْدِي وَإِذَا قَالَ{ مَالِكِ يَوْمِ الدِّينِ }قَالَ مَجَّدَنِي عَبْدِي وَقَالَ مَرَّةً فَوَّضَ إِلَيَّ عَبْدِي فَإِذَا قَالَ{ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ }قَالَ هَذَا بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ فَإِذَا قَالَ{ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }قَالَ هَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَقَالَ سُفْيَانُ حَدَّثَنِي بِهِ الْعَلَاءُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ دَخَلْتُ عَلَيْهِ وَهُوَ مَرِيضٌ فِي بَيْتِهِ فَسَأَلْتُهُ أَنَا عَنْهُ حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ أَبَا السَّائِبِ مَوْلَى هِشَامِ بْنِ زُهْرَةَ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي الْعَلَاءُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ أَنَّ أَبَا السَّائِبِ مَوْلَى بَنِي عَبْدِ اللَّهِ بْنِ هِشَامِ بْنِ زُهْرَةَ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى صَلَاةً فَلَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ بِمِثْلِ حَدِيثِ سُفْيَانَ وَفِي حَدِيثِهِمَا قَالَ اللَّهُ تَعَالَى قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ فَنِصْفُهَا لِي وَنِصْفُهَا لِعَبْدِي حَدَّثَنِي أَحْمَدُ بْنُ جَعْفَرٍ الْمَعْقِرِيُّ حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُوَيْسٍ أَخْبَرَنِي الْعَلَاءُ قَالَ سَمِعْتُ مِنْ أَبِي وَمِنْ أَبِي السَّائِبِ وَكَانَا جَلِيسَيْ أَبِي هُرَيْرَةَ قَالَا قَالَ أَبُو هُرَيْرَةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى صَلَاةً لَمْ يَقْرَأْ فِيهَا بِفَاتِحَةِ الْكِتَابِ فَهِيَ خِدَاجٌ يَقُولُهَا ثَلَاثًا بِمِثْلِ حَدِيثِهِمْ",
                "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim al-Hanzhali] telah mengabarkan kepada kami [Sufyan bin Uyainah] dari [al-Ala'] dari [bapaknya] dari [Abu Hurairah] dari Nabi Shallallahu'alaihiwasallam, beliau bersabda, \"Barangsiapa yang mengerjakan sholat tanpa membaca Ummul Qur'an di dalamnya, maka sholatnya masih mempunyai hutang, tidak sempurna\" Tiga kali. Ditanyakan kepada Abu Hurairah, \" Kami berada di belakang imam?\" Maka dia menjawab, \"Bacalah Ummul Qur'an dalam dirimu, karena aku mendengar Rasulullah bersabda, 'Allah berfirman, 'Aku membagi sholat antara Aku dengan hambaKu, dan hambaku mendapatkan sesuatu yang dia minta. Apabila seorang hamba berkata, 'Segala puji bagi Allah Rabb semesta alam.' Maka Allah berkata, 'HambaKu memujiKu.' Apabila hamba tersebut mengucapkan, 'Yang Maha pengasih lagi Maha Penyayang.' Allah berkata, 'HambaKu memujiKu.' Apabila hamba tersebut mengucapkan, 'Pemilik hari kiamat.' Allah berkata, 'HambaKu memujiku.' Selanjutnya Dia berkata, 'HambaKu menyerahkan urusannya kepadaKu.' Apabila hamba tersebut mengucapkan, 'Hanya kepadaMulah aku menyembah dan hanya kepadaMulah aku memohon pertolongan.' Allah berkata, 'Ini adalah antara Aku dengan hambaKu. Dan hambaKu mendapatkan sesuatu yang dia minta'. Apabila hamba tersebut mengucapkan, 'Berilah kami petunjuk jalan yang lurus, yaitu jalan orang-orang yang Engkau beri nikmat atas mereka, bukan jalan orang-orang yang Engkau murkai dan bukan pula orang-orang yang sesat.' Allah berkata, 'Ini untuk hambaKu, dan hambaKu mendapatkan sesuatu yang dia minta'.\" Berkata [Sufyan] telah menceritakan kepada kami [al-Ala' bin Abdurrahman bin Ya'kub] aku mengunjunginya, sedangkan dia dalam keadaan sakit di rumahnya, lalu aku bertanya kepadanya tentang hadits tersebut, telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari [al-Ala' bin Abdurrahman] bahwa dia mendengar [Abu as-Saib, maula Hisyam bin Zuhrah] berkata, saya mendengar [Abu Hurairah] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, --lewat jalur periwayatan lain--, dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepada kami [al-Ala' bin Abdurrahman bin Ya'kub] bahwa [Abu as-Saib, maula bani Abdullah bin Hisyam bin Zuhrah] telah mengabarkan kepadanya bahwa dia mendengar [Abu Hurairah] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, \"Barangsiapa melakukan sholat, dan belum membaca Ummul Qur'an\", sebagaimana hadits Sufyan. Dan dalam hadits keduanya Allah berfirman, 'Aku membagi sholat antara Aku dengan hambaKu dua bagian, setengah untukKu dan setelah lainnya untuk hambaKu.\" Telah menceritakan kepada kami [Ahmad bin Ja'far al-Ma'qiri] telah menceritakan kepada kami [an-Nadhr bin Muhammad] telah menceritakan kepada kami [Abu Uwais] telah mengabarkan kepadaku [al-Ala'] dia berkata, saya mendengar dari [bapakku] dan dari [Abu as-Saib], keduanya adalah teman duduk Abu Hurairah. Keduanya berkata, [Abu Hurairah] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda, \"Barangsiapa yang melakukan sholat yang padanya dia tidak membaca al-Fatihah, maka dia masih mempunyai hutang (kurang).\" Dia mengucapkannya tiga kali seperti hadits mereka."
            },
            {
                "number": 587,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ حَبِيبِ بْنِ الشَّهِيدِ قَالَ سَمِعْتُ عَطَاءً يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا صَلَاةَ إِلَّا بِقِرَاءَةٍقَالَ أَبُو هُرَيْرَةَ فَمَا أَعْلَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْلَنَّاهُ لَكُمْ وَمَا أَخْفَاهُ أَخْفَيْنَاهُ لَكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Abu Usamah] dari [Habib bin asy-Syahid] dia berkata, aku mendengar [Atha'] menceritakan dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda, \"Tidak sah sholat kecuali dengan membaca (al-Fatihah).\" Abu Hurairah berkata, \"Sesuatu yang diumumkan oleh Rasulullah, niscaya kami mengumumkannya kepada kalian. Dan sesuatu yang disembunyikan oleh Rasulullah, niscaya kami menyembunyikannya untuk kalian.\""
            },
            {
                "number": 588,
                "arab": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِعَمْرٍو قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ قَالَ قَالَ أَبُو هُرَيْرَةَفِي كُلِّ الصَّلَاةِ يَقْرَأُ فَمَا أَسْمَعَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْمَعْنَاكُمْ وَمَا أَخْفَى مِنَّا أَخْفَيْنَا مِنْكُمْفَقَالَ لَهُ رَجُلٌ إِنْ لَمْ أَزِدْ عَلَى أُمِّ الْقُرْآنِ فَقَالَ إِنْ زِدْتَ عَلَيْهَا فَهُوَ خَيْرٌ وَإِنْ انْتَهَيْتَ إِلَيْهَا أَجْزَأَتْ عَنْكَ",
                "id": "Telah menceritakan kepada kami [Amru an-Naqid] dan [Zuhair bin Harb] dan lafazh tersebut milik Amru, keduanya berkata, telah menceritakan kepada kami [Ismail bin Ibrahim] telah menceritakan kepada kami [Ibnu Juraij] dari [Atha'] dia berkata, [Abu Hurairah] berkata, \"Dalam setiap sholat dia membaca, maka sesuatu yang diperdengarkan oleh Rasulullah, niscaya kami memperdengarkannya kepada kalian. Dan sesuatu yang disembunyikan oleh Rasulullah, niscaya kami menyembunyikannya untuk kalian.\" Maka seorang laki-laki berkata kepadanya, \"Apabila aku tidak menambahkan pada Ummul Qur'an (dengan surat lainnya)?\" Maka dia menjawab, \"Jika kamu menambahkan padanya, maka itu adalah baik, dan jika kamu berhenti padanya, maka sudah cukup bagimu.\""
            },
            {
                "number": 589,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ عَنْ حَبِيبٍ الْمُعَلِّمِ عَنْ عَطَاءٍ قَالَ قَالَ أَبُو هُرَيْرَةَفِي كُلِّ صَلَاةٍ قِرَاءَةٌ فَمَا أَسْمَعَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْمَعْنَاكُمْ وَمَا أَخْفَى مِنَّا أَخْفَيْنَاهُ مِنْكُمْ وَمَنْ قَرَأَ بِأُمِّ الْكِتَابِ فَقَدْ أَجْزَأَتْ عَنْهُ وَمَنْ زَادَ فَهُوَ أَفْضَلُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Yazid yaitu Ibnu Zurai'] dari [Habib al-Mu'allim] dari ['Atha'] dia berkata, [Abu Hurairah] berkata, \"Dalam setiap sholat terdapat suatu bacaan, maka sesuatu yang diperdengarkan oleh Nabi Shallallahu'alaihiwasallam, niscaya kami memperdengarkannya kepada kalian. Dan sesuatu yang disembunyikan oleh beliau, niscaya kami menyembunyikannya dari kalian, dan barangsiapa yang membaca Umm al-Kitab, maka sungguh telah cukup baginya, dan barangsiapa menambahkan, maka itu adalah lebih baik.\""
            },
            {
                "number": 590,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْمَسْجِدَ فَدَخَلَ رَجُلٌ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّلَامَ قَالَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ فَرَجَعَ الرَّجُلُ فَصَلَّى كَمَا كَانَ صَلَّى ثُمَّ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ السَّلَامُ ثُمَّ قَالَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ حَتَّى فَعَلَ ذَلِكَ ثَلَاثَ مَرَّاتٍ فَقَالَ الرَّجُلُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أُحْسِنُ غَيْرَ هَذَا عَلِّمْنِي قَالَ إِذَا قُمْتَ إِلَى الصَّلَاةِ فَكَبِّرْ ثُمَّ اقْرَأْ مَا تَيَسَّرَ مَعَكَ مِنْ الْقُرْآنِ ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا ثُمَّ افْعَلْ ذَلِكَ فِي صَلَاتِكَ كُلِّهَاحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ فَصَلَّى وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَاحِيَةٍ وَسَاقَا الْحَدِيثَ بِمِثْلِ هَذِهِ الْقِصَّةِ وَزَادَا فِيهِ إِذَا قُمْتَ إِلَى الصَّلَاةِ فَأَسْبِغْ الْوُضُوءَ ثُمَّ اسْتَقْبِلْ الْقِبْلَةَ فَكَبِّرْ",
                "id": "Telah menceritakan kepadaku [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id] dari [ubaidhullah] dia berkata, telah menceritakan kepadaku [Sa'id bin Abi Sa'id] dari [bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam memasuki sebuah masjid, lalu seorang laki-laki masuk, lalu sholat, kemudian dia datang, lalu mengucapkan salam kepada Rasulullah Shallallahu'alaihiwasallam, maka Rasulullah shallallahu 'alaihi wasallam membalas salamnya seraya berkata, 'Kembalilah, lalu sholatlah, karena kamu belum sholat. Lalu laki-laki tersebut kembali, lalu sholat sebagaimana sebelumnya dia sholat, kemudian mendatangi Nabi shallallahu 'alaihi wasallam seraya mengucapkan salam kepada beliau. Maka Rasulullah shallallahu 'alaihi wasallam menjawab, 'Semoga keselamatan terlimpahkan kepadamu' kemudian beliau bersabda lagi, 'Kembalilah dan sholatlah lagi, karena kamu belum sholat', hingga dia melakukan hal tersebut tiga kali. Lalu laki-laki tersebut berkata, 'Demi Dzat yang mengutusmu dengan kebenaran, aku tidak dapat melakukan yang lebih baik selain daripada ini, ajarkanlah kepadaku.' Beliau bersabda, 'Apabila kamu mendirikan sholat, maka bertakbirlah, kemudian bacalah sesuatu yang mudah dari al-qur'an, kemudian ruku'lah hingga bertuma'ninah dalam keadaan ruku'. Kemudian angkatlah (kepalamu dari ruku') hingga lurus berdiri, kemudian sujudlah hingga bertuma'ninah dalam keadaan sujud, kemudian angkatlah hingga bertuma'ninah dalam duduk, kemudian lakukan hal tersebut dalam sholatmu semuanya'.\" Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abu Usamah] dan [Abdullah bin Numair] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] dia berkata, telah menceritakan kepada kami [ubaidhullah] dari [Sa'id bin Abi Sa'id] dari [Abu Hurairah] 'bahwa seorang laki-laki masuk masjid, lalu mendirikan sholat sedangkan Rasulullah shallallahu 'alaihi wasallam di suatu sudut masjid, ' lalu dia membawakan hadits seperti kisah ini, dan dia menambahkan, 'Apabila kamu mendirikan sholat, maka sempurnakanlah wudhu, kemudian menghadaplah kiblat, lalu bertakbirlah'.\""
            },
            {
                "number": 591,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ كِلَاهُمَا عَنْ أَبِي عَوَانَةَ قَالَ سَعِيدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الظُّهْرِ أَوْ الْعَصْرِ فَقَالَ أَيُّكُمْ قَرَأَ خَلْفِي بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى فَقَالَ رَجُلٌ أَنَا وَلَمْ أُرِدْ بِهَا إِلَّا الْخَيْرَ قَالَ قَدْ عَلِمْتُ أَنَّ بَعْضَكُمْ خَالَجَنِيهَا",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Qutaibah bin Sa'id] keduanya meriwayatkan dari [Abu 'Awanah] berkata [Sa'id], telah menceritakan kepada kami [Abu 'awanah] dari [Qatadah] dari [Zurarah bin Aufa] dari [Imran bin Hushain] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan sholat zhuhur atau ashar bersama kami, seraya bersabda, 'Siapakah di antara kalian yang membaca Sabbihisma Rabbikal A'la di belakangku? ' Maka seorang laki-laki berkata, 'Saya (yang membaca), dan saya tidak menginginkannya melainkan kebaikan.' Beliau bersabda, 'Sungguh aku telah mengetahui bahwa sebagian kalian menyelesihiku padanya'.\""
            },
            {
                "number": 592,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى يُحَدِّثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ فَجَعَلَ رَجُلٌ يَقْرَأُ خَلْفَهُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى فَلَمَّا انْصَرَفَ قَالَ أَيُّكُمْ قَرَأَ أَوْ أَيُّكُمْ الْقَارِئُ فَقَالَ رَجُلٌ أَنَا فَقَالَ قَدْ ظَنَنْتُ أَنَّ بَعْضَكُمْ خَالَجَنِيهَاحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كِلَاهُمَا عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ وَقَالَ قَدْ عَلِمْتُ أَنَّ بَعْضَكُمْ خَالَجَنِيهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Muhammad bin Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dia berkata, saya mendengar [Zurarah bin Aufa] bercerita dari [Imran bin Hushain] bahwa Rasulullah shallallahu 'alaihi wasallam melakukan sholat zhuhur, lalu mulailah seorang laki-laki membaca di belakang beliau, 'Sabbihisma Rabbikal A'la', ketika beliau selesai sholat, maka beliau bersabda, 'Siapakah di antara kalian yang membaca atau siapakah di antara kalian pembaca? ' Maka seorang laki-laki menjawab, 'Saya.' Lalu beliau bersabda, 'Aku benar-benar telah menduga bahwa sebagian kalian menyelisihiku padanya'.\" Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ismail bin Ulayyah] --lewat jalur periwayatan lain-- dan Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Ibnu Abi 'Adi] keduanya meriwayatkan dari [Ibnu Abi 'Arubah] dari [Qatadah] dengan isnad ini bahwa Rasulullah shallallahu 'alaihi wasallam sholat dzuhur dan bersabda, \"Sungguh aku mengetahui bahwa sebagian kalian menyelisiku padanya.\""
            },
            {
                "number": 593,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ كِلَاهُمَا عَنْ غُنْدَرٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسٍ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَلَمْ أَسْمَعْ أَحَدًا مِنْهُمْ يَقْرَأُ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ فِي هَذَا الْإِسْنَادِ وَزَادَ قَالَ شُعْبَةُ فَقُلْتُ لِقَتَادَةَ أَسَمِعْتَهُ مِنْ أَنَسٍ قَالَ نَعَمْ وَنَحْنُ سَأَلْنَاهُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar] keduanya meriwayatkan dari [Ghundar] berkata [Ibnu al-Mutsanna], telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata, saya mendengar [Qatadah] bercerita dari [Anas] dia berkata, \"Saya sholat bersama Rasulullah Shallallahu'alaihiwasallam, Abu Bakar, Umar dan Utsman, lalu aku belum pernah mendengar salah seorang dari mereka membaca, 'Bismillahirrahmanirrahim'.\" Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Abu Dawud] telah menceritakan kepada kami [Syu'bah] dalam isnad ini dan menambahkan \"Syu'bah berkata, maka saya berkata kepada [Qatadah], 'Apakah kamu mendengarnya dari [Anas]? ' Dia berkata, 'Ya, dan kami menanyakannya tentangnya'.\""
            },
            {
                "number": 594,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ عَبْدَةَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ كَانَ يَجْهَرُ بِهَؤُلَاءِ الْكَلِمَاتِ يَقُولُ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ تَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرُكَ وَعَنْ قَتَادَةَ أَنَّهُ كَتَبَ إِلَيْهِ يُخْبِرُهُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ حَدَّثَهُقَالَ صَلَّيْتُ خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكَانُوا يَسْتَفْتِحُونَ بِ{ الْحَمْد لِلَّهِ رَبِّ الْعَالَمِينَ }لَا يَذْكُرُونَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فِي أَوَّلِ قِرَاءَةٍ وَلَا فِي آخِرِهَاحَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ أَخْبَرَنِي إِسْحَقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَذْكُرُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mihran ar-Razi] telah menceritakan kepada kami [al-Walid bin Muslim] telah menceritakan kepada kami [al-Auza'i] dari 'Abdah bahwa Umar bin al-Khaththab dahulu mengeraskan (bacaan) kalimat-kalimat tersebut. Dia membaca, \"SUBHAANAKALLOOHUMMA, WABIHAMDIKA TABAAROKA ISMUKA WATA'AALAA JADDUKA WALAA ILAAHA GHOIRUKA.\" Ya Allah, Mahasuci Engkau dan dengan memujimu, Mahaberkah NamaMu, Mahaluhur kemuliaanMu, tidak ada tuhan (yang berhak disembah) selain Engkau.\" Dan dari [Qatadah] bahwa dia menulis kepadanya mengabarkan dari [Anas bin Malik] bahwa dia menceritakan kepadanya, dia berkata, \"Saya sholat di belakang Nabi Shallallahu'alaihiwasallam, Abu Bakar, Umar, dan Utsman, maka mereka memulai membaca iftitah dengan, 'Alhamdulillahi Rabb al-Alamin (Segala puji bagi Allah, Rabb semesta alam).' Mereka tidak menyebutkan, 'Bismillahirrahmanirrahim (dengan menyebut nama Allah Yang Maha Pengasih lagi Maha Penyayang) pada awal bacaan, dan tidak pada akhirnya.\" Telah menceritakan kepada kami [Muhammad bin Mihran] telah menceritakan kepada kami [al-Walid bin Muslim] dari [al-Auza'i] telah mengabarkan kepadaku [Ishaq bin Abdullah bin Abi Thalhah] bahwasanya dia mendengar [Anas bin Malik] menyebutkan hal tersebut."
            },
            {
                "number": 595,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ أَخْبَرَنَا الْمُخْتَارُ بْنُ فُلْفُلٍ عَنْ أَنَسِ بْنِ مَالِكٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لَهُ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْمُخْتَارِ عَنْ أَنَسٍ قَالَبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ بَيْنَ أَظْهُرِنَا إِذْ أَغْفَى إِغْفَاءَةً ثُمَّ رَفَعَ رَأْسَهُ مُتَبَسِّمًا فَقُلْنَا مَا أَضْحَكَكَ يَا رَسُولَ اللَّهِ قَالَ أُنْزِلَتْ عَلَيَّ آنِفًا سُورَةٌ فَقَرَأَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ{ إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ فَصَلِّ لِرَبِّكَ وَانْحَرْ إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ }ثُمَّ قَالَ أَتَدْرُونَ مَا الْكَوْثَرُ فَقُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّهُ نَهْرٌ وَعَدَنِيهِ رَبِّي عَزَّ وَجَلَّ عَلَيْهِ خَيْرٌ كَثِيرٌ هُوَ حَوْضٌ تَرِدُ عَلَيْهِ أُمَّتِي يَوْمَ الْقِيَامَةِ آنِيَتُهُ عَدَدُ النُّجُومِ فَيُخْتَلَجُ الْعَبْدُ مِنْهُمْ فَأَقُولُ رَبِّ إِنَّهُ مِنْ أُمَّتِي فَيَقُولُ مَا تَدْرِي مَا أَحْدَثَتْ بَعْدَكَزَادَ ابْنُ حُجْرٍ فِي حَدِيثِهِ بَيْنَ أَظْهُرِنَا فِي الْمَسْجِدِ وَقَالَ مَا أَحْدَثَ بَعْدَكَ حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا ابْنُ فُضَيْلٍ عَنْ مُخْتَارِ بْنِ فُلْفُلٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُا أَغْفَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِغْفَاءَةً بِنَحْوِ حَدِيثِ ابْنِ مُسْهِرٍ غَيْرَ أَنَّهُ قَالَ نَهْرٌ وَعَدَنِيهِ رَبِّي عَزَّ وَجَلَّ فِي الْجَنَّةِ عَلَيْهِ حَوْضٌ وَلَمْ يَذْكُرْ آنِيَتُهُ عَدَدُ النُّجُومِ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr as-Sa'di] telah menceritakan kepada kami [Ali bin Mushir] telah mengabarkan kepada kami [al-Mukhtar bin Fulful] dari [Anas bin Malik] --lewat jalur periwayatan lain-- dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] sedangkan lafazh tersebut miliknya, telah menceritakan kepada kami [Ali bin Mushir] dari [al-Mukhtar] dari [Anas] dia berkata, \"Pada suatu hari ketika Rasulullah di antara kami, tiba-tiba beliau tertidur, kemudian mengangkat kepalanya dalam keadaan tersenyum, maka kami bertanya, 'Apa yang membuatmu tertawa wahai Rasulullah? ' Beliau menjawab, 'Baru saja diturunkan kepadaku suatu surat, lalu beliau membaca, 'Bismillahirrahmanirrahim, Inna A'thainaka al-Kautsar Fashalli Lirabbika Wanhar, Inna Syani'aka Huwa al-Abtar, ' kemudian beliau berkata, 'Apakah kalian tahu, apakah al-Kautsar itu? ' Kami menjawab, 'Allah dan RasulNya lebih tahu.' Beliau bersabda, 'Ia adalah sungai yang dijanjikan oleh Rabbku kepadaku. Padanya terdapat kebaikan yang banyak. Ia adalah telaga yang umatku menemuiku pada hari kiamat, wadahnya sebanyak jumlah bintang, lalu seorang hamba dari umatku terhalang darinya, maka aku berkata, 'Wahai Rabbku, sesungguhnya dia termasuk umatku', maka Allah berkata, 'Kamu tidak tahu sesuatu yang terjadi setelah (meninggalmu) '.\" Ibnu Hujr menambahkan dalam haditsnya, \"Di antara kami dalam masjid.\" Dan kalimat, \"Allah berfirman, 'Sesuatu yang terjadi setelah meninggalmu'.\" Telah menceritakan kepada kami [Abu Kuraib Muhammad bin al-'Ala] telah mengabarkan kepada kami [Ibnu Fudhail] dari [Mukhtar bin Fulful] dia berkata, \"Saya mendengar [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam tidur\", sebagaimana hadits Ibnu Mushir, hanya saja dia berkata, 'Sungai yang dijanjikan oleh Rabbku di surga, padanya terdapat telaga, ' dan dia tidak menyebutkan, 'Wadahnya sebanyak jumlah bintang'.\""
            },
            {
                "number": 596,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ وَائِلٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ وَمَوْلًى لَهُمْ أَنَّهُمَا حَدَّثَاهُ عَنْ أَبِيهِ وَائِلِ بْنِ حُجْرٍأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَفَعَ يَدَيْهِ حِينَ دَخَلَ فِي الصَّلَاةِ كَبَّرَ وَصَفَ هَمَّامٌ حِيَالَ أُذُنَيْهِ ثُمَّ الْتَحَفَ بِثَوْبِهِ ثُمَّ وَضَعَ يَدَهُ الْيُمْنَى عَلَى الْيُسْرَى فَلَمَّا أَرَادَ أَنْ يَرْكَعَ أَخْرَجَ يَدَيْهِ مِنْ الثَّوْبِ ثُمَّ رَفَعَهُمَا ثُمَّ كَبَّرَ فَرَكَعَ فَلَمَّا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَفَعَ يَدَيْهِ فَلَمَّا سَجَدَ سَجَدَ بَيْنَ كَفَّيْهِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Affan] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Muhammad bin Juhadah] telah menceritakan kepadaku [Abdul Jabbar bin Wail] dari [Alqamah bin Wail] dan [maula milik mereka] bahwa keduanya telah menceritakannya dari [bapaknya, Wail bin Hujr] \"Bahwasanya dia melihat Nabi shallallahu 'alaihi wasallam mengangkat kedua tangannya ketika masuk sholat, bertakbir.\" Hammam menggambarkannya, \"Di hadapan kedua telinganya, kemudian melipatnya pada bajunya kemudian meletakkan tangan kanannya di atas tangan kirinya. Ketika dia ingin rukuk, maka beliau mengeluarkan kedua tangannya dari bajunya, kemudian mengangkat keduanya, kemudian bertakbir, lalu rukuk. Ketika beliau mengucapkan, 'Samiallahu Liman Hamidahu' maka beliau mengangkat kedua tangannya. Ketika beliau sujud, maka beliau sujud di antara kedua telapak tangannya.\""
            }
        ]
    }
}