{
    "status": true,
    "data": {
        "start": 2534,
        "end": 2682,
        "total": 149,
        "book": "muslim",
        "hadits": [
            {
                "number": 2534,
                "arab": "و حَدَّثَنَاه مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ عَنْ أَبِي إِسْحَقَ قَالَ كُنْتُ مَعَ الْأَسْوَدِ بْنِ يَزِيدَ جَالِسًا فِي الْمَسْجِدِ الْأَعْظَمِ وَمَعَنَا الشَّعْبِيُّ فَحَدَّثَ الشَّعْبِيُّ بِحَدِيثِ فَاطِمَةَ بِنْتِ قَيْسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَجْعَلْ لَهَا سُكْنَى وَلَا نَفَقَةً ثُمَّ أَخَذَ الْأَسْوَدُ كَفًّا مِنْ حَصًى فَحَصَبَهُ بِهِ فَقَالَ وَيْلَكَ تُحَدِّثُ بِمِثْلِ هَذَا قَالَ عُمَرُ لَا نَتْرُكُ كِتَابَ اللَّهِ وَسُنَّةَ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِقَوْلِ امْرَأَةٍ لَا نَدْرِي لَعَلَّهَا حَفِظَتْ أَوْ نَسِيَتْ لَهَا السُّكْنَى وَالنَّفَقَةُ قَالَ اللَّهُ عَزَّ وَجَلَّ{ لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ }و حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا سُلَيْمَانُ بْنُ مُعَاذٍ عَنْ أَبِي إِسْحَقَ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ أَبِي أَحْمَدَ عَنْ عَمَّارِ بْنِ رُزَيْقٍ بِقِصَّتِهِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Amru bin Jabalah] telah menceritakan kepada kami [Abu Ahmad] telah menceritakan kepada kami [Ammar bin Ruzaiq] dari [Abu Ishaq] dia berkata; Saya pernah duduk di Masjid Jami' bersama Al Aswad bin Yazid dan juga As Sya'bi, lalu [As Sya'bi] menceritakan hadits [Fathimah binti Qais], bahwa Rasulullah shallallahu 'alaihi wasallam tidak menjadikan hak tempat tinggal dan nafkah untuknya. Kemudian Al Aswad mengambil segenggam kerikil dan melemparnya sambil berkata; Celaka kamu, kenapa kamu menceritakan seperti ini? Umar telah berkata; Saya tidak akan meninggalkan Kitabullah dan Sunnah Nabi shallallahu 'alaihi wasallam karena perkataan seorang wanita, kita tidak tahu, bisa saja dia benar-benar hafal atau memang dia itu lupa, sebenarnya dia masih berhak mendapatkan nafkah dan tempat tinggal, kerena Allah Azza Wa Jalla telah berfirman: \"Janganlah kamu keluarkan mereka dari rumah mereka dan janganlah mereka (diizinkan) keluar kecuali kalau mereka mengerjakan perbuatan keji yang terang.\" Dan telah menceritakan kepada kami [Ahmad bin Abdah Ad Dlabi] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Sulaiman bin Ma'adz] dari [Abu Ishaq] dengan isnad ini sebagaimana hadits Abu Ahmad dari 'Ammar bin Zuraiq dengan alur ceritanya."
            },
            {
                "number": 2535,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ بْنِ صُخَيْرٍ الْعَدَوِيِّ قَالَ سَمِعْتُ فَاطِمَةَ بِنْتَ قَيْسٍ تَقُولُإِنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا فَلَمْ يَجْعَلْ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُكْنَى وَلَا نَفَقَةً قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَلْتِ فَآذِنِينِي فَآذَنْتُهُ فَخَطَبَهَا مُعَاوِيَةُ وَأَبُو جَهْمٍ وَأُسَامَةُ بْنُ زَيْدٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا مُعَاوِيَةُ فَرَجُلٌ تَرِبٌ لَا مَالَ لَهُ وَأَمَّا أَبُو جَهْمٍ فَرَجُلٌ ضَرَّابٌ لِلنِّسَاءِ وَلَكِنْ أُسَامَةُ بْنُ زَيْدٍ فَقَالَتْ بِيَدِهَا هَكَذَا أُسَامَةُ أُسَامَةُ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَاعَةُ اللَّهِ وَطَاعَةُ رَسُولِهِ خَيْرٌ لَكِ قَالَتْ فَتَزَوَّجْتُهُ فَاغْتَبَطْتُ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Abu Bakar bin Abi Jahm bin Shuhair Al Adawi] dia berkata; Saya mendengar [Fathimah binti Qais] -Bahwa suaminya telah menceraikannya dengan talak tiga, maka Rasulullah shallallahu 'alaihi wasallam pun tidak menjadikan untuknya nafkah dan tempat tinggal- dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Jika kamu telah halal (selesai masa iddah), maka beritahukanlah kepadaku.\" Setelah masa iddahku selesai, saya memberitahukan kepada beliau. Tidak lama kemudian Mu'awiyah, Abu Jahm, dan Usamah bin Zaid datang melamarnya, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mu'awiyah adalah orang yang miskin harta, sedangkan Abu Jahm suka memukul wanita, sebaiknya kamu memilih Usamah.\" Maka Fathimah mengelak dan berisyarat dengan tangannya tanda tidak setuju, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"taat kepada Allah dan Rasul-Nya adalah lebih baik bagimu.\" Fathimah berkata; Kemudian saya menikah dengan Usamah, ternyata saya bahagia."
            },
            {
                "number": 2536,
                "arab": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ قَالَ سَمِعْتُ فَاطِمَةَ بِنْتَ قَيْسٍ تَقُولُأَرْسَلَ إِلَيَّ زَوْجِي أَبُو عَمْرِو بْنُ حَفْصِ بْنِ الْمُغِيرَةِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ بِطَلَاقِي وَأَرْسَلَ مَعَهُ بِخَمْسَةِ آصُعِ تَمْرٍ وَخَمْسَةِ آصُعِ شَعِيرٍ فَقُلْتُ أَمَا لِي نَفَقَةٌ إِلَّا هَذَا وَلَا أَعْتَدُّ فِي مَنْزِلِكُمْ قَالَ لَا قَالَتْ فَشَدَدْتُ عَلَيَّ ثِيَابِي وَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَمْ طَلَّقَكِ قُلْتُ ثَلَاثًا قَالَ صَدَقَ لَيْسَ لَكِ نَفَقَةٌ اعْتَدِّي فِي بَيْتِ ابْنِ عَمِّكِ ابْنِ أُمِّ مَكْتُومٍ فَإِنَّهُ ضَرِيرُ الْبَصَرِ تُلْقِي ثَوْبَكِ عِنْدَهُ فَإِذَا انْقَضَتْ عِدَّتُكِ فَآذِنِينِي قَالَتْ فَخَطَبَنِي خُطَّابٌ مِنْهُمْ مُعَاوِيَةُ وَأَبُو الْجَهْمِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مُعَاوِيَةَ تَرِبٌ خَفِيفُ الْحَالِ وَأَبُو الْجَهْمِ مِنْهُ شِدَّةٌ عَلَى النِّسَاءِ أَوْ يَضْرِبُ النِّسَاءَ أَوْ نَحْوَ هَذَا وَلَكِنْ عَلَيْكِ بِأُسَامَةَ بْنِ زَيْدٍو حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو عَاصِمٍ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي الْجَهْمِ قَالَ دَخَلْتُ أَنَا وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ فَسَأَلْنَاهَا فَقَالَتْ كُنْتُ عِنْدَ أَبِي عَمْرِو بْنِ حَفْصِ بْنِ الْمُغِيرَةِ فَخَرَجَ فِي غَزْوَةِ نَجْرَانَ وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ ابْنِ مَهْدِيٍّ وَزَادَ قَالَتْ فَتَزَوَّجْتُهُ فَشَرَّفَنِي اللَّهُ بِأَبِي زَيْدٍ وَكَرَّمَنِي اللَّهُ بِأَبِي زَيْدٍ و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ حَدَّثَنِي أَبُو بَكْرٍ قَالَ دَخَلْتُ أَنَا وَأَبُو سَلَمَةَ عَلَى فَاطِمَةَ بِنْتِ قَيْسٍ زَمَنَ ابْنِ الزُّبَيْرِ فَحَدَّثَتْنَا أَنَّ زَوْجَهَا طَلَّقَهَا طَلَاقًا بَاتًّا بِنَحْوِ حَدِيثِ سُفْيَانَ",
                "id": "Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Abu Bakar bin Abu Al Jahm] dia berkata; Saya mendengar [Fathimah binti Qais] berkata; Suatu hari suamiku, yaitu Abu Amru bin Hafsh bin Al Mughirah mengutus Ayyasy bin Abi Rabi'ah untuk menceraikanku dengan membawa lima sha' kurma dan lima sha' gandum. Maka saya berkata; \"Saya hanya diberi nafkah segini, tidakkah kamu mengizinkanku menunggu masa iddah di rumah kalian?\" Ayyash menjawab; \"Tidak.\" Fathimah melanjutnya ceritanya; Kemudian saya mengenakan bajuku dan bergegas menemui Rasulullah shallallahu 'alaihi wasallam. Beliau bertanya: \"Sudah berapa kali dia menceraikanmu?\" Saya menjawab; \"Tiga kali.\" Beliau bersabda: \"Dia benar, memang kamu tidak berhak lagi mendapatkan nafkah darinya, oleh karena itu, tunggulah masa iddahmu di tempat anak pamanmu yaitu Ibnu Ummi Maktum, sebab dia telah buta sehingga kamu bebas apabila hendak menanggalkan pakaianmu, jika telah berakhir masa iddahmu, maka beritahukanlah kepadaku.\" Fathimah berkata; Tidak lama kemudian, beberapa orang melamarku, di antaranya adalah Mu'awiyah dan Abu Jahm. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Mu'awiyah adalah orang yang susah sedangkan Abu Jahm adalah orang yang keras terhadap wanita atau suka mukul wanita atau berkata seperti itu, akan tetapi menikahlah dengan Usamah bin Zaid.\" Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah mengabarkan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Sufyan Ats Tsauri] telah menceritakan kepadaku [Abu Bakar bin Abi Jahm] dia berkata; Saya dan Abu Salamah bin Abdirrahman menemui [Fathimah binti Qais] dan bertanya kepadanya. Dia menceritakan; Mulanya saya adalah istri Abu 'Amru bin Hafsh bin Mughirah, kemudian dia pergi berperang pada perang Najran…, kemudian dia meneruskan hadits tersebut seperti hadits Ibnu Mahdi, namun dia menambahkan; Fathimah berkata; Kemudian saya menikah dengannya, maka Allah memuliakanku dengan Abu Zaid.\" Dan telah menceritakan kepada kami [Ubaidillah bin Mu'adz Al 'Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepadaku [Abu Bakar] dia berkata; Saya dan Abu Salamah menemui [Fathimah binti Qais] ketika pemerintahan Ibnu Zubair, kemudian dia menceritakan kepada kami bahwa suaminya pernah menceraikannya dengan talak tiga…, seperti hadits Sufyan."
            },
            {
                "number": 2537,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ وَاللَّفْظُ لَهُ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاطُلِّقَتْ خَالَتِي فَأَرَادَتْ أَنْ تَجُدَّ نَخْلَهَا فَزَجَرَهَا رَجُلٌ أَنْ تَخْرُجَ فَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَلَى فَجُدِّي نَخْلَكِ فَإِنَّكِ عَسَى أَنْ تَصَدَّقِي أَوْ تَفْعَلِي مَعْرُوفًا",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Hatim bin Maimun] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] dan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] dan dari jalur lain, telah menceritakan kepadaku [Harun bin Abdullah] sedangkan lafazhnya dari dia, telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata; [Ibnu Juraij] berkata; Telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia pernah mendengar [Jabir bin Abdullah] berkata; \"Bibiku dicerai oleh suaminya, lalu dia ingin memetik buah kurma, namun dia dilarang oleh seorang laki-laki untuk keluar rumah.\" Setelah itu istriku mendatangi Rasulullah shallallahu 'alaihi wasallam untuk menanyakan hal itu, maka Rasulullah shallallahu 'alaihi wasallam menjawab; \"Ya, boleh! Petiklah buah kurmamu, semoga kamu dapat bersedekah atau berbuat kebajikan.\" "
            },
            {
                "number": 2538,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى وَتَقَارَبَا فِي اللَّفْظِ قَالَ حَرْمَلَةُ حَدَّثَنَا و قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ أَبَاهُ كَتَبَ إِلَى عُمَرَ بْنِ عَبْدِ اللَّهِ بْنِ الْأَرْقَمِ الزُّهْرِيِّيَأْمُرُهُ أَنْ يَدْخُلَ عَلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ الْأَسْلَمِيَّةِ فَيَسْأَلَهَا عَنْ حَدِيثِهَا وَعَمَّا قَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ اسْتَفْتَتْهُ فَكَتَبَ عُمَرُ بْنُ عَبْدِ اللَّهِ إِلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ يُخْبِرُهُ أَنَّ سُبَيْعَةَ أَخْبَرَتْهُ أَنَّهَا كَانَتْ تَحْتَ سَعْدِ بْنِ خَوْلَةَ وَهُوَ فِي بَنِي عَامِرِ بْنِ لُؤَيٍّ وَكَانَ مِمَّنْ شَهِدَ بَدْرًا فَتُوُفِّيَ عَنْهَا فِي حَجَّةِ الْوَدَاعِ وَهِيَ حَامِلٌ فَلَمْ تَنْشَبْ أَنْ وَضَعَتْ حَمْلَهَا بَعْدَ وَفَاتِهِ فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا تَجَمَّلَتْ لِلْخُطَّابِ فَدَخَلَ عَلَيْهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ رَجُلٌ مِنْ بَنِي عَبْدِ الدَّارِ فَقَالَ لَهَا مَا لِي أَرَاكِ مُتَجَمِّلَةً لَعَلَّكِ تَرْجِينَ النِّكَاحَ إِنَّكِ وَاللَّهِ مَا أَنْتِ بِنَاكِحٍ حَتَّى تَمُرَّ عَلَيْكِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ قَالَتْ سُبَيْعَةُ فَلَمَّا قَالَ لِي ذَلِكَ جَمَعْتُ عَلَيَّ ثِيَابِي حِينَ أَمْسَيْتُ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُهُ عَنْ ذَلِكَ فَأَفْتَانِي بِأَنِّي قَدْ حَلَلْتُ حِينَ وَضَعْتُ حَمْلِي وَأَمَرَنِي بِالتَّزَوُّجِ إِنْ بَدَا لِيقَالَ ابْنُ شِهَابٍ فَلَا أَرَى بَأْسًا أَنْ تَتَزَوَّجَ حِينَ وَضَعَتْ وَإِنْ كَانَتْ فِي دَمِهَا غَيْرَ أَنْ لَا يَقْرَبُهَا زَوْجُهَا حَتَّى تَطْهُرَ",
                "id": "Telah menceritakan kepada kami [Abu Ath Thahir] dan [Harmalah bin Yahya] sedangkan lafazh haditsnya hampir sama, Harmalah mengatakan; Telah menceritakan kepada kami, sedangkan Abu Thahir mengatakan; Telah mengabarkan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] telah menceritakan kepadaku [ubaidhullah bin Abdillah bin 'Utbah bin Mas'ud] bahwa [ayahnya] pernah menulis kepada [Umar bin Abdullah bin Arqam Az Zuhri] dan memerintahkannya untuk menemui [Subai'ah binti Al Harits Al Aslamiyah] untuk menanyakan tentang riwayat haditsnya dan mengenai permasalahan apa Rasulullah shallallahu 'alaihi wasallam pernah bersabda kepadanya ketika dia meminta fatwa. Umar bin Abdillah menulis surat kepada Abdullah bin 'Utbah dan mengabarkan kepadanya bahwa Suba'iah pernah mengabarkan kepadanya; Bahwa dia adalah istri Sa'ad bin Khaulah dari suku 'Amir bin Lu'ai. Sedangkan Sa'ad adalah salah seorang sahabat yang ikut berperang dalam peperangan Badar, dia meninggal dunia ketika Haji Wada' di saat istrinya hamil tua. Beberapa hari setelah dia wafat, istrinya pun melahirkan. Setelah istrinya suci dari nifas, dia pun berhias diri karena mengharap supaya dia dilamar orang. Tidak lama kemudian datanglah Abu Sanabil bin Ba'kak -seorang laki-laki dari Bani Abdid Dar- dia berkata kepadanya; \"Saya melihatmu berhias diri, barang kali kamu berharap untuk menikah lagi. Demi Allah, kamu belum boleh menikah lagi sebelum lewat empat bulan sepuluh hari.\" Kata Subai'ah; Setelah dia berkata demikian kepadaku, lalu saya langsung mengenakan pakaianku dan pergi menemui Rasulullah shallallahu 'alaihi wasallam, kutanyakan masalah tersebut kepada beliau. Kemudian beliau berfatwa kepadaku bahwa sebenarnya saya sudah halal untuk menikah setelah melahirkan anakku, bahkan beliau menyuruhku menikah lagi jika saya berkenan. Ibnu Syihab mengatakan; \"Maka saya berpendapat bolehnya seorang wanita menikah setelah melahirkan, meskipun ia masih mengeluarkan darah, asal suaminya tidak menyetubuhinya hingga ia suci.\""
            },
            {
                "number": 2539,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ أَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ وَابْنَ عَبَّاسٍ اجْتَمَعَا عِنْدَ أَبِي هُرَيْرَةَ وَهُمَا يَذْكُرَانِ الْمَرْأَةَ تُنْفَسُ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَقَالَ ابْنُ عَبَّاسٍ عِدَّتُهَا آخِرُ الْأَجَلَيْنِ وَقَالَ أَبُو سَلَمَةَ قَدْ حَلَّتْ فَجَعَلَا يَتَنَازَعَانِ ذَلِكَ قَالَ فَقَالَ أَبُو هُرَيْرَةَ أَنَا مَعَ ابْنِ أَخِي يَعْنِي أَبَا سَلَمَةَ فَبَعَثُوا كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ إِلَى أُمِّ سَلَمَةَيَسْأَلُهَا عَنْ ذَلِكَ فَجَاءَهُمْ فَأَخْبَرَهُمْ أَنَّ أُمَّ سَلَمَةَ قَالَتْ إِنَّ سُبَيْعَةَ الْأَسْلَمِيَّةَ نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ وَإِنَّهَا ذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَتَزَوَّجَو حَدَّثَنَاه مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ كِلَاهُمَا عَنْ يَحْيَى بْنِ سَعِيدٍ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ اللَّيْثَ قَالَ فِي حَدِيثِهِ فَأَرْسَلُوا إِلَى أُمِّ سَلَمَةَ وَلَمْ يُسَمِّ كُرَيْبًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna Al 'Anazi] telah menceritakan kepada kami [Abdul Wahab] dia berkata; Saya telah mendengar [Yahya bin Sa'id] telah mengabarkan kepadaku [Sulaiman bin Yasar] bahwa Abu Salamah bin Abdurrahman dan Ibnu Abbas berkumpul bersama Abu Hurairah, sedangkan keduanya menyebutkan mengenai seorang wanita yang melahirkan, setelah kematian suaminya beberapa malam, maka Ibnu Abbas mengatakan; \"Iddahnya adalah akhir dari dua masa (yaitu masa iddah dan kelahiran).\" Sedangkan Abu Salamah mengatakan; \"Iddahnya telah selesai karena kelahiran.\" Maka keduanya saling bersengketa mengenai masalah tersebut. Maka Abu Hurairah berkata; \"Saya dan anak saudaraku yaitu Abu Salamah akhirnya mengutus [Kuraib] mantan sahaya Ibnu Abbas untuk menemui [Ummu Salamah] dan menanyakan permasalahan tersebut, tidak lama kemudian Kuraib kembali kepada mereka dan memberitahukan bahwa Ummu Salamah berkata; \"Sesungguhnya Subai'ah Al Aslamiyah pernah melahirkan setelah kematian suaminya beberapa hari, kemudian dia memberitahukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, dan beliau menyuruhnya menikah.\" Dan telah menceritakan kepada kami [Muhammad bin Rumh] telah menceritakan kepada kami [Al Laits]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Amru An Naqid] keduanya berkata; Telah menceritakan kepada kami [Yazid bin Harun] keduanya dari [Yahya bin Sa'id] dengan isnad ini namun dalam haditsnya Al Laits mengatakan; \"Kemudian mereka mengutusnya untuk menemui Ummu Salamah.\" Tidak [menyebutkan nama] Kuraib."
            },
            {
                "number": 2540,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ حُمَيْدِ بْنِ نَافِعٍ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ أَنَّهَا أَخْبَرَتْهُ هَذِهِ الْأَحَادِيثَ الثَّلَاثَةَ قَالَقَالَتْ زَيْنَبُ دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَ أَبُوهَا أَبُو سُفْيَانَ فَدَعَتْ أُمُّ حَبِيبَةَ بِطِيبٍ فِيهِ صُفْرَةٌ خَلُوقٌ أَوْ غَيْرُهُ فَدَهَنَتْ مِنْهُ جَارِيَةً ثُمَّ مَسَّتْ بِعَارِضَيْهَا ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di depan [Malik] dari [Abdullah bin Abu Bakar] dari [Humaid bin Nafi'] dari [Zaenab binti Abi Salamah] bahwa dirinya telah mengabarkan kepadanya tentang ketiga hadits ini, Humaid berkata; Zaenab mengatakan; Saya pernah menemui [Ummu Habibah] istri Nabi shallallahu 'alaihi wasallam sesaat setelah ayahnya yaitu Abu Sufyan meninggal dunia, kemudian Ummu Habibah meminta untuk diambilkan khuluq (yaitu sejenis wewangian yang berwarna kuning), atau yang sejenis itu, kemudian dia meminyaki budak perempuannya dan mengolesi kedua pelipisnya sendiri, lalu dia berkata; \"Demi Allah, sebenarnya saya tidak membutuhkan wewangian ini, kalaulah bukan karena saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir melakukan ihdad (berkabung dengan meninggalkan berhias) terhadap mayyit melebihi tiga hari, kecuali kematian suaminya yaitu empat bulan sepuluh hari.\" "
            },
            {
                "number": 2541,
                "arab": "قَالَتْ زَيْنَبُثُمَّ دَخَلْتُ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا فَدَعَتْ بِطِيبٍ فَمَسَّتْ مِنْهُ ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di depan [Malik] dari [Abdullah bin Abu Bakar] dari [Humaid bin Nafi'] dari [Zaenab] berkata; Kemudian saya menemui [Zaenab binti Jahsy] ketika dia ditinggal wafat oleh saudaranya, lantas dia meminta diambilkan wewangian dan meminyai dirinya, kemudian dia berkata; \"Demi Allah, sebenarnya saya tidak membutuhkan wewangian seperti ini, hanya saja saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir melakukan ihdad atas mayyit melebih tiga hari, kecuali karena kematian suaminya yaitu empat bulan sepuluh hari.\""
            },
            {
                "number": 2542,
                "arab": "قَالَتْ زَيْنَبُ سَمِعْتُ أُمِّي أُمَّ سَلَمَةَ تَقُولُجَاءَتْ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَقَدْ اشْتَكَتْ عَيْنُهَا أَفَنَكْحُلُهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا مَرَّتَيْنِ أَوْ ثَلَاثًا كُلَّ ذَلِكَ يَقُولُ لَا ثُمَّ قَالَ إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ وَقَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِقَالَ حُمَيْدٌ قُلْتُ لِزَيْنَبَوَمَا تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ فَقَالَتْ زَيْنَبُ كَانَتْ الْمَرْأَةُ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا دَخَلَتْ حِفْشًا وَلَبِسَتْ شَرَّ ثِيَابِهَا وَلَمْ تَمَسَّ طِيبًا وَلَا شَيْئًا حَتَّى تَمُرَّ بِهَا سَنَةٌ ثُمَّ تُؤْتَى بِدَابَّةٍ حِمَارٍ أَوْ شَاةٍ أَوْ طَيْرٍ فَتَفْتَضُّ بِهِ فَقَلَّمَا تَفْتَضُّ بِشَيْءٍ إِلَّا مَاتَ ثُمَّ تَخْرُجُ فَتُعْطَى بَعْرَةً فَتَرْمِي بِهَا ثُمَّ تُرَاجِعُ بَعْدُ مَا شَاءَتْ مِنْ طِيبٍ أَوْ غَيْرِهِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di depan [Malik] dari [Abdullah bin Abu Bakar] dari [Humaid bin Nafi'] dari [Zaenab] berkata; Saya mendengar [Ibuku yaitu Ummu Salamah] berkata; Seorang wanita datang kepada Rasulullah shallallahu 'alaihi wasallam sambil berkata; \"Wahai Rasulullah, sesungguhnya anak perempuanku telah ditinggal wafat oleh suaminya, hingga matanya menjadi bengkak, bolehkan saya mencelakinya?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak boleh, \" beliau mengucapkan sampai dua kali atau tiga kali. Dengan mengatakan: \"Tidak boleh, hal itu hanya di perbolehkan setelah empat bulan sepuluh hari, sungguh di masa Jahiliyah salah seorang dari kalian ada yang melemparkan kotoran di penghujung tahun.\" Humaid mengatakan; Saya bertanya kepada Zainab; Kenapa dia melemparkan kotoran di penghujung tahun?.\" Maka Zainab menjawab; \"Dulu seorang perempuan apabila suaminya meninggal, dia tidak keluar rumah dan mengenakan pakaian yang jelek-jelek serta tidak memakai wewangian ataupun perhiasan apapun sampai setahun lamanya. Setelah itu, perempuan tersebut diberi seekor hewan-keledai, kambing atau burung- lalu dia menjatuhkan sesuatu pada hewan tersebut sampai hewan tersebut kebanyakan mati, setelah itu perempuan tersebut diberi kotoran hewan, kemudian dia melemparkannya. Setelah itu dia diperkenankan memakai wewangian yang ia suka atau selainnya."
            },
            {
                "number": 2543,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ قَالَ سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ قَالَتْ تُوُفِّيَ حَمِيمٌ لِأُمِّ حَبِيبَةَ فَدَعَتْ بِصُفْرَةٍ فَمَسَحَتْهُ بِذِرَاعَيْهَاوَقَالَتْ إِنَّمَا أَصْنَعُ هَذَا لِأَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًاوَحَدَّثَتْهُ زَيْنَبُ عَنْ أُمِّهَا وَعَنْ زَيْنَبَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ عَنْ امْرَأَةٍ مِنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Humaid bin Nafi'] dia berkata; Saya mendengar [Zaenab binti Ummu Salamah] berkata; [Saudara Ummu Habibah] telah meninggal dunia, kemudian dia meminta diambilkan shufrah (sejenis tumbuhan), dan mengolesi kedua hastanya, lalu dia berkata; \"Saya melakukan hal ini karena saya penah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal seorang wanita yang beriman kepada Allah dan Hari Akhir melakukan ihdad melebihi tiga hari kecuali karena kematian suaminya, yaitu empat bulan sepuluh hari.\" Dan [Zainab] telah bercerita dari [ibunya] dan dari [Zainab] istri Rasulullah shallallahu 'alaihi wasallam atau dari salah seorang istri Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 2544,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ قَالَ سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ تُحَدِّثُ عَنْ أُمِّهَاأَنَّ امْرَأَةً تُوُفِّيَ زَوْجُهَا فَخَافُوا عَلَى عَيْنِهَا فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْذَنُوهُ فِي الْكُحْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ كَانَتْ إِحْدَاكُنَّ تَكُونُ فِي شَرِّ بَيْتِهَا فِي أَحْلَاسِهَا أَوْ فِي شَرِّ أَحْلَاسِهَا فِي بَيْتِهَا حَوْلًا فَإِذَا مَرَّ كَلْبٌ رَمَتْ بِبَعْرَةٍ فَخَرَجَتْ أَفَلَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًاو حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ بِالْحَدِيثَيْنِ جَمِيعًا حَدِيثِ أُمِّ سَلَمَةَ فِي الْكُحْلِ وَحَدِيثِ أُمِّ سَلَمَةَ وَأُخْرَى مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ أَنَّهُ لَمْ تُسَمِّهَا زَيْنَبَ نَحْوَ حَدِيثِ مُحَمَّدِ بْنِ جَعْفَرٍ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Humaid bin Nafi'] dia berkata; Saya mendengar [Zaenab binti Ummu Salamah] telah menceritakan dari [ibunya] bahwa seorang wanita telah ditinggal mati oleh suaminya, sehingga keluarganya khawatir matanya bengkak (karena banyak menangis), lalu mereka mendatangi Nabi shallallahu 'alaihi wasallam dan meminta izin untuk mencelakinya, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh dahulu salah seorang dari kalian pernah ditaruh di rumah yang paling jelek selama satu tahun, jika ada seekor anjing yang lewat, maka dia akan melemparnya dengan kotoran, barulah dia diperbolehkan keluar, tidakkah ia menunggu empat bulan sepuluh hari?.\" Dan telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Syu'bah] dari [Humaid bin Nafi'] dengan dua hadits."
            },
            {
                "number": 2545,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ حُمَيْدِ بْنِ نَافِعٍ أَنَّهُ سَمِعَ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ تُحَدِّثُ عَنْ أُمِّ سَلَمَةَ وَأُمِّ حَبِيبَةَتَذْكُرَانِ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ لَهُ أَنَّ بِنْتًا لَهَا تُوُفِّيَ عَنْهَا زَوْجُهَا فَاشْتَكَتْ عَيْنُهَا فَهِيَ تُرِيدُ أَنْ تَكْحُلَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ كَانَتْ إِحْدَاكُنَّ تَرْمِي بِالْبَعْرَةِ عِنْدَ رَأْسِ الْحَوْلِ وَإِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Amru An Naqid] keduanya berkata; Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya bin Sa'id] dari [Humaid bin Nafi'] bahwasannya dia mendengar [Zaenab binti Abi Salamah] menceritakan dari [Ummu Salamah] dan [Ummu Habibah], keduanya menyebutkan bahwa seorang wanita menemui Rasulullah shallallahu 'alaihi wasallam dan memberitahukan kepada beliau bahwa putrinya telah ditinggal mati oleh suaminya, hingga matanya bengkak dan dia hendak mencelakinya, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh dahulu wanita dari kalian (yang ditinggal mati suaminya) salalu melemparkan kotoran di penghujung tahun, sedangkan sekarang ini bagi dia hanyalah empat bulan sepuluh hari.\""
            },
            {
                "number": 2546,
                "arab": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِعَمْرٍو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ حُمَيْدِ بْنِ نَافِعٍ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ قَالَتْ لَمَّا أَتَى أُمَّ حَبِيبَةَ نَعِيُّ أَبِي سُفْيَانَ دَعَتْ فِي الْيَوْمِ الثَّالِثِ بِصُفْرَةٍ فَمَسَحَتْ بِهِ ذِرَاعَيْهَا وَعَارِضَيْهَاوَقَالَتْ كُنْتُ عَنْ هَذَا غَنِيَّةً سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجٍ فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا",
                "id": "Dan telah menceritakan kepada kami [Amru An Naqid] dan [Ibnu Abi Umar] sedangkan lafazhnya dari Amru, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub bin Musa] dari [Humaid bin Nafi'] dari [Zaenab binti Abi Salamah] dia berkata; Tatkala [Ummu Habibah] didatangi seseorang dengan berita wafatnya Abu Sufyan, setelah berlalu tiga hari dia meminta diambilkan shufrah (sejenis tumbuhan yang harum baunya), kemudian dia mengolesi kedua hastanya dan kedua pelipisnya sambil berkata; \"Sebenarnya saya tidak membutuhkan ini semua, hanya saja saya pernah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak halal seorang wanita yang beriman kepada Allah dan Hari Akhir melakukan ihdad melebihi tiga hari, kecuali karena kematian suaminya, yaitu berkabung selama empat bulan sepuluh hari.\""
            },
            {
                "number": 2547,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَقُتَيْبَةُ وَابْنُ رُمْحٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ عَنْ نَافِعٍ أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ حَدَّثَتْهُ عَنْ حَفْصَةَ أَوْ عَنْ عَائِشَةَ أَوْ عَنْ كِلْتَيْهِمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَوْ تُؤْمِنُ بِاللَّهِ وَرَسُولِهِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثَةِ أَيَّامٍ إِلَّا عَلَى زَوْجِهَاو حَدَّثَنَاه شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُسْلِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ نَافِعٍ بِإِسْنَادِ حَدِيثِ اللَّيْثِ مِثْلَ رِوَايَتِهِ و حَدَّثَنَاه أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ يَقُولُ سَمِعْتُ نَافِعًا يُحَدِّثُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ أَنَّهَا سَمِعَتْ حَفْصَةَ بِنْتَ عُمَرَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ اللَّيْثِ وَابْنِ دِينَارٍ وَزَادَ فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا و حَدَّثَنَا أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ جَمِيعًا عَنْ نَافِعٍ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِهِمْ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Qutaibah] dan [Ibnu Rumh] dari [Al Laits bin Sa'ad] dari [Nafi'] bahwa [Shafiyyah binti Abi Ubaid] telah menceritakan kepadanya dari [Hafshah] atau dari ['Aisyah] atau dari keduanya bahwasannya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir atau beriman kepada Allah dan Rasul-Nya melakukan ihdad karena kematian saudaranya melebihi tiga hari kecuali karena kematian suaminya.\" Dan telah menceritakan kepada kami pula [Syaiban bin Farrukh] telah menceritakan kepada kami [Abdul Aziz] yaitu Ibnu Muslim, telah menceritakan kepada kami [Abdullah bin Dinar] dari [Nafi'] dengan isnad haditsnya Al Laits seperti riwayatnya. Dan telah menceritakan kepada kami [Abu Ghazzan Al Misma'i] dan [Muhammad bin Al Mutsanna] keduanya berkata; Telah menceritakan kepada kami [Abdul Wahhab] dia berkata; Saya mendengar [Yahya bin Sa'id] berkata; Saya mendengar [Nafi'] telah menceritakan dari [Shafiyyah binti Ab Ubaid] bahwa dia telah mendengar [Hafshah binti Umar] istri Nabi shallallahu 'alaihi wasallam telah menceritakan dari Nabi shallallahu 'alaihi wasallam seperti hadits Al Laits dan Ibnu Dinar dengan menambahan; Bahwa wanita melakukan ihdad (berkabung) karena kematian suaminya selama empat bulan sepuluh hari. Dan telah menceritakan kepada kami [Abu Ar Rabi'] telah menceritakan kepada kami [Hammad] dari [Ayyub]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami ['ubaidhullah] semuanya dari [Nafi'] dari [Shafiyyah binti Abi Ubaid] dari [sebagian istri Nabi] shallallahu 'alaihi wasallam dari Nabi shallallahu 'alaihi wasallam dengan hadits mereka."
            },
            {
                "number": 2548,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرُونَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجِهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah], [Amru An Naqid] dan [Zuhair bin Harb] sedangkan lafazhnya dari Yahya, dia mengatakan; Telah mengabarkan kepada kami. Sedangkan yang dua mengatakan; Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir untuk melakukan ihdad karena kematian seseorang melebihi tiga hari, kecuali karena kematian suaminya.\" "
            },
            {
                "number": 2549,
                "arab": "و حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ هِشَامٍ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُحِدُّ امْرَأَةٌ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا وَلَا تَلْبَسُ ثَوْبًا مَصْبُوغًا إِلَّا ثَوْبَ عَصْبٍ وَلَا تَكْتَحِلُ وَلَا تَمَسُّ طِيبًا إِلَّا إِذَا طَهُرَتْ نُبْذَةً مِنْ قُسْطٍ أَوْ أَظْفَارٍو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ كِلَاهُمَا عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ وَقَالَا عِنْدَ أَدْنَى طُهْرِهَا نُبْذَةً مِنْ قُسْطٍ وَأَظْفَارٍ",
                "id": "Dan telah menceritakan kepada kami [Hasan bin Rabi'] telah menceritakan kepada kami [Ibnu Idris] dari [Hisyam] dari [Hafshah] dari [Ummu 'Athiyah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Tidak boleh bagi seorang wanita melakukan ihdad karena kematian seseorang melebihi tiga hari, kecuali karena kematian suaminya yaitu empat bulan sepuluh hari, dan tidak boleh menggunakan pakaian yang berwarna warni, melainkan hanya memakai pakaian yang kasar (kain beludru), dan tidak boleh menggunakan celak mata, dan tidak boleh memakai wewangian kecuali jika masa iddahnya telah habis, maka diperbolehkan baginya memakai qusth dan adzfar (sejenis pohon yang harum baunya).\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] dan diganti dengan jalur periwayatan yang lain, dari [Amru] telah menceritakan kepada kami [Yazid bin Harun] keduanya dari [Hisyam] dengan sanad ini."
            },
            {
                "number": 2550,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ أَخْبَرَهُأَنَّ عُوَيْمِرًا الْعَجْلَانِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الْأَنْصَارِيِّ فَقَالَ لَهُ أَرَأَيْتَ يَا عَاصِمُ لَوْ أَنَّ رَجُلًا وَجَدَ مَعَ امْرَأَتِهِ رَجُلًا أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَسَلْ لِي عَنْ ذَلِكَ يَا عَاصِمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَرِهَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسَائِلَ وَعَابَهَا حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ قَدْ كَرِهَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا قَالَ عُوَيْمِرٌ وَاللَّهِ لَا أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا فَأَقْبَلَ عُوَيْمِرٌ حَتَّى أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلًا وَجَدَ مَعَ امْرَأَتِهِ رَجُلًا أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَزَلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا قَالَ سَهْلٌ فَتَلَاعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا فَرَغَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا فَطَلَّقَهَا ثَلَاثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ ابْنُ شِهَابٍ فَكَانَتْ سُنَّةَ الْمُتَلَاعِنَيْنِ و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَهْلُ بْنُ سَعْدٍ الْأَنْصَارِيُّ أَنَّ عُوَيْمِرًا الْأَنْصَارِيَّ مِنْ بَنِي الْعَجْلَانِ أَتَى عَاصِمَ بْنَ عَدِيٍّ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ مَالِكٍ وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ وَكَانَ فِرَاقُهُ إِيَّاهَا بَعْدُ سُنَّةً فِي الْمُتَلَاعِنَيْنِ وَزَادَ فِيهِ قَالَ سَهْلٌ فَكَانَتْ حَامِلًا فَكَانَ ابْنُهَا يُدْعَى إِلَى أُمِّهِ ثُمَّ جَرَتْ السُّنَّةُ أَنَّهُ يَرِثُهَا وَتَرِثُ مِنْهُ مَا فَرَضَ اللَّهُ لَهَا و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ الْمُتَلَاعِنَيْنِ وَعَنْ السُّنَّةِ فِيهِمَا عَنْ حَدِيثِ سَهْلِ بْنِ سَعْدٍ أَخِي بَنِي سَاعِدَةَ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلًا وَجَدَ مَعَ امْرَأَتِهِ رَجُلًا وَذَكَرَ الْحَدِيثَ بِقِصَّتِهِ وَزَادَ فِيهِ فَتَلَاعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ وَقَالَ فِي الْحَدِيثِ فَطَلَّقَهَا ثَلَاثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفَارَقَهَا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاكُمْ التَّفْرِيقُ بَيْنَ كُلِّ مُتَلَاعِنَيْنِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Ibnu Syihab] bahwa [Sahl bin Sa'd As Sa'idi] telah mengabarkan kepadanya bahwa 'Uwaimir Al 'Ajlani bertanya kepada 'Ashim bin 'Adi Al Anshari; \"Wahai 'Ashim, bagaimana pendapatmu jika seorang suami memergoki laki-laki lain yang sedang berkencan dengan istrinya? Apakah sang suami membunuh laki-laki tersebut kemudian kalian membunuhnya (sebagai qishah) atau bagaimana seharusnya yang akan diperbuatnya? Wahai 'Ashim, coba tanyakan hal ini kepada Rasulullah shallallahu 'alaihi wasallam!\" Kemudian 'Ashim bertanya kepada Rasulullah shallallahu 'alaihi wasallam, namun Rasulullah shallallahu 'alaihi wasallam tidak menyukai pertanyaan itu, bahkan beliau mencelanya, sehingga 'Ashim merasa sangat bersalah dengan apa yang didengarnya dari Rasulullah shallallahu 'alaihi wasallam. Tatkala 'Ashim kembali ke keluarganya, tiba-tiba 'Uwaimir datang, lalu dia bertanya; \"Wahai 'Ashim, apa yang telah dikatakan Rasulullah shallallahu 'alaihi wasallam terhadapmu?\" 'Ashim menjawab; \"Justru persoalan tersebut tidak membawa kebaikan bagiku sama sekali, sungguh Rasulullah shallallahu 'alaihi wasallam tidak menyukai pertanyaan yang saya ajukan kepadanya.\" 'Uwaimir berkata; \"Demi Allah, saya tidak akan berhenti sampai saya sendiri yang akan menanyakannya kepada beliau.\" 'Uwaimir lalu pergi hingga dia datang kepada Rasulullah shallallahu 'alaihi wasallam yang sedang berada di kerumunan orang banyak. 'Uwaimir bertanya; \"Wahai Rasulullah, bagaimana menurutmu, jika ada seorang suami yang mendapati istrinya sedang bersama laki-laki lain? Apakah sang suami boleh membunuh laki-laki tersebut kemudian kalian membunuhnya (sebagai qishash), atau dia harus berbuat apa?\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Telah turun ayat mengenai dirimu dan istrimu, maka bawalah istrimu kemari!\" Sahal berkata; Kemudian 'Uwaimir dan istrinya melontarkan li'an (saling mela'nat). Setelah keduanya selesai melontarkan li'an, maka 'Uwaimir berkata; \"Wahai Rasulullah, jika saya tetap memperistrinya, berarti saya berdusta.\" Kemudian dia metalaknya dengan talak tiga, sebelum dirinya diperintahkan oleh Rasulullah shallallahu 'alaihi wasallam.\" Ibnu Syihab berkata; \"Seperti itulah cara penyelesaian antara suami istri yang saling melaknat.\" Telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sahl bin Sa'd Al Anshari] bahwa 'Uwaimir Al Anshari dari Bani 'Ajlan menemui 'Ashim bin 'Adi, kemudian dia melanjutkan teks hadits seperti hadits Malik dan dia mengidrajkan (memasukkan lafazh yang bukan termasuk dari lafazh hadits) dalam hadits tersebut dengan perataannya; \"Kemudian beliau memisahkan dia dengan istrinya, begitulah sunnah mengajarkan suami istri yang saling melaknat.\" Dan dia menambahkan pula; Sahl berkata; \"Setelah itu istrinya hamil, sedangkan anaknya dipanggil dengan nama ibunya, kemudian sunnah berlaku kepadanya bahwa anaknya mewarisi sifat ibunya, begitu juga dengan ibnunya mewarisi sifat anaknya sebagaimana yang telah diputuskan Allah terhadap dirinya.\" Dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] mengenai orang yang saling melaknat, dan ketetapan sunnah terhadapnya dari hadits Sahl bin Sa'd saudara Bani Sa'idah bahwa ada seorang laki-laki dari Anshar datang menemui Nabi shallallahu 'alaihi wasallam, dia bertanya; \"Wahai Rasulullah, bagaimana pendapatmu, jika ada seorang suami mendapati istrinya sedang bersama laki-laki lain?\" Lalu dia menyebutkan hadits tersebut dengan kisahnya. Dan dia menambahkan; \"Kemudian keduanya saling melaknat di dalam masjid, waktu itu saya ikut menyaksikan.\" Dan dia berkata dalam hadits tersebut; \"Kemudian 'Uwaimir menceraikannya dengan talak tiga sebelum dia diperintahkan oleh Rasulullah shallallahu 'alaihi wasallam, lalu dia menceraikannya di sisi Nabi shallallahu 'alaihi wasallam, selanjutnya Nabi shallallahu 'alaihi wasallam bersabda: \"Demikianlah seharusnya kalian memisahkan antara dua orang (suami istri) yang saling melaknat.\" "
            },
            {
                "number": 2551,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لَهُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَسُئِلْتُ عَنْ الْمُتَلَاعِنَيْنِ فِي إِمْرَةِ مُصْعَبٍ أَيُفَرَّقُ بَيْنَهُمَا قَالَ فَمَا دَرَيْتُ مَا أَقُولُ فَمَضَيْتُ إِلَى مَنْزِلِ ابْنِ عُمَرَ بِمَكَّةَ فَقُلْتُ لِلْغُلَامِ اسْتَأْذِنْ لِي قَالَ إِنَّهُ قَائِلٌ فَسَمِعَ صَوْتِي قَالَ ابْنُ جُبَيْرٍ قُلْتُ نَعَمْ قَالَ ادْخُلْ فَوَاللَّهِ مَا جَاءَ بِكَ هَذِهِ السَّاعَةَ إِلَّا حَاجَةٌ فَدَخَلْتُ فَإِذَا هُوَ مُفْتَرِشٌ بَرْذَعَةً مُتَوَسِّدٌ وِسَادَةً حَشْوُهَا لِيفٌ قُلْتُ أَبَا عَبْدِ الرَّحْمَنِ الْمُتَلَاعِنَانِ أَيُفَرَّقُ بَيْنَهُمَا قَالَ سُبْحَانَ اللَّهِ نَعَمْ إِنَّ أَوَّلَ مَنْ سَأَلَ عَنْ ذَلِكَ فُلَانُ بْنُ فُلَانٍ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ أَنْ لَوْ وَجَدَ أَحَدُنَا امْرَأَتَهُ عَلَى فَاحِشَةٍ كَيْفَ يَصْنَعُ إِنْ تَكَلَّمَ تَكَلَّمَ بِأَمْرٍ عَظِيمٍ وَإِنْ سَكَتَ سَكَتَ عَلَى مِثْلِ ذَلِكَ قَالَ فَسَكَتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُجِبْهُ فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَاهُ فَقَالَ إِنَّ الَّذِي سَأَلْتُكَ عَنْهُ قَدْ ابْتُلِيتُ بِهِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ هَؤُلَاءِ الْآيَاتِ فِي سُورَةِ النُّورِ{ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ }فَتَلَاهُنَّ عَلَيْهِ وَوَعَظَهُ وَذَكَّرَهُ وَأَخْبَرَهُ أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الْآخِرَةِ قَالَ لَا وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا كَذَبْتُ عَلَيْهَا ثُمَّ دَعَاهَا فَوَعَظَهَا وَذَكَّرَهَا وَأَخْبَرَهَا أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الْآخِرَةِ قَالَتْ لَا وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنَّهُ لَكَاذِبٌ فَبَدَأَ بِالرَّجُلِ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنْ الصَّادِقِينَ وَالْخَامِسَةُ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنْ الْكَاذِبِينَ ثُمَّ ثَنَّى بِالْمَرْأَةِ فَشَهِدَتْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنْ الْكَاذِبِينَ وَالْخَامِسَةُ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنْ الصَّادِقِينَ ثُمَّ فَرَّقَ بَيْنَهُمَاو حَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ قَالَ سُئِلْتُ عَنْ الْمُتَلَاعِنَيْنِ زَمَنَ مُصْعَبِ بْنِ الزُّبَيْرِ فَلَمْ أَدْرِ مَا أَقُولُ فَأَتَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقُلْتُ أَرَأَيْتَ الْمُتَلَاعِنَيْنِ أَيُفَرَّقُ بَيْنَهُمَا ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdulalh bin Numair] telah menceritakan kepada kami [ayahku], dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] sedangkan lafazhnya dari dia, telah menceritakan kepada kami [Abdullah bin Numair] telah menceritakan kepada kami [Abdul Malik bin Abu Sulaiman] dari [Sa'id bin Jubair] dia berkata; Saya pernah ditanya mengenai suami istri yang saling tuduh pada zaman pemerintahan Mush'ab, apakah keduanya diceraikan? Ibnu Jubair berkata; Saya tidak menjawabnya, sebab saya tidak mengetahui tentang hukumnya, maka saya langsung datang ke rumah [Ibnu Umar] di Makkah. Saya berkata kepada pelayannya; Izinkanlah saya bertemu dengannya. Dia menjawab; Sesungguhnya Ibnu Umar sedang istirahat siang. Namun rupanya Ibnu Umar mendengar dan mengenal suaraku, lalu dia berkata; \"Ibnu Jabirkah itu?\" Saya menjawab; \"Ya.\" Dia berkata; \"Masuklah, demi Allah tidaklah kamu datang pada saat-saat seperti ini melainkan ada urusan yang penting.\" Kemudian saya masuk ke rumahnya, sedangkan dia duduk bertelekan di atas pelana dan bantal yang terbuat dari serabut. Lalu saya bertanya; \"Wahai Abu Abdurrahman, apakah harus dipisahkan jika ada suami istri yang saling li'an?\" Dia menjawab; \"Subhanallah, ya, dia harus dipisahkan. Sesungguhnya orang yang pertama kali bertanya masalah ini adalah fulan bin fulan, dia bertanya; Wahai Rasulullah, bagaimana pendapat anda seandainya salah seorang dari kami mendapati istrinya berbuat serong? Apa yang harus diperbuatnya? Jika dia membicarakannya, maka dia akan membicarakan sesuatu yang menghebohkan, namun jika diam, dia diam terhadap masalah yang sangat besar.\" Ibnu Umar melanjutkan; Maka Nabi shallallahu 'alaihi wasallam diam, tidak menjawab apa-apa. Tidak lama kemudian, dia datang lagi kepada beliau, katanya; Sesungguhnya masalah yang pernah kutanyakan kepada anda tempo hari adalah masalah pribadiku, dan saya baru diuji dengan masalah tersebut. Mengenai kasus mereka, lalu Allah Azza Wa Jalla menurunkan ayat yang tersebut dalam surat An Nur: \"Dan orang-orang yang menuduh istrinya berzina ….\" Kemudian beliau membacakan ayat itu kepadanya, memberinya pengajaran, memperingatkannya dengan keras dan mengabarkan bahwa siksa dunia lebih ringan daripada siksa akhirat. Laki-laki itu berkata; \"Demi Allah yang mengutus anda dengan kebenaran, saya tidak berbohong.\" Kemudian beliau memanggil istrinya, lalu beliau memberi pengajaran, memperingatkannya dengan keras, serta mengabarkan kepadanya bahwa siksa dunia lebih ringan dari siks akhirat.\" Perempuan itu menjawab; \"Demi Allah yang mengutus anda dengan kebenaran, sesungguhnya laki-laki itu dusta.\" Kemudian beliau menyuruh laki-laki tersebut bersaksi atas nama Allah sebanyak empat kali bahwa dia termasuk orang-orang yang jujur, dan yang kelima mangatakan bahwa Laknat Allah akan menimpanya jika dia berdusta. Kemudian beliau menyuruh yang perempuan untuk bersaksi atas nama Allah empat kali sumpah bahwa suaminya termasuk orang-orang yang berdusta, dan yang kelima dengan mengucapkan bahwa murka Allah atasnya jika suaminya yang benar. Kemudian beliau memisahkan antara keduanya. Dan telah menceritakan kepadaku [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Abdul Malik bin Abi Sulaiman] dia berkata; Saya pernah mendengar [Sa'id bin Jubair] berkata; Saya pernah ditanya mengenai seorang suami istri yang saling meli'an di zaman Mush'ab bin Zubair, dan saya tidak tahu harus menjawab apa, lalu saya menemui [Abdullah bin Umar], saya bertanya; \"Bagaimana pendapatmu jika ada suami istri yang saling meli'an, apakah keduanya harus dipisahkan?\" Kemudian dia menyebutkan seperti haditsnya Ibnu Umar. "
            },
            {
                "number": 2552,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمُتَلَاعِنَيْنِ حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ لَا سَبِيلَ لَكَ عَلَيْهَا قَالَ يَا رَسُولَ اللَّهِ مَالِي قَالَ لَا مَالَ لَكَ إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا فَهُوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا فَذَاكَ أَبْعَدُ لَكَ مِنْهَاقَالَ زُهَيْرٌ فِي رِوَايَتِهِ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abi Syaibah] serta [Zuhair bin Harb] sedangkan lafazhnya dari Yahya, dia mengatakan; Telah mengabarkan kepada kami, sedangkan yang dua mengatakan; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru] dari [Sa'id bin Jubair] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada sepasang suami istri yang saling meli'an: \"Hanya Allah sajalah yang tahu jika salah satu dari kalian ada yang berdusta, dan tidak ada jalan lain bagimu untuk menuntut istrimu.\" Kata suaminya; \"Wahai Rasulullah, bagaimanaah dengan hartaku?\" beliau menjawab: \"Kamu tidak dapat menuntutnya lagi karena kamu telah bersumpah. Jika sumpahmu benar, maka harta itu sebagai imbalan kehalalan kehormatannya bagimu, dan jika ternyata kamu yang dusta, maka harta tersebut akan semakin menjauh darimu.\" Dalam riwayatnya Zuhair mengatakan; Telah menceritakan kepada kami Sufyan dari 'Amru bahwa dia mendengar Sa'id bin Jubair berkata; Saya pernah mendengar Ibnu Umar berkata; Rasulullah shallallahu 'alaihi wasallam bersabda."
            },
            {
                "number": 2553,
                "arab": "و حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِلْمِسْمَعِيِّ وَابْنِ الْمُثَنَّى قَالُوا حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَلَمْ يُفَرِّقْ الْمُصْعَبُ بَيْنَ الْمُتَلَاعِنَيْنِ قَالَ سَعِيدٌ فَذُكِرَ ذَلِكَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ فَقَالَ فَرَّقَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَخَوَيْ بَنِي الْعَجْلَانِ",
                "id": "Dan telah menceritakan kepada kami [Abu Ghazzan Al Misma'i] dan [Muhammad bin Al Mutsanna] serta [Ibnu Basysyar] sedangkan lafazhnya dari Al Misma'i dan Ibnu Al Mutsanna, mereka berkata; Telah menceritakan kepada kami [Mu'adz] dia adalah ibnu Hisyam, dia berkata; Telah menceritakan kepadaku [ayahku] dari [Qatadah] dari ['Azrah] dari [Sa'id bin Jubair] dia berkata; \"Mush'ab tidak memisahkan antara sepasang suami istri yang saling meli'an.\" Lalu Sa'id menyebutkan hal itu kepada [Abdullah bin Umar], maka dia berkata; Nabi shallallahu 'alaihi wasallam pernah memisahkan antara sepasang suami istri dari Bani Ajlan (yang saling meli'an).\""
            },
            {
                "number": 2554,
                "arab": "و حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا مَالِكٌ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ رَجُلًا لَاعَنَ امْرَأَتَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفَرَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا وَأَلْحَقَ الْوَلَدَ بِأُمِّهِ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Qutaibah bin Sa'id] keduanya berkata; Telah menceritakan kepada kami [Malik]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Yahya bin Yahya] sedangkan lafazhnya darinya, dia berkata; Saya berkata kepada Malik; Apakah [Nafi'] telah menceritakan kepadamu dari [Ibnu Umar] bahwa seorang laki-laki yang meli'an istrinya di zaman Rasulullah shallallahu 'alaihi wasallam kemudian Rasulullah shallallahu 'alaihi wasallam memisahkan keduanya dan memberikan anak hasil serong itu kepada ibunya? Malik menjawab; \"Ya.\" "
            },
            {
                "number": 2555,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِزُهَيْرٍ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَإِنَّا لَيْلَةَ الْجُمُعَةِ فِي الْمَسْجِدِ إِذْ جَاءَ رَجُلٌ مِنْ الْأَنْصَارِ فَقَالَ لَوْ أَنَّ رَجُلًا وَجَدَ مَعَ امْرَأَتِهِ رَجُلًا فَتَكَلَّمَ جَلَدْتُمُوهُ أَوْ قَتَلَ قَتَلْتُمُوهُ وَإِنْ سَكَتَ سَكَتَ عَلَى غَيْظٍ وَاللَّهِ لَأَسْأَلَنَّ عَنْهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا كَانَ مِنْ الْغَدِ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَقَالَ لَوْ أَنَّ رَجُلًا وَجَدَ مَعَ امْرَأَتِهِ رَجُلًا فَتَكَلَّمَ جَلَدْتُمُوهُ أَوْ قَتَلَ قَتَلْتُمُوهُ أَوْ سَكَتَ سَكَتَ عَلَى غَيْظٍ فَقَالَ اللَّهُمَّ افْتَحْ وَجَعَلَ يَدْعُو فَنَزَلَتْ آيَةُ اللِّعَانِ{ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُنْ لَهُمْ شُهَدَاءُ إِلَّا أَنْفُسُهُمْ }هَذِهِ الْآيَاتُ فَابْتُلِيَ بِهِ ذَلِكَ الرَّجُلُ مِنْ بَيْنِ النَّاسِ فَجَاءَ هُوَ وَامْرَأَتُهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَلَاعَنَا فَشَهِدَ الرَّجُلُ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنْ الصَّادِقِينَ ثُمَّ لَعَنَ الْخَامِسَةَ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنْ الْكَاذِبِينَ فَذَهَبَتْ لِتَلْعَنَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَهْ فَأَبَتْ فَلَعَنَتْ فَلَمَّا أَدْبَرَا قَالَ لَعَلَّهَا أَنْ تَجِيءَ بِهِ أَسْوَدَ جَعْدًا فَجَاءَتْ بِهِ أَسْوَدَ جَعْدًاو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ جَمِيعًا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Utsman bin Abi Syaibah] serta [Ishaq bin Ibrahim] sedangkan lafazhnya dari Zuhair. Ishaq mengatakan; Telah mengabarkan kepada kami, sedangkan yang dua mengatakan; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] dia berkata; Pada malam Jum'at kami berada di Masjid, tiba-tiba datang seorang laki-laki dari Anshar sambil berkata; \"Bagaimana jika seorang suami mendapati istrinya sedang berkencan dengan laki-laki lain, apakah sang suami boleh menceritakannya kemudian kalian menderanya, ataukah sang suami membunuh laki-laki tersebut kemudian kalian mengqishahnya, atau haruskah suami diam saja, namun jika dia diam, demi Allah, dia diam dalam kemarahan! Sungguh saya akan menanyakan permasalahan ini kepada Nabi shallallahu 'alaihi wasallam.\" Di esok harinya, dia datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu dia bertanya, dia berkata; \"Bagaimana jika seorang suami mendapati istrinya sedang berkencan dengan laki-laki lain, apakah sang suami boleh bercerita kemudian kalian menderanya, ataukah sang suami membunuh laki-laki tersebut lalu kalian mengqishashnya, atau haruskah dia diam saja, namun jika suami diam berarti diam dalam kemarahan yang sangat!\" Lalu beliau mengucapkan: \"Ya Allah, bukakanlah (jelaskanlah hukum ini kepada kami).\" Dan beliau pun berdo'a, lalu turunlah ayat li'an: \"Dan orang-orang yang menuduh istrinya (berzina) padahal mereka tidak mempunyai saksi-saksi selain diri mereka sendiri.\" Laki-laki tersebut telah diuji dengan perkara ini di antara manusia. Maka dia dan istrinya datang menemui Nabi shallallahu 'alaihi wasallam dan melakukan li'an, lelaki tersebut mengucapkan empat kali sumpah dengan nama Allah bahwa dia termasuk dari golongan yang benar, dan yang kelima kali dia melaknat dirinya bahwa laknat Allah siap ditimpakan kepadanya jika dia termasuk pendusta. Setelah itu ganti istrinya yang mengucapkan li'an, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Tahanlah (jangan kamu lakukan).\" Namun dia enggan dan mengucapkan li'an, setelah keduanya pergi, beliau bersabda: \"Barangkali dia akan melahirkan anak yang berkulit hitam dan berambut keriting.\" Tidak lama kemudian dia melahirkan anak berkulit hitam dan berambut keriting. Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami ['Abdah bin Sulaiman] semuanya dari [A'masy] dengan isnad seperti ini. "
            },
            {
                "number": 2556,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا هِشَامٌ عَنْ مُحَمَّدٍ قَالَسَأَلْتُ أَنَسَ بْنَ مَالِكٍ وَأَنَا أُرَى أَنَّ عِنْدَهُ مِنْهُ عِلْمًا فَقَالَ إِنَّ هِلَالَ بْنَ أُمَيَّةَ قَذَفَ امْرَأَتَهُ بِشَرِيكِ ابْنِ سَحْمَاءَ وَكَانَ أَخَا الْبَرَاءِ بْنِ مَالِكٍ لِأُمِّهِ وَكَانَ أَوَّلَ رَجُلٍ لَاعَنَ فِي الْإِسْلَامِ قَالَ فَلَاعَنَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْصِرُوهَا فَإِنْ جَاءَتْ بِهِ أَبْيَضَ سَبِطًا قَضِيءَ الْعَيْنَيْنِ فَهُوَ لِهِلَالِ بْنِ أُمَيَّةَ وَإِنْ جَاءَتْ بِهِ أَكْحَلَ جَعْدًا حَمْشَ السَّاقَيْنِ فَهُوَ لِشَرِيكِ ابْنِ سَحْمَاءَ قَالَ فَأُنْبِئْتُ أَنَّهَا جَاءَتْ بِهِ أَكْحَلَ جَعْدًا حَمْشَ السَّاقَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Hisyam] dari [Muhammad] dia berkata; Saya bertanya kepada [Anas bin Malik] dan saya tahu bahwa dia orang yang berilmu, dia berkata; Sesungguhnya Hilal bin Umayyah menuduh istrinya berbuat serong dengan Syarik bin Sahma` yaitu saudara seibu Barra` bin Malik, dan laki-laki pertama kali yang melakukan li'an dalam Islam. Anas berkata; Lantas Hilal melakukan sumpah li'an di hadapan Rasulullah shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Coba perhatikan perempuan itu, jika nanti anaknya putih, berambut lurus dan mata agak merah, tandanya bayi tersebut anaknya Hilal bin Umayah, namun jika matanya agak hitam, rambutnya keriting dan betisnya ramping, maka bayi tersebut adalah milik Syarik bin Sahma`.\" Kata Anas; Kemudian saya diberitahu orang bahwa anak tersebut bermata hitam, berambut keriting dan berbetis ramping."
            },
            {
                "number": 2557,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ وَعِيسَى بْنُ حَمَّادٍ الْمِصْرِيَّانِ وَاللَّفْظُ لِابْنِ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَذُكِرَ التَّلَاعُنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلًا ثُمَّ انْصَرَفَ فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ يَشْكُو إِلَيْهِ أَنَّهُ وَجَدَ مَعَ أَهْلِهِ رَجُلًا فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا إِلَّا لِقَوْلِي فَذَهَبَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبِطَ الشَّعَرِ وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَ عِنْدَ أَهْلِهِ خَدْلًا آدَمَ كَثِيرَ اللَّحْمِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَيِّنْ فَوَضَعَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ عِنْدَهَا فَلَاعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا فَقَالَ رَجُلٌ لِابْنِ عَبَّاسٍ فِي الْمَجْلِسِ أَهِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ فَقَالَ ابْنُ عَبَّاسٍ لَا تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ فِي الْإِسْلَامِ السُّوءَو حَدَّثَنِيهِ أَحْمَدُ بْنُ يُوسُفَ الْأَزْدِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي أُوَيْسٍ حَدَّثَنِي سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ يَحْيَى حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَ ذُكِرَ الْمُتَلَاعِنَانِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ اللَّيْثِ وَزَادَ فِيهِ بَعْدَ قَوْلِهِ كَثِيرَ اللَّحْمِ قَالَ جَعْدًا قَطَطًا",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rumh bin Al Muhajir] dan [Isa bin Hammad] keduanya dari negri Mesir, sedangkan lafazhnya dari Ibnu Rumh, keduanya berkata; Telah mengabarkan kepada kami [Al Laits] dari [Yahya bin Sa'id] dari [Abdurrahman bin Qasim] dari [Qasim bin Muhammad] dari [Ibnu Abbas] bahwa dia berkata; Pernah disebutkan orang yang melakukan li'an di hadapan Rasulullah shallallahu 'alaihi wasallam, lalu 'Ashim bin 'Adi berkata tentang hal itu dengan suatu ungkapan, setelah dia beranjak pergi, tiba-tiba seorang laki-laki dari kaumnya mengadu kepadanya bahwa dirinya mendapati istrinya sedang berkencan dengan laki-laki lain. 'Ashim pun menjawab; Saya belum pernah diuji dengan kasus seperti ini kecuali seperti apa yang telah saya katakan tadi. Lalu dia dengan laki-laki tersebut datang menemui Rasulullah shallallahu 'alaihi wasallam dan memberitahukan tentang apa yang telah dia dapati dari istrinya, laki-laki tersebut berperawakan kurus, agak kekuning-kuningan dan berambut keriting. Sedangkan laki-laki yang dituduhnya bersama istrinya adalah gemuk dan berbadan besar. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, berilah kejelasan.\" Lalu perempuan tersbeut melahirkan anak yang mirip dengan llai-laki yang dituduh oleh suaminya bahwa ia berkencan dengan istrinya, kemudian Rasulullah shallallahu 'alaihi wasallam melakukan li'an terhadap pasangan suami istri. Ada seseorang yang berada di majlis Ibnu Abbas bertanya; \"Apakah wanita tersebut yang telah dikatakan oleh Rasulullah shallallahu 'alaihi wasallam bahwa: \"Sekiranya saya diperbolehkan merajam seseorang tanpa ada bukti yang jelas, maka saya akan merajamnya.\" Ibnu Abbas menjawab; \"Tidak, akan tetapi wanita tersebut adalah yang berita perbuatan kejinya telah menyebar.\" Dan telah menceritakan kepadaku [Ahmad bin Yusuf Al Azdi] telah menceritakan kepada kami [Isma'il bin Abi Uwais] telah menceritakan kepadaku [Sulaiman yaitu Ibnu Bilal] dari [Yahya] telah menceritakan kepadaku [Abdurrahman bin Qasim] dari [Qasim bin Muhammad] dari [Ibnu Abbas] bahwa dia berkata; Pernah disebutkan berita tentang pasangan suami istri yang saling meli'an di sisi Rasulullah shallallahu 'alaihi wasallam seperti haditsnya Al Laits, dan dalam haditsnya ada sedikit tambahan di perkataanya; \"Banyak dagingnya (gemuk).\" Dia berkata; \"Berambut keriting (tebal).\""
            },
            {
                "number": 2558,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ سَعْدَ بْنَ عُبَادَةَ الْأَنْصَارِيَّ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الرَّجُلَ يَجِدُ مَعَ امْرَأَتِهِ رَجُلًا أَيَقْتُلُهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَالَ سَعْدٌ بَلَى وَالَّذِي أَكْرَمَكَ بِالْحَقِّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْمَعُوا إِلَى مَا يَقُولُ سَيِّدُكُمْ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz yaitu Ad Darawardi] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] bahwa Sa'ad bin 'Ubadah Al Anshari pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Wahai Rasulullah, bagaimana pendapatmu jika ada seorang suami mendapati lelaki lain sedang berkencan dengan isterinya, bolehkah dia membunuhnya?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak.\" Lantas Sa'ad berkata: \"Justru dia melakukannya (membunuhnya), demi Dzat yang telah mengutusmu dengan Al Haq.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Dengarlah apa yang telah dikatakan oleh pemuka kalian ini!\""
            },
            {
                "number": 2559,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنِي إِسْحَقُ بْنُ عِيسَى حَدَّثَنَا مَالِكٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ سَعْدَ بْنَ عُبَادَةَ قَالَ يَا رَسُولَ اللَّهِ إِنْ وَجَدْتُ مَعَ امْرَأَتِي رَجُلًا أَؤُمْهِلُهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Ishaq bin Isa] telah menceritakan kepada kami [Malik] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] bahwa Sa'ad bin Ubadah bertanya; \"Wahai Rasulullah, jika saya mendapati istriku bersama dengan lelaki lain, apakah saya membiarkannya sampai saya mendatangkan empat orang saksi?\" Beliau menjawab; \"Ya.\" "
            },
            {
                "number": 2560,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ قُوِّمَ عَلَيْهِ قِيمَةَ الْعَدْلِ فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَو حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ رُمْحٍ جَمِيعًا عَنْ اللَّيْثِ بْنِ سَعْدٍ ح و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ ح و حَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ ح و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي إِسْمَعِيلُ بْنُ أُمَيَّةَ ح و حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أُسَامَةُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ ابْنِ أَبِي ذِئْبٍ كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ بِمَعْنَى حَدِيثِ مَالِكٍ عَنْ نَافِعٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya bertanya kepada [Malik] apakah [Nafi'] pernah menceritakan kepadamu dari [Ibnu Umar]? Dia menjawab; Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Orang yang memerdekakan budak sebagiannya, sedangkan ia memiliki partner dalam pembebasan budak, kemudian memiliki harta seharga budak tersebut, maka ia harus membayar bagiannya kepada partnernya secara adil, jika tidak seperti itu, maka ia hanya membebaskan bagiannya saja.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin Rumh] semuanya dari [Al Laits bin Sa'ad]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Jarir bin Hazim]. Dan dari jalur lain, telah menceritakan kepada kami [Abu Rabi'] dan [Abu Kamil] keduanya berkata; Telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami ['ubaidhullah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul Wahab] dia berkata; Saya mendengar [Yahya bin Sa'id]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Ishaq bin Manshur] telah mengabarkan kepada kami [Abdur Razzaq] dari [Ibnu Juraij] telah mengabarkan kepada kami [Isma'il bin Umayyah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahab] telah mengabarkan kepadaku [Usamah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Ibnu Abi Fudaik] dari [Ibnu Abi Dzi`b] semuanya dari [Nafi'] dari [Ibnu Umar] semakna dengan hadits Malik dari Nafi'."
            },
            {
                "number": 2561,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْمَمْلُوكِ بَيْنَ الرَّجُلَيْنِ فَيُعْتِقُ أَحَدُهُمَا قَالَ يَضْمَنُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] sedangkan lafazhnya dari Ibnu Al Mutsanna keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Nadlr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda tentang budak yang dimiliki oleh dua orang, kemudian salah satunya memerdekakan bagiannya, beiau bersabda: \"Dia menjamin (tanggungan saudaranya).\""
            },
            {
                "number": 2562,
                "arab": "و حَدَّثَنِي عَمْرٌو النَّاقِدُ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ شِقْصًا لَهُ فِي عَبْدٍ فَخَلَاصُهُ فِي مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِيَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْهِو حَدَّثَنَاه عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ بِهَذَا الْإِسْنَادِ وَزَادَ إِنْ لَمْ يَكُنْ لَهُ مَالٌ قُوِّمَ عَلَيْهِ الْعَبْدُ قِيمَةَ عَدْلٍ ثُمَّ يُسْتَسْعَى فِي نَصِيبِ الَّذِي لَمْ يُعْتِقْ غَيْرَ مَشْقُوقٍ عَلَيْهِ حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ بِهَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ ابْنِ أَبِي عَرُوبَةَ وَذَكَرَ فِي الْحَدِيثِ قُوِّمَ عَلَيْهِ قِيمَةَ عَدْلٍ",
                "id": "Dan telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ibnu Abi Arubah] dari [Qatadah] dari [An Nadlr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang memerdekakan budak bagiannya (yang dimiliki secara bersama), maka ia harus memerdekakan dengan hartanya jika ia memiliki harta, jika ia tidak memiliki harta (untuk menebus bagian partnernya) maka budak tersebut dipekerjakan kepada partnernya sesuai dengan harga tebusannya tanpa memberatkannya.\" Dan telah menceritakan kepada kami ['Ali bin Khasyram] telah mengabarkan kepada kami [Isa yaitu Ibnu Yunus] dari [Sa'id bin Abi Arubah] dengan isnad ini, dengan menambahkan; \"Jika ia tidak memiliki harta, maka budak tersebut harganya dinilai dengan harga yang adil, kemudian ia dipekerjakan kepada pemilik (yang tidak memerdekakan) nya tanpa memberatkannya.\" Telah menceritakan kepadaku [Harun bin Abdullah] telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [ayahku] dia berkata; Saya mendengar [Qatadah] menceritakan dengan isnad ini seperti makna hadits Abu Arubah dan disebutkan dalam hadits \"(Harganya) dinilai dengan harga yang adil.\""
            },
            {
                "number": 2563,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عَائِشَةَأَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ وَلَاءَهَا لَنَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا يَمْنَعُكِ ذَلِكِ فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] dari ['Aisyah] bahwa dia ingin membeli seorang budak perempuan yang akan dibebaskan, maka pemiliknya berkata; \"Kami akan menjual budak ini kepadamu dengan syarat perwaliannya untuk kami.\" Maka Aisyah memberitahukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, lantas beliau bersabda: \"Janganlah hal itu menghalangi kamu (untuk membelinya) karena perwalian itu untuk orang yang membebaskan budak.\""
            },
            {
                "number": 2564,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِي كِتَابَتِهَا وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا فَقَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لِأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ وَيَكُونَ لَنَا وَلَاؤُكِ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعِي فَأَعْتِقِي فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنْ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ وَإِنْ شَرَطَ مِائَةَ مَرَّةٍ شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُحَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ جَاءَتْ بَرِيرَةُ إِلَيَّ فَقَالَتْ يَا عَائِشَةُ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ أُوقِيَّةٌ بِمَعْنَى حَدِيثِ اللَّيْثِ وَزَادَ فَقَالَ لَا يَمْنَعُكِ ذَلِكِ مِنْهَا ابْتَاعِي وَأَعْتِقِي وَقَالَ فِي الْحَدِيثِ ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah] telah mengabarkan kepadanya bahwa Barirah datang kepada 'Aisyah untuk meminta bantuan dalam hal penebusan dirinya, sedangkan dia belum membayar tebusannya sama sekali, lalu 'Aisyah berkata kepadanya; \"Kembalilah kepada keluargamu, jika mereka mau saya akan membayar tebusanmu, dan hak perwalianmu padaku, maka saya akan melunasinya.\" Lalu Barirah menyampaikan hal itu kepada tuannya, namun tuannya tidak menyetujuinya, justru mereka berkata; \"Silahkan jika Aisyah ingin menebusmu, namun hak perwalianmu tetap pada kami.\" Kemudian Aisyah memberitahukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, lantas Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Tebuslah dan merdekakanlah dia, karena hak perwalian itu bagi orang yang memerdekakan.\" Setelah itu Rasulullah shallallahu 'alaihi wasallam berdiri sambil bersabda: \"Apa urusan orang-orang yang memberikan persyaratan yang tidak pernah ada pada Kitabullah. Barangsiapa yang mensyaratkan suatu syarat yang tidak terdapat dalam Kitabullah, maka ia tidak berhak mendapatkannya, walaupun dia mensyaratkan seratus kali, kerana syarat Allah lebih berhak untuk dilaksanakan dan lebih kuat.\" Telah menceritakan kepada kami [Abu Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari ['Urwah bin Zubair] dari ['Aisyah, istri Nabi shallallahu 'alaihi wasallam] telah mengabarkan. "
            },
            {
                "number": 2565,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنِي أَبِي عَنْ عَائِشَةَ قَالَتْدَخَلَتْ عَلَيَّ بَرِيرَةُ فَقَالَتْ إِنَّ أَهْلِي كَاتَبُونِي عَلَى تِسْعِ أَوَاقٍ فِي تِسْعِ سِنِينَ فِي كُلِّ سَنَةٍ أُوقِيَّةٌ فَأَعِينِينِي فَقُلْتُ لَهَا إِنْ شَاءَ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً وَأُعْتِقَكِ وَيَكُونَ الْوَلَاءُ لِي فَعَلْتُ فَذَكَرَتْ ذَلِكَ لِأَهْلِهَا فَأَبَوْا إِلَّا أَنْ يَكُونَ الْوَلَاءُ لَهُمْ فَأَتَتْنِي فَذَكَرَتْ ذَلِكَ قَالَتْ فَانْتَهَرْتُهَا فَقَالَتْ لَا هَا اللَّهِ إِذَا قَالَتْ فَسَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَنِي فَأَخْبَرْتُهُ فَقَالَ اشْتَرِيهَا وَأَعْتِقِيهَا وَاشْتَرِطِي لَهُمْ الْوَلَاءَ فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ فَفَعَلْتُ قَالَتْ ثُمَّ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةً فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ فَمَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ كِتَابُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ مَا بَالُ رِجَالٍ مِنْكُمْ يَقُولُ أَحَدُهُمْ أَعْتِقْ فُلَانًا وَالْوَلَاءُ لِي إِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ جَرِيرٍ كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ أَبِي أُسَامَةَ غَيْرَ أَنَّ فِي حَدِيثِ جَرِيرٍ قَالَ وَكَانَ زَوْجُهَا عَبْدًا فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَارَتْ نَفْسَهَا وَلَوْ كَانَ حُرًّا لَمْ يُخَيِّرْهَا وَلَيْسَ فِي حَدِيثِهِمْ أَمَّا بَعْدُ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala` Al Hamdani] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hisyam bin Urwah] telah mengabarkan kepadaku [ayahku] dari ['Aisyah] dia berkata; Suatu ketika Barirah menemuiku dan berkata; \"Sesungguhnya keluargaku (tuanku) berjanji akan membebaskanku jika saya mampu menebus diriku dengan sembilan uqiyah selama sembilan tahun, dan saya harus membayar satu uqiyah setiap setahun, oleh karena itu bantulah saya.\" Maka saya berkata kepadanya; \"Jika keluargamu (tuanmu) rela maka saya akan menebusmu secara kontan (yaitu sembilan uqiyah sekaligus), saya akan membebaskanmu, dan hak perwalianmu padaku.\" Setelah itu dia menyampaikan hal itu kepada keluarganya (tuannya), namun mereka menolak kecuali jika hak perwaliannya tetap pada mereka. Kemudian dia menemuiku dan menyampaikan hal itu kepadaku, lalu saya meghardiknya dan berkata; \"Demi Allah, tidak seperti itu aturannya.\" Aisyah melanjutkan; Ternyata Rasulullah shallallahu 'alaihi wasallam mendengar hal ini, maka beliau bertanya kepadaku, lalu saya memberitahukan kepada beliau apa yang terjadi. Lantas beliau bersabda: \"Belilah dia dan bebaskanlah dia serta mintalah syarat supaya perwalian ada padamu, sebab perwalian itu bagi orang yang memerdekakan.\" Akhirnya saya malakukannya. Tidak lama setelah itu, Rasulullah shallallahu 'alaihi wasallam berkhutbah di waktu Isya`, setelah beliau memuji Allah dengan puji-pujian yang pantas bagi-Nya, beliau lalu bersabda: \"Amma Ba'du, apa urusannya orang-orang memberikan persyaratan? Persyaratan apa saja yang tidak pernah ada pada Kitabullah Azza Wa Jalla, maka persyaratannya bathil walaupun dia mensyaratkan seratus kali, sebab Kitabullah lebih berhak untuk ditunaikan dan syarat Allah lebih kuat. Lantas apa urusannya salah seorang dari kalian yang mengatakan; 'Merdekakanlah fulan dengan syarat perwaliannya masih padaku, \" sesungguhnya perwalian itu bagi orang yang memerdekakan.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Numair]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki']. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] semuanya dari [Jarir] semuanya dari [Hisyam bin Urwah] dengan isnad ini, seperti hadits riwayat Abu Usamah, hanya saja dia dalam hadits Jabir disebutkan; Bahwa suaminya (Barirah) statusnya masih budak, lalu Rasulullah shallallahu 'alaihi wasallam memberikan pilihan, maka dia memilih dirinya, seandainya suaminya medeka niscaya beliau tidak memberinya pilihan. Dan dalam hadits mereka tidak disebutkan; \"Amma ba'du.\" "
            },
            {
                "number": 2566,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْعَلَاءِ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ فِي بَرِيرَةَ ثَلَاثُ قَضِيَّاتٍ أَرَادَ أَهْلُهَا أَنْ يَبِيعُوهَا وَيَشْتَرِطُوا وَلَاءَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اشْتَرِيهَا وَأَعْتِقِيهَا فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ قَالَتْ وَعَتَقَتْ فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَارَتْ نَفْسَهَا قَالَتْ وَكَانَ النَّاسُ يَتَصَدَّقُونَ عَلَيْهَا وَتُهْدِي لَنَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ لَكُمْ هَدِيَّةٌ فَكُلُوهُ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al 'Ala`] sedangkan lafazhnya dari Zuhair, keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Hisyam bin Urwah] dari [Abdurrahman bin Qasim] dari [ayahnya] dari ['Aisyah] dia berkata; Barirah memiliki tiga perkata, yaitu tuannya menginginkan untuk menjualnya dengan syarat perwaliannya untuk mereka, lantas hal itu saya sampaikan kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Belilah dan bebaskanlah dia, karena sesungguhnya perwalian itu bagi orang yang memerdekakannya.\" Aisyah melanjutkan; Kemudian dia dibebaskan, setelah itu Rasulullah shallallahu 'alaihi wasallam memberikan pilihan (antara dirinya atau tetap bersama suaminya yang masih budak), namun dia memilih dirinya. Aisyah melanjutkan; Suatu ketika orang-orang bersedekah kepadanya, dan dia menghadiahkannya kepada kami, lalu saya memberitahukan hal itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Hal itu buatnya adalah sedekah, namun buat kalian adalah hadiah darinya, maka makanlah.\" "
            },
            {
                "number": 2567,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ سِمَاكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّهَا اشْتَرَتْ بَرِيرَةَ مِنْ أُنَاسٍ مِنْ الْأَنْصَارِ وَاشْتَرَطُوا الْوَلَاءَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَلَاءُ لِمَنْ وَلِيَ النِّعْمَةَ وَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ زَوْجُهَا عَبْدًا وَأَهْدَتْ لِعَائِشَةَ لَحْمًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ صَنَعْتُمْ لَنَا مِنْ هَذَا اللَّحْمِ قَالَتْ عَائِشَةُ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Husain bin 'Ali] dari [Za`idah] dari [Simak] dari [Abdurrahman bin Qasim] dari [ayahnya] dari ['Aisyah] bahwa dia membeli Barirah dari keluarga orang Anshar, namun mereka mensyaratkan hak perwalian. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hak perwalian itu bagi orang yang memerdekakannya.\" Lalu Rasulullah shallallahu 'alaihi wasallam memberikan pilihan, saat itu suaminya adalah seorang budak, dan dia pernah menghadiahkan daginga kepada Aisyah, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya kalian membuat makanan dari daging ini.\" 'Aisyah berkata; \"Ini adalah daging yang disedekahkan kepada Barirah.\" Maka beliau bersabda: \"Daging itu untuknya adalah sedekah sedangkan untuk kita adalah hadiah.\" "
            },
            {
                "number": 2568,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ قَالَ سَمِعْتُ الْقَاسِمَ يُحَدِّثُ عَنْ عَائِشَةَأَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ بَرِيرَةَ لِلْعِتْقِ فَاشْتَرَطُوا وَلَاءَهَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اشْتَرِيهَا وَأَعْتِقِيهَا فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ وَأُهْدِيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمٌ فَقَالُوا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَهُوَ لَنَا هَدِيَّةٌ وَخُيِّرَتْ فَقَالَ عَبْدُ الرَّحْمَنِ وَكَانَ زَوْجُهَا حُرًّا قَالَ شُعْبَةُ ثُمَّ سَأَلْتُهُ عَنْ زَوْجِهَا فَقَالَ لَا أَدْرِيو حَدَّثَنَاه أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata; Saya mendengar [Abdurrahman bin Qasim] berkata; Saya mendengar [Qasim] menceritakan dari ['Aisyah] bahwa dia hendak membeli Barirah untuk dibebaskan, namun keluarganya mensyaratkan hak perwalian, lalu hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau bersabda: \"Belilah dan bebaskanlah dia, karena hak perwalian itu bagi orang yang memerdekakannya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam diberi hadiah sepotong daging, mereka (keluarga Nabi) berkata kepada Nabi shallallahu 'alaihi wasallam, \"Daging ini disedekahkan kepada Barirah. Maka beliau bersabda: \"Baginya adalah sedekah sedangkan bagi kita adalah hadiah.\" Dan dia juga diberi pilihan. Andurrahman berkata; Suaminya adalah seorang yang merdeka. Syu'bah berkata; Kemudian saya bertanya kepadanya tentang status suaminya, dia menjawab; Saya tidak tahu. Dan telah menceritakan kepada kami [Ahmad bin Utsman An Naufali] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Syu'bah] dengan isnad seperti ini."
            },
            {
                "number": 2569,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ جَمِيعًا عَنْ أَبِي هِشَامٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُغِيرَةُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ أَبُو هِشَامٍ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكَانَ زَوْجُ بَرِيرَةَ عَبْدًا",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] semuanya dari [Abu Hisyam]. [Ibnu Al Mutsanna] berkata; Telah menceritakan kepada kami [Mughirah bin Salamah Al Makhzumi Abu Hisyam] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami ['ubaidhullah] dari [Yazid bin Ruman] dari [Urwah] dari ['Aisyah] bahwa suami Barirah adalah seorang budak."
            },
            {
                "number": 2570,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْكَانَ فِي بَرِيرَةَ ثَلَاثُ سُنَنٍ خُيِّرَتْ عَلَى زَوْجِهَا حِينَ عَتَقَتْ وَأُهْدِيَ لَهَا لَحْمٌ فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْبُرْمَةُ عَلَى النَّارِ فَدَعَا بِطَعَامٍ فَأُتِيَ بِخُبْزٍ وَأُدُمٍ مِنْ أُدُمِ الْبَيْتِ فَقَالَ أَلَمْ أَرَ بُرْمَةً عَلَى النَّارِ فِيهَا لَحْمٌ فَقَالُوا بَلَى يَا رَسُولَ اللَّهِ ذَلِكَ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَكَرِهْنَا أَنْ نُطْعِمَكَ مِنْهُ فَقَالَ هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ مِنْهَا لَنَا هَدِيَّةٌ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا إِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ",
                "id": "Telah menceritakan kepada kami [Abu Thahir] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami [Malik bin Anas] dari [Rabi'ah bin Abi Abdirrahman] dari [Qasim bin Muhammad] dari ['Aisyah] istri Nabi shallallahu 'alaihi wasallam bahwa dia berkata; \"Dalam kasus Barirah ada tiga pelajaran yaitu; dia diberi pilihan atas suaminya ketika dia dibebaskan, dia juga pernah diberi daging, lalu Rasulullah shallallahu 'alaihi wasallam masuk ke rumahku, ketika itu ada tungku yang sedang dipanasi di atas api, kemudian beliau meminta dihidangkan makanan, lalu beliau diberi roti dan lauk pauk yang ada di rumah, lalu beliau bertanya: \"Tidakkah tadi saya melihat periuk di atas api yang berisi daging?\" Mereka menjawab; \"Ya, wahai Rasulullah, itu adalah daging yang tadi disedekahkan kepada Barirah, sehingga kami tidak suka untuk memberikannya kepada Anda.\" Beliau bersabda: \"Daging tersebut bagi Barirah adalah sedekah, sedangkan bagi kita adalah hadiah dari Barirah.\" Dan Nabi shallallahu 'alaihi wasallam bersabda mengenai dirinya: \"Sesungguhnya hak perwalian adalah untuk orang yang memerdekakan.\" "
            },
            {
                "number": 2571,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ حَدَّثَنِي سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَأَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا فَأَبَى أَهْلُهَا إِلَّا أَنْ يَكُونَ لَهُمْ الْوَلَاءُ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا يَمْنَعُكِ ذَلِكِ فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi syaibah] telah menceritakan kepada kami [Khalid bin Makhlad] dari [Sulaiman bin Bilal] telah menceritakan kepadaku [Suhail bin Abi Shalih] dari [ayahnya] dari [Abu Hurairah] dia berkata; 'Aisyah pernah ingin membeli seorang budak yang ingin dimerdekakan, tapi tuannya menolak kecuali jika hak perwaliannya diberikan kepada mereka. Kemudian hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, lalu berliau bersabda: \"Hal itu bukan menjadi penghalang bagimu, karena hak perwalian itu untuk orang yang memerdekakan.\""
            },
            {
                "number": 2572,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِقَالَ مُسْلِم النَّاسُ كُلُّهُمْ عِيَالٌ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي هَذَا الْحَدِيثِ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا ابْنُ عُيَيْنَةَ ح و حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا عُبَيْدُ اللَّهِ ح و حَدَّثَنَا ابْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ كُلُّ هَؤُلَاءِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّ الثَّقَفِيَّ لَيْسَ فِي حَدِيثِهِ عَنْ عُبَيْدِ اللَّهِ إِلَّا الْبَيْعُ وَلَمْ يَذْكُرْ الْهِبَةَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Sulaiman bin Bilal] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang jual beli wala' dan menghibahkannya. Muslim berkata; \"Manusia semuanya akan selalu membutuhkan Abdullah bin Dinar dalam permasalahan hadits ini.\" Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Ibnu 'Uyainah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] serta [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il bin Ja'far]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Sufyan bin Sa'id]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Abdul Wahhab] telah menceritakan kepada kami ['ubaidhullah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Rafi'] telah menceritakan kepada kami [Abu Fudaik] telah mengabarkan kepada kami [Adl Dlahhak yaitu Ibnu Utsman] mereka semuanya dari [Abdullah bin Dinar] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas, hanya saja dalam hadits riwayat At Tsaqafi dari Ubaidillah tidak disebutkan kecuali tentang jual beli dan tidak menyebutkan hibah. "
            },
            {
                "number": 2573,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاكَتَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كُلِّ بَطْنٍ عُقُولَهُ ثُمَّ كَتَبَ أَنَّهُ لَا يَحِلُّ لِمُسْلِمٍ أَنْ يُتَوَالَى مَوْلَى رَجُلٍ مُسْلِمٍ بِغَيْرِ إِذْنِهِ ثُمَّ أُخْبِرْتُ أَنَّهُ لَعَنَ فِي صَحِيفَتِهِ مَنْ فَعَلَ ذَلِكَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdullah] berkata; Nabi shallallahu 'alaihi wasallam menetapkan denda di setiap isi perut (janin), beliau juga menetapkan bahwa tidak halal bagi seorang Muslim mempekerjakan budak milik muslim lainnya tanpa seizinnya. Kemudian saya diberitahu bahwa beliau pernah melaknat siapa saja yang melakukan hal itu di secarik kertas. "
            },
            {
                "number": 2574,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ لَا يُقْبَلُ مِنْهُ عَدْلٌ وَلَا صَرْفٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub yaitu Ibnu Abdurrahman Al Qari], dari [Suhail] dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjadikan budak suatu kaum tanpa seizin walinya (tuannya) maka baginya adalah laknat Allah dan para Malaikat, serta tidak akan diterima ibadahnya maupun taubatnya.\" "
            },
            {
                "number": 2575,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ سُلَيْمَانَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ عَدْلٌ وَلَا صَرْفٌو حَدَّثَنِيهِ إِبْرَاهِيمُ بْنُ دِينَارٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا شَيْبَانُ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ وَمَنْ وَالَى غَيْرَ مَوَالِيهِ بِغَيْرِ إِذْنِهِمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Husain bin Ali Al Ju'fi] dari [Za`idah] dari [Sulaiman] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa menjadikan budak suatu kaum tanpa seizin walinya (tuannya) maka bagianya laknat Allah, para Malaikat dan manusia semuanya, tidak akan diterima ibadahnya dan juga taubatnya.\" Dan telah menceritakan kepadaku [Ibrahim bin Dinar] telah menceritakan kepada kami ['ubaidhullah bin Musa] telah menceritakan kepada kami [Syaiban] dari [Al A'masy] dengan isnad ini, namun ia menyebutkan sabda beliau; \"Barangsiapa yang menjadikan budak orang lain tanpa seizin mereka (para walinya).\""
            },
            {
                "number": 2576,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِ قَالَخَطَبَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ فَقَالَ مَنْ زَعَمَ أَنَّ عِنْدَنَا شَيْئًا نَقْرَؤُهُ إِلَّا كِتَابَ اللَّهِ وَهَذِهِ الصَّحِيفَةَ قَالَ وَصَحِيفَةٌ مُعَلَّقَةٌ فِي قِرَابِ سَيْفِهِ فَقَدْ كَذَبَ فِيهَا أَسْنَانُ الْإِبِلِ وَأَشْيَاءُ مِنْ الْجِرَاحَاتِ وَفِيهَا قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ فَمَنْ أَحْدَثَ فِيهَا حَدَثًا أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يَقْبَلُ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا وَلَا عَدْلًا وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى بِهَا أَدْنَاهُمْ وَمَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يَقْبَلُ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا وَلَا عَدْلًا",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim At Taimi] dari [ayahnya] dia berkata; \" [Ali bin Abi Thalib] berkhutbah, seraya mengatakan; \"Barangsiapa yang mengira bahwa di sisi kami ada sesuatu yang kami baca selain Kitabullah dan lembaran ini -ayah Ibrahim berkata; saat itu lembaran tesebut menggantung di sarungnya- sungguh dia telah berdusta, di dalamnya terdapat penjelasan tentang umur-rumu unta dan hukum-hukum melukai, dan di dalamnya juga tertulis bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kota Madinah dijadikan kota Haram (suci) yaitu antara 'Air hingga Tsaur. Barangsiapa yang berbuat kejahatan padanya atau melindungi pelaku kejahatan, maka ia berhak mendapat laknat Allah, Maliakat dan seluruh manusia, tidak diterima amalan fardhu maupun amalan sunnahnya. Jaminan (perlindungan) kaum Muslimin adalah satu, di mana bisa diusahakan oleh orang yang paling rendah dari mereka sekalipun. Barangsiapa yang menisbatkan diri kepada selain ayahnya, atau kepada selain walinya, maka ia berhak mendapatkan laknat dari Allah, para Malaikat dan manusia seluruhnya, Allah tidak akan menerima amalan fardhunya maupun amalam sunnahnya kelak di Hari Kiamat.\" "
            },
            {
                "number": 2577,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ وَهُوَ ابْنُ أَبِي هِنْدٍ حَدَّثَنِي إِسْمَعِيلُ بْنُ أَبِي حَكِيمٍ عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً أَعْتَقَ اللَّهُ بِكُلِّ إِرْبٍ مِنْهَا إِرْبًا مِنْهُ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna Al 'Anazi] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Abdullah bin Sa'id] dia adalah Ibnu Abi Hind, telah menceritakan kepadaku [Isma'il bin Abi Hakim] dari [Sa'id bin Marjanah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang memerdekakan budak beriman, maka Allah akan membebaskan setiap anggota tubuhnya dari api neraka dengan setiap anggota tubuh budak yang dia merdekakan.\" "
            },
            {
                "number": 2578,
                "arab": "و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ مُطَرِّفٍ أَبِي غَسَّانَ الْمَدَنِيِّ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ رَقَبَةً أَعْتَقَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهَا عُضْوًا مِنْ أَعْضَائِهِ مِنْ النَّارِ حَتَّى فَرْجَهُ بِفَرْجِهِ",
                "id": "Dan telah menceritakan kepada kami [Daud bin Rusyaid] telah menceritakan kepada kami [Walid bin Muslim] dari [Muhammad bin Mutharrif Abu Ghassan Al Madani] dari [Zaid bin Aslam] dari ['Ali bin Husain] dari [Sa'id bin Marjanah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang memerdekakan budak, maka Allah akan membebaskan setiap anggota badannya dari api neraka dengan setiap anggota badan budak yang dimerdekakan, hingga kemaluannya dengan kemaluan (budak yang dimerdekakan).\""
            },
            {
                "number": 2579,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ الْهَادِ عَنْ عُمَرَ بْنِ عَلِيِّ بْنِ حُسَيْنٍ عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ عَنْ أَبِي هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً أَعْتَقَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْ النَّارِ حَتَّى يُعْتِقَ فَرْجَهُ بِفَرْجِهِ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Al Hadi] dari [Umar bin Ali bin Husain] dari [Sa'id bin Marjanah] dari [Abu Hurairah] dia berkata, saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membebaskan buda beriman, maka Allah akan membebaskan setiap anggota badannya dari api neraka dengan seiap anggota tubuh budak yang dia merdekakan, sampai kemaluan dengan kemaluannya.\" "
            },
            {
                "number": 2580,
                "arab": "و حَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عَاصِمٌ وَهُوَ ابْنُ مُحَمَّدٍ الْعُمَرِيُّ حَدَّثَنَا وَاقِدٌ يَعْنِي أَخَاهُ حَدَّثَنِي سَعِيدُ ابْنُ مَرْجَانَةَ صَاحِبُ عَلِيِّ بْنِ حُسَيْنٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ امْرَأً مُسْلِمًا اسْتَنْقَذَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنْ النَّارِقَالَ فَانْطَلَقْتُ حِينَ سَمِعْتُ الْحَدِيثَ مِنْ أَبِي هُرَيْرَةَ فَذَكَرْتُهُ لِعَلِيِّ بْنِ الْحُسَيْنِ فَأَعْتَقَ عَبْدًا لَهُ قَدْ أَعْطَاهُ بِهِ ابْنُ جَعْفَرٍ عَشْرَةَ آلَافِ دِرْهَمٍ أَوْ أَلْفَ دِينَارٍ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] telah menceritakan kepada kami [Bisr bin Al Mufadldlal] telah menceritakan kepada kami ['Ashim] dia adalah Ibnu Muhammad Al Umari, telah menceritakan kepada kami [Waqid] yaitu saudara laki-lakinya, telah menceritakan kepadaku [Sa'id bin Marjanah] sahabat Ali bin Husain, dia berkata; Saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa saja seorang muslim yang memerdekakan muslim lainnya, maka Allah akan menyelamatkan setiap anggota tubuhnya dari api neraka dengan setiap anggota tubuh orang yang dimerdekakannya.\" Sa'id berkata; Setelah mendengar penuturan Abu Hurairah, saya bergegas menemui Ali bin Husain dan menyampaikan hal itu kepadanya, lantas dia memerdekakan budak dari pemberian Ibnu Ja'far dengan tebusan sepuluh ribu dirham atau seribu dinar."
            },
            {
                "number": 2581,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْزِي وَلَدٌ وَالِدًا إِلَّا أَنْ يَجِدَهُ مَمْلُوكًا فَيَشْتَرِيَهُ فَيُعْتِقَهُوَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ وَلَدٌ وَالِدَهُ و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنِي عَمْرٌو النَّاقِدُ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ كُلُّهُمْ عَنْ سُفْيَانَ عَنْ سُهَيْلٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَقَالُوا وَلَدٌ وَالِدَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Jarir] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang anak belum dikatakan membalas (kebaikan) orang tuanya, kecuali jika didapati bapaknya sebagai sahaya, lalu dia membelinya dan memerdekakannya.\" Dan dalam riwayatnya Abu Syaibah dikatakan; \"Seorang anak terhadap ayahnya.\" Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku ['Amru An Naqid] telah menceritakan kepada kami [Abu Ahmad Az Zubairi] semuanya dari [Sufyan] dari [Suhail] dengan isnad seperti ini, dan mereka menyebutkan; \"Seorang anak terhadap ayahnya.\""
            },
            {
                "number": 2582,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِو حَدَّثَنَا أَبُو كُرَيْبٍ وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dia berkata; Saya membaca di hadapan [Malik] dari [Muhammad bin Yahya bin Habban] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam melarang jual beli Mulamasah (yaitu: jual beli dengan sistem menyentuh pakaian tanpa melihatnya) dan Munabadzah (yaitu: melemparkan pakaian dengan maksud menjualnya sebelum memeriksanya dan menjualnya). Dan telah menceritakan kepada kami [Abu Kuraib] dan [Ibnu Abi Umar] keduanya berkata; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas. Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ibnu Numair] dan [Abu Usamah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul Wahhab] semuanya dari ['Ubaidillah bin Umar] dari [Khubaib bin Abdurrahman] dari [Hafsh bin 'Ashim] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas. Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub] yaitu Ibnu Abdurrahman dari [Suhail bin Abi Shalih] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
            },
            {
                "number": 2583,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ عَنْ عَطَاءِ بْنِ مِينَاءَ أَنَّهُ سَمِعَهُ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَنُهِيَ عَنْ بَيْعَتَيْنِ الْمُلَامَسَةِ وَالْمُنَابَذَةِأَمَّا الْمُلَامَسَةُ فَأَنْ يَلْمِسَ كُلُّ وَاحِدٍ مِنْهُمَا ثَوْبَ صَاحِبِهِ بِغَيْرِ تَأَمُّلٍ وَالْمُنَابَذَةُ أَنْ يَنْبِذَ كُلُّ وَاحِدٍ مِنْهُمَا ثَوْبَهُ إِلَى الْآخَرِ وَلَمْ يَنْظُرْ وَاحِدٌ مِنْهُمَا إِلَى ثَوْبِ صَاحِبِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Amru bin Dinar] dari ['Atha` bin Mina`] bahwa dia mendengarnya telah menceritakan dari [Abu Hurairah] bahwa dia berkata; \"Telah dilarang dua system jual beli, yaitu Mulamasah dan Munabadzah, adapun Mulamasah ialah salah seorang menyentuh pakaian saudaranya tanpa melihat terlebih dahulu. Sedangkan Munabadzah ialah salah seorang melempar pakaian ke temannya dengan maksud menjual, sedangkan temannya tidak perlu melihat pakaian saudaranya tersebut.\" "
            },
            {
                "number": 2584,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى وَاللَّفْظُ لِحَرْمَلَةَ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ وَلِبْسَتَيْنِ نَهَى عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِ فِي الْبَيْعِوَالْمُلَامَسَةُ لَمْسُ الرَّجُلِ ثَوْبَ الْآخَرِ بِيَدِهِ بِاللَّيْلِ أَوْ بِالنَّهَارِ وَلَا يَقْلِبُهُ إِلَّا بِذَلِكَ وَالْمُنَابَذَةُ أَنْ يَنْبِذَ الرَّجُلُ إِلَى الرَّجُلِ بِثَوْبِهِ وَيَنْبِذَ الْآخَرُ إِلَيْهِ ثَوْبَهُ وَيَكُونُ ذَلِكَ بَيْعَهُمَا مِنْ غَيْرِ نَظَرٍ وَلَا تَرَاضٍ و حَدَّثَنِيهِ عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah bin Yahya] sedangkan lafazhnya dari Harmalah, keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Amir bin Sa'ad bin Abi Waqqash] bahwa [Abu Sa'id Al Khudri] pernah berkata; Rasulullah shallallahu 'alaihi wasallam melarang dua traksaksi dan dua pakain, beliau melarang Mulamasah dan Munabadzah dalam jual beli, Mulamazah ialah seseorang menyentuh pakaian penjual di siang atau malam hari dan tidak membolik-baliknya dengan teliti, sedangkan Munabadzah ialah seseorang melemparkan kainnya kepada orang lain, dan ia melempar kainnya kepada orang tersebut, maka dengan begitu terjadilah jual beli tanpa meneliti dan tanpa adanya persetujuan.\" Dan telah menceritakan kepadaku [Amru An Naqid] telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [bapakku] dari [Shalih] dari [Ibnu Syihab] dengan sanad ini."
            },
            {
                "number": 2585,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَيَحْيَى بْنُ سَعِيدٍ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لَهُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْحَصَاةِ وَعَنْ بَيْعِ الْغَرَرِ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dan [Yahya bin Sa'id] serta [Abu Usamah] dari [Ubaidillah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Zuhair bin Harb] sedangkan lafazh darinya, telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Ubaidillah] telah menceritakan kepadaku [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang jual beli dengan cara hashah (yaitu: jual beli dengan melempar kerikil) dan cara lain yang mengandung unsur penipuan."
            },
            {
                "number": 2586,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Muhammad bin Rumh] keduanya berkata; Telah mengabarkan kepada kami [Al Laits]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Abdullah] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau melarang jual beli janin (binatang) yang masih dalam kandungan. "
            },
            {
                "number": 2587,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَكَانَ أَهْلُ الْجَاهِلِيَّةِ يَتَبَايَعُونَ لَحْمَ الْجَزُورِ إِلَى حَبَلِ الْحَبَلَةِ وَحَبَلُ الْحَبَلَةِ أَنْ تُنْتَجَ النَّاقَةُ ثُمَّ تَحْمِلَ الَّتِي نُتِجَتْ فَنَهَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] sedangkan lafazhnya dari Zuhair, keduanya berkata; Telah menceritakan kepada kami [Yahya] dia adalah Al Qaththan, dari [Ubaidillah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] dia berkata; \"Dahulu orang-orang Jahiliyah terbiasa melakukan jual beli daging unta dengan habalul habalah, maksud habalul habalah ialah seekor unta betina disetubuhi unta jantan, kemudian unta betina mengandung (janin yang dikandung tersebutlah yang dijadikan transaksi), maka Rasulullah shallallahu 'alaihi wasallam melarang mereka jual beli seperti itu.\" "
            },
            {
                "number": 2588,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sebagian kalian menjual barang yang telah dijual kepada saudaranya.\" "
            },
            {
                "number": 2589,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِعْ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلَا يَخْطُبْ عَلَى خِطْبَةِ أَخِيهِ إِلَّا أَنْ يَأْذَنَ لَهُ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] sedangkan lafazhnya dari Zuhair, keduanya berkata; Telah menceritakan kepada kami [Yahya] dari ['Ubaidillah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah seseorang menjual barang yang telah dijual kepada saudaranya dan janganlah meminang perempuan yang telah dipinang saudaranya, kecuali jika mendapatkan izin darinya.\""
            },
            {
                "number": 2590,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَسُمْ الْمُسْلِمُ عَلَى سَوْمِ أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah bin Sa'id] serta [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] dia adalah Ibnu Ja'far, dari [Al 'Ala`] dari [ayahya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang muslim menawar harga barang yang telah ditawar (dan disepakati harganya) oleh muslim lainnya.\" "
            },
            {
                "number": 2591,
                "arab": "و حَدَّثَنِيهِ أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنِي عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ عَنْ الْعَلَاءِ وَسُهَيْلٍ عَنْ أَبِيهِمَا عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَسْتَامَ الرَّجُلُ عَلَى سَوْمِ أَخِيهِوَفِي رِوَايَةِ الدَّوْرَقِيِّ عَلَى سِيمَةِ أَخِيهِ",
                "id": "Dan telah menceritakan kepadaku [Ahmad bin Ibrahim Ad Dauraqi] telah menceritakan kepadaku ['Abdush Shammad] telah menceritakan kepada kami [Syu'bah] dari [Al 'Ala`] dan [Suhail] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdush Shamad] telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari ['Adi] dia adalah Ibnu Tsabit, dari [Abu Hazim] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam melarang seseorang menawar harga barang yang telah ditawar (dan disepakati harga) saudaranya. Dan dalam riwayatnya Ad Dauraqi dikatakan; Atas tawaran harga saudaranya. "
            },
            {
                "number": 2592,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُتَلَقَّى الرُّكْبَانُ لِبَيْعٍ وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلَا تَنَاجَشُوا وَلَا يَبِعْ حَاضِرٌ لِبَادٍ وَلَا تُصَرُّوا الْإِبِلَ وَالْغَنَمَ فَمَنْ ابْتَاعَهَا بَعْدَ ذَلِكَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا فَإِنْ رَضِيَهَا أَمْسَكَهَا وَإِنْ سَخِطَهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah mencegat pedagang untk memborong barang-barangnya (sebelum sampai ke pasar); jangan membali barang yang sedang dibeli orang lain; jangan menipu; orang kota hendaknya tidak memborong dagangan orang dusun (dengan maksud monopoli dan menaikkan harga); jangan menahan susu unta atau kambing yang akan dijual supaya kelihatan susunya banyak. Jika dia membeli dan memerahnya setelah membali, maka dia boleh memilih dari dua keadaan, jika ia suka, maka dia boleh ditahannya namun jika tidak suka dia boleh mengembalikannya dengan satu sha' kurma (pengganti susu dan perahannya).\" "
            },
            {
                "number": 2593,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّلَقِّي لِلرُّكْبَانِ وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ وَأَنْ تَسْأَلَ الْمَرْأَةُ طَلَاقَ أُخْتِهَا وَعَنْ النَّجْشِ وَالتَّصْرِيَةِ وَأَنْ يَسْتَامَ الرَّجُلُ عَلَى سَوْمِ أَخِيهِو حَدَّثَنِيهِ أَبُو بَكْرِ بْنُ نَافِعٍ حَدَّثَنَا غُنْدَرٌ ح و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ ح و حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ حَدَّثَنَا أَبِي قَالُوا جَمِيعًا حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ فِي حَدِيثِ غُنْدَرٍ وَوَهْبٍ نُهِيَ وَفِي حَدِيثِ عَبْدِ الصَّمَدِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى بِمِثْلِ حَدِيثِ مُعَاذٍ عَنْ شُعْبَةَ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Mu'adz Al Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari ['Adi yaitu Ibnu Tsabit] dari [Abu Hazim] dari [Abu Hurairah] bahwasannya Rasulullah shallallahu 'alaihi wasallam melarang dari mencegat pedagang (sebelum sampai ke pasar untuk memborong dagangannya), memborong dagangan orang dusun (unutk mendapatkan laba yang berlipat-lipat), seorang wanita meminta suaminya untuk menceraikan madunya, jual beli najsy (menambahkan harga barang dengan tujuan menipu pembeli), menahan susu ternak yang akan dijual supaya kelihatan air susunya banyak, dan menawar barang yang sudah dtawar orang lain.\" Telah menceritakan kepadaku [Abu Bakar bin Nafi'] telah menceritakan kepada kami [Ghundar]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Wahb bin Jarir]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abdul Warits bin Abdush Shamad] telah menceritakan kepada kami [ayahku] mereka semua mengatakan; Telah menceritakan kepada kami Syu'bah dengan isnad haditsnya Ghundar dan Wahb yaitu dengan lafazh; \"Dilarang\". Sedangkan dalam haditsnya Abdush Shamad disebutkan; \"Bahwa Rasulullah shallallahu 'alaihi wasallam melarang…\" seperti haditsnya Mu'adz dari Syu'bah."
            },
            {
                "number": 2594,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّجْشِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang jual beli najsy."
            },
            {
                "number": 2595,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ تُتَلَقَّى السِّلَعُ حَتَّى تَبْلُغَ الْأَسْوَاقَ وَهَذَا لَفْظُ ابْنِ نُمَيْرٍ و قَالَ الْآخَرَانِ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّلَقِّيو حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَإِسْحَقُ بْنُ مَنْصُورٍ جَمِيعًا عَنْ ابْنِ مَهْدِيٍّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ibnu Abi Za`idah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Yahya yaitu Ibnu Sa'id]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku], semuanya dari ['Ubaidillah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang seseorang menghadang barang dagangan hingga sampai di pasar-pasar. Ini adalah lafazh hadits riwayat Ibnu Numair. Sedangkan yang lainnya mengatakan; \"Bahwa Nabi shallallahu 'alaihi wasallam melarang menghadang barang dagangan.\" Dan telah menceritakan kepada kami [Muhammad bin Hatim] dan [Ishaq bin Manshur], keduanya (meriwayatkan) dari [Ibnu Mahdi] dari [Malik] dari [Nafi'], dari [Ibnu Umar], dari Nabi shallallahu 'alaihi wasallam, sama seperti hadits yang diriwayatkan Ibnu Numair dari 'Ubaidillah. "
            },
            {
                "number": 2596,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُبَارَكٍ عَنْ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ تَلَقِّي الْبُيُوعِ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Abdullah bin Mubarak] dari [At Taimi] dari [Abu Utsman] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang seseorang menghadang barang dagangan (sebelum sampai pasar)."
            },
            {
                "number": 2597,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَلَقَّى الْجَلَبُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang seseorang mencegat rombongan dagang. (yaitu, mencegat rombongan pedagang sebelum sampai ke pasar dengan maksud menjual barang dagangan mereka dengan harga berlipat-lipat). "
            },
            {
                "number": 2598,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي هِشَامٌ الْقُرْدُوسِيُّ عَنْ ابْنِ سِيرِينَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُاإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَلَقَّوْا الْجَلَبَ فَمَنْ تَلَقَّاهُ فَاشْتَرَى مِنْهُ فَإِذَا أَتَى سَيِّدُهُ السُّوقَ فَهُوَ بِالْخِيَارِ",
                "id": "Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Hisyam bin Sulaiman] dari [Ibnu Juraij] telah mengabarkan kepadaku [Hisyam Al Qurdusi] dari [Ibnu Sirin] dia berkata; saya mendengar [Abu Hurairah] berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mencegat rombongan dagang. Barangsiapa yang mencegat rombongan dagang lalu membeli dagangan darinya, sementara pemiliknya telah sampai kepasar, maka ada khiyar baginya.\" "
            },
            {
                "number": 2599,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِعْ حَاضِرٌ لِبَادٍو قَالَ زُهَيْرٌ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Amru An Naqid] serta [Zuhair bin Harb] mereka berkata; Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id bin Musayyab] dari [Abu Hurairah] yang riwayat ini dia sampaikan kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah orang kota memborong dagangan orang desa.\" Zuhair berkata; Dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang orang kota memborong dagangan orang desa."
            },
            {
                "number": 2600,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُتَلَقَّى الرُّكْبَانُ وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍقَالَ فَقُلْتُ لِابْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لَا يَكُنْ لَهُ سِمْسَارًا",
                "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Abd bin Humaid] keduanya berkata; Telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang mencegat rombongan dagang (sebelum sampai ke pasar), dan orang kota memborong dagangan orang dusun.\" Thawus berkata; Saya bertanya kepada Ibnu Abbas; \"Kenapa seseorang tidak diperbolehkan memborong dagangan orang dusun?\" Dia menjawab; \"Dilarang menjadi makelar.\" "
            },
            {
                "number": 2601,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبِعْ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقْ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍغَيْرَ أَنَّ فِي رِوَايَةِ يَحْيَى يُرْزَقُ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Zubair] dari [Jabir]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda; \"Janganlah orang kota memborong barang dagangan orang dusun, biarkanlah Allah memberikan rizki kepada sebagian mereka dari sebagian yang lain.\" Namun dalam riwayatnya Yahya dikatakan; \"Diberi rizki\". Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan ['Amru An Naqid] keduanya berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
            },
            {
                "number": 2602,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ يُونُسَ عَنْ ابْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَنُهِينَا أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ وَإِنْ كَانَ أَخَاهُ أَوْ أَبَاهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] dari [Yunus] dari [Ibnu Sirin] dari [Anas bin Malik], dia berkata; \"Kami diperingatkan agar orang kota tidak memborong barang dagangan orang dusun walaupun ia adalah saudaranya atau ayahnya sendiri.\""
            },
            {
                "number": 2603,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَنَسٍ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذٌ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ قَالَ أَنَسُ بْنُ مَالِكٍنُهِينَا عَنْ أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abi Adi] dari [Ibnu 'Aun] dari [Muhammad] dari [Anas]. Dan dari jalur lain telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Mu'adz] telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] dia berkata; [Anas bin Malik] berkata; \"Kami dilarang agar orang kota tidak menjual barang dagangan kepada orang pedalaman (badui).\""
            },
            {
                "number": 2604,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ مُوسَى بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اشْتَرَى شَاةً مُصَرَّاةً فَلْيَنْقَلِبْ بِهَا فَلْيَحْلُبْهَا فَإِنْ رَضِيَ حِلَابَهَا أَمْسَكَهَا وَإِلَّا رَدَّهَا وَمَعَهَا صَاعٌ مِنْ تَمْرٍ",
                "id": "Telah menceritakan kepada kami [Abdulah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Daud bin Qais] dari [Musa bin Yasar] dari [Abu Hurairah] dia berkata, Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa membeli kambing yang diikat puting susunya, maka ia boleh menahannya dan mengambil air susunya, jika ia berkenan dengan air susunya maka ia boleh memilikinya, tapi jika ia berkenan mengembalikannya (ia boleh mengembalikannya) dengan menyertakan satu sha' kurma.\" "
            },
            {
                "number": 2605,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ابْتَاعَ شَاةً مُصَرَّاةً فَهُوَ فِيهَا بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ إِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ رَدَّهَا وَرَدَّ مَعَهَا صَاعًا مِنْ تَمْرٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub yaitu Ibnu Abdirrahman Al Qari] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] bahwasannya Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa membeli kambing yang puting susunya diikat (agar terlihat berisi), maka ia berhak memilih selama tiga hari, jika ia berkenan menahannya maka ia boleh menahannya, dan jika ia berkenan mengembalikannya maka ia boleh mengembalikannya dengan menyertakan satu sha' kurma.\" "
            },
            {
                "number": 2606,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ حَدَّثَنَا أَبُو عَامِرٍ يَعْنِي الْعَقَدِيَّ حَدَّثَنَا قُرَّةُ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى شَاةً مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا صَاعًا مِنْ طَعَامٍ لَا سَمْرَاءَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Amru bin Jabalah bin Abi Rawwad] telah menceritakan kepada kami [Abu 'Amir yaitu Al 'Aqadi] telah menceritakan kepada kami [Qurrah] dari [Muhammad] dari [Abu Hurairah] dari Nabi Shallallu 'alaihi wa sallam beliau bersabda: \"Barangsiapa yang membeli kambing dengan puting susu diikat, maka ia berhak memilih dalam jangka waktu tiga hari, jika ia berkenan mengembalikannya maka ia boleh mengembalikannya dengan menyertakan satu sha' dari makanan bukan gandum.\" "
            },
            {
                "number": 2607,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اشْتَرَى شَاةً مُصَرَّاةً فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ رَدَّهَا وَصَاعًا مِنْ تَمْرٍ لَا سَمْرَاءَو حَدَّثَنَاه ابْنُ أَبِي عُمَرَ حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ أَيُّوبَ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ مَنْ اشْتَرَى مِنْ الْغَنَمِ فَهُوَ بِالْخِيَارِ",
                "id": "Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Muhammad] dari [Abu Hurairah] dia berkata, Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang membeli kambing yang diikat puting susunya, maka ia berhak menetapkan di antara dua pilihan, jika ia berkenan maka ia boleh menahannya, dan jika ia berkenan maka boleh mengembalikannya dengan menyertakan satu sha' kurma bukan gandum.\" Dan telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Abdul Wahhab] dari [Ayyub] dengan isnad seperti ini, namun ia menyebutkan; \"Barangsiapa yang membeli kambing maka ia berhak untuk melakukan khiyar (memilih).\" "
            },
            {
                "number": 2608,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَا أَحَدُكُمْ اشْتَرَى لِقْحَةً مُصَرَّاةً أَوْ شَاةً مُصَرَّاةً فَهُوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا إِمَّا هِيَ وَإِلَّا فَلْيَرُدَّهَا وَصَاعًا مِنْ تَمْرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dia berkata, ini seperti apa yang telah diceritakan [Abu Hurairah] kepada kami, dari Rasulullah Shallallu 'alaihi wa sallam, kemudian dia menyebutkan beberapa hadits di antaranya, dia (Abu Hurairah) berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa salah seorang dari kalian yang membeli unta bunting yang di ikat puting susunya, atau kambing yang diikat puting susunya, maka ia boleh menentukan dua pilihan setelah diambil susunya, (jika ia berkenan) ia boleh mengambilnya, jika tidak, maka ia boleh mengembalikannya dengan menyertakan satu sha' kurma.\" "
            },
            {
                "number": 2609,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ح و حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ وَقُتَيْبَةُ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُقَالَ ابْنُ عَبَّاسٍ وَأَحْسِبُ كُلَّ شَيْءٍ مِثْلَهُ حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَأَحْمَدُ بْنُ عَبْدَةَ قَالَا حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ وَهُوَ الثَّوْرِيُّ كِلَاهُمَا عَنْ عَمْرِو بْنِ دِينَارٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah menceritakan kepada kami [Hammad bin Zaid]. Dan dari jalur lain telah menceritakan kepada kami [Abu Ar Rabi' Al 'Ataki] dan [Qutaibah] keduanya berkata; Telah menceritakan kepada kami [Hammad] dari [Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] bahwasannya Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang membeli makanan, maka janganlah ia menjualnya kembali hingga menerimanya (memilikinya dengan sempurna).\" Ibnu Abbas berkata; \"Saya menganggap semuanya seperti itu\". Telah menceritakan kepada kami [Ibnu Abi Umar] dan [Ahmad bin Abdah] keduanya berkata; Telah menceritakan kepada kami [Sufyan]. Dan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Waki'] dari [Sufyan yaitu Ats Tsauri], keduanya dari [Amru bin Dinar] dengan isnad seperti ini."
            },
            {
                "number": 2610,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَقْبِضَهُقَالَ ابْنُ عَبَّاسٍ وَأَحْسِبُ كُلَّ شَيْءٍ بِمَنْزِلَةِ الطَّعَامِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi'] serta [Abd bin Humaid], Ibnu Rafi'; mengatakan; Telah menceritakan kepada kami, sedangkan yang lainnya mengatakan; Telah mengabarkan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] dia berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa membeli makanan, hendaknya ia tidak menjualnya kembali sampai ia memilikinya.\" Ibnu Abbas berkata; \"Saya menganggap semua barang seperti kedudukan makanan\"."
            },
            {
                "number": 2611,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَكْتَالَهُفَقُلْتُ لِابْنِ عَبَّاسٍ لِمَ فَقَالَ أَلَا تُرَاهُمْ يَتَبَايَعُونَ بِالذَّهَبِ وَالطَّعَامُ مُرْجَأٌ وَلَمْ يَقُلْ أَبُو كُرَيْبٍ مُرْجَأٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah], [Abu Kuraib] dan [Ishaq bin Ibrahim]. Ishaq mengatakan; Telah mengabarkan kepada kami, sedangkan yang lain mengatakan; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] dia berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang membeli makanan, janganlah menjualnya kembali sehingga ia menakarnya.\" Lalu saya bertanya kepada Ibnu Abbas, memang kenapa? Dia menjawab; Apakah kamu tidak melihat mereka saling transaksi emas dengan makanan dengan cara ditangguhkan!\" Namun Abu Kuraib tidak menyebutkan; \"Dengan cara ditangguhkan.\" "
            },
            {
                "number": 2612,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنْ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] dia berkata; Kami di zaman Rasulullah Shallallu 'alaihi wa sallam pernah membeli makanan, lantas beliau mengutus seseorang untuk memerintahkan kami agar pindah dari tempat jualan kami, menuju tempat lain sebelum kami memasarkannya. "
            },
            {
                "number": 2613,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَاللَّفْظُ لَهُ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ قَالَ وَكُنَّا نَشْتَرِي الطَّعَامَ مِنْ الرُّكْبَانِ جِزَافًا فَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَبِيعَهُ حَتَّى نَنْقُلَهُ مِنْ مَكَانِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Ubaidillah]. Dan dari jalur lain telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] dan lafazhny dari dia, telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwasannya Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang membeli makanan, maka janganlah ia menjualnya kembali sehingga ia memilikinya secara sempurna.\" Ibnu Umar berkata; \"Kami pernah membeli makanan langsung dari rombongan dagang secara acak (tanpa ditakar), maka setelah itu Rasulullah shallallahu 'alaihi wasallam melarang kami menjualnya hingga bahan makanan tersebut dipindahklan dari tempat pembelian.\" "
            },
            {
                "number": 2614,
                "arab": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ وَيَقْبِضَهُ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Abdullah bin Wahab] telah menceritakan kepadaku [Umar bin Muhammad] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa membeli makanan, maka janganlah menjualnya sebelum dia memilikinya dengan sempurna dan memegangnya.\" "
            },
            {
                "number": 2615,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّهُمْ كَانُوا يُضْرَبُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَرَوْا طَعَامًا جِزَافًا أَنْ يَبِيعُوهُ فِي مَكَانِهِ حَتَّى يُحَوِّلُوهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] bahwa mereka pernah dipukul ketika mereka memborong bahan makanan secara taksiran, kemudian menjualnya di tempat pembelian sebelum dipindahkan ke tempat lain.\" "
            },
            {
                "number": 2616,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّ أَبَاهُ قَالَقَدْ رَأَيْتُ النَّاسَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ابْتَاعُوا الطَّعَامَ جِزَافًا يُضْرَبُونَ فِي أَنْ يَبِيعُوهُ فِي مَكَانِهِمْ وَذَلِكِ حَتَّى يُؤْوُوهُ إِلَى رِحَالِهِمْقَالَ ابْنُ شِهَابٍ وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ أَبَاهُ كَانَ يَشْتَرِي الطَّعَامَ جِزَافًا فَيَحْمِلُهُ إِلَى أَهْلِهِ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Salim bin Abdullah] bahwa [ayahnya] berkata; Saya telah melihat orang-orang pada zaman Rasulullah Shallallu 'alaihi wa sallam dipukul, jika mereka membeli makanan secara taksiran kemudian mereka menjualnya di tempat itu juga, dan yang demikian itu seharusnya mereka membawanya terlebih dahulu.\" Ibnu Syihab mengatakan; Dan telah menceritakan kepadaku 'ubaidhullah bin Abdullah bin Umar bahwa ayahnya pernah membeli bahan makanan secara taksiran, kemudian dia membawanya kepada keluarganya.\" "
            },
            {
                "number": 2617,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ الْمَخْزُومِيُّ حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَ لِمَرْوَانَ أَحْلَلْتَ بَيْعَ الرِّبَا فَقَالَ مَرْوَانُ مَا فَعَلْتُ فَقَالَ أَبُو هُرَيْرَةَ أَحْلَلْتَ بَيْعَ الصِّكَاكِوَقَدْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الطَّعَامِ حَتَّى يُسْتَوْفَىقَالَ فَخَطَبَ مَرْوَانُ النَّاسَ فَنَهَى عَنْ بَيْعِهَا قَالَ سُلَيْمَانُ فَنَظَرْتُ إِلَى حَرَسٍ يَأْخُذُونَهَا مِنْ أَيْدِي النَّاسِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abdullah bin Al Harits Al Makhzumi] telah menceritakan kepada kami [Ad Dhahhak bin Utsman] dari [Bukair bin Abdullah bin Asyaj] dari [Sulaiman bin Yasar] dari [Abu Hurairah] bahwa dia berkata kepada Marwan; \"Apakah kamu menghalalakan jual beli riba?\" Marwan menjawab; Saya tidak menghalalkannya. Abu Hurairah melanjutkan; \"Kamu menghalalkan jual beli shikak (surat (kertas) yang dikelaurkan oleh penguasa, bertuliskan sejumlah makanan atau selainnya yang diberikan kepada orang yang berhak). Sungguh Rasulullah Shallallu 'alaihi wa sallam melarang menjual bahan makanan sampai ia ditimbang terlebih dahulu.\" Sulaiman berkata; \"Lantas Marwan mengumumkan kepada orang-orang dan melarang jual beli seperti itu.\" Sulaiman berkata; \"Saya dan para pengawal mengambilnya dari tangan orang-orang.\""
            },
            {
                "number": 2618,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا ابْتَعْتَ طَعَامًا فَلَا تَبِعْهُ حَتَّى تَسْتَوْفِيَهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Rauh] telah menceritakan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdullah] berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Jika kamu membeli makanan, janganlah kamu menjualnya sebelum memilikinya dengan sempurna.\" "
            },
            {
                "number": 2619,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي ابْنُ جُرَيْجٍ أَنَّ أَبَا الزُّبَيْرِ أَخْبَرَهُ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُانَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الصُّبْرَةِ مِنْ التَّمْرِ لَا يُعْلَمُ مَكِيلَتُهَا بِالْكَيْلِ الْمُسَمَّى مِنْ التَّمْرِحَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ مِنْ التَّمْرِ فِي آخِرِ الْحَدِيثِ",
                "id": "Telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin Amru bin Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Ibnu Juraij] bahwa [Abu Az Zubair] telah mengabarkan kepadanya, dia berkata; Saya mendengar [Jabir bin Abdillah] berkata; Rasulullah Shallallu 'alaihi wa sallam melarang menjual setangkai kurma yang tidak diketahui takarannya dengan takaran kurma yang telah maklum. Telah menceritakan kepada kami [Ishaq bin Ibrahim], telah menceritakan kepada kami [Rauh bin Ubadah] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdillah] berkata; Rasulullah Shallallu 'alaihi wa sallam melarang seperti itu, tapi di akhir hadits, dia tidak menyebutkan lafazh dari kurma."
            },
            {
                "number": 2620,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَعَلِيُّ بْنُ حُجْرٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ ح و حَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ جَمِيعًا عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ ح و حَدَّثَنَا ابْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ كِلَاهُمَا عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ مَالِكٍ عَنْ نَافِعٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] bahwasannya Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Dua orang yang bertransaksi, maka masing-masing dari keduanya boleh khiyar (memilih) atas partnernya selama keduanya belum berpisah, kecuali jual beli khiyar (yaitu; ditentukannya pilihan dari awal transaksi). Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] keduanya berkata; Telah menceritakan kepada kami [Yahya yaitu Al Qaththan]. Dan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Muhammad bin Bisyr]. Dan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] semuanya dari [Ubaidillah] dari [Nafi'] dari [Ibnu Umar] dari Nabi Shallallu 'alaihi wa sallam. Dan dari jalur lain, telah menceritakan kepadaku [Zuhair bin Harb] dan [Ali bin Hujr] keduanya berkata; Telah menceritakan kepada kami [Isma'il]. Dan dari jalur lain, telah menceritakan kepada kami [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; Telah menceritakan kepada kami [Hammad] dia adalah Ibnu Zaid, semuanya dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi Shallallu 'alaihi wa sallam. Dan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] dan [Ibnu Abi Umar] keduanya berkata; Telah menceritakan kepada kami [Abdul Wahab] dia berkata; Saya mendengar [Yahya bin Sa'id]. Dan dari jalur lain, telah menceritakan kepada kami [Ibnu Rafi'] telah menceritakan kepada kami [Ibnu Abi Fudaik] telah mengabarkan kepada kami [Ad Dhahhak] keduanya dari [Nafi'] dari [Ibnu Umar] dari Nabi Shallallu 'alaihi wa sallam, sebagaimana hadits Malik dari Nafi'."
            },
            {
                "number": 2621,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِذَا تَبَايَعَ الرَّجُلَانِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا وَكَانَا جَمِيعًا أَوْ يُخَيِّرُ أَحَدُهُمَا الْآخَرَ فَإِنْ خَيَّرَ أَحَدُهُمَا الْآخَرَ فَتَبَايَعَا عَلَى ذَلِكِ فَقَدْ وَجَبَ الْبَيْعُ وَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا الْبَيْعَ فَقَدْ وَجَبَ الْبَيْعُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits]. Dan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] dari Rasulullah Shallallu 'alaihi wa sallam bahwa beliau bersabda: \"Jika dua orang melakukan transaksi jual beli, maka salah satu dari keduanya berhak untuk khiyar (memilih), selagi keduanya belum berpisah dan keduanya masih berkumpul, atau salah satunya mengajukan khiyar (pilihan) kepada yang lain. Jika salah satunya telah menetapkan khiyar (pilihannya) atas yang lain, maka transaksi harus dilaksanakan sesuai dengan khiyarnya. Dan jika keduanya telah berpisah setelah melakukan transaksi jual beli, sedangkan sedangkan salah satu dari keduanya tidak membatalkan jual beli, maka transaksi telah sah.\""
            },
            {
                "number": 2622,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ كِلَاهُمَا عَنْ سُفْيَانَ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ جُرَيْجٍ قَالَ أَمْلَى عَلَىَّ نَافِعٌ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَبَايَعَ الْمُتَبَايِعَانِ بِالْبَيْعِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مِنْ بَيْعِهِ مَا لَمْ يَتَفَرَّقَا أَوْ يَكُونُ بَيْعُهُمَا عَنْ خِيَارٍ فَإِذَا كَانَ بَيْعُهُمَا عَنْ خِيَارٍ فَقَدْ وَجَبَزَادَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ قَالَ نَافِعٌ فَكَانَ إِذَا بَايَعَ رَجُلًا فَأَرَادَ أَنْ لَا يُقِيلَهُ قَامَ فَمَشَى هُنَيَّةً ثُمَّ رَجَعَ إِلَيْهِ",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Ibnu Abi Umar] keduanya dari [Sufyan]. [Zuhair] berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ibnu Juraij] dia berkata; [Nafi'] mendikteku, dia mendengar [Abdullah bin Umar] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dua orang telah melakukan transaksi jual beli, maka salah satu dari keduanya boleh melakukan khiyar selagi belum berpisah, atau keduanya boleh melakukan khiyar (dari awal), jika keduanya telah menyepakati khiyar tersebut, maka jual beli telah sah.\" Ibnu Abu Umar menambahkan dalam riwayatnya; Nafi' mengatakan; \"Apabila Ibnu Umar bertransaksi dengan seseorang, kemudian dia tidak mau membatalkan transaksinya, maka berdiri dan berjalan pelan-pelan lalu kembali kepadanya.\""
            },
            {
                "number": 2623,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَيِّعَيْنِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعُ الْخِيَارِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya], [Yahya bin Ayyub] dan [Qutaibah] serta [Ali bin Hujr]. Yahya bin Yahya mengatakan; Telah mengabarkan kepada kami, sedangan yang lain mengatakan; Telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Abdullah bin Dinar] bahwa dia mendengar [Ibnu Umar] berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Setiap dua orang yang melakukan transaksi jual beli, maka tidak ada transaksi (yang melazimkan) di antara keduanya sampai keduanya berpisah, kecuali jual beli dengan khiyar (penentuan pilihan dari awal).\" "
            },
            {
                "number": 2624,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ ح و حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ حَكِيمِ بْنِ حِزَامٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا وَإِنْ كَذَبَا وَكَتَمَا مُحِقَ بَرَكَةُ بَيْعِهِمَاحَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا هَمَّامٌ عَنْ أَبِي التَّيَّاحِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُحَدِّثُ عَنْ حَكِيمِ بْنِ حِزَامٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ قَالَ مُسْلِم بْن الْحَجَّاج وُلِدَ حَكِيمُ بْنُ حِزَامٍ فِي جَوْفِ الْكَعْبَةِ وَعَاشَ مِائَةً وَعِشْرِينَ سَنَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah]. Dan dari jalur lain, telah menceritakan kepada kami [Amru bin Ali] telah menceritakan kepada kami [Yahya bin Sa'id] dan [Abdurrahman bin Mahdi] keduanya berkata; Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abu Al Khalil] dari [Abdullah bin Al Harits] dari [Hakim bin Hizam] dari Nabi Shallallu 'alaihi wa sallam, beliau bersabda: \"Orang yang bertransaksi jual beli berhak khiyar (memilih) selama keduanya belum berpisah. Jika keduanya jujur dan terbuka, maka keduanya akan mendapatkan keberkahan dalam jual beli, tapi jika keduanya berdusta dan tidak terbuka, maka keberkahan jual beli antara keduanya akan hilang.\" Telah menceritakan kepada kami [Amru bin Ali] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Hammam] dari [Abu At Tayyah] dia berkata; Saya mendengar [Abdullah bin Al Harits] telah menceritakan dari [Hakim bin Hizam] dari Nabi Shallallu 'alaihi wa sallam, seperti hadits di atas, Muslim bin Hajjaj berkata; Hakim bin Hizam dilahirkan di dalam Ka'bah, dan dia hidup selama seratus dua puluh tahun."
            },
            {
                "number": 2625,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يَقُولُاذَكَرَ رَجُلٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَايَعْتَ فَقُلْ لَا خِلَابَةَ فَكَانَ إِذَا بَايَعَ يَقُولُ لَا خِيَابَةَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ كِلَاهُمَا عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَلَيْسَ فِي حَدِيثِهِمَا فَكَانَ إِذَا بَايَعَ يَقُولُ لَا خِيَابَةَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya], [Yahya bin Ayyub] dan [Qutaibah] serta [Ibnu Hujr]. Yahya bin Yahya mengatakan; Telah mengabarkan kepada kami, sedangkan yang lain mengatakan; Telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Abdullah bin Dinar] bahwa dia mendengar [Ibnu Umar] berkata; Seorang laki-laki mengadukan kepada Rasulullah Shallallu 'alaihi wa sallam bahwa dirinya telah ditipu orang dalam dalam jual beli, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian berjual beli, maka katakanlah kepada penjual; Jangan menipu.\" Setelah itu, apabila dia melakukan jual beli, dia selalu mengatakan; \"Jangan menipu.\" Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] keduanya dari [Abdullah bin Dinar] dengan isnad seperti ini, namun dalam hadits keduanya disebutkan; \"Bahwa apabila dia melakukan jual beli, dia mengatakan; \"Jangan menipu.\" "
            },
            {
                "number": 2626,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهَا نَهَى الْبَائِعَ وَالْمُبْتَاعَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] bahwasannya Rasulullah Shallallu 'alaihi wa sallam melarang menjual buah-buahan hingga tampak matangnya, beliau melarang hal itu kepada penjual dan pembeli. Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami ['Ubaidillah] dari [Nafi'] dari [Ibnu Umar] dari Nabi Shallallu 'alaihi wa sallam seperti hadits di atas. "
            },
            {
                "number": 2627,
                "arab": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ النَّخْلِ حَتَّى يَزْهُوَ وَعَنْ السُّنْبُلِ حَتَّى يَبْيَضَّ وَيَأْمَنَ الْعَاهَةَ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr As Sa'di] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah Shallallu 'alaihi wa sallam melarang menjual kurma hingga tampak buahnya dan bijian sampai mengeras (tampak matangnya) dan terbebas dari kerusakan, beliau melarang kepada penjual dan pembeli. "
            },
            {
                "number": 2628,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبْتَاعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ وَتَذْهَبَ عَنْهُ الْآفَةُ قَالَ يَبْدُوَ صَلَاحُهُ حُمْرَتُهُ وَصُفْرَتُهُو حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ يَحْيَى بِهَذَا الْإِسْنَادِ حَتَّى يَبْدُوَ صَلَاحُهُ لَمْ يَذْكُرْ مَا بَعْدَهُ حَدَّثَنَا ابْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عَبْدِ الْوَهَّابِ حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ مَالِكٍ وَعُبَيْدِ اللَّهِ",
                "id": "Telah menceritakan kepadau [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Yahya bin Sa'id] dari [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Janganlah kalian membeli buah-buahan hingga tampak matangnya dan terbebas dari kerusakan.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Abi Umar] keduanya berkata; Telah menceritakan kepada kami [Abdul Wahhab] dari [Yahya] dengan isnad seperti ini, hingga terlihat matangnya, dan tidak menyebutkan setelahnya. Telah menceritakan kepada kami [Ibnu Rafi'] telah menceritakan kepada kami [Ibnu Abi Fudaik] telah mengabarkan kepada kami [Adh Dhahhak] dari [Nafi'] dari [Ibnu Umar] dari Nabi Shallallu 'alaihi wa sallam seperti hadits Abdul Wahhab. Telah menceritakan kepada kami [Suwaid bin Sa'id] telah menceritakan kepada kami [Hafsh bin Maisarah] telah menceritakan kepadaku [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar] dari Nabi Shallallu 'alaihi wa sallam seperti hadits Malik dan Ubaidillah."
            },
            {
                "number": 2629,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ ابْنَ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ كِلَاهُمَا عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ بِهَذَا الْإِسْنَادِ وَزَادَ فِي حَدِيثِ شُعْبَةَ فَقِيلَ لِابْنِ عُمَرَ مَا صَلَاحُهُ قَالَ تَذْهَبُ عَاهَتُهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya], [Yahya bin Ayyub], [Qutaibah] dan [Ibnu Hujr]. [Yahya bin Yahya] mengatakan; Telah mengabarkan kepada kami, sedangkan yang lain mengatakan; Telah menceritakan kepada kami [Isma'il yaitu Ibnu Ja'far] dari [Abdullah bin Dinar] bahwa dia mendengar [Ibnu Umar] berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Janganlah kalian menjual buah-buahan hingga nampak matangnya.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Abdurrahman] dari [Sufyan]. Dan telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] keduanya dari [Abdullah bin Dinar] dengan isnad seperti ini, dengan tambahan dalam hadits Syu'bah, maka dikatakan kepada Ibnu Umar, apa maksud \"nampak matangnya.\" Dia menjawab, yaitu terbebas dari kerusakan."
            },
            {
                "number": 2630,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ نَهَى أَوْنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الثَّمَرِ حَتَّى يَطِيبَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Zubair] dari [Jabir]. Dan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Zubair] dari [Jabir] dia berkata; Rasulullah Shallallu 'alaihi wa sallam telah melarang atau melarang kami, melakukan jual beli buah-buahan hingga terlihat bagusnya. "
            },
            {
                "number": 2631,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ حَدَّثَنَا أَبُو عَاصِمٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَاللَّفْظُ لَهُ حَدَّثَنَا رَوْحٌ قَالَا حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَقَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُانَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Utsman An Naufali] telah menceritakan kepada kami [Abu 'Ashim]. Dan dari jalur lain, telah menceritakan kepadaku [Muhammad bin Hatim] sedangkan lafazhnya dari dia, telah menceritakan kepada kami [Rauh] dia berkata; Telah menceritakan kepada kami [Zakariyya` bin Ishaq] telah menceritakan kepada kami [Amru bin Dinar] bahwa dia mendengar [Jabir bin Abdullah] berkata; Rasulullah Shallallu 'alaihi wa sallam melarang menjual buah-buahan hingga nampak matangnya."
            },
            {
                "number": 2632,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي الْبَخْتَرِيِّ قَالَسَأَلْتُ ابْنَ عَبَّاسٍ عَنْ بَيْعِ النَّخْلِ فَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ النَّخْلِ حَتَّى يَأْكُلَ مِنْهُ أَوْ يُؤْكَلَ وَحَتَّى يُوزَنَ قَالَ فَقُلْتُ مَا يُوزَنُ فَقَالَ رَجُلٌ عِنْدَهُ حَتَّى يُحْزَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari [Abu Al Bakhtari] dia berkata; Saya bertanya kepada [Ibnu Abbas] mengenai menjual kurma, dia menjawab; Rasulullah Shallallu 'alaihi wa sallam melarang menjual kurma sampai seseorang layak memakannya atau ia layak dimakan dan ditakar.\" Abu Al Bakhtari berkata; Saya bertanya; Apa maksudnya setelah layak ditakar? Maka seseorang yang bersama Ibnu Abbas menjawab; Ditaksir (diperkirakan)."
            },
            {
                "number": 2633,
                "arab": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي نُعْمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبْتَاعُوا الثِّمَارَ حَتَّى يَبْدُوَ صَلَاحُهَا",
                "id": "Telah menceritakan kepadaku [Abu Kuraib Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [ayahnya] dari [Ibnu Abi Nu'm] dari [Abu Hurairah] dia berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Janganlah kalian membeli buah-buahan hingga nampak matangnya.\" "
            },
            {
                "number": 2634,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لَهُمَا قَالَا حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ وَعَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِقَالَ ابْنُ عُمَرَ وَحَدَّثَنَا زَيْدُ بْنُ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا زَادَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ أَنْ تُبَاعَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri]. Dan dari jalur lain telah menceritakan kepada kami [Ibnu Numair] dan [Zuhair bin Harb] sedangkan lafazh dari keduanya, keduanya berkata; Telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari [Salim] dari [Ibnu Umar] bahwa Nabi Shallallu 'alaihi wa sallam melarang menjual buah-buahan hingga nampak matangnya dan melarang menjual buah-buahan dengan kurma. Ibnu Umar berkata; Dan telah menceritakan kepada kami Zaid bin Tsabit bahwasannya Rasulullah Shallallu 'alaihi wa sallam memberikan keringanan dalam transaksi 'Arayah, dalam riwayatnya Ibnu Numair, ia menambahkan; Yaitu untuk dijual."
            },
            {
                "number": 2635,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ وَاللَّفْظُ لِحَرْمَلَةَ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبْتَاعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ وَلَا تَبْتَاعُوا الثَّمَرَ بِالتَّمْرِقَالَ ابْنُ شِهَابٍ وَحَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ سَوَاءً",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah] sedangkan lafazhnya dari Harmalah, keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sa'id bin Musayyab] dan [Abu Salamah bin Abdurrahman] bahwa [Abu Hurairah] berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Janganlah kalian membeli buah-buahan hingga nampak matangnya, dan janganlah kalian membeli buah-buahan dengan kurma.\" Ibnu Syihab berkata; Dan telah menceritakan kepadaku [Salim bin Abdullah bin Umar] dari [ayahnya] dari Nabi Shallallu 'alaihi wa sallam sama seperti hadits di atas."
            },
            {
                "number": 2636,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِوَالْمُزَابَنَةُ أَنْ يُبَاعَ ثَمَرُ النَّخْلِ بِالتَّمْرِ وَالْمُحَاقَلَةُ أَنْ يُبَاعَ الزَّرْعُ بِالْقَمْحِ وَاسْتِكْرَاءُ الْأَرْضِ بِالْقَمْحِ قَالَ وَأَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا تَبْتَاعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ وَلَا تَبْتَاعُوا الثَّمَرَ بِالتَّمْرِ و قَالَ سَالِمٌ أَخْبَرَنِي عَبْدُ اللَّهِ عَنْ زَيْدِ بْنِ ثَابِتٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ رَخَّصَ بَعْدَ ذَلِكَ فِي بَيْعِ الْعَرِيَّةِ بِالرُّطَبِ أَوْ بِالتَّمْرِ وَلَمْ يُرَخِّصْ فِي غَيْرِ ذَلِكَ",
                "id": "dan telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Hujain bin Al Mutsanna] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari [Sa'id bin Musayyab] bahwasannya Rasulullah Shallallu 'alaihi wa sallam melarang transaksi dengan sistem muzabanah dan muhaqalah. Muzabanah ialah seseorang menjual buah kurma yang masih di pohon dengan kurma kering, sedangkan muhaqalah ialah seseorang menjual biji-bijian dengan gandum serta menyewakan tanah dengan gandum. Dia (Sa'id bin Musayyib) berkata; Telah mengabarkan kepadaku [Salim bin Abdullah] dari Rasulullah Shallallu 'alaihi wa sallam bahwa beliau bersabda: \"Janganlah kalian membeli buah-buahan sampai nampak matangnya dan janganlah kalian membeli buah-buahan dengan buah kurma.\" [Salim] berkata; Telah mengabarkan kepadaku [Abdullah] dari [Zaid bin Tsabit] dari Rasulullah Shallallu 'alaihi wa sallam bahwa setelah itu beliau memberikan keringanan dalam transaksi 'Ariyyah dengan ruthab (kurma basah) atau tamr (kurma kering) dan tidak memberi keringanan selain itu."
            },
            {
                "number": 2637,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ زَيْدِ بْنِ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِصَاحِبِ الْعَرِيَّةِ أَنْ يَبِيعَهَا بِخَرْصِهَا مِنْ التَّمْرِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] dari [Zaid bin Tsabit] bahwasannya Rasulullah Shallallu 'alaihi wa sallam memberi keringanan bagi orang yang melakukan transksi 'Ariyyah untuk menjualnya dengan taksiran kurma (tamr)."
            },
            {
                "number": 2638,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرِيَّةِ بِخَرْصِهَا تَمْرًاقَالَ يَحْيَى الْعَرِيَّةُ أَنْ يَشْتَرِيَ الرَّجُلُ ثَمَرَ النَّخَلَاتِ لِطَعَامِ أَهْلِهِ رُطَبًا بِخَرْصِهَا تَمْرًا",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rumh bin Al Muhajir] telah menceritakan kepada kami [Al Laits] dari [Yahya bin Sa'id] dari [Nafi'] dari [Abdullah bin Umar] telah mengabarkan kepadaku [Zaid bin Tsabit] bahwa Rasulullah Shallallu 'alaihi wa sallam memberi keringanan dalam transaksi 'Ariyyah dengan takaran kurma kering. [Yahya] berkata; Transaksi 'Ariyyah adalah seseorang membeli dengan cara menaksir kurma ruthab (masih dipohon) dengan kurma kering."
            },
            {
                "number": 2639,
                "arab": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ زَيْدِ بْنِ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الْعَرَايَا أَنْ تُبَاعَ بِخَرْصِهَا كَيْلًاو حَدَّثَنَاه ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ وَقَالَ أَنْ تُؤْخَذَ بِخَرْصِهَا و حَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ كِلَاهُمَا عَنْ أَيُّوبَ عَنْ نَافِعٍ بِهَذَا الْإِسْنَادِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [ubaidhullah] telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] dari [Zaid bin Tsabit] bahwasannya Rasulullah Shallallu 'alaihi wa sallam memberi keringanan dalam transaksi 'Ariyyah, yaitu menjual (buah kurma) dengan menaksirnya sesuai takaran. Dan telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ubaidillah] dengan isnad ini, dia berkata; Hendaknya ia menaksirnya. Telah menceritakan kepada kami [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; Telah menceritakan kepada kami [Hammad]. Dan dari jalur lain, telah menceritakan kepadaku [Ali bin Hujr] telah menceritakan kepada kami [Isma'il] keduanya dari [Ayyub] dari [Nafi'] dengan isnad ini bahwa Rasulullah Shallallu 'alaihi wa sallam memberi keringanan dalam transaksi 'Ariyyah dengan menaksirnya."
            },
            {
                "number": 2640,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ يَحْيَى وَهُوَ ابْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ بَعْضِ أَصْحَابِ رَسُولِ اللَّهِ مِنْ أَهْلِ دَارِهِمْ مِنْهُمْ سَهْلُ بْنُ أَبِي حَثْمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِ وَقَالَ ذَلِكَ الرِّبَا تِلْكَ الْمُزَابَنَةُ إِلَّا أَنَّهُ رَخَّصَ فِي بَيْعِ الْعَرِيَّةِ النَّخْلَةِ وَالنَّخْلَتَيْنِ يَأْخُذُهَا أَهْلُ الْبَيْتِ بِخَرْصِهَا تَمْرًا يَأْكُلُونَهَا رُطَبًا",
                "id": "Dan telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] telah menceritakan kepada kami [Sulaiman yaitu Ibnu Bilal] dari [Yahya yaitu Ibnu Sa'id] dari [Busyair bin Yasar] dari sebagian sahabat Rasulullah dari orang-orang yang berduit, di antaranya adalah [Sahl bin Abu Khaitsamah], bahwa Rasulullah shallallahu 'alaihi wasallam melarang jual beli buah dengan kurma, dia bersabda; \"Itu adalah riba, itu muzabanah.\" Hanya saja beliau memberi keringanan dalam 'Ariyyah pada satu atau dua pohon kurma yang dilakukan suatu keluarga dengan cara memperkirakan kalau kurma tersebut akan menjadi kering, dan mereka memakannya ketika masih basah.\" "
            },
            {
                "number": 2641,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَحَسَنٌ الْحُلْوَانِيُّ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ حَدَّثَنِي بُشَيْرُ بْنُ يَسَارٍ مَوْلَى بَنِي حَارِثَةَ أَنَّ رَافِعَ بْنَ خَدِيجٍ وَسَهْلَ بْنَ أَبِي حَثْمَةَ حَدَّثَاهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ الثَّمَرِ بِالتَّمْرِ إِلَّا أَصْحَابَ الْعَرَايَا فَإِنَّهُ قَدْ أَذِنَ لَهُمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Hasan Al Khulwani] keduanya berkata; Telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir] telah menceritakan kepadaku [Busyair bin Yasar] bekas budak Bani Haritsah, bahwa [Rafi' bin Khudaij] dan [Sahl bin Abu Khaitsamah] telah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam melarang jual beli dengan praktek Muzabanah, yaitu menjual buaj dengan kurma kering kecuali jual beli dengan sistem 'Ariyyah, karena mereka telah diizinkan untuk melakukan jual beli seperti itu.\""
            },
            {
                "number": 2642,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكٌ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ دَاوُدُ بْنُ الْحُصَيْنِ عَنْ أَبِي سُفْيَانَ مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ أَوْ فِي خَمْسَةِيَشُكُّ دَاوُدُ قَالَ خَمْسَةٌ أَوْ دُونَ خَمْسَةٍ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Malik]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Yahya bin Yahya] sedangkan lafazhnya dari dia, dia berkata; Saya berkata kepada Malik; \"Apakah [Daud bin Hushain] pernah menceritakan kepadamu dari [Abu Sufyan] bekas budak Ibnu Abi Ahmad, dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam memberi pengecualian pada jual beli dengan sistem 'Ariyyah dengan menaksirnya selama kurang dari lima wasaq atau hanya sebanyak lima wasaq.\" Nampaknya Daud ragu apakah ia mengatakan lima wasaq atau kurang dari lima wasaq?\" Ia menjawab; \"Ya.\""
            },
            {
                "number": 2643,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ أَخْبَرَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ بَيْعِ ثَمَرِ النَّخْلِ بِالتَّمْرِ كَيْلًا وَبَيْعِ الْعِنَبِ بِالزَّبِيبِ كَيْلًا وَبَيْعِ الزَّرْعِ بِالْحِنْطَةِ كَيْلًاو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Muhammad bin Abdullah bin Numair] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] bahwa [Abdullah] telah mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam melarang jual beli dengan praktek Muzabanah, yaitu jual beli kurma basah dengan kurma kering dengan takaran tertentu, dan jual beli anggur basah dengan anggur kering dengan takaran tertentu serta jual beli gandum yang masih kasar dengan gandum yang halus dengan takaran tertentu.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Abu Za`idah] dari ['Ubaidillah] dengan isnad seperti ini."
            },
            {
                "number": 2644,
                "arab": "حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَحُسَيْنُ بْنُ عِيسَى قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ ثَمَرِ النَّخْلِ بِالتَّمْرِ كَيْلًا وَبَيْعُ الزَّبِيبِ بِالْعِنَبِ كَيْلًا وَعَنْ كُلِّ ثَمَرٍ بِخَرْصِهِ",
                "id": "Telah menceritakan kepadaku [Yahya bin Ma'in] dan [Harun bin 'Abdullah] dan [Husain bin Isa] mereka berkata; Telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarangh praktek Muzabanah (dalam jual beli), dan MUzabanah adalah jual beli kurma basah (yang masih pada pohonnya) dengan kurma kering dengan takaran tertentu, dan jual beli anggur basah dengan anggur kering dengan takaran tertentu dan setiap kurma basah yang ditaksir.\""
            },
            {
                "number": 2645,
                "arab": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ أَنْ يُبَاعَ مَا فِي رُءُوسِ النَّخْلِ بِتَمْرٍ بِكَيْلٍ مُسَمَّى إِنْ زَادَ فَلِي وَإِنْ نَقَصَ فَعَلَيَّو حَدَّثَنَاه أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepadaku [Ali bin Hujr As Sa'di] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Isma'il yaitu Ibnu Ibrahim] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang praktek Muzabanah, dan Muzabanah ialah seseorang menjual kurma yang masih di pohon dengan kurma kering dengan takaran tertentu, dan dikatakan; Jika lebih itu menjadi hakku dan jika ternyata kurang, maka itu menjadi tanggunganku.\" Dan telah menceritakan kepada kami [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; Telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dengan isnad seperti ini."
            },
            {
                "number": 2646,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَاعَ نَخْلًا قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa menjual pohon kurma yang telah dikawinkan, maka buahnya bagi penjual, kecuali jika pembeli mensyaratkan (buahnya untuknya).\" "
            },
            {
                "number": 2647,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي جَمِيعًا عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لَهُ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا نَخْلٍ اشْتُرِيَ أُصُولُهَا وَقَدْ أُبِّرَتْ فَإِنَّ ثَمَرَهَا لِلَّذِي أَبَّرَهَا إِلَّا أَنْ يَشْتَرِطَ الَّذِي اشْتَرَاهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] semuanya dari ['Ubaidillah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan lafazhnya dari dia, telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah Shallallu 'alaihi wa sallam bersabda: \"pohon kurma mana saja yang telah dikawinkan dan dibeli, maka buahnya bagi orang yang mengawinkannya kecuali jika pembelinya memberikan syarat (bahwa buahnya untuknya).\""
            },
            {
                "number": 2648,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرِئٍ أَبَّرَ نَخْلًا ثُمَّ بَاعَ أَصْلَهَا فَلِلَّذِي أَبَّرَ ثَمَرُ النَّخْلِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُو حَدَّثَنَاه أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ كِلَاهُمَا عَنْ أَيُّوبَ عَنْ نَافِعٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa mengawinkan pohon kurma kemudian dia menjual pohonnya, maka buahnya bagi orang yang mengawinkan kecuali jika pembeli memberikan syarat buah itu untuknya.\" Dan telah menceritakan kepada kami [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; Telah menceritakan kepada kami [Hammad]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] keduanya dari [Ayyub] dari [Nafi'] dengan isnad seperti ini. "
            },
            {
                "number": 2649,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ ابْتَاعَ نَخْلًا بَعْدَ أَنْ تُؤَبَّرَ فَثَمَرَتُهَا لِلَّذِي بَاعَهَا إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَمَنْ ابْتَاعَ عَبْدًا فَمَالُهُ لِلَّذِي بَاعَهُ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُو حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ أَبَاهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Muhammad bin Rumh] keduanya berkata; Telah mengabarkan kepada kami [Al Laits]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Salim bin Abdullah bin Umar] dari [Abdullah bin Umar] dia berkata; Saya mendengar Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa menjual pohon kurma setelah dikawinkan, maka buahnya untuk orang yang menjual kecuali jika disyaratkan untuk pembeli. Barangsiapa menjual budak, maka hartanya (budak) bagi yang menjual kecuali disyaratkan untuk pembeli.\" Dan Telah menceritakan kepada kami [Yahya bin Yahya], [Abu Bakar bin Abi Syaibah] dan [Zuhair bin Harb], Yahya mengatakan; Telah mengabarkan kepada kami, sedangkan yang dua mengatakan; Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dengan isnad seperti ini. Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [Salim bin Abdullah bin Umar] bahwa [ayahnya] berkata; Saya mendengar Rasulullah Shallallu 'alaihi wa sallam bersabda seperti hadits di atas."
            },
            {
                "number": 2650,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا جَمِيعًا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَعَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ وَلَا يُبَاعُ إِلَّا بِالدِّينَارِ وَالدِّرْهَمِ إِلَّا الْعَرَايَاو حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا أَبُو عَاصِمٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ وَأَبِي الزُّبَيْرِ أَنَّهُمَا سَمِعَا جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Muhammad bin Abdullah bin Numair] serta [Zuhair bin Harb] mereka semua berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ibnu Juraij] dari ['Atha`] dari [Jabir bin Abdullah] dia berkata; Rasulullah Shallallu 'alaihi wa sallam melarang jual beli muhaqalah dan muzabanah serta mukhabarah, melarang jual beli buah hingga kelihatan jelas matangnya, melarang jual beli melainkan dengan dinar dan dirham (uang tunai) kecuali jual beli 'araya. Dan telah menceritakan kepada kami [Abdullah bin Humaid] telah mengabarkan kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Ibnu Juraij] dari ['Atha`] dan [Abu Zubair] bahwa keduanya pernah mendengar [Jabir bin Abdullah] berkata; \"Rasulullah Shallallu 'alaihi wa sallam melarang…\" kemudian dia menyebutkan hadits yang sama. "
            },
            {
                "number": 2651,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ الْجَزَرِيُّ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَعَنْ بَيْعِ الثَّمَرَةِ حَتَّى تُطْعِمَ وَلَا تُبَاعُ إِلَّا بِالدَّرَاهِمِ وَالدَّنَانِيرِ إِلَّا الْعَرَايَاقَالَ عَطَاءٌ فَسَّرَ لَنَا جَابِرٌ قَالَ أَمَّا الْمُخَابَرَةُ فَالْأَرْضُ الْبَيْضَاءُ يَدْفَعُهَا الرَّجُلُ إِلَى الرَّجُلِ فَيُنْفِقُ فِيهَا ثُمَّ يَأْخُذُ مِنْ الثَّمَرِ وَزَعَمَ أَنَّ الْمُزَابَنَةَ بَيْعُ الرُّطَبِ فِي النَّخْلِ بِالتَّمْرِ كَيْلًا وَالْمُحَاقَلَةُ فِي الزَّرْعِ عَلَى نَحْوِ ذَلِكَ يَبِيعُ الزَّرْعَ الْقَائِمَ بِالْحَبِّ كَيْلًا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Al Handlali] telah mengabarkan kepada kami [Makhlad bin Yazid Al Jazari] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku ['Atha`] dari [Jabir bin Abdullah] bahwa Rasulullah Shallallu 'alaihi wa sallam melarang jual beli mukhabarah, muhaqalah, muzabanah, melarang menjual buah hingga layak untuk dimakan, dan melarang membeli melainkan dengan dinar atau dirham kecuali jual beli 'araya. 'Atha` berkata; \"Jabir menjelaskan kepada kami, bahwa Mukhabarah adalah menyewakan tanah gersang dengan hasil tanaman dari tanah tersebut, Muzabanah ialah jual beli kurma basah dengan kurma kering dengan takaran yang sama, Muhaqalah ialah jual beli tanaman yang masih di pohon dengan biji-bijian yang ditakar.\""
            },
            {
                "number": 2652,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ كِلَاهُمَا عَنْ زَكَرِيَّاءَ قَالَ ابْنُ خَلَفٍ حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ حَدَّثَنَا أَبُو الْوَلِيدِ الْمَكِّيُّ وَهُوَ جَالِسٌ عِنْدَ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَأَنْ تُشْتَرَى النَّخْلُ حَتَّى تُشْقِهَوَالْإِشْقَاهُ أَنْ يَحْمَرَّ أَوْ يَصْفَرَّ أَوْ يُؤْكَلَ مِنْهُ شَيْءٌ وَالْمُحَاقَلَةُ أَنْ يُبَاعَ الْحَقْلُ بِكَيْلٍ مِنْ الطَّعَامِ مَعْلُومٍ وَالْمُزَابَنَةُ أَنْ يُبَاعَ النَّخْلُ بِأَوْسَاقٍ مِنْ التَّمْرِ وَالْمُخَابَرَةُ الثُّلُثُ وَالرُّبُعُ وَأَشْبَاهُ ذَلِكَ قَالَ زَيْدٌ قُلْتُ لِعَطَاءِ بْنِ أَبِي رَبَاحٍ أَسَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَذْكُرُ هَذَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Ahmad bin Abi Khalf] keduanya dari [Zakariyya` bin Adi] telah mengabarkan kepada kami ['ubaidhullah] dari [Zaid bin Abi Unaisah] telah menceritakan kepada kami [Abu Al Walid Al Makki] saat itu dia duduk di samping ['Atha` bin Abi Rabah] dari [Jabir bin Abdullah] bahwa Rasulullah Shallallu 'alaihi wa sallam melarang jual beli Muhaqalah, Muzabanah dan Mukhabarah, dan menjual buah kurma sampai terlihat matang, dan matangnya adalah jika telah memerah atau menguning atau sudah layak untuk dimakan. Muhaqalah ialah menjual hasil tanaman yang dibayar dengan makanan pokok dengan takaran yang jelas, muzabanah ialah menjual kurma basah yang masih di pohon dengan beberapa wasaq kurma kering, mukhabarah ialah membagi hasil ladang menjadi sepertiga, seperempat atau yang serupa dengan itu (sementara benihnya dari yang mempunyai ladang). Zaid berkata; Saya bertanya kepada 'Atha` bin Abi Rabah; \"Apakah kamu mendengarnya Jabir bin Abdullah menyebutkan ini dari Rasulullah Shallallu 'alaihi wa sallam?\" Dia menjawab; \"Ya.\" "
            },
            {
                "number": 2653,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ هَاشِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُخَابَرَةِ وَعَنْ بَيْعِ الثَّمَرَةِ حَتَّى تُشْقِحَقَالَ قُلْتُ لِسَعِيدٍ مَا تُشْقِحُ قَالَ تَحْمَارُّ وَتَصْفَارُّ وَيُؤْكَلُ مِنْهَا",
                "id": "Dan telah menceritakan kepada kami [Abdullah bin Hasyim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Salim bin Hayyan] telah menceritakan kepada kami [Sa'id bin Mina`] dari [Jabir bin Abdullah] dia berkata; Rasulullah Shallallu 'alaihi wa sallam melarang jual beli muzabanah, muhaqalah dan mukhabarah, melarang menjual buah hingga terlihat matang.\" Saya bertanya kepada Sa'id; \"Bagaimana terlihat matangnya?\" Dia menjawab; \"Jika telah memerah dan menguning dan layak untuk dimakan.\""
            },
            {
                "number": 2654,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ وَاللَّفْظُ لِعُبَيْدِ اللَّهِ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي الزُّبَيْرِ وَسَعِيدِ بْنِ مِينَاءَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُعَاوَمَةِ وَالْمُخَابَرَةِ قَالَ أَحَدُهُمَا بَيْعُ السِّنِينَ هِيَ الْمُعَاوَمَةُ وَعَنْ الثُّنْيَا وَرَخَّصَ فِي الْعَرَايَاو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ حُجْرٍ قَالَا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ لَا يَذْكُرُ بَيْعُ السِّنِينَ هِيَ الْمُعَاوَمَةُ",
                "id": "Telah menceritakan kepada kami [Ubaidillah bin Umar Al Qawariri] dan [Muhammad bin 'Ubaid Al Ghubari] sedangkan lafazhnya dari Ubaidillah keduanya berkata; Telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub] dari [Abu Zubair] dan [Sa'id bin Mina`] dari [Jabir bin Abdullah] dia berkata; Rasulullah Shallallu 'alaihi wa sallam melarang jual beli muhaqalah, muzabanah, mu'awamah (menjual pohon kurma hanya beberapa tahun) dan Mukhabarah -salah satu keduanya menyebutkan; \"Jual beli siniin, yaitu jual beli mu'awamah, dari dari jual belia tsanya (yaitu penjualan dengan pengecualian yang tidak ditentukan) - dan beliau memberi keringanan dalam 'ariyyah. Dan telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] dan [Ali bin Hujr] keduanya berkata; Telah menceritakan kepada kami [Isma'il dia adalah Ibnu 'Ulayyah] dari [Ayyub] dari [Abu Az Zubair] dari [Jabir] dari Nabi Shallallu 'alaihi wa sallam, namun dia tidak menyebutkan jual beli sinin adalah mu'awamah."
            },
            {
                "number": 2655,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا رَبَاحُ بْنُ أَبِي مَعْرُوفٍ قَالَ سَمِعْتُ عَطَاءً عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كِرَاءِ الْأَرْضِ وَعَنْ بَيْعِهَا السِّنِينَ وَعَنْ بَيْعِ الثَّمَرِ حَتَّى يَطِيبَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah menceritakan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Rabah bin Ma'ruf] dia berkata; Saya mendengar ['Atha`] dari [Jabir bin Abdullah] dia berkata; \"Rasulullah Shallallu 'alaihi wa sallam melarang menyewakan tanah dan mengontrakkannya hanya beberapa tahun dan melarang menjual buah-buahan hingga nyata benar baiknya.\""
            },
            {
                "number": 2656,
                "arab": "و حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Dan telah menceritakan kepadaku [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Hammad yaitu Ibnu Zaid] dari [Mathar Al Warraq] dari ['Atha`] dari [Jabir bin Abdullah] bahwasanya Rasulullah Shallallu 'alaihi wa sallam melarang menyewakan tanah (Kira` al-Ardli)."
            },
            {
                "number": 2657,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ لَقَبُهُ عَارِمٌ وَهُوَ أَبُو النُّعْمَانِ السَّدُوسِيُّ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا مَطَرٌ الْوَرَّاقُ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ لَمْ يَزْرَعْهَا فَلْيُزْرِعْهَا أَخَاهُ",
                "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah menceritakan kepada kami [Muhammad bin Fadll] yang berlaqabkan 'Arim, dia adalah Abu An Nu'man As Sadusi, telah menceritakan kepada kami [Mahdi bin Maimun] telah menceritakan kepada kami [Mathar Al Warraq] dari ['Atha`] dari [Jabir bin Abdullah] dia berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang memiliki tanah, hendaknya ditanaminya, jika dia tidak sanggup menanaminya dengan sendiri, hendaknya saudaranya yang menanaminya.\" "
            },
            {
                "number": 2658,
                "arab": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا هِقْلٌ يَعْنِي ابْنَ زِيَادٍ عَنْ الْأَوْزَاعِيِّ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكَانَ لِرِجَالٍ فُضُولُ أَرَضِينَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ فَضْلُ أَرْضٍ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أَرْضَهُ",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Hiql yaitu Ibnu Ziyad] dari [Al Auza'i] dari ['Atha`] dari [Jabir bin Abdullah] dia berkata; Beberapa orang sahabat Rasulullah Shallallu 'alaihi wa sallam memiliki kelebihan tanah, maka Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang memiliki kelebihan tanah, hendaklah ditanaminya atau diberikan kepada saudaranya, jika dia enggan (menanaminya atau memberikannya), hendaknya membiarkan tanah tersebut.\" "
            },
            {
                "number": 2659,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ لَمْ يَسْتَطِعْ أَنْ يَزْرَعَهَا وَعَجَزَ عَنْهَا فَلْيَمْنَحْهَا أَخَاهُ الْمُسْلِمَ وَلَا يُؤَاجِرْهَا إِيَّاهُ",
                "id": "Telah menceritakan kepada kami [Ibnu Numamir] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] dari [Jabir] dia berkata; Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang memiliki tanah, hendaklah dia menanaminya, jika dia tidak mampu menanaminya sendiri, hendaklah diberikan kepada saudaranya sesama muslim, tanpa menyewakan kepadanya.\" "
            },
            {
                "number": 2660,
                "arab": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا هَمَّامٌ قَالَ سَأَلَ سُلَيْمَانُ بْنُ مُوسَى عَطَاءً فَقَالَ أَحَدَّثَكَ جَابِرُ بْنُ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ وَلَا يُكْرِهَا قَالَ نَعَمْ",
                "id": "Dan telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Hammam] dia berkata; Sulaiman bin Musa bertanya kepada ['Atha`] dia bekata; Apakah [Jabir bin Abdullah] pernah menceritakan kepadamu bahwa Nabi Shallallu 'alaihi wa sallam telah bersabda: \"Barangsiapa yang memiliki tanah, hendaklah dia menanaminya atau meminjamkan saudaranya untuk ditanami dan janganlah menyewakannya.\"? Dia menjawab; \"Ya, pernah.\" "
            },
            {
                "number": 2661,
                "arab": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ لَهُ فَضْلُ أَرْضٍ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ وَلَا تَبِيعُوهَافَقُلْتُ لِسَعِيدٍ مَا قَوْلُهُ وَلَا تَبِيعُوهَا يَعْنِي الْكِرَاءَ قَالَ نَعَمْ",
                "id": "Dan telah menceritakan kepadaku [Hajjaj bin Asy Sya'ir] telah menceritakan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Salim bin Hayyan] telah menceritakan kepada kami [Sa'id bin Mina`] dia berkata; Saya pernah mendengar [Jabir bin Abdullah] berkata; Sesungguhnya Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang memiliki kelebihan tanah, hendaklah dia menanaminya atau meminjamkan kepada saudaranya supaya menanaminya dan janganlah menjualnya.\" Saya bertanya kepada Sa'id; \"Apakah maksud dari \"jangan menjualnya\" adalah \"menyewakan kepadanya?\" Dia menjawab; \"Ya.\""
            },
            {
                "number": 2662,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَكُنَّا نُخَابِرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُصِيبُ مِنْ الْقِصْرِيِّ وَمِنْ كَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ فَلْيُحْرِثْهَا أَخَاهُ وَإِلَّا فَلْيَدَعْهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] dia berkata; \"Di zaman Rasulullah Shallallu 'alaihi wa sallam kami terbiasa menyewakan tanah kemudian kami memungut dari hasil tanamannya. Maka Rasulullah Shallallu 'alaihi wa sallam bersabda: \"Barangsiapa yang memiliki tanah hendaklah dia menanaminya atau meminjamkan kepada saudaranya supaya ditanaminya, jika dia enggan, hendaknya membiarkan tanah tersebut.\""
            },
            {
                "number": 2663,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ وَأَحْمَدُ بْنُ عِيسَى جَمِيعًا عَنْ ابْنِ وَهْبٍ قَالَ ابْنُ عِيسَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ أَنَّ أَبَا الزُّبَيْرِ الْمَكِّيَّ حَدَّثَهُ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاكُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَأْخُذُ الْأَرْضَ بِالثُّلُثِ أَوْ الرُّبُعِ بِالْمَاذِيَانَاتِ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَقَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ لَمْ يَزْرَعْهَا فَلْيَمْنَحْهَا أَخَاهُ فَإِنْ لَمْ يَمْنَحْهَا أَخَاهُ فَلْيُمْسِكْهَا",
                "id": "Telah menceritakan kepadaku [Abu Thahir] dan [Ahmad bin Isa] semuanya dari [Ibnu Wahb]. [Ibnu Isa] mengatakan; Telah menceritakan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Hisyam bin Sa'ad] bahwa [Abu Zubair Al Makki] telah menceritakan kepadanya, dia berkata; Saya mendengar [Jabir bin Abdullah] berkata; \"Di zaman Rasulullah Shallallu 'alaihi wa sallam kami terbiasa menyewakan tanah dengan bayaran sepertiga atau seperempat (dari hasil panen) yang disepanjang saluran air (parit), maka Rasulullah Shallallu 'alaihi wa sallam bersabda dalam kasus ini: \"Barangsiapa yang memiliki tanah, hendaklah ditanaminya sendiri, jika dia tidak sanggup menanaminya sendiri hendaklah dipinjamkan kepada saudaranya (supaya ditanaminya), jika tidak hendaknya dibiarkan.\""
            },
            {
                "number": 2664,
                "arab": "و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ أَنَّ بُكَيْرًا حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي سَلَمَةَ حَدَّثَهُ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِقَالَ بُكَيْرٌ وَحَدَّثَنِي نَافِعٌ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يَقُولُا كُنَّا نُكْرِي أَرْضَنَا ثُمَّ تَرَكْنَا ذَلِكَ حِينَ سَمِعْنَا حَدِيثَ رَافِعِ بْنِ خَدِيجٍ",
                "id": "Telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru dia adalah Ibnul Harits] bahwa [Bukair] telah bercerita bahwa [Abdullah bin Abi Salamah] telah menceritakan kepadanya dari [Nu'man bin Abi 'Ayyasy] dari [Jabir bin Abdullah] bahwa Rasulullah Shallallu 'alaihi wa sallam melarang menyewakan tanah. [Bukair] berkata; Telah menceritakan kepadaku [Nafi'] bahwa dia mendengar [Ibnu Umar] berkata; \"Kami biasa melakukan sewa menyewa tanah, setelah kami mendengar hadits [Rafi' bin Khudaij], kami meninggalkan hal itu.\""
            },
            {
                "number": 2665,
                "arab": "و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْأَرْضِ الْبَيْضَاءِ سَنَتَيْنِ أَوْ ثَلَاثًا",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Az Zubair] dari [Jabir] dia berkata; \"Rasulullah Shallallu 'alaihi wa sallam melarang mengadakan kontrak tanah gersang dua atau tiga tahun.\""
            },
            {
                "number": 2666,
                "arab": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ يَعْلَى بْنِ حَكِيمٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَكُنَّا نُحَاقِلُ الْأَرْضَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُكْرِيهَا بِالثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى فَجَاءَنَا ذَاتَ يَوْمٍ رَجُلٌ مَنْ عُمُومَتِي فَقَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَوَاعِيَةُ اللَّهِ وَرَسُولِهِ أَنْفَعُ لَنَا نَهَانَا أَنْ نُحَاقِلَ بِالْأَرْضِ فَنُكْرِيَهَا عَلَى الثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى وَأَمَرَ رَبَّ الْأَرْضِ أَنْ يَزْرَعَهَا أَوْ يُزْرِعَهَا وَكَرِهَ كِرَاءَهَا وَمَا سِوَى ذَلِكَو حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ قَالَ كَتَبَ إِلَيَّ يَعْلَى بْنُ حَكِيمٍ قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ يُحَدِّثُ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ كُنَّا نُحَاقِلُ بِالْأَرْضِ فَنُكْرِيهَا عَلَى الثُّلُثِ وَالرُّبُعِ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ و حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ ح و حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الْأَعْلَى ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدَةُ كُلُّهُمْ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ يَعْلَى بْنِ حَكِيمٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ و حَدَّثَنِيهِ أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ عَنْ يَعْلَى بْنِ حَكِيمٍ بِهَذَا الْإِسْنَادِ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ عَنْ بَعْضِ عُمُومَتِهِ",
                "id": "Dan telah menceritakan kepadaku [Ali bin Hujr As Sa'di] dan [Ya'qub bin Ibrahim] keduanya berkata; Telah menceritakan kepada kami [Isma'il yaitu Ibnu 'Ulayyah] dari [Ayyub] dari [Ya'la bin Hakim] dari [Sulaiman bin Yasar] dari [Rafi' bin Khadij] dia berkata; \"Dulu di zaman Rasulullah shallallahu 'alaihi wasallam kami biasa melakukan muhaqalah tanah perkebunan, oleh karena itu kami biasa menyewakannya dengan bayaran sepertiga atau seperempat (dari hasil panen) atau dengan bayaran makanan tertentu. Hingga pada suatu ketika, salah seorang pamanku datang seraya berkata; 'Rasulullah shallallahu 'alaihi wasallam telah melarang usaha kita yang menguntungkan ini, tetapi mematuhi perintah Allah dan Rasul-Nya lebih bermanfa'at bagi kita. Beliau melarang kita menyewakan tanah dengan memungut sepertiga atau seperempat hasil tanaman atau makanan tertentu. Dan Allah memerintahkan kita supaya menanaminya sendiri atau ditanami orang lain tanpa memungut sewa atau yang semisal itu'.\" Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Hammad bin Zaid] dari [Ayyub] dia berkata; [Ya'la bin Hakim] menulis sesuatu kepada kami, dia berkata; Saya mendengar [Sulaiman bin Yasar] telah bercerita dari [Rafi' bin Khadij] dia berkata; Dahulu kami biasa menyewakan tanah perkebunan dengan bayaran sepertiga atau seperempat, kemudian dia menyebutkan seperti hadits Ibnu 'Ulayyah. Dan telah menceritakan kepada kami [Yahya bin Habib] telah menceritakan kepada kami [Khalid bin Al Harits]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Abdul A'la]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami ['Abdah] semuanya dari [Ibnu Abi 'Arubah] dari [Ya'la bin Hakim] dengan isnad ini. Telah menceritakan kepadaku [Abu Thahir] telah mengabarkan kepada kami [Ibnu Wahab] telah mengabarkan kepadaku [Jarir bin Hazim] dari [Ya'la bin Hakim] dengan isnad ini, dari [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam, dan dia tidak mengatakan; \"Dari salah seorang pamannya.\""
            },
            {
                "number": 2667,
                "arab": "حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو مُسْهِرٍ حَدَّثَنِي يَحْيَى بْنُ حَمْزَةَ حَدَّثَنِي أَبُو عَمْرٍو الْأَوْزَاعِيُّ عَنْ أَبِي النَّجَاشِيِّ مَوْلَى رَافِعِ بْنِ خَدِيجٍ عَنْ رَافِعٍ أَنَّ ظُهَيْرَ بْنَ رَافِعٍ وَهُوَ عَمُّهُ قَالَأَتَانِي ظُهَيْرٌ فَقَالَ لَقَدْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَمْرٍ كَانَ بِنَا رَافِقًا فَقُلْتُ وَمَا ذَاكَ مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُوَ حَقٌّ قَالَ سَأَلَنِي كَيْفَ تَصْنَعُونَ بِمَحَاقِلِكُمْ فَقُلْتُ نُؤَاجِرُهَا يَا رَسُولَ اللَّهِ عَلَى الرَّبِيعِ أَوْ الْأَوْسُقِ مِنْ التَّمْرِ أَوْ الشَّعِيرِ قَالَ فَلَا تَفْعَلُوا ازْرَعُوهَا أَوْ أَزْرِعُوهَا أَوْ أَمْسِكُوهَاحَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ عَنْ أَبِي النَّجَاشِيِّ عَنْ رَافِعٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا وَلَمْ يَذْكُرْ عَنْ عَمِّهِ ظُهَيْرٍ",
                "id": "Telah menceritakan kepadaku [Ishaq bin Manshur] telah mengabarkan kepada kami [Abu Mushir] telah mengabarkan kepadaku [Yahya bin Hamzah] telah menceritakan kepadaku [Abu 'Amru Al Auza'i] dari [Abu An Najasy] bekas budak Rafi' bin Khadij, dari [Rafi'] bahwa [Dzuhair bin Rafi'] dia adalah paman Rafi', dia berkata; Suatu ketika Dzuhair mendatangiku, dia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang dari usaha yang menguntungkan kita.\" Saya bertanya; \"Apakah itu? Tidaklah Rasulullah shallallahu 'alaihi wasallam mengatakan sesuatu kecuali hal itu adalah benar.\" Dia berkata; Beliau bertanya kepadaku: \"Bagaimana kalian memperlakukan tanah perkebunan kalian?\" Maka saya menjawab; \"Wahai Rasulullah, kami biasa menyewakan dengan bayaran seperempat atau beberapa wasaq kurma atau gandum.\" Beliau bersabda: \"Jangan kalian lakukan hal itu, tanamilah sendiri atau jika tidak, biarkanlah tanah tersebut.\" Telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Ikrimah bin 'Ammar] dari [Abu An Najasyi] dari [Rafi'] dari Nabi shallallahu 'alaihi wasallam, dan dia tidak menyebutkan \"dari pamannya yaitu Dzuhair.\""
            },
            {
                "number": 2668,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ أَنَّهُ سَأَلَ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الْأَرْضِ فَقَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كِرَاءِ الْأَرْضِقَالَ فَقُلْتُ أَبِالذَّهَبِ وَالْوَرِقِ فَقَالَ أَمَّا بِالذَّهَبِ وَالْوَرِقِ فَلَا بَأْسَ بِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Saya membaca di hadapan [Malik] dari [Rabi'ah bin Abu Abdurrahman] dari [Handlalah bin Qais] bahwa dia pernah bertanya kepada [Rafi' bin Khadij] mengenai menyewakan tanah perkebunan dengan memungut sebagian hasil tanaman (Kira`). Dia menjawab; \"Rasulullah shallallahu 'alaihi wasallam telah melarang melakukan yang demikian itu.\" Handlalah berkata; Lalu kukatakan; \"Bagaimana kalau disewakan dengan emas atau perak?\" Dia menjawab; \"Tidak mengapa jika disewakan dengan emas atau perak.\""
            },
            {
                "number": 2669,
                "arab": "حَدَّثَنَا إِسْحَقُ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ حَدَّثَنِي حَنْظَلَةُ بْنُ قَيْسٍ الْأَنْصَارِيُّ قَالَسَأَلْتُ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الْأَرْضِ بِالذَّهَبِ وَالْوَرِقِ فَقَالَ لَا بَأْسَ بِهِ إِنَّمَا كَانَ النَّاسُ يُؤَاجِرُونَ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمَاذِيَانَاتِ وَأَقْبَالِ الْجَدَاوِلِ وَأَشْيَاءَ مِنْ الزَّرْعِ فَيَهْلِكُ هَذَا وَيَسْلَمُ هَذَا وَيَسْلَمُ هَذَا وَيَهْلِكُ هَذَا فَلَمْ يَكُنْ لِلنَّاسِ كِرَاءٌ إِلَّا هَذَا فَلِذَلِكَ زُجِرَ عَنْهُ فَأَمَّا شَيْءٌ مَعْلُومٌ مَضْمُونٌ فَلَا بَأْسَ بِهِ",
                "id": "Telah menceritakan kepadaku [Ishaq] telah menceritakan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Al Auza'i] dari [Rabi'ah bin Abu Abdurrahman] telah menceritakan kepadaku [Handlalah bin Qais Al Anshari] dia berkata; \"Saya bertanya kepada [Rafi' bin Khadij] mengenai menyewakan tanah perkebunan dengan bayaran emas dan perak.\" Maka dia menjawab; \"Hal itu tidak mengapa. Dulu pada masa Rasulullah shallallahu 'alaihi wasallam, banyak para sahabat yang menyewakan tanahnya dengan imbalan memperoleh hasil panen dari tanaman yang tumbuh di sekitar parit atau saluran air atau sejumlah tanaman itu sendiri, apabila suatu ketika pemilik tanah itu rugi, justru pemilik tanah itu merasa diuntungkan, atau pemilik tanah mendapatkan keuntungan dan penyewa yang merasa dirugikan, tetapi anehnya banyak dari orang-orang yang melakukan penyewaan seperti itu. Oleh karena itu, Rasulullah shallallahu 'alaihi wasallam melarang penyewaan tanah seperti di atas. Sedangkan penyewaan tanah dengan pembayaran yang telah diketahui dan dapat dipertanggung jawabkan, maka hal itu tidaklah dilarang.\""
            },
            {
                "number": 2670,
                "arab": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ حَنْظَلَةَ الزُّرَقِيِّ أَنَّهُ سَمِعَ رَافِعَ بْنَ خَدِيجٍ يَقُولُاكُنَّا أَكْثَرَ الْأَنْصَارِ حَقْلًا قَالَ كُنَّا نُكْرِي الْأَرْضَ عَلَى أَنَّ لَنَا هَذِهِ وَلَهُمْ هَذِهِ فَرُبَّمَا أَخْرَجَتْ هَذِهِ وَلَمْ تُخْرِجْ هَذِهِ فَنَهَانَا عَنْ ذَلِكَ وَأَمَّا الْوَرِقُ فَلَمْ يَنْهَنَاحَدَّثَنَا أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ جَمِيعًا عَنْ يَحْيَى بْنِ سَعِيدٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Yahya bin Sa'id] dari [Handlalah Az Zuraqi] bahwa dia mendengar [Rafi' bin Khadij] berkata; \"Kebanyakan kami dari orang-orang Anshar melakukan muhaqalah.\" Rafi' melanjutkan; \"Kami biasa menyewakan tanah perkebunan dengan imbalan bagi kami ini dan bagi mereka sebelah sana, seandainya tanaman yang membuahkan hasil ternyata di sebelah sana tidak membuahkan hasil, oleh karenanya kami dilarang melakukan usaha seperti itu, dan tidak mengapa jika menyewakan tanah perkebunan dengan imbalan dirham.\" Telah menceritakan kepada kami [Abu Rabi'] telah menceritakan kepada kami [Hammad]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Yazid bin Harun] semuanya dari [Yahya bin Sa'id] dengan isnad seperti ini."
            },
            {
                "number": 2671,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ كِلَاهُمَا عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ عَنْ الْمُزَارَعَةِ فَقَالَ أَخْبَرَنِي ثَابِتُ بْنُ الضَّحَّاكِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَارَعَةِوَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ نَهَى عَنْهَا وَقَالَ سَأَلْتُ ابْنَ مَعْقِلٍ وَلَمْ يُسَمِّ عَبْدَ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abdul Wahid bin Ziyad]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abi Syaibah] telah menceritakan kepada kami [Ali bin Mushir] keduanya dari [As Syaibani] dari [Abdullah As Sa`ib] dia berkata; Saya bertanya kepada [Abdullah bin Ma'qil] mengenai muzara'ah. Dia menjawab; Telah mengabarkan kepadaku [Tsabit bin Dlahhak] bahwa Rasulullah shallallahu 'alaihi wasallam melarang praktek muzara'ah (yaitu mengelola tanah perkebunan orang lain dengan imbalan sebagian dari hasil panennya).\" Dan dalam riwayatnya Ibnu Abi Syaibah dikatakan; Beliau melarang praktek tersebut. Dan dia berkata; Saya bertanya kepada Ibnu Ma'qil. Tidak menyebutkan nama Abdullah."
            },
            {
                "number": 2672,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَ دَخَلْنَا عَلَى عَبْدِ اللَّهِ بْنِ مَعْقِلٍ فَسَأَلْنَاهُ عَنْ الْمُزَارَعَةِ فَقَالَ زَعَمَ ثَابِتٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَارَعَةِ وَأَمَرَ بِالْمُؤَاجَرَةِ وَقَالَ لَا بَأْسَ بِهَا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Yahya bin Hammad] telah mengabarkan kepada kami [Abu 'Awanah] dari [Sulaiman As Syaibani] dari [Abdullah bin As Sa`ib] dia berkata; Saya menemui [Abdullah bin Ma'qil] dan bertanya mengenai praktek muzara'ah. Dia menjawab; [Tsabit] mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam melarang praktek muzara'ah dan memerintahkan dengan cara mujarah (mengupah). Ma'qil melanjutkan; \"Tidak amengapa jika dengan mujarah.\" "
            },
            {
                "number": 2673,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرٍو أَنَّ مُجَاهِدًا قَالَ لِطَاوُسٍ انْطَلِقْ بِنَا إِلَى ابْنِ رَافِعِ بْنِ خَدِيجٍ فَاسْمَعْ مِنْهُ الْحَدِيثَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَانْتَهَرَهُ قَالَ إِنِّي وَاللَّهِ لَوْ أَعْلَمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ مَا فَعَلْتُهُ وَلَكِنْ حَدَّثَنِي مَنْ هُوَ أَعْلَمُ بِهِ مِنْهُمْ يَعْنِي ابْنَ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ يَمْنَحَ الرَّجُلُ أَخَاهُ أَرْضَهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا خَرْجًا مَعْلُومًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Hammad bin Zaid] dari ['Amru] bahwa Mujahid berkata kepada [Thawus]; \"Mari pergi bersamaku menemui Ibnu Rafi' bin Khadij dan dengarlah hadits darinya dari ayahnya dari Nabi shallallahu 'alaihi wasallam. Maka Thawus memarahinya, dia berkata; \"Demi Allah, sekiranya saya mengetahui kalau Rasulullah shallallahu 'alaihi wasallam melarang hal itu, niscaya saya tidak akan melakukannya, akan tetapi telah menceritakan kepadaku seseorang yang lebih mengetahui daripada mereka yaitu [Ibnu Abbas], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seseorang memberikan tanahnya kepada saudaranya itu lebih baik baginya daripada dia memungut imbalan tertentu.\" "
            },
            {
                "number": 2674,
                "arab": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو وَابْنُ طَاوُسٍ عَنْ طَاوُسٍأَنَّهُ كَانَ يُخَابِرُ قَالَ عَمْرٌو فَقُلْتُ لَهُ يَا أَبَا عَبْدِ الرَّحْمَنِ لَوْ تَرَكْتَ هَذِهِ الْمُخَابَرَةَ فَإِنَّهُمْ يَزْعُمُونَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ فَقَالَ أَيْ عَمْرُو أَخْبَرَنِي أَعْلَمُهُمْ بِذَلِكَ يَعْنِي ابْنَ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَنْهَ عَنْهَا إِنَّمَا قَالَ يَمْنَحُ أَحَدُكُمْ أَخَاهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا خَرْجًا مَعْلُومًاحَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا الثَّقَفِيُّ عَنْ أَيُّوبَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ وَكِيعٍ عَنْ سُفْيَانَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ شَرِيكٍ عَنْ شُعْبَةَ كُلُّهُمْ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِهِمْ",
                "id": "Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan] dari ['Amru] dan [Ibnu Thawus] dari [Thawus] bahwa dia adalah seorang petani yang mengusahakan tanahnya dan memungut sebagian dari hasil tanaman yang ditanamnya, Amru berkata; Lalu saya bertanya kepadanya; \"Wahai Abu Abdurrahman, sekiranya kamu menghentikan usahamu melakukan mukhabarah, karena sesungguhnya mereka mengatakan bahwa Nabi shallallahu 'alaihi wasallam telah melarang melakukan mukhabarah.\" Thawus menjawab; \"Hai Amru, telah mengabarkan kepadaku orang yang lebih mengetahui daripada mereka tentang perihal itu -yaitu [Ibnu Abbas] - bahwa Nabi shallallahu 'alaihi wasallam tidak melarang hal itu, hanyasanya beliau bersabda: \"Salah seorang dari kalian memberikan sebagian tanahnya kepada saudaranya itu lebih baik daripada memungut imbalan tertentu.\" Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Ats Tsaqafi] dari [Ayyub]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim] semuanya dari [Waki'] dari [Sufyan]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Al Laits] dari [Ibnu Juraij]. Dan diriwayatkan dari jalur lain, telah menceritakan kepadaku [Ali bin Hujr] telah menceritakan kepada kami [Al Fadll bin Musa] dari [Syarik] dari [Syu'bah] semuanya dari ['Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam seperti hadits mereka."
            },
            {
                "number": 2675,
                "arab": "و حَدَّثَنِي عَبْدُ بْنُ حُمَيْدٍ وَمُحَمَّدُ بْنُ رَافِعٍ قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ أَرْضَهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا كَذَا وَكَذَا لِشَيْءٍ مَعْلُومٍقَالَ وَقَالَ ابْنُ عَبَّاسٍ هُوَ الْحَقْلُ وَهُوَ بِلِسَانِ الْأَنْصَارِ الْمُحَاقَلَةُ",
                "id": "Dan telah menceritakan kepadaku [Abd bin Humaid] dan [Muhammad bin Rafi'], Abd mengatakan; Telah mengabarkan kepada kami, sedangkan Ibnu Rafi' mengatakan; Telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika seseorang memberikan tanah ladangnya kepada saudaranya (untuk ditanami), maka itu lebih baik daripada harus memungut ini dan ini dengan imbalan tertentu.\" Thawus berkata; Ibnu Abbas berkata; \"Ia adalah haql, namun dalam bahasanya orang-orang Anshar adalah muhaqalah.\""
            },
            {
                "number": 2676,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ زَيْدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَإِنَّهُ أَنْ يَمْنَحَهَا أَخَاهُ خَيْرٌ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Darimi] telah menceritakan kepada kami [Abdullah bin Ja'far Ar Raqi] telah menceritakan kepada kami [ubaidhullah bin 'Amru] dari [Zaid bin Abi Unaisah] dari [Abdul Malik bin Zaid] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang memiliki tanah, kemudian ia memberikannya kepada saudaranya (semuslim), maka itu lebih baik baginya.\""
            },
            {
                "number": 2677,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَزُهَيْرُ بْنُ حَرْبٍ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْهَا مِنْ ثَمَرٍ أَوْ زَرْعٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Zuhair bin Harb] sedangkan lafazhnya dari [Zuhair] keduanya berkata; Telah menceritakan kepada kami [Yahya yaitu Al Qaththan] dari ['Ubaidillah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mempekerjakan penduduk Khaibar dengan upah sebagian dari hasil buah-buahan atau tanam-tanaman yang mereka tanam."
            },
            {
                "number": 2678,
                "arab": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا عَلِيٌّ وَهُوَ ابْنُ مُسْهِرٍ أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَأَعْطَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْ ثَمَرٍ أَوْ زَرْعٍ فَكَانَ يُعْطِي أَزْوَاجَهُ كُلَّ سَنَةٍ مِائَةَ وَسْقٍ ثَمَانِينَ وَسْقًا مِنْ تَمْرٍ وَعِشْرِينَ وَسْقًا مِنْ شَعِيرٍفَلَمَّا وَلِيَ عُمَرُ قَسَمَ خَيْبَرَ خَيَّرَ أَزْوَاجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْطِعَ لَهُنَّ الْأَرْضَ وَالْمَاءَ أَوْ يَضْمَنَ لَهُنَّ الْأَوْسَاقَ كُلَّ عَامٍ فَاخْتَلَفْنَ فَمِنْهُنَّ مَنْ اخْتَارَ الْأَرْضَ وَالْمَاءَ وَمِنْهُنَّ مَنْ اخْتَارَ الْأَوْسَاقَ كُلَّ عَامٍ فَكَانَتْ عَائِشَةُ وَحَفْصَةُ مِمَّنْ اخْتَارَتَا الْأَرْضَ وَالْمَاءَ و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا خَرَجَ مِنْهَا مِنْ زَرْعٍ أَوْ ثَمَرٍ وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِ عَلِيِّ بْنِ مُسْهِرٍ وَلَمْ يَذْكُرْ فَكَانَتْ عَائِشَةُ وَحَفْصَةُ مِمَّنْ اخْتَارَتَا الْأَرْضَ وَالْمَاءَ وَقَالَ خَيَّرَ أَزْوَاجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْطِعَ لَهُنَّ الْأَرْضَ وَلَمْ يَذْكُرْ الْمَاءَ و حَدَّثَنِي أَبُو الطَّاهِرِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِيُّ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ لَمَّا افْتُتِحَتْ خَيْبَرُ سَأَلَتْ يَهُودُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقِرَّهُمْ فِيهَا عَلَى أَنْ يَعْمَلُوا عَلَى نِصْفِ مَا خَرَجَ مِنْهَا مِنْ الثَّمَرِ وَالزَّرْعِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُقِرُّكُمْ فِيهَا عَلَى ذَلِكَ مَا شِئْنَا ثُمَّ سَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ ابْنِ نُمَيْرٍ وَابْنِ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ وَزَادَ فِيهِ وَكَانَ الثَّمَرُ يُقْسَمُ عَلَى السُّهْمَانِ مِنْ نِصْفِ خَيْبَرَ فَيَأْخُذُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخُمْسَ",
                "id": "Telah menceritakan kepadaku [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Ali yaitu Ibnu Mushir] telah mengabarkan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah memberi (upah) kepada penduduk Khaibar dengan sebagian dari tumbuh-tumbuhan atau tanam-tanaman yang dihasilkan mereka. Kemudian beliau bagi-bagikan setiap tahunnya kepada para isterinya sebanyak seratus wasaq yaitu berupa delapan puluh wasaq dan dua puluh gandum. Ketika Umar bin Khaththab berkuasa, maka tanah Khaibar tersebut mulai dibagi-bagikan. Umar memberikan pilihan kepada para istri Nabi shallallahu 'alaihi wasallam apakah mereka menghendaki menerima tanah dan air atau akan tetap menerima jatah pangan beberapa wasaq seperti biasa setiap tahunnya. Di antara mereka ada yang memilih pembagian tanah dan air, sedangkan yang lainnya ada yang memilih jatah seperti biasa setiap tahun. Dalam hal ini, Aisyah dan Hafshah memilih pembagian tanah dan air.\" Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [ubaidhullah] telah menceritakan kepadaku [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mempekerjakan penduduk Khaibar dengan upah dari sebagian hasil tanaman yang mereka tanam atau buah yang mereka tanam…\" kemudian ia meneruskan hadits sebagaimana hadits Ali bin Mushir, dan tidak menyebutkan lafazh; Sedangkan 'Aisyah dan Hafshah termasuk yang memilih pembagian tanah dan air. Dan telah menceritakan kepadaku [Abu Thahir] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Usamah bin Zaid Al Laitsi] dari [Nafi'] dari [Abdullah bin Umar] dia berkata; \"Tatkala Khaibar dapat ditaklukkan, orang-orang yahudi memohon kepada Rasulullah shallallahu 'alaihi wasallam supaya merka diperbolehkan tetap tinggal di sana untuk mengerjakan sawah dan ladang dengan upah seperdua dari tanaman atau buah-buahan yang dihasilkan.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Kami bolehkan kalian menetap sampai batas waktu yang kami tentukan.\" Kemudian dia meneruskan hadits tersebut seperti hadits Ibnu Numair dan Ibnu Mushir dari ubaidhullah dengan tambahan lafazh; Dan setengah buah-buahan dari hasil ghanimah Khaibar telah di bagi-bagikan, Rasulullah shallallahu 'alaihi wasallam mengambil seperlimanya.\" "
            },
            {
                "number": 2679,
                "arab": "و حَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْتَمِلُوهَا مِنْ أَمْوَالِهِمْ وَلِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرُ ثَمَرِهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepada kami [Al Laits] dari [Muhammad bin Abdurrahman] dari [Nafi'] dari [Abdullah bin Umar] dari Rasulullah shallallahu 'alaihi wasallam bahwa Beliau pernah menyerahkan kebun kurma kepada orang-orang yahudi Khaibar supaya mereka garap dengan biaya mereka sendiri, dengan ketentuan; separuh dari hasil tanaman yang mereka hasilkan untuk Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 2680,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَإِسْحَقُ بْنُ مَنْصُورٍ وَاللَّفْظُ لِابْنِ رَافِعٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍعَنْ ابْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ أَجْلَى الْيَهُودَ وَالنَّصَارَى مِنْ أَرْضِ الْحِجَازِ وَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا ظَهَرَ عَلَى خَيْبَرَ أَرَادَ إِخْرَاجَ الْيَهُودِ مِنْهَا وَكَانَتْ الْأَرْضُ حِينَ ظُهِرَ عَلَيْهَا لِلَّهِ وَلِرَسُولِهِ وَلِلْمُسْلِمِينَ فَأَرَادَ إِخْرَاجَ الْيَهُودِ مِنْهَا فَسَأَلَتْ الْيَهُودُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقِرَّهُمْ بِهَا عَلَى أَنْ يَكْفُوا عَمَلَهَا وَلَهُمْ نِصْفُ الثَّمَرِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُقِرُّكُمْ بِهَا عَلَى ذَلِكَ مَا شِئْنَا فَقَرُّوا بِهَا حَتَّى أَجْلَاهُمْ عُمَرُ إِلَى تَيْمَاءَ وَأَرِيحَاءَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Ishaq bin Manshur] sedangkan lafazhnya dari Ibnu Rafi' keduanya berkata; Telah menceritakan kepada kami [Abdur Razzaq] telah mengabarkan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa Umar bin Khaththab telah mengusir orang-orang Yahudi dan Nashrani dari tanah hijaz. Sesungguhnya setelah penaklukan Khaibar, Rasulullah shallallahu 'alaihi wasallam bermaksud mengusir orang-orang Yahudi dari negeri itu, sebab setelah dikuasai, negeri tersebut milik Allah dan Rasul-Nya serta milik kaum Muslimin seluruhnya. Karena itulah Rasulullah shallallahu 'alaihi wasallam bermaksud hendak mengusir orang-orang Yahudi dari negeri itu, tetapi orang-orang Yahudi memohon kepada Rasulullah shallallahu 'alaihi wasallam agar beliau membolehkan mereka tetap tinggal di sana untuk meneruskan usaha (pertanian) mereka, dengan ketentuan; bagi mereka seperdua dari hasil buah-buahan yang mereka kerjakan. Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Kami izinkan kalian menetap dengan ketentuan seperti itu sampai batas waktu yang kami kehendaki.\" Maka mereka pun menetap di situ sampai datang waktunya Umar mengusir mereka ke Taima` dan Ariha`."
            },
            {
                "number": 2681,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا إِلَّا كَانَ مَا أُكِلَ مِنْهُ لَهُ صَدَقَةً وَمَا سُرِقَ مِنْهُ لَهُ صَدَقَةٌ وَمَا أَكَلَ السَّبُعُ مِنْهُ فَهُوَ لَهُ صَدَقَةٌ وَمَا أَكَلَتْ الطَّيْرُ فَهُوَ لَهُ صَدَقَةٌ وَلَا يَرْزَؤُهُ أَحَدٌ إِلَّا كَانَ لَهُ صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang muslim yang bercocok tanam, kecuali setiap tanamannya yang dimakannya bernilai sedekah baginya, apa yang dicuri orang darinya menjadi sedekah baginya, apa yang dimakan binatang liar menjadi sedekah baginya, apa yang dimakan burung menjadi sedekah baginya, dan tidaklah seseorang mengambil darinya, melainkah ia menjadi sedekah baginya.\""
            },
            {
                "number": 2682,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى أُمِّ مُبَشِّرٍ الْأَنْصَارِيَّةِ فِي نَخْلٍ لَهَا فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ غَرَسَ هَذَا النَّخْلَ أَمُسْلِمٌ أَمْ كَافِرٌ فَقَالَتْ بَلْ مُسْلِمٌ فَقَالَ لَا يَغْرِسُ مُسْلِمٌ غَرْسًا وَلَا يَزْرَعُ زَرْعًا فَيَأْكُلَ مِنْهُ إِنْسَانٌ وَلَا دَابَّةٌ وَلَا شَيْءٌ إِلَّا كَانَتْ لَهُ صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah mengabarkan kepada kami [Laits]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] dari [Ibnu Zubair] dari [Jabir] bahwasannya Nabi shallallahu 'alaihi wasallam menemui Ummu Mubasyir Al Anshariyah di kebun kurma miliknya, lantas Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Siapakah yang menanam pohon kurma ini? Apakah ia seorang muslim atau kafir? Dia menjawab, \"Seorang Muslim.\" Beliau bersabda: \"Tidaklah seorang Muslim yang menanam pohon atau menanam tanaman lalu tanaman tersebut dimakan oleh oleh manusia, binatang melata atau sesuatu yang lain kecuali hal itu berniali sedekah untuknya.\""
            }
        ]
    }
}