{
    "status": true,
    "data": {
        "start": 3726,
        "end": 3874,
        "total": 149,
        "book": "muslim",
        "hadits": [
            {
                "number": 3726,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ سَيَّارٍ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى غِلْمَانٍ فَسَلَّمَ عَلَيْهِمْو حَدَّثَنِيهِ إِسْمَعِيلُ بْنُ سَالِمٍ أَخْبَرَنَا هُشَيْمٌ أَخْبَرَنَا سَيَّارٌ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepadaku [Yahya bin Yahya]; Telah mengabarkan kepada kami [Husyaim] dari [Sayyar] dari [Tsabit Al Bunani] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam pernah bertemu dengan beberapa orang anak kecil, lalu beliau memberi salam kepada mereka.\" Dan telah menceritakannya kepadaku [Ismail bin Salim] Telah mengabarkan kepada kami [Husyaim]. Telah mengabarkan kepada kami [Sayyar] melalui jalur ini."
            },
            {
                "number": 3727,
                "arab": "و حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَيَّارٍ قَالَ كُنْتُ أَمْشِي مَعَ ثَابِتٍ الْبُنَانِيِّ فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ وَحَدَّثَ ثَابِتٌ أَنَّهُ كَانَ يَمْشِي مَعَ أَنَسٍ فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ وَحَدَّثَ أَنَسٌأَنَّهُ كَانَ يَمْشِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ",
                "id": "Dan telah menceritakan kepadaku ['Amru bin 'Ali] dan [Muhammad bin Al Walid] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dari [Sayyar] ia berkata; Aku pernah berjalan bersama [Tsabit Al Banani], kemudian kami melewati anak-anak kecil. Maka dia (Tsabit) memberi salam kepada mereka. Setelah itu (Tsabit) bercerita bahwa dia pernah berjalan bersama Anas, kemudian melewati anak-anak kecil dan dia mengucapkan salam kepada mereka. Demikian juga [Anas] bercerita bahwa dia pernah berjalan bersama Rasulullah shallallahu 'alaihi wasallam kemudian melewati anak-anak kecil, lalu beliau shallallahu 'alaihi wasallam mengucapkan salam kepada mereka."
            },
            {
                "number": 3728,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ كِلَاهُمَا عَنْ عَبْدِ الْوَاحِدِ وَاللَّفْظُ لِقُتَيْبَةَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا الْحَسَنُ بْنُ عُبَيْدِ اللَّهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُوَيْدٍ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ يَقُولُاقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْنُكَ عَلَيَّ أَنْ يُرْفَعَ الْحِجَابُ وَأَنْ تَسْتَمِعَ سِوَادِي حَتَّى أَنْهَاكَو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari] dan [Qutaibah bin Sa'id] keduanya dari ['Abdul Wahid] dan lafazh ini miliknya Qutaibah; Telah menceritakan kepada kami ['Abdul Wahid bin Ziyad]; Telah menceritakan kepada kami [Al Hasan bin 'Ubaidillah]; Telah menceritakan kepada kami [Ibrahim bin Suwaid] ia berkata; Aku mendengar [Abdurraman bin Yazid] berkata; Aku mendengar [Abdullah bin Mas'ud] berkata; Rasulullah shallallahu 'alaihi wasallam berkata kepadaku; \"Tanda izin masuk bagimu ialah, bila tirai telah diangkat. Dan engkau boleh mendengar pembicaraan yang kurahasiakan, kecuali bila kularang.\" Dan telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] dan [Muhammad bin 'Abdullah bin Numair] serta [Ishaq bin Ibrahim]. Berkata [Ishaq]; Telah mengabarkan kepada kami. Sedangkan yang lainnya berkata; Telah menceritakan kepada kami ['Abdullah bin Idris] dari [Al Hasan bin 'Ubaidillah] melalui sanad ini dengan Hadits yang serupa."
            },
            {
                "number": 3729,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْخَرَجَتْ سَوْدَةُ بَعْدَ مَا ضُرِبَ عَلَيْهَا الْحِجَابُ لِتَقْضِيَ حَاجَتَهَا وَكَانَتْ امْرَأَةً جَسِيمَةً تَفْرَعُ النِّسَاءَ جِسْمًا لَا تَخْفَى عَلَى مَنْ يَعْرِفُهَا فَرَآهَا عُمَرُ بْنُ الْخَطَّابِ فَقَالَ يَا سَوْدَةُ وَاللَّهِ مَا تَخْفَيْنَ عَلَيْنَا فَانْظُرِي كَيْفَ تَخْرُجِينَ قَالَتْ فَانْكَفَأَتْ رَاجِعَةً وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي وَإِنَّهُ لَيَتَعَشَّى وَفِي يَدِهِ عَرْقٌ فَدَخَلَتْ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي خَرَجْتُ فَقَالَ لِي عُمَرُ كَذَا وَكَذَا قَالَتْ فَأُوحِيَ إِلَيْهِ ثُمَّ رُفِعَ عَنْهُ وَإِنَّ الْعَرْقَ فِي يَدِهِ مَا وَضَعَهُ فَقَالَ إِنَّهُ قَدْ أُذِنَ لَكُنَّ أَنْ تَخْرُجْنَ لِحَاجَتِكُنَّوَفِي رِوَايَةِ أَبِي بَكْرٍ يَفْرَعُ النِّسَاءَ جِسْمُهَا زَادَ أَبُو بَكْرٍ فِي حَدِيثِهِ فَقَالَ هِشَامٌ يَعْنِي الْبَرَازَ و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ بِهَذَا الْإِسْنَادِ وَقَالَ وَكَانَتْ امْرَأَةً يَفْرَعُ النَّاسَ جِسْمُهَا قَالَ وَإِنَّهُ لَيَتَعَشَّى و حَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] berkata; Telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [Bapaknya] dari ['Aisyah] berkata; \"Pada suatu malam Saudah bin Zam'ah, istri Rasulullah shallallahu 'alaihi wasallam, keluar untuk buang hajat di tanah lapang. Saudah adalah seorang wanita besar yang tingginya melebihi rata-rata wanita Arab, hingga orang-orang yang melihatnya tidak akan sulit untuk mengenalinya. Kebetulan 'Umar bin Khaththab melihatnya dan berkata; 'Hai Saudah, demi Allah saya bisa mengenalimu. Oleh karena itu, janganlah kamu keluar rumah.' 'Aisyah berkata; 'Setelah itu ia berbalik pulang ke rumah. Pada saat itu Rasulullah shallallahu 'alaihi wasallam sedang makan malam dengan sepotong daging di tangannya. Lalu Saudah masuk ke dalam rumah untuk buang hajat. Tetapi 'Umar berkata begini dan begitu.' 'Aisyah berkata; 'Tak lama kemudian Rasulullah pun menerima wahyu. Setelah menerima wahyu -sementara sepotong daging masih beliau pegang- beliau pun bersabda: 'Sesungguhnya kalian (para istriku) diperbolehkan keluar rumah untuk buang hajat.' Dan di dalam riwayat Abu Bakr di sebutkan dengan lafazh Yafra'u (tubuhnya tinggi). Abu Bakr di dalam Hadits menambahkan, Hisyam berkata; yaitu Al Barraz. Dan telah menceritakannya kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Hisyam] melalui jalur ini, dan dia berkata; 'Dia adalah seorang wanita yang tinggi tubuhnya di antara yang lainnya. Dia juga berkata; 'Pada saat itu Rasulullah shallallahu 'alaihi wasallam sedang makan malam.' Dan telah menceritakannya kepadaku [Suwaid bin Sa'id]; Telah menceritakan kepada kami ['Ali bin Mushir] dari [Hisyam] melalui jalur ini."
            },
            {
                "number": 3730,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ أَزْوَاجَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنَّ يَخْرُجْنَ بِاللَّيْلِ إِذَا تَبَرَّزْنَ إِلَى الْمَنَاصِعِ وَهُوَ صَعِيدٌ أَفْيَحُ وَكَانَ عُمَرُ بْنُ الْخَطَّابِ يَقُولُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْجُبْ نِسَاءَكَ فَلَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ فَخَرَجَتْ سَوْدَةُ بِنْتُ زَمْعَةَ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً مِنْ اللَّيَالِي عِشَاءً وَكَانَتْ امْرَأَةً طَوِيلَةً فَنَادَاهَا عُمَرُ أَلَا قَدْ عَرَفْنَاكِ يَا سَوْدَةُ حِرْصًا عَلَى أَنْ يُنْزَلَ الْحِجَابُ قَالَتْ عَائِشَةُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ الْحِجَابَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami ['Abdul Malik bin Syu'aib bin Al Laits]; Telah menceritakan kepadaku [Bapakku] dari [Kakekku]; Telah menceritakan kepadaku ['Uqail bin Khalid] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari ['Aisyah] bahwa para isteri Rasulullah shallallahu 'alaihi wasallam keluar di waktu malam apabila mereka hendak buang hajat ke tempat yang telah disediakan di lapangan. Lalu 'Umar bin Khaththab mengusulkan kepada Rasulullah shallallahu 'alaihi wasallam supaya para isteri beliau memakai hijab. Tetapi Rasulullah shallallahu 'alaihi wasallam diam saja, tidak melakukan apa yang diusulkan 'Umar. Maka pada suatu malam keluar isteri beliau, Saudah binti Zam'ah, lalu ditegur oleh 'Umar; 'Hai Saudah! Kami mengenali engkau! ' Kata 'Umar; 'Sesungguhnya 'Umar menegurnya hanya karena dia ingin semoga Allah Subhanahu Wa Ta'ala menurunkan ayat yang memerintahkan hijab. Kata 'Aisyah; 'Memang, tidak lama kemudian maka turunlah ayat hijab.' Telah menceritakan kepada kami ['Amru An Naqid]; Telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd]; Telah menceritakan kepada kami [Bapakku] dari [Shalih] dari [Ibnu Syihab] melalui jalur ini dengan Hadits yang serupa."
            },
            {
                "number": 3731,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَعَلِيُّ بْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ ابْنُ حُجْرٍ حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا لَا يَبِيتَنَّ رَجُلٌ عِنْدَ امْرَأَةٍ ثَيِّبٍ إِلَّا أَنْ يَكُونَ نَاكِحًا أَوْ ذَا مَحْرَمٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan ['Ali bin Hujr] berkata [Yahya]; Telah mengabarkan kepada kami. Dan berkata [Ibnu Hujr]; Telah menceritakan kepada kami [Husyaim] dari [Abu Az Zubair] dari [Jabir]; Demikian juga diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Muhammad bin Ash Shabbah] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Husyaim]; Telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah! Seorang laki-laki bukan muhrim tidak boleh bermalam di rumah perempuan janda, kecuali jika dia telah menikah, atau ada muhrimnya.\""
            },
            {
                "number": 3732,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِيَّاكُمْ وَالدُّخُولَ عَلَى النِّسَاءِ فَقَالَ رَجُلٌ مِنْ الْأَنْصَارِ يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ الْحَمْوَ قَالَ الْحَمْوُ الْمَوْتُو حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ وَاللَّيْثِ بْنِ سَعْدٍ وَحَيْوَةَ بْنِ شُرَيْحٍ وَغَيْرِهِمْ أَنَّ يَزِيدَ بْنَ أَبِي حَبِيبٍ حَدَّثَهُمْ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Laits]; Demikian juga diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Muhammad bin Rumh]; Telah mengabarkan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hindarilah oleh kalian masuk ke rumah-rumah wanita!\" Lalu seorang Anshar bertanya; 'Ya, Rasulullah! Bagaimana pendapat Anda tentang Al Hamwu, (keluarga dekat dari suaminya).' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Bahkan itu lebih berbahaya.' Dan telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami ['Abdullah bin Wahb] dari ['Amru bin Al Harits], [Al Laits bin Sa'd], [Haywah bin Syuraih] dan selain mereka, bahwa [Yazid bin Abu Habib] menceritakan kepada mereka melalui jalur ini dengan Hadits yang serupa."
            },
            {
                "number": 3733,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ وَسَمِعْتُ اللَّيْثَ بْنَ سَعْدٍ يَقُولُاالْحَمْوُ أَخُ الزَّوْجِ وَمَا أَشْبَهَهُ مِنْ أَقَارِبِ الزَّوْجِ ابْنُ الْعَمِّ وَنَحْوُهُ",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami [Ibnu Wahb] ia berkata; Aku mendengar [Al Laits bin Sa'd] berkata; \"Al Hamwu adalah saudara suami dan yang lainnya dari kerabat dekat suami seperti sepupu dan seterusnya.\""
            },
            {
                "number": 3734,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو ح و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ بَكْرَ بْنَ سَوَادَةَ حَدَّثَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ حَدَّثَهُ أَنَّ نَفَرًا مِنْ بَنِي هَاشِمٍ دَخَلُوا عَلَى أَسْمَاءَ بِنْتِ عُمَيْسٍ فَدَخَلَ أَبُو بَكْرٍ الصِّدِّيقُ وَهِيَ تَحْتَهُ يَوْمَئِذٍ فَرَآهُمْ فَكَرِهَ ذَلِكَفَذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ لَمْ أَرَ إِلَّا خَيْرًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ قَدْ بَرَّأَهَا مِنْ ذَلِكَ ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَقَالَ لَا يَدْخُلَنَّ رَجُلٌ بَعْدَ يَوْمِي هَذَا عَلَى مُغِيبَةٍ إِلَّا وَمَعَهُ رَجُلٌ أَوْ اثْنَانِ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf]; Telah menceritakan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku ['Amru]; Demikian juga diriwayatkan dari jalur yang lain; Dan Telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami ['Abdullah bin Wahb] dari ['Amru bin Al Harits], [Bakr bin Sawadah]; Telah menceritakan kepadanya; ['Abdur Rahman bin Jubair]; Telah menceritakan kepadanya; ['Abdullah bin 'Amru bin Al 'Ash]; Telah menceritakan kapadanya bahwa beberapa orang Bani Hisyam datang ke rumah Asma' binti 'Umais, isteri Abu Bakar Shiddiq (ketika Abu Bakar sedang tidak di rumah). Tiba-tiba Abu Bakar pulang dan bertemu dengan mereka. Abu Bakar merasa kurang senang atas kedatangan mereka yang demikian. Lalu diceritakannya hal itu kepada Rasulullah shallallahu 'alaihi wasallam. Jawab beliau: \"Aku tidak melihat sesuatu yang buruk atas kedatangan mereka. Sesungguhnya Allah Subhanahu Wa Ta'ala telah menyucikan Asma' binti 'Umais dari hal-hal yang demikian.\" Kemudian beliau naik mimbar, lalu beliau bersabda: 'Sesudah hari ini, seorang laki-laki tidak boleh masuk ke rumah seorang wanita yang suaminya sedang pergi, kecuali bila laki-laki itu disertai seorang atau dua orang teman laki-laki.'"
            },
            {
                "number": 3735,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مَعَ إِحْدَى نِسَائِهِ فَمَرَّ بِهِ رَجُلٌ فَدَعَاهُ فَجَاءَ فَقَالَ يَا فُلَانُ هَذِهِ زَوْجَتِي فُلَانَةُ فَقَالَ يَا رَسُولَ اللَّهِ مَنْ كُنْتُ أَظُنُّ بِهِ فَلَمْ أَكُنْ أَظُنُّ بِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّيْطَانَ يَجْرِي مِنْ الْإِنْسَانِ مَجْرَى الدَّمِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit Al Bunani] dari [Anas] bahwa pada suatu ketika Nabi shallallahu 'alaihi wasallam sedang berdua dengan salah seorang isteri beliau. Kebetulan lewat ke dekat beliau seorang laki-laki. Orang itu dipanggil oleh Nabi shallallahu 'alaihi wasallam, maka dia datang menemui beliau. Lalu Nabi shallallahu 'alaihi wasallam berkata kepadanya; 'Hai, Fulan! Ini isteriku, si Fulanah.' orang itu menjawab; 'Ya, Rasulullah! Aku tidak menduga-duga dengan Anda.' Beliau bersabda: 'Sesungguhnya setan berjalan dalam tubuh manusia melalui aliran darah.' "
            },
            {
                "number": 3736,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ وَتَقَارَبَا فِي اللَّفْظِ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ صَفِيَّةَ بِنْتِ حُيَيٍّ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُعْتَكِفًا فَأَتَيْتُهُ أَزُورُهُ لَيْلًا فَحَدَّثْتُهُ ثُمَّ قُمْتُ لِأَنْقَلِبَ فَقَامَ مَعِيَ لِيَقْلِبَنِي وَكَانَ مَسْكَنُهَا فِي دَارِ أُسَامَةَ بْنِ زَيْدٍ فَمَرَّ رَجُلَانِ مِنْ الْأَنْصَارِ فَلَمَّا رَأَيَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْرَعَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رِسْلِكُمَا إِنَّهَا صَفِيَّةُ بِنْتُ حُيَيٍّ فَقَالَا سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ قَالَ إِنَّ الشَّيْطَانَ يَجْرِي مِنْ الْإِنْسَانِ مَجْرَى الدَّمِ وَإِنِّي خَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا شَرًّا أَوْ قَالَ شَيْئًاو حَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنَا عَلِيُّ بْنُ حُسَيْنٍ أَنَّ صَفِيَّةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ أَنَّهَا جَاءَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزُورُهُ فِي اعْتِكَافِهِ فِي الْمَسْجِدِ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ فَتَحَدَّثَتْ عِنْدَهُ سَاعَةً ثُمَّ قَامَتْ تَنْقَلِبُ وَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْلِبُهَا ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ مَعْمَرٍ غَيْرَ أَنَّهُ قَالَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّيْطَانَ يَبْلُغُ مِنْ الْإِنْسَانِ مَبْلَغَ الدَّمِ وَلَمْ يَقُلْ يَجْرِي",
                "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan ['Abad bin Humaid] lafazh keduanya tidak jauh berbeda; Telah mengabarkan kepada kami ['Abdur Razaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Ali bin Husain] dari [Shafiyyah binti Huyay] ia berkata; \"Pada suatu ketika Nabi shallallahu 'alaihi wasallam sedang I'tikaf. Aku mendatangi beliau malam hari, lalu aku berbicara kepadanya. Sesudah itu aku berdiri hendak pulang, dan beliau berdiri pula mengantarku ketika itu Shafiyah tinggal di rumah Usamah bin Zaid. Tiba-tiba lewat dua orang laki-laki Anshar. Tatkala mereka melihat Nabi shallallahu 'alaihi wasallam mereka kemudian mempercepat langkahnya. Lalu Nabi shallallahu 'alaihi wasallam berkata kepada mereka: 'Hai, pelan-pelan sajalah kalian. Ini adalah isteriku, Shafiyah binti Huyay.' Mereka menjawab; 'Subhanallah, ya Rasulullah! ' Beliau bersabda: 'Sesungguhnya setan berjalan dalam tubuh manusia melalui aliran darah. Aku khawatir kalau-kalau setan membisikkan sesuatu yang jahat ke dalam hati kalian.' Dan telah menceritakannya kepada kami ['Abdullah bin 'Abdur Rahman Ad Darimi]; Telah mengabarkan kepada kami [Abu Al Yaman]; Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri]; Telah mengabarkan kepada kami ['Ali bin Husain] bahwa [Shafiyyah] istri Nabi shallallahu 'alaihi wasallam mengabarkan kepadanya, bahwasannya dia pernah datang kepada Nabi shallallahu 'alaihi wasallam untuk menjenguknya ketika beliau sedang I'tikaf di Masjid pada kesepuluh terakhir dari bulan RamAdhan. Lalu dia berbincang-bincang dengan beliau sejenak, lalu dia berdiri hendak pulang dan Nabi pun ikut berdiri hendak mengantarkannya. (dan seterusnya) sebagaimana yang di ceritakan di dalam Hadits Ma'mar hanya saja di dalam Hadits tersebut Nabi shallallahu 'alaihi wasallam menggunakan lafazh 'yablagh' bukan 'yajri' (mengalir)."
            },
            {
                "number": 3737,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّ أَبَا مُرَّةَ مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا هُوَ جَالِسٌ فِي الْمَسْجِدِ وَالنَّاسُ مَعَهُ إِذْ أَقْبَلَ نَفَرٌ ثَلَاثَةٌ فَأَقْبَلَ اثْنَانِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَهَبَ وَاحِدٌ قَالَ فَوَقَفَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّا أَحَدُهُمَا فَرَأَى فُرْجَةً فِي الْحَلْقَةِ فَجَلَسَ فِيهَا وَأَمَّا الْآخَرُ فَجَلَسَ خَلْفَهُمْ وَأَمَّا الثَّالِثُ فَأَدْبَرَ ذَاهِبًا فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا أُخْبِرُكُمْ عَنْ النَّفَرِ الثَّلَاثَةِ أَمَّا أَحَدُهُمْ فَأَوَى إِلَى اللَّهِ فَآوَاهُ اللَّهُ وَأَمَّا الْآخَرُ فَاسْتَحْيَا فَاسْتَحْيَا اللَّهُ مِنْهُ وَأَمَّا الْآخَرُ فَأَعْرَضَ فَأَعْرَضَ اللَّهُ عَنْهُو حَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَرْبٌ وَهُوَ ابْنُ شَدَّادٍ ح و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا حَبَّانُ حَدَّثَنَا أَبَانُ قَالَا جَمِيعًا حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ إِسْحَقَ بْنَ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ حَدَّثَهُ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ فِي الْمَعْنَى",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] sebagaimana yang telah di bacakan kepadanya dari [Ishaq bin 'Abdullah bin Abu Thalhah] bahwa [Abu Murrah] -budak dari- 'Aqil bin Abu Thalib; Telah mengabarkan kepadanya dari [Abu Waqid Al Laitsi] \"Bahwa pada saat Rasulullah shallallahu 'alaihi wasallam sedang duduk di masjid beserta para sahabatnya, tiba-tiba datang tiga orang. Yang dua orang mendatangi Rasulullah shallallahu 'alaihi wasallam, sedang yang seorang lagi terus pergi begitu saja. Salah seorang di antara yang berdua tadi kemudian mencari-cari tempat kosong dalam halaqah tersebut, lalu dia duduk di situ. Sedangkan seorang lagi mencari-cari tempat dan duduk di bagian belakang. Adapun orang yang ketiga dia pergi begitu saja. Setelah Rasulullah shallallahu 'alaihi wasallam selesai memberikan pengajian beliau bersabda: 'Perhatikanlah, maukah kuberitahukan kepada kalian tentang orang yang bertiga itu? Satu di antaranya mencari tempat di sisi Allah, maka Allah melapangkan tempat baginya. Orang yang kedua malu-malu, maka Allah pun malu pula kepadanya. Dan orang yang ketiga jelas dia berpaling, maka Allah berpaling pula daripadanya.' Dan telah menceritakan kepada kami [Ahmad bin Al Mundzir]; Telah menceritakan kepada kami ['Abdush Shamad]; Telah menceritakan kepada kami [Harb] yaitu Ibnu Syadad; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku [Ishaq bin Manshur]; Telah mengabarkan kepada kami [Habban]; Telah menceritakan kepada kami [Aban] keduanya berkata; Telah menceritakan kepada kami [Yahya bin Abu Katsir] bahwa [Ishaq bin 'Abdullah bin Abu Thalhah]; Telah menceritakan kepadanya melalui sanad ini dengan Hadits yang semakna."
            },
            {
                "number": 3738,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُقِيمَنَّ أَحَدُكُمْ الرَّجُلَ مِنْ مَجْلِسِهِ ثُمَّ يَجْلِسُ فِيهِ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Laits]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku [Muhammad bin Rumh bin Al Muhajir]; Telah mengabarkan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kamu menyuruh orang lain berdiri dari tempat duduknya, kemudian kamu duduk di tempatnya.\""
            },
            {
                "number": 3739,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَاللَّفْظُ لَهُ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ وَأَبُو أُسَامَةَ وَابْنُ نُمَيْرٍ قَالُوا حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُقِيمُ الرَّجُلُ الرَّجُلَ مِنْ مَقْعَدِهِ ثُمَّ يَجْلِسُ فِيهِ وَلَكِنْ تَفَسَّحُوا وَتَوَسَّعُواو حَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ ح و حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا رَوْحٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ كِلَاهُمَا عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ كُلُّهُمْ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ اللَّيْثِ وَلَمْ يَذْكُرُوا فِي الْحَدِيثِ وَلَكِنْ تَفَسَّحُوا وَتَوَسَّعُوا وَزَادَ فِي حَدِيثِ ابْنِ جُرَيْجٍ قُلْتُ فِي يَوْمِ الْجُمُعَةِ قَالَ فِي يَوْمِ الْجُمُعَةِ وَغَيْرِهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami ['Abdullah bin Numair]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Bapakku]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Yahya] yaitu Al Qaththan; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Ibnu Al Mutsanna]; Telah menceritakan kepada kami ['Abdul Wahhab] yaitu Ats Tsaqafi seluruhnya dari ['Ubaidillah]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan lafazh ini miliknya; Telah menceritakan kepada kami [Muhammad bin Bisyr] dan [Abu Usamah] serta [Ibnu Numair] mereka berkata; Telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kamu menyuruh saudaramu berdiri dari tempat duduknya lalu kamu duduk di tempatnya, tetapi katakanlah kepadanya; 'Marilah kita lapangkan tempat duduk kita! ' Dan telah menceritakan kepada kami [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; Telah menceritakan kepada kami [Hammad]; Telah menceritakan kepada kami [Ayyub]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku [Yahya bin Habib]; Telah menceritakan kepadaku [Rauh]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razaq] keduanya dari [Ibnu Juraij]; Demikian juga telah diriwayatkan dari jalur yang lain; Dan telah menceritakan kepadaku [Muhammad bin Rafi']; Telah menceritakan kepada kami [Ibnu Abu Fudhaik]; Telah mengabarkan kepadaku [Adh Dhahak] yaitu Ibnu 'Utsman seluruhnya dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam sebagimana Hadits Laits. Akan tetapi dia tidak menyebutkan; 'Marilah berlapang-lapang.' Dan di dalam Hadits Juraij ada tambahan; 'Aku berkata; Apakah hal itu di lakukan pada hari Jum'at? Beliau menjawab: 'Pada hari Jum'at maupun bukan.'"
            },
            {
                "number": 3740,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُقِيمَنَّ أَحَدُكُمْ أَخَاهُ ثُمَّ يَجْلِسُ فِي مَجْلِسِهِ وَكَانَ ابْنُ عُمَرَ إِذَا قَامَ لَهُ رَجُلٌ عَنْ مَجْلِسِهِ لَمْ يَجْلِسْ فِيهِو حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami ['Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu 'Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang di antara kalian membangunkan temannya dari tempat duduknya kemudian dia duduki tempatnya itu.\" 'Karena itu apabila seseorang berdiri untuk memberikan tempat duduknya kepada Ibnu 'Umar, dia tidak mau menempatinya.' Dan telah menceritakannya kepada kami [Abad bin Humaid] Telah mengabarkan kepada kami [Abdur razak] Telah mengabarkan kepada kami [Ma'mar] melalui sanad ini dengan Hadits yang serupa."
            },
            {
                "number": 3741,
                "arab": "و حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللَّهِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍعَنْ النَّبِيِّ قَالَ لَا يُقِيمَنَّ أَحَدُكُمْ أَخَاهُ يَوْمَ الْجُمُعَةِ ثُمَّ لْيُخَالِفْ إِلَى مَقْعَدِهِ فَيَقْعُدَ فِيهِ وَلَكِنْ يَقُولُ افْسَحُوا",
                "id": "Dan telah menceritakan kepada kami [Salamah bin Syabib]; Telah menceritakan kepada kami [Al Hasan bin A'yan]; Telah menceritakan kepada kami [Ma'qil] yaitu 'Ubaidillah dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kamu menyuruh saudaramu berdiri pada hari Jum'at dari tempat duduknya untuk kamu gantikan tempatnya itu, tetapi katakanlah kepadanya; 'Marilah kita berlapang-lapang!\""
            },
            {
                "number": 3742,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ أَخْبَرَنَا أَبُو عَوَانَةَ وَقَالَ قُتَيْبَةُ أَيْضًا حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ كِلَاهُمَا عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَامَ أَحَدُكُمْ وَفِي حَدِيثِ أَبِي عَوَانَةَ مَنْ قَامَ مِنْ مَجْلِسِهِ ثُمَّ رَجَعَ إِلَيْهِ فَهُوَ أَحَقُّ بِهِ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah mengabarkan kepada kami [Abu 'Awanah] dan berkata [Qutaibah] juga; Telah menceritakan kepada kami ['Abdul 'Aziz] yaitu Ibnu Muhammad keduanya dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang kamu berdiri dari tempat duduknya, kemudian dia kembali lagi ke tempatnya itu, maka dia lebih berhak dengan tempatnya.\" Sedangkan di dalam Hadist Abu 'Awanah menggunakan lafazh 'Man' (barangsiapa) bukan 'Salah seorang diantara kamu.'"
            },
            {
                "number": 3743,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ كُلُّهُمْ عَنْ هِشَامٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ أَيْضًا وَاللَّفْظُ هَذَا حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَأَنَّ مُخَنَّثًا كَانَ عِنْدَهَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْبَيْتِ فَقَالَ لِأَخِي أُمِّ سَلَمَةَ يَا عَبْدَ اللَّهِ بْنَ أَبِي أُمَيَّةَ إِنْ فَتَحَ اللَّهُ عَلَيْكُمْ الطَّائِفَ غَدًا فَإِنِّي أَدُلُّكَ عَلَى بِنْتِ غَيْلَانَ فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ قَالَ فَسَمِعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا يَدْخُلْ هَؤُلَاءِ عَلَيْكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Waki']; Demikian juga telah diriwayatkan dari jalur yang lainnya; Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami [Jarir]; Demikian juga telah diriwayatkan dari jalur yang lainnya; Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Mu'awiyah] seluruhnya dari [Hisyam]; Demikian juga telah diriwayatkan dari jalur yang lainnya; Dan telah menceritakan kepada kami [Abu Kuraib] juga dengan lafazh ini; Telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Hisyam] dari [Bapaknya] dari [Zainab binti Ummu Salamah] dari [Ummu Salamah] bahwa seorang banci datang ketika Rasulullah shallallahu 'alaihi wasallam sedang berada di rumahnya (Ummu Salamah). Maka si Banci berkata kepada saudara laki-laki Ummu Salamah; \"Hai, 'Abdullah bin Abu Umaiyah! Jika Allah memenangkan bagi kalian kota thaif besok, maka aku akan menunjukkan bagimu anak perempuan Ghailan. Kalau dia menghadap, dia menghadap dengan empat anggota tubuhnya, dan kalau dia membelakang, dia membelakang dengan delapan anggota tubuhnya.\" Rasulullah shallallahu 'alaihi wasallam mendengar ucapan Banci itu, lalu beliau bersabda: 'Jangan izinkan lagi dia masuk ke rumahmu! '"
            },
            {
                "number": 3744,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكَانَ يَدْخُلُ عَلَى أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُخَنَّثٌ فَكَانُوا يَعُدُّونَهُ مِنْ غَيْرِ أُولِي الْإِرْبَةِ قَالَ فَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا وَهُوَ عِنْدَ بَعْضِ نِسَائِهِ وَهُوَ يَنْعَتُ امْرَأَةً قَالَ إِذَا أَقْبَلَتْ أَقْبَلَتْ بِأَرْبَعٍ وَإِذَا أَدْبَرَتْ أَدْبَرَتْ بِثَمَانٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أَرَى هَذَا يَعْرِفُ مَا هَاهُنَا لَا يَدْخُلَنَّ عَلَيْكُنَّ قَالَتْ فَحَجَبُوهُ",
                "id": "Dan telah menceritakan kepada kami ['Abad bin Humaid]; Telah mengabarkan kepada kami ['Abdur Razaq] dari [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] ia berkata; \"Seorang banci masuk ke tempat para isteri Nabi shallallahu 'alaihi wasallam. Lalu mereka menganggapnya seperti orang yang tidak mempunyai birahi terhadap perempuan. kemudian Nabi shallallahu 'alaihi wasallam datang, dan si Banci itu sedang berada di antara mereka. Dia menggambarkan perempuan yang katanya: 'Wanita bila menghadap, dia menghadap dengan empat anggota tubuhnya, dan bila membelakang, dia membelakang dengan delapan anggota tubuhnya.' Maka Nabi shallallahu 'alaihi wasallam bersabda: 'Perhatikanlah, bukankah dia mengerti apa yang ada di sini? Karena itu janganlah kalian izinkan masuk ke rumah kalian.' Kata 'Aisyah; 'Sejak itu rumah kami tertutup bagi si banci.'"
            },
            {
                "number": 3745,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَبُو كُرَيْبٍ الْهَمْدَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ أَخْبَرَنِي أَبِي عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْتَزَوَّجَنِي الزُّبَيْرُ وَمَا لَهُ فِي الْأَرْضِ مِنْ مَالٍ وَلَا مَمْلُوكٍ وَلَا شَيْءٍ غَيْرَ فَرَسِهِ قَالَتْ فَكُنْتُ أَعْلِفُ فَرَسَهُ وَأَكْفِيهِ مَئُونَتَهُ وَأَسُوسُهُ وَأَدُقُّ النَّوَى لِنَاضِحِهِ وَأَعْلِفُهُ وَأَسْتَقِي الْمَاءَ وَأَخْرُزُ غَرْبَهُ وَأَعْجِنُ وَلَمْ أَكُنْ أُحْسِنُ أَخْبِزُ وَكَانَ يَخْبِزُ لِي جَارَاتٌ مِنْ الْأَنْصَارِ وَكُنَّ نِسْوَةَ صِدْقٍ قَالَتْ وَكُنْتُ أَنْقُلُ النَّوَى مِنْ أَرْضِ الزُّبَيْرِ الَّتِي أَقْطَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَأْسِي وَهِيَ عَلَى ثُلُثَيْ فَرْسَخٍ قَالَتْ فَجِئْتُ يَوْمًا وَالنَّوَى عَلَى رَأْسِي فَلَقِيتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ نَفَرٌ مِنْ أَصْحَابِهِ فَدَعَانِي ثُمَّ قَالَ إِخْ إِخْ لِيَحْمِلَنِي خَلْفَهُ قَالَتْ فَاسْتَحْيَيْتُ وَعَرَفْتُ غَيْرَتَكَ فَقَالَ وَاللَّهِ لَحَمْلُكِ النَّوَى عَلَى رَأْسِكِ أَشَدُّ مِنْ رُكُوبِكِ مَعَهُ قَالَتْ حَتَّى أَرْسَلَ إِلَيَّ أَبُو بَكْرٍ بَعْدَ ذَلِكَ بِخَادِمٍ فَكَفَتْنِي سِيَاسَةَ الْفَرَسِ فَكَأَنَّمَا أَعْتَقَتْنِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala Abu Kuraib Al Mahdani]; Telah menceritakan kepada kami [Abu Usamah] dari [Hisyam]; Telah mengabarkan kepadaku [Bapakku] dari [Asma' binti Abu Bakr] ia berkata; \"Aku menikah dengan Zubair, sedangkan dia tidak mempunyai apa-apa. Tidak punya pelayan, harta dan sebagainya, selain hanya seekor kuda. Karena itu akulah yang memberi makan kuda, merawat dan melatihnya. Aku pula yang menumbuk biji kurma untuk makan, menyediakan makan dan minumnya, dan aku pula yang menjahit dan memasak. Tetapi aku tidak pandai membuat roti. Karena itu roti kami dibuatkan oleh tetangga kami orang-orang Anshar. Mereka adalah wanita-wanita yang baik. Kata Asma' selanjutnya; 'Aku juga menjunjung buah kurma di kepalaku dari kebun yang dijatahkan Rasulullah shallallahu 'alaihi wasallam kepada Zubair, membawanya sejauh dua farsakh. Pada suatu hari aku membawa buah kurma yang kujunjung di kepalaku. Di tengah jalan aku bertemu dengan Rasulullah shallallahu 'alaihi wasallam beserta beberapa orang sahabatnya: 'Ikh! Ikh! ' Kata beliau menghentikan dan menyuruh untanya berlutut, untuk memboncengku di belakangnya. Setelah itu Asma berkata (ketika bercerita kepada suaminya); 'Tetapi aku malu dan aku tahu bahwa engkau pencemburu.' Jawab Zubair; 'Demi Allah, sesungguhnya bebanmu menjunjung buah kurma di kepalamu, bagiku terasa lebih berat daripada engkau membonceng dengan beliau.' Kata Asma' selanjutnya; Akhirnya, sesudah kejadian itu Abu Bakar, ayahku, mengirim seorang pelayan untuk kami. Dia mengambil alih pemeliharaan kuda menggantikanku. Rasanya seolah-olah aku terbebas dari beban dan kerja berat.'"
            },
            {
                "number": 3746,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ أَنَّ أَسْمَاءَ قَالَتْكُنْتُ أَخْدُمُ الزُّبَيْرَ خِدْمَةَ الْبَيْتِ وَكَانَ لَهُ فَرَسٌ وَكُنْتُ أَسُوسُهُ فَلَمْ يَكُنْ مِنْ الْخِدْمَةِ شَيْءٌ أَشَدَّ عَلَيَّ مِنْ سِيَاسَةِ الْفَرَسِ كُنْتُ أَحْتَشُّ لَهُ وَأَقُومُ عَلَيْهِ وَأَسُوسُهُ قَالَ ثُمَّ إِنَّهَا أَصَابَتْ خَادِمًا جَاءَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْيٌ فَأَعْطَاهَا خَادِمًا قَالَتْ كَفَتْنِي سِيَاسَةَ الْفَرَسِ فَأَلْقَتْ عَنِّي مَئُونَتَهُ فَجَاءَنِي رَجُلٌ فَقَالَ يَا أُمَّ عَبْدِ اللَّهِ إِنِّي رَجُلٌ فَقِيرٌ أَرَدْتُ أَنْ أَبِيعَ فِي ظِلِّ دَارِكِ قَالَتْ إِنِّي إِنْ رَخَّصْتُ لَكَ أَبَى ذَاكَ الزُّبَيْرُ فَتَعَالَ فَاطْلُبْ إِلَيَّ وَالزُّبَيْرُ شَاهِدٌ فَجَاءَ فَقَالَ يَا أُمَّ عَبْدِ اللَّهِ إِنِّي رَجُلٌ فَقِيرٌ أَرَدْتُ أَنْ أَبِيعَ فِي ظِلِّ دَارِكِ فَقَالَتْ مَا لَكَ بِالْمَدِينَةِ إِلَّا دَارِي فَقَالَ لَهَا الزُّبَيْرُ مَا لَكِ أَنْ تَمْنَعِي رَجُلًا فَقِيرًا يَبِيعُ فَكَانَ يَبِيعُ إِلَى أَنْ كَسَبَ فَبِعْتُهُ الْجَارِيَةَ فَدَخَلَ عَلَيَّ الزُّبَيْرُ وَثَمَنُهَا فِي حَجْرِي فَقَالَ هَبِيهَا لِي قَالَتْ إِنِّي قَدْ تَصَدَّقْتُ بِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid Al Ghurbari]; Telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Ibnu Abu Mulaikah] bahwa [Asma'] berkata; Aku membantu suamiku Zubair dalam urusan pekerjaan di rumah. Dia memiliki sesekor kuda, dan akulah yang merawatnya. Tidak ada yang lebih berat bagiku untuk membantunya selain merawat seekor kuda. Akulah yang mencarikan rumputnya dan membersihkannya. (perawi) berkata; kemudian pada suatu ketika dia mendapatkan seorang pembantu -dia adalah tawanan yang datang kepada Nabi shallallahu 'alaihi wasallam.- lalu nabi memberikannya kepada Asma' sebagai pembantu. Asma' berkata; dia telah membantuku merawat seekor kuda hingga akhirnya telah meringankanku. Pada suatu ketika seorang laki-laki datang kepadaku seraya berkata; wahai Ummu Abdullah! Aku ini seorang yang fakir, bolehkah aku berjualan di bawah naungan atap rumahmu? Asma' menjawab; jika suamiku, Zubair mengizinkanmu Maka datanglah kembali, ketika Zubair sudah ada di rumah. pada saat yang lain orang itu datang kembali seraya berkata; 'Wahai Ummu Abdullah, aku ini seorang yang fakir, aku ingin berjualan di bawah naungan rumahmu maka izinkanlah! Asma' menjawab; 'Ada apa denganmu, apakah di Madinah ini tidak ada rumah lagi selain rumahku? Mendengar hal itu Zubair berkata kepada Asma'; kenapa kamu melarang seorang yang fakir berjualan? Akhirnya orang tersebut berjualan hingga mendapatkan hasilnya. Akupun bisa menjual kepadanya seorang budak. Hingga pada suatu ketika Zubair berkata kepadaku menanyakan uang hasil penjualannya yang pernah aku simpan. Zubair berkata; berikanlah uang itu padaku. Lalu Asma' menjawab; 'Aku telah menginfakkan uang tersebut.'"
            },
            {
                "number": 3747,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ ثَلَاثَةٌ فَلَا يَتَنَاجَى اثْنَانِ دُونَ وَاحِدٍو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ وَابْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا قُتَيْبَةُ وَابْنُ رُمْحٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ ح و حَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَيُّوبَ بْنَ مُوسَى كُلُّ هَؤُلَاءِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ مَالِكٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; aku membaca Hadist [Malik] dari [Nafi'] dari [Ibnu 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu bertiga, maka janganlah yang dua orang berbisik tanpa yang ketiga. Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Muhammad bin Bisyr] dan [Ibnu Numair]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Bapakku]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan ['ubaidhullah bin Sa'id] keduanya berkata; Telah menceritakan kepada kami [Yahya] yaitu Ibnu Sa'id seluruhnya dari ['ubaidhullah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Qutaibah] dan [Ibnu Rumh] dari [Al Laits bin Sa'd]; Dan telah menceritakan kepada kami [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; Telah menceritakan kepada kami [Hammad] dari [Ayyub]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Al Mutsanna]; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dia berkata; Aku medengar [Ayyub bin Musa]. Mereka semua dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam yang semakna dengan Hadits Malik."
            },
            {
                "number": 3748,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ مَنْصُورٍ ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِزُهَيْرٍ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ الْآخَرَانِ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنْتُمْ ثَلَاثَةً فَلَا يَتَنَاجَى اثْنَانِ دُونَ الْآخَرِ حَتَّى تَخْتَلِطُوا بِالنَّاسِ مِنْ أَجْلِ أَنْ يُحْزِنَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Hannad bin As Sari'] mereka berkata; Telah menceritakan kepada kami [Abu Al Ahwash] dari [Manshur]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Zuhair bin Harb] dan ['Utsman bin Abu Syaibah] serta [Ishaq bin Ibrahim] dan lafazh ini miliknya Zuhair. Berkata [Ishaq]; Telah mengabarkan kepada kami sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wail] dari [Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu bertiga, maka janganlah yang dua orang berbisik tanpa yang ketiga, sebelum dia berbaur dengan yang lainnya. Karena hal itu dapat menyinggung perasaan.\""
            },
            {
                "number": 3749,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الْآخَرُونَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنْتُمْ ثَلَاثَةً فَلَا يَتَنَاجَى اثْنَانِ دُونَ صَاحِبِهِمَا فَإِنَّ ذَلِكَ يُحْزِنُهُو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya], [Abu Bakr bin Abu Syaibah], [Ibnu Numair], [Abu Kuraib] dan lafazh ini miliknya Yahya. Berkata [Yahya]; Telah mengabarkan kepada kami. Dan yang lainnya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] dari ['Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu bertiga, maka janganlah yang dua orang berbisik tanpa yang ketiga, Karena hal itu dapat menyinggung perasaannya.\" Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Isa bin Yunus]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Abu 'Umar]; Telah menceritakan kepada kami [Sufyan] keduanya dari [Al A'masy] melalui jalur ini."
            },
            {
                "number": 3750,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ عَنْ يَزِيدَ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا قَالَتْ كَانَ إِذَا اشْتَكَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَقَاهُ جِبْرِيلُ قَالَ بِاسْمِ اللَّهِ يُبْرِيكَ وَمِنْ كُلِّ دَاءٍ يَشْفِيكَ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ وَشَرِّ كُلِّ ذِي عَيْنٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu 'Umar Al Makki]; Telah menceritakan kepada kami ['Abdul 'Aziz Ad Darawardi] dari [Yazid] yaitu Ibnu 'Abdillah bin Usamah bin Al Hadi dari [Muhammad bin Ibrahim] dari [Abu Salamah bin 'Abdur Rahman] dari ['Aisyah] istri Nabi shallallahu 'alaihi wasallam dia berkata; \"Bila Rasulullah shallallahu 'alaihi wasallam sakit, Jibril datang meruqyahnya. Jibril mengucapkan; 'Bismillaahi yubriika, wa min kulli daa-in yusyfika, wa min syarri hasidin idza hasad, wa syarri kulli dzi 'ainin.' (Dengan nama Allah yang menciptakanmu. Dia-lah Allah yang menyembuhkanmu dari segala macam penyakit dan dari kejahatan pendengki ketika ia mendengki serta segala macam kejahatan sorotan mata jahat semua makhluk yang memandang dengan kedengkian)."
            },
            {
                "number": 3751,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍأَنَّ جِبْرِيلَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مُحَمَّدُ اشْتَكَيْتَ فَقَالَ نَعَمْ قَالَ بِاسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ اللَّهُ يَشْفِيكَ بِاسْمِ اللَّهِ أَرْقِيكَ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Hilal Ash Shawaf]; Telah menceritakan kepada kami ['Abdul Warits]; Telah menceritakan kepada kami ['Abdul 'Aziz bin Shuhaib] dari [Abu Nadhrah] dari [Abu Sa'id] bahwa Jibril mendatangi Nabi shallallahu 'alaihi wasallam kemudian berkata; \"Hai Muhammad, apakah kamu sakit? Rasulullah shallallahu 'alaihi wasallam menjawab: 'Ya. Aku sakit. Lalu Jibril meruqyah beliau dengan mengucapkan; 'Dengan nama Allah aku meruqyahmu dari segala sesuatu yang menyakitimu dan dari kejahatan segala makhluk atau kejahatan mata yang dengki. Allah lah yang menyembuhkanmu. Dengan nama Allah aku meruqyahmu.'"
            },
            {
                "number": 3752,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَاوَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَيْنُ حَقٌّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razaq]; Telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabih] dia berkata; \"Inilah yang telah diceritakan [Abu Hurairah] kepada kami dari Rasulullah shallallahu 'alaihi wasallam. Lalu dia menyebutkan beberapa Hadits di antaranya; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penyakit yang timbul dari pengaruh jahat pandangan mata memang ada.\""
            },
            {
                "number": 3753,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ وَحَجَّاجُ بْنُ الشَّاعِرِ وَأَحْمَدُ بْنُ خِرَاشٍ قَالَ عَبْدُ اللَّهِ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَيْنُ حَقٌّ وَلَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرَ سَبَقَتْهُ الْعَيْنُ وَإِذَا اسْتُغْسِلْتُمْ فَاغْسِلُوا",
                "id": "Dan telah menceritakan kepada kami ['Abdullah bin 'Abdur Rahman Ad Darimi] dan [Hajjaj bin Asy Sya'ir] serta [Ahmad bin Khirasy]. Berkata ['Abdullah]; Telah mengabarkan kepada kami. Dan yang lainnya berkata; Telah menceritakan kepada kami [Muslim bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Wuhaib] dari [Ibnu Thawus] dari [Bapaknya] dari [Ibnu 'Abbas] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Penyakit yang timbul dari pengaruh jahat pandangan mata memang ada. Seandainya ada yang dapat mendahului qadar, tentulah itu pengaruh pandangan mata. Karena itu apabila kamu disuruh mandi, maka mandilah!\""
            },
            {
                "number": 3754,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْسَحَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَهُودِيٌّ مِنْ يَهُودِ بَنِي زُرَيْقٍ يُقَالُ لَهُ لَبِيدُ بْنُ الْأَعْصَمِ قَالَتْ حَتَّى كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَيَّلُ إِلَيْهِ أَنَّهُ يَفْعَلُ الشَّيْءَ وَمَا يَفْعَلُهُ حَتَّى إِذَا كَانَ ذَاتَ يَوْمٍ أَوْ ذَاتَ لَيْلَةٍ دَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ دَعَا ثُمَّ دَعَا ثُمَّ قَالَ يَا عَائِشَةُ أَشَعَرْتِ أَنَّ اللَّهَ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ جَاءَنِي رَجُلَانِ فَقَعَدَ أَحَدُهُمَا عِنْدَ رَأْسِي وَالْآخَرُ عِنْدَ رِجْلَيَّ فَقَالَ الَّذِي عِنْدَ رَأْسِي لِلَّذِي عِنْدَ رِجْلَيَّ أَوْ الَّذِي عِنْدَ رِجْلَيَّ لِلَّذِي عِنْدَ رَأْسِي مَا وَجَعُ الرَّجُلِ قَالَ مَطْبُوبٌ قَالَ مَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الْأَعْصَمِ قَالَ فِي أَيِّ شَيْءٍ قَالَ فِي مُشْطٍ وَمُشَاطَةٍ قَالَ وَجُفِّ طَلْعَةِ ذَكَرٍ قَالَ فَأَيْنَ هُوَ قَالَ فِي بِئْرِ ذِي أَرْوَانَ قَالَتْ فَأَتَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُنَاسٍ مِنْ أَصْحَابِهِ ثُمَّ قَالَ يَا عَائِشَةُ وَاللَّهِ لَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ وَلَكَأَنَّ نَخْلَهَا رُءُوسُ الشَّيَاطِينِ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَلَا أَحْرَقْتَهُ قَالَ لَا أَمَّا أَنَا فَقَدْ عَافَانِي اللَّهُ وَكَرِهْتُ أَنْ أُثِيرَ عَلَى النَّاسِ شَرًّا فَأَمَرْتُ بِهَا فَدُفِنَتْحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ سُحِرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَاقَ أَبُو كُرَيْبٍ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ ابْنِ نُمَيْرٍ وَقَالَ فِيهِ فَذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْبِئْرِ فَنَظَرَ إِلَيْهَا وَعَلَيْهَا نَخْلٌ وَقَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ فَأَخْرِجْهُ وَلَمْ يَقُلْ أَفَلَا أَحْرَقْتَهُ وَلَمْ يَذْكُرْ فَأَمَرْتُ بِهَا فَدُفِنَتْ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Ibnu Numair] dari [Hisyam] dari [Bapaknya] dari ['Aisyah] ia berkata; \"Seorang Yahudi dari Bani Zuraiq, bernama Labid bin A'sham, menyihir Rasulullah shallallahu 'alaihi wasallam sehingga beliau mengigau karenanya. Beliau rasanya melakukan sesuatu yang sesungguhnya tidak dilakukannya. Karena itu pada suatu hari atau suatu malam beliau berdo'a, kemudian berdo'a dan berdo'a. Sesudah itu beliau bertanya kepada 'Aisyah: 'Ya, 'Aisyah! Ingatkah engkau bahwa Allah Subhanahu Wa Ta'ala pernah memberitakan kepadaku tentang kedatangan dua orang laki-laki, yang satu duduk dekat kepalaku dan yang satu lagi dekat kedua kakiku. Lalu orang yang dekat kepalaku bertanya kepada orang yang dekat kakiku, atau sebaliknya; 'Apakah sakit orang ini? ' Jawabnya; 'Kena sihir! ' dia bertanya; 'Siapa yang menyihirnya? ' yang satunya menjawab; 'Labid bin A'sham! ' dia bertanya lagi; 'Dengan apa disihirnya? ' dia menjawab; 'Pakai sisir serta mayang kurma kering.' Dia bertanya lagi; Di mana sekarang? ' dia jawab; 'Di sumur Dzi Arwan.' Kata 'Aisyah; 'Rasulullah shallallahu 'alaihi wasallam pergi mencari barang-barang itu ditemani beberapa orang sahabat. Kemudian beliau bersabda: 'Ya, 'Aisyah. Kulihat air sumur itu kemerah-merahan warnanya, sedang pohan kurmanya kelihatan bagaikan kepala setan.' Lalu aku bertanya; 'Apakah Anda tidak membakarnya? ' Jawab Nabi shallallahu 'alaihi wasallam: 'Tidak! Karena Allah Subhanahu Wa Ta'ala telah menyembuhkanku, dan aku tidak ingin membalas kejahatan dengan kejahatan, oleh sebab itu kusuruh kuburkan saja! ' Telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Usamah]; Telah menceritakan kepada kami [Hisyam] dari [Bapaknya] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam di sihir…(lalu Abu Kuraib menyebutkan seluruh kisah Hadits seperti Hadits Ibnu Numair dan di dalamnya dia menyebutkan; 'lalu Rasulullah shallallahu 'alaihi wasallam pergi ke sumur dan melihat ke dalamnya yang di atasnya ada lebah. Aisyah berkata; 'Ya Rasulullah shallallahu 'alaihi wasallam keluarkanlah. (Aisyah tidak menyebutkan, kenapa tidak anda bakar saja). Di dalam Hadits tersebut beliau juga tidak menyebutkan kalimat; 'Aku suruh kuburkan saja.'"
            },
            {
                "number": 3755,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسٍأَنَّ امْرَأَةً يَهُودِيَّةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ مَسْمُومَةٍ فَأَكَلَ مِنْهَا فَجِيءَ بِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهَا عَنْ ذَلِكَ فَقَالَتْ أَرَدْتُ لِأَقْتُلَكَ قَالَ مَا كَانَ اللَّهُ لِيُسَلِّطَكِ عَلَى ذَاكِ قَالَ أَوْ قَالَ عَلَيَّ قَالَ قَالُوا أَلَا نَقْتُلُهَا قَالَ لَا قَالَ فَمَا زِلْتُ أَعْرِفُهَا فِي لَهَوَاتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَو حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا شُعْبَةُ سَمِعْتُ هِشَامَ بْنَ زَيْدٍ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يُحَدِّثُ أَنَّ يَهُودِيَّةً جَعَلَتْ سَمًّا فِي لَحْمٍ ثُمَّ أَتَتْ بِهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِ خَالِدٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Habib Al Haritsi]; Telah menceritakan kepada kami [Khalid bin Al Harits]; Telah menceritakan kepada kami [Syu'bah] dari [Hisyam bin Zaid] dari [Anas] bahwa seorang perempuan Yahudi mengantarkan daging yang telah dibubuhi racun kepada Nabi shallallahu 'alaihi wasallam, lalu beliau makan sebagian. Kemudian perempuan itu dipanggil ke hadapan Rasulullah shallallahu 'alaihi wasallam, lalu beliau menanya kepadanya tentang racun itu. Jawabnya; 'Aku sengaja hendak membunuh Anda.' Sabda Nabi shallallahu 'alaihi wasallam: 'Tidak mungkin Allah Subhanahu Wa Ta'ala akan memberi wewenang kepadamu untuk berbuat demikian.' Para sahabat bertanya; 'Bolehkah kami membunuh perempuan itu? ' Jawab beliau: 'Jangan! ' Kata Anas selanjutnya; 'Kami melihat jelas bekas racun itu kelihatan di leher Rasulullah shallallahu 'alaihi wasallam.' Dan telah menceritakan kepada kami [Harun bin 'Abdullah]; Telah menceritakan kepada kami [Rauh bin 'Ubadah]; Telah menceritakan kepada kami [Syu'bah] Aku mendengar; [Hisyam bin Zaid] Aku mendengar; [Anas bin Malik] berkata; bahwa seorang perempuan Yahudi menaruh racun dalam sepotong daging lalu dia membawanya kehadapan Rasulullah shallallahu 'alaihi wasallam sebagaimana Hadits Khalid."
            },
            {
                "number": 3756,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ زُهَيْرٌ وَاللَّفْظُ لَهُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَكَى مِنَّا إِنْسَانٌ مَسَحَهُ بِيَمِينِهِ ثُمَّ قَالَ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا فَلَمَّا مَرِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَثَقُلَ أَخَذْتُ بِيَدِهِ لِأَصْنَعَ بِهِ نَحْوَ مَا كَانَ يَصْنَعُ فَانْتَزَعَ يَدَهُ مِنْ يَدِي ثُمَّ قَالَ اللَّهُمَّ اغْفِرْ لِي وَاجْعَلْنِي مَعَ الرَّفِيقِ الْأَعْلَى قَالَتْ فَذَهَبْتُ أَنْظُرُ فَإِذَا هُوَ قَدْ قَضَىحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كِلَاهُمَا عَنْ شُعْبَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ سُفْيَانَ كُلُّ هَؤُلَاءِ عَنْ الْأَعْمَشِ بِإِسْنَادِ جَرِيرٍ فِي حَدِيثِ هُشَيْمٍ وَشُعْبَةَ مَسَحَهُ بِيَدِهِ قَالَ وَفِي حَدِيثِ الثَّوْرِيِّ مَسَحَهُ بِيَمِينِهِ و قَالَ فِي عَقِبِ حَدِيثِ يَحْيَى عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ قَالَ فَحَدَّثْتُ بِهِ مَنْصُورًا فَحَدَّثَنِي عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Ishaq bin Ibrahim] Berkata [Ishaq]; Telah mengabarkan kepada kami dan berkata [Zuhair] dan lafazh ini miliknya; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Adh Dhuha] dari [Masruq] dari ['Aisyah] dia berkata; \"Apabila salah seorang di antara kami sakit, Rasulullah shallallahu 'alaihi wasallam mengusapnya dengan tangan kanan, lalu beliau mengucapkan: 'Adzhabil ba'sa rabban naas, wasyfi, Anta Syaafi walaa syifaa illa syifaauka, syifaa-an laa yughaadiru saqaman.' ('Wahai Rabb manusia, singkirkanlah penyakit ini dan sembuhkanlah ia Karena hanya Engkaulah yang bisa menyembuhkannya, tiada kesembuhan kecuali dari-Mu, kesembuhan yang tidak akan menyebabkan penyakit lagi). Maka tatkala beliau sakit dan sakitnya bertambah berat, kupegang tangan beliau aku hendak membacakan mantera seperti yang pernah beliau lakukan kepada kami. Tetapi beliau menarik tangannya dari tanganku, kemudian beliau mengucapkan.: 'Allahummaghfirli, waj'alni ma'arrafiqil a'la (Ya Allah, ampunilah aku, dan jadikanlah aku bersama kekasihku yang tertinggi).' Lalu kutengok beliau, ternyata beliau telah meninggal.' Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Husyaim]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] mereka berkata; Telah menceritakan kepada kami [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Bisyr bin Khalid]; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Bisyr]; Telah menceritakan kepada kami [Ibnu Abu 'Adi] keduanya dari [Syu'bah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Bakr bin Khalid] mereka berkata; Telah menceritakan kepada kami [Yahya] yaitu Al Qaththan dari [Sufyan] mereka semua dari [Al A'masy] melalui jalur Jarir di dalam Hadits Husyaim dan Syu'bah dengan lafazh; 'beliau mengusap dengan tangannya.' Sedangkan di dalam Hadits Ats Tsauri dengan lafazh; 'beliau mengusap dengan tangan kanannya. Dan di akhir Hadits Yahya dari Sufyan dari Al A'masy dia berkata; lalu Aku menanyakannya kepada [Manshur] lalu dia menceritakan kepadaku dari [Ibrahim] dari Masruq dari Aisyah dengan Hadits yang serupa."
            },
            {
                "number": 3757,
                "arab": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا عَادَ مَرِيضًا يَقُولُ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ اشْفِهِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا",
                "id": "Dan telah menceritakan kepada kami [Syaiban bin Farrukh]; Telah menceritakan kepada kami [Abu 'Awanah] dari [Manshur] dari [Ibrahim] dari [Masruq] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam apabila menjenguk salah seorang di antara kami yang sakit, beliau mengucapkan: 'Wahai Rabb manusia, singkirkanlah penyakit ini dan sembuhkanlah ia Karena hanya Engkaulah yang bisa menyembuhkannya, tiada kesembuhan kecuali dari-Mu, kesembuhan yang tidak akan menyebabkan penyakit lagi.'"
            },
            {
                "number": 3758,
                "arab": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَى الْمَرِيضَ يَدْعُو لَهُ قَالَ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًاوَفِي رِوَايَةِ أَبِي بَكْرٍ فَدَعَا لَهُ وَقَالَ وَأَنْتَ الشَّافِي و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ وَمُسْلِمُ بْنُ صُبَيْحٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي عَوَانَةَ وَجَرِيرٍ",
                "id": "Dan telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] keduanya berkata; Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Adh Dhuha] dari [Masruq] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam apabila menjenguk orang sakit beliau mengucapkan kepadanya: \"Wahai Rabb manusia, singkirkanlah penyakit ini dan sembuhkanlah ia Karena hanya Engkaulah yang bisa menyembuhkannya, tiada kesembuhan kecuali dari-Mu, kesembuhan yang tidak akan menyebabkan penyakit lagi.\" Dan di dalam riwayat Abu Bakr di sebutkan; 'Lalu beliau mendo'akannya seraya berucap: 'Dan Engkalah yang bisa menyembuhkan.' Dan telah menceritakan kepadaku [Al Qasim bin Zakaria]; Telah menceritakan kepada kami ['ubaidhullah bin Musa] dari [Israil] dari [Manshur] dari [Ibrahim] dan [Muslim bin Shubaih] dari [Masruq] dari ['Aisyah] dia berkata; 'Rasulullah shallallahu 'alaihi wasallam apabila… (dan seterusnya) seperti Hadits Abu 'Awanah dan Jarir."
            },
            {
                "number": 3759,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَرْقِي بِهَذِهِ الرُّقْيَةِ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ بِيَدِكَ الشِّفَاءُ لَا كَاشِفَ لَهُ إِلَّا أَنْتَو حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كِلَاهُمَا عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] dan lafazh ini miliknya Abu Kuraib. Dia berkata; Telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Hisyam] dari [Bapaknya] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam meruqyah dengan do'a seperti ini, yang artinya; \"Wahai Rabb manusia, singkirkanlah penyakit ini di tangan Engkaulah segala kesembuhan, tidak ada yang bisa menyembuhkannya selain Engkau.\" Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Usamah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Isa bin Yunus] keduanya dari [Hisyam] melalui jalur ini dengan Hadits yang serupa."
            },
            {
                "number": 3760,
                "arab": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ وَيَحْيَى بْنُ أَيُّوبَ قَالَا حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَرِضَ أَحَدٌ مِنْ أَهْلِهِ نَفَثَ عَلَيْهِ بِالْمُعَوِّذَاتِ فَلَمَّا مَرِضَ مَرَضَهُ الَّذِي مَاتَ فِيهِ جَعَلْتُ أَنْفُثُ عَلَيْهِ وَأَمْسَحُهُ بِيَدِ نَفْسِهِ لِأَنَّهَا كَانَتْ أَعْظَمَ بَرَكَةً مِنْ يَدِيوَفِي رِوَايَةِ يَحْيَى بْنِ أَيُّوبَ بِمُعَوِّذَاتٍ",
                "id": "Telah menceritakan kepadaku [Suraij bin Yunus] dan [Yahya bin Ayyub] keduanya berkata; Telah menceritakan kepada kami ['Abbad bin 'Abbad] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] dia berkata; \"Apabila salah seorang isteri Rasulullah shallallahu 'alaihi wasallam sakit, beliau tiupkan kepadanya surat-surat mu'awwidzaat. Maka tatkala beliau sakit hampir meninggal, kutiupkan pula kepadanya dan kusapukan tangannya ke tubuhnya, karena tangan beliau lebih besar barakahnya daripada tanganku.\" Dan di dalam riwayat Yahya bin Ayyub dengan lafazh 'Mu'awwidzat' tanpa alif lam."
            },
            {
                "number": 3761,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفُثُ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ عَنْهُ بِيَدِهِ رَجَاءَ بَرَكَتِهَاو حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا رَوْحٌ ح و حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ وَأَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ قَالَا حَدَّثَنَا أَبُو عَاصِمٍ كِلَاهُمَا عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي زِيَادٌ كُلُّهُمْ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِ مَالِكٍ نَحْوَ حَدِيثِهِ وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ رَجَاءَ بَرَكَتِهَا إِلَّا فِي حَدِيثِ مَالِكٍ وَفِي حَدِيثِ يُونُسَ وَزِيَادٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى نَفَثَ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَمَسَحَ عَنْهُ بِيَدِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca Hadits [Malik] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam apabila beliau sakit, beliau baca untuk dirinya sendiri surat mu'awwidzaat, kemudian beliau tiupkan. Tatkala sakit beliau bertambah keras, kubacakan surat-surat itu atasnya, kemudian kusapukan dengan tangannya sambil mengharapkan barakah daripadanya.\" Dan telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Abad bin Humaid]; Telah mengabarkan kepada kami ['Abdur Razaq]; Telah mengabarkan kepada kami [Ma'mar]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Muhammad bin 'Abdullah bin Numair]; Telah menceritakan kepada kami [Rauh]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Uqbah bin Mukram] dan [Ahmad bin 'Utsman An Naufali] keduanya berkata; Telah menceritakan kepada kami [Abu 'Ashim] keduanya dari [Ibnu Juraij]; Telah mengabarkan kepadaku [Ziyad] seluruhnya dari [Ibnu Syihab] melalui jalur Malik seperti Haditsnya namun di dalam Hadits mereka tidak di sebutkan 'karena mengharap barakah darinya.' Kecuali hanya pada Hadits Malik saja. Dan di dalam Hadits Yunus dan Ziyad di sebutkan bahwa Nabi shallallahu 'alaihi wasallam apabila beliau sakit beliau meniupkan untuk dirinya dengan surat al mu'awwidzat seraya mengusapkan padanya dengan tangan beliau.'"
            },
            {
                "number": 3762,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ قَالَ سَأَلْتُ عَائِشَةَ عَنْ الرُّقْيَةِ فَقَالَتْرَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ بَيْتٍ مِنْ الْأَنْصَارِ فِي الرُّقْيَةِ مِنْ كُلِّ ذِي حُمَةٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami ['Ali bin Mushir] dari [Asy Syaibani] dari ['Abdur Rahman bin Al Aswad] dari [Bapaknya] dia berkata; \"Aku pernah bertanya kepada ['Aisyah] tentang ruqyah. Jawabnya; 'Rasulullah shallallahu 'alaihi wasallam pernah membolehkan satu keluarga Anshar melakukan ruqyah untuk setiap penyakit demam.'"
            },
            {
                "number": 3763,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْرَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ بَيْتٍ مِنْ الْأَنْصَارِ فِي الرُّقْيَةِ مِنْ الْحُمَةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Husyaim] dari [Mughirah] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] dia berkata; 'Rasulullah shallallahu 'alaihi wasallam pernah membolehkan bagi keluarga Anshar melakukan ruqyah untuk penyakit demam.'"
            },
            {
                "number": 3764,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى الْإِنْسَانُ الشَّيْءَ مِنْهُ أَوْ كَانَتْ بِهِ قَرْحَةٌ أَوْ جُرْحٌ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِصْبَعِهِ هَكَذَا وَوَضَعَ سُفْيَانُ سَبَّابَتَهُ بِالْأَرْضِ ثُمَّ رَفَعَهَا بِاسْمِ اللَّهِ تُرْبَةُ أَرْضِنَا بِرِيقَةِ بَعْضِنَا لِيُشْفَى بِهِ سَقِيمُنَا بِإِذْنِ رَبِّنَاقَالَ ابْنُ أَبِي شَيْبَةَ يُشْفَى و قَالَ زُهَيْرٌ لِيُشْفَى سَقِيمُنَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] serta [Ibnu Abu 'Umar] dan lafazh ini miliknya Ibnu Abu 'Umar dia berkata; Telah menceritakan kepada kami [Sufyan] dari ['Abdu Rabbih bin Sa'id] dari ['Amrah] dari ['Aisyah] bahwa apabila seseorang mengadukan suatu penyakit yang dideritanya kepada Rasulullah shallallahu 'alaihi wasallam, seperti sakit kudis, atau luka, maka Nabi shallallahu 'alaihi wasallam berucap sambil menggerakkan anak jarinya seperti ini -Sufyan meletakkan telunjuknya ke tanah, kemudian mengangkatnya- Bismillahi turbatu ardhina biriiqati ba'dhina liyusyfaa bihi saqiimuna bi idzni rabbina.\" (Dengan nama Allah, dengan debu di bumi kami, dan dengan ludah sebagian kami, semoga sembuhlah penyakit kami dengan izin Rabb kami). Ibnu Abu Syaibah berkata; ruqyah tersebut berbunyi; Yusyfaa saqiimunaa'. Dan Zuhair berkata; do'a ruqyah tersebut berbunyi; Liyusyfaa saqiimunaa.'"
            },
            {
                "number": 3765,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ أَبُو بَكْرٍ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لَهُمَا حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ مِسْعَرٍ حَدَّثَنَا مَعْبَدُ بْنُ خَالِدٍ عَنْ ابْنِ شَدَّادٍ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُهَا أَنْ تَسْتَرْقِيَ مِنْ الْعَيْنِحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ حَدَّثَنَا أَبِي حَدَّثَنَا مِسْعَرٌ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] dan [Ishaq bin Ibrahim] dia berkata; [Ishaq] telah mengabarkan kepada kami. Berkata [Abu Bakr] dan [Abu Kuraib] dan lafazh ini miliknya mereka; Telah menceritakan kepada kami [Muhammad bin Bisyr] dari [Mis'ar]; Telah menceritakan kepada kami [Ma'bad bin Khalid] dari [Ibnu Syaddad] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam menyuruhku supaya meruqyah penyakit dari pengaruh pandangan mata.\" Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair] dia berkata; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Mis'ar] dengan hadits yang serupa."
            },
            {
                "number": 3766,
                "arab": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سُفْيَانُ عَنْ مَعْبَدِ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنِي أَنْ أَسْتَرْقِيَ مِنْ الْعَيْنِ",
                "id": "Dan telah menceritakan kepada kami [Ibnu Numair]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Sufyan] dari [Ma'bad bin Khalid] dari ['Abdullah bin Syaddad] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menyuruhku supaya meruqyah penyakit dari pengaruh pandangan mata.\""
            },
            {
                "number": 3767,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ فِي الرُّقَى قَالَرُخِّصَ فِي الْحُمَةِ وَالنَّمْلَةِ وَالْعَيْنِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Abu Khaitsamah] dari ['Ashim Al Ahwal] dari [Yusuf bin 'Abdullah] dari [Anas bin Malik] mengenai ruqyah dia berkata; Di bolehkan meruqyah penyakit karena penyakit demam, karena gigitan semut, dan pengaruh pandangan mata.\""
            },
            {
                "number": 3768,
                "arab": "حَدَّثَنِي أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِجَارِيَةٍ فِي بَيْتِ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى بِوَجْهِهَا سَفْعَةً فَقَالَ بِهَا نَظْرَةٌ فَاسْتَرْقُوا لَهَا يَعْنِي بِوَجْهِهَا صُفْرَةً",
                "id": "Telah menceritakan kepadaku [Abu Ar Rabi' Sulaiman bin Dawud]; Telah menceritakan kepada kami [Muhammad bin Harb]; Telah menceritakan kepadaku [Muhammad bin Al Walid Az Zubadi] [Az Zuhriy] dari ['Urwah bin Az Zubair] dari [Zainab bin Ummu Salamah] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, katanya Rasulullah shallallahu 'alaihi wasallam pernah bersabda tentang seorang budak perempuan yang tinggal di rumah Ummu Salamah, karena mukanya kelihatan pucat oleh beliau. Maka beliau bersabda: \"Dia terkena penyakit pengaruh pandangan mata, karena itu ruqyahlah dia.\" (karena wajahnya berwarna kuning)."
            },
            {
                "number": 3769,
                "arab": "حَدَّثَنِي عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ وَأَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُارَخَّصَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِآلِ حَزْمٍ فِي رُقْيَةِ الْحَيَّةِ وَقَالَ لِأَسْمَاءَ بِنْتِ عُمَيْسٍ مَا لِي أَرَى أَجْسَامَ بَنِي أَخِي ضَارِعَةً تُصِيبُهُمْ الْحَاجَةُ قَالَتْ لَا وَلَكِنْ الْعَيْنُ تُسْرِعُ إِلَيْهِمْ قَالَ ارْقِيهِمْ قَالَتْ فَعَرَضْتُ عَلَيْهِ فَقَالَ ارْقِيهِمْ",
                "id": "Telah menceritakan kepadaku ['Uqbah bin Mukram Al 'Ammi]; Telah menceritakan kepada kami [Abu 'Ashim] dari [Juraij] dia berkata; Dan telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jubair bin Abdullah] berkata; \"Rasulullah shallallahu 'alaihi wasallam membolehkan keluarga Hazm meruqyah bekas gigitan ular.\" Dan beliau bertanya kepada 'Asma binti 'Umais: 'Kelihatannya tubuh anak saudaraku ini kurus kering. Apakah mereka kurang makan? ' Jawab Asma'; 'Tidak! Mereka terkena penyakit pengaruh pandangan mata.' Nabi shallallahu 'alaihi wasallam bersabda: 'Ruqyahlah mereka! ' Lalu kuminta agar beliau sudi meruqyah mereka. Tetapi beliau tetap mengatakan: 'Ruqyahlah mereka.'"
            },
            {
                "number": 3770,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَكَانَ لِي خَالٌ يَرْقِي مِنْ الْعَقْرَبِ فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرُّقَى قَالَ فَأَتَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّكَ نَهَيْتَ عَنْ الرُّقَى وَأَنَا أَرْقِي مِنْ الْعَقْرَبِ فَقَالَ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَفْعَلْو حَدَّثَنَاه عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Sa'id Al Asyaj] keduanya berkata; Telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata; \"Seorang laki-laki dari keluarga kami digigit kalajengking. Dan Nabi shallallahu 'alaihi wasallam melarang telah melarang mantera. Kemudian orang itu menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata; 'Ya, Rasulullah! engkau telah melarang mantera, sedangkan aku bisa mengobati dengan mantera dari gigitan kalajengking. 'Jawab beliau: 'Siapa yang sanggup di antara kalian menolong saudaranya, hendaklah dilakukannya.' Dan telah menceritakannya kepada kami ['Utsman bin Abu Syaibah] dia berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] melalui jalur ini dengan Hadits yang serupa."
            },
            {
                "number": 3771,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرُّقَى فَجَاءَ آلُ عَمْرِو بْنِ حَزْمٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ كَانَتْ عِنْدَنَا رُقْيَةٌ نَرْقِي بِهَا مِنْ الْعَقْرَبِ وَإِنَّكَ نَهَيْتَ عَنْ الرُّقَى قَالَ فَعَرَضُوهَا عَلَيْهِ فَقَالَ مَا أَرَى بَأْسًا مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَنْفَعْهُ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Mu'awiyah]; Telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir]; dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah melarang melakukan mantera. Lalu datang keluarga 'Amru bin Hazm kepada beliau seraya berkata; 'Ya Rasulullah! Kami mempunyai mantera untuk gigitan kalajengking. Tetapi Anda melarang melakukan mantera. Bagaimana itu? ' Lalu mereka peragakan mantera mereka di hadapan beliau. Sabda beliau: 'Ini tidak apa-apa. Barangsiapa di antara kalian yang bisa memberi manfaat kepada temannya hendaklah dia melakukannya.'"
            },
            {
                "number": 3772,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَكُنَّا نَرْقِي فِي الْجَاهِلِيَّةِ فَقُلْنَا يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي ذَلِكَ فَقَالَ اعْرِضُوا عَلَيَّ رُقَاكُمْ لَا بَأْسَ بِالرُّقَى مَا لَمْ يَكُنْ فِيهِ شِرْكٌ",
                "id": "Telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Mu'awiyah bin Shalih] dari ['Abdur Rahman bin Jubair] dari [Bapaknya] dari ['Auf bin Malik Al Asyja'i] dia berkata; \"Kami biasa melakukan mantera pada masa jahiliyah. Lalu kami bertanya kepada Rasulullah shallallahu 'alaihi wasallam; 'Ya Rasulullah! bagaimana pendapat Anda tentang mantera? ' Jawab beliau: 'Peragakanlah manteramu itu di hadapanku. Mantera itu tidak ada salahnya selama tidak mengandung syirik.'"
            },
            {
                "number": 3773,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا فِي سَفَرٍ فَمَرُّوا بِحَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ فَلَمْ يُضِيفُوهُمْ فَقَالُوا لَهُمْ هَلْ فِيكُمْ رَاقٍ فَإِنَّ سَيِّدَ الْحَيِّ لَدِيغٌ أَوْ مُصَابٌ فَقَالَ رَجُلٌ مِنْهُمْ نَعَمْ فَأَتَاهُ فَرَقَاهُ بِفَاتِحَةِ الْكِتَابِ فَبَرَأَ الرَّجُلُ فَأُعْطِيَ قَطِيعًا مِنْ غَنَمٍ فَأَبَى أَنْ يَقْبَلَهَا وَقَالَ حَتَّى أَذْكُرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا رَقَيْتُ إِلَّا بِفَاتِحَةِ الْكِتَابِ فَتَبَسَّمَ وَقَالَ وَمَا أَدْرَاكَ أَنَّهَا رُقْيَةٌ ثُمَّ قَالَ خُذُوا مِنْهُمْ وَاضْرِبُوا لِي بِسَهْمٍ مَعَكُمْحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ نَافِعٍ كِلَاهُمَا عَنْ غُنْدَرٍ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ بِهَذَا الْإِسْنَادِ وَقَالَ فِي الْحَدِيثِ فَجَعَلَ يَقْرَأُ أُمَّ الْقُرْآنِ وَيَجْمَعُ بُزَاقَهُ وَيَتْفِلُ فَبَرَأَ الرَّجُلُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi]; Telah mengabarkan kepada kami [Husyaim] dari [Abu Bisyr] dari [Abu Al Mutawakkil] dari [Abu Sa'id Al Khudri] bahwa beberapa orang sahabat melakukan perjalanan jauh dan berhenti untuk istirahat pada salah satu perkampungan 'Arab, lalu mereka minta dijamu oleh penduduk kampung itu. Tetapi penduduk enggan menjamu mereka. Penduduk bertanya kepada para sahabat; 'Adakah di antara tuan-tuan yang pandai mantera? Kepala kampung kami digigit serangga.' Menjawab seorang sahabat; 'Ya, ada! Kemudian dia mendatangi kepala kampung itu dan memanterainya dengan membaca surat Al Fatihah. Maka kepala kampung itu pun sembuh. Kemudian dia diberi upah kurang lebih tiga puluh ekor kambing. Tetapi dia enggan menerima seraya mengatakan; 'Tunggu! Aku akan menanyakannya lebih dahulu kepada Nabi shallallahu 'alaihi wasallam, apakah aku boleh menerimanya.' Lalu dia datang kepada Nabi shallallahu 'alaihi wasallam menanyakannya hal itu, katanya; 'Ya, Rasulullah! Demi Allah, aku telah memanterai seseorang dengan membacakan surat Al Fatihah.' Beliau tersenyum mendengar cerita sahabatnya dan bertanya: 'Bagaimana engkau tahu Al Fatihah itu mantera? ' Kemudian sabda beliau pula: 'Terimalah pemberian mereka itu, dan berilah aku bagian bersama-sama denganmu.' Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Abu Bakr bin Nafi'] keduanya dari [Ghundar Muhammad bin Ja'far] dari [Syu'bah] dari [Abu Bisyr] melalui jalur ini, dia menyebutkan di dalam Haditsnya; 'Kemudian orang itu mulai membacakan Ummul Qur'an, dan mengumpulkan ludahnya lalu memuntahkannya, setelah itu orang itu sembuh."
            },
            {
                "number": 3774,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَخِيهِ مَعْبَدِ بْنِ سِيرِينَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَنَزَلْنَا مَنْزِلًا فَأَتَتْنَا امْرَأَةٌ فَقَالَتْ إِنَّ سَيِّدَ الْحَيِّ سَلِيمٌ لُدِغَ فَهَلْ فِيكُمْ مِنْ رَاقٍ فَقَامَ مَعَهَا رَجُلٌ مِنَّا مَا كُنَّا نَظُنُّهُ يُحْسِنُ رُقْيَةً فَرَقَاهُ بِفَاتِحَةِ الْكِتَابِ فَبَرَأَ فَأَعْطَوْهُ غَنَمًا وَسَقَوْنَا لَبَنًا فَقُلْنَا أَكُنْتَ تُحْسِنُ رُقْيَةً فَقَالَ مَا رَقَيْتُهُ إِلَّا بِفَاتِحَةِ الْكِتَابِ قَالَ فَقُلْتُ لَا تُحَرِّكُوهَا حَتَّى نَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا ذَلِكَ لَهُ فَقَالَ مَا كَانَ يُدْرِيهِ أَنَّهَا رُقْيَةٌ اقْسِمُوا وَاضْرِبُوا لِي بِسَهْمٍ مَعَكُمْو حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ بِهَذَا الْإِسْنَادِ نَحْوَهُ غَيْرَ أَنَّهُ قَالَ فَقَامَ مَعَهَا رَجُلٌ مِنَّا مَا كُنَّا نَأْبِنُهُ بِرُقْيَةٍ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Yazid bin Harun]; Telah mengabarkan kepada kami [Hisyam bin Hasan] dari [Muhammad bin Sirin] dari saudara laki-lakinya [Ma'bad bin Sirin] dari [Abu Sa'id Al Khudri] dia berkata; Kami singgah pada suatu tempat, lalu datanglah seorang wanita kepada kami dan berkata; \"Sesungguhnya pemimpin wilayah ini sedang sakit, maka apakah dari kalian ada seseorang yang bisa meruqyah?\" Abu Sa'id berkata; \"Maka berdirilah seorang laki-laki mengikuti wanita tersebut, padahal kami tidak mengira bahwa laki-laki tersebut pandai meruqyah. lalu ia meruqyahnya dengan surat Al Fatihah hingga iapun sembuh. Lalu mereka memberi seekor kambing kepadanya dan memberi kami minuman susu.\" Maka kami bertanya kepadanya; Apakah kamu pandai meruqyah? Dia menjawab; Aku tidak meruqyahnya kecuali dengan surat Al Fatihah. Abu Sa'id berkata; Aku lalu berkata; \"Kalian jangan melakukan apapun (mengenai surat al Fatihah) sehingga kita datang kepada Rasulullah shallallahu 'alaihi wasallam, \" lalu kami menemui Rasulullah shallallahu 'alaihi wasallam, kemudian aku menceritakan hal tersebut kepada beliau, maka beliau pun bersabda: \"Tidakkah dia tahu bahwa itu adalah ruqyah, bagilah (hadiah itu) dan ikutkan aku dalam pembagian kalian.\" Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Wahb bin Jarir]; Telah menceritakan kepada kami [Hisyam] melalui jalur ini dengan Hadits yang serupa. Namun dia berkata dengan kalimat; 'lalu berdirilah salah seorang di antara kami mengikuti wanita itu, yang kami tidak mengiranya akan melakukan ruqyah.'"
            },
            {
                "number": 3775,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّأَنَّهُ شَكَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعًا يَجِدُهُ فِي جَسَدِهِ مُنْذُ أَسْلَمَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَعْ يَدَكَ عَلَى الَّذِي تَأَلَّمَ مِنْ جَسَدِكَ وَقُلْ بِاسْمِ اللَّهِ ثَلَاثًا وَقُلْ سَبْعَ مَرَّاتٍ أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ",
                "id": "Telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah bin Yahya] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab]; Telah mengabarkan kepadaku [Nafi' bin Jubair bin Muth'im] dari ['Utsman bin Abu Al 'Ash Ats Tsaqafi] bahwa dia mengadukan kepada Rasulullah shallallahu 'alaihi wasallam suatu penyakit yang dideritanya sejak ia masuk Islam. Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Letakkan tanganmu di tubuhmu yang terasa sakit, kemudian ucapkan Bismillah tiga kali, sesudah itu baca tujuh kali: A'udzu billahi wa qudratihi min syarri ma ajidu wa uhadziru.\" (Aku berlindung kepada Allah dan kekuasaanNya dari penyakit yang aku derita dan aku cemaskan)."
            },
            {
                "number": 3776,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ الْبَاهِلِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِأَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ الشَّيْطَانَ قَدْ حَالَ بَيْنِي وَبَيْنَ صَلَاتِي وَقِرَاءَتِي يَلْبِسُهَا عَلَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاكَ شَيْطَانٌ يُقَالُ لَهُ خَنْزَبٌ فَإِذَا أَحْسَسْتَهُ فَتَعَوَّذْ بِاللَّهِ مِنْهُ وَاتْفِلْ عَلَى يَسَارِكَ ثَلَاثًا قَالَ فَفَعَلْتُ ذَلِكَ فَأَذْهَبَهُ اللَّهُ عَنِّيحَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ كِلَاهُمَا عَنْ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ بِمِثْلِهِ وَلَمْ يَذْكُرْ فِي حَدِيثِ سَالِمِ بْنِ نُوحٍ ثَلَاثًا و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ سَعِيدٍ الْجُرَيْرِيِّ حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمْ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf Al Bahili]; Telah menceritakan kepada kami ['Abdu A'la] dari [Sa'id Al Jurari] dari [Abu Al A'la] bahwa ['Utsman bin Abu Al 'Ash] datang kepada Nabi shallallahu 'alaihi wasallam lalu bertanya; \"Ya, Rasulullah! Aku sering diganggu setan dalam sholat, sehingga bacaanku menjadi kacau karenanya. Bagaimana itu?\" Maka bersabda Rasulullah shallallahu 'alaihi wasallam: 'Ya, yang demikian itu memang gangguan setan yang dinamakan Khanzab. Karena itu bila engkau diganggunya, maka segeralah mohon perlindungan kepada Allah dari godaannya, sesudah itu meludah ke sebelah kirimu tiga kali! ' Kata Usman; 'Setelah kulakukan yang demikian, maka dengan izin Allah godaan seperti itu hilang.' Telah menceritakannya kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Salim bin Nuh] Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Abu Usamah] keduanya dari [Al Jurairi] dari [Abu Al A'la] dari ['Utsman bin Abu Al 'Ash] bahwa dia menemui Nabi shallallahu 'alaihi wasallam (kemudian dia menyebutkan Hadits yang serupa). Namun di dalam Hadits Salim bin Nuh dia tidak menyebutkan 'tiga kali.' Dan telah menceritakan kepadaku [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razaq]; Telah mengabarkan kepada kami [Sufyan] dari [Sa'id Al Jurairi]; Telah menceritakan kepada kami [Yazid bin 'Abdullah bin Asy Syakhikhiri] dari ['Utsman bin Abu Al 'Ash Ats Tsaqafi] dia berkata; 'Aku berkata; 'Ya Rasulullah ……………(kemudian dia menyebutkan Hadits yang serupa dengan mereka)."
            },
            {
                "number": 3777,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَأَبُو الطَّاهِرِ وَأَحْمَدُ بْنُ عِيسَى قَالُوا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَهُوَ ابْنُ الْحَارِثِ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لِكُلِّ دَاءٍ دَوَاءٌ فَإِذَا أُصِيبَ دَوَاءُ الدَّاءِ بَرَأَ بِإِذْنِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] dan [Abu Ath Thahir] serta [Ahmad bin 'Isa] mereka berkata; Telah menceritakan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku ['Amru] yaitu Ibnu Al Harits dari ['Abdu Rabbih bin Sa'id] dari [Abu Az Zubair] dari [Jabir] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap penyakit ada obatnya. Apabila ditemukan obat yang tepat untuk suatu penyakit, maka akan sembuhlah penyakit itu dengan izin Allah 'azza wajalla.\""
            },
            {
                "number": 3778,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَأَبُو الطَّاهِرِ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ بُكَيْرًا حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ حَدَّثَهُأَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ عَادَ الْمُقَنَّعَ ثُمَّ قَالَ لَا أَبْرَحُ حَتَّى تَحْتَجِمَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ فِيهِ شِفَاءً",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] dan [Abu Ath Thahir] keduanya berkata; Telah menceritakan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku ['Amru] bahwa [Bukair] Telah menceritakan kepadanya, ['Ashim bin 'Umar bin Qatadah] Telah menceritakan kepadanya; bahwa [Jabir bin 'Abdullah] pergi mengunjungi Al Muqanna' yang sedang sakit. Kemudian dia berkata; \"Aku tidak meninggalkan tempat ini sehingga engkau berbekam. Karena aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya di dalam berbekam ada kesembuhan.'"
            },
            {
                "number": 3779,
                "arab": "حَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ قَالَجَاءَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ فِي أَهْلِنَا وَرَجُلٌ يَشْتَكِي خُرَاجًا بِهِ أَوْ جِرَاحًا فَقَالَ مَا تَشْتَكِي قَالَ خُرَاجٌ بِي قَدْ شَقَّ عَلَيَّ فَقَالَ يَا غُلَامُ ائْتِنِي بِحَجَّامٍ فَقَالَ لَهُ مَا تَصْنَعُ بِالْحَجَّامِ يَا أَبَا عَبْدِ اللَّهِ قَالَ أُرِيدُ أَنْ أُعَلِّقَ فِيهِ مِحْجَمًا قَالَ وَاللَّهِ إِنَّ الذُّبَابَ لَيُصِيبُنِي أَوْ يُصِيبُنِي الثَّوْبُ فَيُؤْذِينِي وَيَشُقُّ عَلَيَّ فَلَمَّا رَأَى تَبَرُّمَهُ مِنْ ذَلِكَ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنْ كَانَ فِي شَيْءٍ مِنْ أَدْوِيَتِكُمْ خَيْرٌ فَفِي شَرْطَةِ مِحْجَمٍ أَوْ شَرْبَةٍ مِنْ عَسَلٍ أَوْ لَذْعَةٍ بِنَارٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا أُحِبُّ أَنْ أَكْتَوِيَ قَالَ فَجَاءَ بِحَجَّامٍ فَشَرَطَهُ فَذَهَبَ عَنْهُ مَا يَجِدُ",
                "id": "Telah menceritakan kepadaku [Nashr bin 'Ali Al Jahdhami]; Telah menceritakan kepadaku [Bapakku]; Telah menceritakan kepada kami ['Abdurrahman bin Sulaiman] dari ['Ashim bin 'Umar bin Qatadah] dia berkata; \" [Jabir bin Abdullah] pernah datang pada keluarga kami. Kebetulan, ketika itu ada seseorang yang menderita sakit bengkak bernanah atau luka. Lalu Jabir berkata; 'Kamu sakit apa? ' Ia menjawab; 'Bengkak saya sakit sekali.' Jabir berkata; 'Hai pelayan, panggil tukang bekam kemari! ' Orang yang sakit itu bertanya; 'Ya Abdullah, apa yang akan kamu perintahkan pada tukang bekam itu? ' Jabir menjawab; 'Saya akan menyuruhnya untuk membekam bengkakmu.' Orang sakit itu berkata; 'Demi Allah, dihinggapi lalat atau tersentuh kainnya saja sakit sekali. Apalagi jika dibekam.' Ketika Jabir mengetahui bahwa orang yang sakit tersebut enggan untuk dibekam, maka ia pun berkata; 'Sesungguhnya saya pernah mendengar Rasulullah bersabda: 'Di antara penyembuhan yang ampuh adalah berbekam, minum madu, atau sudutan dengan panas api.' Sabda beliau selanjutnya: 'Tetapi aku tidak suka dengan penyembuhan besi yang dipanasi.' Ashim berkata; 'Lalu pelayan tersebut datang dengan membawa tukang bekam. Kemudian tukang bekam itu membekam begian tubuh orang yang sakit itu, sehingga hilanglah sakit yang dideritanya.'"
            },
            {
                "number": 3780,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى وَاللَّفْظُ لَهُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أُبَيِّ بْنِ كَعْبٍ طَبِيبًا فَقَطَعَ مِنْهُ عِرْقًا ثُمَّ كَوَاهُ عَلَيْهِو حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ أَخْبَرَنَا سُفْيَانُ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرَا فَقَطَعَ مِنْهُ عِرْقًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakr bin Abu Syaibah] serta [Abu Kuraib]. Berkata; [Yahya] dan lafazh ini miliknya; Telah mengabarkan kepada kami. Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengirim seorang tabib kepada Ubay bin Ka'ab. Kemudian tabib tersebut membedah uratnya dan menyundutnya dengan besi panas.' Dan telah menceritakan kepada kami ['Utsman bin Abu Syaibah]; Telah menceritakan kepada kami [Jarir]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Ishaq bin Manshur]; Telah mengabarkan kepada kami ['Abdur Rahman]; Telah mengabarkan kepada kami [Sufyan] keduanya dari [Al A'masy] melalui jalur ini, namun keduanya tidak menyebutkan; 'kemudian tabib tersebut membedah uratnya.'"
            },
            {
                "number": 3781,
                "arab": "و حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ عَنْ شُعْبَةَ قَالَ سَمِعْتُ سُلَيْمَانَ قَالَ سَمِعْتُ أَبَا سُفْيَانَ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَرُمِيَ أُبَيٌّ يَوْمَ الْأَحْزَابِ عَلَى أَكْحَلِهِ فَكَوَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepadaku [Bisyr bin Khalid]; Telah menceritakan kepada kami [Muhammad] yaitu Ibnu Ja'far dari [Syu'bah] dia berkata; Aku mendengar [Sulaiman] berkata; Aku mendengar [Abu Sufyan] berkata; Aku mendengar [Jabir bin Abdullah] berkata; \"Ubay kena panah pada urat nadinya dalam perang Ahzab. Lalu Rasulullah shallallahu 'alaihi wasallam menyundut lukanya dengan besi panas.\""
            },
            {
                "number": 3782,
                "arab": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَاسْتَعَطَ",
                "id": "Telah menceritakan kepadaku [Ahmad bin Sa'id bin Shakhr Ad Darimi]; Telah menceritakan kepada kami [Habban bin Hilal]; Telah menceritakan kepada kami [Wuhaib]; Telah menceritakan kepada kami ['Abdullah bin Thawus] dari [Bapaknya] dari [Ibnu Abbas] bahwasanya Nabi shallallahu 'alaihi wasallam pernah berbekam dan memberi upah kepada tukang bekam, dan beliau pernah pula memakai obat tetes hidung.\""
            },
            {
                "number": 3783,
                "arab": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ و قَالَ أَبُو كُرَيْبٍ وَاللَّفْظُ لَهُ أَخْبَرَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ عَمْرِو بْنِ عَامِرٍ الْأَنْصَارِيِّ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُااحْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ لَا يَظْلِمُ أَحَدًا أَجْرَهُ",
                "id": "Dan telah menceritakannya kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] berkata; [Abu Bakr] Telah menceritakan kepada kami [Waki']. Dan berkata; [Abu Kuraib] dan lafazh ini miliknya; Telah mengabarkan kepada kami [Waki'] dari [Mis'ar] dari ['Amru bin 'Amir Al Anshari] dia berkata; Aku mendengar; [Anas bin Malik] berkata; 'Rasulullah shallallahu 'alaihi wasallam pernah berbekam dan beliau tidak pernah mendzalimi seorangpun dalam memberi upah.'"
            },
            {
                "number": 3784,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Al Mutsanna] keduanya berkata; Telah menceritakan kepada kami [Yahya] yaitu Ibnu Sa'id dari ['Ubaidillah]; Telah mengabarkan kepadaku [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Penyakit demam panas itu berasal dari panas neraka jahanam. Karena itu dinginkanlah (kompres) dengan air.\""
            },
            {
                "number": 3785,
                "arab": "و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي مَالِكٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ كِلَاهُمَا عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَطْفِئُوهَا بِالْمَاءِ",
                "id": "Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah menceritakan kepadaku [Malik]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami [Ibnu Abu Fudaik]; Telah mengabarkan kepada kami [Adh Dhahak] yaitu Ibnu 'Utsman keduanya dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam sabdanya: \"Penyakit demam panas itu berasal dari panas neraka jahanam. Karena itu matikanlah (kompres) dengan air.\""
            },
            {
                "number": 3786,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ وَاللَّفْظُ لَهُ حَدَّثَنَا رَوْحٌ حَدَّثَنَا شُعْبَةُ عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ زَيْدٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَطْفِئُوهَا بِالْمَاءِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdullah bin Al Hakam]; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Harun bin 'Abdillah] dan lafazh ini miliknya; Telah menceritakan kepada kami [Rauh]; Telah menceritakan kepada kami [Syu'bah] dari ['Umar bin Muhammad bin Zaid] dari [Bapaknya] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Penyakit demam panas itu berasal dari panas neraka jahanam. Karena itu matikanlah (kompreslah) dengan air.\""
            },
            {
                "number": 3787,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ حَدَّثَنِي مُوسَى بْنُ أَبِي عَائِشَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَائِشَةَ قَالَتْلَدَدْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ فَأَشَارَ أَنْ لَا تَلُدُّونِي فَقُلْنَا كَرَاهِيَةَ الْمَرِيضِ لِلدَّوَاءِ فَلَمَّا أَفَاقَ قَالَ لَا يَبْقَى أَحَدٌ مِنْكُمْ إِلَّا لُدَّ غَيْرُ الْعَبَّاسِ فَإِنَّهُ لَمْ يَشْهَدْكُمْ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim]; Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan]; Telah menceritakan kepadaku [Musa bin Abu 'Aisyah] dari ['Ubaidillah bin 'Abdullah] dari ['Aisyah] dia berkata; \"Kami pernah mengobati Rasulullah shallallahu 'alaihi wasallam dengan ladud (menuangkan obat dari pinggir mulut orang yang sakit) ketika beliau sedang sakit. Kemudian beliau memberi isyarat, 'janganlah kamu mengobatiku dengan ladud.' Maka kami katakan; 'orang sakit memang tidak suka obat.' Setelah sadar Rasulullah shallallahu 'alaihi wasallam berkata; 'Tidak ada seorangpun di antara kalian melainkan ia harus dimasuki mulutnya dengan obat (ladud), kecuali Abbas karena dia sekarang tidak bersama kalian. "
            },
            {
                "number": 3788,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِزُهَيْرٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ أُخْتِ عُكَّاشَةَ بْنِ مِحْصَنٍ قَالَتْدَخَلْتُ بِابْنٍ لِي عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَأْكُلْ الطَّعَامَ فَبَالَ عَلَيْهِ فَدَعَا بِمَاءٍ فَرَشَّهُ قَالَتْ وَدَخَلْتُ عَلَيْهِ بِابْنٍ لِي قَدْ أَعْلَقْتُ عَلَيْهِ مِنْ الْعُذْرَةِ فَقَالَ عَلَامَهْ تَدْغَرْنَ أَوْلَادَكُنَّ بِهَذَا الْعِلَاقِ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ يُسْعَطُ مِنْ الْعُذْرَةِ وَيُلَدُّ مِنْ ذَاتِ الْجَنْبِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Abu Bakr bin Abu Syaibah] dan ['Amru An Naqid] dan [Zuhair bin Harb] dan [Ibnu Abu 'Umar] dan lafazh ini miliknya Zuhair. [Yahya] berkata; Telah mengabarkan kepada kami Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Ubaidillah bin 'Abdullah] dari [Ummu Qais binti Mihshan] saudara perempuan 'Ukkasyah bin Mihshan dia berkata; Aku bersama anakku menemui Rasulullah shallallahu 'alaihi wasallam pada waktu itu anakku belum bisa makan makanan. Tiba-tiba dia kencing di pangkuan Rasulullah shallallahu 'alaihi wasallam, lalu beliau menyuruh mengambilkan air dan memercikkannya. Ummu Qais berkata; 'Dan aku juga pernah menemui beliau bersama anakku yang aku tekan kerongkongannya untuk menghilangkan sakit amandelnya. Lalu beliau bersabda: \"Mengapa kamu tekan kerongkongan anakmu seperti itu? Gunakanlah kust India. Kerena Kust tersebut mengandung tujuh macam obat, di antaranya adalah obat sakit lambung, Su'ut (mengobati lewat hidung) adalah dipergunakan untuk penyakit amandel, dan Ladud (mengobati dari pinggir mulut orang yang sakit) adalah dipergunakan untuk penyakti sakit lambung."
            },
            {
                "number": 3789,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍأَنَّ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ وَكَانَتْ مِنْ الْمُهَاجِرَاتِ الْأُوَلِ اللَّاتِي بَايَعْنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ أُخْتُ عُكَّاشَةَ بْنِ مِحْصَنٍ أَحَدِ بَنِي أَسَدِ بْنِ خُزَيْمَةَ قَالَ أَخْبَرَتْنِي أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِابْنٍ لَهَا لَمْ يَبْلُغْ أَنْ يَأْكُلَ الطَّعَامَ وَقَدْ أَعْلَقَتْ عَلَيْهِ مِنْ الْعُذْرَةِ قَالَ يُونُسُ أَعْلَقَتْ غَمَزَتْ فَهِيَ تَخَافُ أَنْ يَكُونَ بِهِ عُذْرَةٌ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَامَهْ تَدْغَرْنَ أَوْلَادَكُنَّ بِهَذَا الْإِعْلَاقِ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ يَعْنِي بِهِ الْكُسْتَ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ قَالَ عُبَيْدُ اللَّهِ وَأَخْبَرَتْنِي أَنَّ ابْنَهَا ذَاكَ بَالَ فِي حَجْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَاءٍ فَنَضَحَهُ عَلَى بَوْلِهِ وَلَمْ يَغْسِلْهُ غَسْلًا",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus bin Yazid] bahwa [Ibnu Syihab] Telah mengabarkan kepadanya dia berkata; Telah mengabarkan kepadaku ['Ubaidillah bin 'Utbah bin Mas'ud] bahwa [Ummu Qays binti Mihshan], termasuk wanita yang turut hijrah dalam kelompok pertama yang membai'at Rasulullah shallallahu 'alaihi wasallam dan ia adalah saudara perempuan Ukasyah binti Mihshan, salah seorang dari Bani Asad bin Khuzaimah, dia memberitahukan kepada saya bahwasannya ia pernah datang kepada Rasulullah shallallahu 'alaihi wasallam bersama putranya yang belum dapat memakan makanan sambil ia tekan kerongkong anaknya itu. Yunus berkata; 'A'laqat adalah Ghamazat' (menekan) dengan maksud untuk menghilangkan sakit amandelnya. Ummu Qais berkata; lalu Rasulullah bertanya: \"Mengapa kamu tekan kerongkongan anakmu seperti itu? Gunakanlah kust India. Kerena Kust tersebut mengandung tujuh macam obat, salah satu di antaranya adalah obat sakit lambung. Ubaidillah berkata; Ummu Qais memberitahukan kepada saya, bahwasanya putranya kencing pada saat itu, lalu beliau meminta air dan memercikannya pada kencing itu tanpa membasuhnya."
            },
            {
                "number": 3790,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَخْبَرَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَسَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُمَاأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءً مِنْ كُلِّ دَاءٍ إِلَّا السَّامَ وَالسَّامُ الْمَوْتُ وَالْحَبَّةُ السَّوْدَاءُ الشُّونِيزُو حَدَّثَنِيهِ أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ كُلُّهُمْ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ عُقَيْلٍ وَفِي حَدِيثِ سُفْيَانَ وَيُونُسَ الْحَبَّةُ السَّوْدَاءُ وَلَمْ يَقُلْ الشُّونِيزُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh bin Al Muhajirin]; Telah mengabarkan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab]; Telah mengabarkan kepadaku [Abu Salamah bin 'Abdur Rahman] dan [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] Telah mengabarkan kepada mereka berdua, dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di dalam Habbas Sauda ada kesembuhan bagi setiap penyakit kecuali As Saam. As Saam adalah kematian sedangkan Habbasauda adalah As Suuniz (jintan hitam).\" Dan telah menceritakannya kepada kami [Abu Ath Thahir] dan [Harmalah] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], ['Amru An Naqid], [Zuhair bin Harb] dan [Ibnu Abu 'Umar] mereka berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Abdu bin Humaid]; Telah mengabarkan kepada kami ['Abdur Razaq]; Telah mengabarkan kepada kami [Ma'mar]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Abdullah bin 'Abdur Rahman Ad Darimi]; Telah mengabarkan kepada kami [Abul Yaman]; Telah mengabarkan kepada kami [Syu'aib] seluruhnya dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam sebagaimana Hadits Uqail. Dan di dalam Hadits Sufyan di sebutkan 'Habbas sauda' saja tanpa menyebutkan 'As Syuuniz.'"
            },
            {
                "number": 3791,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ دَاءٍ إِلَّا فِي الْحَبَّةِ السَّوْدَاءِ مِنْهُ شِفَاءٌ إِلَّا السَّامَ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah bin Sa'id] dan [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] dan dia Ibnu Ja'far dari [Al A'la] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di dalam Habbas Sauda ada kesembuhan untuk setiap penyakit kecuali kematian.\""
            },
            {
                "number": 3792,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا كَانَتْ إِذَا مَاتَ الْمَيِّتُ مِنْ أَهْلِهَا فَاجْتَمَعَ لِذَلِكَ النِّسَاءُ ثُمَّ تَفَرَّقْنَ إِلَّا أَهْلَهَا وَخَاصَّتَهَا أَمَرَتْ بِبُرْمَةٍ مِنْ تَلْبِينَةٍ فَطُبِخَتْ ثُمَّ صُنِعَ ثَرِيدٌ فَصُبَّتْ التَّلْبِينَةُ عَلَيْهَا ثُمَّ قَالَتْ كُلْنَ مِنْهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ التَّلْبِينَةُ مُجِمَّةٌ لِفُؤَادِ الْمَرِيضِ تُذْهِبُ بَعْضَ الْحُزْنِ",
                "id": "Telah menceritakan kepada kami ['Abdul Malik bin Syu'aib bin Al Laits bin Sa'd]; Telah menceritakan kepadaku [Bapakku] dari [Jaddi]; Telah menceritakan kepadaku ['Uqail bin Khalid] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah] istri Nabi shallallahu 'alaihi wasallam, bahwa bila ada orang dari keluarganya (Aisyah) yang meninggal maka para wanita pun berkumpul, kemudian mereka pergi kecuali keluarganya dan orang-orang terdekat. Lalu (Aisyah) memerintahkan untuk mengambil periuk yang terbuat dari batu dan diisi dengan talbinah (makanan terbuat dari tepung dan kurma), lalu dimasaklah makanan tersebut, kemudian dibuat bubur dan dituangkanlah makanan tersebut diatasnya. Lalu (Aisyah) berkata; \"Makanlah ia, karena sungguh saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Makanan yang terbuat dari tepung dan kurma tersebut penyejuk bagi hati yang sakit dan dapat menghilangkan sebagian kesedihan.\""
            },
            {
                "number": 3793,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أَخِي اسْتَطْلَقَ بَطْنُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْقِهِ عَسَلًا فَسَقَاهُ ثُمَّ جَاءَهُ فَقَالَ إِنِّي سَقَيْتُهُ عَسَلًا فَلَمْ يَزِدْهُ إِلَّا اسْتِطْلَاقًا فَقَالَ لَهُ ثَلَاثَ مَرَّاتٍ ثُمَّ جَاءَ الرَّابِعَةَ فَقَالَ اسْقِهِ عَسَلًا فَقَالَ لَقَدْ سَقَيْتُهُ فَلَمْ يَزِدْهُ إِلَّا اسْتِطْلَاقًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَ اللَّهُ وَكَذَبَ بَطْنُ أَخِيكَ فَسَقَاهُ فَبَرَأَو حَدَّثَنِيهِ عَمْرُو بْنُ زُرَارَةَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَطَاءٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أَخِي عَرِبَ بَطْنُهُ فَقَالَ لَهُ اسْقِهِ عَسَلًا بِمَعْنَى حَدِيثِ شُعْبَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar]; Dan lafazh ini miliknya Ibnu Al Mutsanna dia berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abu Al Mutawakkil] dari [Abu Sa'id Al Khudri] dia berkata; \"Seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam lalu dia berkata; 'Saudaraku sakit perut sehingga dia buang-buang air.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Minumkan madu kepadanya! ' Lalu diminumkan madu kepadanya. Kemudian dia datang lagi kepada Nabi shallallahu 'alaihi wasallam lalu katanya: 'Telah kuminumkan madu kepadanya, tetapi sakitnya bertambah.' Nabi shallallahu 'alaihi wasallam menyuruhnya pula meminumkan madu sampai berulang tiga kali. Dia datang untuk keempat kalinya, Nabi shallallahu 'alaihi wasallam tetap menyuruhnya meminumkan madu. Kata orang itu; 'Aku telah meminumkannya, ya Rasulullah, namun sakitnya bertambah juga.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Allah Maha Benar! Perut saudaramu itulah yang dusta.' Lalu diminumkannya pula madu dan sembuhlah dia.' Dan telah menceritakannya kepada kami ['Amru bin Zurarah]; Telah mengabarkan kepada kami ['Abdul Wahhab] yaitu Ibnu 'Atha dari [Sa'id] dari [Qatadah] dari [Abu Al Mutawakkil An Naji] dari [Abu Sa'id Al Khudri] bahwa seseorang datang kepada Nabi shallallahu 'alaihi wasallam seraya berkata; 'Saudaraku perutnya sakit, maka Nabi shallallahu 'alaihi wasallam bersabda kepadanya: 'Minumkanlah kepadanya madu.' (yang semakna dengan Hadits Syu'bah). "
            },
            {
                "number": 3794,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَأَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍعَنْ أَبِيهِ أَنَّهُ سَمِعَهُ يَسْأَلُ أُسَامَةَ بْنَ زَيْدٍ مَاذَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الطَّاعُونِ فَقَالَ أُسَامَةُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الطَّاعُونُ رِجْزٌ أَوْ عَذَابٌ أُرْسِلَ عَلَى بَنِي إِسْرَائِيلَ أَوْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَإِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا فِرَارًا مِنْهُو قَالَ أَبُو النَّضْرِ لَا يُخْرِجُكُمْ إِلَّا فِرَارٌ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca Hadits [Malik] dari [Muhammad bin Al Mukandir] dan [Abu An Nadhr] budak 'Umar bin 'Ubaidillah dari ['Amir bin Sa'ad bin Abu Waqqash] dari Bapaknya bahwa dia mendengarnya bertanya kepada [Usamah bin Zaid] 'Apa yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam tentang penyakit Tha'un? ' Jawab Usamah; 'Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tha'un (wabah kolera) adalah semacam azab (siksaan) yang diturunkan Allah kepada Bani Israil atau kepada umat yang sebelum kamu. Maka apabila kamu mendengar penyakit tha'un berjangkit di suatu negeri, janganlah kamu datang ke negeri itu. Dan apabila penyakit itu berjangkit di negeri tempat kamu berada, janganlah kamu keluar dari negeri itu untuk melarikan diri dari padanya.'"
            },
            {
                "number": 3795,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا أَخْبَرَنَا الْمُغِيرَةُ وَنَسَبَهُ ابْنُ قَعْنَبٍ فَقَالَ ابْنُ عَبْدِ الرَّحْمَنِ الْقُرَشِيُّ عَنْ أَبِي النَّضْرِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الطَّاعُونُ آيَةُ الرِّجْزِ ابْتَلَى اللَّهُ عَزَّ وَجَلَّ بِهِ نَاسًا مِنْ عِبَادِهِ فَإِذَا سَمِعْتُمْ بِهِ فَلَا تَدْخُلُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَفِرُّوا مِنْهُهَذَا حَدِيثُ الْقَعْنَبِيِّ وَقُتَيْبَةَ نَحْوُهُ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab] dan [Qutaibah bin Sa'id] keduanya berkata; Telah mengabarkan kepada kami [Al Mughir] dan dia nasabkan dengan Ibnu Qa'nab. Ibnu 'Abdur Rahman Al Quraisy berkata; dari [Abu An Nadhr] dari ['Amir bin Sa'd bin Abu Waqqash] dari [Usamah bin Zaid] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tha'un (penyakit menular\/wabah kolera) adalah suatu peringatan dari Allah Subhanahu Wa Ta'ala untuk menguji hamba-hamba-Nya dari kalangan manusia. Maka apabila kamu mendengar penyakit itu berjangkit di suatu negeri, janganlah kamu masuk ke negeri itu. Dan apabila wabah itu berjangkit di negeri tempat kamu berada, jangan pula kamu lari daripadanya.\" Dan Hadits Qutaibah seperti itu juga."
            },
            {
                "number": 3796,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أُسَامَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذَا الطَّاعُونَ رِجْزٌ سُلِّطَ عَلَى مَنْ كَانَ قَبْلَكُمْ أَوْ عَلَى بَنِي إِسْرَائِيلَ فَإِذَا كَانَ بِأَرْضٍ فَلَا تَخْرُجُوا مِنْهَا فِرَارًا مِنْهُ وَإِذَا كَانَ بِأَرْضٍ فَلَا تَدْخُلُوهَا",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin 'Abdillah bin Numair]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Al Mukandir] dari ['Amir bin Sa'd] dari [Usamah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penyakit Thaa'uun ini adalah suatu peringatan Allah yang ditimpakan kepada umat sebelum kalian atau kepada Bani Israil. Maka apabila wabah itu berjangkit di negeri tempat kamu berada, janganlah kamu keluar lari daripadanya. Dan bila penyakit itu berjangkit di suatu negeri, janganlah kamu masuk ke negeri itu."
            },
            {
                "number": 3797,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّ عَامِرَ بْنَ سَعْدٍ أَخْبَرَهُأَنَّ رَجُلًا سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنْ الطَّاعُونِ فَقَالَ أُسَامَةُ بْنُ زَيْدٍ أَنَا أُخْبِرُكَ عَنْهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ عَذَابٌ أَوْ رِجْزٌ أَرْسَلَهُ اللَّهُ عَلَى طَائِفَةٍ مِنْ بَنِي إِسْرَائِيلَ أَوْ نَاسٍ كَانُوا قَبْلَكُمْ فَإِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَدْخُلُوهَا عَلَيْهِ وَإِذَا دَخَلَهَا عَلَيْكُمْ فَلَا تَخْرُجُوا مِنْهَا فِرَارًاو حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ كِلَاهُمَا عَنْ عَمْرِو بْنِ دِينَارٍ بِإِسْنَادِ ابْنِ جُرَيْجٍ نَحْوَ حَدِيثِهِ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Hatim]; Telah menceritakan kepada kami [Muhammad bin Bakr]; Telah mengabarkan kepada kami [Ibnu Juraij]; Telah mengabarkan kepadaku ['Amru bin Dinar] bahwa ['Amir bin Sa'ad] Telah mengabarkan kepadanya; Seseorang bertanya kepada Sa'ad bin Abi Waqqash mengenai penyakit Tha'un. Maka kemudian [Usamah bin zaid] berkata; Akan aku ceritakan kepadamu tentang penyakit itu, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penyakit Tha'uun ini adalah adzab atau suatu peringatan yang Allah kirimkan kepada sekelompok umat dari kalangan Bani Israil atau umat sebelum kalian. Maka apabila kamu mendengar wabah itu berjangkit di suatu negeri, janganlah kamu masuk ke negeri itu. Dan apabila wabah itu berjangkit di negeri tempat kalian berada, janganlah kalian keluar lari dari padanya.\" Dan telah menceritakan kepada kami [Abu Ar Rabi' Sulaiman bin Dawud] dan [Qutaibah bin Sa'id] keduanya berkata; Telah menceritakan kepada kami [Hammad] yaitu Ibnu Zaid; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] keduanya dari ['Amru bin Dinar] dengan sanad Ibnu Juraij dengan Hadits yang serupa."
            },
            {
                "number": 3798,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرٍو وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ عَنْ أُسَامَةَ بْنِ زَيْدٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ هَذَا الْوَجَعَ أَوْ السَّقَمَ رِجْزٌ عُذِّبَ بِهِ بَعْضُ الْأُمَمِ قَبْلَكُمْ ثُمَّ بَقِيَ بَعْدُ بِالْأَرْضِ فَيَذْهَبُ الْمَرَّةَ وَيَأْتِي الْأُخْرَى فَمَنْ سَمِعَ بِهِ بِأَرْضٍ فَلَا يَقْدَمَنَّ عَلَيْهِ وَمَنْ وَقَعَ بِأَرْضٍ وَهُوَ بِهَا فَلَا يُخْرِجَنَّهُ الْفِرَارُ مِنْهُو حَدَّثَنَاه أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِإِسْنَادِ يُونُسَ نَحْوَ حَدِيثِهِ",
                "id": "Telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin 'Amru] dan [Harmalah bin Yahya] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab]; Telah mengabarkan kepadaku ['Amir bin Sa'd] dari [Usamah bin Zaid] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Wabah penyakit ini adalah sebuah adzab, yang dengannya Allah membinasakan sebagian ummat sebelum kalian dan sisanya masih ada dimuka bumi, terkadang datang dan terkadang pergi. Bila terdengar ada di suatu tempat maka janganlah kalian mendatanginya. Dan bila terjadi di suatu tempat sedangkan dia ada di situ maka janganlah kalian menyuruhnya keluar dari tempat itu.\" Dan telah menceritakannya kepada kami [Abu Kamil Al Jahdari]; Telah menceritakan kepada kami ['Abdul Wahid] yaitu Ibnu Ziyad; Telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] melalui jalur Yunus dengan Hadits yang serupa."
            },
            {
                "number": 3799,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ حَبِيبٍ قَالَ كُنَّا بِالْمَدِينَةِ فَبَلَغَنِي أَنَّ الطَّاعُونَ قَدْ وَقَعَ بِالْكُوفَةِ فَقَالَ لِي عَطَاءُ بْنُ يَسَارٍ وَغَيْرُهُإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كُنْتَ بِأَرْضٍ فَوَقَعَ بِهَا فَلَا تَخْرُجْ مِنْهَا وَإِذَا بَلَغَكَ أَنَّهُ بِأَرْضٍ فَلَا تَدْخُلْهَاقَالَ قُلْتُ عَمَّنْ قَالُوا عَنْ عَامِرِ بْنِ سَعْدٍ يُحَدِّثُ بِهِ قَالَ فَأَتَيْتُهُ فَقَالُوا غَائِبٌ قَالَ فَلَقِيتُ أَخَاهُ إِبْرَاهِيمَ بْنَ سَعْدٍ فَسَأَلْتُهُ فَقَالَ شَهِدْتُ أُسَامَةَ يُحَدِّثُ سَعْدًا قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ هَذَا الْوَجَعَ رِجْزٌ أَوْ عَذَابٌ أَوْ بَقِيَّةُ عَذَابٍ عُذِّبَ بِهِ أُنَاسٌ مِنْ قَبْلِكُمْ فَإِذَا كَانَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا مِنْهَا وَإِذَا بَلَغَكُمْ أَنَّهُ بِأَرْضٍ فَلَا تَدْخُلُوهَا قَالَ حَبِيبٌ فَقُلْتُ لِإِبْرَاهِيمَ آنْتَ سَمِعْتَ أُسَامَةَ يُحَدِّثُ سَعْدًا وَهُوَ لَا يُنْكِرُ قَالَ نَعَمْ و حَدَّثَنَاه عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ قِصَّةَ عَطَاءِ بْنِ يَسَارٍ فِي أَوَّلِ الْحَدِيثِ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ حَبِيبٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ سَعْدِ بْنِ مَالِكٍ وَخُزَيْمَةَ بْنِ ثَابِتٍ وَأُسَامَةَ بْنِ زَيْدٍ قَالُوا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ شُعْبَةَ و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرٍ عَنْ الْأَعْمَشِ عَنْ حَبِيبٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ كَانَ أُسَامَةُ بْنُ زَيْدٍ وَسَعْدٌ جَالِسَيْنِ يَتَحَدَّثَانِ فَقَالَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ و حَدَّثَنِيهِ وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا خَالِدٌ يَعْنِي الطَّحَّانَ عَنْ الشَّيْبَانِيِّ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Habib] dia berkata; Ketika kami sedang berada di Madinah, tiba-tiba sampai kepadaku berita bahwa wabah Tha'uun sedang berjangkit di Kufah. Maka [Atha bin Yasar] dan yang lainnya berkata kepadaku; 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Apabila kamu berada di suatu tempat dan wabah tersebut ada di dalamnya, maka janganlah kamu keluar darinya. Dan apabila kamu mendengar wabah tersebut ada di suatu tempat, maka janganlah kamu mendatangi tempat itu.\" Aku bertanya; dari siapa kamu dapat berita tersebut? Mereka menjawab; 'Dari [Amir bin Sa'ad]. Aku berkata; Aku akan menemuinya. Mereka berkata; 'Dia sedang tidak ada.' Maka aku menemui saudaranya, [Ibrahim bin Sa'ad]. Lalu aku tanyakan kepadanya, dan dia menjawab; 'Aku melihat [Usamah] bercerita kepada Sa'ad seraya berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penyakit Tha'uun ini adalah adzab atau suatu peringatan, atau sisa dari Adzab yang dengannya Allah menyiksa sekelompok umat sebelum kalian. Maka apabila kamu mendengar wabah itu berjangkit di suatu negeri, dan kamu berada di dalamnya, janganlah kamu keluar darinya. Dan apabila wabah itu berjangkit di suatu negeri, maka janganlah kalian mendatanginya.\" [Habib] berkata; Aku tanyakan kepada [Ibrahim]; Apakah kamu mendengar [Usamah] mengatakannya kepada Sa'ad dan dia tidak mengingkarinya? Ibrahim menjawab; 'Ya.' Dan telah menceritakannya kepada kami ['ubaidhullah bin Mu'adz]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Syu'bah] melalui jalur ini, namun pada awal Haditsnya dia tidak menyebutkan kisah ['Atha bin Yasar]. Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Habib] dari [Ibrahim bin Sa'd] dari [Sa'd bin Malik] dan [Khuzaimah bin Tsabit] dan [Usamah bin Zaid] mereka berkata; Rasulullah shallallahu 'alaihi wasallam bersabda seperti Hadits yang semakna dengan Hadits Syu'bah. Dan telah menceritakan kepada kami ['Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] keduanya dari [Jarir] dari [Al A'masy] dari [Habib] dari [Ibrahim bin Sa'd bin Abi Waqqash] dia berkata; [Usamah bin Zaid] dan [Sa'd] duduk-duduk berdua sedang membicarakan sesuatu. Lalu keduanya berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: (dengan Hadits yang serupa). Telah menceritakannya kepadaku; [Wahb bin Baqiyah]; Telah mengabarkan kepada kami [Khalid] yaitu Ath Thahan dari [Asy Syaibani] dari [Habib bin Abu Tsabit] dari [Ibrahim bin Sa'd bin Malik] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa."
            },
            {
                "number": 3800,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِ خَرَجَ إِلَى الشَّامِ حَتَّى إِذَا كَانَ بِسَرْغَ لَقِيَهُ أَهْلُ الْأَجْنَادِ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ وَأَصْحَابُهُ فَأَخْبَرُوهُ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّامِ قَالَ ابْنُ عَبَّاسٍ فَقَالَ عُمَرُ ادْعُ لِي الْمُهَاجِرِينَ الْأَوَّلِينَ فَدَعَوْتُهُمْ فَاسْتَشَارَهُمْ وَأَخْبَرَهُمْ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّامِ فَاخْتَلَفُوا فَقَالَ بَعْضُهُمْ قَدْ خَرَجْتَ لِأَمْرٍ وَلَا نَرَى أَنْ تَرْجِعَ عَنْهُ وَقَالَ بَعْضُهُمْ مَعَكَ بَقِيَّةُ النَّاسِ وَأَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَرَى أَنْ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَاءِ فَقَالَ ارْتَفِعُوا عَنِّي ثُمَّ قَالَ ادْعُ لِي الْأَنْصَارِ فَدَعَوْتُهُمْ لَهُ فَاسْتَشَارَهُمْ فَسَلَكُوا سَبِيلَ الْمُهَاجِرِينَ وَاخْتَلَفُوا كَاخْتِلَافِهِمْ فَقَالَ ارْتَفِعُوا عَنِّي ثُمَّ قَالَ ادْعُ لِي مَنْ كَانَ هَاهُنَا مِنْ مَشْيَخَةِ قُرَيْشٍ مِنْ مُهَاجِرَةِ الْفَتْحِ فَدَعَوْتُهُمْ فَلَمْ يَخْتَلِفْ عَلَيْهِ رَجُلَانِ فَقَالُوا نَرَى أَنْ تَرْجِعَ بِالنَّاسِ وَلَا تُقْدِمَهُمْ عَلَى هَذَا الْوَبَاءِ فَنَادَى عُمَرُ فِي النَّاسِ إِنِّي مُصْبِحٌ عَلَى ظَهْرٍ فَأَصْبِحُوا عَلَيْهِ فَقَالَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ أَفِرَارًا مِنْ قَدَرِ اللَّهِ فَقَالَ عُمَرُ لَوْ غَيْرُكَ قَالَهَا يَا أَبَا عُبَيْدَةَ وَكَانَ عُمَرُ يَكْرَهُ خِلَافَهُ نَعَمْ نَفِرُّ مِنْ قَدَرِ اللَّهِ إِلَى قَدَرِ اللَّهِ أَرَأَيْتَ لَوْ كَانَتْ لَكَ إِبِلٌ فَهَبَطَتْ وَادِيًا لَهُ عُدْوَتَانِ إِحْدَاهُمَا خَصْبَةٌ وَالْأُخْرَى جَدْبَةٌ أَلَيْسَ إِنْ رَعَيْتَ الْخَصْبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ وَإِنْ رَعَيْتَ الْجَدْبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِقَالَ فَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ وَكَانَ مُتَغَيِّبًا فِي بَعْضِ حَاجَتِهِ فَقَالَ إِنَّ عِنْدِي مِنْ هَذَا عِلْمًا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا فِرَارًا مِنْهُ قَالَ فَحَمِدَ اللَّهَ عُمَرُ بْنُ الْخَطَّابِ ثُمَّ انْصَرَفَو حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ مَالِكٍ وَزَادَ فِي حَدِيثِ مَعْمَرٍ قَالَ وَقَالَ لَهُ أَيْضًا أَرَأَيْتَ أَنَّهُ لَوْ رَعَى الْجَدْبَةَ وَتَرَكَ الْخَصْبَةَ أَكُنْتَ مُعَجِّزَهُ قَالَ نَعَمْ قَالَ فَسِرْ إِذًا قَالَ فَسَارَ حَتَّى أَتَى الْمَدِينَةَ فَقَالَ هَذَا الْمَحِلُّ أَوْ قَالَ هَذَا الْمَنْزِلُ إِنْ شَاءَ اللَّهُ و حَدَّثَنِيهِ أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ إِنَّ عَبْدَ اللَّهِ بْنَ الْحَارِثِ حَدَّثَهُ وَلَمْ يَقُلْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dia berkata; Aku membaca Hadits [Malik] dari [Ibnu Syihab] dari ['Abdul Hamid bin 'Abdur Rahman bin Zaid bin Al Khaththab] dari ['Abdullah bin 'Abdullah bin Al Harits bin Naufal] dari ['Abdullah bin 'Abbas] bahwa Pada suatu ketika 'Umar bin Khaththab pergi ke Syam. Setelah sampai di Saragh, pimpinan tentara datang menyambutnya. Antara lain terdapat Abu \"Ubaidah bin Jarrah dan para sahabat yang lain. Mereka mengabarkan kepada 'Umar bahwa wabah penyakit sedang berjangkit di Syam. Ibnu Abbas berkata; 'Umar berkata; 'Panggil ke sini para pendahulu dari orang-orang Muhajirin! ' Maka kupanggil mereka, lalu 'Umar bermusyawarah dengan mereka. Kata 'Umar; 'Wabah penyakit sedang berjangkit di Syam. Bagaimana pendapat kalian? ' Mereka berbeda pendapat. Sebagian mengatakan kepada 'Umar; 'Anda telah keluar untuk suatu urusan penting. Karena itu kami berpendapat, tidak selayaknya Anda akan pulang begitu saja.' Sebagian yang lain mengatakan; 'Anda datang membawa suatu rombongan besar, yang disana terdapat para sahabat Rasulullah shallallahu 'alaihi wasallam. Kami tidak sependapat jika Anda menghadapkan mereka kepada wabah ini.' Kata 'Umar; 'Pergilah kalian dari sini! ' Kemudian 'Umar berkata lagi; 'Panggil ke sini orang-orang Anshar! ' Maka aku memanggil mereka lalu 'Umar bermusyawarah dengan mereka. Ternyata kebijaksanaan mereka sama dengan orang-orang Muhajirin. Mereka berbeda pendapat seperti orang-orang Muhajirin. Maka kata 'Umar; 'Pergilah kalian dari sini! ' Kata 'Umar selanjutnya; 'Panggil ke sini pemimpin-pemimpin Quraisy yang hijrah sebelum penaklukan Makkah! ' Maka aku memanggil mereka. Ternyata mereka semuanya sependapat, tidak ada perbedaan. Kata mereka; 'Kami berpendapat, sebaiknya Anda pulang saja kembali bersama rombongan Anda dan jangan menghadapkan mereka kepada wabah ini. Lalu 'Umar menyerukan kepada rombongannya; 'Besok pagi-pagi aku akan kembali pulang. Karena itu bersiap-siaplah kalian! ' Abu 'Ubaidah bin Jarrah bertanya; 'Apakah kita hendak lari dari takdir Allah? ' Jawab 'Umar; 'Mengapa kamu bertanya demikian hai Abu 'Ubaidah? Agaknya 'Umar tidak mau berdebat dengannya. Dia menjawab; Ya, kita lari dari takdir Allah kepada takdir Allah. Bagaimana pendapatmu, seandainya engkau mempunyai seekor unta, lalu engkau turun ke lembah yang mempunyai dua sisi. Yang satu subur dan yang lain tandus. Bukanlah jika engkau menggembalakannya di tempat yang subur, engkau menggembala dengan takdir Allah juga, dan jika engkau menggembala di tempat tandus engkau menggembala dengan takdir Allah? ' Tiba-tiba datang ['Abdurrahman bin 'Auf] yang sejak tadi belum hadir karena suatu urusan. Lalu dia berkata; 'Aku mengerti masalah ini. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Apabila kamu mendengar wabah berjangkit di suatu negeri, janganlah kamu datangi negeri itu. Dan apabila wabah itu berjangkit di negeri tempat kamu berada, maka janganlah keluar dari negeri itu karena hendak melarikan diri.' Ibnu 'Abbas berkata; 'Umar bin Khaththab lalu mengucapkan puji syukur kepada Allah, setelah itu dia pergi.' Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi'] dan [Abad bin Humaid], [Ibnu Rafi'] berkata; Telah menceritakan kepada kami, sedangkan yang lainnya berkata; Telah mengabarkan kepada kami [Abdurrazaq] Telah mengabarkan kepada kami [Ma'mar] melalui jalur ini sebagaimana Hadits Malik. Di dalam Hadits Ma'mar ada tambahan Umar berkata; bukankah jika kamu mengembalakan unta di tempat yang tandus dengan meninggalkan tempat yang subur berarti kamu telah membuatnya lemah? Abu Ubaidah menjawab; 'Ya.' Umar berkata; maka berangkatlah! Maka Abu Ubaidah berangkat hingga sampai di Madinah, lalu dia berkata; 'Insya Allah ini adalah tempat tinggal.' Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah bin Yahya] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahab] Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] melalui jalur ini. Hanya saja dia berkata; Sesungguhnya Abdullah bin Al Harits yang menceritakan kepadanya bukan Abdullah bin Abdullah.'"
            },
            {
                "number": 3801,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ أَنَّ عُمَرَ خَرَجَ إِلَى الشَّامِ فَلَمَّا جَاءَ سَرْغَ بَلَغَهُ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّامِفَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا فِرَارًا مِنْهُ فَرَجَعَ عُمَرُ بْنُ الْخَطَّابِ مِنْ سَرْغَوَعَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ إِنَّمَا انْصَرَفَ بِالنَّاسِ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca Hadits [Malik] dari [Ibnu Syihab] dari ['Abdullah bin 'Amir bin Rabi'ah] bahwa \"Pada suatu ketika 'Umar bin Khaththab pergi ke Syam. Setelah sampai di Saragh, dia mendengar bahwa wabah penyakit sedang berjangkit di Syam. Maka 'Abdurrahman bin 'Auf mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Apabila kamu mendengar wabah berjangkit di suatu negeri, maka janganlah kamu datangi negeri itu. Dan apabila wabah itu berjangkit di negeri tempat kamu berada, janganlah kamu keluar dari negeri itu karena hendak melarikan diri darinya.' Maka Umar pun kembali dari Saragh. Dan dari [Ibnu Syihab] dari [Salim bin Abdullah]; bahwa Umar kembali bersama orang-orang setelah mendengar Hadits [Abdurrahman bin Auf]."
            },
            {
                "number": 3802,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى وَاللَّفْظُ لِأَبِي الطَّاهِرِ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ قَالَ ابْنُ شِهَابٍ فَحَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ حِينَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى وَلَا صَفَرَ وَلَا هَامَةَ فَقَالَ أَعْرَابِيٌّ يَا رَسُولَ اللَّهِ فَمَا بَالُ الْإِبِلِ تَكُونُ فِي الرَّمْلِ كَأَنَّهَا الظِّبَاءُ فَيَجِيءُ الْبَعِيرُ الْأَجْرَبُ فَيَدْخُلُ فِيهَا فَيُجْرِبُهَا كُلَّهَا قَالَ فَمَنْ أَعْدَى الْأَوَّلَو حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَحَسَنٌ الْحُلْوَانِيُّ قَالَا حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَغَيْرُهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا طِيَرَةَ وَلَا صَفَرَ وَلَا هَامَةَ فَقَالَ أَعْرَابِيٌّ يَا رَسُولَ اللَّهِ بِمِثْلِ حَدِيثِ يُونُسَ و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سِنَانُ بْنُ أَبِي سِنَانٍ الدُّؤَلِيُّ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى فَقَامَ أَعْرَابِيٌّ فَذَكَرَ بِمِثْلِ حَدِيثِ يُونُسَ وَصَالِحٍ وَعَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي السَّائِبُ بْنُ يَزِيدَ ابْنِ أُخْتِ نَمِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا صَفَرَ وَلَا هَامَةَ",
                "id": "Telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah bin Yahya] dan lafazh ini miliknya Abu Ath Thahir keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus]. [Ibnu Syihab] berkata; Telah menceritakan kepadaku [Abu Salamah bin 'Abdur Rahman] dari [Abu Hurairah]; \"Ketika Rasulullah menyabdakan: 'Tidak ada penyakit yang menular secara sendirian, tidak ada Shafar (kematian di karenakan penyakit cacing perut) yang terjadi dengan sendirinya, dan tidak ada hantu yang gentayangan, maka seorang 'Arab dusun bertanya; 'Ya, Rasulullah! Bagaimana seandainya sekelompok unta yang sehat di padang pasir, kemudian didatangi oleh seekor unta kudisan, kemudian unta yang sehat itu kudisan pula semuanya? ' Jawab Rasulullah shallallahu 'alaihi wasallam, 'Siapakah penular yang pertama-tama? ' Dan telah menceritakan kepadaku [Muhammad bin Hatim] dan [Hasan Al Hulwani] keduanya berkata; Telah menceritakan kepada kami [Ya'qub] yaitu Ibnu Ibrahim bin Sa'ad Telah menceritakan kepada kami [Bapakku] dari [Shalih] dari [Ibnu Syihab] Telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] dan yang lainnya, bahwa [Abu Hurairah] berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Tidak ada penyakit yang menular secara sendirian, tidak ada Shafar (kematian di karenakan penyakit cacing perut) yang terjadi secara sendirian,, dan tidak ada hantu yang gentayangan, maka seorang 'Arab dusun bertanya; 'Ya, Rasulullah! -dan seterusnya seperti Hadits Yunus.- Dan telah menceritakan kepadaku ['Abdullah bin 'Abdur Rahman Ad Darimi]; Telah mengabarkan kepada kami [Abul Yaman] dari [Syu'aib] dari [Az Zuhri]; Telah mengabarkan kepadaku [Sinan bin Abu Sinan Ad Duali] bahwa [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: -sebagaimana Hadits Yunus dan Shalih- Dan dari [Syu'aib] dari [Az Zuhri] dia berkata; Telah menceritakan kepadaku [As Saib bin Yazid bin Ukhti Namir] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada penyakit yang menular secara sendirian, tidak ada Shafar (kematian di karenakan penyakit cacing perut) yang terjadi dengan sendirinya,, dan tidak ada hantu yang gentayangan.\""
            },
            {
                "number": 3803,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ وَتَقَارَبَا فِي اللَّفْظِ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَيُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُورِدُ مُمْرِضٌ عَلَى مُصِحٍّ قَالَ أَبُو سَلَمَةَ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُهُمَا كِلْتَيْهِمَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ صَمَتَ أَبُو هُرَيْرَةَ بَعْدَ ذَلِكَ عَنْ قَوْلِهِ لَا عَدْوَى وَأَقَامَ عَلَى أَنْ لَا يُورِدُ مُمْرِضٌ عَلَى مُصِحٍّقَالَ فَقَالَ الْحَارِثُ بْنُ أَبِي ذُبَابٍ وَهُوَ ابْنُ عَمِّ أَبِي هُرَيْرَةَ قَدْ كُنْتُ أَسْمَعُكَ يَا أَبَا هُرَيْرَةَ تُحَدِّثُنَا مَعَ هَذَا الْحَدِيثِ حَدِيثًا آخَرَ قَدْ سَكَتَّ عَنْهُ كُنْتَ تَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى فَأَبَى أَبُو هُرَيْرَةَ أَنْ يَعْرِفَ ذَلِكَ وَقَالَ لَا يُورِدُ مُمْرِضٌ عَلَى مُصِحٍّ فَمَا رَآهُ الْحَارِثُ فِي ذَلِكَ حَتَّى غَضِبَ أَبُو هُرَيْرَةَ فَرَطَنَ بِالْحَبَشِيَّةِ فَقَالَ لِلْحَارِثِ أَتَدْرِي مَاذَا قُلْتُ قَالَ لَا قَالَ أَبُو هُرَيْرَةَ قُلْتُ أَبَيْتُ قَالَ أَبُو سَلَمَةَ وَلَعَمْرِي لَقَدْ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى فَلَا أَدْرِي أَنَسِيَ أَبُو هُرَيْرَةَ أَوْ نَسَخَ أَحَدُ الْقَوْلَيْنِ الْآخَرَ حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ وَحَسَنٌ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ حَدَّثَنِي و قَالَ الْآخَرَانِ حَدَّثَنَا يَعْقُوبُ يَعْنُونَ ابْنَ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَيُحَدِّثُ مَعَ ذَلِكَ لَا يُورِدُ الْمُمْرِضُ عَلَى الْمُصِحِّ بِمِثْلِ حَدِيثِ يُونُسَ حَدَّثَنَاه عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah] dan lafazh keduanya tidak jauh berbeda. Keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] bahwa [Abu Salamah bin 'Abdur Rahman bin 'Auf] Telah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak ada penyakit yang menular secara sendirian.' Dan dia juga menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda juga: 'Yang sakit jangan mendekat kepada yang sehat! ' Abu Salamah berkata; ' [Abu Hurairah] menceritakan kedua Hadits tersebut dari Rasulullah shallallahu 'alaihi wasallam. Kemudian setelah itu Abu Hurairah diam dari sabda Rasulullah tentang; 'Tidak ada penyakit yang menular secara sendirian.' Dia memegang Hadits; 'Yang sakit tidak boleh mendekat kepada yang sehat.' Perawi berkata; Al Harits bin Abu Dzubab yaitu sepupu Abu Hurairah berkata; 'Aku mendengar darimu wahai Abu Hurairah anda menyampaikan Hadits ini dengan Hadits yang lain, namun kemudian anda diam tentang Hadits tersebut. Anda telah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak ada penyakit yang menular secara sendirian.' Namun Abu Hurairah menolak hal itu, dan dia berkata; 'Yang sakit tidak boleh mendekati yang sehat.' Tapi Al Harits tetap tidak menerima hal itu hingga Abu Hurairah marah dan berkata dengan logat Habasy, dia berkata kepada Al Harits; 'Apakah kamu tidak tahu apa yang telah ku katakan? ' Al Harits menjawab; 'Tidak.' Abu Hurairah berkata; 'Aku tidak mengatakannya.' Abu Salamah berkata; 'Sungguh Abu Hurairah telah menceritakan kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak ada penyakit yang menular secara sendirian.' Namun aku tidak tahu apakah Abu Hurairah lupa atau dia telah menasakh (menghapus) salah satu perkataannya. Telah menceritakan kepadaku [Muhammad bin Hatim] dan [Hasan Al Hulwani] serta [Abad bin Humaid]. [Abad] berkata; Telah menceritakan kepadaku. Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Ya'qub] yakni Ibnu Ibrahim Sa'd; Telah menceritakan kepadaku [Bapakku] dari [Shalih] dari [Ibnu Syihab]; Telah mengabarkan kepadaku [Abu Salamah bin 'Abdur Rahman] dia mendengar [Abu Hurairah] berkata; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak ada penyakit yang menular secara sendirian.' Juga bersabda; 'Yang sehat janganlah mendekati yang sakit.' Sebagaimana Hadits Yunus. Dan telah menceritakannya kepada kami ['Abdullah bin 'Abdur Rahman Ad Darimi]; Telah mengabarkan kepada kami [Abul Yaman]; Telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] melalui jalur ini dengan Hadits yang serupa."
            },
            {
                "number": 3804,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا هَامَةَ وَلَا نَوْءَ وَلَا صَفَرَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] serta [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Ja'far dari [Al 'Ala] dari [Bapaknya] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada penyakit yang menular secara sendirian tanpa izin Allah, tidak ada mayat yang bergentayangan, tidak ada bintang tertentu (penyebab turunnya hujan) dan tidak ada kematian di karenakan penyakit cacing perut."
            },
            {
                "number": 3805,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى وَلَا طِيَرَةَ وَلَا غُولَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus]; Telah menceritakan kepada kami [Zuhair]; Telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Az Zubair] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Tidak ada penyakit yang menular secara sendirian, tidak ada pengaruh atau tanda bahaya karena suara burung, dan tidak ada hantu.\""
            },
            {
                "number": 3806,
                "arab": "و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمِ بْنِ حَيَّانَ حَدَّثَنَا بَهْزٌ حَدَّثَنَا يَزِيدُ وَهُوَ التُّسْتَرِيُّ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى وَلَا غُولَ وَلَا صَفَرَ",
                "id": "Dan telah menceritakan kepadaku ['Abdullah bin Hasyim bin Hayyan]; Telah menceritakan kepada kami [Bahza]; Telah menceritakan kepada kami [Yazid] yaitu At Tustari; Telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada penyakit yang menular secara sendirian tanpa izin Allah, tidak ada hantu bergentayangan dan tidak ada shafar (penyakit perut) yang terjadi dengan sendirinya.\""
            },
            {
                "number": 3807,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا عَدْوَى وَلَا صَفَرَ وَلَا غُولَوَسَمِعْتُ أَبَا الزُّبَيْرِ يَذْكُرُ أَنَّ جَابِرًا فَسَّرَ لَهُمْ قَوْلَهُ وَلَا صَفَرَ فَقَالَ أَبُو الزُّبَيْرِ الصَّفَرُ الْبَطْنُ فَقِيلَ لِجَابِرٍ كَيْفَ قَالَ كَانَ يُقَالُ دَوَابُّ الْبَطْنِ قَالَ وَلَمْ يُفَسِّرْ الْغُولَ قَالَ أَبُو الزُّبَيْرِ هَذِهِ الْغُولُ الَّتِي تَغَوَّلُ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim]; Telah menceritakan kepada kami [Rauh bin 'Ubadah]; Telah menceritakan kepada kami [Ibnu Juraij]; Telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin 'Abdullah] berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada penyakit yang menular secara sendirian tanpa izin Allah, tidak ada pengaruh atau tanda bahaya suara burung, dan tidak ada hantu.\" Dan Aku mendengar Abu Zubair menyebutkan bahwa Jabir menjelaskan mengenai sabda Nabi shallallahu 'alaihi wasallam 'Wala Shafara'. Abu Zubair bertanya kepada Jabir; 'As Shafar adalah penyakit perut, ' maksudnya penyakit apa itu? Dia menjawab; 'yaitu binatang melata yang ada diperut (cacing). Ibnu Zubair berkata apakah Jabir tidak menjelaskan juga mengenai 'Al Ghaul'? Abu Zubair menjawab; 'Al Ghaul yang dimaksudkan adalah sesuatu yang bisa mempengarungi perasaan."
            },
            {
                "number": 3808,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا طِيَرَةَ وَخَيْرُهَا الْفَأْلُ قِيلَ يَا رَسُولَ اللَّهِ وَمَا الْفَأْلُ قَالَ الْكَلِمَةُ الصَّالِحَةُ يَسْمَعُهَا أَحَدُكُمْو حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ ح و حَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ كِلَاهُمَا عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَفِي حَدِيثِ عُقَيْلٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ سَمِعْتُ وَفِي حَدِيثِ شُعَيْبٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا قَالَ مَعْمَرٌ",
                "id": "Dan telah menceritakan kepada kami ['Abd bin Humaid]; Telah menceritakan kepada kami ['Abdur Razaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['ubaidhullah bin 'Abdillah bin 'Utbah] bahwa [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada pengaruh jahat karena burung. Dan yang paling baik adalah Al Fa'l. Lalu beliau ditanya; 'Apa itu Al Fa'l, Ya Rasulullah? ' Jawab beliau; 'Kalimah shalihah (baik) yang di dengar oleh salah seorang di antara kalian.' Telah menceritakan kepadaku [Abdul Malik bin Syu'aib bin Laits] Telah menceritakan kepadaku [Bapakku] dari [Kakekku], Telah menceritakan kepadaku [Uqail bin Khalid] Demikian juga diriwayatkan dari jalur lainnya, dan Telah menceritakannya kepadaku [Abdullah bin Abdurrahman Ad Darimi] Telah mengabarkan kepada kami [Abu Al Yaman] Telah mengabarkan kepada kami [Syu'aib] keduanya dari [Az Zuhri] melalui jalur ini dengan Hadits yang serupa. Dan di dalam Hadits 'Uqail dari Rasulullah shallallahu 'alaihi wasallam, namun dia tidak menyebutkan 'Aku mendengar dari.' Dan di dalam Hadits Syu'aib dia berkata; 'Aku mendengar Nabi shallallahu 'alaihi wasallam' sebagaimana Hadits Ma'mar."
            },
            {
                "number": 3809,
                "arab": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا طِيَرَةَ وَيُعْجِبُنِي الْفَأْلُ الْكَلِمَةُ الْحَسَنَةُ الْكَلِمَةُ الطَّيِّبَةُ",
                "id": "Telah menceritakan kepada kami [Haddab bin Khalid]; Telah menceritakan kepada kami [Hammam bin Yahya]; Telah menceritakan kepada kami [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak penyakit menular tanpa izin Allah, tidak ada pengaruh dikarenakan seekor burung, Tetapi yang mengagumkanku ialah Al Fa'l, yaitu kalimah hasanah atau kalimat thayyibah.\""
            },
            {
                "number": 3810,
                "arab": "و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا طِيَرَةَ وَيُعْجِبُنِي الْفَأْلُ قَالَ قِيلَ وَمَا الْفَأْلُ قَالَ الْكَلِمَةُ الطَّيِّبَةُ",
                "id": "Dan telah menceritakannya kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] keduanya berkata; Telah mengabarkan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] Aku mendengar [Qatadah] bercerita dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam dia berkata; \"Tidak ada penyakit menular tanpa izin Allah, tidak ada pengaruh jahat karena burung. Dan yang paling baik adalah Al Fa'l. lalu beliau ditanya; 'Apa itu Al Fa'l ya Rasulullah? ' Jawab beliau: 'Yaitu kalimat thayyibah.\""
            },
            {
                "number": 3811,
                "arab": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنِي مُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ حَدَّثَنَا يَحْيَى بْنُ عَتِيقٍ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى وَلَا طِيَرَةَ وَأُحِبُّ الْفَأْلَ الصَّالِحَ",
                "id": "Dan telah menceritakan kepadaku [Hajjaj bin Asy Sya'ir]; Telah menceritakan kepadaku [Mu'alla bin Asad]; Telah menceritakan kepada kami ['Abdul 'Aziz bin Mukhtar]; Telah menceritakan kepada kami [Yahya bin 'Atiq]; Telah menceritakan kepada kami [Muhammad bin Sirin] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada penyakit yang menular secara sendirian penyakit tanpa izin Allah, dan tidak ada pengaruh buruk karena burung, dan aku menyukai al Fa'l (kalimat yang baik).\""
            },
            {
                "number": 3812,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى وَلَا هَامَةَ وَلَا طِيَرَةَ وَأُحِبُّ الْفَأْلَ الصَّالِحَ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Yazid bin Harun]; Telah mengabarkan kepada kami [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Abu Hurairah] dia berkata; Nabi shallallahu 'alaihi wasallam: \"Tidak ada penyakit yang menular secara sendirian penyakit tanpa izin Allah, tidak ada mayat yang bergentayangan, tidak ada pengaruh buruk di sebabkan seekor burung, dan aku menyukai Al Fa'l (kalimat yang baik).\""
            },
            {
                "number": 3813,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ حَمْزَةَ وَسَالِمٍ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشُّؤْمُ فِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ",
                "id": "Dan telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Telah menceritakan kepada kami [Malik bin Anas]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; Aku membaca atas [Malik] dari [Ibnu Syihab] dari [Hamzah] dan [Salim Ibnu 'Abdullah bin 'Umar] dari ['Abdullah bin 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: Terkadang pengaruh jahat (kecelakaan atau kesialan) itu terdapat pada tiga perkara: \"Di dalam rumah tangga, dalam diri wanita, dan pada kuda.\""
            },
            {
                "number": 3814,
                "arab": "و حَدَّثَنَا أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ حَمْزَةَ وَسَالِمٍ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا طِيَرَةَ وَإِنَّمَا الشُّؤْمُ فِي ثَلَاثَةٍ الْمَرْأَةِ وَالْفَرَسِ وَالدَّارِو حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ وَحَمْزَةَ ابْنَيْ عَبْدِ اللَّهِ عَنْ أَبِيهِمَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ وَحَمْزَةَ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ ح و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ ح و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ كُلُّهُمْ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الشُّؤْمِ بِمِثْلِ حَدِيثِ مَالِكٍ لَا يَذْكُرُ أَحَدٌ مِنْهُمْ فِي حَدِيثِ ابْنِ عُمَرَ الْعَدْوَى وَالطِّيَرَةَ غَيْرُ يُونُسَ بْنِ يَزِيدَ",
                "id": "Dan telah menceritakan kepada kami [Abu Ath Thahir] dan [Harmalah bin Yahya] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Hamzah] dan [Salim] -kedua anak- ['Abdullah bin 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada penyakit yang menular secara sendirian, tidak ada pengaruh atau alamat jahat pada suara burung. Dan adakalanya pengaruh jahat (kecelakaan atau kesialan) itu terdapat pada tiga perkara: 'Dalam diri wanita, pada kuda, dan dalam rumah tangga.\" Dan telah menceritakan kepada kami [Ibnu Abu 'Umar]; Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dan [Hamzah] -kedua anak- 'Abdullah bin Umar dari [Bapak mereka berdua] dari Nabi shallallahu 'alaihi wasallam; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Yahya bin Yahya] dan ['Amru bin An Naqid] dan [Az Zuhair bin Harb] dari [Sufyan] dari [Az Zuhri] dari [Salim] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Amru An Naqid]; Telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd]; Telah menceritakan kepada kami [Bapakku] dari [Shalih] dari [Ibnu Syihab] dari [Salim] dan [Hamzah] -kedua anak- 'Abdullah bin 'Umar dari ['Abdullah bin 'Umar] dari Nabi shallallahu 'alaihi wasallam; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku ['Abdul Malik bin Syu'aib bin Al Laits bin Sa'd]; Telah menceritakan kepadaku [Bapakku] dari [Kakekku]; Telah menceritakan kepadaku ['Uqail bin Khalid]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakannya kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Bisyr Al Mufadhdhal] dari ['Abdur Rahman bin Ishaq]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku ['Abdullah bin 'Abdur Rahman Ad Darimi]; Telah mengabarkan kepada kami [Abul Yaman]; Telah mengabarkan kepada kami [Syu'aib] seluruhnya dari [Az Zuhri] dari [Salim] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam mengenai 'kesialan.' Sebagaimana Hadits Malik. Mereka semua tidak menyebutkan tentang 'penularan dan Tathayyur' di dalam Hadits Ibnu Umar kecuali Yunus bin Yazid saja."
            },
            {
                "number": 3815,
                "arab": "و حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ زَيْدٍ أَنَّهُ سَمِعَ أَبَاهُ يُحَدِّثُ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنْ يَكُنْ مِنْ الشُّؤْمِ شَيْءٌ حَقٌّ فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالدَّارِو حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَلَمْ يَقُلْ حَقٌّ",
                "id": "Dan telah menceritakan kepada kami [Ahmad bin 'Abdullah bin Al Hakam]; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dari ['Umar bin Muhammad bin Zaid] bahwa dia mendengar [Bapaknya] bercerita; dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Kalau memang pengaruh jahat (kecelakaan atau kesialan) benar maka yang pasti hal itu kadang terjadi pada pada kuda, dalam diri wanita dan dalam rumah tangga.\" Dan Telah menceritakan kepadaku [Harun bin Abdullah] Telah menceritakan kepada kami [Rauh bin Ubadah] Telah menceritakan kepada kami [Syu'bah] melalui jalur ini dengan Hadits yang serupa. Namun dia tidak menyebutkan lafazh 'Haqqun' (benar)."
            },
            {
                "number": 3816,
                "arab": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكٌ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَ فَفِي الْمَرْأَةِ وَالْفَرَسِ وَالْمَسْكَنِ يَعْنِي الشُّؤْمَو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Dan telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab]; Telah menceritakan kepada kami [Malik] dari [Abu Hazim] dari [Sahl bin Sa'd] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau memang pengaruh jahat (kecelakaan atau kesialan) benar maka yang pasti hal itu kadang terjadi pada pada diri wanita, pada kuda dan dalam rumah tangga.\" Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Al Fadhl bin Dukain]; Telah menceritakan kepada kami [Hisyam bin Sa'd] dari [Abu Hazim] dari [Sahl bin Sa'd] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa."
            },
            {
                "number": 3817,
                "arab": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يُخْبِرُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ كَانَ فِي شَيْءٍ فَفِي الرَّبْعِ وَالْخَادِمِ وَالْفَرَسِ",
                "id": "Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim Al Handzali]; Telah mengabarkan kepada kami ['Abdullah bin Al Harits] dari [Ibnu Juraij]; Telah mengabarkan kepadaku [Abu Az Zubair] bahwa Aku mendengar; [Jabir] mengabarkan dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Kalau memang pengaruh jahat (kecelakaan atau kesialan) benar maka yang pasti hal itu kadang terjadi dalam rumah tangga, pada pembantu, dan pada kuda.\""
            },
            {
                "number": 3818,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أُمُورًا كُنَّا نَصْنَعُهَا فِي الْجَاهِلِيَّةِ كُنَّا نَأْتِي الْكُهَّانَ قَالَ فَلَا تَأْتُوا الْكُهَّانَ قَالَ قُلْتُ كُنَّا نَتَطَيَّرُ قَالَ ذَاكَ شَيْءٌ يَجِدُهُ أَحَدُكُمْ فِي نَفْسِهِ فَلَا يَصُدَّنَّكُمْو حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنِي حُجَيْنٌ يَعْنِي ابْنَ الْمُثَنَّى حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ أَخْبَرَنَا إِسْحَقُ بْنُ عِيسَى أَخْبَرَنَا مَالِكٌ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَ مَعْنَى حَدِيثِ يُونُسَ غَيْرَ أَنَّ مَالِكًا فِي حَدِيثِهِ ذَكَرَ الطِّيَرَةَ وَلَيْسَ فِيهِ ذِكْرُ الْكُهَّانِ و حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ عُلَيَّةَ عَنْ حَجَّاجٍ الصَّوَّافِ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَوْزَاعِيُّ كِلَاهُمَا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ مُعَاوِيَةَ وَزَادَ فِي حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ قُلْتُ وَمِنَّا رِجَالٌ يَخُطُّونَ قَالَ كَانَ نَبِيٌّ مِنْ الْأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطَّهُ فَذَاكَ",
                "id": "Telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah bin Yahya] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb] Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Abu Salamah bin 'Abdur Rahman bin 'Auf] dari [Mu'awiyah bin Al Hakam As Sulami] dia berkata; \"Aku pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam; 'Ya, Rasulullah! Ada beberapa perkara yang kami lakukan pada masa jahiliyah, di antaranya kami biasa mendatangi tukang tenung, Bagaimana itu?\" Jawab beliau: 'Jangan! Jangan datangi lagi tukang tenung itu.' Mu'awiyah bertanya lagi; 'Kami juga percaya kepada suara burung sebagai pertanda jahat atau baik. Rasulullah shallallahu 'alaihi wasallam menjawab: 'Yang demikian itu hanyalah dugaan belaka. Maka janganlah hal itu sampai menghalangi urusanmu.' Dan telah menceritakan kepadaku [Muhammad bin Rafi']; Telah menceritakan kepadaku [Hujain] yaitu Ibnu Al Mutsanna; Telah menceritakan kepada kami [Al Laits] dari ['Uqail]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan ['Abad bin Humaid] keduanya berkata; Telah mengabarkan kepada kami ['Abdur Razaq]; Telah mengabarkan kepada kami [Ma'mar]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Syababah bin Sawwar]; Telah menceritakan kepada kami [Ibnu Abu Dzi'b]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Muhammad bin Rafi']; Telah mengabarkan kepada kami [Ishaq bin 'Isa]; Telah mengabarkan kepada kami [Malik] seluruhnya dari [Az Zuhri] melalui jalur ini, yang serupa dengan makna Hadits Yunus. Kecuali Malik, dia menyebutkan di dalam Haditsnya tentang Tathayyur (burung) dan tidak menyebutkan tentang tukang tenung. Dan telah menceritakan kepada kami [Muhammad bin Ash Shabbah] dan [Abu Bakr bin Abu Syaibah] keduanya berkata; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu 'Ulayyah dari [Hajjaj Ash Shawwaf]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Isa bin Yunus]; Telah menceritakan kepada kami [Al Auza'i] keduanya dari [Yahya bin Abu Katsir] dari [Hilal bin Abu Maimunah] dari ['Atha bin Yasar] dari [Mu'awiyah bin Al Hakam As Sulami] dari Nabi shallallahu 'alaihi wasallam yang semakna dengan Hadits Az Zuhri dari Abu Salamah dari Mu'awiyah. Dan di dalam Hadits Yahya bin Abu Katsir ada tambahan, dia berkata; Dan di antara kami ada beberapa orang yang biasa membuat garis untuk mengetahui sesuatu? Rasulullah Shallalahu 'alaihi wa sallam bersabda: \"Dulu juga ada seorang nabi yang membuat garis, barangsiapa yang garisnya sama dengan garis itu maka itulah yang benar.\""
            },
            {
                "number": 3819,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ يَحْيَى بْنِ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ الْكُهَّانَ كَانُوا يُحَدِّثُونَنَا بِالشَّيْءِ فَنَجِدُهُ حَقًّا قَالَ تِلْكَ الْكَلِمَةُ الْحَقُّ يَخْطَفُهَا الْجِنِّيُّ فَيَقْذِفُهَا فِي أُذُنِ وَلِيِّهِ وَيَزِيدُ فِيهَا مِائَةَ كَذْبَةٍ",
                "id": "Dan telah menceritakan kepada kami ['Abdu bin Humaid]; Telah mengabarkan kepada kami ['Abdur Razaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Yahya bin 'Urwah bin Az Zubair] dari [Bapaknya] dari ['Aisyah] dia berkata; \"Aku pernah bercerita kepada Rasulullah shallallahu 'alaihi wasallam, bahwa para tukang tenung berkata begini dan begitu dan kadang kami lihat kenyataannya memang benar.\" Sabda Nabi shallallahu 'alaihi wasallam: \"Kata-kata yang benar itu ditangkap oleh bangsa jin, lalu dibisikkannya ke telinga tukang tenung dan ditambahkan ke dalamnya dengan seratus kedustaan.\""
            },
            {
                "number": 3820,
                "arab": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ وَهُوَ ابْنُ عُبَيْدِ اللَّهِ عَنْ الزُّهْرِيِّ أَخْبَرَنِي يَحْيَى بْنُ عُرْوَةَ أَنَّهُ سَمِعَ عُرْوَةَ يَقُولُ قَالَتْ عَائِشَةُسَأَلَ أُنَاسٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْكُهَّانِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسُوا بِشَيْءٍ قَالُوا يَا رَسُولَ اللَّهِ فَإِنَّهُمْ يُحَدِّثُونَ أَحْيَانًا الشَّيْءَ يَكُونُ حَقًّا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ الْكَلِمَةُ مِنْ الْجِنِّ يَخْطَفُهَا الْجِنِّيُّ فَيَقُرُّهَا فِي أُذُنِ وَلِيِّهِ قَرَّ الدَّجَاجَةِ فَيَخْلِطُونَ فِيهَا أَكْثَرَ مِنْ مِائَةِ كَذْبَةٍو حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عَمْرٍو عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ شِهَابٍ بِهَذَا الْإِسْنَادِ نَحْوَ رِوَايَةِ مَعْقِلٍ عَنْ الزُّهْرِيِّ",
                "id": "Telah menceritakan kepadaku [Salamah bin Syabib]; Telah menceritakan kepada kami [Al Hasan bin A'yan]; Telah menceritakan kepada kami [Ma'qil] yaitu 'ubaidhullah dari [Az Zuhri]; Telah mengabarkan kepadaku [Yahya bin 'Urwah] bahwa dia mendengar ['Urwah] berkata; ['Aisyah] berkata; \"sekelompok orang bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang praktek tukang tenung. Lalu beliau menjawab menjawab: 'Mereka itu tidak benar! ' Mereka bertanya lagi; 'Ya Rasulullah Kadang-kadang apa yang mereka katakan itu memang benar terjadi. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Adapun perkataan yang nyata (benar) itu adalah perkataan yang dicuri oleh jin, kemudian ia memperdengarkannya di telinga walinya sebagaimana ia seekor ayam mendengkur, lalu mereka mencampur adukkan isinya lebih dari seratus kebohongan.\" Dan telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku [Muhammad bin 'Amru] dari [Ibnu Juraij] dari [Ibnu Syihab] melalui jalur ini yang serupa dengan riwayat Ma'qil dari Az Zuhri."
            },
            {
                "number": 3821,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ حَسَنٌ حَدَّثَنَا يَعْقُوبُ وَقَالَ عَبْدٌ حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَ أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْأَنْصَارِأَنَّهُمْ بَيْنَمَا هُمْ جُلُوسٌ لَيْلَةً مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُمِيَ بِنَجْمٍ فَاسْتَنَارَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاذَا كُنْتُمْ تَقُولُونَ فِي الْجَاهِلِيَّةِ إِذَا رُمِيَ بِمِثْلِ هَذَا قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ كُنَّا نَقُولُ وُلِدَ اللَّيْلَةَ رَجُلٌ عَظِيمٌ وَمَاتَ رَجُلٌ عَظِيمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّهَا لَا يُرْمَى بِهَا لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنْ رَبُّنَا تَبَارَكَ وَتَعَالَى اسْمُهُ إِذَا قَضَى أَمْرًا سَبَّحَ حَمَلَةُ الْعَرْشِ ثُمَّ سَبَّحَ أَهْلُ السَّمَاءِ الَّذِينَ يَلُونَهُمْ حَتَّى يَبْلُغَ التَّسْبِيحُ أَهْلَ هَذِهِ السَّمَاءِ الدُّنْيَا ثُمَّ قَالَ الَّذِينَ يَلُونَ حَمَلَةَ الْعَرْشِ لِحَمَلَةِ الْعَرْشِ مَاذَا قَالَ رَبُّكُمْ فَيُخْبِرُونَهُمْ مَاذَا قَالَ قَالَ فَيَسْتَخْبِرُ بَعْضُ أَهْلِ السَّمَاوَاتِ بَعْضًا حَتَّى يَبْلُغَ الْخَبَرُ هَذِهِ السَّمَاءَ الدُّنْيَا فَتَخْطَفُ الْجِنُّ السَّمْعَ فَيَقْذِفُونَ إِلَى أَوْلِيَائِهِمْ وَيُرْمَوْنَ بِهِ فَمَا جَاءُوا بِهِ عَلَى وَجْهِهِ فَهُوَ حَقٌّ وَلَكِنَّهُمْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَو حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبُو عَمْرٍو الْأَوْزَاعِيُّ ح و حَدَّثَنَا أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ يَعْنِي ابْنَ عُبَيْدِ اللَّهِ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ يُونُسَ قَالَ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَخْبَرَنِي رِجَالٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْأَنْصَارِ وَفِي حَدِيثِ الْأَوْزَاعِيِّ وَلَكِنْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ وَفِي حَدِيثِ يُونُسَ وَلَكِنَّهُمْ يَرْقَوْنَ فِيهِ وَيَزِيدُونَ وَزَادَ فِي حَدِيثِ يُونُسَ وَقَالَ اللَّهُ{ حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ }وَفِي حَدِيثِ مَعْقِلٍ كَمَا قَالَ الْأَوْزَاعِيُّ وَلَكِنَّهُمْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ",
                "id": "Telah menceritakan kepada kami [Hasan bin 'Ali Al Hulwani] dan ['Abad bin Humaid]. [Hasan] berkata; Telah menceritakan kepada kami [Ya'qub]. Dan ['Abad] berkata; Telah menceritakan kepadaku [Ya'qub bin Ibrahim bin Sa'd]; Telah menceritakan kepada kami [Bapakku] dari [Shalih] dari [Ibnu Syihab]; Telah menceritakan kepadaku ['Ali bin Husain] bahwa ['Abdullah bin 'Abbas] berkata; \"Seorang sahabat Nabi shallallahu 'alaihi wasallam dari kalangan Anshar bercerita kepadaku; bahwa pada suatu malam ketika mereka sedang duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba mereka dijatuhi bintang (meteor) yang bersinar. Maka Rasulullah shallallahu 'alaihi wasallam bertanya kepada mereka: 'Apa yang kalian katakan pada masa jahiliyah apabila dijatuhi bintang seperti ini? ' Jawab mereka; 'Allah dan Rasul-Nya yang lebih tahu. Dahulu kami berkomentar; 'Malam ini telah lahir orang yang besar dan telah meninggal orang yang besar pula.' Maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya bintang (meteor) itu tidak jatuh karena meninggalnya seseorang dan tidak pula karena lahirnya seseorang. Tetapi Rabb kita, yang nama-Nya penuh berkah dan Maha Tinggi, apabila Dia memutuskan suatu urusan, maka bertasbihlah pemikul 'Arasy, kemudian bertasbih pula penduduk langit setelah mereka, sehingga tasbih mereka terdengar pula oleh penduduk langit dunia ini. Kemudian orang-orang yang dekat pemikul 'Arasy berkata kepada mereka; 'Apa yang telah difirmankan Rabb kalian? ' Lalu mereka ceritakan apa yang telah difirmankan Allah. Maka penduduk langit yang lainnya pun saling mencari kabar tersebut sesama mereka, sehingga berita itu sampai pula kepada penduduk langit dunia ini. Berita itu tertangkap oleh bangsa jin, lalu dibisikkannya kepada pemimpin-pemimpin mereka, tetapi mereka dilempar karenanya. Maka apa yang disampaikannya menurut berita yang sebenarnya, itu benar. Tetapi biasanya mereka bohong dan beritanya mereka tambah-tambah.' Dan telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Al Walid bin Muslim]; Telah menceritakan kepada kami [Abu 'Amru Al Auza'i]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Ath Thahir] dan [Harmalah] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Salamah bin Syabib]; Telah menceritakan kepada kami [Al Hasan bin A'yan]; Telah menceritakan kepada kami [Ma'qil] yaitu Ibnu 'Ubaidillah seluruhnya dari [Az Zuhri] melalui jalur ini. Kecuali Yunus berkata; dari 'Abdullah bin 'Abbas; Telah mengabarkan kepadaku beberapa sahabat Rasulullah shallallahu 'alaihi wasallam dari kalangan Anshar. Dan di dalam Hadits Al Auza'i di sebutkan; 'Akan tetapi mereka berbohong dan menambah-nambahi beritanya.' Sedangkan di dalam Hadits Yunus dengan menggunakan lafazh 'Wa laakinnahum' (tetapi mereka). Juga ada tambahan; Allah Ta'ala berfirman; \"Sehingga apabila telah dihilangkan ketakutan dari hati mereka, mereka berkata; 'Apakah yang telah di firmankan oleh Tuhanmu? Mereka menjawab; 'Perkataan yang benar.' Adapun di dalam Hadits Ma'qil, 'sama dengan Hadits Yunus.' sebagaimana dikatakan oleh Al Auza'i."
            },
            {
                "number": 3822,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ صَفِيَّةَ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَتَى عَرَّافًا فَسَأَلَهُ عَنْ شَيْءٍ لَمْ تُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ لَيْلَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna Al 'Anazi]; Telah menceritakan kepada kami [Yahya] yaitu Ibnu Sa'id dari ['Ubaidillah] dari [Nafi'] dari [Shafiyyah] dari [sebagian para isteri] Nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa mendatangi tukang tenung lalu dia bertanya kepadanya tentang suatu hal, maka sholatnya tidak akan diterima selama empat puluh malam.\""
            },
            {
                "number": 3823,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ وَهُشَيْمُ بْنُ بَشِيرٍ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَكَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا قَدْ بَايَعْنَاكَ فَارْجِعْ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Husyaim]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Syarik bin 'Abdillah] dan [Husyaim bin Basyir] dari [Ya'la bin 'Atha] dari ['Amru bin Asy Syarid] dari [Bapaknya] dia berkata; \"Dalam delegasi Tsaqif (yang akan Dibai'at Rasulullah shallallahu 'alaihi wasallam) terdapat seorang laki-laki berpenyakit kusta. Maka Rasulullah shallallahu 'alaihi wasallam mengirim seorang utusan supaya mengatakan kepadanya: \"Kami telah menerima bai'at Anda. Karena itu Anda boleh pulang.\""
            },
            {
                "number": 3824,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَابْنُ نُمَيْرٍ عَنْ هِشَامٍ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ ذِي الطُّفْيَتَيْنِ فَإِنَّهُ يَلْتَمِسُ الْبَصَرَ وَيُصِيبُ الْحَبَلَو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ أَخْبَرَنَا هِشَامٌ بِهَذَا الْإِسْنَادِ وَقَالَ الْأَبْتَرُ وَذُو الطُّفْيَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami ['Abdah bin Sulaiman] dan [Ibnu Numair] dari [Hisyam]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami; [Abu Kuraib] Telah menceritakan kepada kami [Abdah] Telah menceritakan kepada kami [Hisyam] dari [Bapakknya] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan supaya membunuh ular bergaris dua putih di punggungnya, karena ular itu dapat membutakan mata dan mencelakakan kandungan perempuan yang hamil.\" Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim] Telah mengabarkan kepada kami [Abu Mu'awiyah] Telah mengabarkan kepada kami [Hisyam] melalui jalur ini namun dia menggunakan lafazh 'Abtar' (putus ekornya) dan 'dzu At Tufyatain (bergaris dua putih di punggungnya).'"
            },
            {
                "number": 3825,
                "arab": "و حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتُلُوا الْحَيَّاتِ وَذَا الطُّفْيَتَيْنِ وَالْأَبْتَرَ فَإِنَّهُمَا يَسْتَسْقِطَانِ الْحَبَلَ وَيَلْتَمِسَانِ الْبَصَرَقَالَ فَكَانَ ابْنُ عُمَرَ يَقْتُلُ كُلَّ حَيَّةٍ وَجَدَهَا فَأَبْصَرَهُ أَبُو لُبَابَةَ بْنُ عَبْدِ الْمُنْذِرِ أَوْ زَيْدُ بْنُ الْخَطَّابِ وَهُوَ يُطَارِدُ حَيَّةً فَقَالَ إِنَّهُ قَدْ نُهِيَ عَنْ ذَوَاتِ الْبُيُوتِ",
                "id": "Dan telah menceritakan kepadaku ['Amru bin Muhammad An Naqid]; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Salim] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Bunuhlah semua ular, terutama ular bergaris dua putih di punggungnya dan yang putus ekornya, karena keduanya dapat menggugurkan kandungan perempuan hamil dan membutakan mata.\" Kata Salim; 'Karena itu [Ibnu 'Umar] membunuh setiap ular yang ditemuinya. Pada suatu ketika [Abu Lubabah bin 'Abdul Mundzir] atau [Zaid bin Khaththab] melihatnya sedang mengejar ular hendak dibunuhnya. Abu Lubabah berkata; 'Sesungguhnya telah dilarang oleh Rasulullah shallallahu 'alaihi wasallam membunuh ular-ular yang bersarang di rumah-rumah.'"
            },
            {
                "number": 3826,
                "arab": "و حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِقَتْلِ الْكِلَابِ يَقُولُ اقْتُلُوا الْحَيَّاتِ وَالْكِلَابَ وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ وَالْأَبْتَرَ فَإِنَّهُمَا يَلْتَمِسَانِ الْبَصَرَ وَيَسْتَسْقِطَانِ الْحَبَالَىقَالَ الزُّهْرِيُّ وَنُرَى ذَلِكَ مِنْ سُمَّيْهِمَا وَاللَّهُ أَعْلَمُ قَالَ سَالِمٌ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَلَبِثْتُ لَا أَتْرُكُ حَيَّةً أَرَاهَا إِلَّا قَتَلْتُهَا فَبَيْنَا أَنَا أُطَارِدُ حَيَّةً يَوْمًا مِنْ ذَوَاتِ الْبُيُوتِ مَرَّ بِي زَيْدُ بْنُ الْخَطَّابِ أَوْ أَبُو لُبَابَةَ وَأَنَا أُطَارِدُهَا فَقَالَ مَهْلًا يَا عَبْدَ اللَّهِ فَقُلْتُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِهِنَّ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَى عَنْ ذَوَاتِ الْبُيُوتِ و حَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ ح و حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ صَالِحٍ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ صَالِحًا قَالَ حَتَّى رَآنِي أَبُو لُبَابَةَ بْنُ عَبْدِ الْمُنْذِرِ وَزَيْدُ بْنُ الْخَطَّابِ فَقَالَا إِنَّهُ قَدْ نَهَى عَنْ ذَوَاتِ الْبُيُوتِ وَفِي حَدِيثِ يُونُسَ اقْتُلُوا الْحَيَّاتِ وَلَمْ يَقُلْ ذَا الطُّفْيَتَيْنِ وَالْأَبْتَرَ",
                "id": "Dan telah menceritakan kepada kami [Hajib bin Al Walid]; Telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri]; Telah mengabarkan kepadaku [Salim bin 'Abdullah] dari [Ibnu 'Umar] dia berkata; \"Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam memerintahkan kami, kaum muslimin, untuk membunuh anjing.\" Beliau bersabda: 'Bunuhlah ular dan anjing! Serta musnahkanlah ular yang dipunggungnya ada dua garis putih dan ular yang ekornya bunting, karena kedua jenis ular tersebut dapat membutakan mata dan menggugurkan kandungan.' [Az Zuhri] berkomentar; 'Menurut kami, hal itu disebabkan karena racunnya. Wallahu A'lam.' [Salim] berkata; ['Abdullah bin Umar] pernah menyatakan; 'Setiap ular yang saya lihat tidak pernah saya biarkan hidup, melainkan selalu saya bunuh. Pada suatu hari, ketika saya sedang memburu ular yang bersarang\/mendekam di rumah, tiba-tiba [Zaid bin Khaththab] atau [Abu Lubabah] lewat seraya berkata; 'Hentikan hai Abdullah! ' Mendengar teguran itu, saya pun menjawab; 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah memerintahkan kami untuk membunuh ular.' Zaid bin Khaththab berkata; 'Sebenarnya Rasulullah melarang kita, kaum muslimin, untuk membunuh ular yang bersarang di rumah kita.\" Dan telah menceritakannya kepada kami [Harmalah bin Yahya]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Abad bin Humaid]; Telah mengabarkan kepada kami ['Abdur Razaq]; Telah mengabarkan kepada kami [Ma'mar]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Hasan Al Hulwani]; Telah menceritakan kepada kami [Ya'qub]; Telah menceritakan kepada kami [Bapakku] dari [Shalih] seluruhnya dari [Az Zuhri] melalui jalur ini. Hanya saja Shalih berkata dengan kalimat; 'Hingga [Abu Lubabah bin Abdul Mundzir] dan [Zaid bin Al Khaththab] melihatku, lalu keduanya berkata; sebenarnya Rasulullah shallallahu 'alaihi wasallam hanya melarang untuk membunuh ular yang bersarang di sekitar rumah kita. Sedangkan di dalam Hadits Yunus disebutkan; 'Bunuhlah ular-ular.' -tanpa menyebutkan yang bergaris dua putih dan yang buntung.-"
            },
            {
                "number": 3827,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍأَنَّ أَبَا لُبَابَةَ كَلَّمَ ابْنَ عُمَرَ لِيَفْتَحَ لَهُ بَابًا فِي دَارِهِ يَسْتَقْرِبُ بِهِ إِلَى الْمَسْجِدِ فَوَجَدَ الْغِلْمَةُ جِلْدَ جَانٍّ فَقَالَ عَبْدُ اللَّهِ الْتَمِسُوهُ فَاقْتُلُوهُ فَقَالَ أَبُو لُبَابَةَ لَا تَقْتُلُوهُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ قَتْلِ الْجِنَّانِ الَّتِي فِي الْبُيُوتِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Rumh]; Telah mengabarkan kepada kami [Al Laits]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan lafazh ini miliknya; Telah menceritakan kepada kami [Laits] dari [Nafi'] bahwa [Abu Lubabah] berkata kepada Ibnu Umar agar dia membuka pintu rumah miliknya supaya lebih dekat pergi ke Masjid. Namun tiba-tiba beberapa anak kecil melihat kulit ular. Maka Abdullah berkata; \"Cari dan ikut ia! Lalu bunuhlah oleh kalian!\" Abu Lubabah berkata; 'Jangan kalian bunuh, karena Rasulullah shallallahu 'alaihi wasallam telah melarang membunuh ular-ular yang berada di rumah.'"
            },
            {
                "number": 3828,
                "arab": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ حَدَّثَنَا نَافِعٌ قَالَ كَانَ ابْنُ عُمَرَ يَقْتُلُ الْحَيَّاتِ كُلَّهُنَّ حَتَّى حَدَّثَنَا أَبُو لُبَابَةَ بْنُ عَبْدِ الْمُنْذِرِ الْبَدْرِيُّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ قَتْلِ جِنَّانِ الْبُيُوتِ فَأَمْسَكَ",
                "id": "Dan telah menceritakan kepada kami [Syaiban bin Farrukh]; Telah menceritakan kepada kami [Jarir bin Hazim]; Telah menceritakan kepada kami [Nafi'] dia berkata; Ibnu 'Umar pernah membunuh semua ular hingga kemudian [Abu Lubabah bin Al Mundzir Al Badri] menceritakan kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang membunuh ular-ular kecil yang berada di rumah. Maka Ibnu Umar pun tidak membunuhnya lagi."
            },
            {
                "number": 3829,
                "arab": "و حَدَّثَنَاه إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِي لُبَابَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ حَدَّثَنَا جُوَيْرِيَةُ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ أَنَّ أَبَا لُبَابَةَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ قَتْلِ الْجِنَّانِ الَّتِي فِي الْبُيُوتِ",
                "id": "Dan telah menceritakannya kepada kami [Ishaq bin Musa Al Anshari]; Telah menceritakan kepada kami [Anas bin 'Iyadh]; Telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari ['Abdullah bin 'Umar] dari [Abu Lubabah] dari Nabi shallallahu 'alaihi wasallam. Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku ['Abdullah bin Muhammad bin Asma' Adh Dhuba'i] Telah menceritakan kepada kami [Juwariyah] dari [Nafi'] dari ['Abdullah] bahwa [Abu Lubabah] Telah mengabarkan kepadanya; 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang membunuh ular-ular kecil yang berada di rumah.'"
            },
            {
                "number": 3830,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ يَقُولُ أَخْبَرَنِي نَافِعٌ أَنَّ أَبَا لُبَابَةَ بْنَ عَبْدِ الْمُنْذِرِ الْأَنْصَارِيَّ وَكَانَ مَسْكَنُهُ بِقُبَاءٍ فَانْتَقَلَ إِلَى الْمَدِينَةِ فَبَيْنَمَا عَبْدُ اللَّهِ بْنُ عُمَرَ جَالِسًا مَعَهُ يَفْتَحُ خَوْخَةً لَهُ إِذَا هُمْ بِحَيَّةٍ مِنْ عَوَامِرِ الْبُيُوتِ فَأَرَادُوا قَتْلَهَا فَقَالَ أَبُو لُبَابَةَإِنَّهُ قَدْ نُهِيَ عَنْهُنَّ يُرِيدُ عَوَامِرَ الْبُيُوتِ وَأُمِرَ بِقَتْلِ الْأَبْتَرِ وَذِي الطُّفْيَتَيْنِ وَقِيلَ هُمَا اللَّذَانِ يَلْتَمِعَانِ الْبَصَرَ وَيَطْرَحَانِ أَوْلَادَ النِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami ['Abdul Wahhab] yaitu Ats Tsaqafi dia berkata; Aku mendengar; [Yahya bin Sa'id] berkata; Telah mengabarkan kepadaku [Nafi'] bahwa [Abu Lubabah bin 'Abdul Mundzir Al Anshari] yang dulu tinggal di Quba. Kemudian dia pindah ke Madinah. Pada suatu hari tatkala Ibnu Umar duduk bersamanya, Lalu Ibnu Umar hendak membuka pintu kecil di rumahnya, tiba-tiba ada seekor ular di rumah tersebut. Kemudian para sahabat berupaya untuk membunuhnya. Maka Abu Lubabah berkata; 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang membunuh ular-ular yang tinggal di rumah. Dan beliau menyuruh membunuh ular yang buntung ekornya dan ular yang memiliki dua garis putih di punggungnya, karena di katakan kedua ular tersebut dapat membutakan mata dan membunuh bayi-bayi wanita yang hamil.'"
            },
            {
                "number": 3831,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى وَإِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَارٍ وَقَدْ أُنْزِلَتْ عَلَيْهِ وَالْمُرْسَلَاتِ عُرْفًا فَنَحْنُ نَأْخُذُهَا مِنْ فِيهِ رَطْبَةً إِذْ خَرَجَتْ عَلَيْنَا حَيَّةٌ فَقَالَ اقْتُلُوهَا فَابْتَدَرْنَاهَا لِنَقْتُلَهَا فَسَبَقَتْنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَاهَا اللَّهُ شَرَّكُمْ كَمَا وَقَاكُمْ شَرَّهَاو حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakr bin Abu Syaibah] serta [Abu Kuraib] dan [Ishaq bin Ibrahim] dan lafazh ini milik Yahya. [Yahya] dan [Ishaq] berkata; Telah mengabarkan kepada kami Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Abdullah] dia berkata; \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam di sebuah gua. Pada waktu itu telah turun kepada beliau surat Al mursalat, dan kami langsung mengambilnya (mendegarnya) dari mulut beliau yang basah. Tiba-tiba ada seekor ular. Maka Nabi shallallahu 'alaihi wasallam berkata; 'Bunuhlah ia! Lalu kami mengejarnya untuk membunuh ular tersebut. Namun ular itu telah lari menghilang. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: 'Sungguh Allah telah melindunginya dari serangan kalian sebagaimana Dia juga telah melindungi kalian dari kejahatannya.' Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan ['Utsman bin Abu Syaibah] keduanya berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] melalui jalur ini dengan Hadits yang serupa."
            },
            {
                "number": 3832,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ مُحْرِمًا بِقَتْلِ حَيَّةٍ بِمِنًىو حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنِي إِبْرَاهِيمُ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَارٍ بِمِثْلِ حَدِيثِ جَرِيرٍ وَأَبِي مُعَاوِيَةَ",
                "id": "Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Hafsh] yaitu Ibnu Ghiyats; Telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Abdillah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah menyuruh orang yang sedang ihram membunuh seekor ular ketika di Mina.\" Dan telah menceritakan kepada kami ['Umar bin Hafsh bin Ghiyats]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Al A'masy]; Telah menceritakan kepadaku [Ibrahim] dari [Al Aswad] dari ['Abdullah] dia berkata; 'Ketika kami bersama Rasulullah shallallahu 'alaihi wasallam di sebuah gua….-dan seterusnya yang serupa dengan Hadits Jarir dan Abu Mu'awiyah.-"
            },
            {
                "number": 3833,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ عَنْ صَيْفِيٍّ وَهُوَ عِنْدَنَا مَوْلَى ابْنِ أَفْلَحَ أَخْبَرَنِي أَبُو السَّائِبِ مَوْلَى هِشَامِ بْنِ زُهْرَةَأَنَّهُ دَخَلَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فِي بَيْتِهِ قَالَ فَوَجَدْتُهُ يُصَلِّي فَجَلَسْتُ أَنْتَظِرُهُ حَتَّى يَقْضِيَ صَلَاتَهُ فَسَمِعْتُ تَحْرِيكًا فِي عَرَاجِينَ فِي نَاحِيَةِ الْبَيْتِ فَالْتَفَتُّ فَإِذَا حَيَّةٌ فَوَثَبْتُ لِأَقْتُلَهَا فَأَشَارَ إِلَيَّ أَنْ اجْلِسْ فَجَلَسْتُ فَلَمَّا انْصَرَفَ أَشَارَ إِلَى بَيْتٍ فِي الدَّارِ فَقَالَ أَتَرَى هَذَا الْبَيْتَ فَقُلْتُ نَعَمْ قَالَ كَانَ فِيهِ فَتًى مِنَّا حَدِيثُ عَهْدٍ بِعُرْسٍ قَالَ فَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْخَنْدَقِ فَكَانَ ذَلِكَ الْفَتَى يَسْتَأْذِنُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَنْصَافِ النَّهَارِ فَيَرْجِعُ إِلَى أَهْلِهِ فَاسْتَأْذَنَهُ يَوْمًا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ عَلَيْكَ سِلَاحَكَ فَإِنِّي أَخْشَى عَلَيْكَ قُرَيْظَةَ فَأَخَذَ الرَّجُلُ سِلَاحَهُ ثُمَّ رَجَعَ فَإِذَا امْرَأَتُهُ بَيْنَ الْبَابَيْنِ قَائِمَةً فَأَهْوَى إِلَيْهَا الرُّمْحَ لِيَطْعُنَهَا بِهِ وَأَصَابَتْهُ غَيْرَةٌ فَقَالَتْ لَهُ اكْفُفْ عَلَيْكَ رُمْحَكَ وَادْخُلْ الْبَيْتَ حَتَّى تَنْظُرَ مَا الَّذِي أَخْرَجَنِي فَدَخَلَ فَإِذَا بِحَيَّةٍ عَظِيمَةٍ مُنْطَوِيَةٍ عَلَى الْفِرَاشِ فَأَهْوَى إِلَيْهَا بِالرُّمْحِ فَانْتَظَمَهَا بِهِ ثُمَّ خَرَجَ فَرَكَزَهُ فِي الدَّارِ فَاضْطَرَبَتْ عَلَيْهِ فَمَا يُدْرَى أَيُّهُمَا كَانَ أَسْرَعَ مَوْتًا الْحَيَّةُ أَمْ الْفَتَى قَالَ فَجِئْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا ذَلِكَ لَهُ وَقُلْنَا ادْعُ اللَّهَ يُحْيِيهِ لَنَا فَقَالَ اسْتَغْفِرُوا لِصَاحِبِكُمْ ثُمَّ قَالَ إِنَّ بِالْمَدِينَةِ جِنًّا قَدْ أَسْلَمُوا فَإِذَا رَأَيْتُمْ مِنْهُمْ شَيْئًا فَآذِنُوهُ ثَلَاثَةَ أَيَّامٍ فَإِنْ بَدَا لَكُمْ بَعْدَ ذَلِكَ فَاقْتُلُوهُ فَإِنَّمَا هُوَ شَيْطَانٌو حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ أَسْمَاءَ بْنَ عُبَيْدٍ يُحَدِّثُ عَنْ رَجُلٍ يُقَالُ لَهُ السَّائِبُ وَهُوَ عِنْدَنَا أَبُو السَّائِبِ قَالَ دَخَلْنَا عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فَبَيْنَمَا نَحْنُ جُلُوسٌ إِذْ سَمِعْنَا تَحْتَ سَرِيرِهِ حَرَكَةً فَنَظَرْنَا فَإِذَا حَيَّةٌ وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ مَالِكٍ عَنْ صَيْفِيٍّ وَقَالَ فِيهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِهَذِهِ الْبُيُوتِ عَوَامِرَ فَإِذَا رَأَيْتُمْ شَيْئًا مِنْهَا فَحَرِّجُوا عَلَيْهَا ثَلَاثًا فَإِنْ ذَهَبَ وَإِلَّا فَاقْتُلُوهُ فَإِنَّهُ كَافِرٌ وَقَالَ لَهُمْ اذْهَبُوا فَادْفِنُوا صَاحِبَكُمْ",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin 'Amru bin Sarh]; Telah mengabarkan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku [Malik bin Anas] dari [Shaifi] yaitu budak dari Ibnu Aflah; Telah mengabarkan kepadaku [Abu As Saib] -budak- Hisyam bin Zuhrah bahwa suatu ketika dia menemui [Abu Sa'id Al Khudri] di rumahnya. Abu Saib berkata; \"Ketika itu saya mendapatkan Abu Said sedang sholat. Lalu saya menungguinya hingga ia selesai sholat. Tiba-tiba saya mendengar sesuatu yang bergerak di pelepah kurma di sudut rumah, lalu saya pun menoleh kepadanya. Ternyata di sana ada seekor ular, maka saya meloncat dari tempat duduk saya untuk membunuhnya. Namun, tak di duga sebelumnya, Abu Sa'id Al Khudri malah memberi isyarat kepada saya agar tetap duduk. Akhirnya saya pun kembali ke tempat duduk saya. Selesai sholat, Abu Sa'id menunjuk sebuah rumah di perkampungan itu seraya berkata; 'Kamu melihat rumah itu hai sahabatku? ' Saya menjawab; 'Ya, saya melihatnya.' Abu Sa'id melanjutkan ucapannya; 'Di rumah itu dulu ada seorang pemuda yang termasuk keluarga kami dan baru saja melangsungkan pernikahannya (pengantin baru). Dulu kami berangkat menuju medan perang Khandak bersama Rasulullah shallallahu 'alaihi wasallam. Ketika itu pemuda tersebut meminta izin kepada Rasulullah, pada tengah hari, untuk segera pulang menemui isterinya. Akhirnya Rasulullah memberinya izin seraya berkata kepadanya: 'Bawalah senjatamu, karena aku khawatir orang-orang Bani Quraizhah akan menyerangmu! ' Tak lama kemudian, lelaki itu mengambil senjatanya dan pulang ke rumahnya. Setibanya di rumah, ia mendapati isterinya sedang berdiri di tengah pintu. Tak ayal lagi, ia pun langsung mengarahkan tombaknya ke arah isterinya (karena rasa cemburu). Namun isterinya malah berkata kepadanya; 'Tahanlah tombakmu dan masuklah ke dalam rumah agar kamu tahu mengapa aku berada di luar! ' Laki-laki itu masuk ke dalam rumah dan ternyata di dalamnya ada seekor ular besar yang sedang melingkar di atas tempat tidur. Tanpa berkata-kata lagi, langsung ia tikam ular tersebut dengan tombak yang di pegangnya. Setelah itu ia keluar seraya menancapkan tombaknya di depan rumah. Tiba-tiba ular tersebut menghantamnya. Tidak dapat diketahui dengan pasti, siapakah yang mati terlebih dahulu, ular atau pemuda itu? ' Abu Sa'id Al Khudri berkata; 'Akhirnya kami mendatangi Rasulullah shallallahu 'alaihi wasallam untuk melaporkan peristiwa tersebut kepada beliau. Lalu kami berkata; \"Ya Rasulullah, mohonkanlah kepada Allah agar dia dapat hidup! ' Rasulullah pun menjawab: 'Sesungguhnya di kota Madinah ini ada sekelompok jin yang telah masuk Islam. Apabila kamu melihat sesuatu yang aneh dari mereka, maka berilah izin kepada mereka untuk menetap di rumah selama tiga hari. Tetapi, jika setelah tiga hari tidak mau pergi juga, maka bunuhlah ia! Karena ia itu adalah syetan! ' Dan telah menceritakan kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Wahab bin Jarir bin Hazim] Telah menceritakan kepada kami [Bapakku] dia berkata; Aku mendengar [Asma' bin Ubaid] bercerita dari seorang laki-laki yang biasa dipanggil dengan As Saib, menurut kami dia adalah [Abu As Saib] dia berkata; kami menemui [Abu Sa'id Al Khudzri], tatkala kami sedang duduk, kami mendengar gerakan suara di bawah tempat tidurnya, lalu kami lihat ternyata seekor ular. -dan seterusnya sebagaimana Hadits Malik dari Shaifi. Dan di dalamnya disebutkan; kemudian Rasulullah bersabda: 'Sesungguhnya di kota Madinah ini ada sekelompok jin. Apabila kamu melihat sesuatu yang aneh dari mereka, maka berilah izin kepada mereka untuk menetap di rumah selama tiga hari. Tetapi, jika setelah tiga hari tidak mau pergi juga, maka bunuhlah ia! Karena ia itu adalah kafir! ' Beliau juga bersabda: 'pergilah kalian untuk menguburkan teman kalian.'"
            },
            {
                "number": 3834,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرِ بْنِ شَيْبَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أُمِّ شَرِيكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهَا بِقَتْلِ الْأَوْزَاغِ وَفِي حَدِيثِ ابْنِ أَبِي شَيْبَةَ أَمَرَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan ['Amru An Naqid] dan [Ishaq bin Ibrahim] serta [Ibnu Abu 'Umar]. [Ishaq] berkata; Telah mengabarkan kepada kami. Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Abdul Hamid bin Jubair bin Syaibah] dari [Sa'id bin Al Musayyab] dari [Ummu Syarik] bahwa Nabi shallallahu 'alaihi wasallam menyuruhnya supaya membunuh semua cecak. Sedangkan di dalam Hadits Ibnu Abu Syaibah menggunakana lafazh 'Amara' (menyuruh) saja."
            },
            {
                "number": 3835,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ جُرَيْجٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَبْدُ الْحَمِيدِ بْنُ جُبَيْرِ بْنِ شَيْبَةَ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ أَخْبَرَهُ أَنَّ أُمَّ شَرِيكٍ أَخْبَرَتْهُأَنَّهَا اسْتَأْمَرَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَتْلِ الْوِزْغَانِ فَأَمَرَ بِقَتْلِهَا وَأُمُّ شَرِيكٍ إِحْدَى نِسَاءِ بَنِي عَامِرِ بْنِ لُؤَيٍّ اتَّفَقَ لَفْظُ حَدِيثِ ابْنِ أَبِي خَلَفٍ وَعَبْدِ بْنِ حُمَيْدٍ وَحَدِيثُ ابْنِ وَهْبٍ قَرِيبٌ مِنْهُ",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Ibnu Juraij]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Muhammad bin Ahmad bin Abu Khalaf]; Telah menceritakan kepada kami [Rouh] Telah menceritakan kepada kami [Ibnu Juraij]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami ['Abdu bin Humaid]; Telah mengabarkan kepada kami [Muhammad bin Bakr]; Telah mengabarkan kepada kami [Ibnu Juraij]; Telah mengabarkan kepadaku ['Abdul Humaid bin Jubair bin Syaibah] bahwa [Sa'id bin Al Musayyab] Telah mengabarkan kepadanya, [Ummu Syarik] Telah mengabarkan kepadanya, bahwa dia bertanya kepada Nabi shallallahu 'alaihi wasallam tentang membunuh cecak. Lalu Nabi shallallahu 'alaihi wasallam menyuruhnya agar dibunuh saja. Ummu Syarik adalah salah seorang wanita dari Bani Amir bin Luay. Lafazh Hadits Ibnu Abu Khalaf sama dengan lafazh Hadits Abad bin Humaid demikian juga Hadits Ibnu Wahab mirip dengan Hadits tersebut."
            },
            {
                "number": 3836,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالَا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْوَزَغِ وَسَمَّاهُ فُوَيْسِقًا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan ['Abdu bin Humaid] keduanya berkata; Telah mengabarkan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Amir bin Sa'd] dari [Bapaknya] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan agar membunuh Al Wazagh (cecak) dan beliau memberi nama Fuwaisiq (si fasik kecil).\""
            },
            {
                "number": 3837,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْوَزَغِ الْفُوَيْسِقُزَادَ حَرْمَلَةُ قَالَتْ وَلَمْ أَسْمَعْهُ أَمَرَ بِقَتْلِهِ",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam menamai cecak dengan Fuwaisiq. Harmalah menambahkan; 'Dan aku belum mendengar beliau menyuruh untuk membunuhnya.'"
            },
            {
                "number": 3838,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ وَزَغَةً فِي أَوَّلِ ضَرْبَةٍ فَلَهُ كَذَا وَكَذَا حَسَنَةً وَمَنْ قَتَلَهَا فِي الضَّرْبَةِ الثَّانِيَةِ فَلَهُ كَذَا وَكَذَا حَسَنَةً لِدُونِ الْأُولَى وَإِنْ قَتَلَهَا فِي الضَّرْبَةِ الثَّالِثَةِ فَلَهُ كَذَا وَكَذَا حَسَنَةً لِدُونِ الثَّانِيَةِحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ زَكَرِيَّاءَ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ كُلُّهُمْ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ خَالِدٍ عَنْ سُهَيْلٍ إِلَّا جَرِيرًا وَحْدَهُ فَإِنَّ فِي حَدِيثِهِ مَنْ قَتَلَ وَزَغًا فِي أَوَّلِ ضَرْبَةٍ كُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَفِي الثَّانِيَةِ دُونَ ذَلِكَ وَفِي الثَّالِثَةِ دُونَ ذَلِكَ و حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ زَكَرِيَّاءَ عَنْ سُهَيْلٍ حَدَّثَتْنِي أُخْتِي عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي أَوَّلِ ضَرْبَةٍ سَبْعِينَ حَسَنَةً",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Khalid bin 'Abdullah] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membunuh cecak satu kali pukul, maka dituliskan baginya pahala sebanyak begini dan begini kebaikan. Dan barang siapa yang membunuhnya dua kali pukul, maka dituliskan baginya pahala sebanyak begini dan begini kebaikan berkurang dari pukulan pertama. Dan siapa yang membunuhnya tiga kali pukul, maka pahalanya kurang lagi dari itu.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Abu 'Awanah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Ash Shabbah]; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Zakaria; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Waki'] dari [Sufyan] seluruhnya dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam yang semakna dengan Hadits Khalid dari Suhail. Kecuali Jarir dia mengatakan di dalam Haditsnya; 'Barang siapa yang membunuh cecak sekali pukul, maka dituliskan baginya pahala seratus kebaikan, dan barang siapa memukulnya lagi, maka baginya pahala yang kurang dari pahala pertama. Dan barang siapa memukulnya lagi, maka baginya pahala lebih kurang dari yang kedua. Dan telah menceritakan kepada kami [Muhammad bin Ash Shabbah]; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Zakaria dari [Suhail]; Telah menceritakan kepadaku [Saudara perempuanku] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: 'Pada pukulan pertama terdapat tujuh puluh kebaikan.'"
            },
            {
                "number": 3839,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ نَمْلَةً قَرَصَتْ نَبِيًّا مِنْ الْأَنْبِيَاءِ فَأَمَرَ بِقَرْيَةِ النَّمْلِ فَأُحْرِقَتْ فَأَوْحَى اللَّهُ إِلَيْهِ أَفِي أَنْ قَرَصَتْكَ نَمْلَةٌ أَهْلَكْتَ أُمَّةً مِنْ الْأُمَمِ تُسَبِّحُ",
                "id": "Telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah bin Yahya] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dan [Abu Salamah bin 'Abdur Rahman] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam sabdanya: \"Seekor semut menggigit seorang Nabi di antara nabi-nabi, lalu Nabi tersebut menyuruh membakar sarang semut itu, lalu dibakarlah. Kemudian Allah Subhanahu Wa Ta'ala mewahyukan kepadanya: \"Apakah karena seekor semut yang menggigitmu, lalu engkau musnahkan suatu umat yang selalu membaca tasbih.\""
            },
            {
                "number": 3840,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَزَلَ نَبِيٌّ مِنْ الْأَنْبِيَاءِ تَحْتَ شَجَرَةٍ فَلَدَغَتْهُ نَمْلَةٌ فَأَمَرَ بِجِهَازِهِ فَأُخْرِجَ مِنْ تَحْتِهَا ثُمَّ أَمَرَ بِهَا فَأُحْرِقَتْ فَأَوْحَى اللَّهُ إِلَيْهِ فَهَلَّا نَمْلَةً وَاحِدَةً",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Al Mughirah] yaitu Ibnu 'Abdur Rahman Al Hizami dari [Abu Az Zinad] dari [Al A'raj] dari [Ab Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Seorang Nabi suatu hari berhenti di bawah pohon lalu dia di sengat seekor semut. Kemudian Nabi tersebut menyuruh mengeluarkan makanan dan mengeluarkan semua semut dari sarangnya setelah itu menyuruh membakarnya. Kemudian Allah mewahyukan kepadanya: \"Apakah karena seekor semut kamu kemudian membakarnya.\""
            },
            {
                "number": 3841,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَاوَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ نَبِيٌّ مِنْ الْأَنْبِيَاءِ تَحْتَ شَجَرَةٍ فَلَدَغَتْهُ نَمْلَةٌ فَأَمَرَ بِجِهَازِهِ فَأُخْرِجَ مِنْ تَحْتِهَا وَأَمَرَ بِهَا فَأُحْرِقَتْ فِي النَّارِ قَالَ فَأَوْحَى اللَّهُ إِلَيْهِ فَهَلَّا نَمْلَةً وَاحِدَةً",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dia berkata; 'Inilah yang telah di ceritakan oleh [Abu Hurairah] kepada kami dari Rasulullah shallallahu 'alaihi wasallam, -kemudian dia menyebutkan beberapa Hadits yang di antaranya-; dan Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Suatu hari seorang Nabi berhenti di bawah pohon lalu dia di sengat seekor semut. Kemudian Nabi tersebut menyuruh mengeluarkan makanan dan mengeluarkan semua semut dari sarangnya setelah itu menyuruh membakarnya. Kemudian Allah mewahyukan kepadanya: Apakah karena seekor semut kamu kemudian membakarnya."
            },
            {
                "number": 3842,
                "arab": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُذِّبَتْ امْرَأَةٌ فِي هِرَّةٍ سَجَنَتْهَا حَتَّى مَاتَتْ فَدَخَلَتْ فِيهَا النَّارَ لَا هِيَ أَطْعَمَتْهَا وَسَقَتْهَا إِذْ حَبَسَتْهَا وَلَا هِيَ تَرَكَتْهَا تَأْكُلُ مِنْ خَشَاشِ الْأَرْضِو حَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ وَعَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ مَعْنَاهُ و حَدَّثَنَاه هَارُونُ بْنُ عَبْدِ اللَّهِ وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ عَنْ مَعْنِ بْنِ عِيسَى عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ",
                "id": "Telah menceritakan kepadaku ['Abdullah bin Muhammad bin Asma' Adh Dhuba'i]; Telah menceritakan kepada kami [Juwariyah bin Asma'] dari [Nafi'] dari ['Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita disiksa Allah pada hari kiamat lantaran dia mengurung seekor kucing sehingga kucing itu mati. Karena itu Allah Subhanahu Wa Ta'ala memasukkannya ke neraka. Kucing itu dikurungnya tanpa diberi makan dan minum dan tidak pula dilepaskannya supaya ia dapat menangkap serangga-serangga bumi.\" Dan telah menceritakan kepadaku [Nashr bin 'Ali Al Jahdhami]; Telah menceritakan kepada kami [Abdul A'la] dari ['Ubaidillah bin 'Umar] dari [Nafi'] dari [Ibnu 'Umar] dan dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang semakna. Dan telah menceritakannya kepada kami [Harun bin 'Abdullah] dan ['Abdullah bin Ja'far] dari [Ma'n bin 'Isa] dari [Malik] dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam dengan Hadits tersebut. "
            },
            {
                "number": 3843,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُذِّبَتْ امْرَأَةٌ فِي هِرَّةٍ لَمْ تُطْعِمْهَا وَلَمْ تَسْقِهَا وَلَمْ تَتْرُكْهَا تَأْكُلُ مِنْ خَشَاشِ الْأَرْضِو حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا هِشَامٌ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِمَا رَبَطَتْهَا وَفِي حَدِيثِ أَبِي مُعَاوِيَةَ حَشَرَاتِ الْأَرْضِ و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ قَالَ قَالَ الزُّهْرِيُّ وَحَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ هِشَامِ بْنِ عُرْوَةَ و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِهِمْ",
                "id": "Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami ['Abdah] dari [Hisyam] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita disiksa Allah pada hari kiamat lantaran dia mengurung seekor kucing tanpa diberi makan dan minum dan tidak pula dilepaskannya supaya ia dapat mencari serangga-serangga yang terdapat di bumi.\" Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Khalid bin Al Harits]; Telah menceritakan kepada kami [Hisyam] melalui jalur ini. Dan di dalam Hadits keduanya disebutkan dengan lafazh 'Rabathathhaa' (di diikatnya). Sedangkan di dalam Hadits Abu Mu'awiyah dengan menggunakan lafazh; 'Hasyaraatil Ardli.' (binatang melata di bumi). Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan ['Abdu bin Humaid]. ['Abdu] berkata; Telah mengabarkan kepada kami dan berkata; [Ibnu Rafi']; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dia berkata; [Az Zuhri] berkata; Dan telah menceritakan kepadaku [Humaid bin 'Abdur Rahman] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam yang semakna dengan Hadits Hisyam bin 'Urwah; Dan telah menceritakan kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang serupa."
            },
            {
                "number": 3844,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ اشْتَدَّ عَلَيْهِ الْعَطَشُ فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ ثُمَّ خَرَجَ فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنْ الْعَطَشِ فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنْ الْعَطَشِ مِثْلُ الَّذِي كَانَ بَلَغَ مِنِّي فَنَزَلَ الْبِئْرَ فَمَلَأَ خُفَّهُ مَاءً ثُمَّ أَمْسَكَهُ بِفِيهِ حَتَّى رَقِيَ فَسَقَى الْكَلْبَ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ قَالُوا يَا رَسُولَ اللَّهِ وَإِنَّ لَنَا فِي هَذِهِ الْبَهَائِمِ لَأَجْرًا فَقَالَ فِي كُلِّ كَبِدٍ رَطْبَةٍ أَجْرٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari apa yang telah dibacakan kepadanya dari [Sumayya] -budak- Abu Bakr dari [Abu Shalih As Samman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Pada suatu ketika ada seorang laki-laki sedang berjalan melalui sebuah jalan, lalu dia merasa sangat kehausan. Kebetulan dia menemukan sebuah sumur, maka dia turun ke sumur itu untuk minum. Setelah keluar dari sumur, dia melihat seekor anjing menjulurkan lidahnya menjilat-jilat tanah karena kehausan. Orang itu berkata dalam hatinya; 'Alangkah hausnya anjing itu, seperti yang baru ku alami.' Lalu dia turun kembali ke sumur, kemudian dia menciduk air dengan sepatunya, dibawanya ke atas dan diminumkannya kepada anjing itu. Maka Allah berterima kasih kepada orang itu (diterima-Nya amalnya) dan diampuni-Nya dosanya.' Para sahabat bertanya; 'Ya, Rasulullah! Dapat pahalakah kami bila menyayangi hewan-hewan ini? ' Jawab Rasulullah shallallahu 'alaihi wasallam: 'Menyayangi setiap makhluk hidup adalah berpahala.'"
            },
            {
                "number": 3845,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ هِشَامٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ امْرَأَةً بَغِيًّا رَأَتْ كَلْبًا فِي يَوْمٍ حَارٍّ يُطِيفُ بِبِئْرٍ قَدْ أَدْلَعَ لِسَانَهُ مِنْ الْعَطَشِ فَنَزَعَتْ لَهُ بِمُوقِهَا فَغُفِرَ لَهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Hisyam] dari [Muhammad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bahwa di suatu hari yang sangat panas seorang wanita pelacur melihat seekor anjing, anjing tersebut mengelilingi sebuah sumur sambil menjulurkan lidahnya karena kehausan, maka kemudian wanita tersebut mencopot sepatunya dan memberi minum anjing tersebut. Allah pun kemudian mengampuni dosa-dosa pelacur itu."
            },
            {
                "number": 3846,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا كَلْبٌ يُطِيفُ بِرَكِيَّةٍ قَدْ كَادَ يَقْتُلُهُ الْعَطَشُ إِذْ رَأَتْهُ بَغِيٌّ مِنْ بَغَايَا بَنِي إِسْرَائِيلَ فَنَزَعَتْ مُوقَهَا فَاسْتَقَتْ لَهُ بِهِ فَسَقَتْهُ إِيَّاهُ فَغُفِرَ لَهَا بِهِ",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami ['Abdullah bin Wahb]; Telah mengabarkan kepadaku [Jarir bin Hazim] dari [Ayyub As Sakhtiyani] dari [Muhammad bin Sirin] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam: \"Pada suatu ketika ada seekor anjing mengelilingi sebuah sumur. Anjing itu hampir mati kehausan. Tiba-tiba dia terlihat oleh seorang wanita pelacur dari bangsa Israil. Maka dia membuka sepatu botnya. Kemudian dia menciduk air dengan sepatunya, lalu anjing itu diberi minum. Karena hal itu Allah Subhanahu Wa Ta'ala mengampuni dosa-dosa wanita itu.\""
            },
            {
                "number": 3847,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ قَالَ قَالَ أَبُو هُرَيْرَةَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ عَزَّ وَجَلَّ يَسُبُّ ابْنُ آدَمَ الدَّهْرَ وَأَنَا الدَّهْرُ بِيَدِيَ اللَّيْلُ وَالنَّهَارُ",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin 'Amru bin Sarh] dan [Harmalah bin Yahya] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab]; Telah mengabarkan kepadaku [Abu Salamah bin 'Abdur Rahman] dia berkata; [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Azza wa Jalla berfirman: Anak Adam suka mencela masa. Padahal Aku pencipta masa. Di tangan-Kulah pergantian siang dan malam.\""
            },
            {
                "number": 3848,
                "arab": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ يُؤْذِينِي ابْنُ آدَمَ يَسُبُّ الدَّهْرَ وَأَنَا الدَّهْرُ أُقَلِّبُ اللَّيْلَ وَالنَّهَارَ",
                "id": "Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim] dan [Ibnu Abu 'Umar] dan lafazh ini miliknya Abu 'Umar dia berkata; [Ishaq] Telah mengabarkan kepada kami dan berkata; [Ibnu Abu 'Umar] Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Ibnu Al Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Azza wa Jalla berfirman: Anak Adam telah menyakiti-Ku dia suka mencela masa. Padahal Aku pencipta masa. Akulah yang menggilir siang dan malam.\""
            },
            {
                "number": 3849,
                "arab": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ عَزَّ وَجَلَّ يُؤْذِينِي ابْنُ آدَمَ يَقُولُ يَا خَيْبَةَ الدَّهْرِ فَلَا يَقُولَنَّ أَحَدُكُمْ يَا خَيْبَةَ الدَّهْرِ فَإِنِّي أَنَا الدَّهْرُ أُقَلِّبُ لَيْلَهُ وَنَهَارَهُ فَإِذَا شِئْتُ قَبَضْتُهُمَا",
                "id": "Dan telah menceritakan kepada kami ['Abdu bin Humaid]; Telah mengabarkan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Al Musayyab] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Azza wa Jalla berfirman: Anak Adam suka mencela-Ku. Katanya; 'Alangkah sialnya masa.' Karena itu janganlah kamu berkata demikian. Karena sesungguhnya Akulah pencipta masa. Akulah yang menggilir siang dan malamnya. Jika Aku mau, Aku kuasa menghentikan pergantian keduanya.\""
            },
            {
                "number": 3850,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقُولَنَّ أَحَدُكُمْ يَا خَيْبَةَ الدَّهْرِ فَإِنَّ اللَّهَ هُوَ الدَّهْرُ",
                "id": "Telah menceritakan kepada kami [Qutaibah]; Telah menceritakan kepada kami [Al Mughirah bin 'Abdur Rahman] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang di antara kamu berkata; 'Alangkah sialnya masa.' Karena sesungguhnya Allahlah pencipta masa.\""
            },
            {
                "number": 3851,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَسُبُّوا الدَّهْرَ فَإِنَّ اللَّهَ هُوَ الدَّهْرُ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian mencela masa, Karena sesungguhnya Allahlah pencipta masa.\""
            },
            {
                "number": 3852,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَسُبُّ أَحَدُكُمْ الدَّهْرَ فَإِنَّ اللَّهَ هُوَ الدَّهْرُ وَلَا يَقُولَنَّ أَحَدُكُمْ لِلْعِنَبِ الْكَرْمَ فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Asy Sya'ir]; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] dari [Ibnu Sirin] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang di antara kalian mencela masa, Karena sesungguhnya Allahlah pencipta masa. Dan Janganlah seseorang di antara kalian mengistilahkan anggur dengan istilah karm, karena Al karm itu adalah seorang lelaki muslim.\" "
            },
            {
                "number": 3853,
                "arab": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُولُوا كَرْمٌ فَإِنَّ الْكَرْمَ قَلْبُ الْمُؤْمِنِ",
                "id": "Telah menceritakan kepada kami ['Amru An Naqid] dan [Ibnu Abu 'Umar] keduanya berkata; Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian mengistilahkan anggur dengan istilah karm, karena Al karm adalah hati seorang mu'min."
            },
            {
                "number": 3854,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُسَمُّوا الْعِنَبَ الْكَرْمَ فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian mengistilahkan anggur dengan karm, karena Al karm itu adalah seorang lelaki muslim.\""
            },
            {
                "number": 3855,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ حَدَّثَنَا وَرْقَاءُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُولَنَّ أَحَدُكُمْ الْكَرْمُ فَإِنَّمَا الْكَرْمُ قَلْبُ الْمُؤْمِنِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami ['Ali bin Hafsh]; Telah menceritakan kepada kami [Warqa] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali seseorang di antara kalian mengistilahkan anggur dengan istilah karm, karena Al karm adalah hati seorang mu'min.\""
            },
            {
                "number": 3856,
                "arab": "و حَدَّثَنَا ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَاوَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُولَنَّ أَحَدُكُمْ لِلْعِنَبِ الْكَرْمَ إِنَّمَا الْكَرْمُ الرَّجُلُ الْمُسْلِمُ",
                "id": "Dan telah menceritakan kepada kami [Ibnu Rafi']; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dia berkata; Inilah yang telah di ceritakan oleh [Abu Hurairah] kepada kami dari Rasulullah shallallahu 'alaihi wasallam -lalu dia menyebutkan beberapa Hadits- di antaranya; \"Janganlah sekali-kali seseorang di antara kalian menamakan anggur dengan karm, karena Al karm itu adalah seorang lelaki muslim.\""
            },
            {
                "number": 3857,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ عَنْ شُعْبَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُولُوا الْكَرْمُ وَلَكِنْ قُولُوا الْحَبْلَةُ يَعْنِي الْعِنَبَ",
                "id": "Telah menceritakan kepada kami ['Ali bin Khasyram]; Telah mengabarkan kepada kami ['Isa] yaitu Ibnu Yunus dari [Syu'bah] dari [Simak bin Harb] dari ['Alqamah bin Wail] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian mengatakan 'Al karm, ' tapi katakanlah 'al hablah' yaitu anggur.\""
            },
            {
                "number": 3858,
                "arab": "و حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ قَالَ سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُولُوا الْكَرْمُ وَلَكِنْ قُولُوا الْعِنَبُ وَالْحَبْلَةُ",
                "id": "Dan telah menceritakannya kepada kami [Zuhair bin Harb]; Telah menceritakan kepada kami ['Utsman bin 'Umar]; Telah menceritakan kepada kami [Syu'bah] dari [Simak] dia berkata; Aku mendengar; ['Alqamah bin Wail] dari [Bapaknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengatakan 'Al karm, ' tapi katakanlah 'anggur' atau 'al hablah' (pohon anggur).\""
            },
            {
                "number": 3859,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقُولَنَّ أَحَدُكُمْ عَبْدِي وَأَمَتِي كُلُّكُمْ عَبِيدُ اللَّهِ وَكُلُّ نِسَائِكُمْ إِمَاءُ اللَّهِ وَلَكِنْ لِيَقُلْ غُلَامِي وَجَارِيَتِي وَفَتَايَ وَفَتَاتِي",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] serta [Ibnu Hujr] mereka berkata; Telah menceritakan kepada kami [Isma'il] yaitu Ibnu Ja'far dari [Al 'Ala] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali seseorang di antara kamu berkata; 'Abdi (hai budakku) atau Amati (hai budak perempuanku\/sahayaku), karena kamu semua adalah 'Abiidullah (budak atau hamba Allah) dan kaum wanita adalah Imaaullah (hamba sahaya Allah). Tetapi katakanlah; Ghulaami (pelayanku) dan Jariyati (pelayan perempuanku) atau Faataya (pemudaku) dan Fataati (pemudiku).\""
            },
            {
                "number": 3860,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُولَنَّ أَحَدُكُمْ عَبْدِي فَكُلُّكُمْ عَبِيدُ اللَّهِ وَلَكِنْ لِيَقُلْ فَتَايَ وَلَا يَقُلْ الْعَبْدُ رَبِّي وَلَكِنْ لِيَقُلْ سَيِّدِيو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ كِلَاهُمَا عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِمَا وَلَا يَقُلْ الْعَبْدُ لِسَيِّدِهِ مَوْلَايَ وَزَادَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ فَإِنَّ مَوْلَاكُمْ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali seseorang di antara kamu berkata; 'Abdi (hai budakku) karena kamu semua adalah 'Abiidullah (budak atau hamba Allah) Tetapi katakanlah; Faataya (pemudaku). Dan jangan pula seorang pelayan memanggil majikannya: Rabbi (Tuhanku), tetapi ucapkanlah: Sayyidi (majikanku atau tuanku).\" Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Abu Mu'awiyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Sa'id Al Asyaj]; Telah menceritakan kepada kami [Waki'] keduanya dari [Al A'masy] melalui jalur ini. Dan di dalam Hadits keduanya disebutkan; 'Dan janganlah seorang pelayan memanggil tuannya dengan kalimat 'Maulaaya' karena di dalam Hadits Abu Mu'awiyah di sebutkan; 'Sesungguhnya 'Maulaakum' (pelindungmu) adalah Allah Azza wa Jalla."
            },
            {
                "number": 3861,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَاوَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُلْ أَحَدُكُمْ اسْقِ رَبَّكَ أَطْعِمْ رَبَّكَ وَضِّئْ رَبَّكَ وَلَا يَقُلْ أَحَدُكُمْ رَبِّي وَلْيَقُلْ سَيِّدِي مَوْلَايَ وَلَا يَقُلْ أَحَدُكُمْ عَبْدِي أَمَتِي وَلْيَقُلْ فَتَايَ فَتَاتِي غُلَامِي",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Rafi']; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabih] dia berkata; Inilah yang telah diceritakan kepada kami oleh [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam kemudian dia menyebutkan beberapa Hadits di antaranya; dan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian berkata; 'Beri minum Tuhanmu, beri makan Tuhanmu, wudlukan Tuhanmu, ' dan janganlah salah seorang dari kalian berkata; 'Tuhanku, ' akan tetapi hendaklah ia berkata; 'Tuanku, majikanku, ' dan janganlah salah seorang dari kalian berkata; 'Hamba laki-lakiku dan hamba perempuanku, ' akan tetapi katakanlah, 'Anak mudaku, dan anak mudiku serta anak laki-lakiku.\""
            },
            {
                "number": 3862,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ كِلَاهُمَا عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقُولَنَّ أَحَدُكُمْ خَبُثَتْ نَفْسِي وَلَكِنْ لِيَقُلْ لَقِسَتْ نَفْسِيهَذَا حَدِيثُ أَبِي كُرَيْبٍ و قَالَ أَبُو بَكْرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ لَكِنْ و حَدَّثَنَاه أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Sufyan bin 'Uyainah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al A'la]; Telah menceritakan kepada kami [Abu Usamah] keduanya dari [Hisyam] dari [Bapaknya] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali salah seorang kamu berkata: 'Khabusat nafsi' (diriku buruk), tetapi katakanlah: 'Laqisat nafsi' (diriku kurang).\" 'Ini adalah Hadits Abu Kuraib. Abu Bakr berkata; dari Nabi shallallahu 'alaihi wasallam, namun dia tidak menyebutkan kata; 'Wa laakin.' (akan tetapi). Dan Telah menceritakannya kepada kami [Abu Kuraib] Telah menceritakan kepada kami [Abu Mu'awiyah] melalui jalur ini."
            },
            {
                "number": 3863,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقُلْ أَحَدُكُمْ خَبُثَتْ نَفْسِي وَلْيَقُلْ لَقِسَتْ نَفْسِي",
                "id": "Dan telah menceritakan kepadaku [Abu Ath Thahir] dan [Harmalah] keduanya berkata; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Abu Umamah bin Sahl bin Hunaif] dari [Bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang kamu berkata: 'Khabusat nafsi' (diriku buruk), tetapi katakanlah: 'Laqisat nafsi' (diriku kurang mampu).\""
            },
            {
                "number": 3864,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ شُعْبَةَ حَدَّثَنِي خُلَيْدُ بْنُ جَعْفَرٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَتْ امْرَأَةٌ مِنْ بَنِي إِسْرَائِيلَ قَصِيرَةٌ تَمْشِي مَعَ امْرَأَتَيْنِ طَوِيلَتَيْنِ فَاتَّخَذَتْ رِجْلَيْنِ مِنْ خَشَبٍ وَخَاتَمًا مِنْ ذَهَبٍ مُغْلَقٌ مُطْبَقٌ ثُمَّ حَشَتْهُ مِسْكًا وَهُوَ أَطْيَبُ الطِّيبِ فَمَرَّتْ بَيْنَ الْمَرْأَتَيْنِ فَلَمْ يَعْرِفُوهَا فَقَالَتْ بِيَدِهَا هَكَذَا وَنَفَضَ شُعْبَةُ يَدَهُحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ شُعْبَةَ عَنْ خُلَيْدِ بْنِ جَعْفَرٍ وَالْمُسْتَمِرِّ قَالَا سَمِعْنَا أَبَا نَضْرَةَ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ امْرَأَةً مِنْ بَنِي إِسْرَائِيلَ حَشَتْ خَاتَمَهَا مِسْكًا وَالْمِسْكُ أَطْيَبُ الطِّيبِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Abu Usamah] dari [Syu'bah]; Telah menceritakan kepadaku [Khulaid bin Ja'far] dari [Abu Nadhr] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Pada masa bani Isra`il ada seorang wanita yang pendek badannya berjalan bersama dua orang wanita yang tinggi badannya. lalu ia membuat kaki palsu dari kayu untuk kedua kakinya, dan memakai cincin emas yang dia buatnya. Lalu diberi minyak wangi kesturi, sebaik-baik minyak wangi. Kemudian dia berjalan di antara dua wanita tersebut hingga orang-orang pun tidak mengenalnya. Dia berkata sambil kedua tangannya seperti ini. Syu'bah sambil menggerak-gerakkan tangannya. Telah menceritakan kepada kami ['Amru An Naqid]; Telah menceritakan kepada kami [Yazid bin Harun] dari [Syu'bah] dari [Khulaid bin Ja'far] dan [Al Mustamir] keduanya berkata; Aku mendengar [Abu Nadhrah] bercerita dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam menyebutkan tentang seorang wanita dari bani Israil yang memberi minyak kesturi pada cincinnya. Minyak kesturi adalah sebaik-baik minyak wangi."
            },
            {
                "number": 3865,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ كِلَاهُمَا عَنْ الْمُقْرِئِ قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي جَعْفَرٍ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عُرِضَ عَلَيْهِ رَيْحَانٌ فَلَا يَرُدُّهُ فَإِنَّهُ خَفِيفُ الْمَحْمِلِ طَيِّبُ الرِّيحِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] keduanya dari [Al Muqri]. [Abu Bakr] berkata; Telah menceritakan kepada kami [Abu 'Abdur Rahman Al Muqri] dari [Sa'id bin Abu Ayyub]; Telah menceritakan kepadaku ['ubaidhullah bin Abu Ja'far] dari ['Abdur Rahman Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ditawarkan kepadanya wewangian maka janganlah menolaknya, karena sesungguhnya wangian-wangian ringan bebannya dan harum baunya.\""
            },
            {
                "number": 3866,
                "arab": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ وَأَبُو طَاهِرٍ وَأَحْمَدُ بْنُ عِيسَى قَالَ أَحْمَدُ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَخْرَمَةُ عَنْ أَبِيهِ عَنْ نَافِعٍ قَالَكَانَ ابْنُ عُمَرَ إِذَا اسْتَجْمَرَ اسْتَجْمَرَ بِالْأَلُوَّةِ غَيْرَ مُطَرَّاةٍ وَبِكَافُورٍ يَطْرَحُهُ مَعَ الْأَلُوَّةِ ثُمَّ قَالَ هَكَذَا كَانَ يَسْتَجْمِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepadaku [Harun bin Sa'id Al Aili] dan [Abu Thahir] dan [Ahmad bin 'Isa]. [Ahmad] berkata; Telah menceritakan kepada kami. Dan yang lainnya berkata; Telah mengabarkan kepada kami [Ibnu Wahab] Telah mengabarkan kepadaku [Makhramah] dari [Bapaknya] dari [Nafi'] dia berkata; \"Jika [Ibnu Umar] ingin menggunakan wewangian, ia memakai Al aluwwah (kayu wangi yang dibakar) tanpa campuran, terkadang juga memakai kapur yang dicampur dengan Al aluwwah. Lalu ia berkata, \"Beginilah kebiasaan Rasulullah shallallahu 'alaihi wasallam saat memakai minyak wangi.\""
            },
            {
                "number": 3867,
                "arab": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ كِلَاهُمَا عَنْ ابْنِ عُيَيْنَةَ قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَرَدِفْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَالَ هَلْ مَعَكَ مِنْ شِعْرِ أُمَيَّةَ بْنِ أَبِي الصَّلْتِ شَيْءٌ قُلْتُ نَعَمْ قَالَ هِيهْ فَأَنْشَدْتُهُ بَيْتًا فَقَالَ هِيهْ ثُمَّ أَنْشَدْتُهُ بَيْتًا فَقَالَ هِيهْ حَتَّى أَنْشَدْتُهُ مِائَةَ بَيْتٍو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ وَأَحْمَدُ بْنُ عَبْدَةَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ أَوْ يَعْقُوبَ بْنِ عَاصِمٍ عَنْ الشَّرِيدِ قَالَ أَرْدَفَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلْفَهُ فَذَكَرَ بِمِثْلِهِ و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ كِلَاهُمَا عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الطَّائِفِيِّ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَ اسْتَنْشَدَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ وَزَادَ قَالَ إِنْ كَادَ لِيُسْلِمُ وَفِي حَدِيثِ ابْنِ مَهْدِيٍّ قَالَ فَلَقَدْ كَادَ يُسْلِمُ فِي شِعْرِهِ",
                "id": "Telah menceritakan kepada kami ['Amru An Naqid] dan [Ibnu Abu 'Umar] keduanya dari [Ibnu 'Uyainah]. [Ibnu Abu 'Umar] berkata; Telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] dari ['Amru bin Asy Syarid] dari [Bapaknya] dia berkata; 'Pada suatu hari aku dibonceng oleh Rasulullah shallallahu 'alaihi wasallam, lalu beliau bertanya kepadaku; 'Apakah kamu hafal syairnya Umayyah bin Abu Shalt? Aku menjawab; 'Ya.' Kata beliau; 'Lantunkanlah untukku! ' lalu aku melantunkannya satu bait syair. Kemudian beliau berkata; 'Tambah lagi! Kemudian aku lantunkan lagi. Namun beliau berkata; 'Tambah lagi! ' hingga aku melantunkannya sebanyak seratus bait. Dan telah menceritakannya kepadaku [Zuhair bin Harb] dan [Ahmad bin Abdah] seluruhnya dari [Ibnu Uyainah] dari [Ibrahim bin Maisarah] dari [Amru bin Syarid] atau [Ya'qub bin 'Ashim bin As Syarid] dia berkata; 'Pada suatu hari Rasulullah shallallahu 'alaihi wasallam memboncengku. -lalu dia menyebutkan Hadits yang serupa.- Dan Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Al Mu'tamir bin Sulaiman]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Zuhair bin Harb]; Telah menceritakan kepada kami ['Abdur Rahman bin Mahdi] keduanya dari ['Abdullah bin 'Abdur Rahman Ath Thaifi] dari ['Amru bin Asy Syarid] dari [Bapaknya] dia berkata; Rasulullah shallallahu 'alaihi wasallam memintaku untuk menyenandungkan syair….-serupa dengan Hadits Ibrahim bin Maisarah- namun ada tambahan; 'Hampir saja dia masuk Islam.' Di dalam Hadits Ibnu Mahdi di sebutkan; 'Sungguh hampir saja dia masuk Islam karena syairnya.'"
            },
            {
                "number": 3868,
                "arab": "حَدَّثَنِي أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ جَمِيعًا عَنْ شَرِيكٍ قَالَ ابْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَشْعَرُ كَلِمَةٍ تَكَلَّمَتْ بِهَا الْعَرَبُ كَلِمَةُ لَبِيدٍ أَلَا كُلُّ شَيْءٍ مَا خَلَا اللَّهَ بَاطِلٌ",
                "id": "Telah menceritakan kepadaku [Abu Ja'far Muhammad bin Ash Shabbah] dan ['Ali bin Hujr As Sa'di] seluruhnya dari [Syarik]. [Ibnu Hujr] berkata; Telah mengabarkan kepada kami [Syarik] dari ['Abdul Malik bin 'Umair] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sya'ir (atau sajak) paling indah yang pernah diungkapkan orang Arab ialah sajaknya Labid. Labid bersya'ir: Alaa, kullu syaiin maa khalallaha bathil (Ketahuilah, segala sesuatu selain Allah itu pasti binasa)."
            },
            {
                "number": 3869,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ حَدَّثَنَا ابْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْدَقُ كَلِمَةٍ قَالَهَا شَاعِرٌ كَلِمَةُ لَبِيدٍ أَلَا كُلُّ شَيْءٍ مَا خَلَا اللَّهَ بَاطِلٌوَكَادَ أُمَيَّةُ بْنُ أَبِي الصَّلْتِ أَنْ يُسْلِمَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim bin Maimun]; Telah menceritakan kepada kami [Ibnu Mahdi] dari [Sufyan] dari ['Abdul Malik bin 'Umair]; Telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sya'ir paling benar yang pernah di ucapkan oleh penyair adalah syairnya Labid. Labid bersya'ir: Alaa, kullu syaiin maa khalallaha bathil (Ketahuilah, segala sesuatu selain Allah itu pasti binasa). Dan hampir saja Umayyah bin Abu Shalt masuk Islam."
            },
            {
                "number": 3870,
                "arab": "و حَدَّثَنِي ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ زَائِدَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَصْدَقُ بَيْتٍ قَالَهُ الشَّاعِرُ أَلَا كُلُّ شَيْءٍ مَا خَلَا اللَّهَ بَاطِلٌوَكَادَ ابْنُ أَبِي الصَّلْتِ أَنْ يُسْلِمَ",
                "id": "Dan telah menceritakan kepadaku [Ibnu Abu 'Umar]; Telah menceritakan kepada kami [Sufyan] dari [Zaidah] dari ['Abdul Malik bin 'Umair] dari [Abu Salamah bin 'Abdur Rahman] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sya'ir paling benar yang pernah di ucapkan oleh penyair adalah syair: \"Alaa, kullu syaiin maa khalallaha bathil (Ketahuilah, segala sesuatu selain Allah itu pasti binasa).\" Hingga hampir saja Umayyah bin Abu Shalt masuk Islam."
            },
            {
                "number": 3871,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَصْدَقُ بَيْتٍ قَالَتْهُ الشُّعَرَاءُ أَلَا كُلُّ شَيْءٍ مَا خَلَا اللَّهَ بَاطِلٌ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna]; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dari ['Abdul Malik bin 'Umair] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sya'ir paling benar yang pernah di ucapkan oleh para penyair adalah syair: \"Alaa, kullu syaiin maa khalallaha bathil (Ketahuilah, segala sesuatu selain Allah itu pasti binasa).\""
            },
            {
                "number": 3872,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ عَنْ إِسْرَائِيلَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُاسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَصْدَقَ كَلِمَةٍ قَالَهَا شَاعِرٌ كَلِمَةُ لَبِيدٍ أَلَا كُلُّ شَيْءٍ مَا خَلَا اللَّهَ بَاطِلٌمَا زَادَ عَلَى ذَلِكَ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Yahya bin Zakaria] dari [Israil] dari ['Abdul Malik bin 'Umair] dari [Abu Salamah bin 'Abdur Rahman] dia berkata; Aku mendengar [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sya'ir paling benar yang pernah di ucapkan oleh seorang penyair adalah syairnya Labid, dia bersyair: \"Alaa, kullu syaiin maa khalallaha bathil (Ketahuilah, segala sesuatu selain Allah itu pasti binasa).\" Dan beliau tidak menambahkan lebih dari itu."
            },
            {
                "number": 3873,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصٌ وَأَبُو مُعَاوِيَةَ و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ كِلَاهُمَا عَنْ الْأَعْمَشِ ح و حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَمْتَلِئَ جَوْفُ الرَّجُلِ قَيْحًا يَرِيهِ خَيْرٌ مِنْ أَنْ يَمْتَلِئَ شِعْرًاقَالَ أَبُو بَكْرٍ إِلَّا أَنَّ حَفْصًا لَمْ يَقُلْ يَرِيهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Hafsh] dan [Abu Mu'awiyah]; Dan telah menceritakan kepada kami [Abu Kuraib]; Telah menceritakan kepada kami [Abu Mu'awiyah] keduanya dari [Al 'masy]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Sa'id Al Asyaj]; Telah menceritakan kepada kami [Waki']; Telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perut orang yang penuh muntah hingga kenyang lebih baik daripada perut yang penuh dengan sya'ir (sajak).\" Abu Bakr berkata; 'Namun Hafs tidak mengatakan kalimat 'Yurihi.'"
            },
            {
                "number": 3874,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ سَعْدٍ عَنْ سَعْدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا يَرِيهِ خَيْرٌ مِنْ أَنْ يَمْتَلِئَ شِعْرًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] keduanya berkata; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Yunus bin Jubair] dari [Muhammad bin Sa'd] dari [Sa'ad] dari Nabi shallallahu 'alaihi wasallam: \"Sesungguhnya perut orang yang penuh muntah hingga kenyang di antara kalian lebih baik daripada perut yang penuh dengan sya'ir (sajak).\""
            }
        ]
    }
}