{
    "status": true,
    "data": {
        "start": 2832,
        "end": 2980,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 2832,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا وَقَفَ عَلَى الصَّفَا يُكَبِّرُ ثَلَاثًا وَيَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ يَصْنَعُ ذَلِكَ ثَلَاثَ مَرَّاتٍ وَيَدْعُو وَيَصْنَعُ عَلَى الْمَرْوَةِ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] serta [Al Harits bin Miskin] dengan membaca riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Ja'far bin Muhammad] dari [ayahnya] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam apabila berdiri di atas Shafa mengucapkan takbir tiga kali, dan mengucapkan: LAA ILAAHA ILLALLAAH WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI IN QADIIR, beliau melakukan hal tersebut tiga kali dan berdo'a serta melakukan seperti hal tersebut di atas Marwah. "
            },
            {
                "number": 2833,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ أَنْبَأَنَا شُعَيْبٌ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ مُحَمَّدٍ أَنَّهُ سَمِعَ أَبَاهُ يُحَدِّثُأَنَّهُ سَمِعَ جَابِرًا عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ وَقَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الصَّفَا يُهَلِّلُ اللَّهَ عَزَّ وَجَلَّ وَيَدْعُو بَيْنَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Yazid], ia berkata; telah memberitakan kepada kami [Syu'aib], ia berkata; telah memberitakan kepadaku [Ibnu Juraij], ia berkata; telah memberitakan kepadaku [Ja'far bin Muhammad] bahwa ia mendengar [ayahnya] menceritakan bahwa ia mendengar [Jabir] mengenai haji Nabi shallallahu 'alaihi wasallam, kemudian Nabi shallallahu 'alaihi wasallam berdiri di atas Shafa mengucapkan tahlil kepada Allah 'azza wajalla dan berdo'a diantara hal tersebut. "
            },
            {
                "number": 2834,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ شُعَيْبٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ الْهَادِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَطَافَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْبَيْتِ سَبْعًا رَمَلَ مِنْهَا ثَلَاثًا وَمَشَى أَرْبَعًا ثُمَّ قَامَ عِنْدَ الْمَقَامِ فَصَلَّى رَكْعَتَيْنِ وَقَرَأَ{ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى }وَرَفَعَ صَوْتَهُ يُسْمِعُ النَّاسَ ثُمَّ انْصَرَفَ فَاسْتَلَمَ ثُمَّ ذَهَبَ فَقَالَ نَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهَا حَتَّى بَدَا لَهُ الْبَيْتُ وَقَالَ ثَلَاثَ مَرَّاتٍ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَكَبَّرَ اللَّهَ وَحَمِدَهُ ثُمَّ دَعَا بِمَا قُدِّرَ لَهُ ثُمَّ نَزَلَ مَاشِيًا حَتَّى تَصَوَّبَتْ قَدَمَاهُ فِي بَطْنِ الْمَسِيلِ فَسَعَى حَتَّى صَعِدَتْ قَدَمَاهُ ثُمَّ مَشَى حَتَّى أَتَى الْمَرْوَةَ فَصَعِدَ فِيهَا ثُمَّ بَدَا لَهُ الْبَيْتُ فَقَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ قَالَ ذَلِكَ ثَلَاثَ مَرَّاتٍ ثُمَّ ذَكَرَ اللَّهَ وَسَبَّحَهُ وَحَمِدَهُ ثُمَّ دَعَا عَلَيْهَا بِمَا شَاءَ اللَّهُ فَعَلَ هَذَا حَتَّى فَرَغَ مِنْ الطَّوَافِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Hakam] dari [Syu'aib], ia berkata; telah memberitakan kepada kami [Al Laits] dari [Ibnu Al Had] dari [Ja'far bin Muhammad] dari [ayahnya] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam melakukan thawaf di Ka'bah sebanyak tujuh kali, berjalan cepat sebanyak tiga kali dan berjalan biasa sebanyak empat kali, kemudian berdiri di sisi Maqam lalu melakukan sholat dua rakaat, dan membaca WAT TAKHIDZUU MIN MAQAAMI IBRAAHIIMA MUSHALLAA, beliau mengeraskan suara sehingga didengar manusia. Kemudian berpaling lalu meng-istilami dan pergi sambil mengatakan: \"Kita memulai dengan yang dimulai Allah.\" Lalu beliau memulai dengan Shafa dan menaikinya hingga nampak baginya Ka'bah, serta mengucapkan sebanyak tiga kali LAA ILAAHA ILLALLAAH WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU WA LAHUL HAMDU YUHYII WA YUMIITU WA HUWA 'ALAA KULLI SYAI IN QADIIR, dan bertakbir kepada Allah serta memujinya, kemudian berdo'a dengan yang dimampu. Lalu turun dengan berjalan hingga kedua telapak kakinya turun di Bathnil Masil, dan berjalan hingga kedua telapak kakinya naik. Kemudian beliau berjalan mendatangi Marwah, lalu menaikinya dan nampak baginya Ka'bah serta mengucapkan: LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI IN QADIIR. Beliau mengucapkan hal tersebut sebanyak tiga kali, kemudian berdzikir kepada Allah dan bertasbih kepada-Nya serta memujinya kemudian berdo'a di atasnya dengan yang dikehendaki Allah, beliau melakukan hal ini hingga selesai dari thawafnya. "
            },
            {
                "number": 2835,
                "arab": "أَخْبَرَنِي عِمْرَانُ بْنُ يَزِيدَ قَالَ أَنْبَأَنَا شُعَيْبٌ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُطَافَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ عَلَى رَاحِلَتِهِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ لِيَرَاهُ النَّاسُ وَلِيُشْرِفَ وَلِيَسْأَلُوهُ إِنَّ النَّاسَ غَشُوهُ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Yazid], ia berkata; telah memberitakan kepada kami [Syu'aib], ia berkata; telah memberitakan kepada kami [Ibnu Juraij], ia berkata; telah memberitakan kepadaku [Abu Az Zubair] bahwa ia telah mendengar [Jabir bin Abdullah] berkata; Nabi shallallahu 'alaihi wasallam melakukan thawaf di saat haji wada' di atas kendaraannya di Ka'bah, dan diantara Shafa dan Marwah, agar manusia melihat, memperhatikan, dan bertanya kepadanya, karena sesungguhnya manusia mengelilinginya. "
            },
            {
                "number": 2836,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ كَثِيرِ بْنِ جُمْهَانَ قَالَرَأَيْتُ ابْنَ عُمَرَ يَمْشِي بَيْنَ الصَّفَا وَالْمَرْوَةِ فَقَالَ إِنْ أَمْشِي فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي وَإِنْ أَسْعَى فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْعَىأَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا الثَّوْرِيُّ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ رَأَيْتُ ابْنَ عُمَرَ ذَكَرَ نَحْوَهُ إِلَّا أَنَّهُ قَالَ وَأَنَا شَيْخٌ كَبِيرٌ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan], ia berkata; telah menceritakan kepada kami [Bisyr bin As Sari], ia berkata; telah menceritakan kepada kami [Sufyan] dari ['Atho` bin As Saib] dari [Katsir bin Jumhan], ia berkata; saya pernah mendengar [Ibnu Umar] berjalan diantara Shafa dan Marwah, lalu berkata; jika saya berjalan sungguh saya telah melihat Rasulullah shallallahu 'alaihi wasallam berjalan, dan jika saya bersa'i (berlari kecil) sungguh saya telah melihat Rasulullah shallallahu 'alaihi wasallam bersa'i (berlari kecil). Telah mengabarkan kepada kami [Muhammad bin Rafi'], ia berkata; telah menceritakan kepada kami [Abdur Razzaq], ia berkata; telah memberitakan kepada kami [Ats Tsauri] dari [Abdul Karim Al Jazari] dari [Sa'id bin Jubair], ia berkata; saya pernah melihat [Ibnu Umar] menyebutkan hal sama hanya saja ia berkata; dan saya adalah orang yang sudah tua. "
            },
            {
                "number": 2837,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا صَدَقَةُ بْنُ يَسَارٍ عَنْ الزُّهْرِيِّ قَالَسَأَلُوا ابْنَ عُمَرَ هَلْ رَأَيْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَلَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَقَالَ كَانَ فِي جَمَاعَةٍ مِنْ النَّاسِ فَرَمَلُوا فَلَا أُرَاهُمْ رَمَلُوا إِلَّا بِرَمَلِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan], ia berkata; telah menceritakan kepada kami [Shadaqah bin Yasar] dari [Az Zurhri], ia berkata; orang-orang bertanya kepada [Ibnu Umar]; apakah engkau melihat Rasulullah shallallahu 'alaihi wasallam berlari-lari kecil diantara Shafa dan Marwah? Ia menjawab; beliau berada diantara sekelompok manusia dan mereka berlari-lari kecil, maka aku tidak melihat mereka berlari kecuali seperti lari yang beliau lakukan."
            },
            {
                "number": 2838,
                "arab": "أَخْبَرَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَإِنَّمَا سَعَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الصَّفَا وَالْمَرْوَةِ لِيُرِيَ الْمُشْرِكِينَ قُوَّتَهُ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ammar Al Husain bin Huraits], ia berkata; telah memberitakan kepada kami [Sufyan] dari ['Amr] dari ['Atho`] dari [Ibnu Abbas], ia berkata; Nabi shallallahu 'alaihi wasallam melakukan sa'i antara Shafa dan Marwah untuk memperlihatkan kekuatannya kepada orang-orang musyrik. "
            },
            {
                "number": 2839,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ بُدَيْلٍ عَنْ الْمُغِيرَةِ بْنِ حَكِيمٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ امْرَأَةٍ قَالَتْرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْعَى فِي بَطْنِ الْمَسِيلِ وَيَقُولُ لَا يُقْطَعُ الْوَادِي إِلَّا شَدًّا",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Hammad] dari [Budail] dari [Al Mughirah bin Hakim] dari [Shafiyah binti Syaibah] dari [seorang wanita], ia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam melakukan sa'i di lembah bersungai (bathnul masil) dan bersabda: \" Lembah ini tidak bisa dikarungi kecuali dengan perjuangan berat.\""
            },
            {
                "number": 2840,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا نَزَلَ مِنْ الصَّفَا مَشَى حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي بَطْنِ الْوَادِي سَعَى حَتَّى يَخْرُجَ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] serta [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Ja'far bin Muhammad] dari [ayahnya] dari [Jabir bin Abdullah] radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam apabila turun dari Shafa dan Marwah beliau berjalan hingga jika kedua telapak kakinya di tengah bukit beliau bersa'i hingga keluar darinya. "
            },
            {
                "number": 2841,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ سُفْيَانَ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَلَمَّا تَصَوَّبَتْ قَدَمَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَطْنِ الْوَادِي رَمَلَ حَتَّى خَرَجَ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Sufyan] dari [Ja'far] dari [ayahnya] dari [Jabir], ia berkata; tatkala kedua telapak kaki Rasulullah shallallahu 'alaihi wasallam turun di tengah bukit beliau berjalan cepat hingga keluar darinya. "
            },
            {
                "number": 2842,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا جَابِرٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ يَعْنِي عَنْ الصَّفَا حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي الْوَادِي رَمَلَ حَتَّى إِذَا صَعِدَ مَشَى",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Yahya bin Sa'id], ia berkata; telah menceritakan kepada kami [Ja'far bin Muhammad], ia berkata; telah menceritakan kepadaku [ayahku], ia berkata; telah menceritakan kepada kami [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam turun dari Shafa hingga setelah telapak kakinya turun di bukit beliau berjalan cepat hingga apabila naik beliau berjalan. "
            },
            {
                "number": 2843,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ الْهَادِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَرْوَةَ فَصَعِدَ فِيهَا ثُمَّ بَدَا لَهُ الْبَيْتُ فَقَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ قَالَ ذَلِكَ ثَلَاثَ مَرَّاتٍ ثُمَّ ذَكَرَ اللَّهَ وَسَبَّحَهُ وَحَمِدَهُ ثُمَّ دَعَا بِمَا شَاءَ اللَّهُ فَعَلَ هَذَا حَتَّى فَرَغَ مِنْ الطَّوَافِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Abdul Hakam] dari [Syu'aib], ia berkata; telah memberitakan kepada kami [Al Laits] dari [Ibnu Al Had] dari [Ja'far bin Muhammad] dari [ayahnya] dari [Jabir bin Abdullah], Rasulullah shallallahu 'alaihi wasallam datang ke Marwah kemudian menaikinya dan nampak baginya Ka'bah, lalu mengucapkan: LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI IN QADIIR. Beliau mengucapkan hal tersebut sebanyak tiga kali, kemudian berdzikir kepada Allah, dan memuji-Nya, kemudian berdo'a dengan yang dikehendaki Allah. Beliau melakukan hal ini hingga selesai dari thawaf. "
            },
            {
                "number": 2844,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ أَنْبَأَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ إِلَى الصَّفَا فَرَقِيَ عَلَيْهَا حَتَّى بَدَا لَهُ الْبَيْتُ ثُمَّ وَحَّدَ اللَّهَ عَزَّ وَجَلَّ وَكَبَّرَ وَقَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ثُمَّ مَشَى حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ سَعَى حَتَّى إِذَا صَعِدَتْ قَدَمَاهُ مَشَى حَتَّى أَتَى الْمَرْوَةَ فَفَعَلَ عَلَيْهَا كَمَا فَعَلَ عَلَى الصَّفَا حَتَّى قَضَى طَوَافَهُ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Isma'il], ia berkata; telah memberitakan kepada kami [Ja'far bin Muhammad] dari [ayahnya] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam pergi ke Shafa lalu menaikinya hingga nampak baginya Ka'bah, kemudian mentauhidkan Allah 'azza wajalla, dan bertakbir, beliau mengucapkan: LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU WA LAHUL HAMDU YUHYII WA YUMIITU WA HUWA 'ALAA KULLI SYAI IN QADIIR, kemudian berjalan hingga setelah kedua telapak kakinya turun, beliau melakukan sa'i hingga apabila kedua telapak kakinya telah naik beliau berjalan hingga sampai ke Marwah, lalu melakukan padanya sebagaimana yang telah beliau lakukan di Shafa hingga menyelesaikan thawafnya. "
            },
            {
                "number": 2845,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُلَمْ يَطُفْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ بَيْنَ الصَّفَا وَالْمَرْوَةِ إِلَّا طَوَافًا وَاحِدًا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah memberitakan kepada kami [Ibnu Juraij], ia berkata; telah memberitakan kepadaku [Abu Az Zubair] bahwa ia telah mendengar [Jabir] berkata; Nabi shallallahu 'alaihi wasallam serta para sahabatnya tidak melakukan thawaf diantara Shafa dan Marwah kecuali sekali. "
            },
            {
                "number": 2846,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ أَنَّ طَاوُسًا أَخْبَرَهُ أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُ عَنْ مُعَاوِيَةَأَنَّهُ قَصَّرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِشْقَصٍ فِي عُمْرَةٍ عَلَى الْمَرْوَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Yahya bin Sa'id] dari [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Al Hasan bin Muslim] bahwa [Thawus] telah mengabarkan kepadanya bahwa [Ibnu Abbas] telah mengabarkan kepadanya dari [Mu'awiyah] bahwa ia memendekkan rambut Nabi shallallahu 'alaihi wasallam dengan bagian anak panah yang tajam ketika berumrah di atas Marwah. "
            },
            {
                "number": 2847,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مُعَاوِيَةَ قَالَقَصَّرْتُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمَرْوَةِ بِمِشْقَصِ أَعْرَابِيٍّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Abdullah], ia berkata; telah menceritakan kepada kami [Abdur Razzaq], ia berkata; telah memberitakan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] dari [Mu'awiyah], ia berkata; saya telah memendekkan rambut Rasulullah shallallahu 'alaihi wasallam di atas Marwah dengan bagian anak panah badui yang tajam."
            },
            {
                "number": 2848,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءٍ عَنْ مُعَاوِيَةَ قَالَأَخَذْتُ مِنْ أَطْرَافِ شَعْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِشْقَصٍ كَانَ مَعِي بَعْدَ مَا طَافَ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ فِي أَيَّامِ الْعَشْرِقَالَ قَيْسٌ وَالنَّاسُ يُنْكِرُونَ هَذَا عَلَى مُعَاوِيَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Al Hasan bin Musa], ia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Qais bin Sa'd] dari ['Atho`] dari [Mu'awiyah], ia berkata; saya mengambil ujung rambut Rasulullah shallallahu 'alaihi wasallam dengan bagian anak panah yang tajam yang saya bawa, beliau tidak melakukan thawaf di Ka'bah, serta Shafa dan Marwah pada sepuluh hari. Qais berkata; dan orang-orang mengingkari apa yang dilakukan Mu'awiyah ini. "
            },
            {
                "number": 2849,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ عَنْ يَحْيَى وَهُوَ ابْنُ آدَمَ عَنْ سُفْيَانَ وَهُوَ ابْنُ عُيَيْنَةَ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نُرَى إِلَّا الْحَجَّ قَالَتْ فَلَمَّا أَنْ طَافَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَ مَنْ كَانَ مَعَهُ هَدْيٌ فَلْيُقِمْ عَلَى إِحْرَامِهِ وَمَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ فَلْيَحْلِلْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dari [Yahya yaitu Ibnu Adam] dari [Sufyan yaitu Ibnu 'Uyainah], ia berkata; telah menceritakan kepadaku [Abdur Rahman bin al Qasim] dari [ayahnya] dari [Aisyah], ia berkata; kami keluar bersama Rasulullah shallallahu 'alaihi wasallam, dan tidak terlihat kecuali melakukan haji. Ia berkata; tatkala beliau telah melakukan thawaf di Ka'bah serta Shafa dan Marwah beliau bersabda: \"Barang siapa yang membawa hewan kurban maka hendaknya ia tetap berada dalam ihramnya dan barang siapa yang tidak membawa hewan kurban maka hendaknya ia bertahallul.\""
            },
            {
                "number": 2850,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ فَمِنَّا مَنْ أَهَلَّ بِالْحَجِّ وَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ وَأَهْدَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَهَلَّ بِعُمْرَةٍ وَلَمْ يُهْدِ فَلْيَحْلِلْ وَمَنْ أَهَلَّ بِعُمْرَةٍ فَأَهْدَى فَلَا يَحِلَّ وَمَنْ أَهَلَّ بِحَجَّةِ فَلْيُتِمَّ حَجَّهُقَالَتْ عَائِشَةُ وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim], ia berkata; telah memberitakan kepada kami [Suwaid], ia berkata; telah memberitakan kepada kami [Abdullah] dari [Yunus] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah], ia berkata; kami keluar bersama Rasulullah shallallahu 'alaihi wasallam ketika haji wada', diantara kami ada yang mengucapkan do'a talbiyah untuk melakukan haji dan diantara kami ada yang mengucapkan do'a talbiyah untuk melakukan umrah dan berkurban. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mengucapkan do'a talbiyah untuk melakukan umrah dan belum berkurban maka hendaknya ia bertahallul dan barang siapa yang mengucapkan do'a talbiyah untuk melakukan umrah lalu berkurban maka janganlah ia bertahallul dan barang siapa yang mengucapkan do'a talbiyah untuk melakukan haji maka hendaknya ia menyempurnakan hajinya.\" Aisyah berkata; saya adalah diantara orang yang mengucapkan do'a talbiyah untuk melakukan umrah. "
            },
            {
                "number": 2851,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو هِشَامٍ قَالَ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْقَدِمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُهِلِّينَ بِالْحَجِّ فَلَمَّا دَنَوْنَا مِنْ مَكَّةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ فَلْيَحْلِلْ وَمَنْ كَانَ مَعَهُ هَدْيٌ فَلْيُقِمْ عَلَى إِحْرَامِهِقَالَتْ وَكَانَ مَعَ الزُّبَيْرِ هَدْيٌ فَأَقَامَ عَلَى إِحْرَامِهِ وَلَمْ يَكُنْ مَعِي هَدْيٌ فَأَحْلَلْتُ فَلَبِسْتُ ثِيَابِي وَتَطَيَّبْتُ مِنْ طِيبِي ثُمَّ جَلَسْتُ إِلَى الزُّبَيْرِ فَقَالَ اسْتَأْخِرِي عَنِّي فَقُلْتُ أَتَخْشَى أَنْ أَثِبَ عَلَيْكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Mubarak], ia berkata; telah menceritakan kepada kami [Abu Hisyam], ia berkata; telah menceritakan kepada kami [Wuhaib bin Khalid] dari [Manshur bin Abdur Rahman] dari [ibunya] dari [Asma` binti Abu Bakr], ia berkata; kami datang bersama Rasulullah shallallahu 'alaihi wasallam dengan mengucapkan do'a talbiyah untuk melakukan haji. Kemudian setelah mendekati Mekkah Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang tidak membawa hewan kurban maka hendaknya ia bertahallul dan barang siapa yang membawa hewan kurban maka hendaknya ia tetap berada dalam ihramnya.\" Aisyah berkata; dan Az Zubair membawa hewan kurban, sehingga ia tetap berada dalam ihramnya sedang saya tidak membawa hewan kurban, sehingga saya bertahallul lalu memakai pakaianku, dan memakai minyak wangiku. Kemudian saya duduk dekat dengan Az Zubair, lalu ia berkata; mundurlah dariku. Maka saya katakan; apakah engkau khawatir saya meloncat kepadamu? "
            },
            {
                "number": 2852,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ قَرَأْتُ عَلَى أَبِي قُرَّةَ مُوسَى بْنِ طَارِقٍ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ رَجَعَ مِنْ عُمْرَةِ الْجِعِرَّانَةِ بَعَثَ أَبَا بَكْرٍ عَلَى الْحَجِّ فَأَقْبَلْنَا مَعَهُ حَتَّى إِذَا كَانَ بِالْعَرْجِ ثَوَّبَ بِالصُّبْحِ ثُمَّ اسْتَوَى لِيُكَبِّرَ فَسَمِعَ الرَّغْوَةَ خَلْفَ ظَهْرِهِ فَوَقَفَ عَلَى التَّكْبِيرِ فَقَالَ هَذِهِ رَغْوَةُ نَاقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَدْعَاءِ لَقَدْ بَدَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَجِّ فَلَعَلَّهُ أَنْ يَكُونَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُصَلِّيَ مَعَهُ فَإِذَا عَلِيٌّ عَلَيْهَا فَقَالَ لَهُ أَبُو بَكْرٍ أَمِيرٌ أَمْ رَسُولٌ قَالَ لَا بَلْ رَسُولٌ أَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَرَاءَةَ أَقْرَؤُهَا عَلَى النَّاسِ فِي مَوَاقِفِ الْحَجِّ فَقَدِمْنَا مَكَّةَ فَلَمَّا كَانَ قَبْلَ التَّرْوِيَةِ بِيَوْمٍ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَخَطَبَ النَّاسَ فَحَدَّثَهُمْ عَنْ مَنَاسِكِهِمْ حَتَّى إِذَا فَرَغَ قَامَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا ثُمَّ خَرَجْنَا مَعَهُ حَتَّى إِذَا كَانَ يَوْمُ عَرَفَةَ قَامَ أَبُو بَكْرٍ فَخَطَبَ النَّاسَ فَحَدَّثَهُمْ عَنْ مَنَاسِكِهِمْ حَتَّى إِذَا فَرَغَ قَامَ عَلِيٌّ فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا ثُمَّ كَانَ يَوْمُ النَّحْرِ فَأَفَضْنَا فَلَمَّا رَجَعَ أَبُو بَكْرٍ خَطَبَ النَّاسَ فَحَدَّثَهُمْ عَنْ إِفَاضَتِهِمْ وَعَنْ نَحْرِهِمْ وَعَنْ مَنَاسِكِهِمْ فَلَمَّا فَرَغَ قَامَ عَلِيٌّ فَقَرَأَ عَلَى النَّاسِ بَرَاءَةٌ حَتَّى خَتَمَهَا فَلَمَّا كَانَ يَوْمُ النَّفْرِ الْأَوَّلُ قَامَ أَبُو بَكْرٍ فَخَطَبَ النَّاسَ فَحَدَّثَهُمْ كَيْفَ يَنْفِرُونَ وَكَيْفَ يَرْمُونَ فَعَلَّمَهُمْ مَنَاسِكَهُمْ فَلَمَّا فَرَغَ قَامَ عَلِيٌّ فَقَرَأَ بَرَاءَةٌ عَلَى النَّاسِ حَتَّى خَتَمَهَاقَالَ أَبُو عَبْد الرَّحْمَنِ ابْنُ خُثَيْمٍ لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ وَإِنَّمَا أَخْرَجْتُ هَذَا لِئَلَّا يُجْعَلَ ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ وَمَا كَتَبْنَاهُ إِلَّا عَنْ إِسْحَقَ بْنِ إِبْرَاهِيمَ وَيَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ لَمْ يَتْرُكْ حَدِيثَ ابْنِ خُثَيْمٍ وَلَا عَبْدِ الرَّحْمَنِ إِلَّا أَنَّ عَلِيَّ بْنَ الْمَدِينِيِّ قَالَ ابْنُ خُثَيْمٍ مُنْكَرُ الْحَدِيثِ وَكَأَنَّ عَلِيَّ بْنَ الْمَدِينِيِّ خُلِقَ لِلْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; saya membacakan riwayat kepada [Abu Qurrah Musa bin Thariq] dari [Ibnu Juraij], ia berkata; telah menceritakan kepadaku [Abdullah bin Utsman bn Khutsaim] dari [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam ketika kembali dari umrah di Ji'ranah beliau mengutus Abu Bakar memimpin haji, lalu kami datang bersamanya, hingga ketika sampai di Al 'Arj ia mengumandangkan adzan untuk sholat shubuh, lalu ia berdiri untuk bertakbir, kemudian ia mendengar suara unta dibelakangnya dan berhenti bertakbir, ia berkata 'ini adalah suara unta shallallahu 'alaihi wasallam Al Jad'a', tampaknya Rasulullah shallallahu 'alaihi wasallam melaksanakan haji, dan semoga ia adalah Rasulullah shallallahu 'alaihi wasallam sehingga kita melaksanakan sholat bersama beliau, namun ternyata Ali yang berada diatas unta tersebut, kemudian Abu Bakar berkata kepadanya; engkau sebagai amir atau utusan. Ia menjawab; tidak, aku hanyalah utusan Rasulullah shallallahu 'alaihi wasallam dengan surat Bara-ah yang akan saya bacakan di beberapa tempat pemberhentian untuk haji. Kemudian kami sampai di Mekkah, setelah sehari sebelum Tarwiyah (tanggal delapan dzulhijjah), Abu Bakar radliallahu 'anhu berdiri didepan manusia kemudian berkhutbah kepada manusia, ia berbicara mengenai ibadah haji mereka hingga setelah ia selesai, lalu Ali radliallahu 'anhu berdiri dan membacakan surat Taubah hingga selesai. Kemudian pada hari Kurban kami melakukan thawaf ifadhah, lalu setelah Abu Bakar kembali ia berkhutbah kepada manusia, ia berbicara mengenai ibadah thawaf ifadhah serta penyembelihan kurban, serta ibadah haji mereka. Setelah ia selesai, Ali berdiri dan membacakan surat Taubah hingga ia menyelesaikannya. Kemudian pada hari Nafar pertama Abu Bakar berdiri kemudian berkhutbah kepada manusia, ia berbicara mengenai bagaimana mereka kembali dari Mina, dan bagaimana mereka melempar jumrah, ia mengajarkan kepada mereka cara-cara ibadah haji mereka. Setelah ia selesai, Ali berdiri dan membacakan surat Taubah hingga ia menyelesaikannya. Abu Abdurrahman berkata; Ibnu Khutsaim tidaklah kuat dalam hal hadits, saya menyebutkannya agar Ibn Juraij tidak dijadikan dari Abi Zubair, dan tidaklah kami menulisnya kecuali dari ishaq bin Ibrahim dan Yahya bin Sa'id Alqaththan, ia tidak meninggalkan hadits Ibn Khutsaim dan Abdurrahman hanya saja Ali bin Al Madini berkata; Ibn Hutsaim itu haditsnya mungkar, dan sepertinya Ali bin Madini diciptakan untuk meriwayatkan hadits."
            },
            {
                "number": 2853,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَقَدِمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَرْبَعٍ مَضَيْنَ مِنْ ذِي الْحِجَّةِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحِلُّوا وَاجْعَلُوهَا عُمْرَةً فَضَاقَتْ بِذَلِكَ صُدُورُنَا وَكَبُرَ عَلَيْنَا فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا أَيُّهَا النَّاسُ أَحِلُّوا فَلَوْلَا الْهَدْيُ الَّذِي مَعِي لَفَعَلْتُ مِثْلَ الَّذِي تَفْعَلُونَ فَأَحْلَلْنَا حَتَّى وَطِئْنَا النِّسَاءَ وَفَعَلْنَا مَا يَفْعَلُ الْحَلَالُ حَتَّى إِذَا كَانَ يَوْمُ التَّرْوِيَةِ وَجَعَلْنَا مَكَّةَ بِظَهْرٍ لَبَّيْنَا بِالْحَجِّ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Abdul Malik] dari ['Atho`] dari [Jabir], ia berkata; kami datang bersama Rasulullah shallallahu 'alaihi wasallam setelah empat hari Bulan Dzul Hijjah. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Bertahallullah dan ubahlah haji tersebut menjadi umrah.\" Maka hati mereka terasa sempit karena itu, terasa berat bagi mereka. Lalu hal tersebut sampai kepada Nabi shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Bertahallullah, seandainya tidak ada hewan kurban yang saya bawa niscaya saya akan melakukan seperti yang kalian lakukan.\" Maka kami bertahallul hingga kami melakukan hubungan dengan isteri-isteri kami, dan kami melakukan apa yang dilakukan orang-orang yang tidak berihram hingga pada hari Tarwiyah dan kami berada di Mekkah hingga Dzuhur dan kami mengucapkan talbiyah untuk melakukan haji. "
            },
            {
                "number": 2854,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ حَدَّثَنِي مَالِكٌ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدُّؤَلِيِّ عَنْ مُحَمَّدِ بْنِ عِمْرَانَ الْأَنْصَارِيِّ عَنْ أَبِيهِ قَالَعَدَلَ إِلَيَّ عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَنَا نَازِلٌ تَحْتَ سَرْحَةٍ بِطَرِيقِ مَكَّةَ فَقَالَ مَا أَنْزَلَكَ تَحْتَ هَذِهِ الشَّجَرَةِ فَقُلْتُ أَنْزَلَنِي ظِلُّهَا قَالَ عَبْدُ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنْتَ بَيْنَ الْأَخْشَبَيْنِ مِنْ مِنًى وَنَفَخَ بِيَدِهِ نَحْوَ الْمَشْرِقِ فَإِنَّ هُنَاكَ وَادِيًا يُقَالُ لَهُ السُّرَّبَةُ وَفِي حَدِيثِ الْحَارِثِ يُقَالُ لَهُ السُّرَرُ بِهِ سَرْحَةٌ سُرَّ تَحْتَهَا سَبْعُونَ نَبِيًّا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] serta [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Al Qasim], telah menceritakan kepadaku [Malik] dari [Muhammad bin 'Amr bin Halhalah Ad Duali] dari [Muhammad bin Imran Al Anshari] dari [ayahnya], ia berkata; Abdullah bin Umar datang kepadaku sedangkan saya sedang singgah di bawah Pohon Sarhah, di jalan Mekkah. Lalu ia berkata; apa yang menyebabkanmu singgah di bawah pohon ini? Saya katakan; yang mendorong saya untuk singgah adalah naungannya. [Abdullah bin Umar] berkata; Rasulullah shallallahu 'alaihi wasallam pernah bersabda: \"Apabila engkau berada diantara dua Gunung Akhsyabain dari Mina dan beliau mengisyaratkan dengan tangannya kea rah timur sesungguhnya disana terdapat bukit yang disebut As Surrabah\". Dan dalam hadits Al Harits: dinamakan As Surar, padanya terdapat pohon, ada tujuh puluh nabi senang berada di bawahnya.\" "
            },
            {
                "number": 2855,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ قَالَ أَنْبَأَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَبْدِ الْوَارِثِ ثِقَةٌ قَالَ حَدَّثَنَا حُمَيْدٌ الْأَعْرَجُ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ رَجُلٍ مِنْهُمْ يُقَالُ لَهُ عَبْدُ الرَّحْمَنِ بْنُ مُعَاذٍ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى فَفَتَحَ اللَّهُ أَسْمَاعَنَا حَتَّى إِنْ كُنَّا لَنَسْمَعُ مَا يَقُولُ وَنَحْنُ فِي مَنَازِلِنَا فَطَفِقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُهُمْ مَنَاسِكَهُمْ حَتَّى بَلَغَ الْجِمَارَ فَقَالَ بِحَصَى الْخَذْفِ وَأَمَرَ الْمُهَاجِرِينَ أَنْ يَنْزِلُوا فِي مُقَدَّمِ الْمَسْجِدِ وَأَمَرَ الْأَنْصَارَ أَنْ يَنْزِلُوا فِي مُؤَخَّرِ الْمَسْجِدِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim bin Nu'aim], ia berkata; telah memberitakan kepada kami [Suwaid], ia berkata; telah memberitakan kepada kami [Abdullah] dari [Abdul Warits] yaitu orang yang tsiqah, ia berkata; telah menceritakan kepada kami [Humaid Al A'raj] dari [Muhammad bin Ibrahim At Taimi] dari seorang laki-laki dari mereka yang dipanggil [Abdur Rahman bin Mu'adz], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami di Mina. Lalu Allah membuka pendengaran-pendengaran kami hingga kami sungguh mendengar apa yang beliau katakan, sedang kami berada di tempat-tempat kami tinggal. Lalu Nabi shallallahu 'alaihi wasallam mulai mengajarkan cara-cara ibadah haji kepada mereka hingga sampai melempar menggunakan kerikil untuk melempar. Dan beliau memerintahkan orang-orang Muhajirin agar turun di depan masjid dan memerintahkan orang-orang Anshar agar turun di belakang masjid. "
            },
            {
                "number": 2856,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَا حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ فَقُلْتُأَخْبِرْنِي بِشَيْءٍ عَقَلْتَهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ صَلَّى الظُّهْرَ يَوْمَ التَّرْوِيَةِ قَالَ بِمِنًى فَقُلْتُ أَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ قَالَ بِالْأَبْطَحِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] dan [Abdur Rahman bin Muhammad bin Salam] mereka berdua mengatakan; telah menceritakan kepada kami [Ishaq Al Azraq] dari [Sufyan Ats Tsauri] dari [Abdul Aziz bin Rufai'], ia berkata; saya bertanya kepada [Anas bin Malik], saya mengatakan; kabarkan kepadaku sesuatu yang telah engkau pahami dari Rasulullah shallallahu 'alaihi wasallam, dimanakah beliau melakukan sholat Zhuhur pada hari Tarwiyah? Ia berkata; di Mina. Kemudian saya katakan; dimanakah beliau melakukan sholat Ashar pada hari Nafar? Ia mengatakan; di Al Abthah. "
            },
            {
                "number": 2857,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ قَالَغَدَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مِنًى إِلَى عَرَفَةَ فَمِنَّا الْمُلَبِّي وَمِنَّا الْمُكَبِّرُ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabi], ia berkata; telah menceritakan kepada kami [Hammad] dari [Yahya bin Sa'id Al Anshari] dari [Abdullah bin Abu Salamah] dari [Ibnu Umar], ia berkata; kami pergi bersama Rasulullah shallallahu 'alaihi wasallam dari Mina menuju Arafah, kemudian diantara kami ada yang mengucapkan talbiyah dan ada yang bertakbir. "
            },
            {
                "number": 2858,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ حَدَّثَنَا يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ قَالَغَدَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى عَرَفَاتٍ فَمِنَّا الْمُلَبِّي وَمِنَّا الْمُكَبِّرُ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim Ad Dauraqi], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah menceritakan kepada kami [Yahya] dari [Abdullah bin Abi Salamah] dari [Ibnu Umar], ia berkata; kami pergi bersama Rasulullah shallallahu 'alaihi wasallam menuju Arafah, kemudian diantara kami ada yang mengucapkan talbiyah dan ada yang bertakbir. "
            },
            {
                "number": 2859,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْمُلَائِيُّ يَعْنِي أَبَا نُعَيْمٍ الْفَضْلَ بْنَ دُكَيْنٍ قَالَ حَدَّثَنَا مَالِكٌ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الثَّقَفِيُّ قَالَ قُلْتُ لِأَنَسٍوَنَحْنُ غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَاتٍ مَا كُنْتُمْ تَصْنَعُونَ فِي التَّلْبِيَةِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْيَوْمِ قَالَ كَانَ الْمُلَبِّي يُلَبِّي فَلَا يُنْكَرُ عَلَيْهِ وَيُكَبِّرُ الْمُكَبِّرُ فَلَا يُنْكَرُ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Al Mulai yaitu Abu Nu'aim Al Fadhl bin Dukain], ia berkata; telah menceritakan kepada kami [Malik], ia berkata; telah menceritakan kepadaku [Muhammad bin Bakr Ats Tsaqafi], ia berkata; saya berkata kepada [Anas] dan kami sedang pergi dari Mina menuju Arafah; apakah yang dahulu kalian lakukan di saat bertalbiyah bersama Rasulullah shallallahu 'alaihi wasallam pada hari ini? Ia berkata; dahulu orang yang bertalbiyah mengucapkan talbiyah dan tidak diingkari dan orang yang bertakbir mengucapkan takbir pun tidak diingkari. "
            },
            {
                "number": 2860,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ وَهُوَ الثَّقَفِيُّ قَالَ قُلْتُ لِأَنَسٍ غَدَاةَ عَرَفَةَمَا تَقُولُ فِي التَّلْبِيَةِ فِي هَذَا الْيَوْمِ قَالَ سِرْتُ هَذَا الْمَسِيرَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابِهِ وَكَانَ مِنْهُمْ الْمُهِلُّ وَمِنْهُمْ الْمُكَبِّرُ فَلَا يُنْكِرُ أَحَدٌ مِنْهُمْ عَلَى صَاحِبِهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdullah bin Raja`], ia berkata; telah menceritakan kepada kami [Musa bin 'Uqbah] dari [Muhammad bin Abu Bakr yaitu Ats Tsaqafi], ia berkata; saya berkata kepada [Anas] pagi hari Arafah; apa pendapatmu mengenai talbiyah pada hari ini? Ia berkata; saya pernah melakukan perjalan seperti ini bersama Rasulullah shallallahu 'alaihi wasallam dan para sahabatnya, dan diantara mereka ada orang yang mengucapkan tahlil dan diantara mereka ada yang bertakbir dan tidak ada seorangpun diantara mereka yang mengingkari sahabatnya. "
            },
            {
                "number": 2861,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ أَبِيهِ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ قَالَقَالَ يَهُودِيٌّ لِعُمَرَ لَوْ عَلَيْنَا نَزَلَتْ هَذِهِ الْآيَةُ لَاتَّخَذْنَاهُ عِيدًا{ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ }قَالَ عُمَرُ قَدْ عَلِمْتُ الْيَوْمَ الَّذِي أُنْزِلَتْ فِيهِ وَاللَّيْلَةَ الَّتِي أُنْزِلَتْ لَيْلَةَ الْجُمُعَةِ وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdullah bin Idris] dari [ayahnya] dari [Qais bin Muslim] dari [Thariq bin Syihab], ia berkata; terdapat seorang Yahudi berkata kepada Umar; seandainya kepada kami turun ayat ini niscaya kami akan menjadikannya sebagai hari raya, yaitu AL YAUMA AKMALTU LAKUM DIINAKUM (Al Maaidah: 3). [Umar] berkata; kami telah mengetahui hari apakah ayat tersebut diturunkan dan malam diturunkannya, yaitu Malam Jum'at, dan kami sedang bersama Rasulullah shallallahu 'alaihi wasallam di Arafah. "
            },
            {
                "number": 2862,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي مَخْرَمَةُ عَنْ أَبِيهِ قَالَ سَمِعْتُ يُونُسَ عَنْ ابْنِ الْمُسَيَّبِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يُعْتِقَ اللَّهُ عَزَّ وَجَلَّ فِيهِ عَبْدًا أَوْ أَمَةً مِنْ النَّارِ مِنْ يَوْمِ عَرَفَةَ وَإِنَّهُ لَيَدْنُو ثُمَّ يُبَاهِي بِهِمْ الْمَلَائِكَةَ وَيَقُولُ مَا أَرَادَ هَؤُلَاءِقَالَ أَبُو عَبْد الرَّحْمَنِ يُشْبِهُ أَنْ يَكُونَ يُونُسَ بْنَ يُوسُفَ الَّذِي رَوَى عَنْهُ مَالِكٌ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Isa bin Ibrahim] dari [Ibnu Wahb] ia berkata, telah mengabarkan kepadaku [Makhramah] dari [bapaknya], ia berkata; Aku mendengar [Yunus] dari [Ibnul Musayyab] dari ['Aisyah] bahwasanya Rasulullah Shollollohu'alaihi wa sallam bersabda: \" Tidak ada hari yang Allah Azza wa Jalla pergunakan untuk lebih banyak memerdekakan banyak hamba atau budak dari neraka, selain hari Arafah, dan sesungguhnya Dia akan mendekati mereka lalu membanggakan diri dihadapan malaika-Nyat karena telah membebaskan mereka, dan Dia berfirman sesuai apa yang mereka inginkan, \" Abu Abdurrahman berkata 'sepertinya Yunus yang menjadi sumber periwayatan Malik', wallahua'lam."
            },
            {
                "number": 2863,
                "arab": "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا مُوسَى بْنُ عَلِيٍّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ يَوْمَ عَرَفَةَ وَيَوْمَ النَّحْرِ وَأَيَّامَ التَّشْرِيقِ عِيدُنَا أَهْلَ الْإِسْلَامِ وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin fadhalah bin Ibrahim] mengatakan, telah mengabarkan kami [Abdullah yaitu Ibnu yazid Almuqri`] mengatakan, telah menceritakan kepada kami [Musa bin Ali] mengatakan, aku mendengar [ayahku] menceritakan dari [Uqbah bin Amir], bahwa Rasulullah shallallahu'alaihi wasallam bersabda; \"Hari Arafah, hari idul adha, dan hari tasyriq adalah hari raya kita, pemeluk Islam, ia hari makan-minum\" "
            },
            {
                "number": 2864,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَخْبَرَنِي أَشْهَبُ قَالَ أَخْبَرَنِي مَالِكٌ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ قَالَكَتَبَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ إِلَى الْحَجَّاجِ بْنِ يُوسُفَ يَأْمُرُهُ أَنْ لَا يُخَالِفَ ابْنَ عُمَرَ فِي أَمْرِ الْحَجِّ فَلَمَّا كَانَ يَوْمُ عَرَفَةَ جَاءَهُ ابْنُ عُمَرَ حِينَ زَالَتْ الشَّمْسُ وَأَنَا مَعَهُ فَصَاحَ عِنْدَ سُرَادِقِهِ أَيْنَ هَذَا فَخَرَجَ إِلَيْهِ الْحَجَّاجُ وَعَلَيْهِ مِلْحَفَةٌ مُعَصْفَرَةٌ فَقَالَ لَهُ مَا لَكَ يَا أَبَا عَبْدِ الرَّحْمَنِ قَالَ الرَّوَاحَ إِنْ كُنْتَ تُرِيدُ السُّنَّةَ فَقَالَ لَهُ هَذِهِ السَّاعَةَ فَقَالَ لَهُ نَعَمْ فَقَالَ أُفِيضُ عَلَيَّ مَاءً ثُمَّ أَخْرُجُ إِلَيْكَ فَانْتَظَرَهُ حَتَّى خَرَجَ فَسَارَ بَيْنِي وَبَيْنَ أَبِي فَقُلْتُ إِنْ كُنْتَ تُرِيدُ أَنْ تُصِيبَ السُّنَّةَ فَأَقْصِرْ الْخُطْبَةَ وَعَجِّلْ الْوُقُوفَ فَجَعَلَ يَنْظُرُ إِلَى ابْنِ عُمَرَ كَيْمَا يَسْمَعَ ذَلِكَ مِنْهُ فَلَمَّا رَأَى ذَلِكَ ابْنُ عُمَرَ قَالَ صَدَقَ",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la] emngatakan, telah mengabariku [Asyhab] mengatakan, telah mengabariku [Malik], bahwa [Ibnu Syihab] menceritainya dari [Salim bin Abdullah] ia berkata; Pernah Abdul Malik bin Marwan mengirim surat kepada Hajjaj bin Yusuf memerintahkannya agar ia tidak menyelisihi [Ibnu Umar] pada masalah haji. Ketika hari Arafah Ibnu Umar mendatanginya ketika matahari tergelincir dan aku bersamanya, lalu ia menyeru disisi kemahnya 'dimana ini'?, lalu Hajjaj keluar kepadanya dengan selimut tebal dan berkata 'apa yang terjadi denganmu hai Abu Abdurrahman? ', ia menjawab 'Beranjaklah jika engkau ingin menjalankan sunnah! ', ia berkata kepadanya, 'saat ini? ' Ia menjawab 'iya'. Lalu Ibnu Umar mengatakan 'Aku akan mengguyurkan air lalu keluar bersamamu'. Kemudian ia menunggunya hingga ia keluar lalu berjalan diantara aku dan ayahku, aku berkata 'Jika engkau ingin sesuai sunnah maka pendekkan khutbah dan bersegeralah wukuf', lalu ia menoleh kepada Ibn Umar agar ia mendengar hal itu, ketika Ibnu Umar melihatnya ia berkata 'ia benar.'"
            },
            {
                "number": 2865,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الْأَوْدِيُّ قَالَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ صَالِحٍ عَنْ مَيْسَرَةَ بْنِ حَبِيبٍ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَكُنْتُ مَعَ ابْنِ عَبَّاسٍ بِعَرَفَاتٍ فَقَالَ مَا لِي لَا أَسْمَعُ النَّاسَ يُلَبُّونَ قُلْتُ يَخَافُونَ مِنْ مُعَاوِيَةَ فَخَرَجَ ابْنُ عَبَّاسٍ مِنْ فُسْطَاطِهِ فَقَالَ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ فَإِنَّهُمْ قَدْ تَرَكُوا السُّنَّةَ مِنْ بُغْضِ عَلِيٍّ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Usman bin Hakim Al Audi] mengatakan, telah menceritakan ekpada kami [Khalid bin Makhlad] mengatakan, telah menceritakan kepada kami [Ali bin Shalih] dari [Maisarah bin Habib] dari [Minhal bin Amru] dari [Said bin Jubair] ia berkata; aku bersama [Ibnu Abbas] beberapa waktu di Arafah, ia bertanya kenapa aku tidak mendengar orang-orang bertalbiyah. Aku menjawab mereka takut dari Muawiyah. Lalu Ibn Abbas keluar dari kemahnya dan berkata labbaik allahumma labbaik, sungguh mereka telah meninggalkan sunnah karena kemarahan Ali."
            },
            {
                "number": 2866,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ نُبَيْطٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى جَمَلٍ أَحْمَرَ بِعَرَفَةَ قَبْلَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya] dari [Sufyan] dari [Salamah bin Nubaith] dari [ayahnya], ia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam berkhutbah di atas unta merah di Arafah sebelum melakukan sholat. "
            },
            {
                "number": 2867,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ عَنْ ابْنِ الْمُبَارَكِ عَنْ سَلَمَةَ بْنِ نُبَيْطٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ عَرَفَةَ عَلَى جَمَلٍ أَحْمَرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Adam] dari [Ibnu Al Mubarak] dari [Salamah bin Nubaith] dari [ayahnya], ia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam berkhutbah pada hari Arafah di atas unta merah. "
            },
            {
                "number": 2868,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ جَاءَ إِلَى الْحَجَّاجِ بْنِ يُوسُفَ يَوْمَ عَرَفَةَ حِينَ زَالَتْ الشَّمْسُ وَأَنَا مَعَهُ فَقَالَ الرَّوَاحَ إِنْ كُنْتَ تُرِيدُ السُّنَّةَ فَقَالَ هَذِهِ السَّاعَةَ قَالَ نَعَمْ قَالَ سَالِمٌ فَقُلْتُ لِلْحَجَّاجِ إِنْ كُنْتَ تُرِيدُ أَنْ تُصِيبَ الْيَوْمَ السُّنَّةَ فَأَقْصِرْ الْخُطْبَةَ وَعَجِّلْ الصَّلَاةَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ صَدَقَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amr bin As Sarh], ia berkata; telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik] dari [Ibnu Syihab] dari [Salim bin Abdullah] bahwa [Abdullah bin Umar] datang kepada Al Hajjaj bin Yusuf pada hari Arafah ketika matahari telah tergelincir, dan saya bersamanya. Kemudian ia berkata; pergilah apabila engkau menghendaki sunnah. Kemudian Al Hajjaj berkata; apakah pada saat ini? Ibnu Umar berkata; ya. Salim berkata; kemudian saya katakan kepada Al Hajjaj; apabila engkau ingin mendapatkan Sunnah pada hari ini, maka persingkatlah khutbah dan segerakan sholat. Kemudian Abdullah bin Umar berkata; ia benar. "
            },
            {
                "number": 2869,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدٍ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الصَّلَاةَ لِوَقْتِهَا إِلَّا بِجَمْعٍ وَعَرَفَاتٍ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dari [Khalid] dari [Syu'bah] dari [Sulaiman] dari ['Umarah bin 'Umair] dari [Abdur Rahman bin Yazid] dari [Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam melakukan sholat pada waktunya kecuali menjama' dan di Arafah. "
            },
            {
                "number": 2870,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ هُشَيْمٍ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ قَالَ قَالَ أُسَامَةُ بْنُ زَيْدٍكُنْتُ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ فَرَفَعَ يَدَيْهِ يَدْعُو فَمَالَتْ بِهِ نَاقَتُهُ فَسَقَطَ خِطَامُهَا فَتَنَاوَلَ الْخِطَامَ بِإِحْدَى يَدَيْهِ وَهُوَ رَافِعٌ يَدَهُ الْأُخْرَى",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dari [Husyaim], ia berkata; telah menceritakan kepada kami [Abdul Malik] dari ['Atho`], ia berkata; [Usamah bin Zaid] berkata; saya pernah membonceng membonceng Nabi shallallahu 'alaihi wasallam di Arafah, lalu beliau mengangkat tangan dan berdo'a, kemudian untanya condong dan tali kekangnya jatuh, beliau mengambil tali kekang itu dengan salah satu tangannya sedang tangannya yang lain terangkat."
            },
            {
                "number": 2871,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَتْ قُرَيْشٌ تَقِفُ بِالْمُزْدَلِفَةِ وَيُسَمَّوْنَ الْحُمْسَ وَسَائِرُ الْعَرَبِ تَقِفُ بِعَرَفَةَ فَأَمَرَ اللَّهُ تَبَارَكَ وَتَعَالَى نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقِفَ بِعَرَفَةَ ثُمَّ يَدْفَعُ مِنْهَا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ }",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abu Mu'awiyah], ia berkata; telah menceritakan kepada kami [Hisyam] dari [Ayahnya] dari ['Aisyah], ia berkata orang-orang Quraisy berwukuf di Al Muzdalifah dan mereka menamai Al Hums, dan seluruh orang Arab berwukuf di Arafah, kemudian Allah Tabaraka wa Ta'ala memerintahkan Nabi-Nya shallallahu 'alaihi wasallam agar berwukuf di Arafah, lalu beliau beranjak darinya, kemudian Allah Azza wa Jalla berfirman: \" Kemudian bertolaklah kamu dari tempat bertolaknya orang-orang banyak ('Arafah).\" "
            },
            {
                "number": 2872,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَأَضْلَلْتُ بَعِيرًا لِي فَذَهَبْتُ أَطْلُبُهُ بِعَرَفَةَ يَوْمَ عَرَفَةَ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا فَقُلْتُ مَا شَأْنُ هَذَا إِنَّمَا هَذَا مِنْ الْحُمْسِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] dari [Muhammad bin Jubair bin Muth'im] dari [ayahnya], ia berkata; saya kehilangan untaku, kemudian saya pergi mencarinya di Arafah pada hari Arafah. Maka saya lihat Nabi shallallahu 'alaihi wasallam berwukuf. Lalu saya katakan; ada apa ini? Sesungguhnya ini adalah Al Hums. "
            },
            {
                "number": 2873,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ أَنَّ يَزِيدَ بْنَ شَيْبَانَ قَالَكُنَّا وُقُوفًا بِعَرَفَةَ مَكَانًا بَعِيدًا مِنْ الْمَوْقِفِ فَأَتَانَا ابْنُ مِرْبَعٍ الْأَنْصَارِيُّ فَقَالَ إِنِّي رَسُولُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْكُمْ يَقُولُ كُونُوا عَلَى مَشَاعِرِكُمْ فَإِنَّكُمْ عَلَى إِرْثٍ مِنْ إِرْثِ أَبِيكُمْ إِبْرَاهِيمَ عَلَيْهِ السَّلَام",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] dari ['Amr bin Abdullah bin Shafwan] bahwa [Yazid bin Syaiban] berkata; kami berwukuf di Arafah, di tempat yang jauh dari tempat berhenti, kemudian [Ibnu Mirba' Al Anshari] datang kepada kami, lalu berkata; saya adalah utusan Rasulullah shallallahu 'alaihi wasallam kepada kalian. Beliau bersabda: \"Tetaplah kalian berada pada masy'aril haram kalian, karena kalian berada pada warisan diantara warisan bapak kalian Ibrahim 'alaihissalam.\" "
            },
            {
                "number": 2874,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبِي قَالَ أَتَيْنَا جَابِرَ بْنَ عَبْدِ اللَّهِفَسَأَلْنَاهُ عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثَنَا أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَرَفَةُ كُلُّهَا مَوْقِفٌ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Yahya bin Sa'id], ia berkata; telah menceritakan kepada kami [Ja'far bin Muhammad], ia berkata; telah menceritakan kepada kami [ayahku], ia berkata; saya datang kepada [Jabir bin Abdullah] kemudian kami bertanya kepadanya mengenai haji Nabi shallallahu 'alaihi wasallam. Maka ia menceritakan kepada kami bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Seluruh Arafah adalah tempat wukuf.\" "
            },
            {
                "number": 2875,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ بُكَيْرِ بْنِ عَطَاءٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُ نَاسٌ فَسَأَلُوهُ عَنْ الْحَجِّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَجُّ عَرَفَةُ فَمَنْ أَدْرَكَ لَيْلَةَ عَرَفَةَ قَبْلَ طُلُوعِ الْفَجْرِ مِنْ لَيْلَةِ جَمْعٍ فَقَدْ تَمَّ حَجُّهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Waki'], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Bukair bin 'Atho`] dari [Abdur Rahman bin Ya'mar], ia berkata; saya menyaksikan Rasulullah shallallahu 'alaihi wasallam didatangi manusia kemudian bertanya kepadanya mengenai haji, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Inti Haji adalah wukuf di Arafah, barang siapa yang mendapatkan malam Arafah sebelum terbit fajar dari malam jam' (waktu sore pada hari Arafah maka hajinya telah sempurna.\""
            },
            {
                "number": 2876,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ حَدَّثَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍ قَالَأَفَاضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَرَفَاتٍ وَرِدْفُهُ أُسَامَةُ بْنُ زَيْدٍ فَجَالَتْ بِهِ النَّاقَةُ وَهُوَ رَافِعٌ يَدَيْهِ لَا تُجَاوِزَانِ رَأْسَهُ فَمَا زَالَ يَسِيرُ عَلَى هِينَتِهِ حَتَّى انْتَهَى إِلَى جَمْعٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim], Ia berkata; telah menceritakan kepada kami [Hibban], ia berkata; telah memberitakan kepada kami [Abdullah] dari [Abdul Malik bin Abi Sulaiman] dari ['Atho`] dari [Ibnu Abbas] dari [Al Fadhl bin Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bertolak dari Arafah memboncengkan Usamah bin Zaid, kemudian untanya berkeliling dan beliau mengangkat kedua tangannya tidak melebihi kepala, dan beliau terus berjalan dengan pelan hingga sampai Muzdalifah."
            },
            {
                "number": 2877,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَاسٍ أَنَّ أُسَامَةَ بْنَ زَيْدٍ قَالَأَفَاضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَرَفَةَ وَأَنَا رَدِيفُهُ فَجَعَلَ يَكْبَحُ رَاحِلَتَهُ حَتَّى أَنَّ ذِفْرَاهَا لَيَكَادُ يُصِيبُ قَادِمَةَ الرَّحْلِ وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ عَلَيْكُمْ بِالسَّكِينَةِ وَالْوَقَارِ فَإِنَّ الْبِرَّ لَيْسَ فِي إِيضَاعِ الْإِبِلِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Yunus bin Muhammad], ia berkata; telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Hammad] dari [Qais bin Sa'id] dari ['Atho`] dari [Ibnu Abbas] bahwa [Usamah bin Zaid] berkata; Rasulullah shallallahu 'alaihi wasallam bertolak dari Arafah dan saya memboncengnya, lalu beliau menghentikan kendaraannya hingga pangkal telinga kendaraan tersebut hampir menyentuh ujung kantung pelana, dan beliau bersabda: \"Wahai manusia, hendaknya kalian tenang, kebaikan bukanlah dalam menyia-nyiakan unta.\""
            },
            {
                "number": 2878,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ قَالَ حَدَّثَنَا مُحْرِزُ بْنُ الْوَضَّاحِ عَنْ إِسْمَعِيلَ يَعْنِي ابْنَ أُمَيَّةَ عَنْ أَبِي غَطَفَانَ بْنِ طَرِيفٍ حَدَّثَهُ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُلَمَّا دَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَنَقَ نَاقَتَهُ حَتَّى أَنَّ رَأْسَهَا لَيَمَسُّ وَاسِطَةَ رَحْلِهِ وَهُوَ يَقُولُ لِلنَّاسِ السَّكِينَةَ السَّكِينَةَ عَشِيَّةَ عَرَفَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ali bin Harb], ia berkata; telah menceritakan kepada kami [Muhriz bin Al Wadhdhah] dari [Isma'il yaitu Ibnu Umayyah] dari [Abu Ghathafan bin Tharif] ia telah menceritakan kepadanya bahwa ia mendengar [Ibnu Abbas] berkata; tatkala Rasulullah shallallahu 'alaihi wasallam menarik tali kekang untanya hingga kepalanya menyentuh bagian tengah kantong pelananya, beliau bersabda kepada manusia: \"Tenanglah, tenanglah pada sore Hari Arafah.\""
            },
            {
                "number": 2879,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ أَبِي مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍ وَكَانَ رَدِيفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي عَشِيَّةِ عَرَفَةَ وَغَدَاةِ جَمْعٍ لِلنَّاسِ حِينَ دَفَعُوا عَلَيْكُمْ السَّكِينَةَ وَهُوَ كَافٌّ نَاقَتَهُ حَتَّى إِذَا دَخَلَ مُحَسِّرًا وَهُوَ مِنْ مِنًى قَالَ عَلَيْكُمْ بِحَصَى الْخَذْفِ الَّذِي يُرْمَى بِهِ فَلَمْ يَزَلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Abu Ma'bad sahaya Ibnu Abbas] dari [Ibnu Abbas] dari [Al Fadhl bin Abbas] dan ia adalah orang yang membonceng Rasulullah shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda pada sore Hari Arafah serta pagi hari tanggal 9 Dzul Hijjah kepada manusia tatkala mereka bertolak: \"Hendaknya kalian tenang.\" Dan beliau menahan untanya hingga ketika beliau telah memasuki Muhassir yaitu bagian dari Mina beliau bersabda: \"Ambillah kerikil untuk melempar yang digunakan untuk melempar.\" Dan senantiasa Rasulullah shallallahu 'alaihi wasallam mengucapkan talbiyah hingga melempar jumrah. "
            },
            {
                "number": 2880,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَأَفَاضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ السَّكِينَةُ وَأَمَرَهُمْ بِالسَّكِينَةِ وَأَوْضَعَ فِي وَادِي مُحَسِّرٍ وَأَمَرَهُمْ أَنْ يَرْمُوا الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Abu Nu'aim], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam bertolak dalam keadaan tenang dan beliau memerintahkan manusia untuk bersikap tenang, dan mempercepat kendaraannya di Bukit Muhassir dan memerintahkan mereka untuk melempar jumrah dengan kerikil untuk melempar. "
            },
            {
                "number": 2881,
                "arab": "أَخْبَرَنِي أَبُو دَاوُدَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَاضَ مِنْ عَرَفَةَ وَجَعَلَ يَقُولُ السَّكِينَةَ عِبَادَ اللَّهِ يَقُولُ بِيَدِهِ هَكَذَا وَأَشَارَ أَيُّوبُ بِبَاطِنِ كَفِّهِ إِلَى السَّمَاءِ",
                "id": "Telah mengabarkan kepada kami [Abu Daud], ia berkata; telah menceritakan kepada kami [Sulaiman bin Harb], ia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam bertolak dari 'Arafah dan bersabda: \"Tenanglah wahai hamba Allah.\" Dan beliau berbicara dengan tangannya demikian, dan Ayyub memberikan isyarat dengan bagian dalam telapak tangannya menuju langit. "
            },
            {
                "number": 2882,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أُسَامَةَ بْنِ زَيْدٍأَنَّهُ سُئِلَ عَنْ مَسِيرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ قَالَ كَانَ يَسِيرُ الْعَنَقَ فَإِذَا وَجَدَ فَجْوَةً نَصَّ وَالنَّصُّ فَوْقَ الْعَنَقِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Yahya] dari [Hisyam] dari [ayahnya] dari [Usamah bin Zaid] bahwa ia ditanya mengenai perjalanan Nabi shallallahu 'alaihi wasallam dalam melakukan haji wada', ia berkata; beliau berjalan sedang, kemudian apabila mendapati kelonggaran maka beliau berjalan lebih cepat dari itu. "
            },
            {
                "number": 2883,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ أُسَامَةَ بْنِ زَيْدٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ أَفَاضَ مِنْ عَرَفَةَ مَالَ إِلَى الشِّعْبِ قَالَ فَقُلْتُ لَهُ أَتُصَلِّي الْمَغْرِبَ قَالَ الْمُصَلَّى أَمَامَكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Hammad] dari [Ibrahim bin 'Uqbah] dari [Kuraib] dari [Usamah bin Zaid] bahwa Nabi shallallahu 'alaihi wasallam ketika bertolak dari Arafah beliau condong ke jalan bukit. Usamah berkata; maka saya katakan kepadanya; apakah anda melakukan sholat Maghrib? Beliau menjawab: \"Mushalla ada di depanmu.\" "
            },
            {
                "number": 2884,
                "arab": "أَخْبَرَنَا مُحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ أُسَامَةَ بْنِ زَيْدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ الشِّعْبَ الَّذِي يَنْزِلُهُ الْأُمَرَاءُ فَبَالَ ثُمَّ تَوَضَّأَ وُضُوءًا خَفِيفًا فَقُلْتُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ قَالَ الصَّلَاةُ أَمَامَكَ فَلَمَّا أَتَيْنَا الْمُزْدَلِفَةَ لَمْ يَحُلَّ آخِرُ النَّاسِ حَتَّى صَلَّى",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan], ia berkata; telah menceritakan kepada kami [Waki'], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin 'Uqbah] dari [Kuraib] dari [Usamah bin Zaid] bahwa Rasulullah shallallahu 'alaihi wasallam pernah singgah di jalan bukit yang menjadi tempat singgah para pemimpin, kemudian beliau kencing, kemudian berwudhu ringan. Lalu saya katakan; wahai Rasulullah shallallahu 'alaihi wasallam, apakah anda akan melakukan sholat? Beliau menjawab: \"sholat ada di depanmu.\" Kemudian tatkala kami sampai di Muzdalifah tidak berhenti orang yang paling terakhir hingga ia melakukan sholat. "
            },
            {
                "number": 2885,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ عَنْ حَمَّادٍ عَنْ يَحْيَى عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِي أَيُّوبَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabi] dari [Hammad] dari [Yahya] dari ['Adi bin Tsabit] dari [Abdullah bin Yazid] dari [Abu Ayyub] bahwa Rasulullah shallallahu 'alaihi wasallam menggabung antara Maghrib dan Isya' dengan sholat jama'."
            },
            {
                "number": 2886,
                "arab": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا قَالَ حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ عَنْ دَاوُدَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ ابْنِ مَسْعُودٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ",
                "id": "Telah mengabarkan kepada kami [Al Qasim bin Zakariya], ia berkata; telah menceritakan kepada kami [Mush'ab bin Al Miqdam] dari [Daud] dari [Al A'masy] dari ['Umarah] dari [Abdur Rahman bin Yazid] dari [Ibnu Mas'ud] bahwa Nabi shallallahu 'alaihi wasallam menggabung sholat Maghrib dan Isya' dengan sholat jama'. "
            },
            {
                "number": 2887,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ أَبِي ذِئْبٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ بِإِقَامَةٍ وَاحِدَةٍ لَمْ يُسَبِّحْ بَيْنَهُمَا وَلَا عَلَى إِثْرِ كُلِّ وَاحِدَةٍ مِنْهُمَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya] dari [Ibnu Abi Dzi`b], ia berkata; telah menceritakan kepadaku [Az Zuhri] dari [Salim] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam menggabungkan antara Maghrib dan Isya` dengan satu iqamah, dan tidak mengucapkan tasbih diantara keduanya juga tidak setelah keduanya. "
            },
            {
                "number": 2888,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ أَنَّ أَبَاهُ قَالَجَمَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ لَيْسَ بَيْنَهُمَا سَجْدَةٌ صَلَّى الْمَغْرِبَ ثَلَاثَ رَكَعَاتٍ وَالْعِشَاءَ رَكْعَتَيْنِوَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَجْمَعُ كَذَلِكَ حَتَّى لَحِقَ بِاللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah mengabarkan kepada kami ['Isa bin Ibrahim], ia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] bahwa ['ubaidhullah bin Abdullah] telah mengabarkan kepadanya bahwa [bapaknya] berkata; Rasulullah shallallahu 'alaihi wasallam menggabungkan antara Maghrib dan Isya`, tidak ada diantara keduanya sajdah, beliau melakukan sholat Maghrib tiga rakaat dan Isya` dua rakaat. Dan Abdullah bin Umar menjama' juga hingga berjumpa dengan Allah 'azza wajalla. "
            },
            {
                "number": 2889,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَغْرِبَ وَالْعِشَاءَ بِجَمْعٍ بِإِقَامَةٍ وَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Manshur], ia berkata; telah menceritakan kepada kami [Abu Nu'aim], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Salamah] dari [Sa'id bin Jubair] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam menjama' Maghrib dan Isya` dengan satu iqamah. "
            },
            {
                "number": 2890,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ أَنَّ كُرَيْبًا قَالَ سَأَلْتُ أُسَامَةَ بْنَ زَيْدٍ وَكَانَ رِدْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةَ عَرَفَةَ فَقُلْتُكَيْفَ فَعَلْتُمْ قَالَ أَقْبَلْنَا نَسِيرُ حَتَّى بَلَغْنَا الْمُزْدَلِفَةَ فَأَنَاخَ فَصَلَّى الْمَغْرِبَ ثُمَّ بَعَثَ إِلَى الْقَوْمِ فَأَنَاخُوا فِي مَنَازِلِهِمْ فَلَمْ يَحُلُّوا حَتَّى صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ الْآخِرَةَ ثُمَّ حَلَّ النَّاسُ فَنَزَلُوا فَلَمَّا أَصْبَحْنَا انْطَلَقْتُ عَلَى رِجْلَيَّ فِي سُبَّاقِ قُرَيْشٍ وَرَدِفَهُ الْفَضْلُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim], ia berkata; telah memberitakan kepada kami [Hibban], ia berkata; telah memberitakan kepada kami [Abdullah] dari [Ibrahim bin 'Uqbah] bahwa [Kuraib] berkata; saya pernah bertanya kepada [Usamah bin Zaid], dan ia adalah orang yang dibonceng Rasulullah shallallahu 'alaihi wasallam pada sore Hari Arafah. Lalu saya katakan; bagaimana kalian berbuat? Ia berkata; kami datang dengan berjalan hingga sampai Muzdalifah, lalu beliau turun, dan melakukan sholat Maghrib kemudian mengirim utusan kepada manusia agar turun maka mereka turun di tempat-tempat mereka turun, dan tidak benar-benar turun hingga Rasulullah shallallahu 'alaihi wasallam melakukan sholat Isya`akhir, kemudian orang-orang mereka benar-benar turun. Tatkala pagi hari saya pergi berjalan kaki diantara orang-orang Quraisy yang berjalan cepat dan beliau dibonceng Al Fadhl. "
            },
            {
                "number": 2891,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُأَنَا مِمَّنْ قَدَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْمُزْدَلِفَةِ فِي ضَعَفَةِ أَهْلِهِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits], ia berkata; telah memberitakan kepada kami [Sufyan] dari ['ubaidhullah bin Abu Yazid], ia berkata; saya mendengar [Ibnu Abbas] berkata; saya termasuk diantara orang-orang yang di dahulukan Nabi shallallahu 'alaihi wasallam pada malam di Muzdalifah diantara keluarganya yang lemah."
            },
            {
                "number": 2892,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَكُنْتُ فِيمَنْ قَدَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْمُزْدَلِفَةِ فِي ضَعَفَةِ أَهْلِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr] dari ['Atho`] dari [Ibnu Abbas], ia berkata; saya termasuk diantara orang yang didahulukan Nabi shallallahu 'alaihi wasallam pada malam di Muzdalifah diantara keluarganya yang lemah. "
            },
            {
                "number": 2893,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ وَعَفَّانُ وَسُلَيْمَانُ عَنْ شُعْبَةَ عَنْ مُشَاشٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ ضَعَفَةَ بَنِي هَاشِمٍ أَنْ يَنْفِرُوا مِنْ جَمْعٍ بِلَيْلٍ",
                "id": "Telah mengabarkan kepada kami [Abu Daud], ia berkata; telah menceritakan kepada kami [Abu 'Ashim], [Affan] dan [Sulaiman] dari [Syu'bah] dari [Musyasy] dari ['Atho`] dari [Ibnu Abbas] dari [Al Fadhl] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan orang-orang lemah Bani Hasyim agar keluar dari Muzdalifah pada malam hari. "
            },
            {
                "number": 2894,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ حَدَّثَنَا عَطَاءٌ عَنْ سَالِمِ بْنِ شَوَّالٍ أَنَّ أُمَّ حَبِيبَةَ أَخْبَرَتْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهَا أَنْ تُغَلِّسَ مِنْ جَمْعٍ إِلَى مِنًى",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Ibnu Juraij], ia berkata; telah menceritakan kepada kami ['Atho`] dari [Salim bin Syawwal] bahwa [Ummu Habibah] mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam memerintahkannya untuk pergi pada malam hari dari Muzdalifah menuju Mina. "
            },
            {
                "number": 2895,
                "arab": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ سَالِمِ بْنِ شَوَّالٍ عَنْ أُمِّ حَبِيبَةَ قَالَتْكُنَّا نُغَلِّسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمُزْدَلِفَةِ إِلَى مِنًى",
                "id": "Telah mengabarkan kepada kami [Abdul Jabbar bin Al 'Ala`] dari [Sufyan] dari ['Amr] dari [Salim bin Syawwal] dari [Ummu Habibah], ia berkata; kami pergi pada malam hari pada masa Rasulullah shallallahu 'alaihi wasallam dari Muzdalifah menuju Mina. "
            },
            {
                "number": 2896,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا مَنْصُورٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْإِنَّمَا أَذِنَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِسَوْدَةَ فِي الْإِفَاضَةِ قَبْلَ الصُّبْحِ مِنْ جَمْعٍ لِأَنَّهَا كَانَتْ امْرَأَةً ثَبِطَةً",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah memberitakan kepada kami [Manshur] dari [Abdur Rahman bin Al Qasim] dari [Al Qasim] dari [Aisyah], ia berkata; \"Nabi shallallahu 'alaihi wasallam mengizinkan Saudah untuk melakukan thawaf ifadhah sebelum subuh dari Muzdalifah, karena ia adalah wanita yang lambat geraknya\"."
            },
            {
                "number": 2897,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةً قَطُّ إِلَّا لِمِيقَاتِهَا إِلَّا صَلَاةَ الْمَغْرِبِ وَالْعِشَاءِ صَلَّاهُمَا بِجَمْعٍ وَصَلَاةَ الْفَجْرِ يَوْمَئِذٍ قَبْلَ مِيقَاتِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`], ia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari ['Umarah] dari [Abdur Rahman bin Yazid] dari [Abdullah], ia berkata; saya tidak melihat Rasulullah shallallahu 'alaihi wasallam melakukan suatu sholat kecuali pada waktunya, kecuali sholat Maghrib serta Isya` yang beliau lakukan dengan menjama' keduanya serta sholat subuh pada waktu itu sebelum waktunya."
            },
            {
                "number": 2898,
                "arab": "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ وَدَاوُدَ وَزَكَرِيِّا عَنْ الشَّعْبِيِّ عَنْ عُرْوَةَ بْنِ مُضَرِّسٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا بِالْمُزْدَلِفَةِ فَقَالَ مَنْ صَلَّى مَعَنَا صَلَاتَنَا هَذِهِ هَا هُنَا ثُمَّ أَقَامَ مَعَنَا وَقَدْ وَقَفَ قَبْلَ ذَلِكَ بِعَرَفَةَ لَيْلًا أَوْ نَهَارًا فَقَدْ تَمَّ حَجُّهُ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Abdur Rahman], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Isma'il] serta [Daud] dan [Zakariya] dari [Asy Sya'bi] dari ['Urwah bin Mudharris], ia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam berwukuf di Muzdalifah, kemudian bersabda: \"Barang siapa yang melakukan sholat bersama kami dengan sholat kami ini di sini, kemudian bermukim bersama dengan kami dan sebelumnya telah melakukan wukuf di Arafah pada malam atau siang maka sungguh hajinya telah sempurna.\" "
            },
            {
                "number": 2899,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنِي جَرِيرٌ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ عَنْ عُرْوَةَ بْنِ مُضَرِّسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ جَمْعًا مَعَ الْإِمَامِ وَالنَّاسِ حَتَّى يُفِيضَ مِنْهَا فَقَدْ أَدْرَكَ الْحَجَّ وَمَنْ لَمْ يُدْرِكْ مَعَ النَّاسِ وَالْإِمَامِ فَلَمْ يُدْرِكْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah], ia berkata; telah menceritakan kepadaku [Jarir] dari [Mutharrif] dari [Asy Sya'bi] dari ['Urwah bin Mudharris], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mendapati sholat jama' bersama imam serta manusia hingga bertolak darinya, sungguh ia telah mendapatkan haji, dan barang siapa yang belum mendapatkan bersama manusia dan imam, maka ia belum mendapatkan haji.\""
            },
            {
                "number": 2900,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ قَالَ حَدَّثَنَا أُمَيَّةُ عَنْ شُعْبَةَ عَنْ سَيَّارٍ عَنْ الشَّعْبِيِّ عَنْ عُرْوَةَ بْنِ مُضَرِّسٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَمْعٍ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَقْبَلْتُ مِنْ جَبَلَيْ طَيِّئٍ لَمْ أَدَعْ حَبْلًا إِلَّا وَقَفْتُ عَلَيْهِ فَهَلْ لِي مِنْ حَجٍّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى هَذِهِ الصَّلَاةَ مَعَنَا وَقَدْ وَقَفَ قَبْلَ ذَلِكَ بِعَرَفَةَ لَيْلًا أَوْ نَهَارًا فَقَدْ تَمَّ حَجُّهُ وَقَضَى تَفَثَهُ",
                "id": "Telah mengabarkan kepada kami [Ali bin Al Husain], ia berkata; telah menceritakan kepada kami [Umayyah] dari [Syu'bah] dari [Sayyar] dari [Asy Sya'bi] dari ['Urwah bin Mudharris], ia berkata; saya datang kepada Nabi shallallahu 'alaihi wasallam di Muzdalifah, kemudian saya katakan; wahai Rasulullah, saya datang dari Gunung Thayyi`, dan tidaklah meninggalkan satu tali kecuali saya berwukuf padanya, apakah saya mendapatkan haji? Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang melakukan sholat ini bersama kami, dan berwukuf sebelum itu di Arafah pada malam atau siang, sungguh telah sempurna hajinya dan ia telah membersihkan kotorannya.\""
            },
            {
                "number": 2901,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ قَالَ سَمِعْتُ الشَّعْبِيَّ يَقُولُ حَدَّثَنِي عُرْوَةُ بْنُ مُضَرِّسِ بْنِ أَوْسِ بْنِ حَارِثَةَ بْنِ لَأْمٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَمْعٍ فَقُلْتُ هَلْ لِي مِنْ حَجٍّ فَقَالَ مَنْ صَلَّى هَذِهِ الصَّلَاةَ مَعَنَا وَوَقَفَ هَذَا الْمَوْقِفَ حَتَّى يُفِيضَ وَأَفَاضَ قَبْلَ ذَلِكَ مِنْ عَرَفَاتٍ لَيْلًا أَوْ نَهَارًا فَقَدْ تَمَّ حَجُّهُ وَقَضَى تَفَثَهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Abdullah bin Abi As Safar], ia berkata; saya pernah mendengar [Asy Sya'bi] berkata; telah menceritakan kepadaku ['Urwah bin Mudharris bin Aus bin Haritsah bin La`m], ia berkata; saya datang kepada Nabi shallallahu 'alaihi wasallam di Muzdalifah seraya berkata; apakah saya mendapatkan haji? Lalu beliau menjawab: \"Barang siapa yang melakukan sholat ini bersama kami dan berwukuf di tempat wukuf ini hingga bertolak dan telah bertolak sebelum itu dari Arafah pada malam atau siang hari, sungguh telah sempurna hajinya dan ia telah membersihkan kotorannya.\""
            },
            {
                "number": 2902,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ إِسْمَعِيلَ قَالَ أَخْبَرَنِي عَامِرٌ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ مُضَرِّسٍ الطَّائِيُّ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أَتَيْتُكَ مِنْ جَبَلَيْ طَيِّئٍ أَكْلَلْتُ مَطِيَّتِي وَأَتْعَبْتُ نَفْسِي مَا بَقِيَ مِنْ حَبْلٍ إِلَّا وَقَفْتُ عَلَيْهِ فَهَلْ لِي مِنْ حَجٍّ فَقَالَ مَنْ صَلَّى صَلَاةَ الْغَدَاةِ هَا هُنَا مَعَنَا وَقَدْ أَتَى عَرَفَةَ قَبْلَ ذَلِكَ فَقَدْ قَضَى تَفَثَهُ وَتَمَّ حَجُّهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya] dari [Isma'il], ia berkata; telah mengabarkan kepadaku ['Amir], ia berkata; telah memberitakan kepadaku ['Urwah bin Mudharris Ath Thai], ia berkata; saya datang kepada Rasulullah shallallahu 'alaihi wasallam kemudian berkata; saya telah datang kepadamu dari Gunung Thayyi`, saya telah membuat lelah kendaraan dan diriku, tidak ada gunung melainkan saya melakukan wukuf padanya, apakah saya mendapatkan haji? Maka beliau bersabda: \"Barang siapa yang melakukan sholat subuh di sini bersama kami dan telah mendatangi Arafah sebelumnya, sungguh ia telah membersihkan kotorannya dan hajinya telah sempurna.\" "
            },
            {
                "number": 2903,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي بُكَيْرُ بْنُ عَطَاءٍ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَعْمَرَ الدِّيلِيَّ قَالَشَهِدْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ وَأَتَاهُ نَاسٌ مِنْ نَجْدٍ فَأَمَرُوا رَجُلًا فَسَأَلَهُ عَنْ الْحَجِّ فَقَالَ الْحَجُّ عَرَفَةُ مَنْ جَاءَ لَيْلَةَ جَمْعٍ قَبْلَ صَلَاةِ الصُّبْحِ فَقَدْ أَدْرَكَ حَجَّهُ أَيَّامُ مِنًى ثَلَاثَةُ أَيَّامٍ مَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ ثُمَّ أَرْدَفَ رَجُلًا فَجَعَلَ يُنَادِي بِهَا فِي النَّاسِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Sufyan], ia berkata; telah menceritakan kepada kami [Bukair bin 'Atho`], ia berkata; saya pernah mendengar [Abdur Rahman bin Ya'mar Ad Dili], ia berkata; saya menyaksikan Nabi shallallahu 'alaihi wasallam di Arafah di datangi orang-orang dari Najed, kemudian mereka memerintakan seseorang untuk bertanya, lalu orang tersebut bertanya kepadanya mengenai haji. Lalu beliau bersabda: \"Inti Haji adalah wukuf di Arafah, barang siapa yang datang pada malam tanggal sembilan Dzul Hijjah sebelum sholat Subuh, maka sungguh ia telah mendapatkan hajinya. Hari-hari di Mina adalah tiga hari, barang siapa yang menyegerakan pada dua hari maka tidak ada dosa baginya dan barang siapa yang menunda maka tidak ada dosa baginya.\" Kemudian beliau memboncengkan seseorang dan dia mulai mengumumkan hal tersebut diantara manusia. "
            },
            {
                "number": 2904,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبِي قَالَأَتَيْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُزْدَلِفَةُ كُلُّهَا مَوْقِفٌ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Yahya bin Sa'id], ia berkata; telah menceritakan kepada kami [Ja'far bin Muhammad], ia berkata; telah menceritakan kepadaku [ayahku], ia berkata; saya pernah datang kepada [Jabir bin Abdullah], kemudian ia menceritakan kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: Al Muzdalifah seluruhnya adalah tempat untuk wukuf. "
            },
            {
                "number": 2905,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ فِي حَدِيثِهِ عَنْ أَبِي الْأَحْوَصِ عَنْ حُصَيْنٍ عَنْ كَثِيرٍ وَهُوَ ابْنُ مُدْرِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ قَالَ ابْنُ مَسْعُودٍ وَنَحْنُ بِجَمْعٍسَمِعْتُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ يَقُولُ فِي هَذَا الْمَكَانِ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dalam haditsnya dari [Abu Al Ahwash] dari [Hushain] dari [Katsir yaitu Ibnu Mudrik] dari [Abdur Rahman bin Yazid], ia berkata; [Ibnu Mas'ud] berkata sedang kami berada di Muzdalifah; saya telah mendengar orang yang kepadanya diturunkan Surat Al Baqarah mengucapkan di tempat ini: LABBAIKALLAAHUMMA LABBAIK.\""
            },
            {
                "number": 2906,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ قَالَ سَمِعْتُهُ يَقُولُشَهِدْتُ عُمَرَ بِجَمْعٍ فَقَالَ إِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا لَا يُفِيضُونَ حَتَّى تَطْلُعَ الشَّمْسُ وَيَقُولُونَ أَشْرِقْ ثَبِيرُ وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالَفَهُمْ ثُمَّ أَفَاضَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari ['Amr bin Maimun], ia berkata; saya mendengarnya berkata, saya pernah menyaksikan [Umar] di Muzdalifah seraya berkata; sesungguhnya orang-orang jahiliyah mereka dahulu tidak melakukan thawaf ifadhah hingga terbit matahari, dan mereka berkata; terbitlah wahai Tsabir. Dan Rasulullah shallallahu 'alaihi wasallam menyelisihi mereka dan melakukan thawaf ifadhah sebelum terbit matahari. "
            },
            {
                "number": 2907,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ أَشْهَبَ أَنَّ دَاوُدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُمْ أَنَّ عَمْرَو بْنَ دِينَارٍ حَدَّثَهُ أَنَّ عَطَاءَ بْنَ أَبِي رَبَاحٍ حَدَّثَهُمْ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُأَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ضَعَفَةِ أَهْلِهِ فَصَلَّيْنَا الصُّبْحَ بِمِنًى وَرَمَيْنَا الْجَمْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Abdul Hakam] dari [Asyhab] bahwa [Daud bin Abdur Rahman] ia telah menceritakan kepadanya bahwa ['Amr bin Dinar] telah menceritakan kepadanya bahwa ['Atho` bin Abi Rabah] telah menceritakan kepadanya bahwa ia telah mendengar [Ibnu Abbas] berkata; Rasulullah shallallahu 'alaihi wasallam mengirimku berada bersama keluarganya yang lemah, kemudian kami melakukan sholat Subuh di Mina dan melempar jumrah. "
            },
            {
                "number": 2908,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ قَالَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ أُمِّ الْمُؤْمِنِينَ عَائِشَةَ قَالَتْوَدِدْتُ أَنِّي اسْتَأْذَنْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا اسْتَأْذَنَتْهُ سَوْدَةُ فَصَلَّيْتُ الْفَجْرَ بِمِنًى قَبْلَ أَنْ يَأْتِيَ النَّاسُ وَكَانَتْ سَوْدَةُ امْرَأَةً ثَقِيلَةً ثَبِطَةً فَاسْتَأْذَنَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَذِنَ لَهَا فَصَلَّتْ الْفَجْرَ بِمِنًى وَرَمَتْ قَبْلَ أَنْ يَأْتِيَ النَّاسُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Adam bin Sulaiman], ia berkata; telah menceritakan kepada kami [Abdur Rahim bin Sulaiman] dari ['ubaidhullah] dari [Abdur Rahman bin Al Qasim] dari [bapaknya] dari [Ummul mukminin Aisyah], ia berkata; saya berkeinginan bahwa saya meminta izin kepada Rasulullah shallallahu 'alaihi wasallam sebagaimana Saudah meminta izin kepadanya, kemudian melakukan sholat Subuh di Mina sebelum orang-orang datang. Saudah adalah wanita yang berat dan lambat geraknya. Lalu ia meminta izin kepada Rasulullah shallallahu 'alaihi wasallam kemudian beliau memberikan izin kepadanya, lalu melakukan sholat Subuh di Mina dan melempar jumrah sebelum orang-orang datang. "
            },
            {
                "number": 2909,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّ مَوْلًى لِأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَخْبَرَهُ قَالَجِئْتُ مَعَ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ مِنًى بِغَلَسٍ فَقُلْتُ لَهَا لَقَدْ جِئْنَا مِنًى بِغَلَسٍ فَقَالَتْ قَدْ كُنَّا نَصْنَعُ هَذَا مَعَ مَنْ هُوَ خَيْرٌ مِنْكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah], ia berkata; telah memberitakan kepadaku [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Yahya bin Sa'id] dari ['Atho` bin Abi Rabah] bahwa [sahaya Asma` binti Abi Bakr] telah mengabarkan kepadanya, ia berkata; saya pernah datang ke Mina bersama Asma` binti Abi Bakar pada malam hari, [Asma`] berkata; dahulu kami pernah melakukan hal ini bersama orang yang lebih baik darimu."
            },
            {
                "number": 2910,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ قَالَسُئِلَ أُسَامَةُ بْنُ زَيْدٍ وَأَنَا جَالِسٌ مَعَهُ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسِيرُ فِي حَجَّةِ الْوَدَاعِ حِينَ دَفَعَ قَالَ كَانَ يُسَيِّرُ نَاقَتَهُ فَإِذَا وَجَدَ فَجْوَةً نَصَّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Samalah], ia berkata; telah menceritakan kepada kami [Abdur Rahman bin Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Hisyam bin 'Urwah] dari [ayahnya], ia berkata; [Usamah bin Zaid] ditanya dan saya sedang duduk bersamanya; bagaimana Rasulullah shallallahu 'alaihi wasallam berjalan pada saat haji wada' ketika bertolak? Ia berkata; beliau menjalankan untanya, kemudian apabila mendapati kelonggaran beliau mempercepat jalannya. "
            },
            {
                "number": 2911,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ أَبِي مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ الفَضْلِ بْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلنَّاسِ حِينَ دَفَعُوا عَشِيَّةَ عَرَفَةَ وَغَدَاةَ جَمْعٍ عَلَيْكُمْ بِالسَّكِينَةِ وَهُوَ كَافٌّ نَاقَتَهُ حَتَّى إِذَا دَخَلَ مِنًى فَهَبَطَ حِينَ هَبَطَ مُحَسِّرًا قَالَ عَلَيْكُمْ بِحَصَى الْخَذْفِ الَّذِي يُرْمَى بِهِ الْجَمْرَةُ وَقَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشِيرُ بِيَدِهِ كَمَا يَخْذِفُ الْإِنْسَانُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] dari [Abu Ma'bad] dari [Abdullah bin Abbas] dari [Al Fadhl bin Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada manusia ketika mereka bertolak pada sore Hari Arafah, serta pada pagi hari di Muzdalifah: \"Hendaknya kalian tenang.\" Dan beliau menahan untanya hingga setelah beliau memasuki Mina beliau turun ketika turun di Muhassir. Beliau bersabda: \"Hendaknya kalian mengambil kerikil untuk melempar yang digunakan untuk melempar jumrah.\" Usamah berkata; Nabi shallallahu 'alaihi wasallam bersabda dengan memberikan isyarat menggunakan tangannya Seperti seseorang melempar."
            },
            {
                "number": 2912,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْضَعَ فِي وَادِي مُحَسِّرٍ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Muhammad], ia berkata; telah menceritakan kepada kami [Yahya] dari [Sufyan] dari [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam mempercepat jalannya di Bukit Muhassir. "
            },
            {
                "number": 2913,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ هَارُونَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ قَالَدَخَلْنَا عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ فَقُلْتُ أَخْبِرْنِي عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ مِنْ الْمُزْدَلِفَةِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ وَأَرْدَفَ الْفَضْلَ بْنَ الْعَبَّاسِ حَتَّى أَتَى مُحَسِّرًا حَرَّكَ قَلِيلًا ثُمَّ سَلَكَ الطَّرِيقَ الْوُسْطَى الَّتِي تُخْرِجُكَ عَلَى الْجَمْرَةِ الْكُبْرَى حَتَّى أَتَى الْجَمْرَةَ الَّتِي عِنْدَ الشَّجَرَةِ فَرَمَى بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ مِنْهَا حَصَى الْخَذْفِ رَمَى مِنْ بَطْنِ الْوَادِي",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Harun], ia berkata; telah menceritakan kepada kami [Hatim bin Isma'il], ia berkata; telah menceritakan kepada kami [Ja'far bin Muhammad] dari [ayahnya], ia berkata; kami menemui [Jabir bin Abdullah] kemudian saya katakan; kabarkan kepadaku mengenai haji Nabi shallallahu 'alaihi wasallam. Lalu ia berkata; Rasulullah shallallahu 'alaihi wasallam bertolak dari Muzdalifah sebelum terbit matahari, dan beliau memboncengkan Al Fadhl bin Al Abbas hingga jika beliau sampai di Muhassir, beliau agak mempercepat untanya, kemudian menelusuri jalan tengah yang mengeluarkanmu untuk melakukan jumrah kubra, hingga beliau sampai pada jumrah yang berada di sisi pohon, lalu beliau melempar dengan tujuh kerikil dan bertakbir bersamaan dengan setiap satu kerikil untuk melempar, beliau melempar dari tengah bukit. "
            },
            {
                "number": 2914,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفْيَانَ وَهُوَ ابْنُ حَبِيبٍ عَنْ عَبْدِ الْمَلِكِ بْنِ جُرَيْجٍ وَعَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍأَنَّهُ كَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari [Sufyan yaitu Ibnu Habib] dari [Abdul Malik bin Juraij] serta [Abdul Malik bin Abi Sulaiman] dari ['Atho`] dari [Ibnu Abbas] dari [Al Fadhl bin Abbas] bahwa ia pernah membonceng Nabi shallallahu 'alaihi wasallam dan senantiasa beliau mengucapkan talbiyah hingga melempar jumrah. "
            },
            {
                "number": 2915,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّى حَتَّى رَمَى الْجَمْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dari [Abdur Rahman], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Habib] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam mengucapkan talbiyah hingga melempar jumrah. "
            },
            {
                "number": 2916,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا عَوْفٌ قَالَ حَدَّثَنَا زِيَادُ بْنُ حُصَيْنٍ عَنْ أَبِي الْعَالِيَةِ قَالَ قَالَ ابْنُ عَبَّاسٍقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدَاةَ الْعَقَبَةِ وَهُوَ عَلَى رَاحِلَتِهِ هَاتِ الْقُطْ لِي فَلَقَطْتُ لَهُ حَصَيَاتٍ هُنَّ حَصَى الْخَذْفِ فَلَمَّا وَضَعْتُهُنَّ فِي يَدِهِ قَالَ بِأَمْثَالِ هَؤُلَاءِ وَإِيَّاكُمْ وَالْغُلُوَّ فِي الدِّينِ فَإِنَّمَا أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ الْغُلُوُّ فِي الدِّينِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim Ad Dauraqi], ia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah], ia berkata; telah menceritakan kepada kami ['Auf], ia berkata; telah menceritakan kepada kami [Ziyad bin Hushain] dari [Abu Al 'Aliyah] ia berkata; [Ibnu Abbas] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku pada pagi hari di 'Aqabah dan beliau berada di atas kendaraannya: \"Ambilkan untukku, \" lalu aku mengambilkan beberapa kerikil untuk beliau yaitu kerikil untuk melempar. Ketika aku meletakkan di tangan beliau, beliau bersabda sembari memberi permisalan dengan kerikil-kerikil tersebut: \"Janganlah kalian berlebih-lebihan dalam agama, karena yang membinasakan orang-orang sebelum kalian adalah sikap berlebih-lebihan dalam agama.\""
            },
            {
                "number": 2917,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ أَبِي مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلنَّاسِ حِينَ دَفَعُوا عَشِيَّةَ عَرَفَةَ وَغَدَاةَ جَمْعٍ عَلَيْكُمْ بِالسَّكِينَةِ وَهُوَ كَافٌّ نَاقَتَهُ حَتَّى إِذَا دَخَلَ مِنًى فَهَبَطَ حِينَ هَبَطَ مُحَسِّرًا قَالَ عَلَيْكُمْ بِحَصَى الْخَذْفِ الَّذِي تُرْمَى بِهِ الْجَمْرَةُ قَالَ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشِيرُ بِيَدِهِ كَمَا يَخْذِفُ الْإِنْسَانُ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] dari [Abu Ma'bad] dari [Abdullah bin Abbas] dari [Al Fadhl bin Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada manusia ketika mereka bertolak pada sore hari Arafah, dan pagi hari di Muzdalifah: \"Hendaknya kalian tenang.\" Dan beliau menahan untanya hingga setelah beliau memasuki Mina, lalu turun ketika turun di Muhassir beliau bersabda: \"Ambillah kerikil untuk melempar yang digunakan untuk melempar jumrah.\" Al Fadhl berkata; dan Nabi shallallahu 'alaihi wasallam memberikan isyarat dengan tangannya seperti seseorang sedang melempar. "
            },
            {
                "number": 2918,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عَوْفٌ قَالَ حَدَّثَنَا زِيَادُ بْنُ حُصَيْنٍ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدَاةَ الْعَقَبَةِ وَهُوَ وَاقِفٌ عَلَى رَاحِلَتِهِ هَاتِ الْقُطْ لِي فَلَقَطْتُ لَهُ حَصَيَاتٍ هُنَّ حَصَى الْخَذْفِ فَوَضَعْتُهُنَّ فِي يَدِهِ وَجَعَلَ يَقُولُ بِهِنَّ فِي يَدِهِ وَوَصَفَ يَحْيَى تَحْرِيكَهُنَّ فِي يَدِهِ بِأَمْثَالِ هَؤُلَاءِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami ['Auf], ia berkata; telah menceritakan kepada kami [Ziyad bin Hushain] dari [Abu Al 'Aliyah] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada pagi hari di 'Aqabah, dalam keadaan berdiri di atas untanya: \"Ambilkan untukku.\" Lalu saya mengambilkan beberapa kerikil untuknya alias kerikil untuk melempar. Kemudian saya meletakkannya di tangan beliau, dan beliau bersabda dengan kerikil ada di tangannya, dan Yahya menyebutkan penggerakan kerikil tersebut di tangannya memberikan permisalan dengan kerikil-kerikil tersebut. "
            },
            {
                "number": 2919,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ أَبِي عَبْدِ الرَّحِيمِ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ يَحْيَى بْنِ الْحُصَيْنِ عَنْ جَدَّتِهِ أُمِّ حُصَيْنٍ قَالَتْحَجَجْتُ فِي حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُ بِلَالًا يَقُودُ بِخِطَامِ رَاحِلَتِهِ وَأُسَامَةُ بْنُ زَيْدٍ رَافِعٌ عَلَيْهِ ثَوْبَهُ يُظِلُّهُ مِنْ الْحَرِّ وَهُوَ مُحْرِمٌ حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ ثُمَّ خَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَذَكَرَ قَوْلًا كَثِيرًا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Hisyam], ia berkata; telah menceritakan kepada kami [Muhammad bin Salamah] dari [Abu Abdur Rahim] dari [Zaid bin Abu Unais] dari [Yahya bin Al Hushain] dari neneknya yaitu [Ummu Hushain], ia berkata; saya berhaji pada saat Nabi shallallahu 'alaihi wasallam berhaji, lalu saya melihat Bilal menuntun tali kekang kendaraan beliau, sedangkan Usamah bin Zaid mengangkat pakaiannya untuk menaungi beliau dari panas, dan ia sedang berihram hingga beliau melempar Jumrah Aqabah, kemudian berkhutbah kepada manusia. Beliau memuji Allah dan menyebutkan banyak hal. "
            },
            {
                "number": 2920,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا أَيْمَنُ بْنُ نَابِلٍ عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي جَمْرَةَ الْعَقَبَةِ يَوْمَ النَّحْرِ عَلَى نَاقَةٍ لَهُ صَهْبَاءَ لَا ضَرْبَ وَلَا طَرْدَ وَلَا إِلَيْكَ إِلَيْكَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Waki'], ia berkata; telah menceritakan kepada kami [Aiman bin Nabil] dari [Qudamah bin Abdullah], ia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam melempar Jumrah Aqabah pada hari kurban di atas untanya yang rambutnya berwarna merah kehitaman, tidak ada pemukulan, pengusiran dan perkataan \"menjauhlah dariku, menjauhlah dariku\"."
            },
            {
                "number": 2921,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي الْجَمْرَةَ وَهُوَ عَلَى بَعِيرِهِ وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ خُذُوا مَنَاسِكَكُمْ فَإِنِّي لَا أَدْرِي لَعَلِّي لَا أَحُجُّ بَعْدَ عَامِي هَذَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya bin Sa'id], ia berkata; telah memberitakan kepada kami [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia mendengar [Jabir bin Abdullah], ia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam melempar jumrah dengan menaiki untanya, dan bersabda: \"Wahai manusia, ambillah cara berhaji kalian, karena saya tidak mengetahui siapa tahu saya tidak melakukan haji lagi setelah tahun ini.\""
            },
            {
                "number": 2922,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ بْنِ إِبْرَاهِيمَ الثَّقَفِيُّ الْمَرْوَزِيُّ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَرَمَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَمْرَةَ يَوْمَ النَّحْرِ ضُحًى وَرَمَى بَعْدَ يَوْمِ النَّحْرِ إِذَا زَالَتْ الشَّمْسُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Ayyub bin Ibrahim Ats Tsaqafi Al Marwazi], ia berkata; telah memberitakan kepada kami [Abdullah bin Idris] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam melempar Jumrah pada hari kurban pada pagi hari dan melempar setelah hari kurban apabila matahari telah tergelincir. "
            },
            {
                "number": 2923,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُغَيْلِمَةَ بَنِي عَبْدِ الْمُطَّلِبِ عَلَى حُمُرَاتٍ يَلْطَحُ أَفْخَاذَنَا وَيَقُولُ أُبَيْنِيَّ لَا تَرْمُوا جَمْرَةَ الْعَقَبَةِ حَتَّى تَطْلُعَ الشَّمْسُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid Al Muqri`], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Sufyan Ats Tsauri] dari [Salamah bin Kuhail] dari [Al Hasan Al 'Urani] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutus kami yaitu anak-anak Bani Abdul Muththalib diatas beberapa ekor keledai, beliau memukul pelan paha kami dan bersabda: \"Wahai anak-anakku, jangan melempar jumrah Aqabah hingga matahari terbit.\""
            },
            {
                "number": 2924,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدَّمَ أَهْلَهُ وَأَمَرَهُمْ أَنْ لَا يَرْمُوا الْجَمْرَةَ حَتَّى تَطْلُعَ الشَّمْسُ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghaila], ia berkata; telah menceritakan kepada kami [Bisyr bin As Sari], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Habib] dari ['Atho`] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam mendahulukan keluarganya dan memerintahkan mereka untuk tidak melempar jumrah hingga matahari terbit. "
            },
            {
                "number": 2925,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الطَّائِفِيُّ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ قَالَ حَدَّثَتْنِي عَائِشَةُ بِنْتُ طَلْحَةَ عَنْ خَالَتِهَا عَائِشَةَ أُمِّ الْمُؤْمِنِينَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ إِحْدَى نِسَائِهِ أَنْ تَنْفِرَ مِنْ جَمْعٍ لَيْلَةَ جَمْعٍ فَتَأْتِيَ جَمْرَةَ الْعَقَبَةِ فَتَرْمِيَهَا وَتُصْبِحَ فِي مَنْزِلِهَاوَكَانَ عَطَاءٌ يَفْعَلُهُ حَتَّى مَاتَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Abdul A'la bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Abdullah bin Abdur Rahman Ath Thaifi] dari ['Atho` bin Abi Rabah], ia berkata; telah menceritakan kepadaku [Aisyah binti Thalhah] dari bibinya yaitu [Aisyah Ummul mukminin] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan salah seorang istrinya agar bertolak dari Muzdalifah pada malam sembilan Dzul Hijjah, lalu datang ke Jumrah Aqobah dan melemparnya dan pada pagi hari ia dirumahnya, dan Atho' melakukannya hingga ia meninggal."
            },
            {
                "number": 2926,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْأَلُ أَيَّامَ مِنًى فَيَقُولُ لَا حَرَجَ فَسَأَلَهُ رَجُلٌ فَقَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ قَالَ لَا حَرَجَ فَقَالَ رَجُلٌ رَمَيْتُ بَعْدَ مَا أَمْسَيْتُ قَالَ لَا حَرَجَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Bazi'], ia berkata; telah menceritakan kepada kami [Yazid yaitu ibnu Zurai'], ia berkata; telah menceritakan kepada kami [Khalid] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Pernah Rasulullah shallallahu 'alaihi wasallam ditanya tentang hari-hari berada di Mina, beliau bersabda: \" Tidak mengapa\", lalu seseorang bertanya kepadanya, ia berkata; aku mencukur rambut sebelum menyembelih, maka beliau menjawab: \"Tidak mengapa, \" lalu seseorang bertanya; aku melempar setelah petang hari, beliau menjawab: \" Tidak mengapa.\""
            },
            {
                "number": 2927,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ أَبِي الْبَدَّاحِ بْنِ عَدِيٍّ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلرُّعَاةِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits] serta [Muhammad bin Al Mutsanna] dari [Sufyan] dari [Abdullah bin Abi Bakr] dari [ayahnya] dari [Abu Al Baddah bin 'Ashim bin 'Adi] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam memberikan keringanan kepada para penggembala untuk melempar jumrah satu hari dan berhenti satu hari. "
            },
            {
                "number": 2928,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مَالِكٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمِ بْنِ عَدِيٍّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلرُّعَاةِ فِي الْبَيْتُوتَةِ يَرْمُونَ يَوْمَ النَّحْرِ وَالْيَوْمَيْنِ اللَّذَيْنِ بَعْدَهُ يَجْمَعُونَهُمَا فِي أَحَدِهِمَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Malik], ia berkata; telah menceritakan kepada kami [Abdullah bin Abi Bakr] dari [ayahnya] dari [Abu Al Baddah bin 'Ashim bin Adi] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan bagi para penggembala untuk bermalam di luar Mina, mereka melempar jumrah pada hari kurban, serta dua hari setelahnya yang mereka gabung pada salah satu dari keduanya. "
            },
            {
                "number": 2929,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي مُحَيَّاةَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ يَزِيدَ قَالَقِيلَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ إِنَّ نَاسًا يَرْمُونَ الْجَمْرَةَ مِنْ فَوْقِ الْعَقَبَةِ قَالَ فَرَمَى عَبْدُ اللَّهِ مِنْ بَطْنِ الْوَادِي ثُمَّ قَالَ مِنْ هَا هُنَا وَالَّذِي لَا إِلَهَ غَيْرُهُ رَمَى الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Abu Muhayyah] dari [Salamah bin Kuhail] dari [Abdur Rahman yaitu Ibnu Yazid], ia berkata; dikatakan kepada Abdullah bin Mas'ud; Ada orang-orang yang melempar jumrah dari atas Aqabah. Abdur Rahman berkata; lalu [Abdullah bin Mas'ud] melempar dari tengah bukit kemudian berkata; demi Dzat yang tidak ada tuhan yang berhak disembah selainnya, orang yang diturunkan kepadanya Surat Al Baqarah pernah melempar dari sini. "
            },
            {
                "number": 2930,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ وَمَالِكُ بْنُ الْخَلِيلِ قَالَا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ الْحَكَمِ وَمَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَرَمَى عَبْدُ اللَّهِ الْجَمْرَةَ بِسَبْعِ حَصَيَاتٍ جَعَلَ الْبَيْتَ عَنْ يَسَارِهِ وَعَرَفَةَ عَنْ يَمِينِهِ وَقَالَ هَا هُنَا مَقَامِ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِقَالَ أَبُو عَبْد الرَّحْمَنِ مَا أَعْلَمُ أَحَدًا قَالَ فِي هَذَا الْحَدِيثِ مَنْصُورٌ غَيْرَ ابْنِ أَبِي عَدِيٍّ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Muhammad Az Za'farani] dan [Malik bin Al Khalil] mereka berkata; telah menceritakan kepada kami [Ibnu Abi Adi] dari [Syu'bah] dari [Al Hakam] dan [Manshur] dari [Ibrahim] dari [Abdur Rahman bin Yazid], ia berkata; [Abdullah] telah melempar jumrah dengan tujuh kerikil, ia menjadikan Ka'bah di sebelah kirinya dan Arafah di sebelah kanannya, dan ia berkata; di sinilah tempat berdiri orang yang diturunkan kepadanya Surat Al Baqarah. Abu Abdur Rahman berkata; saya tidak mengetahui seorangpun yang berbicara mengenai hadis ini. Manshur bukanlah Ibnu Abi Adi, wallahu ta'ala a'lam."
            },
            {
                "number": 2931,
                "arab": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى عَنْ هُشَيْمٍ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ قَالَرَأَيْتُ ابْنَ مَسْعُودٍ رَمَى جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي ثُمَّ قَالَ هَا هُنَا وَالَّذِي لَا إِلَهَ غَيْرُهُ مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ",
                "id": "Telah mengabarkan kepada kami [Mujahid bin Musa] dari [Husyaim] dari [Mughirah] dari [Ibrahim], ia berkata; telah menceritakan kepada kami [Abdur Rahman bin Yazid], ia berkata; saya melihat [Ibnu Mas'ud] melempar Jumrah Aqabah, dari tengah bukit kemudian berkata; demi Dzat yang tidak ada tuhan yang berhak disembah selain-Nya, di sinilah tempat berdiri orang yang kepadanya diturunkan Surat Al Baqarah. "
            },
            {
                "number": 2932,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا ابْنُ أَبِي زَائِدَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ سَمِعْتُ الْحَجَّاجَ يَقُولُ لَا تَقُولُوا سُورَةَ الْبَقَرَةِ قُولُوا السُّورَةَ الَّتِي يُذْكَرُ فِيهَا الْبَقَرَةُ فَذَكَرْتُ ذَلِكَ لِإِبْرَاهِيمَ فَقَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَأَنَّهُ كَانَ مَعَ عَبْدِ اللَّهِ حِينَ رَمَى جَمْرَةَ الْعَقَبَةِ فَاسْتَبْطَنَ الْوَادِيَ وَاسْتَعْرَضَهَا يَعْنِي الْجَمْرَةَ فَرَمَاهَا بِسَبْعِ حَصَيَاتٍ وَكَبَّرَ مَعَ كُلِّ حَصَاةٍ فَقُلْتُ إِنَّ أُنَاسًا يَصْعَدُونَ الْجَبَلَ فَقَالَ هَا هُنَا وَالَّذِي لَا إِلَهَ غَيْرُهُ رَأَيْتُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ رَمَى",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah memberitakan kepada kami [Ibnu Abi Zaidah], ia berkata; telah menceritakan kepada kami [Al A'masy], saya mendengar Al Hajjaj berkata; janganlah kalian mengatakan; surat Al Baqarah, katakanlah Surat yang disebutkan padanya sapi. Maka saya sebutkan hal tersebut kepada [Ibrahim], lalu ia berkata; telah mengabarkan kepadaku [Abdur Rahman bin Yazid] bahwa ia bersama [Abdullah] ketika melempar jumrah Aqabah, lalu ia berada ditengah bukit dan menghadap kepadanya yaitu jumrah, lalu melemparnya dengan tujuh kerikil, dan bertakbir bersamaan dengan setiap kerikil. Lalu saya katakan; sesungguhnya orang-orang menaiki gunung lalu ia berkata; demi Dzat yang tidak ada tuhan yang berhak disembah selain-Nya, di sinilah saya melihat orang yang diturunkan kepadanya Surat Al Baqarah melempar jumrah."
            },
            {
                "number": 2933,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ عَنْ عَبْدِ الرَّحِيمِ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ وَذَكَرَ آخَرُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Adam] dari [Abdur Rahim] dari ['ubaidhullah bin Umar] dan orang lain menyebutkan dari [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam melempar Jumrah dengan kerikil seperti kerikil untuk melempar. "
            },
            {
                "number": 2934,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي الْجِمَارَ بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir], ia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam melempar Jumrah dengan kerikil seperti kerikil untuk melempar. "
            },
            {
                "number": 2935,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ هَارُونَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ عَلِيِّ بْنِ حُسَيْنٍ عَنْ أَبِيهِ قَالَدَخَلْنَا عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ فَقُلْتُ أَخْبِرْنِي عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى الْجَمْرَةَ الَّتِي عِنْدَ الشَّجَرَةِ بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ مِنْهَا حَصَى الْخَذْفِ رَمَى مِنْ بَطْنِ الْوَادِي ثُمَّ انْصَرَفَ إِلَى الْمَنْحَرِ فَنَحَرَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Harun], ia berkata; telah menceritakan kepada kami [Hatim bin Isma'il], ia berkata; telah menceritakan kepada kami [Ja'far bin Muhammad bin Ali bin Husain] dari [ayahnya], ia berkata; kami pernah menemui [Jabir bin Abdullah], kemudian saya katakan; kabarkan kepadaku mengenai haji Nabi shallallahu 'alaihi wasallam. Lalu ia berkata; Rasulullah shallallahu 'alaihi wasallam melempar Jumrah yang ada di sisi pohon dengan tujuh kerikil, dan beliau bertakbir bersamaan dengan setiap kerikil dari kerikil-kerikil tersebut yaitu kerikil untuk melempar, beliau melempar dari tengah bukit, kemudian bertolak menuju tempat penyembelihan kemudian beliau menyembelih. "
            },
            {
                "number": 2936,
                "arab": "أَخْبَرَنِي يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ أَبِي نَجِيحٍ قَالَ قَالَ مُجَاهِدٌ قَالَ سَعْدٌرَجَعْنَا فِي الْحَجَّةِ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَعْضُنَا يَقُولُ رَمَيْتُ بِسَبْعِ حَصَيَاتٍ وَبَعْضُنَا يَقُولُ رَمَيْتُ بِسِتٍّ فَلَمْ يَعِبْ بَعْضُهُمْ عَلَى بَعْضٍ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Musa Al Balkhi], ia berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ibnu Abi Najih], ia berkata; [Mujahid] berkata; telah berkata [Sa'ad]; kami kembali ketika berhaji bersama Nabi shallallahu 'alaihi wasallam, dan sebagian kami berkata; saya melempar dengan tujuh kerikil, dan sebagian kami berkata; saya melempar dengan enam, dan sebagian mereka tidak mencela sebagian yang lain. "
            },
            {
                "number": 2937,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَبَا مِجْلَزٍ يَقُولُسَأَلْتُ ابْنَ عَبَّاسٍ عَنْ شَيْءٍ مِنْ أَمْرِ الْجِمَارِ فَقَالَ مَا أَدْرِي رَمَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسِتٍّ أَوْ بِسَبْعٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah], ia berkata; saya mendengar [Abu Mijlaz] berkata; saya pernah bertanya kepada [Ibnu Abbas] mengenai sebagian perkara pelemparan jumrah. Lalu ia berkata; saya tidak mengetahui apakah Rasulullah shallallahu 'alaihi wasallam melempar dengan enam atau tujuh kerikil. "
            },
            {
                "number": 2938,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ الْكُوفِيُّ قَالَ حَدَّثَنَا حَفْصٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ ابْنِ عَبَّاسٍ عَنْ أَخِيهِ الْفَضْلِ بْنِ عَبَّاسٍ قَالَكُنْتُ رِدْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ فَرَمَاهَا بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ",
                "id": "Telah mengabarkan kepada kami [Harun bin Ishaq Al Hamdani Al Kufi], ia berkata; telah menceritakan kepada kami [Hafsh] dari [Ja'far bin Muhammad] dari [ayahnya] dari [Ali bin Al Husain] dari [Ibnu Abbas] dari saudaranya yaitu [Al Fadhl bin Abbas], ia berkata; saya pernah membonceng Nabi shallallahu 'alaihi wasallam, dan beliau senantiasa mengucapkan talbiyah hingga melempar Jumrah Aqabah, beliau melemparnya dengan tujuh kerikil, dan bertakbir bersamaan dengan setiap kerikil. "
            },
            {
                "number": 2939,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ خُصَيْفٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عبَّاسٍ قَالَ قَالَ الْفَضْلُ بْنُ عَبَّاسٍكُنْتُ رِدْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا زِلْتُ أَسْمَعُهُ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ فَلَمَّا رَمَى قَطَعَ التَّلْبِيَةَ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Abu Al Ahwash] dari [Khushaif] dari [Mujahid] dari [Ibnu Abbas], ia berkata; [Al Fadhl bin Abbas] berkata; saya pernah membonceng Rasulullah shallallahu 'alaihi wasallam, senantiasa saya mendengar beliau mengucapkan talbiyah hingga melempar Jumrah Aqabah, tatkala melempar beliau menghentikan talbiyah. "
            },
            {
                "number": 2940,
                "arab": "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ بْنِ هِلَالٍ قَالَ حَدَّثَنَا حُسَيْنٌ قَالَ حَدَّثَنَا أَبُو خَيْثَمَةَ قَالَ حَدَّثَنَا خُصَيْفٌ عَنْ مُجَاهِدٍ وَعَامِرٌ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ الْفَضْلَ أَخْبَرَهُأَنَّهُ كَانَ رَدِيفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَّهُ لَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ",
                "id": "Telah mengabarkan kepada kami [Hilal bin Al 'Ala` bin Hilal], ia berkata; telah menceritakan kepada kami [Husain], ia berkata; telah menceritakan kepada kami [Abu Khutsaimah], ia berkata; telah menceritakan kepada kami [Khushaif] dari [Mujahid] serta ['Amir] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa [Al Fadhl] telah mengabarkan kepadanya bahwa ia pernah membonceng Rasulullah shallallahu 'alaihi wasallam dan beliau senantiasa mengucapkan talbiyah hingga melempar jumrah. "
            },
            {
                "number": 2941,
                "arab": "أَخْبَرَنَا أَبُو عَاصِمٍ خُشَيْشُ بْنُ أَصْرَمَ عَنْ عَلِيِّ بْنِ مَعْبَدٍ قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ الْعَبَّاسِأَنَّهُ كَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim Khusyaisy bin Ashram] dari [Ali bin Ma'bad], ia berkata; telah menceritakan kepada kami [Musa bin A'yan] dari [Abdul Karim Al Jaziri] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari [Al Fadhl bin Al Abbas] bahwa ia pernah membonceng Nabi shallallahu 'alaihi wasallam dan beliau senantiasa mengucapkan talbiyah hingga melempar Jumrah Aqabah. "
            },
            {
                "number": 2942,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ أَنْبَأَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَبَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَمَى الْجَمْرَةَ الَّتِي تَلِي الْمَنْحَرَ مَنْحَرَ مِنًى رَمَاهَا بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ ثُمَّ تَقَدَّمَ أَمَامَهَا فَوَقَفَ مُسْتَقْبِلَ الْقِبْلَةِ رَافِعًا يَدَيْهِ يَدْعُو يُطِيلُ الْوُقُوفَ ثُمَّ يَأْتِي الْجَمْرَةَ الثَّانِيَةَ فَيَرْمِيهَا بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ ثُمَّ يَنْحَدِرُ ذَاتَ الشِّمَالِ فَيَقِفُ مُسْتَقْبِلَ الْبَيْتِ رَافِعًا يَدَيْهِ يَدْعُو ثُمَّ يَأْتِي الْجَمْرَةَ الَّتِي عِنْدَ الْعَقَبَةِ فَيَرْمِيهَا بِسَبْعِ حَصَيَاتٍ وَلَا يَقِفُ عِنْدَهَاقَالَ الزُّهْرِيُّ سَمِعْتُ سَالِمًا يُحَدِّثُ بِهَذَا عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ",
                "id": "Telah mengabarkan kepada kami [Al Abbas bin Abdul 'Azhim Al 'Anbari], ia berkata; telah menceritakan kepada kami [Utsman bin Umar], ia berkata; telah memberitakan kepada kami [Yunus] dari [Az Zuhri], ia berkata; telah sampai kepada kami berita bahwa Rasulullah shallallahu 'alaihi wasallam apabila melempar jumrah yang terletak setelah tempat menyembelih yaitu tempat menyembelih di Mina, beliau melemparnya dengan tujuh kerikil, beliau bertakbir setiap kali melempar dengan kerikil, kemudian maju ke depan, lalu berdiri menghadap Kiblat dengan mengangkat kedua tangannya, berdo'a dan berdiri lama. Kemudian beliau mendatangi Jumrah yang kedua, lalu melemparnya dengan tujuh kerikil, dan bertakbir setiap kali melempar dengan kerikil. Kemudian beliau turun ke sebelah kiri, lalu berdiri menghadap Ka'bah dengan mengangkat kedua tangannya, dan berdo'a. Kemudian mendatangi Jumrah yang ada di Aqabah, lalu melemparnya dengan tujuh kerikil. Dan tidak berdiri di sisinya. Az Zuhri berkata; saya mendengar [Salim] menceritakan hal ini dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, dan Ibnu Umar melakukannya. "
            },
            {
                "number": 2943,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَإِذَا رَمَى الْجَمْرَةَ فَقَدْ حَلَّ لَهُ كُلُّ شَيْءٍ إِلَّا النِّسَاءَ قِيلَ وَالطِّيبُ قَالَ أَمَّا أَنَا فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَضَمَّخُ بِالْمِسْكِ أَفَطِيبٌ هُوَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Al Hasan Al 'Uraini] dari [Ibnu Abbas], ia berkata; apabila telah melempar Jumrah maka halal baginya segala sesuatu kecuali wanita. Kemudian dikatakan kepadanya; dan minyak wangi? Maka ia berkata; adapun saya, melihat Rasulullah shallallahu 'alaihi wasallam berlumuran Kasturi, apakah itu adalah minyak wangi? "
            },
            {
                "number": 2944,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا أُخْرِجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَكَّةَ قَالَ أَبُو بَكْرٍ أَخْرَجُوا نَبِيَّهُمْ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ لَيَهْلِكُنَّ فَنَزَلَتْ{ أُذِنَ لِلَّذِينَ يُقَاتَلُونَ بِأَنَّهُمْ ظُلِمُوا وَإِنَّ اللَّهَ عَلَى نَصْرِهِمْ لَقَدِيرٌ }فَعَرَفْتُ أَنَّهُ سَيَكُونُ قِتَالٌ قَالَ ابْنُ عَبَّاسٍ فَهِيَ أَوَّلُ آيَةٍ نَزَلَتْ فِي الْقِتَالِ",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Muhammad bin Sallam], ia berkata; telah menceritakan kepada kami [Ishaq Al Azraq], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Muslim] dari [Sa'id bin Jubair] dari [Ibnu Abbas], ia berkata; tatkala Nabi shallallahu 'alaihi wasallam diusir dari Makkah, maka Abu Bakar berkata; mereka telah mengusir Nabi mereka, innaa lillaahi wa innaa ilaihi raaji'uun, sungguh mereka akan binasa. Lalu turunlah ayat UDZINA LILLADZIINA YUQAATALUUNA BIANNAHUM ZHULIMUU WAINNALLAAHA 'ALAA NASHRIHIM LAQADIIR. Maka saya tahu bahwa akan terjadi peperangan. Ibnu Abbas berkata; itu adalah yang ayat pertama yang turun mengenai perang."
            },
            {
                "number": 2945,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ قَالَ أَنْبَأَنَا أَبِي قَالَ أَنْبَأَنَا الْحُسَيْنُ بْنُ وَاقِدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ وَأَصْحَابًا لَهُ أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي عِزٍّ وَنَحْنُ مُشْرِكُونَ فَلَمَّا آمَنَّا صِرْنَا أَذِلَّةً فَقَالَ إِنِّي أُمِرْتُ بِالْعَفْوِ فَلَا تُقَاتِلُوا فَلَمَّا حَوَّلَنَا اللَّهُ إِلَى الْمَدِينَةِ أَمَرَنَا بِالْقِتَالِ فَكَفُّوا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ أَلَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ وَأَقِيمُوا الصَّلَاةَ }",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ali bin Al Hasan bin Syaqiq], ia berkata; telah memberitakan kepada kami [ayahku], ia berkata; telah memberitakan kepada kami [Al Husain bin Waqid] dari ['Amr bin Dinar] dari ['Ikrimah] dari [Ibnu Abbas] bahwa Abdurrahman bin Auf dan beberapa temannya mendatangi Nabi shallallahu 'alaihi wasallam di Mekkah, mereka berkata; wahai Rasulullah, kami dahulu berada dalam kemuliaan ketika kami musyrik, kemudian tatkala kami beriman kami menjadi hina. Beliau bersabda: \"Sesungguhnya saya diperintah untuk memaafkan maka janganlah kalian saling membunuh, \". Kemudian setelah Allah memindahkan kami ke Madinah beliau memerintah kami untuk berperang namun mereka enggan, lalu Allah 'azza wajalla menurunkan ayat ALAM TARA ILALLADZIINA QIILA LAHUM KUFFUU AIDIYAKUM WA AQIIMUSH SHALAAH."
            },
            {
                "number": 2946,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ مَعْمَرًا عَنْ الزُّهْرِيِّ قَالَ قُلْتُ عَنْ سَعِيدٍ قَالَ نَعَمْ عَنْ أَبِي هُرَيْرَةَ ح وَأَنْبَأَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لِأَحْمَدَ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُعِثْتُ بِجَوَامِعِ الْكَلِمِ وَنُصِرْتُ بِالرُّعْبِ وَبَيْنَا أَنَا نَائِمٌ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الْأَرْضِ فَوُضِعَتْ فِي يَدِيقَالَ أَبُو هُرَيْرَةَ فَذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْتُمْ تَنْتَثِلُونَهَا أَخْبَرَنَا هَارُونُ بْنُ سَعِيدٍ عَنْ خَالِدِ بْنِ نِزَارٍ قَالَ أَخْبَرَنِي الْقَاسِمُ بْنُ مَبْرُورٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la], ia berkata; telah menceritakan kepada kami [Mu'tamir], ia berkata; saya mendengar [Ma'mar] dari [Az Zuhri], ia berkata; saya berkata dari [Sa'id]? Ia berkata; ya. Dari [Abu Hurairah]. -Dan dari jalur periwayatan lain- Telah memberitakan kepada kami [Ahmad bin 'Amr bin As Sarh] serta [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Ahmad, mereka berdua mengatakan; telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dari [Ibnu Al Musayyab] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diutus dengan perkataan yang lafazhnya ringkas namun banyak maknanya, diberi kemenangan dengan adanya rasa takut yang ditanamkan pada diri musuh, dan disaat saya sedang tertidur saya diberi kunci-kunci perbendaharaan bumi, lalu diletakkan di tanganku.\" Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam telah pergi dan kalian mengeluarkannya dari tempatnya. Telah mengabarkan kepada kami [Harun bin Sa'id] dari [Khalid bin Nizar], ia berkata; telah memberitakan kepadaku [Al Qasim bin Mabrur] dari [Yunus] dari [Ibnu Syihab] dari [Abu Salamah] dari [Abu Hurairah], ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda seperti itu. "
            },
            {
                "number": 2947,
                "arab": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بُعِثْتُ بِجَوَامِعِ الْكَلِمِ وَنُصِرْتُ بِالرُّعْبِ وَبَيْنَا أَنَا نَائِمٌ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الْأَرْضِ فَوُضِعَتْ فِي يَدِيفَقَالَ أَبُو هُرَيْرَةَ فَقَدْ ذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْتُمْ تَنْتَثِلُونَهَا",
                "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid], ia berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dan [Abu Salamah bin Abdur Rahman] bahwa [Abu Hurairah] berkata; saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diutus dengan perkataan yang lafazhnya ringkas namun banyak maknanya, diberi kemenangan dengan adanya rasa takut yang ditanamkan pada diri musuh, dan disaat saya sedang tertidur saya diberi kunci-kunci perbendaharaan bumi, lalu diletakkan di tanganku.\" Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam telah pergi dan kalian telah mengeluarkannya dari tempatnya."
            },
            {
                "number": 2948,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la] serta [Al Harits bin Miskin] dengan membaca riwayat dan saya mendengar, dari [Ibnu Wahb], ia berkata; telah memberitakan kepadaku [Yunus] dari [Ibnu Syihab], ia berkata; telah menceritakan kepadaku [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia, hingga mereka mengucapkan LAA ILAAHA ILLALLAAH barang siapa yang mengucapkan LAA ILAAHA ILLALLAAH, maka ia telah melindungi harta dan jiwanya dariku, kecuali dengan haknya dan perhitungannya kepada Allah.\""
            },
            {
                "number": 2949,
                "arab": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ قَالَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ وَكَفَرَ مَنْ كَفَرَ مِنْ الْعَرَبِ قَالَ عُمَرُ يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ عَصَمَ مِنِّي نَفْسَهُ وَمَالَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَاللَّهِ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهَافَوَاللَّهِ مَا هُوَ إِلَّا أَنْ رَأَيْتُ اللَّهَ عَزَّ وَجَلَّ قَدْ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ وَعَرَفْتُ أَنَّهُ الْحَقُّ",
                "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid] dari [Muhammad bin Harb] dari [Az Zubaidi], dari [Az Zuhri] dari ['ubaidhullah bin Abdillah] dari [Abu Hurairah], ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam meninggal dan Abu Bakr ditunjuk menjadi khalifah, serta telah kafir orang yang kafir dari kalangan orang-orang Arab, maka [Umar] berkata; wahai Abu Bakr, bagaimana engkau memerangi manusia sedangkan Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH barang siapa yang mengucapkan LAA ILAAHA ILLALLAAH, maka ia telah melindungi jiwa dan hartanya dariku kecuali dengan haknya dan perhitungannya kepada Allah.\" Maka [Abu Bakr] berkata; sungguh saya akan memerangi orang yang memisahkan antara sholat dan zakat, karena zakat adalah haknya harta. Demi Allah seandainya mereka menolak memberikan kepadaku satu anak kambing saja yang dahulunya mereka tunaikan kepada Rasulullah shallallahu 'alaihi wasallam niscaya saya memerangi mereka karena penolakan tersebut. Demi Allah, tidak lain kecuali saya melihat Allah 'azza wajalla telah melapangkan hati Abu Bakr untuk memerangi mereka dan saya tahu bahwa ia adalah yang benar. "
            },
            {
                "number": 2950,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُغِيرَةَ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ ح وَأَنْبَأَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ شُعَيْبٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ أَبَا هُرَيْرَةَ قَالَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ أَبُو بَكْرٍ بَعْدَهُ وَكَفَرَ مَنْ كَفَرَ مِنْ الْعَرَبِ قَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ فَقَدْ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهَاقَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلَّا أَنْ رَأَيْتُ أَنَّ اللَّهَ عَزَّ وَجَلَّ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ وَاللَّفْظُ لِأَحْمَدَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Muhammad bin Mughirah], ia berkata; telah menceritakan kepada kami [Utsman bin Sa'id] dari [Syu'aib] dari [Az Zuhri], ia berkata; telah menceritakan kepada kami ['ubaidhullah]. -Dan dari jalur periwayatan yang lain- Telah memberitakan kepada kami [Katsir bin 'Ubaid], ia berkata; telah menceritakan kepada kami [Baqiyyah] dari [Syu'aib], ia berkata; telah menceritakan kepadaku [Az Zuhri] dari ['ubaidhullah bin Abdillah bin 'Utbah bin Mas'ud] bahwa [Abu Hurairah] berkata; tatkala Rasulullah shallallahu 'alaihi wasallam wafat dan Abu Bakr menggantikannya dan telah kafir orang yang kafir dari kalangan orang-orang Arab, maka [Umar] radliallahu 'anhu berkata; wahai Abu Bakr, bagaimana engkau memerangi manusia sedangkan Rasulullah shallallahu 'alaihi wasallam telah bersabda: Saya diperintahkan untuk memerangi manusia hingga mereka mengatakan tiada sesembahan yang hak selain Allah, dan barangsiapa mengatakan tiada sesembahan yang hak selain Allah, berarti ia telah menjaga harta dan jiwanya dariku, kecuali dengan alasan hak dan hisabnya disisi Allah. Maka [Abu Bakr] berkata; sungguh saya akan memerangi orang yang memisahkan antara sholat dan zakat, karena zakat adalah hak harta. Demi Allah, seandainya mereka menahanku mengambil satu anak kambing saja yang dahulunya mereka menunaikannya kepada Rasulullah shallallahu 'alaihi wasallam niscaya saya akan memerangi mereka karena menolak untuk memberikannya. Demi Allah, tidak lain kecuali saya melihat Allah 'azza wajalla telah melapangkan hati Abu Bakr untuk memerangi mereka dan saya tahu bahwa ia adalah yang benar. Redaksi ini pada imam Ahmad. "
            },
            {
                "number": 2951,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ قَالَ حَدَّثَنَا عِمْرَانُ أَبُو الْعَوَّامِ الْقَطَّانُ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْتَدَّتْ الْعَرَبُ قَالَ عُمَرُ يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ الْعَرَبَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنَّمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا مِمَّا كَانُوا يُعْطُونَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَيْهِقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَلَمَّا رَأَيْتُ رَأْيَ أَبِي بَكْرٍ قَدْ شُرِحَ عَلِمْتُ أَنَّهُ الْحَقُّ قَالَ أَبُو عَبْد الرَّحْمَنِ عِمْرَانُ الْقَطَّانُ لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ وَهَذَا الْحَدِيثُ خَطَأٌ وَالَّذِي قَبْلَهُ الصَّوَابُ حَدِيثُ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepada kami ['Amr bin 'Ashim], ia berkata; telah menceritakan kepada kami ['Imran Abu Al 'Awwam Al Qaththan], ia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Anas bin Malik], ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam wafat orang-orang Arab murtad. Umar berkata; wahai Abu Bakr, bagaimana engkau memerangi orang-orang Arab? Maka [Abu Bakr] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah dan saya adalah Rasulullah, mendirikan sholat, dan menunaikan Zakat.\" Demi Allah seandainya mereka menahanku mengambil satu anak kambing diantara sesuatu yang dahulunya mereka berikan kepada Rasulullah shallallahu 'alaihi wasallam niscaya saya memerangi mereka karenanya. Umar radliallahu 'anhu berkata; tatkala saya melihat pendapat Abu Bakr telah dilapangkan, saya tahu bahwa ia adalah yang benar. Abu Abdur Rahman berkata; Imran bin Al Qaththan bukanlah orang yang kuat dalam hadis. hadis ini salah, dan yang sebelumnya adalah yang benar yaitu hadis Az Zuhri dari 'ubaidhullah bin Abdillah bin 'Utbah dari Abu Hurairah. "
            },
            {
                "number": 2952,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عُثْمَانُ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ ح و أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَهَا فَقَدْ عَصَمَ مِنِّي نَفْسَهُ وَمَالَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Muhammad bin Al Mughirah], ia berkata; telah menceritakan kepada kami [Utsman] dari [Syu'aib] dari [Az Zuhri]. -dan dari jalur periwayatan yang lain- Telah telah mengabarkan kepadaku ['Amr bin Utsman bin Sa'id bin Katsir], ia berkata; telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri], ia berkata; telah menceritakan kepadaku [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan LAA ILAAHA ILLALLAAH, barang siapa yang mengucapkan LAA ILAAHA ILLALLAAH, maka ia telah melindungi jiwa dan hartanya dariku dan perhitungannya kepada Allah.\""
            },
            {
                "number": 2953,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَا حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَاهِدُوا الْمُشْرِكِينَ بِأَمْوَالِكُمْ وَأَيْدِيكُمْ وَأَلْسِنَتِكُمْ",
                "id": "Telah mengabarkan kepada kami [Harun bin Abdillah] serta [Muhammad bin Isma'il bin Ibrahim] mereka berdua berkata; telah menceritakan kepada kami [Yazid], ia berkata; telah memberitakan kepada kami [Hammad bin Salamah] dari [Humaid] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Perangilah orang-orang musyrik dengan harta, tangan dan lisan kalian.\""
            },
            {
                "number": 2954,
                "arab": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنَا سَلَمَةُ بْنُ سُلَيْمَانَ قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ قَالَ أَنْبَأَنَا وُهَيْبٌ يَعْنِي ابْنَ الْوَرْدِ قَالَ أَخْبَرَنِي عُمَرُ بْنُ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ وَلَمْ يَغْزُ وَلَمْ يُحَدِّثْ نَفْسَهُ بِغَزْوٍ مَاتَ عَلَى شُعْبَةِ نِفَاقٍ",
                "id": "Telah mengabarkan kepada kami ['Abdah bin Abdur Rahim], ia berkata; telah menceritakan kepada kami [Salamah bin Sulaiman], ia berkata; telah memberitakan kepada kami [Ibnu Al Mubarak], ia berkata; telah memberitakan kepada kami [Wuhaib yaitu Ibnu Al Ward], ia berkata; telah mengabarkan kepadaku [Umar bin Muhammad bin Al Munkadir] dari [Sumai] dari [Abu Shaleh] dari [Abu Hurairah] dari nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang meninggal dan ia belum berperang, dan tidak berniat untuk perang, ia mati pada salah satu cabang kemunafikan.\""
            },
            {
                "number": 2955,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى بْنِ الْوَزِيرِ بْنِ سُلَيْمَانَ عَنْ ابْنِ عُفَيْرٍ عَنْ اللَّيْثِ عَنْ ابْنِ مُسَافِرٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَسَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَالَّذِي نَفْسِي بِيَدِهِ لَوْلَا أَنَّ رِجَالًا مِنْ الْمُؤْمِنِينَ لَا تَطِيبُ أَنْفُسُهُمْ أَنْ يَتَخَلَّفُوا عَنِّي وَلَا أَجِدُ مَا أَحْمِلُهُمْ عَلَيْهِ مَا تَخَلَّفْتُ عَنْ سَرِيَّةٍ تَغْزُو فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ وَالَّذِي نَفْسِي بِيَدِهِ لَوَدِدْتُ أَنِّي أُقْتَلُ فِي سَبِيلِ اللَّهِ ثُمَّ أُحْيَا ثُمَّ أُقْتَلُ ثُمَّ أُحْيَا ثُمَّ أُقْتَلُ ثُمَّ أُحْيَا ثُمَّ أُقْتَلُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Yahya bin Al Wazir bin Sulaiman] dari [Ibnu 'Ufair] dari [Al Laits] dari [Ibnu Musafir] dari [Ibnu Syihab] dari [Abu Salamah bin Abdur Rahman] serta [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku ada di tangan-Nya, kalaulah tidak karena mempertimbangkan orang-orang beriman yang jiwanya sangat keberatan tertinggal dariku, sedang aku sendiri tidak mendapatkan kendaraan untuk membawa mereka, saya tidak akan tertinggal dari mengikuti pasukan perang di jalan Allah 'azza wajalla. Dan demi Dzat yang jiwaku ada di tangan-Nya, sungguh saya berharap terbunuh di jalan Allah, kemudian dihidupkan, kemudian terbunuh kemudian dihidupkan, kemudian terbunuh kemudian dihidupkan, kemudian terbunuh.\" "
            },
            {
                "number": 2956,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ رَأَيْتُ مَرْوَانَ بْنَ الْحَكَمِ جَالِسًا فَجِئْتُ حَتَّى جَلَسْتُ إِلَيْهِ فَحَدَّثَنَا أَنَّ زَيْدَ بْنَ ثَابِتٍ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُنْزِلَ عَلَيْهِ{ لَا يَسْتَوِي الْقَاعِدُونَ مِنْ الْمُؤْمِنِينَ }{ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ }فَجَاءَ ابْنُ أُمِّ مَكْتُومٍ وَهُوَ يُمِلُّهَا عَلَيَّ فَقَالَ يَا رَسُولَ اللَّهِ لَوْ أَسْتَطِيعُ الْجِهَادَ لَجَاهَدْتُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ وَفَخِذُهُ عَلَى فَخِذِي فَثَقُلَتْ عَلَيَّ حَتَّى ظَنَنْتُ أَنْ سَتُرَضُّ فَخِذِي ثُمَّ سُرِّيَ عَنْهُ{ غَيْرُ أُولِي الضَّرَرِ }قَالَ أَبُو عَبْد الرَّحْمَنِ عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ هَذَا لَيْسَ بِهِ بَأْسٌ وَعَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ يَرْوِي عَنْهُ عَلِيُّ بْنُ مُسْهِرٍ وَأَبُو مُعَاوِيَةَ وَعَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ النُّعْمَانِ بْنِ سَعْدٍ لَيْسَ بِثِقَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Bazi'], ia berkata; telah menceritakan kepada kami [Bisyr yaitu Ibnu Al Mufadhdhal], ia berkata; telah memberitakan kepada kami [Abdur Rahman bin Ishaq] dari [Az Zuhri] dari [Sahl bin Sa'd], ia berkata; saya melihat [Marwan bin Al Hakam] duduk, lalu saya datang dan duduk di sampingnya. Kemudian ia menceritakan kepada kami bahwa [Zaid bin Tsabit] menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam telah diturunkan kepadanya ayat LAA YASTAWIL QAA'IDUUNA MINAL MUKMINIINA WAL MUJAAHIDUUNA FII SABIILILLAAH 'Tidaklah sama antara orang mukmin yang tidak ikut berperang dan mereka yang berjihad fii sabilillah'. Lalu Ibnu Ummi Maktum datang dan beliau sedang mendiktekan ayat tersebut kepadaku, lalu ia berkata; wahai Rasulullah shallallahu 'alaihi wasallam seandainya saya mampu untuk berjihad, niscaya saya berjihad. Kemudian Allah 'azza wajalla menurunkan wahyu dan paha beliau berada di atas pahaku, sehingga terasa berat bagiku hingga saya menyangka kalau pahaku akan pecah, kemudian terhilangkan kesusahannya, yaitu ayat GHAIRU ULIDHDHARAR 'Kecuali orang-orang yang mempunyai halangan', Abu Abdur Rahman berkata; Abdur Rahman bin Ishaq ini tidak mendapat celaan. Dan Abdur Rahman bin Ishaq telah meriwayatkan darinya Ali bin Mushir, Abu Mu'awiyah, Abdul Wahid bin Ziyad dan An Nu'man bin Sa'd bukan orang yang tsiqah. "
            },
            {
                "number": 2957,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ قَالَ حَدَّثَنِي أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي سَهْلُ بْنُ سَعْدٍ قَالَ رَأَيْتُ مَرْوَانَ جَالِسًا فِي الْمَسْجِدِ فَأَقْبَلْتُ حَتَّى جَلَسْتُ إِلَى جَنْبِهِ فَأَخْبَرَنَا أَنَّ زَيْدَ بْنَ ثَابِتٍ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْلَى عَلَيْهِ{ لَا يَسْتَوِي الْقَاعِدُونَ مِنْ الْمُؤْمِنِينَ }{ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ }قَالَ فَجَاءَهُ ابْنُ أُمِّ مَكْتُومٍ وَهُوَ يُمِلُّهَا عَلَيَّ فَقَالَ يَا رَسُولَ اللَّهِ لَوْ أَسْتَطِيعُ الْجِهَادَ لَجَاهَدْتُ وَكَانَ رَجُلًا أَعْمَى فَأَنْزَلَ اللَّهُ عَلَى رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفَخِذُهُ عَلَى فَخِذِي حَتَّى هَمَّتْ تَرُضُّ فَخِذِي ثُمَّ سُرِّيَ عَنْهُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ غَيْرُ أُولِي الضَّرَرِ }",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Abdullah], ia berkata; telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd], ia berkata; telah menceritakan kepadaku [ayahku] dari [Shaleh] dari [Ibnu Syihab], ia berkata; telah menceritakan kepadaku [Sahl bin Sa'd], ia berkata; saya melihat [Marwan] duduk di masjid, kemudian saya datang hingga duduk di sampingnya. Lalu ia mengabarkan kepada kami bahwa [Zaid bin Tsabit] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam mendektekan kepadanya ayat LAA YASTAWIL QAA'IDUUNA MINAL MUKMINIINA WAL MUJAAHIDUUNA FII SABIILILLAAH' 'Tidaklah sama antara orang mukmin yang tidak ikut berperang dan mereka yang berjihad fii sabilillah'. Kemudian datang kepadanya Ibnu Ummi Maktum dan beliau mendektekannya kepadaku. Lalu ia berkata; wahai Rasulullah shallallahu 'alaihi wasallam seandainya saya mampu untuk berjihad, niscaya saya akan berjihad. Dan ia adalah orang yang buta, kemudian Allah menurunkan kepada Rasul-Nya shallallahu 'alaihi wasallam dan pahanya berada di atas pahaku hingga hampir pahaku pecah, kemudian terhilangkan kesusahannya, dan Allah 'azza wajalla menurunkan ayat GHAIRU ULIDHDHARAR' 'Kecuali orang-orang yang mempunyai halangan'."
            },
            {
                "number": 2958,
                "arab": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُعْتَمِرٌ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا قَالَ ائْتُونِي بِالْكَتِفِ وَاللَّوْحِ فَكَتَبَ{ لَا يَسْتَوِي الْقَاعِدُونَ مِنْ الْمُؤْمِنِينَ }وَعَمْرُو بْنُ أُمِّ مَكْتُومٍ خَلْفَهُ فَقَالَ هَلْ لِي رُخْصَةٌ فَنَزَلَتْ{ غَيْرُ أُولِي الضَّرَرِ }",
                "id": "Telah mengabarkan kepada kami [Nashr bin Ali], ia berkata; telah menceritakan kepada kami [Mu'tamir] dari [ayahnya] dari [Abu Ishaq] dari [Al Barra`] bahwa Nabi shallallahu 'alaihi wasallam ….kemudian ia menyebutkan sebuah kalimat yang maknanya adalah beliau bersabda; datanglah kepadaku membawa tulang pundak serta sebuah papan, kemudian beliau menulis LAA YASTAWIL QAA'IDUUNA MINAL MUKMINIIN, dan 'Amr bin Ummi Maktum dibelakang beliau, kemudian ia berkata; apakah saya mendapatkan keringanan? Lalu turunlah ayat GHAIRU ULIDHDHARAR."
            },
            {
                "number": 2959,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَلَمَّا نَزَلَتْ{ لَا يَسْتَوِي الْقَاعِدُونَ مِنْ الْمُؤْمِنِينَ }جَاءَ ابْنُ أُمِّ مَكْتُومٍ وَكَانَ أَعْمَى فَقَالَ يَا رَسُولَ اللَّهِ فَكَيْفَ فِيَّ وَأَنَا أَعْمَى قَالَ فَمَا بَرِحَ حَتَّى نَزَلَتْ{ غَيْرُ أُولِي الضَّرَرِ }",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ubaid], ia berkata; telah menceritakan kepada kami [Abu Bakr bin 'Iyyasy] dari [Abu Ishaq] dari [Al Barra`], ia berkata; tatkala turun ayat LAA YASTAWIL QAA'IDUUNA MINAL MUKMINIIN, datanglah Ibnu Ummi Maktum dan ia adalah orang yang buta, kemudian berkata; wahai Rasulullah bagaimana mengenai diriku sedang saya adalah orang yang buta? Al Barra` berkata; tidak lama kemudian turunlah ayat GHAIRU ULIDHDHARAR."
            },
            {
                "number": 2960,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُفْيَانَ وَشُعْبَةَ قَالَا حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ أَبِي الْعَبَّاسِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُهُ فِي الْجِهَادِ فَقَالَ أَحَيٌّ وَالِدَاكَ قَالَ نَعَمْ قَالَ فَفِيهِمَا فَجَاهِدْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Yahya bin Sa'id] dari [Sufyan] serta [Syu'bah] mereka berdua berkata; telah menceritakan kepada kami [Habib bin Abi Tsabit] dari [Abu Al Abbas] dari [Abdullah bin 'Amr], ia berkata; telah datang seorang laki-laki kepada Rasulullah shallallahu 'alaihi wasallam meminta izin kepadanya untuk berjihad, lalu beliau bertanya: \"Apakah kedua orang tuamu masih hidup?\" Ia berkata; ya. Beliau bersabda: \"Berjihadlah pada keduanya.\""
            },
            {
                "number": 2961,
                "arab": "أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْحَكَمِ الْوَرَّاقُ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ طَلْحَةَ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ طَلْحَةَ عَنْ مُعَاوِيَةَ بْنِ جَاهِمَةَ السَّلَمِيِّأَنَّ جَاهِمَةَ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَرَدْتُ أَنْ أَغْزُوَ وَقَدْ جِئْتُ أَسْتَشِيرُكَ فَقَالَ هَلْ لَكَ مِنْ أُمٍّ قَالَ نَعَمْ قَالَ فَالْزَمْهَا فَإِنَّ الْجَنَّةَ تَحْتَ رِجْلَيْهَا",
                "id": "Telah mengabarkan kepada kami ['Abdul Wahhab bin Abdul Hakam Al Warraq], ia berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij], ia berkata; telah memberitakan kepadaku [Muhammad bin Thalhah yaitu Ibnu Abdullah bin Abdur Rahman] dari ayahnya yaitu [Thalhah] dari [Muawiyah bin Jahimah As Salami] bahwa Jahimah datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, saya ingin berperang dan datang untuk minta petunjukmu, beliau bertanya: \"Apakah engkau masih memiliki ibu?\" ia menjawab; ya, beliau bersabda: \"Jagalah ia, karena surga itu dibawah kakinya.\""
            },
            {
                "number": 2962,
                "arab": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَجُلًا أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَيُّ النَّاسِ أَفْضَلُ قَالَ مَنْ جَاهَدَ بِنَفْسِهِ وَمَالِهِ فِي سَبِيلِ اللَّهِ قَالَ ثُمَّ مَنْ يَا رَسُولَ اللَّهِ قَالَ ثُمَّ مُؤْمِنٌ فِي شِعْبٍ مِنْ الشِّعَابِ يَتَّقِي اللَّهَ وَيَدَعُ النَّاسَ مِنْ شَرِّهِ",
                "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid], ia berkata; telah menceritakan kepada kami [Baqiyyah] dari [Az Zubaidi] dari [Az Zuhri] dari ['Atho` bin Yazid] dari [Abu Sa'id Al Khudri] bahwa seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah siapakah orang yang paling utama? Beliau menjawab: \"Orang yang berjihad dengan jiwa dan hartanya di jalan Allah.\" Orang tersebut berkata; kemudian siapa wahai Rasulullah? Beliau menjawab: \"Kemudian orang mukmin yang berada di puncak-puncak bukit, ia takut kepada Allah dan meninggalkan manusia karena keburukannya.\""
            },
            {
                "number": 2963,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ أَبِي الْخَطَّابِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ تَبُوكَ يَخْطُبُ النَّاسَ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى رَاحِلَتِهِ فَقَالَ أَلَا أُخْبِرُكُمْ بِخَيْرِ النَّاسِ وَشَرِّ النَّاسِ إِنَّ مِنْ خَيْرِ النَّاسِ رَجُلًا عَمِلَ فِي سَبِيلِ اللَّهِ عَلَى ظَهْرِ فَرَسِهِ أَوْ عَلَى ظَهْرِ بَعِيرِهِ أَوْ عَلَى قَدَمِهِ حَتَّى يَأْتِيَهُ الْمَوْتُ وَإِنَّ مِنْ شَرِّ النَّاسِ رَجُلًا فَاجِرًا يَقْرَأُ كِتَابَ اللَّهِ لَا يَرْعَوِي إِلَى شَيْءٍ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abi Habib] dari [Abu Al Khair] dari [Abul Khaththab] dari [Abu Sa'id Al Khudri], ia berkata; Rasulullah shallallahu 'alaihi wasallam pada saat perang Tabuk berkhutbah kepada manusia, dan beliau menyandarkan punggungnya ke kendaraannya seraya bersabda: \"Maukah saya kabarkan kepada kalian mengenai orang terbaik dan orang terburuk? Diantara orang terbaik adalah seorang laki-laki yang beramal di jalan Allah di atas kudanya atau untanya, atau berjalan kaki hingga datang kepadanya kematian. Dan diantara orang terburuk adalah pelaku dosa yang membaca Kitab Allah, namun ia tidak mau menghentikan keburukannya, atau menyesali atas kekhilafannya lalu meninggalkannya.\" "
            },
            {
                "number": 2964,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ قَالَ حَدَّثَنَا مِسْعَرٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَ قَالَلَا يَبْكِي أَحَدٌ مِنْ خَشْيَةِ اللَّهِ فَتَطْعَمَهُ النَّارُ حَتَّى يُرَدَّ اللَّبَنُ فِي الضَّرْعِ وَلَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي مَنْخَرَيْ مُسْلِمٍ أَبَدًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman], ia berkata; telah menceritakan kepada kami [Ja'far bin 'Aun], ia berkata; telah menceritakan kepada kami [Mis'ar] dari [Muhammad bin Abdur Rahman] dari [Isa bin Thalhah] dari [Abu Hurairah], ia berkata; Tidaklah seseorang menangis karena takut siksa Allah lalu dilahap api neraka hingga air susu kembali ke putingnya, dan tidaklah debu-debu dijalan Allah berkumpul dengan asap Jahannam pada kedua lubang tenggorokan seorang muslim selamanya."
            },
            {
                "number": 2965,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ ابْنِ الْمُبَارَكِ عَنْ الْمَسْعُودِيِّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَلِجُ النَّارَ رَجُلٌ بَكَى مِنْ خَشْيَةِ اللَّهِ تَعَالَى حَتَّى يَعُودَ اللَّبَنُ فِي الضَّرْعِ وَلَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ نَارِ جَهَنَّمَ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Ibnu Al Mubarak] dari [Al Mas'udi] dari [Muhammad bin Abdur Rahman] dari [Isa bin Thalhah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak bakalan masuk neraka seorang laki-laki yang menangis karena takut kepada Allah ta'ala hingga air susu kembali ke putting, dan tidak berkumpul debu di jalan Allah dan asap api Jahannam. "
            },
            {
                "number": 2966,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجْتَمِعَانِ فِي النَّارِ مُسْلِمٌ قَتَلَ كَافِرًا ثُمَّ سَدَّدَ وَقَارَبَ وَلَا يَجْتَمِعَانِ فِي جَوْفِ مُؤْمِنٍ غُبَارٌ فِي سَبِيلِ اللَّهِ وَفَيْحُ جَهَنَّمَ وَلَا يَجْتَمِعَانِ فِي قَلْبِ عَبْدٍ الْإِيمَانُ وَالْحَسَدُ",
                "id": "Telah mengabarkan kepada kami [Isa bin Hammad], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Suhail bin Abu Shaleh] dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan berkumpul di neraka, seorang muslim yang membunuh orang kafir kemudian bersikap istiqamah dan berlaku sederhana, dan tidak akan berkumpul dalam diri orang yang beriman, debu di jalan Allah dan panasnya Jahannam, dan tidak akan berkumpul di hati seorang hamba, keimanan dan rasa dengki. "
            },
            {
                "number": 2967,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ الْقَعْقَاعِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي جَوْفِ عَبْدٍ أَبَدًا وَلَا يَجْتَمِعُ الشُّحُّ وَالْإِيمَانُ فِي قَلْبِ عَبْدٍ أَبَدًا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Jarir] dari [Suhail] dari [Shafwan bin Abi Yazid] dari [Al Qa'qa' bin Al Lajlaj] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan berkumpul debu di jalan Allah dan asap Jahannam pada diri seorang hamba sama sekali, dan tidak akan berkumpul sikap kikir dan keimanan dalam hati seorang hamba selamanya.\" "
            },
            {
                "number": 2968,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ خَالِدِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي وَجْهِ رَجُلٍ أَبَدًا وَلَا يَجْتَمِعُ الشُّحُّ وَالْإِيمَانُ فِي قَلْبِ عَبْدٍ أَبَدًا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Abdur Rahman bin Mahdi], ia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Suhail bin Abi Shaleh] dari [Shafwan bin Salim] dari [Khalid bin Al Lajlaj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak bakalan berkumpul debu di jalan Allah dan asap Jahannam pada wajah seorang laki-laki selamanya, dan tidak akan berkumpul sikap kikir dan keimanan pada hati seorang hamba selamanya.\" "
            },
            {
                "number": 2969,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا مَنْصُورُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ الْهَادِ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ الْقَعْقَاعِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي جَوْفِ عَبْدٍ وَلَا يَجْتَمِعُ الشُّحُّ وَالْإِيمَانُ فِي جَوْفِ عَبْدٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Amir], ia berkata; telah menceritakan kepada kami [Manshur bin Salamah], ia berkata; telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Ibnu Al Had] dari [Suhail bin Abi Shaleh] dari [Shafwan bin Abi Yazid] dari [Al Qa'qa' bin Al Lajlaj] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak bakalan berkumpul debu di jalan Allah dan asap Jahannam pada diri seorang hamba, dan tidak akan berkumpul sikap kikir dan keimanan pada diri seorang hamba.\""
            },
            {
                "number": 2970,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَرْعَرَةُ بْنُ الْبِرِنْدِ وَابْنُ أَبِي عَدِيٍّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ حُصَيْنِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ وَدُخَانُ جَهَنَّمَ فِي مَنْخَرَيْ مُسْلِمٍ أَبَدًا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami ['Ar'arah bin Al Barid] dan [Ibnu Abi 'Adi] mereka berdua mengatakan; telah menceritakan kepada kami [Muhammad bin 'Amr] dari [Shafwan bin Abi Yazid] dari [Hushain bin Al Lajlaj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak bakalan berkumpul debu di jalan Allah 'azza wajalla dan asap Jahannam pada kedua lubang hidung seorang muslim selamanya.\""
            },
            {
                "number": 2971,
                "arab": "أَخْبَرَنِي شُعَيْبُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ حُصَيْنِ بْنِ اللَّجْلَاجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ فِي مَنْخَرَيْ مُسْلِمٍ وَلَا يَجْتَمِعُ شُحٌّ وَإِيمَانٌ فِي قَلْبِ رَجُلٍ مُسْلِمٍ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf], ia berkata; telah menceritakan kepada kami [Yazid bin Harun] dari [Muhammad bin 'Amr] dari [Shafwan bin Abi Yazid] dari [Hushain bin Al Lajlaj] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan berkumpul debu di jalan Allah dan asap Jahannam pada kedua lubang hidung seorang muslim, dan tidak akan berkumpul sikap kikir dan keimanan dalam hati seorang muslim.\""
            },
            {
                "number": 2972,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ عَنْ أَبِي الْعَلَاءِ بْنِ اللَّجْلَاجِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُلَا يَجْمَعُ اللَّهُ عَزَّ وَجَلَّ غُبَارًا فِي سَبِيلِ اللَّهِ وَدُخَانَ جَهَنَّمَ فِي جَوْفِ امْرِئٍ مُسْلِمٍ وَلَا يَجْمَعُ اللَّهُ فِي قَلْبِ امْرِئٍ مُسْلِمٍ الْإِيمَانَ بِاللَّهِ وَالشُّحَّ جَمِيعًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Abdul Hakam] dari [Syu'aib] dari [Al Laits] dari ['ubaidhullah bin Abi Ja'far] dari [Shafwan bin Abi Yazid] dari [Abu Al 'Ala` bin Al Lajlaj] bahwa ia pernah mendengar [Abu Hurairah] berkata; Allah 'azza wajalla tidak akan mengumpulkan debu di jalan Allah, dan asap Jahannam pada diri seorang muslim, dan Allah tidak akan mengumpulkan dalam hati seorang muslim keimanan kepada Allah dan sikap kikir secara bersamaan. "
            },
            {
                "number": 2973,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي مَرْيَمَ قَالَ لَحِقَنِي عَبَايَةُ بْنُ رَافِعٍ وَأَنَا مَاشٍ إِلَى الْجُمُعَةِ فَقَالَ أَبْشِرْ فَإِنَّ خُطَاكَ هَذِهِ فِي سَبِيلِ اللَّهِ سَمِعْتُ أَبَا عَبْسٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اغْبَرَّتْ قَدَمَاهُ فِي سَبِيلِ اللَّهِ فَهُوَ حَرَامٌ عَلَى النَّارِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits], ia berkata; telah menceritakan kepada kami [Al Walid bin Muslim], ia berkata; telah menceritakan kepada kami [Yazid bin Abi Maryam], ia berkata; telah bertemu denganku ['Abayah bin Rafi'] dan saya sedang berjalan menuju sholat Jum'at, lalu ia berkata; bergembiralah, karena sesungguhnya langkahmu ini adalah di jalan Allah. Saya mendengar [Abu 'Abas] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang kedua telapak kakinya berdebu di jalan Allah, maka ia haram bagi Neraka.\""
            },
            {
                "number": 2974,
                "arab": "أَخْبَرَنَا عِصْمَةُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُرَيْحٍ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ شُمَيْرٍ الرُّعَيْنِيَّ يَقُولُ سَمِعْتُ أَبَا عَلِيٍّ التُّجِيبِيَّ أَنَّهُ سَمِعَ أَبَا رَيْحَانَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حُرِّمَتْ عَيْنٌ عَلَى النَّارِ سَهِرَتْ فِي سَبِيلِ اللَّهِ",
                "id": "Telah mengabarkan kepada kami ['Ishmah bin Al Fadhl], ia berkata; telah menceritakan kepada kami [Zaid bin Hubab] dari [Abdur Rahman bin Syuraih], ia berkata; saya pernah mendengar [Muhammad bin Syumair Ar Ru'aini] berkata; saya pernah mendengar [Abu Ali At Tujibi] bahwa ia mendengar [Abu Raihanah] berkata; saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mata yang begadang di jalan Allah diharamkan bagi neraka.\""
            },
            {
                "number": 2975,
                "arab": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ سُفْيَانَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْغَدْوَةُ وَالرَّوْحَةُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ أَفْضَلُ مِنْ الدُّنْيَا وَمَا فِيهَا",
                "id": "Telah mengabarkan kepada kami ['Abdah bin Abdullah], ia berkata; telah menceritakan kepada kami [Husain bin Ali] dari [Zaidah] dai [Sufyan] dari [Abu Hazim] dari [Sahl bin Sa'd], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pergi pada pagi dan petang hari di jalan Allah 'azza wajalla lebih baik daripada dunia dan seisinya.\""
            },
            {
                "number": 2976,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ قَالَ حَدَّثَنِي شُرَحْبِيلُ بْنُ شَرِيكٍ الْمَعَافِرِيُّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الْأَنْصَارِيَّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ وَغَرَبَتْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid], ia berkata; telah menceritakan kepada kami [bapakku] ia berkata; telah menceritakan kepada kami [Sa'id bin Abi Ayyub], ia berkata; telah menceritakan kepadaku [Syarahbil bin Syarik Al Ma'afiri] dari [Abu Abdir Rahman Al Hubuli] bahwa ia telah mendengar [Abu Ayyub Al Anshari] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pergi pada pagi atau petang hari di jalan Allah adalah lebih baik daripada segala hal yang terkena sinar matahari terbit dan tenggelam\""
            },
            {
                "number": 2977,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِيهِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ كُلُّهُمْ حَقٌّ عَلَى اللَّهِ عَزَّ وَجَلَّ عَوْنُهُ الْمُجَاهِدُ فِي سَبِيلِ اللَّهِ وَالنَّاكِحُ الَّذِي يُرِيدُ الْعَفَافَ وَالْمُكَاتَبُ الَّذِي يُرِيدُ الْأَدَاءَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid] dari [ayahnya], ia berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Muhammad bin 'Ajlan] dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tiga golongan yang semuanya merupakan hal atas Allah 'azza wajalla untuk membantunya, yaitu orang yang berjihad di jalan Allah, orang yang menikah menginginkan kesucian diri, dan sahaya yang mengadakan perjanjian pembebasan dirinya yang ingin menunaikan kewajibannya.\""
            },
            {
                "number": 2978,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ مَخْرَمَةَ عَنْ أَبِيهِ قَالَ سَمِعْتُ سُهَيْلَ بْنَ أَبِي صَالِحٍ قَالَ سَمِعْتُ أَبِي يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفْدُ اللَّهِ عَزَّ وَجَلَّ ثَلَاثَةٌ الْغَازِي وَالْحَاجُّ وَالْمُعْتَمِرُ",
                "id": "Telah mengabarkan kepada kami [Isa bin Ibrahim], ia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari [Makhramah] dari [ayahnya], ia berkata; saya pernah mendengar [Suhail bin Abu Shaleh] berkata; saya pernah mendengar [bapakku] ia berkata; saya pernah mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Utusan Allah ada tiga, yaitu; orang yang berperang, orang yang melakukan haji, dan orang yang melakukan umrah.\""
            },
            {
                "number": 2979,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَكَفَّلَ اللَّهُ عَزَّ وَجَلَّ لِمَنْ جَاهَدَ فِي سَبِيلِهِ لَا يُخْرِجُهُ إِلَّا الْجِهَادُ فِي سَبِيلِهِ وَتَصْدِيقُ كَلِمَتِهِ بِأَنْ يُدْخِلَهُ الْجَنَّةَ أَوْ يَرُدَّهُ إِلَى مَسْكَنِهِ الَّذِي خَرَجَ مِنْهُ مَعَ مَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] serta [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla menjamin orang yang berjuang di jalan-Nya, yang faktor keberangkatannya semata-mata berjuang di jalan-Nya serta membenarkan kalimat-Nya, untuk memasukkannya ke dalam Surga atau mengembalikannya ke tempat tinggalnya bersama pahala yang ia peroleh atau rampasan perang.\""
            },
            {
                "number": 2980,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدٍ عَنْ عَطَاءِ بْنِ مِينَاءَ مَوْلَى ابْنِ أَبِي ذُبَابٍ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ انْتَدَبَ اللَّهُ عَزَّ وَجَلَّ لِمَنْ يَخْرُجُ فِي سَبِيلِهِ لَا يُخْرِجُهُ إِلَّا الْإِيمَانُ بِي وَالْجِهَادُ فِي سَبِيلِي أَنَّهُ ضَامِنٌ حَتَّى أُدْخِلَهُ الْجَنَّةَ بِأَيِّهِمَا كَانَ إِمَّا بِقَتْلٍ أَوْ وَفَاةٍ أَوْ أَرُدَّهُ إِلَى مَسْكَنِهِ الَّذِي خَرَجَ مِنْهُ نَالَ مَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Sa'id] dari ['Atho` bin Mina`] sahaya Ibnu Abi Dzubab, ia telah mendengar [Abu Hurairah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla menjamin bagi orang yang berangkat di jalan-Nya, tidak ada yang memberangkatnya kecuali keimanan kepada-Ku, serta berjihad di jalan-Ku bahwa ia mendapatkan jaminan hingga Aku memasukkannya ke Surga karena salah satu dari dua tersebut. Baik ia terbunuh atau meninggal, atau Aku kembalikan dia ke tempat tinggalnya yang ia tinggalkan, dan mendapatkan pahala atau rampasan perang.\" "
            }
        ]
    }
}