{
    "status": true,
    "data": {
        "start": 597,
        "end": 745,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 597,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ وَاسْمُهُ غَزْوَانُ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بِالْمَدِينَةِ يَجْمَعُ بَيْنَ الصَّلَاتَيْنِ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ مِنْ غَيْرِ خَوْفٍ وَلَا مَطَرٍقِيلَ لَهُ لِمَ قَالَ لِئَلَّا يَكُونَ عَلَى أُمَّتِهِ حَرَجٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul 'Aziz bin Abu Rizmah Ghazwan] dia berkata; Telah menceritakan kepada kami [Al Fadhl bin Musa] dari [Al A'masy] dari [Habib bin Abu Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa Rasulullah Shallallahu'alaihi wasallam pernah sholat di Madinah dengan menjama' Zhuhur dan Ashar, serta Maghrib dan Isya' bukan karena rasa takut (peperangan) dan bukan karena hujan.Ibnu Abbas ditanya, \"Kenapa demikian?\" maka dia menjawab, \"Agar tidak memberatkan umatnya.\""
            },
            {
                "number": 598,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الشَّعْثَاءِ عَنْ ابْنِ عَبَّاسٍ قَالَصَلَّيْتُ وَرَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيًا جَمِيعًا وَسَبْعًا جَمِيعًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dia berkata; Telah menceritakan kepada kami [Khalid] dia berkata; Telah menceritakan kepada kami [Ibnu Juraij] dari [Amr bin Dinar] dari [Abu Asy-Sya'tsa] dari [Ibnu Abbas] dia berkata; \"Aku sholat di belakang Rasulullah Shallallahu'alaihi wasallam delapan rakaat secara jama' dan tujuh rakaat secara jama'.\""
            },
            {
                "number": 599,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ هَارُونَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِقَالَ سَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَى عَرَفَةَ فَوَجَدَ الْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ فَنَزَلَ بِهَا حَتَّى إِذَا زَاغَتْ الشَّمْسُ أَمَرَ بِالْقَصْوَاءِ فَرُحِلَتْ لَهُ حَتَّى إِذَا انْتَهَى إِلَى بَطْنِ الْوَادِي خَطَبَ النَّاسَ ثُمَّ أَذَّنَ بِلَالٌ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Harun] dia berkata; Telah menceritakan kepada kami [Hatim bin Ismail] dia berkata; Telah menceritakan kepada kami [Ja'far bin Muhammad] dari [Bapaknya] bahwa [Jabir bin Abdullah] berkata; \"Rasulullah Shallallahu'alaihi wasallam berjalan hingga ke Arafah, lalu beliau mendapati kemah telah didirikan untuk dirinya di daerah Namirah, maka beliau singgah sampai matahari terbenam. Beliau mempersiapkan untanya untuk segera berangkat. Sesampainya di Bathn Al Wadi beliau berkhutbah dihadapan manusia, lalu Bilal mengumandangkan adzan, dan sholat Zhuhur. Kemudian iqamat lagi dan mengerjakan sholat Ashar. Beliau tidak mengerjakan sholat apapun diantara keduanya.\""
            },
            {
                "number": 600,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ أَنَّ أَبَا أَيُّوبَ الْأَنْصَارِيَّ أَخْبَرَهُأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ جَمِيعًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Yahya bin Sa'id] dari ['Adi bin Tsabit] dari ['Abdullah bin Yazid] bahwasanya [Abu Ayyub Al-Anshari] mengabarkan kepadanya bahwasanya dia pernah sholat bersama Rasulullah Shallallahu'alaihi wasallam dalam haji Wada', yakni sholat jama' antara Maghrib dan Isya' di Muzdalifah."
            },
            {
                "number": 601,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَكُنْتُ مَعَ ابْنِ عُمَرَ حَيْثُ أَفَاضَ مِنْ عَرَفَاتٍ فَلَمَّا أَتَى جَمْعًا جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ فَلَمَّا فَرَغَ قَالَ فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْمَكَانِ مِثْلَ هَذَا",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Husyaim] dari [Isma'il bin Abu Khalid] dia berkata; telah menceritakan kepada kami [Abu Ishaq] dari [Sa'id bin Jubair] dia berkata, \"Aku bersama [Ibnu Umar] bertolak dari Arafah, dan setelah sampai di Jama' (Muzdalifah) beliau menjamak antara sholat Maghrib dan Isya'. Setelah selesai dia berkata; 'Rasulullah Shallallahu'alaihi wasallam pernah melakukan hal seperti ini di tempat ini'.\""
            },
            {
                "number": 602,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مَالِكٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dari [Malik] dari [Az-Zuhri] dari [Salim] dari [Ibnu 'Umar] bahwa Nabi Shallallahu'alaihi wasallam sholat Maghrib dan Isya di Muzdalifah."
            },
            {
                "number": 603,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَمَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ صَلَاتَيْنِ إِلَّا بِجَمْعٍ وَصَلَّى الصُّبْحَ يَوْمَئِذٍ قَبْلَ وَقْتِهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Al-A'masy] dari ['Umarah] dari ['Abdurrahman bin Yazid] dari ['Abdullah] dia berkata; \"Aku tidak melihat Rasulullah Shallallahu'alaihi wasallam menjamak antara dua sholat kecuali di Jama' (Muzdalifah) beliau sholat Subuh sebelum waktunya.\""
            },
            {
                "number": 604,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ وَمُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍوَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْدَفَهُ مِنْ عَرَفَةَ فَلَمَّا أَتَى الشِّعْبَ نَزَلَ فَبَالَ وَلَمْ يَقُلْ أَهْرَاقَ الْمَاءَ قَالَ فَصَبَبْتُ عَلَيْهِ مِنْ إِدَاوَةٍ فَتَوَضَّأَ وُضُوءًا خَفِيفًا فَقُلْتُ لَهُ الصَّلَاةَ فَقَالَ الصَّلَاةُ أَمَامَكَ فَلَمَّا أَتَى الْمُزْدَلِفَةَ صَلَّى الْمَغْرِبَ ثُمَّ نَزَعُوا رِحَالَهُمْ ثُمَّ صَلَّى الْعِشَاءَ",
                "id": "Telah mengabarkan kepada kami [Al-Husain bin Huraits] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin 'Uqbah] dan [Muhammad bin Abu Harmalah] dari [Kuraib] dari [Ibnu 'Abbas] dari [Usamah bin Zaid] bahwa Nabi Shallallahu'alaihi wasallam pernah memboncengnya dari Arafah, dan setelah sampai di Syi'b (jalan setapak) beliau turun dan buang air kecil. Beliau tidak berkata, \"Tuangkan air.\" Ia berkata, \"Aku menuangkan air kepadanya dari ember, lalu beliau berwudhu dengan ringan. Lantas aku berkata kepada beliau, 'Waktu sholat telah tiba! ' Beliau Shallallahu'alaihi wasallam lalu berkata, 'sholat (nanti) di depanmu'. Maka setelah sampai Muzdalifah beliau sholat Maghrib, kemudian mereka menurunkan barang bekalannya lalu beliau sholat Isya.\""
            },
            {
                "number": 605,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي الْوَلِيدُ بْنُ الْعَيْزَارِ قَالَ سَمِعْتُ أَبَا عَمْرٍو الشَّيْبَانِيَّ يَقُولُ حَدَّثَنَا صَاحِبُ هَذِهِ الدَّارِ وَأَشَارَ إِلَى دَارِ عَبْدِ اللَّهِ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْعَمَلِ أَحَبُّ إِلَى اللَّهِ تَعَالَى قَالَ الصَّلَاةُ عَلَى وَقْتِهَا وَبِرُّ الْوَالِدَيْنِ وَالْجِهَادُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah mengabarkan kepadaku [Al-Walid bin Al-'Aizar] dia berkata; aku mendengar [Abu 'Amr Asy-Syaibani] berkata; telah menceritakan kepada kami penghuni rumah ini -dan mengisyaratkan ke arah rumah ['Abdullah] - dia berkata; 'Aku pernah bertanya kepada Rasulullah Shallallahu'alaihi wasallam, \"Apakah amalan yang paling dicintai Allah Azza wa Jalla? Beliau menjawab.\"sholat pada waktunya, berbakti kepada orang tua, dan jihad di jalan Allah Azza wa Jalla.\""
            },
            {
                "number": 606,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ النَّخَعِيُّ سَمِعَهُ مِنْ أَبِي عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْعَمَلِ أَحَبُّ إِلَى اللَّهِ عَزَّ وَجَلَّ قَالَ إِقَامُ الصَّلَاةِ لِوَقْتِهَا",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Muhammad bin 'Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepada kami [Abu Mu'awiyah An-Nakha'i] yang mendengarnya dari [Abu 'Amr] dari ['Abdullah bin Mas'ud] dia berkata; \"Aku bertanya kepada Rasulullah Shallallahu'alaihi wasallam, 'Apakah amalan yang paling dicintai Allah Azza wa Jalla? Beliau menjawab: \"Mendirikan sholat pada waktunnya.\""
            },
            {
                "number": 607,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ وَعَمْرُو بْنُ يَزِيدَ قَالَا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ أَنَّهُكَانَ فِي مَسْجِدِ عَمْرِو بْنِ شُرَحْبِيلَ فَأُقِيمَتْ الصَّلَاة فَجُعِلُوا يُنْتَظَرُونَهُ فَقَالَ إِنِّي كُنْتُ أُوتِرُ قَال وَسُئِلَ عَبْدُ اللَّهِ هَلْ بَعْدَ الْأَذَانِ وِتْرٌ قَالَ نَعَمْ وَبَعْدَ الْإِقَامَةِ وَحَدَّثَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَامَ عَنْ الصَّلَاةِ حَتَّى طَلَعَتْ الشَّمْسُ ثُمَّ صَلَّىوَاللَّفْظُ لِيَحْيَى",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hakim] dan ['Amr bin Yazid] mereka berdua berkata; telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Ibrahim bin Muhammad bin Al-Muntasyir] dari [bapaknya] bahwa dia sedang berada di masjid [Amru bin Syurahbil], kemudian iqamah dikumandangkan dan mereka menunggunya, dia berkata.\"Aku telah sholat witir.\" Dia berkata, \" [Abdullah] pernah ditanya, 'Apakah ada sholat witir setelah adzan? dia menjawab, \"Ya, juga setelah iqamah'. Lalu ia menceritakan bahwa Rasulullah Shallallahu'alaihi wasallam pernah ketiduran dari sholat hingga matahari terbit, kemudian beliau Shallallahu'alaihi wasallam mengerjakan sholat (witir) '.\""
            },
            {
                "number": 608,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّهَا إِذَا ذَكَرَهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa lupa sholat, maka hendaklah mengerjakannya apabila dia ingat.\""
            },
            {
                "number": 609,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ يَزِيدَ قَالَ حَدَّثَنَا حَجَّاجٌ الْأَحْوَلُ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يَرْقُدُ عَنْ الصَّلَاةِ أَوْ يَغْفُلُ عَنْهَا قَالَ كَفَّارَتُهَا أَنْ يُصَلِّيَهَا إِذَا ذَكَرَهَا",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari [Yazid] dia berkata; telah menceritakan kepada kami [Hajjaj Al-Ahwal] dari [Qatadah] dari [Anas] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam pernah ditanya tentang orang yang tidak sholat, karena tertidur atau lalai. Beliau Shallallahu'alaihi wasallam menjawab: \"Kafaratnya (tebusannya) adalah mengerjakannya saat ingat.\""
            },
            {
                "number": 610,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَ قَالَذَكَرُوا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَوْمَهُمْ عَنْ الصَّلَاةِ فَقَالَ إِنَّهُ لَيْسَ فِي النَّوْمِ تَفْرِيطٌ إِنَّمَا التَّفْرِيطُ فِي الْيَقَظَةِ فَإِذَا نَسِيَ أَحَدُكُمْ صَلَاةً أَوْ نَامَ عَنْهَا فَلْيُصَلِّهَا إِذَا ذَكَرَهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari ['Abdullah bin Rabah] dari [Abu Qatadah] dia berkata; \"Para sahabat menceritakan kepada Nabi Shallallahu'alaihi wasallam bahwa mereka tertidur sehingga tidak sholat, maka Rasulullah Shallallahu'alaihi wasallam bersabda, 'Sikap meremehkan (sembrono) itu tidak berlaku dalam keadaan tidur, tetapi sikap meremehkan itu berlaku dalam keadaan terjaga. Jika salah seorang dari kalian lupa sholat atau tertidur, maka hendaklah ia mengerjakannya ketika ia ingat'.\""
            },
            {
                "number": 611,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ الْمُبَارَكِ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِي النَّوْمِ تَفْرِيطٌ إِنَّمَا التَّفْرِيطُ فِيمَنْ لَمْ يُصَلِّ الصَّلَاةَ حَتَّى يَجِيءَ وَقْتُ الصَّلَاةِ الْأُخْرَى حِينَ يَنْتَبِهُ لَهَا",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah bin Al-Mubarak] dari [Sulaiman bin Al-Mughirah] dari [Tsabit] dari ['Abdullah bin Rabah] dari [Abu Qatadah] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Sikap meremehkan (sembrono) itu tidak berlaku saat keadaan tidur, melainkan sikap sembrono itu berlaku pada orang yang tidak mengerjakan sholat hingga tiba waktu sholat selanjutnya, sedangkan dia dalam keadaan sadar.\""
            },
            {
                "number": 612,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا نَامُوا عَنْ الصَّلَاةِ حَتَّى طَلَعَتْ الشَّمْسُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيُصَلِّهَا أَحَدُكُمْ مِنْ الْغَدِ لِوَقْتِهَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Abu Dawud] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Tsabit Al-Banani] dari ['Abdullah bin Rabah] dari [Abu Qatadah] bahwa ketika para sahabat tertidur dari sholat hingga matahari terbit, Rasulullah Shallallahu'alaihi wasallam bersabda: \"Hendaklah salah seorang dari kalian melaksanakan sholat keesokan harinya pada waktunya.\" "
            },
            {
                "number": 613,
                "arab": "أَخْبَرَنَا عَبْدُ الْأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا يَعْلَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَسِيتَ الصَّلَاةَ فَصَلِّ إِذَا ذَكَرْتَ فَإِنَّ اللَّهَ تَعَالَى يَقُولُ{ أَقِمْ الصَّلَاةَ لِذِكْرِي }قَالَ عَبْدُ الْأَعْلَى حَدَّثَنَا بِهِ يَعْلَى مُخْتَصَرًا",
                "id": "Telah mengabarkan kepada kami ['Abdul A'la bin Washil bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Ya'la] dia berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Az-Zuhri] dari [Sa'id] dari [Abu Hurairah] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Apabila kamu lupa mengerjakan sholat maka kerjakanlah bila kamu ingat. Sesungguhnya Allah Ta'ala berfirman. 'Tegakkanlah sholat untuk mengingat-Ku'. (Qs. Thaahaa (20: 14) \" Abdul A'la berkata; Telah menceritakan kepada kami Ya'ala hadis tersebut secara ringkas. "
            },
            {
                "number": 614,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَنْبَأَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّهَا إِذَا ذَكَرَهَا فَإِنَّ اللَّهَ تَعَالَى قَالَ{ أَقِمْ الصَّلَاةَ لِذِكْرِي }",
                "id": "Telah mengabarkan kepada kami ['Amr bin Sawwad bin Al-Aswad bin 'Amr] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah memberitakan kepada kami [Yunus] dari [Ibnu Syihab] dari [Sa'id bin Al-Musayyab] dari [Abu Hurairah] Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa lupa mengerjakan sholat, maka hendaklah mengerjakannya apabila ia ingat. Sesungguhnya Allah Ta 'ala berfirman, 'Tegakkanlah sholat untuk mengingat-Ku'. (Qs. Thaahaa (20: 14).\""
            },
            {
                "number": 615,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَسِيَ صَلَاةً فَلْيُصَلِّهَا إِذَا ذَكَرَهَا فَإِنَّ اللَّهَ تَعَالَى يَقُولُ أَقِمْ الصَّلَاةَ لِلذِّكْرَىقُلْتُ لِلزُّهْرِيِّ هَكَذَا قَرَأَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah menceritakan kepada kami ['Abdullah] dari [Ma'mar] dari [Az-Zuhri] dari [Sa'id bin Al-Musayyab] dari [Abu Hurairah] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda; \"Barangsiapa lupa mengerjakan sholat, hendaklah mengerjakannya apabila ia ingat. Sesungguhnya Allah Ta 'ala berfirman, 'Tegakkanlah sholat sebagai peringatan.\" Zuhri (perawi) pernah ditanya, \"Apakah begini Rasulullah Shallallahu'alaihi wasallam membaca al-qur'an?\" dia menjawab, \"Ya.\""
            },
            {
                "number": 616,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِيهِ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَأَسْرَيْنَا لَيْلَةً فَلَمَّا كَانَ فِي وَجْهِ الصُّبْحِ نَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَامَ وَنَامَ النَّاسُ فَلَمْ يَسْتَيْقِظْ إِلَّا بِالشَّمْسِ قَدْ طَلَعَتْ عَلَيْنَا فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤَذِّنَ فَأَذَّنَ ثُمَّ صَلَّى الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ ثُمَّ أَمَرَهُ فَأَقَامَ فَصَلَّى بِالنَّاسِ ثُمَّ حَدَّثَنَا بِمَا هُوَ كَائِنٌ حَتَّى تَقُومَ السَّاعَةُ",
                "id": "Telah mengabarkan kepada kami [Hunnad bin As-Sari] dari [Abu Al-Ahwash] dari ['Atha bin As-Saib] dari [Buraid bin Abu Maryam] dari [bapaknya] dia berkata; \"Kami bersama Rasulullah Shallallahu'alaihi wasallam dalam suatu perjalanan. Kami berjalan di malam hari. Ketika menjelang Subuh Rasulullah Shallallahu'alaihi wasallam singgah lalu tertidur. Semua sahabat juga tertidur, dan mereka terbangun setelah matahari menyinari kami. Lantas Rasulullah Shallallahu'alaihi wasallam menyuruh muadzin untuk adzan, kemudian sholat dua rakaat sebelum Fajar. Rasulullah Shallallahu'alaihi wasallam menyuruhnya kembali untuk adzan, dan selanjutnya iqamah, lalu beliau Shallallahu'alaihi wasallam sholat bersama para sahabat. Setelah itu beliau menceritakan keadaan yang ada sampai perihal hari Kiamat kepada kami.\""
            },
            {
                "number": 617,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ هِشَامٍ الدَّسْتَوَائِيِّ عَنْ أَبِي الزُّبَيْرِ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِي عُبَيْدَةَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحُبِسْنَا عَنْ صَلَاةِ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ فَاشْتَدَّ ذَلِكَ عَلَيَّ فَقُلْتُ فِي نَفْسِي نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي سَبِيلِ اللَّهِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَالًا فَأَقَامَ فَصَلَّى بِنَا الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى بِنَا الْعَصْرَ ثُمَّ أَقَامَ فَصَلَّى بِنَا الْمَغْرِبَ ثُمَّ أَقَامَ فَصَلَّى بِنَا الْعِشَاءَ ثُمَّ طَافَ عَلَيْنَا فَقَالَ مَا عَلَى الْأَرْضِ عِصَابَةٌ يَذْكُرُونَ اللَّهَ عَزَّ وَجَلَّ غَيْرُكُمْ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah menceritakan kepada kami ['Abdullah] dari [Hisyam Ad-Dastawa'i] dari [Abu Az Zubair] dari [Nafi' bin Jubair bin Muth'im] dari [Abu 'Ubaidah bin 'Abdullah] dari ['Abdullah bin Mas'ud] dia berkata; kami dan Rasulullah Shallallahu'alaihi wasallam terhalang dari melaksanakan sholat Zhuhur, Ashar, Maghrib dan Isya. Dan itu membuatku merasa berat. Maka akupun berkata pada diriku sendiri, kita sedang bersama Rasulullah Shallallahu'alaihi wasallam dalam melaksanakan jihad fi sabilillah. Kemudian tiba-tiba Rasulullah Shallallahu'alaihi wasallam menyuruh Bilal untuk adzan, lalu iiqamat dan kami pun sholat zhuhur bersama beliau. Kemudian iqamat lagi, dan kamipun sholat ashar bersama beliau, kemudian iiqamat lagi, dan kamipun sholat maghrib bersama beliau, lalu iiqamat lagi, dan kamipun sholat isya bersama beliau. Kemudian beliau berkeliling pada kami dan bersabda: \" Di muka bumi ini tidak ada kelompok yang senantiasa mengingat Allah Azza wa Jalla selain kalian.\" "
            },
            {
                "number": 618,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ يَزِيدَ بْنِ كَيْسَانَ قَالَ حَدَّثَنِي أَبُو حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَعَرَّسْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ نَسْتَيْقِظْ حَتَّى طَلَعَتْ الشَّمْسُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَأْخُذْ كُلُّ رَجُلٍ بِرَأْسِ رَاحِلَتِهِ فَإِنَّ هَذَا مَنْزِلٌ حَضَرَنَا فِيهِ الشَّيْطَانُ قَالَ فَفَعَلْنَا فَدَعَا بِالْمَاءِ فَتَوَضَّأَ ثُمَّ صَلَّى سَجْدَتَيْنِ ثُمَّ أُقِيمَتْ الصَّلَاةُ فَصَلَّى الْغَدَاةَ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya] dari [Yazid bin Kaisan] dia berkata; telah menceritakan kepada kami [Abu Hazim] dari [Abu Hurairah] dia berkata; \"Kami tidur untuk istirahat bersama Rasulullah Shallallahu'alaihi wasallam dan terbangun ketika matahari terbit. Rasulullah Shallallahu'alaihi wasallam lalu bersabda: \"Hendaknya tiap orang berpegangan dengan kepala tunggangannya. Sesungguhnya tempat ini didatangi oleh setan '.\" Abu Hurairah berkata; \"Lalu kami melaksanakannya, dan beliau meminta air kemudian berwudhu. Lalu beliau mengerjakan sholat dua sujud (rakaat) dan iqamah. Kemudian beliau Shallallahu'alaihi wasallam sholat Subuh.\""
            },
            {
                "number": 619,
                "arab": "أَخْبَرَنَا أَبُو عَاصِمٍ خُشَيْشُ بْنُ أَصْرَمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي سَفَرٍ لَهُ مَنْ يَكْلَؤُنَا اللَّيْلَةَ لَا نَرْقُدَ عَنْ صَلَاةِ الصُّبْحِ قَالَ بِلَالٌ أَنَا فَاسْتَقْبَلَ مَطْلَعَ الشَّمْسِ فَضُرِبَ عَلَى آذَانِهِمْ حَتَّى أَيْقَظَهُمْ حَرُّ الشَّمْسِ فَقَامُوا فَقَالَ تَوَضَّئُوا ثُمَّ أَذَّنَ بِلَالٌ فَصَلَّى رَكْعَتَيْنِ وَصَلَّوْا رَكْعَتَيْ الْفَجْرِ ثُمَّ صَلَّوْا الْفَجْرَ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim Khusyaisy bin Ashram] dia berkata; telah menceritakan kepada kami [Yahya bin Hassan] dia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari ['Amr bin Dinar] dari [Nafi' bin Jubair] dari [bapaknya] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda ketika dalam perjalanan, \"Siapa yang menjaga kita pada malam ini, agar kita tidak tertidur dari sholat Subuh?\" Bilal berkata, \"Aku\". Tak tahunya kemudian waktu sudah dekat matahari terbit, telinga mereka tertutup hingga mereka terbangun karena sengatan terik matahari. Lalu mereka bangun dan berwudhu, kemudian Bilal adzan. Beliau Shallallahu'alaihi wasallam lalu sholat dua rakaat dan para sahabat ikut sholat Fajar dua rakaat. Setelah itu mereka semua sholat Subuh."
            },
            {
                "number": 620,
                "arab": "أَخْبَرَنَا أَبُو عَاصِمٍ قَالَ حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ حَدَّثَنَا حَبِيبٌ عَنْ عَمْرِو بْنِ هَرِمٍ عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَأَدْلَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ عَرَّسَ فَلَمْ يَسْتَيْقِظْ حَتَّى طَلَعَتْ الشَّمْسُ أَوْ بَعْضُهَا فَلَمْ يُصَلِّ حَتَّى ارْتَفَعَتْ الشَّمْسُ فَصَلَّى وَهِيَ صَلَاةُ الْوُسْطَى",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dia berkata; telah menceritakan kepada kami [Habban bin Hilal] telah menceritakan kepada kami [Habib] dari ['Amr bin Harim] dari [Jabir bin Zaid] dari [Ibnu 'Abbas] dia berkata; Pernah Rasulullah Shallallahu'alaihi wasallam berjalan semalam suntuk, kemudian beliau istirahat, dan beliau tidak bangun sampai matahari terbit atau muncul sebagian, beliau juga tidak sholat hingga matahari meninggi baru beliau melaksanakan sholat. Yaitu sholat subuh. "
            },
            {
                "number": 621,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ وَإِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَا حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ كَانَ يَقُولُ كَانَ الْمُسْلِمُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَجْتَمِعُونَ فَيَتَحَيَّنُونَ الصَّلَاةَ وَلَيْسَ يُنَادِي بِهَا أَحَدٌ فَتَكَلَّمُوا يَوْمًا فِي ذَلِكَ فَقَالَ بَعْضُهُمْ اتَّخِذُوا نَاقُوسًا مِثْلَ نَاقُوسِ النَّصَارَى وَقَالَ بَعْضَهُمْ بَلْ قَرْنًا مِثْلَ قَرْنِ الْيَهُودِ فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ أَوَلَا تَبْعَثُونَ رَجُلًا يُنَادِي بِالصَّلَاةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بِلَالُ قُمْ فَنَادِ بِالصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il] dan [Ibrahim bin Al-Hasan] mereka berdua berkata; telah menceritakan kepada kami [Hajjaj] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Nafi'] dari ['Abdullah bin 'Umar] dia berkata, \"Ketika kaum muslim datang ke Madinah, mereka berkumpul lalu tiba waktu sholat dan tidak ada orang yang menyeru kepadanya. Ketika mereka berbincang-bincang tentang perkara tersebut, sebagian dari mereka berkata, 'Bunyikan loceng seperti locengnya orang Nasrani'. Sebagian lain berkata, 'Bunyikan terompet seperti terompetnya orang Yahudi '. Kemudian Umar Radliyallahu'anhu berkata, 'Mengapa kalian tidak menyuruh seseorang agar menyeru kepada sholat? ' Lantas Rasulullah Shallallahu'alaihi wasallam bersabda: \"Wahai Bilal! Bangunlah dan serukan untuk sholat'."
            },
            {
                "number": 622,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِلَالًا أَنْ يَشْفَعَ الْأَذَانَ وَأَنْ يُوتِرَ الْإِقَامَةَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami ['Abdul Wahhab] dari [Ayyub] dari [Abu Qilabah] dari [Anas] dia berkata; Rasulullah Shallallahu'alaihi wasallam pernah memerintahkan Bilal untuk menggenapkan adzan dan mengganjilkan iqamah.\""
            },
            {
                "number": 623,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي أَبُو جَعْفَرٍ عَنْ أَبِي الْمُثَنَّى عَنْ ابْنِ عُمَرَ قَالَكَانَ الْأَذَانُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثْنَى مَثْنَى وَالْإِقَامَةُ مَرَّةً مَرَّةً إِلَّا أَنَّكَ تَقُولُ قَدْ قَامَتْ الصَّلَاةُ قَدْ قَامَتْ الصَّلَاةُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah menceritakan kepada kami [Abu Ja'far] dari [Abu Al-Mutsanna] dari [Ibnu 'Umar] dia berkata; \"Dahulu adzan pada zaman Rasulullah Shallallahu'alaihi wasallam dua kali-dua kali, sedangkan iqamah sekali-sekali, kecuali ucapan 'Qadqaamatish-shalah, qad qaamatish-shalah'.\""
            },
            {
                "number": 624,
                "arab": "أَخْبَرَنَا بِشْرُ بْنُ مُعَاذٍ قَالَ حَدَّثَنِي إِبْرَاهِيمُ وَهُوَ ابْنُ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ قَالَ حَدَّثَنِي أَبِي عَبْدُ الْعَزِيزِ وَجَدِّي عَبْدُ الْمَلِكِ عَنْ أَبِي مَحْذُورَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْعَدَهُ فَأَلْقَى عَلَيْهِ الْأَذَانَ حَرْفًا حَرْفًا قَالَ إِبْرَاهِيمُ هُوَ مِثْلُ أَذَانِنَا هَذَا قُلْتُ لَهُ أَعِدْ عَلَيَّ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ مَرَّتَيْنِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ مَرَّتَيْنِ ثُمَّ قَالَ بِصَوْتٍ دُونَ ذَلِكَ الصَّوْتِ يُسْمِعُ مَنْ حَوْلَهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ مَرَّتَيْنِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ مَرَّتَيْنِ حَيَّ عَلَى الصَّلَاةِ مَرَّتَيْنِ حَيَّ عَلَى الْفَلَاحِ مَرَّتَيْنِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Mu'adz] dia berkata; telah menceritakan kepada kami [Ibrahim bin 'Abdul 'Aziz bin 'Abdul Malik bin Abu Mahdzurah] dia berkata; bapakku ['Abdul 'Aziz] dan kakekku ['Abdul Malik] telah menceritakan kepadaku, dari [Abu Mahdzurah] bahwa Rasulullah Shallallahu'alaihi wasallam mendudukkannya kemudian menyampaikan Adzan kepadanya kalimat demi kalimat. Ibrahim berkata; \"Ini seperti adzan kita. Kemudian aku berkata; Ulangi kepadaku. kemudian beliau bersabda: Allahu Akbar Allahu Akbar, (Allah Maha Besar, Allah Maha Besar). Asyhadu An Laa llaaha Illallah-dua kali- (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah Subhaanahu wa Ta'ala). Asyhadu Anna Muhammadar-Rasuulullah-dua kali-, (Aku bersaksi bahwa Muhammad adalah utusan Allah'). kemudian beliau mengucapkan suara yang tidak seperti tadi, yang bisa di dengar oleh orang-orang di sekitarnya, \" Asyhadu An laa Ilaaha Illallah -dua kali-, Asyhadu Anna Muhammadar Rasulullah-dua kali-, Hayya 'Alas-Shalaah-dua kali-, Hayya 'Alal Falaah-dua kali-, Allahu Akbar Allahu Akbar, Laa Ilaaha Illallah."
            },
            {
                "number": 625,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ هَمَّامِ بْنِ يَحْيَى عَنْ عَامِرِ بْنِ عَبْدِ الْوَاحِدِ حَدَّثَنَا مَكْحُولٌ عَنْ عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ عَنْ أَبِي مَحْذُورَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَذَانُ تِسْعَ عَشْرَةَ كَلِمَةً وَالْإِقَامَةُ سَبْعَ عَشْرَةَ كَلِمَةًثُمَّ عَدَّهَا أَبُو مَحْذُورَةَ تِسْعَ عَشْرَةَ كَلِمَةً وَسَبْعَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Hammam bin Yahya] dari ['Amir bin 'Abdul Wahid] telah menceritakan kepada kami [Makhul] dari ['Abdullah bin Muhairiz] dari [Abu Mahdzurah] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: Adzan itu terdiri dari sembilan belas kalimat. Dan Iqamah terdiri dari tujuh belas kalimat. Kemudian Abu Mahdzurah menghitungnya sembilan belas kalimat dan tujuh belas kalimat."
            },
            {
                "number": 626,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ عَامِرٍ الْأَحْوَلِ عَنْ مَكْحُولٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ عَنْ أَبِي مَحْذُورَةَ قَالَعَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَذَانَ فَقَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ثُمَّ يَعُودُ فَيَقُولُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Mu'adz bin Hisyam] dia berkata, telah menceritakan kepadaku [bapakku] dari ['Amir 'Al Ahwal] dari [Makhul] dari ['Abdullah bin Muhairiz] dari [Abu Mahdzurah] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam mengajarkan adzan kepadaku, beliau bersabda, \"ALLAHU AKBAR ALLAAHU AKBAR, ALLAHU AKBAR ALLAHU AKBAR (Allah Maha Besar, Allah Maha Besar, Allah Maha Besar, Allah Maha Besar). ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU AN LAA ILAAHA ILLALLAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah). ASYHADU ANNA MUHAMMADAR RASUULULLAH (Aku bersaksi bahwa Muhammad adalah utusan Allah). Kemudian beliau mengulangi dan berkata, ASYHADU AN LAA ILAAHA ILLALLAAH, ASYHADU AN LAA ILAAHA ILLALLAAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembahj kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembahj kecuali Allah). ASYHADU ANNA MUHAMMADAR RASUULULLAH, ASYHADU ANNA MUHAMMADAR RASUULULLAH (Aku juga bersaksi bahwa Muhammad adalah utusan Allah, aku juga bersaksi bahwa Muhammad adalah utusan Allah.) HAYYA 'ALASH SHALAAH, HAYYA 'ALASH SHALAAH (Mari mengerjakan sholat, mari mengerjakan sholat), HAYYA 'ALAL FALAAH, HAYYA 'ALAL FALAAH, (Mari mencapai kebahagiaan, mari mencapai kebahagiaan). ALLAAHU AKBAR ALLAAHU AKBAR (Allah Maha Besar, Allah Maha Besar). LAA ILAAHA ILLALLAAH (Tidak ada tuhan yang berhak disembah kecuali Allah) \"."
            },
            {
                "number": 627,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ وَيُوسُفُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ أَنَّ عَبْدَ اللَّهِ بْنَ مُحَيْرِيزٍ أَخْبَرَهُ وَكَانَ يَتِيمًا فِي حِجْرِ أَبِي مَحْذُورَةَ حَتَّى جَهَّزَهُ إِلَى الشَّامِ قَالَ يَالَ لِأَبِي مَحْذُورَةَإِنِّي خَارِجٌ إِلَى الشَّامِ وَأَخْشَى أَنْ أُسْأَلَ عَنْ تَأْذِينِكَ فَأَخْبَرَنِي أَنَّ أَبَا مَحْذُورَةَ قَالَ لَهُ خَرَجْتُ فِي نَفَرٍ فَكُنَّا بِبَعْضِ طَرِيقِ حُنَيْنٍ مَقْفَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ حُنَيْنٍ فَلَقِيَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ الطَّرِيقِ فَأَذَّنَ مُؤَذِّنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّلَاةِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْنَا صَوْتَ الْمُؤَذِّنِ وَنَحْنُ عَنْهُ مُتَنَكِّبُونَ فَظَلِلْنَا نَحْكِيهِ وَنَهْزَأُ بِهِ فَسَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّوْتَ فَأَرْسَلَ إِلَيْنَا حَتَّى وَقَفْنَا بَيْنَ يَدَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّكُمْ الَّذِي سَمِعْتُ صَوْتَهُ قَدْ ارْتَفَعَ فَأَشَارَ الْقَوْمُ إِلَيَّ وَصَدَقُوا فَأَرْسَلَهُمْ كُلَّهُمْ وَحَبَسَنِي فَقَالَ قُمْ فَأَذِّنْ بِالصَّلَاةِ فَقُمْتُ فَأَلْقَى عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّأْذِينَ هُوَ بِنَفْسِهِ قَالَ قُلْ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ثُمَّ قَالَ ارْجِعْ فَامْدُدْ صَوْتَكَ ثُمَّ قَالَ قُلْ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ ثُمَّ دَعَانِي حِينَ قَضَيْتُ التَّأْذِينَ فَأَعْطَانِي صُرَّةً فِيهَا شَيْءٌ مِنْ فِضَّةٍ فَقُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِالتَّأْذِينِ بِمَكَّةَ فَقَالَ أَمَرْتُكَ بِهِ فَقَدِمْتُ عَلَى عَتَّابِ بْنِ أَسِيدٍ عَامِلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ فَأَذَّنْتُ مَعَهُ بِالصَّلَاةِ عَنْ أَمْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al-Hasan] dan [Yusuf bin Sa'id] -dan lafazh ini baginya- mereka berdua berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dia berkata; telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdul Malik bin Abu Mahdzurah] bahwasanya ['Abdullah bin Muhairiz] mengabarkan kepadanya -dia dulu anak yatim yang diasuh oleh Abu Mahdzurah hingga dia menyiapkannya pergi ke Syam- dia berkata, 'Aku pernah berkata kepada Abu Mahdzurah, 'Aku akan pergi ke Syam dan aku khawatir akan ditanya tentang permintaan izin kepadamu'.\" Lalu dia mengabarkan bahwa [Abu Mahdzurah] pernah berkata, 'Aku keluar bersama sebagian orang dan saat itu kami berada di jalan Hunain -jalan pulangnya Rasulullah Shallallahu'alaihi wasallam dari Hunain- kami berjumpa dengan Rasulullah Shallallahu'alaihi wasallam pada sebagian jalan. Lalu muadzin Rasulullah Shallallahu'alaihi wasallam mengumandangkan adzan untuk sholat di sisi beliau Shallallahu'alaihi wasalam. Kami mendengar suara muadzin dan kami berpaling darinya. Kami masih terus bercerita dan mengejeknya. Rasulullah Shallallahu'alaihi wasallam mendengar suara lalu mengirim seseorang kepada kami hingga kami berdiri di hadapan beliau Shallallahu'alaihi wasallam, lalu beliau Shallallahu'alaihi wasallam bersabda: 'Siapakah yang suaranya kudengar sangat keras? ' Orang-orang menunjuk kepadaku, dan mereka memang benar. Kemudian Rasulullah Shallallahu'alaihi wasallam menyuruh semua orang pergi sedangkan beliau menahanku, kemudian beliau Shallallahu'alaihi wasallam bersabda, 'Bangkit dan adzanlah untuk sholat'. Akupun bangun dan Rasulullah Shallallahu'alaihi wasallam sendiri yang menuntunku untuk adzan. Beliau Shallallahu'alaihi wasallam berkata, 'Katakanlah, \"ALLAAHU AKBAR ALLAAHU AKBAR, ALLAHU AKBAR ALLAHU AKBAR (Allah Maha Besar, Allah Maha Besar, Allah Maha Besar, Allah Maha Besar). ASYHADU AN LAA ILAAHA ILLALLAAH, ASYHADU AN LAA ILAAHA ILLALLAAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah) ASYHADU ANNA MUHAMMADAR RASUULULLAH, ASYHADU ANNA MUHAMMADAR RASUULULLAAH (Aku juga bersaksi bahwa Muhammad adalah utusan Allah, aku juga bersaksi bahwa Muhammad adalah utusan Allah). Kemudian Rasulullah Shallallahu'alaihi wasallam bersabda, \"Ulangi dan panjangkan suaramu\". Kemudian beliau Shallallahu'alaihi wasallam bersabda, 'Katakanlah, \"ASYHADU AN LAA ILAAHA ILLALLAH, ASYHADU AN LAA ILAAHA ILLALLAAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah). ASYHADU ANNA MUHAMMADAR RASUULULLAH, ASYHADU ANNA MUHAMMADUR RASUULULLAAH (Aku juga bersaksi bahwa Muhammad adalah utusan Allah, aku juga bersaksi bahwa Muhammad adalah utusan Allah). HAYYA 'ALASH SHALAAH, HAYYA 'ALASH SHALAAH (Mari mengerjakan sholat, mari mengerjakan sholat), HAYYA 'ALAL FALAAH, HAYYA 'ALAL FALAAH, (Mari mencapai kebahagiaan, mari mencapai kebahagiaan). ALLAHU AKBAR ALLAAHU AKBAR (Allah Maha Besar, Allah Maha Besar). LAA ILAAHA ILLALLAAH (Tidak ada tuhan yang berhak disembah kecuali Allah). Setelah adzan beliau Shallallahu'alaihi wasallam memanggilku dan memberikan sebuah kantong berisi perak, maka aku berkata, 'Wahai Rasulullah, perintahkan aku untuk adzan di Makkah. Beliau menjawab, 'Aku perintahkan kamu untuk itu'. Kemudian aku datang ke Attab bin Usaid -pegawai Rasulullah Shallallahu'alaihi wasallam di Makkah- lalu aku mengumandangkan adzan untuk sholat berjama'ah sesuai perintah Rasulullah Shallallahu'alaihi wasallam.\""
            },
            {
                "number": 628,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ عَنْ عُثْمَانَ بْنِ السَّائِبِ قَالَ أَخْبَرَنِي أَبِي وَأُمُّ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ عَنْ أَبِي مَحْذُورَةَ قَالَلَمَّا خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ حُنَيْنٍ خَرَجْتُ عَاشِرَ عَشْرَةٍ مِنْ أَهْلِ مَكَّةَ نَطْلُبُهُمْ فَسَمِعْنَاهُمْ يُؤَذِّنُونَ بِالصَّلَاةِ فَقُمْنَا نُؤَذِّنُ نَسْتَهْزِئُ بِهِمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ سَمِعْتُ فِي هَؤُلَاءِ تَأْذِينَ إِنْسَانٍ حَسَنِ الصَّوْتِ فَأَرْسَلَ إِلَيْنَا فَأَذَّنَّا رَجُلٌ رَجُلٌ وَكُنْتُ آخِرَهُمْ فَقَالَ حِينَ أَذَّنْتُ تَعَالَ فَأَجْلَسَنِي بَيْنَ يَدَيْهِ فَمَسَحَ عَلَى نَاصِيَتِي وَبَرَّكَ عَلَيَّ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ اذْهَبْ فَأَذِّنْ عِنْدَ الْبَيْتِ الْحَرَامِ قُلْتُ كَيْفَ يَا رَسُولَ اللَّهِ فَعَلَّمَنِي كَمَا تُؤَذِّنُونَ الْآنَ بِهَا اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ فِي الْأُولَى مِنْ الصُّبْحِ قَالَ وَعَلَّمَنِي الْإِقَامَةَ مَرَّتَيْنِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ قَدْ قَامَتْ الصَّلَاةُ قَدْ قَامَتْ الصَّلَاةُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُقَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُثْمَانُ هَذَا الْخَبَرَ كُلَّهُ عَنْ أَبِيهِ وَعَنْ أُمِّ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ أَنَّهُمَا سَمِعَا ذَلِكَ مِنْ أَبِي مَحْذُورَةَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al-Hasan] dia berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dari ['Utsman bin As-Saib] dia berkata; [bapakku] dan [Ummu 'Abdul Malik bin Abu Mahdzurah] telah mengabarkan kepadaku dari [Abu Mahdzurah] dia berkata; \"Tatkala Rasulullah Shallallahu'alaihi wasallam keluar dari Hunain, aku orang yang kesepuluh dari sepuluh orang Quraisy yang pergi mencari mereka (Rasulullah Shallallahu'alaihi wasallam dan para sahabat). Kami mendengar mereka mengumandangkan adzan untuk sholat, maka kami mulai ikut adzan sebagai ejekan kepada mereka. Oleh karena itu Rasulullah Shallallahu'alaihi wasallam bersabda: 'Aku mendengar seseorang yang merdu suaranya di antara mereka mengumandangkan adzan'. Beliau Shallallahu'alaihi wasallam mengutus seseorang kepada kami, lalu kamipun mengumandangkan adzan satu persatu dan aku orang yang terakhir. Ketika mendengarku mengumandangkan adzan beliau Shallallahu'alaihi wasallam berkata, 'Kemari'. Beliau mempersilakanku duduk di depannya dan mengusap ujung rambutku, serta mendo'akan keberkahan untukku -sampai tiga kali- kemudian berkata, 'Pergilah dan kumandangkan adzan di Masjidil Haram\". Aku berkata, 'Bagaimana caranya wahai Rasulullah Shallallahu'alaihiwasallam? ' Lalu beliau mengajariku sebagaimana yang kalian ucapkan saat adzan sekarang: \"ALLAAHU AKBAR ALLAAHU AKBAR, ALLAAHU AKBAR ALLAAHU AKBAR (Allah Maha Besar, Allah Maha Besar, Allah Maha Besar, Allah Maha Besar). ASYHADU AN LAA ILAAHA ILLALLAAH, ASYHADU AN LAA ILAAHA ILLALLAAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah) ASYHADU ANNA MUHAMMADAR RASUULULLAH, ASYHADU ANNA MUHAMMADAR RASUULULLAH (Aku juga bersaksi bahwa Muhammad adalah utusan Allah, aku juga bersaksi bahwa Muhammad adalah utusan Allah). ASYHADU AN LAA ILAAHA ILLALLAAH, ASYHADU AN LAA ILAAHA ILLALLAAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah) ASYHADU ANNA MUHAMMADAR RASUULULLAH, ASYHADU ANNA MUHAMMADAR RASUULULLAH (Aku juga bersaksi bahwa Muhammad adalah utusan Allah, aku juga bersaksi bahwa Muhammad adalah utusan Allah). HAYYA 'ALASH SHALAAH, HAYYA 'ALASH SHALAAH (Mari mengerjakan sholat, mari mengerjakan sholat), HAYYA 'ALAL FALAAH, HAYYA 'ALAL FALAAH, (Mari mencapai kebahagiaan, mari mencapai kebahagiaan), ASH SHALAATU KHAIRUMMINANNAUM (sholat itu lebih baik daripada tidur) -pada adzan pertama saat sholat Subuh-.\" dia berkata; \"Beliau mengajari iqamah dua kali: ALLAAHU AKBAR ALLAAHU AKBAR (Allah Maha Besar, Allah Maha Besar) ASYHADU AN LAA ILAAHA ILLALLAAH, ASYHADU AN LAA ILAAHA ILLALLAAH, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah). ASYHADU ANNA MUHAMMADAR RASUULULLAH, ASYHADU ANNA MUHAMMADAR RASUULULLAH (Aku juga bersaksi bahwa Muhammad adalah utusan Allah, aku juga bersaksi bahwa Muhammad adalah utusan Allah). HAYYA 'ALASH SHALAAH, HAYYA 'ALASH SHALAAH (Mari mengerjakan sholat, mari mengerjakan sholat), HAYYA 'ALAL FALAAH, HAYYA 'ALAL FALAAH, (Mari mencapai kebahagiaan, mari mencapai kebahagiaan). QAD QAAMATISH SHALAAH, QAD QAAMATISH SHALAAH (sholat telah siap ditegakkan, sholat telah siap ditegakkan). ALLAAHU AKBAR ALLAAHU AKBAR (Allah Maha Besar Allah Maha Besar), LAA ILAAHA ILLALLAAH, (Tidak ada tuhan yang berhak disembah kecuali Allah).\""
            },
            {
                "number": 629,
                "arab": "أَخْبَرَنَا حَاجِبُ بْنُ سُلَيْمَانَ عَنْ وَكِيعٍ عَنْ سُفْيَانَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَابْنُ عَمٍّ لِي وَقَالَ مَرَّةً أُخْرَى أَنَا وَصَاحِبٌ لِي فَقَالَ إِذَا سَافَرْتُمَا فَأَذِّنَا وَأَقِيمَا وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا",
                "id": "Telah mengabarkan kepada kami [Hajib bin Sulaiman] dari [Waki'] dari [Sufyan] dari [Khalid Al-Hadzdza'] dari [Abu Qilabah] dari [Malik bin Al-Huwairits] dia berkata; \"Aku dan anak pamanku mendatangi Nabi Shallallahu'alaihi wasallam. -dalam kesempatan lain dia berkata, \"Aku dan kawanku datang kepada Nabi Shallallahu'alaihi wasallam\"- lalu beliau bersabda: \"Jika kalian berdua bepergian, maka kumandangkanlah adzan dan iqamah, dan hendaklah yang paling besar (tua) menjadi imam'.\" "
            },
            {
                "number": 630,
                "arab": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ شَبَبَةٌ مُتَقَارِبُونَ فَأَقَمْنَا عِنْدَهُ عِشْرِينَ لَيْلَةً وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِيمًا رَفِيقًا فَظَنَّ أَنَّا قَدْ اشْتَقْنَا إِلَى أَهْلِنَا فَسَأَلَنَا عَمَّنْ تَرَكْنَاهُ مِنْ أَهْلِنَا فَأَخْبَرْنَاهُ فَقَالَ ارْجِعُوا إِلَى أَهْلِيكُمْ فَأَقِيمُوا عِنْدَهُمْ وَعَلِّمُوهُمْ وَمُرُوهُمْ إِذَا حَضَرَتْ الصَّلَاةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ وَلْيَؤُمَّكُمْ أَكْبَرُكُمْ",
                "id": "Telah mengabarkan kepadaku [Ziyad bin Ayyub] dia berkata; telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Ayyub] dari [Abu Qibalah] dari [Malik bin Al-Huwairits] dia berkata; \"Kami datang kepada Rasulullah Shallallahu'alaihi wasallam dan kami pemuda yang sebaya. Kami tinggal bersama Rasulullah Shallallahu'alaihi wasallam selama dua puluh malam. Rasulullah Shallallahu'alaihi wasallam adalah seorang yang sangat penyayang dan sangat lembut. Beliau mengira kalau kami merindukan keluarga kami, maka beliau bertanya tentang keluarga kami yang ditinggalkan. Kami pun memberitahukannya, lalu beliau Shallallahu'alaihi wasallam bersabda, \"Pulanglah ke keluarga kalian. Tinggallah bersama mereka dan ajari mereka serta perintahkan mereka untuk sholat. Jika telah datang waktu sholat, maka hendaklah salah seorang dari kalian mengumandangkan adzan, dan yang paling tua menjadi imam'.\""
            },
            {
                "number": 631,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَمْرِو بْنِ سَلَمَةَفَقَالَ لِي أَبُو قِلَابَةَ هُوَ حَيٌّ أَفَلَا تَلْقَاهُ قَالَ أَيُّوبُ فَلَقِيتُهُ فَسَأَلْتُهُ فَقَالَ لَمَّا كَانَ وَقْعَةُ الْفَتْحِ بَادَرَ كُلُّ قَوْمٍ بِإِسْلَامِهِمْ فَذَهَبَ أَبِي بِإِسْلَامِ أَهْلِ حِوَائِنَا فَلَمَّا قَدِمَ اسْتَقْبَلْنَاهُ فَقَالَ جِئْتُكُمْ وَاللَّهِ مِنْ عِنْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَقًّا فَقَالَ صَلُّوا صَلَاةَ كَذَا فِي حِينِ كَذَا وَصَلَاةَ كَذَا فِي حِينِ كَذَا فَإِذَا حَضَرَتْ الصَّلَاةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ وَلْيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا",
                "id": "Telah mengabarkan kepadaku [Ibrahim bin Ya'qub] dia berkata; telah menceritakan kepada kami [Sulaiman bin Harb] dia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari ['Amr bin Salamah]. Abu Qilabah berkata kepada Ayyub dia -Amr bin Salamah- masih hidup, apakah kamu tidak menemuinya? Ayyub berkata; 'maka aku menemuinya, dan bertanya kepadanya. Lalu dia berkata,; \"Setelah penakluklan (Fathu) Makkah, setiap kabilah bergegas memeluk Islam. [Ayahku] mengajak kaumnya masuk Islam. Ketika dia datang kami menyambutnya, dia berkata, 'Demi Allah, aku datang dari sisi Rasulullah Shallallahu'alaihi wasallam membawa kebenaran kepada kalian, beliau bersabda, \"sholatlah kalian begini pada waktu tertentu dan sholat tertentu pada waktu tertentu pula. Bila telah tiba waktu sholat, maka hendaklah salah seorang dari kalian adzan, lalu yang paling banyak hapalan al-qur'annya menjadi imam bagi kalian.\""
            },
            {
                "number": 632,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بِلَالًا يُؤَذِّنُ بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari ['Abdullah bin Dinar] dari [Ibnu 'Umar] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bilal mengumandangkan adzan pada malam hari, maka makan dan minumlah, hingga Ibnu Ummi Maktum mengumandangkan adzan.\""
            },
            {
                "number": 633,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بِلَالًا يُؤَذِّنُ بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى تَسْمَعُوا تَأْذِينَ ابْنِ أُمِّ مَكْتُومٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al-Laits] dari [Ibnu Syihab] dari [Salim] dari [Bapaknya] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bilal mengumandangkan adzan pada malam hari, maka makan dan minumlah, hingga kalian mendengar adzan Ibnu Ummi Maktum.\""
            },
            {
                "number": 634,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حَفْصٌ عَنْ عُبَيْدِ اللَّهِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَذَّنَ بِلَالٌ فَكُلُوا وَاشْرَبُوا حَتَّى يُؤَذِّنَ ابْنُ أُمِّ مَكْتُومٍقَالَتْ وَلَمْ يَكُنْ بَيْنَهُمَا إِلَّا أَنْ يَنْزِلَ هَذَا وَيَصْعَدَ هَذَا",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Hafsh] dari ['ubaidhullah] dari [Al-Qasim] dari ['Aisyah] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika Bilal mengumandangkan adzan, maka makan dan minumlah hingga Ibnu Ummi Maktum mengumandangkan adzan.\" Aisyah berkata; \"Diantara keduanya selalu bergantian. Bila satunya turun maka yang lain naik. dan sebaliknya.\""
            },
            {
                "number": 635,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ هُشَيْمٍ قَالَ أَنْبَأَنَا مَنْصُورٌ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمَّتِهِ أُنَيْسَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَذَّنَ ابْنُ أُمِّ مَكْتُومٍ فَكُلُوا وَاشْرَبُوا وَإِذَا أَذَّنَ بِلَالٌ فَلَا تَأْكُلُوا وَلَا تَشْرَبُوا",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dari [Husyaim] dia berkata; telah memberitakan kepada kami [Manshur] dari [Khubaib bin 'Abdurrahman] dari bibinya [Unaisah] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika Ibnu Ummi Maktum mengumandangkan adzan, maka makan dan minumlah. lika Bilal mengumandangkan adzan, maka jangan makan dan minum'.\""
            },
            {
                "number": 636,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ أَبِي عُثْمَانَ عَنْ ابْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بِلَالًا يُؤَذِّنُ بِلَيْلٍ لِيُوقِظَ نَائِمَكُمْ وَلِيَرْجِعَ قَائِمَكُمْ وَلَيْسَ أَنْ يَقُولَ هَكَذَا يَعْنِي فِي الصُّبْحِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Al Mu'tamir bin Sulaiman] dari [Bapaknya] dari [Abu 'Utsman] dari [Ibnu Mas'ud] dari Nabi Shallallahu'alaihi wasallam beliau Shallallahu'alaihi wasallam bersabda: \"Bilal adzan pada malam hari untuk membangunkan orang yang tidur dan agar orang yang sholat Qiyamullail kembali (istirahat) dan bukan untuk dikatakan begini -yakni panggilan pada waktu Subuh-.\""
            },
            {
                "number": 637,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍأَنَّ سَائِلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ وَقْتِ الصُّبْحِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَالًا فَأَذَّنَ حِينَ طَلَعَ الْفَجْرُ فَلَمَّا كَانَ مِنْ الْغَدِ أَخَّرَ الْفَجْرَ حَتَّى أَسْفَرَ ثُمَّ أَمَرَهُ فَأَقَامَ فَصَلَّى ثُمَّ قَالَ هَذَا وَقْتُ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yazid] dia berkata; telah menceritakan kepada kami [Humaid] dari [Anas], Ada seorang laki-laki yang bertanya kepada Rasulullah Shallallahu'alaihi wasallam tentang waktu Subuh. Maka Rasulullah Shallallahu'alaihi wasallam menyuruh Bilal untuk adzan ketika terbit Fajar. Besoknya beliau Shallallahu'alaihi wasallam mengakhirkan sholat Subuh sampai agak terang, dan menyuruh Bilal untuk adzan lalu iqamah lantas sholat. Kemudian beliau Shallallahu'alaihi wasallam bersabda, \"Begitu waktu sholat Subuh.\""
            },
            {
                "number": 638,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ أَبِيهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ بِلَالٌ فَأَذَّنَ فَجَعَلَ يَقُولُ فِي أَذَانِهِ هَكَذَا يَنْحَرِفُ يَمِينًا وَشِمَالًا",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Aun bin Abu Juhaifah] dari [Bapaknya], dia berkata; \"Aku datang kepada Rasulullah Shallallahu'alaihi wasallam, lalu Bilal keluar dan adzan. Dia (Bilal) memiringkan badannya ke kanan dan ke kiri.\""
            },
            {
                "number": 639,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ الْأَنْصَارِيُّ الْمَازِنِيُّ عَنْ أَبِيهِ أَنَّهُ أَخْبَرَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ لَهُإِنِّي أَرَاكَ تُحِبُّ الْغَنَمَ وَالْبَادِيَةَ فَإِذَا كُنْتَ فِي غَنَمِكَ أَوْ بَادِيَتِكَ فَأَذَّنْتَ بِالصَّلَاةِ فَارْفَعْ صَوْتَكَ فَإِنَّهُ لَا يَسْمَعُ مَدَى صَوْتِ الْمُؤَذِّنِ جِنٌّ وَلَا إِنْسٌ وَلَا شَيْءٌ إِلَّا شَهِدَ لَهُ يَوْمَ الْقِيَامَةِ قَالَ أَبُو سَعِيدٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah memberitakan kepada kami [Ibnul Qasim] dari [Malik] dia berkata; telah menceritakan kepadaku ['Abdurrahman bin 'Abdullah bin 'Abdurrahman bin Abu Sha'sha' ah Al-Anshari Al-Mazini] dari [Bapaknya] bahwasanya dia mengabarkan kepadanya bahwasanya [Abu Sa'id Al-Khudri] berkata kepadanya; \"Aku melihatmu suka kepada kambing dan perkampungan. Jika kamu sedang berada di rombongan kambing atau perkampunganmu, maka kumandangkan adzan untuk sholat dan keraskan suaramu. Sesungguhnya tidaklah jangkauan suara adzan tersebut bisa didengar oleh jin, manusia, dan sesuatu apapun melainkan (mereka) akan menjadi saksi baginya pada hari Kiamat.\"Abu Sa'id Al Khudri berkata; \"Aku mendengarnya dari Rasululullah Shallallahu'alaihi wasallam.\""
            },
            {
                "number": 640,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ عَنْ أَبِي يَحْيَى عَنْ أَبِي هُرَيْرَةَسَمِعَهُ مِنْ فَمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمُؤَذِّنُ يُغْفَرُ لَهُ بِمَدِّ صَوْتِهِ وَيَشْهَدُ لَهُ كُلُّ رَطْبٍ وَيَابِسٍ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dan [Muhammad bin 'Abdul A'la] mereka berdua berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Musa bin Abu 'Utsman] dari [Abu Yahya] dari [Abu Hurairah] dia mendengar dari lisan Rasulullah Shallallahu'alaihi wasallam bersabda,: \"Muadzin akan diampuni dosanya sejauh suara adzannya dan semua (makhluk) yang basah atau yang kering akan menjadi saksi baginya.\""
            },
            {
                "number": 641,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي إِسْحَقَ الْكُوفِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الصَّفِّ الْمُقَدَّمِ وَالْمُؤَذِّنُ يُغْفَرُ لَهُ بِمَدِّ صَوْتِهِ وَيُصَدِّقُهُ مَنْ سَمِعَهُ مِنْ رَطْبٍ وَيَابِسٍ وَلَهُ مِثْلُ أَجْرِ مَنْ صَلَّى مَعَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al-Mutsanna] dia berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam] dia berkata; [Bapakku] telah menceritakan kepadaku dari [Qatadah] dari [Abu Ishaq Al-Kufi] dari [Al-Barra' bin 'Azib] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Allah dan para malaikat mendo'akan (orang-orang) yang berada di shaf terdepan. Seorang muadzin akan diampuni sepanjang suaranya dan dibenarkan oleh yang mendengarnya dari semua yang basah dan kering, dan dia mendapat pahala seperti pahala orang yang ikut sholat bersamanya.\""
            },
            {
                "number": 642,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ أَبِي جَعْفَرٍ عَنْ أَبِي سَلْمَانَ عَنْ أَبِي مَحْذُورَةَ قَالَكُنْتُ أُؤَذِّنُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُنْتُ أَقُولُ فِي أَذَانِ الْفَجْرِ الْأَوَّلِ حَيَّ عَلَى الْفَلَاحِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُأَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى وَعَبْدُ الرَّحْمَنِ قَالَا حَدَّثَنَا سُفْيَانُ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عَبْد الرَّحْمَنِ وَلَيْسَ بِأَبِي جَعْفَرٍ الْفَرَّاءِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Sufyan] dari [Abu Ja'far] dari [Abu Salman] dari [Abu Mahdzurah] dia berkata; \"Aku pernah adzan untuk Rasulullah Shallallahu'alaihi wasallam dan aku mengucapkan (kalimat) pada adzan Fajar pertama: HAYYA 'ALAL FALAAH (mari menggapai kebahagiaan) ASH SHALAATU KHAIRUM MINANNAUM (sholat lebih baik dari pada tidur), ASHsholatU KHAIRUM MINANNAUM (sholat lebih baik dari pada tidur). ALLAAHU AKBAR (Allah Maha Besar), ALLAAHU AKBAR (Allah Maha Besar), LAA ILAAHA ILLALLAAH (Tidak ada Tuhan yang berhak disembah selain Allah).\" Telah mengkabarkan kepada kami [Amr bin Ali] dia berkata; Telah menceritkan kepada kami [Yahya] dan [Abdurrahman] mereka berkata; Telah menceritakan kepada kami [Sufyan] dengan sanad yang serupa. Abu Abdurrahman berkata; \"Tapi bukan dari Abu Ja'far Al Farra.\""
            },
            {
                "number": 643,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى قَالَ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ بِلَالٍ قَالَآخِرُ الْأَذَانِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'dan bin 'Isa] dia berkata; telah menceritakan kepada kami [Al-Hasan bin A'yan] dia berkata; telah menceritakan kepada kami [Zuhair] dia berkata; telah menceritakan kepada kami [Al-A'masy] dari [Ibrahim] dari [Al-Aswad] dari [Bilal] dia berkata; \"Lafazh adzan yang terakir adalah: ALLAAHU AKBAR, ALLAAHU AKBAR (Allah Maha Besar. Allah Maha Besar), LAA ILAAHA ILLALLAAH (Tidak ada tuhan (yang berhak disembah kecuali Allah).\""
            },
            {
                "number": 644,
                "arab": "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ قَالَكَانَ آخِرُ أَذَانِ بِلَالٍ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُأَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Suwaid] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari [Al-Aswad] dia berkata; \"Lafazh adzan yang terakir adalah: ALLAAHU AKBAR, ALLAAHU AKBAR (Allah Maha Besar. Allah Maha Besar), LAA ILAAHA ILLALLAAH (Tidak ada tuhan (yang berhak disembah kecuali Allah).\" Telah mengabarkan kepada kami [Suwaid] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Sufyan] dari [Al-A'masy] dari [Ibrahim] dari [Al-Aswad] yang semisal itu."
            },
            {
                "number": 645,
                "arab": "أَخْبَرَنَا سُوَيْدٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ بْنِ أَبِي إِسْحَقَ عَنْ مُحَارِبِ بْنِ دِثَارٍ قَالَ حَدَّثَنِي الْأَسْوَدُ بْنُ يَزِيدَ عَنْ أَبِي مَحْذُورَةَأَنَّ آخِرَ الْأَذَانِ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah mengabarkan kepada kami [Suwaid] dia berkata; telah menceritakan kepada kami ['Abdullah] dari [Yunus bin Abu Ishaq] dari [Muharib bin Ditsar] dia berkata; telah menceritakan kepadaku [Al-Aswad bin Yazid] dari [Abu Mahdzurah], \"Sesungguhnya lafazh adzan yang terakir adalah: LAA ILAAHA ILLALLAAH (Tidak ada Tuhan yang berhak disembah kecuali Allah).\""
            },
            {
                "number": 646,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَمْرِو بْنِ أَوْسٍ يَقُولُ أَنْبَأَنَا رَجُلٌ مِنْ ثَقِيفٍأَنَّهُ سَمِعَ مُنَادِيَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي فِي لَيْلَةٍ مَطِيرَةٍ فِي السَّفَرِ يَقُولُ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ صَلُّوا فِي رِحَالِكُمْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] dari ['Amr bin Aus] dia berkata; telah memberitakan kepada kami [seorang laki-laki] dari Tsaqif bahwasanya dia mendengar muadzin Rasulullah Shallallahu'alaihi wasallam -pada malam turun hujan dalam suatu perjalanan- berkata, \"HAYYA 'ALASH-SHALAAH (Mari menuju sholat), HAYYA 'ALASH-SHALAAH (Mari menggapai kebahagiaan). SHALLU FII RIHAALIKUM (sholatlah kalian di tempat-tempat kalian).\""
            },
            {
                "number": 647,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَأَذَّنَ بِالصَّلَاةِ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ فَقَالَ أَلَا صَلُّوا فِي الرِّحَالِ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ ذَاتُ مَطَرٍ يَقُولُ أَلَا صَلُّوا فِي الرِّحَالِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] bahwasanya [Ibnu 'Umar] pernah adzan untuk sholat pada malam yang sangat dingin dan berangin, dia berkata, \"Hendaklah kalian sholat di rumah. Dulu bila malam sangat dingin dan turun hujan, maka Rasulullah Shallallahu'alaihi wasallam menyuruh muadzin untuk mengucapkan, Shallu fii Rihaalikum 'Hendaklah kalian sholat di rumah'.\""
            },
            {
                "number": 648,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ هَارُونَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ قَالَ أَنْبَأَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَسَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَى عَرَفَةَ فَوَجَدَ الْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ فَنَزَلَ بِهَا حَتَّى إِذَا زَاغَتْ الشَّمْسُ أَمَرَ بِالْقَصْوَاءِ فَرُحِّلَتْ لَهُ حَتَّى إِذَا انْتَهَى إِلَى بَطْنِ الْوَادِي خَطَبَ النَّاسَ ثُمَّ أَذَّنَ بِلَالٌ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Harun] dia berkata; telah menceritakan kepada kami [Hatim bin Isma'il] dia berkata; telah memberitakan kepada kami [Ja'far bin Muhammad] dari [bapaknya] bahwasanya [Jabir bin 'Abdullah] berkata; \"Rasulullah Shallallahu'alaihi wasallam berjalan hingga ke Arafah, dan beliau mendapati kemah telah didirikan untuknya di Namirah, maka beliau singgah sampai saatnya matahari terbenam. Lantas beliau mempersiapkan untanya untuk segera berangkat. Sesampainya di Bathn Al Wadi beliau berkhutbah di hadapan manusia, lalu Bilal mengumandangkan adzan dan melakukan iqamah. lalu sholat Zhuhur, kemudian melakukan iqamah lagi dan mengerjakan sholat Ashar, dan beliau tidak mengerjakan sholat apapun diantara keduanva.\" "
            },
            {
                "number": 649,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ هَارُونَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَدَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى انْتَهَى إِلَى الْمُزْدَلِفَةِ فَصَلَّى بِهَا الْمَغْرِبَ وَالْعِشَاءَ بِأَذَانٍ وَإِقَامَتَيْنِ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا",
                "id": "Telah mengabarkan kepadaku [Ibrahim bin Harun] dia berkata; telah menceritakan kepada kami [Hatim bin Isma'il] dia berkata; telah menceritakan kepada kami [Ja'far bin Muhammad] dari [bapaknya] bahwasanya [Jabir bin 'Abdullah] berkata; \"Rasulullah Shallallahu'alaihi wasallam berangkat hingga ke Muzdalifah, lalu sholat Maghrib dan Isya' dengan satu kali adzan dan dua iqamah tanpa ada sholat apapun di antara keduanya.\" "
            },
            {
                "number": 650,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَكُنَّا مَعَهُ بِجَمْعٍ فَأَذَّنَ ثُمَّ أَقَامَ فَصَلَّى بِنَا الْمَغْرِبَ ثُمَّ قَالَ الصَّلَاةَ فَصَلَّى بِنَا الْعِشَاءَ رَكْعَتَيْنِ فَقُلْتُ مَا هَذِهِ الصَّلَاةُ قَالَ هَكَذَا صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْمَكَانِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Syarik] dari [Salamah bin Kuhail] dari [Sa'id bin Jubair] dari [Ibnu 'Umar] dia berkata; \"Kami bersama Nabi Shallallahu'alaihi wasallam di Muzdalifah, kemudian beliau mengumandangkan adzan lalu iqamah dan sholat Maghrib bersama kami, lalu beliau berkata, 'sholat'. Kemudian beliaupun sholat Isya' dua rakaat bersama kami.\" Aku bertanya kepada Ibnu Umar, \"sholat apa ini?\" dia menjawab \"Beginilah dahulu kami sholat bersama Rasulullah Shallallahu'alaihi wasallam, di tempat ini."
            },
            {
                "number": 651,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ وَسَلَمَةُ بْنُ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍأَنَّهُ صَلَّى الْمَغْرِبَ وَالْعِشَاءَ بِجَمْعٍ بِإِقَامَةٍ وَاحِدَةٍ ثُمَّ حَدَّثَ عَنْ ابْنِ عُمَرَ أَنَّهُ صَنَعَ مِثْلَ ذَلِكَ وَحَدَّثَ ابْنُ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al-Mutsanna] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al-Hakam] dan [Salamah bin Kuhail] dari [Sa'id bin Jubair] bahwasanya dia sholat Maghrib dan Isya di Muzdalifah dengan satu iqamah. Kemudian dia berkata; dari [Ibnu Umar] bahwa dia mengerjakan seperti itu juga. Dan Ibnu Umar berkata; Bahwa Rasulullah Shallallahu'alaihi wasallam juga melakukan seperti itu."
            },
            {
                "number": 652,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ أَبِي خَالِدٍ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَمْعٍ بِإِقَامَةٍ وَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami [Isma'il bin Abu Khalid] dia berkata; telah menceritakan kepadaku [Abu Ishaq] dari [Sa'id bin Jubair] dari [Ibnu 'Umar] bahwa dia sholat bersama Rasulullah Shallallahu'alaihi wasallam di Muzdalifah dengan satu Iqamah."
            },
            {
                "number": 653,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ عَنْ وَكِيعٍ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَهُمَا بِالْمُزْدَلِفَةِ صَلَّى كُلَّ وَاحِدَةٍ مِنْهُمَا بِإِقَامَةٍ وَلَمْ يَتَطَوَّعْ قَبْلَ وَاحِدَةٍ مِنْهُمَا وَلَا بَعْدُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dari [Waki'] dia berkata; telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az-Zuhri] dari [Salim] dari [Bapaknya] bahwa Rasulullah Shallallahu'alaihi wasallam menjama' antara dua sholat di Muzdalifah, beliau mengerjakan setiap sholat dengan iqamah tanpa ada sholat sunah baik sebelum maupun sesudahnya."
            },
            {
                "number": 654,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ قَالَشَغَلَنَا الْمُشْرِكُونَ يَوْمَ الْخَنْدَقِ عَنْ صَلَاةِ الظُّهْرِ حَتَّى غَرَبَتْ الشَّمْسُ وَذَلِكَ قَبْلَ أَنْ يَنْزِلَ فِي الْقِتَالِ مَا نَزَلَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ }فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَالًا فَأَقَامَ لِصَلَاةِ الظُّهْرِ فَصَلَّاهَا كَمَا كَانَ يُصَلِّيهَا لِوَقْتِهَا ثُمَّ أَقَامَ لِلْعَصْرِ فَصَلَّاهَا كَمَا كَانَ يُصَلِّيهَا فِي وَقْتِهَا ثُمَّ أَذَّنَ لِلْمَغْرِبِ فَصَلَّاهَا كَمَا كَانَ يُصَلِّيهَا فِي وَقْتِهَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Ibnu Abu Dzi'b] dia berkata; telah menceritakan kepada kami [Sa'id bin Abu Sa'id] dari ['Abdurrahman bin Abu Sa'id] dari [Bapaknya] dia berkata; \"Orang-orang musyrik menyibukkan kami dari sholat Zhuhur saat perang Khandaq hingga matahari terbenam, kejadian ini sebelum turunnya ayat tentang perang, maka Allah Azza wa Jalla menurunkan firman-Nya, 'Dan Allah menghindarkan orang-orang mukmin dari peperangan' (Al Ahzab: 26). Lalu Rasulullah Shallallahu'alaihi wasallam memerintahkan Bilal mengumandangkan iqamah untuk sholat Zhuhur, lantas beliau sholat Zhuhur sebagaimana beliau sholat pada waktunya. Kemudian iqamah untuk sholat Ashar dan beliau mengerjakan sholat Ashar sebagaimana beliau mengerjakan sholat Ashar pada waktunya. Setelah itu adzan Maghrib lalu sholat Maghrib sebagaimana sholat Maghrib pada waktunya.\""
            },
            {
                "number": 655,
                "arab": "أَخْبَرَنَا هَنَّادٌ عَنْ هُشَيْمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ أَبِي عُبَيْدَةَ قَالَ قَالَ عَبْدُ اللَّهِإِنَّ الْمُشْرِكِينَ شَغَلُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَرْبَعِ صَلَوَاتٍ يَوْمَ الْخَنْدَقِ فَأَمَرَ بِلَالًا فَأَذَّنَ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ ثُمَّ أَقَامَ فَصَلَّى الْمَغْرِبَ ثُمَّ أَقَامَ فَصَلَّى الْعِشَاءَ",
                "id": "Telah mengabarkan kepada kami [Hannad] dari [Husyaim] dari [Abu Az Zubair] dari [Nafi' bin Jubair] dari [Abu \"Ubaidah] dia berkata; ['Abdullah] berkata; \"Orang-orang musyrik telah menyibukkan Nabi Shallallahu'alaihi wasallam dari empat waktu sholat saat perang Khandaq. Beliau menyuruh Bilal adzan dan melakukan iqamah, lantas beliau sholat Zhuhur. Kemudian melaksanakan iqamah lagi dan beliau segera sholat Ashar. Kemudian iqamah lagi, lalu beliau sholat Maghrib, dan terakhir ia melakukan iqamah lagi kemudian sholat Isya'.\""
            },
            {
                "number": 656,
                "arab": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ قَالَ حَدَّثَنَا هِشَامٌ أَنَّ أَبَا الزُّبَيْرِ الْمَكِّيَّ حَدَّثَهُمْ عَنْ نَافِعِ بْنِ جُبَيْرٍ أَنَّ أَبَا عُبَيْدَةَ بْنَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ حَدَّثَهُمْ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ قَالَكُنَّا فِي غَزْوَةٍ فَحَبَسَنَا الْمُشْرِكُونَ عَنْ صَلَاةِ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ فَلَمَّا انْصَرَفَ الْمُشْرِكُونَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنَادِيًا فَأَقَامَ لِصَلَاةِ الظُّهْرِ فَصَلَّيْنَا وَأَقَامَ لِصَلَاةِ الْعَصْرِ فَصَلَّيْنَا وَأَقَامَ لِصَلَاةِ الْمَغْرِبِ فَصَلَّيْنَا وَأَقَامَ لِصَلَاةِ الْعِشَاءِ فَصَلَّيْنَا ثُمَّ طَافَ عَلَيْنَا فَقَالَ مَا عَلَى الْأَرْضِ عِصَابَةٌ يَذْكُرُونَ اللَّهَ عَزَّ وَجَلَّ غَيْرُكُمْ",
                "id": "Telah mengabarkan kepada kami [Al-Qasim bin Zakaria bin Dinar] dia berkata; telah menceritakan kepada kami [Husain bin 'Ali] dari [Zaidah] dia berkata; telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dia berkata; telah menceritakan kepada kami [Hisyam] bahwasanya [Abu Az Zubair Al Makki] menceritakan kepada mereka dari [Nafi' bin Jubair] bahwasanya [Abu 'Ubaidah bin 'Abdullah bin Mas'ud] menceritakan kepada mereka bahwasanya ['Abdullah bin Mas'ud] berkata; kami dalam suatu peperangan, sehingga orang-orang Musyrik menghalangi kami dari melaksanakan sholat zhuhur, Ashar, Maghrib, dan Isya. Tatkala orang-orang Musyrik telah pergi, Rasulullah Shallallahu'alaihi wasallam menyuruh Mu'adzin untuk adzan dan melakukan iqamah untuk sholat Zhuhur, lalu kami sholat. Kemudian melaksanakan iqamah lagi untuk sholat Ashar, lalu kami sholat Ashar. Kemudian iqamah lagi untuk sholat Maghrib, lalu kami sholat Maghrib dan terakhir dia melakukan iqamah lagi untuk sholat Isya, dan kamipun sholat Isya'.\" Kemudian Beliau Shallallahu'alaihi wasallam berkeliling diantara kami dan bersabda: Di muka bumi ini tidak ada sekelompok manusia yang mengingat Allah Azza wa Jalla selain kalian."
            },
            {
                "number": 657,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ أَنَّ سُوَيْدَ بْنَ قَيْسٍ حَدَّثَهُ عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمًا فَسَلَّمَ وَقَدْ بَقِيَتْ مِنْ الصَّلَاةِ رَكْعَةٌ فَأَدْرَكَهُ رَجُلٌ فَقَالَ نَسِيتَ مِنْ الصَّلَاةِ رَكْعَةً فَدَخَلَ الْمَسْجِدَ وَأَمَرَ بِلَالًا فَأَقَامَ الصَّلَاةَ فَصَلَّى لِلنَّاسِ رَكْعَةًفَأَخْبَرْتُ بِذَلِكَ النَّاسَ فَقَالُوا لِي أَتَعْرِفُ الرَّجُلَ قُلْتُ لَا إِلَّا أَنْ أَرَاهُ فَمَرَّ بِي فَقُلْتُ هَذَا هُوَ قَالُوا هَذَا طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al-Laits] dari [Yazid bin Abu Habib] bahwasanya [Suwaid bin Qais] menceritakan kepadanya dari [Mu'awiyah bin Hudaij] bahwa pada suatu hari Rasulullah Shallallahu'alaihi wasallam mengerjakan sholat lalu salam, dan ada satu rakaat yang ketinggalan. Ada seorang laki-laki yang mengetahuinya, maka dia berkata, \"Wahai Rasulullah Shallallahu'alaihi wasallam, engkau lupa satu rakaat\" Nabi Shallallahu'alaihi wasallam lalu segera masuk masjid dan memerintahkan Bilal untuk iqamah, lalu beliau sholat satu rakaat dengan orang-orang. Kemudian hal ini aku kabarkan kepada orang-orang, maka mereka berkata kepadaku, \"Apakah kamu tahu siapa laki-laki tersebut?\" Aku menjawab, \"Tidak, kecuali jika aku melihatnya.\" Lalu dia lewat di depanku, maka segera kukatakan, \"Betul, Inikah orangnya?.\" Mereka (para sahabat) berkata, \"Ya Ini, Thalhah bin Ubaidillah.\""
            },
            {
                "number": 658,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَبْدِ اللَّهِ بْنِ رُبَيِّعَةَأَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَسَمِعَ صَوْتَ رَجُلٍ يُؤَذِّنُ فَقَالَ مِثْلَ قَوْلِهِ ثُمَّ قَالَ إِنَّ هَذَا لَرَاعِي غَنَمٍ أَوْ عَازِبٌ عَنْ أَهْلِهِ فَنَظَرُوا فَإِذَا هُوَ رَاعِي غَنَمٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah memberitakan kepada kami ['Abdurrahman] dari [Syu'bah] dari [Al-Hakim] dari [Ibnu Abu Laila] dari ['Abdullah bin Rubai'ah], bahwa dia pernah bersama Rasulullah Shallallahu'alaihi wasallam dalam suatu perjalanan, lalu beliau Shallallahu'alaihi wasallam mendengar suara seorang laki-Iaki sedang adzan, maka beliau Shallallahu'alaihi wasallam mengucapkan seperti yang dia kumandangkan, kemudian bersabda, \"Ini Adzannya pengembala kambing atau seorang laki-laki yang jauh dari istrinya.\" Lalu mereka melihatnya, ternyata dia seorang pengembala kambing."
            },
            {
                "number": 659,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ أَبَا عُشَّانَةَ الْمَعَافِرِيَّ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَعْجَبُ رَبُّكَ مِنْ رَاعِي غَنَمٍ فِي رَأْسِ شَظِيَّةِ الْجَبَلِ يُؤَذِّنُ بِالصَّلَاةِ وَيُصَلِّي فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ انْظُرُوا إِلَى عَبْدِي هَذَا يُؤَذِّنُ وَيُقِيمُ الصَّلَاةَ يَخَافُ مِنِّي قَدْ غَفَرْتُ لِعَبْدِي وَأَدْخَلْتُهُ الْجَنَّةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari ['Amr bin Al-Harits] bahwasanya [Abu 'Usysyanah Al-Ma'afiri] menceritakan kepadanya dari ['Uqbah bin 'Amir] dia berkata; \"Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Rabbrnu kagum kepada seorang pengembala kambing yang berada di puncak gunung, dia mengumandangkan adzan untuk shalal lalu dia sholat, maka Allah Azza wa Jalla berfirman, \"Lihatlah kepada hamba-Ku ini, dia mengumandangkan adzan dan iqamah lalu sholat karena takut kepada-Ku. Aku telah mengampuni hamba-Ku ini dan memasukkannya ke surga.\""
            },
            {
                "number": 660,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا يَحْيَى بْنُ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ رِفَاعَةَ بْنِ رَافِعٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَا هُوَ جَالِسٌ فِي صَفِّ الصَّلَاةِ الْحَدِيثَ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Yahya bin 'Ali bin Yahya bin Khallad bin Rifa'ah bin Rafi' Az-Zuraqi] dari [bapaknya] dari [kakeknya] dari [Rifa'ah bin Rafi'] \"Rasulullah Shallallahu'alaihi wasallam bersama kita dan beliau duduk di shaf sholat…\" (Al hadis) "
            },
            {
                "number": 661,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ تَمِيمٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ شُعْبَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ مُؤَذِّنَ مَسْجِدِ الْعُرْيَانِ عَنْ أَبِي الْمُثَنَّى مُؤَذِّنِ مَسْجِدِ الْجَامِعِ قَالَ سَأَلْتُ ابْنَ عُمَرَعَنْ الْأَذَانِ فَقَالَ كَانَ الْأَذَانُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثْنَى مَثْنَى وَالْإِقَامَةُ مَرَّةً مَرَّةً إِلَّا أَنَّكَ إِذَا قُلْتَ قَدْ قَامَتْ الصَّلَاةُ قَالَهَا مَرَّتَيْنِ فَإِذَا سَمِعْنَا قَدْ قَامَتْ الصَّلَاةُ تَوَضَّأْنَا ثُمَّ خَرَجْنَا إِلَى الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Muhammad bin Tamim] dia berkata; telah menceritakan kepada kami [Hajjaj] dari [Syu'bah] dia berkata; aku mendengar [Abu Ja'far] - mu'adzin masjid Al 'Uryan- dari [Abu Al Mutsanna] -mu'adzin masjid jami'- dia berkata; \"Aku pernah bertanya kepada [Ibnu 'Umar] tentang adzan, lalu beliau menjawab, 'Adzan pada zaman Rasulullah Shallallahu'alaihi wasallam adalah dua-dua dan iqamah sekali-sekali, kecuali ketika mengucapkan, \"Qad qaamatish-shalah\".' -diucapkannya dua kali-. Ketika kami mendengar 'Qad qaamatish-shalah\" kami telah berwudhu, kemudian segera sholat.\""
            },
            {
                "number": 662,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِصَاحِبٍ لِي إِذَا حَضَرَتْ الصَّلَاةُ فَأَذِّنَا ثُمَّ أَقِيمَا ثُمَّ لِيَؤُمَّكُمَا أَحَدُكُمَا",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Isma'il] dari [Khalid Al-Hadza'i] dari [Abu Qilabah] dari [Malik bin Al-Huwairits] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam bersabda kepadaku dan temanku, \"Jika telah tiba waktu sholat, maka adzanlah lalu lakukanlah iqamah, kemudian hendaklah salah seorang dari kalian menjadi imam.\""
            },
            {
                "number": 663,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نُودِيَ لِلصَّلَاةِ أَدْبَرَ الشَّيْطَانُ وَلَهُ ضُرَاطٌ حَتَّى لَا يَسْمَعَ التَّأْذِينَ فَإِذَا قُضِيَ النِّدَاءُ أَقْبَلَ حَتَّى إِذَا ثُوِّبَ بِالصَّلَاةِ أَدْبَرَ حَتَّى إِذَا قُضِيَ التَّثْوِيبُ أَقْبَلَ حَتَّى يَخْطُرَ بَيْنَ الْمَرْءِ وَنَفْسِهِ يَقُولُ اذْكُرْ كَذَا اذْكُرْ كَذَا لِمَا لَمْ يَكُنْ يَذْكُرُ حَتَّى يَظَلَّ الْمَرْءُ إِنْ يَدْرِي كَمْ صَلَّى",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Abu Az-Zinad] dari [Al-A'raj] dari [Abu Hurairah] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: Apabila adzan dikumandangkan, maka setan kabur sambil kentut hingga ia tidak mendengar suara adzan. Jika adzan telah selesai, maka setan datang lagi. Ketika iqamah dikumandangkan, maka setan kabur lagi. Dan saat iqamah selesai, maka setan kembali lagi. Sehingga setan ini masuk ke benak seseorang dan berkata; \"Ingat ini, ingat itu, terhadap hal-hal yang tadinya ia lupakan. Sampai seseorang tidak tahu berapa jumlah raka'at yang telah ia kerjakan.\""
            },
            {
                "number": 664,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الْأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عَلَيْهِ لَاسْتَهَمُوا عَلَيْهِ وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ وَلَوْ عَلِمُوا مَا فِي الْعَتَمَةِ وَالصُّبْحِ لَأَتَوْهُمَا وَلَوْ حَبْوًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Sumayyi] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda; \"Seandainya manusia mengetahui apa yang ada didalam adzan dan shaf pertama kemudian mereka tidak mendapatkannya kecuali dengan mengundi, maka mereka pasti akan mengundinya. Seandainya manusia mengetahui apa yang ada didalam menyegerakan sholat, maka mereka pasti akan berlomba untuk mendapatkannya. Seandainya manusia mengetahui apa yang ada didalam sholat Isya dan sholat Subuh, maka mereka pasti akan mendatanginya walaupun dengan merangkak.\""
            },
            {
                "number": 665,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ اجْعَلْنِي إِمَامَ قَوْمِي فَقَالَ أَنْتَ إِمَامُهُمْ وَاقْتَدِ بِأَضْعَفِهِمْ وَاتَّخِذْ مُؤَذِّنًا لَا يَأْخُذُ عَلَى أَذَانِهِ أَجْرًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami ['Affan] dia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dia berkata; telah menceritakan kepada kami [Sa'id bin Al-Jurairi] dari [Abu Al-'Alaa] dari [Mutharrif] dari ['Utsman bin Abul 'Ash] dia berkata; \"Aku pernah memohon, 'Wahai Rasulullah Shallallahu'alaihi wasallam, jadikan aku sebagai imam kaumku? ' Rasulullah Shallallahu'alaihi wasallam menjawab, 'Kamu imam mereka dan perhatikan orang yang paling lemah serta jangan menjadikan muadzin yang mengambil upah dari adzannya '.\""
            },
            {
                "number": 666,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَمِعْتُمْ النِّدَاءَ فَقُولُوا مِثْلَ مَا يَقُولُ الْمُؤَذِّنُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Az Zuhri] dari ['Atha bin Yazid] dari [Abu Sa'id Al Khudri] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika kalian mendengar adzan, maka ucapkanlah seperti apa yang diucapkan oleh muadzin.\""
            },
            {
                "number": 667,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ بُكَيْرَ بْنَ الْأَشَجِّ حَدَّثَهُ أَنَّ عَلِيَّ بْنَ خَالِدٍ الزُّرَقِيَّ حَدَّثَهُ أَنَّ النَّضْرَ بْنَ سُفْيَانَ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ بِلَالٌ يُنَادِي فَلَمَّا سَكَتَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ مِثْلَ هَذَا يَقِينًا دَخَلَ الْجَنَّةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari ['Amr bin Al-Harits] bahwasanya [Bukair bin Al-Asyajji] menceritakan kepadanya bahwasanya ['Ali bin Khalid Az-Zuraqi] menceritakan kepadanya bahwasanya [An-Nadhr bin Sufyan] menceritakan kepadanya sesungguhnya dia mendengar [Abu Hurairah] berkata; \"Suatu ketika kami bersama Rasulullah Shallallahu'alaihi wasallam, lalu bangkitlah Bilal untuk adzan. Setelah selesai adzan. Rasulullah Shallallahu'alaihi wasallam bersabda. 'Barangsiapa mengucapkan seperti yang dikumandangkan oleh muadzin dengan yakin, maka dia masuk surga'.\""
            },
            {
                "number": 668,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مُجَمِّعِ بْنِ يَحْيَى الْأَنْصَارِيِّ قَالَ كُنْتُ جَالِسًا عِنْدَ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍفَأَذَّنَ الْمُؤَذِّنُ فَقَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ فَكَبَّرَ اثْنَتَيْنِ فَقَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَتَشَهَّدَ اثْنَتَيْنِ فَقَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَتَشَهَّدَ اثْنَتَيْنِ ثُمَّ قَالَ حَدَّثَنِي هَكَذَا مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ عَنْ قَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ حَدَّثَنَا جَرِيرٌ عَنْ مِسْعَرٍ عَنْ مُجَمِّعٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ قَالَ سَمِعْتُ مُعَاوِيَةَ رَضِيَ اللَّهُ عَنْهُ يَقُولُ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَمِعَ الْمُؤَذِّنَ فَقَالَ مِثْلَ مَا قَالَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] telah memberitakan kepada kami ['Abdullah bin Al-Mubarak] dari [Mujammi' bin Yahya Al-Anshari] dia berkata; \"Aku pernah duduk di sisi [Abu Umamah bin Sahl bin Hunaif] lalu seorang muadzin mengumandangkan adzan, ALLAAHU AKBAR, ALLAAHU AKBAR (Allah Maha Besar, Allah Maha Besar'). Dia bertakbir dua kali. Muadzin meneruskan adzannya, ASYHADU AN LAA ILAAHA ILLALLAAH ('Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah'). dia ikut mengucapkan syahadat dua kali. Muadzin melanjutkan, ASYHADU ANNA MUHAMMADAR RASUULULLAAH (Aku bersaksi bahwa Muhammad adalah utusan Allah'). dia ikut mengucapkan syahadat dua kali, kemudian berkata; \"Beginilah [Mu'awiyah bin Abu Sufyan] bercerita kepadaku dari sabda Rasulullah Shallallahu'alaihi wasallam tentang hal ini'.\" Telah mengabarkan kepada kami [Muhammad bin Qudamah] telah menceritakan kepada kami [Jarir] dari [Mis'ar] dari [Mujammi'] dari [Abu Umamah bin Sahl] dia berkata; aku mendengar [Mu'awiyah Radliyallahu'anhu] berkata; berkata; Aku mendengar dari Rasulullah Shallallahu'alaihi wasallam ketika beliau mendengar Mua'adzin, beliau mengucapkan sebagaimana yang dia ucapkan."
            },
            {
                "number": 669,
                "arab": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى وَإِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ قَالَا حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ يَحْيَى أَنَّ عِيسَى بْنَ عُمَرَ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَلْقَمَةَ بْنِ وَقَّاصٍ عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ قَالَإِنِّي عِنْدَ مُعَاوِيَةَ إِذْ أَذَّنَ مُؤَذِّنُهُ فَقَالَ مُعَاوِيَةُ كَمَا قَالَ الْمُؤَذِّنُ حَتَّى إِذَا قَالَ حَيَّ عَلَى الصَّلَاةِ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ فَلَمَّا قَالَ حَيَّ عَلَى الْفَلَاحِ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ وَقَالَ بَعْدَ ذَلِكَ مَا قَالَ الْمُؤَذِّنُ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Mujahid bin Musa] dan [Ibrahim bin Al-Hasan Al-Miqsami] mereka berdua berkata; telah menceritakan kepada kami [Hajjaj] dia berkata; [Ibnu Juraij], telah mengabarkan kepadaku ['Amr bin Yahya] bahwasanya ['Isa bin 'Umar] mengabarkan kepadanya dari ['Abdullah bin 'Alqamah bin Waqqash] dari ['Alqamah bin Waqqash] dia berkata; \"Aku pemah berada di sisi [Muawiyah] ketika muadzinnya mengumandangkan adzan, dan ternyata Muawiyah mengucapkan sebagaimana yang diucapkan oleh muadzin. Tatkala muadzin mengucapkan `Hayya 'alash-shalaah' (Mari menuju sholat) dia mengucapkan, 'Laa haula walaa quwwata illaa billaah' (Tiada daya dan upaya kecuali dengan pertolongan Allah) dan ketika sampai ke lafazh, 'Hayya 'alai, falaah' (Mari menuju kebahagiaan) dia juga mengucapkan, 'Laa haula walaa quwwata illaa billaah' (Tiada daya dan upaya kecuali dengan pertolongan Allah). Setelah itu beliau mengucapkan seperti ucapan yang dikumandangkan oleh muadzin. Lantas dia berkata, 'Aku mendengar Rasulullah Shallallahu'alaihi wasallam mengucapkan seperti itu'.\""
            },
            {
                "number": 670,
                "arab": "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ حَيْوَةَ بْنِ شُرَيْحٍ أَنَّ كَعْبَ بْنَ عَلْقَمَةَ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ مَوْلَى نَافِعِ بْنِ عَمْرٍو الْقُرَشِيِّ يُحَدِّثُ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَمِعْتُمْ الْمُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ وَصَلُّوا عَلَيَّ فَإِنَّهُ مَنْ صَلَّى عَلَيَّ صَلَاةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا ثُمَّ سَلُوا اللَّهَ لِي الْوَسِيلَةَ فَإِنَّهَا مَنْزِلَةٌ فِي الْجَنَّةِ لَا تَنْبَغِي إِلَّا لِعَبْدٍ مِنْ عِبَادِ اللَّهِ أَرْجُو أَنْ أَكُونَ أَنَا هُوَ فَمَنْ سَأَلَ لِي الْوَسِيلَةَ حَلَّتْ لَهُ الشَّفَاعَةُ",
                "id": "Telah mengabarkan kepada kami [Suwaid] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Haiwah bin Syuraih] bahwasanya [Ka'b bin 'Alqamah] mendengar ['Abdurrahman bin Jubair] -bekas budak Nafi' bin 'Amr Al-Qurasyi- menceritakan bahwasanya dia mendengar ['Abdullah bin 'Amr] berkata; \"Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika kalian mendengar suara muadzin, maka ucapkanlah seperti apa yang diucapkan oleh dia, lalu bacalah shalawat atasku. Barangsiapa bershalawat atasku sekali saja, maka Allah akan bershalawat (mendo'akan kesejahteraan) kepadanya sepuluh kali. Kemudian mintalah wasilah kepada Allah untukku, karena wasilah adalah suatu kedudukan di surga yang tidak patut (mendapatnya) kecuali seorang hamba dari hamba-hamba Allah. Aku sangat berharap menjadi orang yang patut tersebut, dan barangsiapa memintakan wasilah untukku maka dia berhak mendapat syafaat!.\""
            },
            {
                "number": 671,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ اللَّيْثِ عَنْ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ وَأَنَا أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ رَضِيتُ بِاللَّهِ رَبًّا وَبِمُحَمَّدٍ رَسُولًا وَبِالْإِسْلَامِ دِينًا غُفِرَ لَهُ ذَنْبُهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Al-Laits] dari [Al-Hakim bin 'Abdullah] dari ['Amir bin Sa'd] dari [Sa'ad bin Abu Waqqash] dari Rasulullah Shallallahu'alaihi wasallam, beliau bersabda: \"Barangsiapa setelah mendengar adzan mengucapkan do'a, `Aku bersaksi bahwa tiada Dzat yang berhak diibadahi selain Allah, tanpa sekutu bagi-Nya. Aku juga bersaksi bahwa Muhammad adalah hamba dan utusan-Nya. Aku rela Allah sebagai Tuhan, Muhammad sebagai Rasul, dan Islam sebagai agama' maka dosa-dosanya akan diampuni.\""
            },
            {
                "number": 672,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا شُعَيْبٌ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ حِينَ يَسْمَعُ النِّدَاءَ اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ الْمَقَامَ الْمَحْمُودَ الَّذِي وَعَدْتَهُ إِلَّا حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Manshur] dia berkata; telah menceritakan kepada kami ['Ali bin 'Ayyasy] dia berkata; telah menceritakan kepada kami [Syu'aib] dari [Muhammad bin Al-Munkadir] dari [Jabir] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa ketika mendengar adzan ia mengucapkan do'a, `Ya Allah, Rabb Yang Memiliki seruan yang sempurna ini dan sholat yang ditegakkan, berikanlah kepada Muhammad wasilah dan fadhilah (keutamaan). Bangkitkanlah beliau pada kedudukan yang mulia sebagaimana telah Engkau janjikan' maka ia pasti mendapat syafaatku pada hari Kiamat.\""
            },
            {
                "number": 673,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ يَحْيَى عَنْ كَهْمَسٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ لِمَنْ شَاءَ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dari [Yahya] dari [Kahmas] dia berkata; telah menceritakan kepada kami ['Abdullah bin Buraidah] dari ['Abdullah bin Mughaffal] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Diantara dua adzan ada sholat, diantara dua adzan ada sholat, diantara dua adzan ada sholat, bagi Yang menghendaki.\" "
            },
            {
                "number": 674,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا أَبُو عَامِرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ عَامِرٍ الْأَنْصَارِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ الْمُؤَذِّنُ إِذَا أَذَّنَ قَامَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَبْتَدِرُونَ السَّوَارِيَ يُصَلُّونَ حَتَّى يَخْرُجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمْ كَذَلِكَ وَيُصَلُّونَ قَبْلَ الْمَغْرِبِ وَلَمْ يَكُنْ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ شَيْءٌ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Abu 'Amir] telah menceritakan kepada kami [Syu'bah] dari ['Amr bin 'Amir Al-Anshari] dari [Anas bin Malik] dia berkata; \"Bila muadzin telah mengumandangkan adzan, maka para sahabat segera bangkit mendekati tiang-tiang (masjid) dan sholat hingga Rasulullah Shallallahu'alaihi wasallam keluar dan mereka masih dalam keadaan demikian. Mereka sholat sebelum Maghrib, dan sebelumnya tidak ada sholat diantara adzan dan iqamah sesuatupun jua.\""
            },
            {
                "number": 675,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ عُمَرَ بْنِ سَعِيدٍ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِيهِ قَالَرَأَيْتُ أَبَا هُرَيْرَةَ وَمَرَّ رَجُلٌ فِي الْمَسْجِدِ بَعْدَ النِّدَاءِ حَتَّى قَطَعَهُ فَقَالَ أَبُو هُرَيْرَةَ أَمَّا هَذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] dari ['Umar bin Sa'id] dari [Asy'ats bin Abu Asy-Sya'tsa'] dari [Bapaknya] dia berkata; aku melihat Abu Hurairah kemudian seorang laki-laki berjalan di masjid setelah adzan hingga dia keluar dari masjid. Lalu [Abu Hurairah] berkata; \"Orang ini telah melakukan perbuatan maksiat terhadap Abu Qasim (Rasulullah Shallallahu'alaihi wasallam).\""
            },
            {
                "number": 676,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ أَبِي عُمَيْسٍ قَالَ أَخْبَرَنَا أَبُو صَخْرَةَ عَنْ أَبِي الشَّعْثَاءِ قَالَخَرَجَ رَجُلٌ مِنْ الْمَسْجِدِ بَعْدَ مَا نُودِيَ بِالصَّلَاةِ فَقَالَ أَبُو هُرَيْرَةَ أَمَّا هَذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Utsman bin Hakim] dia berkata; telah menceritakan kepada kami [Ja'far bin 'Aun] dari [Abu 'Umais] dia berkata; telah mengabarkan kepada kami [Abu Shakhrah] dari [Abu Asy-Sya'tsa'] dia berkata; seorang laki-laki keluar dari masjid setelah diseru untuk sholat maka [Abu Hurairah] berkata; \"Ada orang yang keluar dari masjid setelah dikumandangkan adzan, maka Abu Hurairah berkata, 'Orang tersebut telah melakukan perbuatan maksiat terhadap Abu Qasim (Rusulullah Shallallahu'alaihi wasallam) '.\""
            },
            {
                "number": 677,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ وَيُونُسُ وَعَمْرُو بْنُ الْحَارِثِ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُمْ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلَاةِ الْعِشَاءِ إِلَى الْفَجْرِ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ بَيْنَ كُلِّ رَكْعَتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ وَيَسْجُدُ سَجْدَةً قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً ثُمَّ يَرْفَعُ رَأْسَهُ فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ صَلَاةِ الْفَجْرِ وَتَبَيَّنَ لَهُ الْفَجْرُ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ بِالْإِقَامَةِ فَيَخْرُجُ مَعَهُوَبَعْضُهُمْ يَزِيدُ عَلَى بَعْضٍ فِي الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amr bin As-Sarh] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Ibnu Abu Dzi'b] dan [Yunus] dan ['Amr bin Al-Harits] bahwasanya [Ibnu Syihab] mengabarkan kepada mereka dari ['Urwah] dari ['Aisyah] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam sholat sebelas rakaat diantara setelah lsya' sampai Fajar. Beliau salam pada setiap dua rakaat dan witir satu rakaat. Beliau sujud selama ukuran salah seorang dari kalian membaca lima puluh ayat, kemudian beliau mengangkat kepalanya. Bila muadzin telah diam dari sholat (adzan) Fajar dan Fajar telah jelas, maka beliau sholat dua rakaat yang ringan, kemudian berbaring dengan posisi miring ke kanan hingga muadzin mendatangi beliau untuk iqamah, lalu beliau keluar bersamanya.\" Dan sebagian perawi ada yang saling menambahkan dalam hadis ini dari satu orang ke yang lainnya."
            },
            {
                "number": 678,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ أَنَّ كُرَيْبًا مُولِي ابْنِ عَبَّاسٍ أَخْبَرَهُ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ قُلْتُكَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ فَوَصَفَ أَنَّهُ صَلَّى إِحْدَى عَشْرَةَ رَكْعَةً بِالْوِتْرِ ثُمَّ نَامَ حَتَّى اسْتَثْقَلَ فَرَأَيْتُهُ يَنْفُخُ وَأَتَاهُ بِلَالٌ فَقَالَ الصَّلَاةُ يَا رَسُولَ اللَّهِ فَقَامَ فَصَلَّى رَكْعَتَيْنِ وَصَلَّى بِالنَّاسِ وَلَمْ يَتَوَضَّأْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al-Hakim] dari [Syu'aib] dari [Al-Laits] dia berkata; telah menceritakan kepada kami [Khalid] dari [Ibnu Abu Hilal] dari [Makhramah bin Sulaiman] bahwasanya [Kuraib] -budak Ibnu Abbas- mengabarkan kepadanya, dia berkata; \"Aku bertanya kepada Ibnu Abbas, 'Bagaimana cara sholat Rasulullah Shallallahu'alaihi wasallam pada malam hari? ' [Ibnu Abbas] mengatakan bahwa beliau Shallallahu'alaihi wasallam sholat sebelas rakaat dengan satu rakaat witir. Kemudian beliau tidur hingga merasa berat dan aku melihatnya mendengkur. Lalu datanglah Bilal dan berkata, 'Dirikan sholat wahai Rasulullah! ' Kemudian beliau bangun dan sholat dua rakaat, lantas beliau sholat bersama orang-orang tanpa berwudhu (lagi).\""
            },
            {
                "number": 679,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا تَقُومُوا حَتَّى تَرَوْنِي خَرَجْتُ",
                "id": "Telah mengabarkan kepada kami [Al-Husain bin Huraits] dia berkata; telah menceritakan kepada kami [Al-Fadhl bin Musa] dari [Ma'mar] dari [Yahya bin Abu Katsir] dari ['Abdullah bin Abu Qatadah] dari [Bapaknya], dia berkata; Rasulullah Shallallahu'alaihi wasallam Bersabda: \"Bila telah dikumandangkan iqamah untuk sholat, maka kalian jangan bangkit hingga melihatku datang.\""
            },
            {
                "number": 680,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عَمْرِو بْنِ عَبَسَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَنَى مَسْجِدًا يُذْكَرُ اللَّهُ فِيهِ بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Utsman] dia berkata; telah menceritakan kepada kami [Baqiyyah] dari [Bahir] dari [Khalid bin Ma'dan] dari [Katsir bin Murrah] dari ['Amr bin 'Abasah] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, \"Barangsiapa membangun masjid yang dipakai untuk berdzikir kepada Allah, maka Allah Azza wa Jalla akan membangun sebuah rumah di surga baginya.\""
            },
            {
                "number": 681,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَتَبَاهَى النَّاسُ فِي الْمَسَاجِدِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah bin Al-Mubarak] dari [Hammad bin Salamah] dari [Ayyub] dari [Abu Qibalah] dari [Anas] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Diantara tanda- tanda hari Kiamat adalah manusia bermegah-megahan dalam membangun masjid. "
            },
            {
                "number": 682,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَكُنْتُ أَقْرَأُ عَلَى أَبِي الْقُرْآنَ فِي السِّكَّةِ فَإِذَا قَرَأْتُ السَّجْدَةَ سَجَدَ فَقُلْتُ يَا أَبَتِ أَتَسْجُدُ فِي الطَّرِيقِ فَقَالَ إِنِّي سَمِعْتُ أَبَا ذَرٍّ يَقُولُ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ مَسْجِدٍ وُضِعَ أَوَّلًا قَالَ الْمَسْجِدُ الْحَرَامُ قُلْتُ ثُمَّ أَيٌّ قَالَ الْمَسْجِدُ الْأَقْصَى قُلْتُ وَكَمْ بَيْنَهُمَا قَالَ أَرْبَعُونَ عَامًا وَالْأَرْضُ لَكَ مَسْجِدٌ فَحَيْثُمَا أَدْرَكْتَ الصَّلَاةَ فَصَلِّ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami ['Ali bin Mushir] dari [Al-A'masy] dari [Ibrahim] dia berkata; \"Aku pernah membaca al-qur'an di hadapan [Bapakku] di jalan, dan ketika aku membaca ayat Sajdah dia segera sujud. Aku berkata kepadanya, ' Wahai ayahku, apakah engkau sujud di jalan? ' dia menjawab; Sesungguhnya aku mendengar [Abu Dzarr] berkata; \"Aku pernah bertanya kepada Rasulullah Shallallahu'alaihi wasallam tentang masjid yang pertama kali dibangun, lalu beliau Shallallahu'alaihi wasallam menjawab. 'Masjidil Haram'. Aku katakan lagi, 'Lantas masjid mana lagi`? ' Beliau menjawab, 'Masjidil Aqsha'. Aku berkata lagi, 'Berapa lama jarak antara keduanya? ' Rasulullah menjawab, 'Empat puluh tahun. Bumi bagimu adalah masjid, maka di mana saja kamu mendapatkan sholat maka sholatlah'.\""
            },
            {
                "number": 683,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ عَبَّاسٍ أَنَّ مَيْمُونَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْمَنْ صَلَّى فِي مَسْجِدِ رَسُولِ اللَّهِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصَّلَاةُ فِيهِ أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا مَسْجِدَ الْكَعْبَةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al-Laits] dari [Nafi'] dari [Ibrahim bin 'Abdullah bin Ma'bad bin 'Abbas] bahwasanya [Maimunah] -Istri Nabi Shallallahu'alaihi wasallam- berkata, \"Barangsiapa sholat di masjid Rasulullah Shallallahu'alaihi wasallam -sesungguhnya aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda- `sholat di dalam masjid Rasulullah Shallallahu'alaihi wasallam lebih utama seribu kali sholat di masjid lain, kecuali masjid Ka'bah (Masjidil Haram).\""
            },
            {
                "number": 684,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَبِلَالٌ وَعُثْمَانُ بْنُ طَلْحَةَ فَأَغْلَقُوا عَلَيْهِمْ فَلَمَّا فَتَحَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنْتُ أَوَّلَ مَنْ وَلَجَ فَلَقِيتُ بِلَالًا فَسَأَلْتُهُ هَلْ صَلَّى فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ صَلَّى بَيْنَ الْعَمُودَيْنِ الْيَمَانِيَيْنِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al-Laits] dari [Ibnu Syihab] dari [Salim] dari [Bapaknya], dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam masuk ke dalam Ka'bah bersama Usamah bin Zaid, Bilal, dan Utsman bin Thalhah, lalu mereka menutup (pintu Ka'bah). Ketika Rasulullah membukanya, maka akulah yang pertama kali masuk dan berjumpa dengan [Bilal]. Lalu aku bertanya kepadanya, \"Apakah Rasulullah Shallallahu'alaihi wasallam sholat di dalamnya'?\" dia berkata, \"Ya, beliau Shallallahu'alaihi wasallam sholat diantara dua tiang Yamani.\""
            },
            {
                "number": 685,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو مُسْهِرٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ رَبِيعَةَ بْنِ يَزِيدَ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ ابْنِ الدَّيْلَمِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ سُلَيْمَانَ بْنَ دَاوُدَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَنَى بَيْتَ الْمَقْدِسِ سَأَلَ اللَّهَ عَزَّ وَجَلَّ خِلَالًا ثَلَاثَةً سَأَلَ اللَّهَ عَزَّ وَجَلَّ حُكْمًا يُصَادِفُ حُكْمَهُ فَأُوتِيَهُ وَسَأَلَ اللَّهَ عَزَّ وَجَلَّ مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِهِ فَأُوتِيَهُ وَسَأَلَ اللَّهَ عَزَّ وَجَلَّ حِينَ فَرَغَ مِنْ بِنَاءِ الْمَسْجِدِ أَنْ لَا يَأْتِيَهُ أَحَدٌ لَا يَنْهَزُهُ إِلَّا الصَّلَاةُ فِيهِ أَنْ يُخْرِجَهُ مِنْ خَطِيئَتِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Manshur] dia berkata; telah menceritakan kepada kami [Abu Mushar] dia berkata; telah menceritakan kepada kami [Sa'id bin 'Abdul 'Aziz] dari [Rabi'ah bin Yazid] dari [Abu Idris Al-Khaulani] dari [Ibnu Ad-Dailami] dari ['Abdullah bin 'Amr] dari Rasulullah Shallallahu'alaihi wasallam, beliau bersabda \"Sulaiman bin Daud alaihissalam ketika membangun Baitul Maqdis meminta kepada Allah Azza wa Jalla tiga hal: meminta kepada Allah Azza wa Jalla hukum yang sesuai dengan hukumnya, lalu ia pun diberi. Dia meminta kepada Allah Azza wa Jalla suatu kerajaan yang tidak ada yang pantas memilikinya setelahnya, kemudian ia pun diberi. Dia juga meminta kepada Allah Azza wa Jalla ketika selesai dari pembangunan masjid agar orang yang datang ke sini dengan satu motivasi yaitu sholat, agar semua kesalahannya dihapuskan hingga ia laksana bayi yang baru dilahirkan ibunya.\""
            },
            {
                "number": 686,
                "arab": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَأَبِي عَبْدِ اللَّهِ الْأَغَرِّ مَوْلَى الْجُهَنِيِّينَ وَكَانَا مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ يَقُولُصِوَاو فِي مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ مِنْ الْمَسَاجِدِ إِلَّا الْمَسْجِدَ الْحَرَامَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آخِرُ الْأَنْبِيَاءِ وَمَسْجِدُهُ آخِرُ الْمَسَاجِدِقَالَ أَبُو سَلَمَةَ وَأَبُو عَبْدِ اللَّهِ لَمْ نَشُكَّ أَنَّ أَبَا هُرَيْرَةَ كَانَ يَقُولُ عَنْ حَدِيثِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمُنِعْنَا أَنْ نَسْتَثْبِتَ أَبَا هُرَيْرَةَ فِي ذَلِكَ الْحَدِيثِ حَتَّى إِذَا تُوُفِّيَ أَبُو هُرَيْرَةَ ذَكَرْنَا ذَلِكَ وَتَلَاوَمْنَا أَنْ لَا نَكُونَ كَلَّمْنَا أَبَا هُرَيْرَةَ فِي ذَلِكَ حَتَّى يُسْنِدَهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَ سَمِعَهُ مِنْهُ فَبَيْنَا نَحْنُ عَلَى ذَلِكَ جَالَسْنَا عَبْدَ اللَّهِ بْنَ إِبْرَاهِيمَ بْنِ قَارِظٍ فَذَكَرْنَا ذَلِكَ الْحَدِيثَ وَالَّذِي فَرَّطْنَا فِيهِ مِنْ نَصِّ أَبِي هُرَيْرَةَ فَقَالَ لَنَا عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ أَشْهَدُ أَنِّي سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنِّي آخِرُ الْأَنْبِيَاءِ وَإِنَّهُ آخِرُ الْمَسَاجِدِ",
                "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid] dia berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Az-Zubaidi] dari [Az-Zuhri] dari [Abu Salamah bin 'Abdurrahman] dan [Abu 'Abdullah Al-Agharr] -budak Al Juhaniyyin dan keduanya termasuk sahabat Abu Hurairah- bahwasanya keduanya mendengar [Abu Hurairah] berkata; \"sholat di masjid Rasulullah Shallallahu'alaihi wasallam lebih utama daripada sholat seribu kali di masjid lain, kecuali Masjidil Haram. Rasulullah Shallallahu'alaihi wasallam adalah rasul terakhir dan masjidnya adalah masjid yang terakhir.\" Abu Salamah dan Abu Abdullah berkata, \"Kami tidak ragu bahwa Abu Hurairah mengatakan demikian dari hadis Rasulullah Shallallahu'alaihi wasallam, dan kami dilarang untuk mengecek kepada Abu Hurairah dalam hal hadis ini hingga beliau wafat baru kami sebutkan hadis ini. Kami saling mencela agar kami tidak berbicara kepada Abu Hurairah dalam hal itu, sehingga hadis tersebut disandarkan kepada Rasulullah Shallallahu'alaihi wasallam kendati dia memang mendengarnya dari Rasulullah Shallallahu'alaihi wasallam. Ketika dalam keadaan demikian tiba-tiba [Abdullah bin Ibrahim bin Qarizh] duduk bersama kami lalu menyebutkan hadis tersebut dari nash Abu Hurairah yang kami tinggalkan. dia berkata kepada kami, \"Aku bersaksi bahwa aku mendengar [Abu Hurairah] berkata, 'Rasulullah Shallallahu'alaihi wasallam bersabda, \"...Aku adalah nabi yang paling akhir, dan masjid tersebut juga masjid yang paling akhir.\""
            },
            {
                "number": 687,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari ['Abdullah bin Abu Bakr] dari ['Abbad bin Tamim] dari ['Abdullah bin Zaid] dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, \"Antara rumahku dan mimbarku adalah taman dari taman-taman yang ada di surga.\""
            },
            {
                "number": 688,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمِّارٍ الدُّهْنِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ قَوَائِمَ مِنْبَرِي هَذَا رَوَاتِبُ فِي الْجَنَّةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Ammar Ad-Duhni] dari [Abu Salamah] dari ['Ummu Salamah] bahwa Nabi Shallallahu'alaihi wasallam bersabda, \"Bumi (tanah) mimbarku ini akan berada (akan permanen dengan dipindahkan) di Surga.\""
            },
            {
                "number": 689,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ ابْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ قَالَتَمَارَى رَجُلَانِ فِي الْمَسْجِدِ الَّذِي أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ فَقَالَ رَجُلٌ هُوَ مَسْجِدُ قُبَاءَ وَقَالَ الْآخَرُ هُوَ مَسْجِدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ مَسْجِدِي هَذَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari ['Imran bin Abu Anas] dari [Ibnu Abu Sa'id Al-Khudri] dari [Bapaknya] dia berkata; \"Ada dua orang yang bertengkar tentang masjid yang pertama kali didirikan atas dasar takwa semenjak hari pertamanya dibangun. Salah seorang dari dua orang tersebut berkata, 'Masjid Quba. Yang lain berkata. Masjid Rasulullah Shallallahu'alaihi wasallam'. Lantas Rasulullah Shallallahu'alaihi wasallam bersabda: \"Masjidku ini.\""
            },
            {
                "number": 690,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِي قُبَاءَ رَاكِبًا وَمَاشِيًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari ['Abdullah bin Dinar] dari [Ibnu 'Umar] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam pernah datang ke Quba' dengan naik kendaraan dan jalan kaki.\""
            },
            {
                "number": 691,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مُجَمِّعُ بْنُ يَعْقُوبَ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الْكَرْمَانِيِّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ قَالَ قَالَ أَبِيقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ خَرَجَ حَتَّى يَأْتِيَ هَذَا الْمَسْجِدَ مَسْجِدَ قُبَاءَ فَصَلَّى فِيهِ كَانَ لَهُ عَدْلَ عُمْرَةٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Mujammi' bin Ya'qub] dari [Muhammad bin Sulaiman Al-Karmani] dia berkata; aku mendengar [Abu Umamah bin Sahl bin Hunaif] dia berkata; [Bapakku] berkata; \"Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa keluar hingga masjid ini, yakni masjid Quba ' lalu sholat di dalamnya, maka -pahalanya- sebanding dengan umrah.\""
            },
            {
                "number": 692,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ وَمَسْجِدِي هَذَا وَمَسْجِدِ الْأَقْصَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Rasulullah Shallallahu'alaihi wasallam, beliau Shallallahu'alaihi wasallam bersabda, \"Tidak dianjurkan mempersiapkan perjalanan untuk mengagungkan masjid khusus, kecuali ke tiga masjid, yaitu Masjidil Haram, Masjidku (Nabawi) ini, dan Masjidil Aqsha.\""
            },
            {
                "number": 693,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ مُلَازِمٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بَدْرٍ عَنْ قَيْسِ بْنِ طَلْقٍ عَنْ أَبِيهِ طَلْقِ بْنِ عَلِيٍّ قَالَخَرَجْنَا وَفْدًا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْنَاهُ وَصَلَّيْنَا مَعَهُ وَأَخْبَرْنَاهُ أَنَّ بِأَرْضِنَا بِيعَةً لَنَا فَاسْتَوْهَبْنَاهُ مِنْ فَضْلِ طَهُورِهِ فَدَعَا بِمَاءٍ فَتَوَضَّأَ وَتَمَضْمَضَ ثُمَّ صَبَّهُ فِي إِدَاوَةٍ وَأَمَرَنَا فَقَالَ اخْرُجُوا فَإِذَا أَتَيْتُمْ أَرْضَكُمْ فَاكْسِرُوا بِيعَتَكُمْ وَانْضَحُوا مَكَانَهَا بِهَذَا الْمَاءِ وَاتَّخِذُوهَا مَسْجِدًا قُلْنَا إِنَّ الْبَلَدَ بَعِيدٌ وَالْحَرَّ شَدِيدٌ وَالْمَاءَ يَنْشُفُ فَقَالَ مُدُّوهُ مِنْ الْمَاءِ فَإِنَّهُ لَا يَزِيدُهُ إِلَّا طِيبًا فَخَرَجْنَا حَتَّى قَدِمْنَا بَلَدَنَا فَكَسَرْنَا بِيعَتَنَا ثُمَّ نَضَحْنَا مَكَانَهَا وَاتَّخَذْنَاهَا مَسْجِدًا فَنَادَيْنَا فِيهِ بِالْأَذَانِ قَالَ وَالرَّاهِبُ رَجُلٌ مِنْ طَيِّئٍ فَلَمَّا سَمِعَ الْأَذَانَ قَالَ دَعْوَةُ حَقٍّ ثُمَّ اسْتَقْبَلَ تَلْعَةً مِنْ تِلَاعِنَا فَلَمْ نَرَهُ بَعْدُ",
                "id": "Telah mengabarkan kepada kami [Hunnad bin As-Sariy] dari [Mulazim] dia berkata; telah menceritakan kepadaku ['Abdullah bin Badr] dari [Qais bin Thalaq] dari Bapaknya [Thalaq bin 'Ali] dia berkata; \"Kami datang kepada Rasulullah Shallallahu'alaihi wasallam sebagai utusan, lalu kami berbaiat kepadanya dan sholat bersamanya. Aku kabarkan kepada Rasulullah Shallallahu'alaihi wasallam bahwa di daerah kami ada tempat ibadah (kuil) milik kita, maka aku hendak meminta sisa air bersucinya. Beliaupun meminta air lalu berwudhu dan berkumur, kemudian menuangkan air ke dalam ember dan menyuruh kami untuk mengambilnya. Beliau lalu bersabda, `Keluarlah (pulanglah) kalian. Bila telah sampai ke negeri kalian, maka hancurkan kuil itu dan siramlah Puing-puingnya dengan air ini, lalu jadikanlah sebagai masjid'. Kami berkata, \"Negeri kami jauh dan sangat panas sekali, sedangkan air ini akan mengering'. Rasulullah Shallallahu'alaihi wasallam bersabda. 'Perbanyaklah airnya. Air ini tidak akan menambah apa-apa kecuali kebaikan'. Kamipun keluar hingga ke negeri kami, lalu kami menghancurkan kuil itu dan menyiramkan air tersebut ke puing-puing bangunannya. Kemudian kami jadikan sebagai masjid dan kami mengumandangkan adzan.\" la berkata lagi, \"Pendetanya adalah laki-laki dari Thayyi'. Ketika mendengar adzan, ia berkata, `Ini dakwah yang hak'. Kemudian ia pergi ke tempat yang tinggi yang ada di daerah kami, dan kami tidak pernah melihatnya lagi setelah itu.\""
            },
            {
                "number": 694,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَبِي التَّيَّاحِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ فِي عُرْضِ الْمَدِيِنَةِ فِي حَيٍّ يُقَالُ لَهُمْ بَنُو عَمْرِو بْنِ عَوْفٍ فَأَقَامَ فِيهِمْ أَرْبَعَ عَشْرَةَ لَيْلَةً ثُمَّ أَرْسَلَ إِلَى مَلَإٍ مِنْ بَنِي النَّجَّارِ فَجَاءُوا مُتَقَلِّدِي سُيُوفِهِمْ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَاحِلَتِهِ وَأَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ رَدِيفَهُ وَمَلَأٌ مِنْ بَنِي النَّجَّارِ حَوْلَهُ حَتَّى أَلْقَى بِفِنَاءِ أَبِي أَيُّوبَ وَكَانَ يُصَلِّي حَيْثُ أَدْرَكَتْهُ الصَّلَاةُ فَيُصَلِّي فِي مَرَابِضِ الْغَنَمِ ثُمَّ أَمَرَ بِالْمَسْجِدِ فَأَرْسَلَ إِلَى مَلَإٍ مِنْ بَنِي النَّجَّارِ فَجَاءُوا فَقَالَ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ هَذَا قَالُوا وَاللَّهِ لَا نَطْلُبُ ثَمَنَهُ إِلَّا إِلَى اللَّهِ عَزَّ وَجَلَّ قَالَ أَنَسٌ وَكَانَتْ فِيهِ قُبُورُ الْمُشْرِكِينَ وَكَانَتْ فِيهِ خَرِبٌ وَكَانَ فِيهِ نَخْلٌ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقُبُورِ الْمُشْرِكِينَ فَنُبِشَتْ وَبِالنَّخْلِ فَقُطِعَتْ وَبِالْخَرِبِ فَسُوِّيَتْ فَصَفُّوا النَّخْلَ قِبْلَةَ الْمَسْجِدِ وَجَعَلُوا عِضَادَتَيْهِ الْحِجَارَةَ وَجَعَلُوا يَنْقُلُونَ الصَّخْرَ وَهُمْ يَرْتَجِزُونَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَهُمْ وَهُمْ يَقُولُونَ اللَّهُمَّ لَا خَيْرَ إِلَّا خَيْرُ الْآخِرَةِفَانْصُرْ الْأَنْصَارَ وَالْمُهَاجِرَةَ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Musa] dia berkata; telah menceritakan kepada kami ['Abdul Warits] dari [Abu At-Tayyah] dari [Anas bin Malik] dia berkata; Anas bin Malik, dia berkata, \"Ketika Rasulullah Shallallahu'alaihi wasallam datang ke Madinah, beliau singgah di tanah lapang di perkampungan yang dinamakan Bani Amru bin Auf. Beliau Shallallahu'alaihi wasallam tinggal selama empat belas hari. Kemudian beliau mengutus orang kepada pembesar Bani Najjar, lalu mereka datang dengan menghunus pedang-pedang mereka. Aku melihat Rasulullah Shallallahu'alaihi wasallam berada di atas unta kendaraannya dan Abu Bakar Radliyallahu'anhu naik di belakangnya, sedangkan pembesar Bani Najjar berada di sekelilingnya hingga beliau sampai ke pekarangan Abu Ayub, dan beliau Shallallahu'alaihi wasallam mengerjakan sholat kapansaja datang waktu sholat. Lantas beliau Shallallahu'alaihi wasallam mengerjakan sholat di tempat pengikatan kambing, dan beliau menyuruh untuk membuat masjid. Kemudian beliau mengirim orang ke pembesar Bani Najjar dan mereka pun datang, maka Rasulullah Shallallahu'alaihi wasallam bersabda kepada mereka, 'Wahai Bani Najjar, tentukan harga pekarangan ini? ' Mereka menjawab, 'Demi Allah, kami tidak menjualnya kecuali kepada Allah Azza wa Jalla'.\" Anas berkata, \"Dulu di tempat itu ada kuburan orang-orang musyrik, reruntuhan bangunan, dan pohon kurma. Rasulullah Shallallahu'alaihi wasallam menyuruh untuk membongkar kuburan orang-orang musyrik dan memotong pangkal pohon kurma, serta meratakan bekas bangunan. Lalu beliau menjadikan pohon kurma sebagai arah kiblat masjid dan sebuah batu besar sebagai dua batu masjid. Mulailah mereka memindahkan batu besar dengan kerja keras sambil mendendangkan lantunan syair -Sedang Rasulullah Shallallahu'alaihi wasallam bersama mereka- yang berbunyi: 'Ya Allah, tiada kebaikan yang lebih baik daripada kebaikan akhirat. Ya Allah, tolonglah orang-orang Anshar dan Muhajirin '.\""
            },
            {
                "number": 695,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ وَيُونُسَ قَالَا قَالَ الزُّهْرِيُّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ أَنَّ عَائِشَةَ وَابْنَ عَبَّاسٍ قَالَالَمَّا نُزِلَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ قَالَ وَهُوَ كَذَلِكَ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah bin Al-Mubarak] dari [Ma'mar] dan [Yunus] mereka berdua berkata; [Az-Zuhri] berkata; telah mengabarkan kepadaku ['ubaidhullah bin 'Abdullah] bahwasanya ['Aisyah] dan [Ibnu 'Abbas] berkata; \"Tatkala diturunkan kepada Rasulullah Shallallahu'alaihi wasallam penyakit yang mengakibatkan kematiannya maka beliau menutupkan kain di wajahnya. Ketika beliau tidak bisa keluar maka beliau membuka selimutnya dari wajahnya. Nabi Shallallahu'alaihi wasallam bersabda, 'Allah melaknat orang-orang Yahudi dan Nasrani yang telah menjadikan kuburan nabi-nabi mereka sebagai masjid '.\""
            },
            {
                "number": 696,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ قَالَ حَدَّثَنِي أَبِي عَنْ عَائِشَةَأَنَّ أُمَّ حَبِيبَةَ وَأُمَّ سَلَمَةَ ذَكَرَتَا كَنِيسَةً رَأَتَاهَا بِالْحَبَشَةِ فِيهَا تَصَاوِيرُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أُولَئِكَ إِذَا كَانَ فِيهِمْ الرَّجُلُ الصَّالِحُ فَمَاتَ بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا وَصَوَّرُوا تِيكِ الصُّوَرَ أُولَئِكَ شِرَارُ الْخَلْقِ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dia berkata; [bapakku] telah menceritakan kepadaku dari ['Aisyah] bahwa Ummu Habibah dan Ummu Salamah menceritakan tentang gereja yang dilihatnya di Habasyah, di dalamnya banyak terdapat gambar-gambar, lalu Rasulullah Shallallahu'alaihi wasallam bersabda, \"Jika di kalangan mereka ada seorang laki-laki shalih yang mati, mereka membangun masjid di atas kuburannya dan menggambar beberapa gambar. Mereka itulah seburuk-buruk makhluk di sisi Allah pada hari Kiamat.\""
            },
            {
                "number": 697,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ الْعَلَاءِ بْنِ جَارِيَةَ الثَّقَفِيُّ عَنْ أَبِي سَلَمَةَ هُوَ ابْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حِينَ يَخْرُجُ الرَّجُلُ مِنْ بَيْتِهِ إِلَى مَسْجِدِهِ فَرِجْلٌ تُكْتَبُ حَسَنَةً وَرِجْلٌ تَمْحُو سَيِّئَةً",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Ibnu Abu Dzi'b] dia berkata; telah menceritakan kepada kami [Al Aswad bin Al-'Alaa' bin Jariyah Ats-Tsaqafi] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah] dari Rasulullah Shallallahu'alaihi wasallam, beliau Shallallahu'alaihi wasallam bersabda \"Ketika seseorang keluar dari rumahnya menuju masjid, maka tiap langkah satu kakinya dicatat satu kebaikan dan dari kakinya yang satu lagi sebagai penghapus satu kejelekan.\""
            },
            {
                "number": 698,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَأْذَنَتْ امْرَأَةُ أَحَدِكُمْ إِلَى الْمَسْجِدِ فَلَا يَمْنَعْهَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Sufyan] dari [Az-Zuhri] dari [Salim] dari [bapaknya], dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, \"Apabila istri salah seorang dari kalian minta izin untuk ke masjid, janganlah ia mencegahnya.\""
            },
            {
                "number": 699,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنَا عَطَاءٌ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ قَالَ أَوَّلَ يَوْمٍ الثُّومِ ثُمَّ قَالَ الثُّومِ وَالْبَصَلِ وَالْكُرَّاثِ فَلَا يَقْرَبْنَا فِي مَسَاجِدِنَا فَإِنَّ الْمَلَائِكَةَ تَتَأَذَّى مِمَّا يَتَأَذَّى مِنْهُ الْإِنْسُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] dia berkata; telah menceritakan kepada kami ['Atha] dari [Jabir] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda, \"Barangsiapa makan dari pohon ini -beliau bersabda pada pagi hari--: bawang putih.\" Kemudian beliau bersabda, \"Bawang putih dan bawang merah, serta tumbuhan yang baunya sangat menyengat (seperti bawang), maka jangan mendekat ke masjid kami. Sesungguhnya malaikat merasa terganggu dari hal-hal yang manusia juga merasa terganggu karenanya.\""
            },
            {
                "number": 700,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَإِنَّكُمْ أَيُّهَا النَّاسُ تَأْكُلُونَ مِنْ شَجَرَتَيْنِ مَا أُرَاهُمَا إِلَّا خَبِيثَتَيْنِ هَذَا الْبَصَلُ وَالثُّومُ وَلَقَدْ رَأَيْتُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَجَدَ رِيحَهُمَا مِنْ الرَّجُلِ أَمَرَ بِهِ فَأُخْرِجَ إِلَى الْبَقِيعِ فَمَنْ أَكَلَهُمَا فَلْيُمِتْهُمَا طَبْخًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami [Hisyam] dia berkata; telah menceritakan kepada kami [Qatadah] dari [Salim bin Abu Ja'ad] dari [Ma'dan bin Abu Thalhah] dari [Umar bin Khaththab], dia berkata, \"Wahai manusia, kalian makan dari dua pohon ini, aku tidak berpendapat melainkan keduanya tidak menyedapkan, yang pertama bawang merah dan yang kedua bawang putih. Rasulullah Shallallahu'alaihi wasallam bila mencium bau keduanya dari seseorang maka beliau memerintahkan agar ia diasingkan di Baqi'. Siapa saja yang ingin memakannya maka hilangkan bau itu dengan memasaknya.\""
            },
            {
                "number": 701,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْلَى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الصُّبْحَ ثُمَّ دَخَلَ فِي الْمَكَانِ الَّذِي يُرِيدُ أَنْ يَعْتَكِفَ فِيهِ فَأَرَادَ أَنْ يَعْتَكِفَ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ فَأَمَرَ فَضُرِبَ لَهُ خِبَاءٌ وَأَمَرَتْ حَفْصَةُ فَضُرِبَ لَهَا خِبَاءٌ فَلَمَّا رَأَتْ زَيْنَبُ خِبَاءَهَا أَمَرَتْ فَضُرِبَ لَهَا خِبَاءٌ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ آلْبِرَّ تُرِدْنَ فَلَمْ يَعْتَكِفْ فِي رَمَضَانَ وَاعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ",
                "id": "Telah mengabarkan kepada kami [Abu Daud] dia berkata; telah menceritakan kepada kami [Ya'la] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Amrah] dari [Aisyah] dia berkata, \"Bila Rasulullah Shallallahu'alaihi wasallam hendak i'tikaf maka Beliau mengerjakan sholat Subuh, lalu masuk ke tempat yang biasa dia gunakan untuk i'tikaf. Ketika beliau hendak i'tikaf pada sepuluh terakhir dibulan Ramadhan, beliau menyuruh seseorang untuk membuatkan tenda baginya, dan Hafshah juga menyuruh demikian. Keduanya dibuatkan tenda. Ketika Zainab melihat tenda Hafshah, dia minta dibuatkan sebuah tenda untuk dirinya, lalu ia pun dibuatkan juga. Tatkala Rasulullah Shallallahu'alaihi wasallam melihat hal tersebut, beliau Shallallahu'alaihi wasallam bersabda, 'Apakah kalian menghendaki kebaikan? ' Lalu Rasulullah Shallallahu'alaihi wasallam tidak jadi i'tikaf dibulan Ramadhan, dan beri'tikaf pada sepuluh hari di bulan Syawal.\""
            },
            {
                "number": 702,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْأُصِيبَ سَعْدٌ يَوْمَ الْخَنْدَقِ رَمَاهُ رَجُلٌ مِنْ قُرَيْشٍ رَمْيَةً فِي الْأَكْحَلِ فَضَرَبَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْمَةً فِي الْمَسْجِدِ لِيَعُودَهُ مِنْ قَرِيبٍ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Abdullah bin Numair] dia berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Bapaknya] dari [Aisyah Radliyallahu'anha], dia berkata, \"Pada perang Khandaq Sa'ad terkena panah yang dibidikkan oleh orang Quraisy dibagian tengah mata yang berwarna hitam, maka Rasulullah Shallallahu'alaihi wasallam membuat tenda untuk dirinya, agar bisa menjenguknya dari dekat dengan mudah.\""
            },
            {
                "number": 703,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ أَنَّهُ سَمِعَ أَبَا قَتَادَةَ يَقُولُبَيْنَا نَحْنُ جُلُوسٌ فِي الْمَسْجِدِ إِذْ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْمِلُ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ بْنِ الرَّبِيعِ وَأُمُّهَا زَيْنَبُ بِنْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ صَبِيَّةٌ يَحْمِلُهَا فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ عَلَى عَاتِقِهِ يَضَعُهَا إِذَا رَكَعَ وَيُعِيدُهَا إِذَا قَامَ حَتَّى قَضَى صَلَاتَهُ يَفْعَلُ ذَلِكَ بِهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Sa'id bin Abu Sa'id] dari [Amr bin Sulaim Az-Zuraqi] bahwasannya dia mendengar [Abu Qatadah] dia berkata; \"Ketika kami sedang duduk-duduk di masjid, tiba-tiba Rasulullah Shallallahu'alaihi wasallam menemui kami dengan membawa Umamah bin Abu Ash bin Ar Rabi' -ibunya adalah Zainab binti Rasulullah Shallallahu'alaihi wasallam, dan dia (Umamah) masih kecil- lalu Rasulullah Shallallahu'alaihi wasallam sholat dan dia (Umamah) masih dalam gendongannya. Rasulullah Shallallahu'alaihi wasallam meletakkannya ketika beliau ruku' dan menggendongnya kembali ketika berdiri, hingga dia selesai sholatnya dengan melakukan hal seperti itu.\""
            },
            {
                "number": 704,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْلًا قِبَلَ نَجْدٍ فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ سَيِّدُ أَهْلِ الْيَمَامَةِ فَرُبِطَ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ مُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Sa'id bin Abu Sa'id] bahwasannya dia mendengar [Abu Hurairah] berkata; \"Rasulullah Shallallahu'alaihi wasallam mengirim pasukan berkuda ke arah Najed, lalu pasukan ini datang dengan membawa satu tahanan dari Bani Hanifah -yang bernama Tsumamah bin Utsal, tokoh penduduk Yamamah- lalu tahanan tersebut diikat disalah satu tiang masjid.\" Demikian redaksi ini secara ringkas."
            },
            {
                "number": 705,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud] dari [Ibnu Wahab] dia berkata; Telah mengabarkan kepadakku [Yunus] dari [Ibnu Syihab] dari [Ubaidillah bin Abdullah] dari [lbnu Abbas], bahwa Rasulullah Shallallahu'alaihi wasallam thawaf saat haji Wada' di atas untanya. Beliau mengistilami pojok Ka'bah dengan tongkat."
            },
            {
                "number": 706,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّحَلُّقِ يَوْمَ الْجُمُعَةِ قَبْلَ الصَّلَاةِ وَعَنْ الشِّرَاءِ وَالْبَيْعِ فِي الْمَسْجِدِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah mengabarkan kepadaku [Yahya bin Sa'id] dari [Ibnu 'Ajlan] dari [Amr bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Nabi Shallallahu'alaihi wasallam melarang mencukur rambut sebelum sholat Jum'at dan melarang jual-beli dalam masjid."
            },
            {
                "number": 707,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ تَنَاشُدِ الْأَشْعَارِ فِي الْمَسْجِدِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits bin Sa'ad] dari [Ibnu 'Ajlan] dari [Amr bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Nabi Shallallahu'alaihi wasallam melarang melantunkan syair dalam masjid."
            },
            {
                "number": 708,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَمَرَّ عُمَرُ بِحَسَّانَ بْنِ ثَابِتٍ وَهُوَ يُنْشِدُ فِي الْمَسْجِدِ فَلَحَظَ إِلَيْهِ فَقَالَ قَدْ أَنْشَدْتُ وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ ثُمَّ الْتَفَتَ إِلَى أَبِي هُرَيْرَةَ فَقَالَ أَسَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَجِبْ عَنِّي اللَّهُمَّ أَيِّدْهُ بِرُوحِ الْقُدُسِ قَالَ اللَّهُمَّ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dia berkata; \"Umar pernah melewati Hasan bin Tsabit yang sedang membaca syair di dalam masjid, maka Umar memperingatkannya. [Hasan] berkata, Aku pernah pernah membaca syair dalam masjid padahal orang yang lebih baik daripada kamu (maksudnya nabi shallallahu 'alaihi wasallam) berada di dalam masjid tersebut. Kemudian dia menoleh kepada [Abu Hurairah] sambil berkata, 'Apakah engkau mendengar Rasulullah Shallallahu'alaihi wasallam memohon Ya Allah, kabulkanlah untukku, kuatkanlah ia dengan Ruhul Qudus (Jibril). Maka Hasan menjawab, 'Ya Allah, benar'."
            },
            {
                "number": 709,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ أَبِي عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَجَاءَ رَجُلٌ يَنْشُدُ ضَالَّةً فِي الْمَسْجِدِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَجَدْتَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Wahab] dia berkata; telah menceritakan kepada kami [Muhammad bin Salamah] dari [Abu Abdurrahim] dia berkata; telah menceritakan kepadaku [Zaid bin Abu Unaisah] dari [Abu Zubair] dari [Jabir] dia berkata, \"Seorang laki-laki datang dengan mengumumkan barang yang hilang di masjid, lalu Rasulullah Shallallahu'alaihi wasallam bersabda kepadanya, \"Kiranya engkau tidak menemukannya.\""
            },
            {
                "number": 710,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ وَمُحَمَّدُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا سُفْيَانُ قَالَ قُلْتُ لِعَمْرٍو أَسَمِعْتَ جَابِرًا يَقُولُمَرَّ رَجُلٌ بِسِهَامٍ فِي الْمَسْجِدِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ بِنِصَالِهَا قَالَ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin Abdurrahman] dan [Muhammad bin Manshur] keduanya berkata; telah menceritakan kepada kami [Sufyan] dia berkata; \"Aku berkata kepada [Amru].\"Apakah engkau mendengar [Jabir] berkata, \"Ada seorang laki-laki lewat di masjid yang membawa anak panah, lalu Rasulullah Shallallahu'alaihi wasallam menegurnya, \"Tolong pegang kepala panahnya! ' dia menjawab, 'Ya'.\""
            },
            {
                "number": 711,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ قَالَدَخَلْتُ أَنَا وَعَلْقَمَةُ عَلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَقَالَ لَنَا أَصَلَّى هَؤُلَاءِ قُلْنَا لَا قَالَ قُومُوا فَصَلُّوا فَذَهَبْنَا لِنَقُومَ خَلْفَهُ فَجَعَلَ أَحَدَنَا عَنْ يَمِينِهِ وَالْآخَرَ عَنْ شِمَالِهِ فَصَلَّى بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ فَجَعَلَ إِذَا رَكَعَ شَبَّكَ بَيْنَ أَصَابِعِهِ وَجَعَلَهَا بَيْنَ رُكْبَتَيْهِ وَقَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَأَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ سُلَيْمَانَ قَالَ سَمِعْتُ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ عَنْ عَبْدِ اللَّهِ فَذَكَرَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Isa bin Yunus] dia berkata; telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari [Al Aswad] dia berkata; \"Aku dan [Alqamah] pernah datang kepada [Abdullah bin Mas'ud], lalu dia berkata kepada kami, 'Apakah kalian telah sholat? ' Kami menjawab, 'Belum'. la berkata lagi, 'Berdirilah dan sholatlah'. Lalu kami sholat di belakangnya, dan beliau menjadikan salah seorang dari kami di samping kanannya dan yang lain disamping kirinya. Kemudian ia sholat tanpa adzan dan iqamah. Setelah ia sholat, maka ia menjalin jari jemari tangannya dan meletakkannya di antara dua lututnya. Ia lalu berkata, 'Beginilah dahulu Rasulullah Shallallahu'alaihi wasallam melakukannya.\" Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [An-Nadlar] dia berkata; Telah memberitakan kepada kami [Syu'bah] dari [Sulaiman] dia berkata; \"Saya mendengar [Ibrahim] dari [AlQamah] dan [Al Aswad] dari [Abdullah] dia menyebutkan seperti Hadis diatas."
            },
            {
                "number": 712,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari [Abad bin Tamim] dari [Pamannya] bahwa dia pernah melihat Rasulullah Shallallahu'alaihi wasallam telentang di masjid dengan meletakkan salah satu kakinya di alas kaki yang lain."
            },
            {
                "number": 713,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّهُ كَانَ يَنَامُ وَهُوَ شَابٌّ عَزْبٌ لَا أَهْلَ لَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسْجِدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] dia berkata; Telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] bahwa ia pernah tidur di dalam masjid; dia pemuda lajang yang belum mempunyai istri. Pada masa Rasulullah Shallallahu'alaihi wasallam ia tidur di masjid Nabi Shallallahu'alaihi wasallam."
            },
            {
                "number": 714,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبُصَاقُ فِي الْمَسْجِدِ خَطِيئَةٌ وَكَفَّارَتُهَا دَفْنُهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas bin Malik], dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Meludah di dalam masjid merupakan suatu kesalahan, dan kafaratnya (tebusannya) adalah menimbunnya.\""
            },
            {
                "number": 715,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى بُصَاقًا فِي جِدَارِ الْقِبْلَةِ فَحَكَّهُ ثُمَّ أَقْبَلَ عَلَى النَّاسِ فَقَالَ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَبْصُقَنَّ قِبَلَ وَجْهِهِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قِبَلَ وَجْهِهِ إِذَا صَلَّى",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah Shallallahu'alaihi wasallam melihat ludah di tembok arah kiblat, maka beliau mengeroknya kemudian menghadap manusia dan berkata, \"Apabila salah seorang dari kalian sholat, jangan meludah\/berdahak di hadapannya, sesungguhnya Allah Azza wa Jalla berada di arah wajahnya ketika ia sholat.\""
            },
            {
                "number": 716,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ فَحَكَّهَا بِحَصَاةٍ وَنَهَى أَنْ يَبْصُقَ الرَّجُلُ بَيْنَ يَدَيْهِ أَوْ عَنْ يَمِينِهِ وَقَالَ يَبْصُقُ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ الْيُسْرَى",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az-Zuhri] dari [Humaid bin Abdurrahman] dari [Abu Sa'id Al Khurdri] bahwa Nabi Shallallahu'alaihi wasallam melihat dahak di tembok bagian arah kiblat masjid, maka beliau mengeroknya dengan batu kecil dan melarang untuk meludah di depan atau di samping kanannya. Beliau bersabda, \"Hendaklah ia meludah ke arah kiri atau bawah telapak kaki kirinya.\""
            },
            {
                "number": 717,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ رِبْعِيٍّ عَنْ طَارِقِ بْنِ عَبْدِ اللَّهِ الْمُحَارِبِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنْتَ تُصَلِّي فَلَا تَبْزُقَنَّ بَيْنَ يَدَيْكَ وَلَا عَنْ يَمِينِكَ وَابْصُقْ خَلْفَكَ أَوْ تِلْقَاءَ شِمَالِكَ إِنْ كَانَ فَارِغًا وَإِلَّا فَهَكَذَا وَبَزَقَ تَحْتَ رِجْلِهِ وَدَلَكَهُ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya] dari [Sufyan] dia berkata; Telah mengabarkan kepadaku [Manshur] dari [Rib'i] dari [Thariq bin Abdullah Al Muharibi] dia berkata; dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, \"Bila kamu sedang sholat, jangan meludah di hadapanmu dan di sebelah kananmu. Meludahlah di belakang atau di samping kiri kamu jika dalam keadaan kosong. Tetapi jika tidak memungkinkan maka beginilah\" -lantas beliau berludah ke bawah telapak kakinya dan menggosoknya."
            },
            {
                "number": 718,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَنَخَّعَ فَدَلَكَهُ بِرِجْلِهِ الْيُسْرَى",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami [Abdullah] dari [Sa'id Al Jurairi] dari [Abul 'Alla bin As-Syakhir] dari [Bapaknya] dia berkata; \"Aku melihat Rasulullah Shallallahu'alaihi wasallam berdahak lalu menggosoknya dengan kaki kirinya.\""
            },
            {
                "number": 719,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَائِذُ بْنُ حَبِيبٍ قَالَ حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَرَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ فَغَضِبَ حَتَّى احْمَرَّ وَجْهُهُ فَقَامَتْ امْرَأَةٌ مِنْ الْأَنْصَارِ فَحَكَّتْهَا وَجَعَلَتْ مَكَانَهَا خَلُوقًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَحْسَنَ هَذَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami ['Aidz bin Habib] dia berkata; telah menceritakan kepada kami [Humaid At-Thawil] dari [Anas bin Malik] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam melihat dahak di arah kiblat masjid, maka beliau marah hingga memerah wajahnya, kemudian ada seorang perempuan Anshar yang bangkit untuk menggosoknya dan memberi wangi-wangian di bekas tempat ludah tadi. Rasulullah Shallallahu'alaihi wasallam lalu bersabda. 'Alangkah baiknya ini'.\""
            },
            {
                "number": 720,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ الْغَيْلَانِيُّ بَصْرِيٌّ قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا سُلَيْمَانُ عَنْ رَبِيعَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ قَالَ سَمِعْتُ أَبَا حُمَيْدٍ وَأَبَا أُسَيْدٍ يَقُولَانِقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلْيَقُلْ اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَإِذَا خَرَجَ فَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin ubaidhullah Al Ghailani Bashri] dia berkata; telah menceritakan kepada kami [Abu 'Amir] dia berkata; telah menceritakan kepada kami [Sulaiman] dari [Rabi'ah] dari [Abdul Malik bin Sa'id] dia berkata; saya mendengar [Abu Humaid] dan [Abu Usaid] keduanya berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian masuk ke dalam masjid, maka hendaklah mengucapkan, 'Ya Allah, bukakan bagiku pintu-pintu rahmat-Mu'. Jika keluar dari masjid, maka hendaklah mengucapkan, 'Ya Allah, aku memohon karunia-Mu'.\""
            },
            {
                "number": 721,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ أَبِي قَتَادَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Malik] dari [Amir bin Abdullah bin Jubair] dari [Amr bin Sulaim] dari [Abu Qatadah], bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian masuk masjid, hendaklah ia melakukan sholat dua rakaat sebelum duduk.\""
            },
            {
                "number": 722,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ كَعْبِ بْنِ مَالِكٍ أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ قَالَسَمِعْتُ كَعْبَ بْنَ مَالِكٍ يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ قَالَ وَصَبَّحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَادِمًا وَكَانَ إِذَا قَدِمَ مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَرَكَعَ فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ لِلنَّاسِ فَلَمَّا فَعَلَ ذَلِكَ جَاءَهُ الْمُخَلَّفُونَ فَطَفِقُوا يَعْتَذِرُونَ إِلَيْهِ وَيَحْلِفُونَ لَهُ وَكَانُوا بِضْعًا وَثَمَانِينَ رَجُلًا فَقَبِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَانِيَتَهُمْ وَبَايَعَهُمْ وَاسْتَغْفَرَ لَهُمْ وَوَكَلَ سَرَائِرَهُمْ إِلَى اللَّهِ عَزَّ وَجَلَّ حَتَّى جِئْتُ فَلَمَّا سَلَّمْتُ تَبَسَّمَ تَبَسُّمَ الْمُغْضَبِ ثُمَّ قَالَ تَعَالَ فَجِئْتُ حَتَّى جَلَسْتُ بَيْنَ يَدَيْهِ فَقَالَ لِي مَا خَلَّفَكَ أَلَمْ تَكُنِ ابْتَعْتَ ظَهْرَكَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي وَاللَّهِ لَوْ جَلَسْتُ عِنْدَ غَيْرِكَ مِنْ أَهْلِ الدُّنْيَا لَرَأَيْتُ أَنِّي سَأَخْرُجُ مِنْ سَخَطِهِ وَلَقَدْ أُعْطِيتُ جَدَلًا وَلَكِنْ وَاللَّهِ لَقَدْ عَلِمْتُ لَئِنْ حَدَّثْتُكَ الْيَوْمَ حَدِيثَ كَذِبٍ لِتَرْضَى بِهِ عَنِّي لَيُوشَكُ أَنَّ اللَّهَ عَزَّ وَجَلَّ يُسْخِطُكَ عَلَيَّ وَلَئِنْ حَدَّثْتُكَ حَدِيثَ صِدْقٍ تَجِدُ عَلَيَّ فِيهِ إِنِّي لَأَرْجُو فِيهِ عَفْوَ اللَّهِ وَاللَّهِ مَا كُنْتُ قَطُّ أَقْوَى وَلَا أَيْسَرَ مِنِّي حِينَ تَخَلَّفْتُ عَنْكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا هَذَا فَقَدْ صَدَقَ فَقُمْ حَتَّى يَقْضِيَ اللَّهُ فِيكَ فَقُمْتُ فَمَضَيْتُ مُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud] dia berkata; telah menceritakan kepada kami [Ibnu Wahab] dari [Yunus], [Ibnu Syihab] berkata; Telah mengabarkan kepadaku [Abdurrahman bin Ka'ab bin Malik] bahwa [Abdullah bin Ka'ab] berkata; \"Aku mendengar [Ka'ab bin Malik] menceritakan peristiwanya ketika tertinggal dalam perang Tabuk, dia berkata, 'Rasulullah Shallallahu'alaihi wasallam datang dengan wajah berseri-seri dan kebiasaan beliau jika datang dari perjalanan, beliau langsung ke masjid, lalu sholat dua rakaat. Kemudian duduk-duduk bersama para sahabat. Setelah beliau melakukan hal tersebut. datanglah orang-orang yang tertinggal (dari perang Tabuk ini). Mereka menyampaikan alasannya dan bersumpah kepadanya. Jumlah mereka ada sekitar delapan puluh lebih laki-laki. Rasulullah Shallallahu'alaihi wasallam menerima keterus terangan mereka, membai'atnya, memintakan ampun untuk mereka, serta menyerahkan rahasia (yang ada dalam hati mereka) kepada Allah Azza wa Jalla hingga kemudian aku datang. Setelah aku memberikan salam dan beliau tersenyum dengan senyuman orang yang marah, beliau Shallallahu'alaihi wasallam memanggilku, \"Kemarilah.\" Aku lalu mendekat dan duduk di hadapannya, lantas beliau bertanya lagi kepadaku, \"Apa yang menyebabkanmu tertinggal? Bukankah kamu telah membeli hewan tungganganmu?\" Aku menjawab, \"Wahai Rasulullah Shallallahu'alaihi wasallam, demi Allah, aku kalau duduk bersama selain dirimu dari penduduk bumi ini, pasti aku berkeyakinan bahwa aku bisa terbebas dari murkanya karena aku mempunyai kemampuan berdebat. Akan tetapi, demi Allah, aku mengetahui kalau aku pada hari ini menceritakan suatu cerita dusta agar engkau ridha kepadaku, pasti Allah menciptakan suatu hal yang menjadikan engkau marah kepadaku, sebaliknya seandainya aku ceritakan hal sebenarnya secara blak-blakan yang ada padaku, maka hal itu karena aku sangat mengharap ampunan Allah. Demi Allah, saat aku tertinggal dari engkau, belum pernah aku sekuat dan selapang saat itu.\" Lantas Rasulullah Shallallahu'alaihi wasallam bersabda.\"Orang ini berbuat jujur, hanya pergilah hingga Allah memutuskan perkaramu.\" Lalu aku berdiri dan pergi'.\" (Secara ringkas) "
            },
            {
                "number": 723,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ بْنِ أَعَيْنَ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ حَدَّثَنَا اللَّيْثُ قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ قَالَ أَخْبَرَنِي مَرْوَانُ بْنُ عُثْمَانَ أَنَّ عُبَيْدَ بْنَ حُنَيْنٍ أَخْبَرَهُ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى قَالَكُنَّا نَغْدُو إِلَى السُّوقِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَمُرُّ عَلَى الْمَسْجِدِ فَنُصَلِّي فِيهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Abdul Hakim bin A'ain] dia berkata; telah menceritakan kepada kami [Syu'aib] dia berkata; telah menceritakan kepada kami [Al Laits] dia berkata; telah menceritakan kepada kami [Khalid] dari [Ibnu Abu Hilal] dia berkata; Telah mengabarkan kepadaku [Marwan bin Utsman] bahwa [Ubaid bin Hunain] Telah mengabarkan kepadanya dari [Abu Sa'id bin Al Mu'lla] dia berkata; \"Pada masa Rasulullah Shallallahu'alaihi wasallam, kami pergi ke Pasar, kemudian kami melewati masjid dan sholat di dalamnya.\""
            },
            {
                "number": 724,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَلَائِكَةَ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلَّاهُ الَّذِي صَلَّى فِيهِ مَا لَمْ يُحْدِثْ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah], bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Para malaikat bershalawat (mendo'akan) kepada salah seorang dari kalian, selama masih di tempat sholatnya, selama belum batal. Para malaikat mendo'akan, 'Ya Allah, ampuni dan rahmatilah dia '.\""
            },
            {
                "number": 725,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرُ بْنُ مُضَرَ عَنْ عَيَّاشِ بْنِ عُقْبَةَ أَنَّ يَحْيَى بْنَ مَيْمُونٍ حَدَّثَهُ قَالَ سَمِعْتُ سَهْلًا السَّاعِدِيِّ رَضِيَ اللَّهُ عَنْهُ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلَاةَ فَهُوَ فِي الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Bakr bin Mudhar] dari ['Ayyasy bin 'Uqbah] bahwasanya [Yahya bin Maimun] telah menceritakan kepadanya, dia berkata; aku mendengar [Sahl Al Sa'idi Radliyallahu'anhu] dia berkata; \"Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: 'Barangsiapa menunggu waktu sholat di masjid, maka dia (pahalanya seperti) orang yang sedang sholat.\""
            },
            {
                "number": 726,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ أَشْعَثَ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ فِي أَعْطَانِ الْإِبِلِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dari [Asy'ats] dari [Al Hasan] dari [Abdullah bin Mughaffal] bahwa Rasulullah Shallallahu'alaihi wasallam melarang sholat di tempat peristirahatan unta. "
            },
            {
                "number": 727,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْمَعِيلَ بْنِ سُلَيْمَانَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ حَدَّثَنَا سَيَّارٌ عَنْ يَزِيدَ الْفَقِيرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جُعِلَتْ لِي الْأَرْضُ مَسْجِدًا وَطَهُورًا أَيْنَمَا أَدْرَكَ رَجُلٌ مِنْ أُمَّتِي الصَّلَاةَ صَلَّى",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Isma'il bin Sulaiman] dia berkata; telah menceritakan kepada kami [Husyaim] dia berkata; telah menceritakan kepada kami [Sayyar] dari [Yazid Al Faqir] dari [Jabir bin Abdullah] dia berkata; dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda, \"Bumi dijadikan untukku sebagai masjid dan alat untuk bersuci, maka di mana saja umatku mendapatkan waktu sholat maka hendaklah ia sholat.\""
            },
            {
                "number": 728,
                "arab": "أَخْبَرَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْأُمَوِيُّ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ أُمَّ سُلَيْمٍ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْتِيَهَا فَيُصَلِّيَ فِي بَيْتِهَا فَتَتَّخِذَهُ مُصَلًّى فَأَتَاهَا فَعَمِدَتْ إِلَى حَصِيرٍ فَنَضَحَتْهُ بِمَاءٍ فَصَلَّى عَلَيْهِ وَصَلَّوْا مَعَهُ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Yahya bin Sa'id Al Umawi] dia berkata; [bapakku] telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwasanya Ummu Sulaim pernah meminta Rasulullah Shallallahu'alaihi wasallam untuk datang kepadanya dan sholat di rumahnya, maka dia menyiapkan tempat sholat untuk Rasulullah Shallallahu'alaihi wasallam. Lalu Rasulullah datang kepada Ummu Sulaim, dan Ummu Sulaim segera menuju tikar, lalu menyiramnya dengan air, maka beliau sholat di atasnya dan mereka (keluarga Ummu Sulaim) sholat bersamanya."
            },
            {
                "number": 729,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ يَعْنِي الشَّيْبَانِيَّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ مَيْمُونَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي عَلَى الْخُمْرَةِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Sulaiman Asy Syaibani] dari [Abdullah bin Syaddad] dari [Maimunah] bahwa Rasulullah Shallallahu'alaihi wasallam pernah sholat di atas tikar kecil."
            },
            {
                "number": 730,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي أَبُو حَازِمِ بْنُ دِينَارٍأَنَّ رِجَالًا أَتَوْا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ وَقَدْ امْتَرَوْا فِي الْمِنْبَرِ مِمَّ عُودُهُ فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ وَاللَّهِ إِنِّي لَأَعْرِفُ مِمَّ هُوَ وَلَقَدْ رَأَيْتُهُ أَوَّلَ يَوْمٍ وُضِعَ وَأَوَّلَ يَوْمٍ جَلَسَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى فُلَانَةَ امْرَأَةٍ قَدْ سَمَّاهَا سَهْلٌ أَنْ مُرِي غُلَامَكِ النَّجَّارَ أَنْ يَعْمَلَ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ إِذَا كَلَّمْتُ النَّاسَ فَأَمَرَتْهُ فَعَمِلَهَا مِنْ طَرْفَاءِ الْغَابَةِ ثُمَّ جَاءَ بِهَا فَأُرْسِلَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهَا فَوُضِعَتْ هَا هُنَا ثُمَّ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَقِيَ فَصَلَّى عَلَيْهَا وَكَبَّرَ وَهُوَ عَلَيْهَا ثُمَّ رَكَعَ وَهُوَ عَلَيْهَا ثُمَّ نَزَلَ الْقَهْقَرَى فَسَجَدَ فِي أَصْلِ الْمِنْبَرِ ثُمَّ عَادَ فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّمَا صَنَعْتُ هَذَا لِتَأْتَمُّوا بِي وَلِتَعَلَّمُوا صَلَاتِي",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Ya'qub bin 'Abdurrahman] dia berkata; telah menceritakan kepadaku [Abu Hazim bin Dinar] bahwasanya beberapa orang laki-laki mendatangi Sahl bin Sa'd As-Sa'idi dan mereka berdebat tentang kayu yang digunakan untuk membuat mimbar; Mereka bertanya tentang hal itu. [Sahal bin Sa'ad] berkata, \"Demi Allah, aku mengetahui jenis kayu yang digunakan untuk membuat mimbar itu. Aku pernah melihat pada hari pembuatannya dan pada hari pertama Rasulullah Shallallahu'alaihi wasallam duduk di atasnya. Rasulullah Shallallahu'alaihi wasallam pernah mengutus seseorang kepada Fulanah -perempuan yang namanya disebutkan oleh Sahal- dan dikatakan kepadanya, 'Suruh budakmu si tukang kayu agar membuatkan kayu-kayu untuk tempat dudukku bila sedang berbicara dengan orang banyak'. Lalu perempuan itu menyuruhnya membuatnya dari kayu hutan. Kemudian orang ini membawanya kepada Rasulullah Shallallahu'alaihi wasallam, dan beliau Shallallahu'alaihi wasallam menyuruhnya meletakkannya di sini. Setelah itu aku melihat Rasulullah Shallallahu'alaihi wasallam naik ke atas mimbar tersebut lalu sholat di atasnya. Beliau bertakbir di atas mimbar kemudian ruku', juga masih di atasnya. Lantas beliau turun sambil mundur, kemudian sujud di dasar mimbar, dan kembali lagi. Setelah selesai sholat beliau menghadap kepada manusia dan bersabda, 'Wahai manusia, aku berbuat demikian agar kalian mengikutiku dan mempelajari sholatku '.\""
            },
            {
                "number": 731,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ ابْنِ عُمَرَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى حِمَارٍ وَهُوَ مُتَوَجِّهٌ إِلَى خَيْبَرَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari ['Amr bin Yahya] dari [Sa'id bin Yasar] dari [Ibnu 'Umar] dia berkata; \"Aku melihat Rasulullah Shallallahu'alaihi wasallam sholat di atas keledai saat beliau menuju Khaibar.\""
            },
            {
                "number": 732,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عُمَرَ قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى حِمَارٍ وَهُوَ رَاكِبٌ إِلَى خَيْبَرَ وَالْقِبْلَةُ خَلْفَهُقَالَ أَبُو عَبْد الرَّحْمَنِ لَا نَعْلَمُ أَحَدًا تَابَعَ عَمْرَو بْنَ يَحْيَى عَلَى قَوْلِهِ يُصَلِّي عَلَى حِمَارٍ وَحَدِيثُ يَحْيَى بْنِ سَعِيدٍ عَنْ أَنَسٍ الصَّوَابُ مَوْقُوفٌ وَاللَّهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Isma'il bin 'Umar] dia berkata; telah menceritakan kepada kami [Dawud bin Qais] dari [Muhammad bin 'Ajlan] dari [Yahya bin Sa'id] dari [Anas bin Malik] bahwa dia pernah melihat Rasulullah Shallallahu'alaihi wasallam sholat di atas keledai saat beliau mengendarainya ke arah Khaibar, sedangkan kiblat di belakangnya. Abu Abdurrahman berkata; kami tidak mengetahui seorangpun yang mengikuti Amr bin Yahya atas ucapannya \"Beliau sholat di atas keledai\" dan mengenai Hadis Yahya bin Sa'id yang benar adalah Hadisnya mauquf. Wallahu Subhanahu wa Ta'ala A'lam."
            },
            {
                "number": 733,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ الْأَزْرَقُ عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ فَصَلَّى نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا ثُمَّ وُجِّهَ إِلَى الْكَعْبَةِ فَمَرَّ رَجُلٌ قَدْ كَانَ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَوْمٍ مِنْ الْأَنْصَارِ فَقَالَ أَشْهَدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ وُجِّهَ إِلَى الْكَعْبَةِ فَانْحَرَفُوا إِلَى الْكَعْبَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] dia berkata; telah menceritakan kepada kami [Ishaq bin Yusuf Al Azraq] dari [Zakaria bin Abu Zaidah] dari [Abu Ishaq] dari [Al Barra bin 'Azib] dia berkata; -'Ketika Rasulullah Shallallahu'alaihi wasallam baru datang ke Madinah, beliau Shallallahu'alaihi wasallam sholat menghadap ke arah Baitul Maqdis sekitar enam belas bulan, lalu dialihkan ke kiblat (Ka'bah). Ada seseorang yang (selesai sholat bersama Rasulullah Shallallahu'alaihi wasallam) melewati sekelompok kalangan Anshar, kemudian ia berkata, 'Aku menyaksikan Rasulullah Shallallahu'alaihi wasallam telah dialihkan kiblatnya ke Ka'bah'. Lalu orang-orang segera beralih ke Ka' bah.\""
            },
            {
                "number": 734,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى رَاحِلَتِهِ فِي السَّفَرِ حَيْثُمَا تَوَجَّهَتْقَالَ مَالِكٌ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik bin Anas] dari [Abdullah bin Dinar] dari [Ibnu 'Umar] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam sholat di atas kendaraannya dalam suatu perjalanan. Beliau menghadap ke arah kendaraannya mengarah.\" Malik berkata; Abdullah bin Dinar berkata; \"Dahulu Ibnu Umar juga melakukan hal yang sama.\""
            },
            {
                "number": 735,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى الرَّاحِلَةِ قِبَلَ أَيِّ وَجْهٍ تَوَجَّهُ بِهِ وَيُوتِرُ عَلَيْهَا غَيْرَ أَنَّهُ لَا يُصَلِّي عَلَيْهَا الْمَكْتُوبَةَ",
                "id": "Telah mengabarkan kepada kami ['Isa bin Hammad] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim] dari [Abdullah] dia berkata; \"'Rasulullah Shallallahu'alaihi wasallam sholat di atas hewan kendaraannya menghadap mana saja hewan tunggangannya mengarah. la juga mengerjakan sholat witir di atas kendaraannya, tetapi beliau tidak mengerjakan sholat wajib di atas kendaraannya.\""
            },
            {
                "number": 736,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَبَيْنَمَا النَّاسُ بِقُبَاءَ فِي صَلَاةِ الصُّبْحِ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْقِبْلَةَ فَاسْتَقْبِلُوهَا وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّامِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Abdullah bin Dinar] dari [Ibnu 'Umar] dia berkata, \"Tatkala orang-orang berada di Quba' saat sholat Subuh, datang seseorang lalu berkata, 'Rasulullah Shallallahu'alaihi wasallam pada malam ini mendapat wahyu, beliau diperintahkan menghadap ke Ka'bah'. Mereka pun segera beralih ke Ka'bah, padahal sebelumnya wajah-wajah mereka menghadap ke Syam (Baitul Maqdis) '.\""
            },
            {
                "number": 737,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ عَنْ سُتْرَةِ الْمُصَلِّي فَقَالَ مِثْلُ مُؤْخِرَةِ الرَّحْلِ",
                "id": "Telah mengabarkan kepada kami [Al 'Abbas bin Muhammad Abdullah-Duriy] dia berkata; telah menceritakan kepada kami [Abdullah bin Yazid] dia berkata; telah menceritakan kepada kami [Haiwah bin Syuraih] dari [Abul Aswad] dari ['Urwah] dari ['Aisyah Radliyallahu'anha], dia berkata, 'Rasulullah Shallallahu'alaihi wasallam pernah ditanya saat perang Tabuk tentang sutrah (pembatas) bagi orang yang sedang sholat, lalu beliau Shallallahu'alaihi wasallam menjawab, `Seperti kayu yang dijadikan sandaran di belakang pelana'.\""
            },
            {
                "number": 738,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَنْبَأَنَا نَافِعٌ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ يَرْكُزُ الْحَرْبَةَ ثُمَّ يُصَلِّي إِلَيْهَا",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] dia berkata; telah memberitakan kepada kami [Nafi'] dari [Ibnu 'Umar] dari Rasulullah Shallallahu'alaihi wasallam, beliau bersabda, \"Beliau dahulu (kalau hendak sholat) menancapkan tombak pendek, lalu sholat di belakang (menghadap) tombak tersebut.\""
            },
            {
                "number": 739,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ إِلَى سُتْرَةٍ فَلْيَدْنُ مِنْهَا لَا يَقْطَعَ الشَّيْطَانُ عَلَيْهِ صَلَاتَهُ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dan [Ishaq bin Manshur] mereka berdua berkata; telah menceritakan kepada kami [Sufyan] dari [Shafwan bin Sulaim] dari [Nafi' bin Jubair] dari [Sahl bin Abu Hatsmah] dia berkata; bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika salah seorang dari kalian sholat menghadap ke arah Sutrah (pembatas) maka mendekatlah kepadanya, agar setan tidak memutus sholatnya.\""
            },
            {
                "number": 740,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَبِلَالٌ وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ فَأَغْلَقَهَا عَلَيْهِ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَسَأَلْتُ بِلَالًا حِينَ خَرَجَ مَاذَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَعَلَ عَمُودًا عَنْ يَسَارِهِ وَعَمُودَيْنِ عَنْ يَمِينِهِ وَثَلَاثَةَ أَعْمِدَةٍ وَرَاءَهُ وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ ثُمَّ صَلَّى وَجَعَلَ بَيْنَهُ وَبَيْنَ الْجِدَارِ نَحْوًا مِنْ ثَلَاثَةِ أَذْرُعٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] telah dibacakan kepadanya dan aku mendengarnya dari [Ibnul Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Abdullah bin 'Umar] bahwa Rasulullah Shallallahu'alaihi wasallam pernah masuk Ka'bah bersama Usamah bin Zaid, Bilal dan Utsman bin Thalhah. lalu mereka menutupnya. Ibnu Umar berkata, \"Lalu aku bertanya kepada [Bilal]. 'Apakah yang diperbuat oleh Rasulullah Shallallahu'alaihi wasallam? ' la menjawab, 'Beliau Shallallahu'alaihi wasallam memposisikan satu tiang di samping kiri, dua tiang di samping kanannya, dan tiga tiang di belakangnya. Ka'bah saat itu mempunyai enam tiang. Kemudian beliau Shallallahu'alaihi wasallam sholat, dan diantara beliau dengan tembok jaraknya sekitar 3 hasta'.\""
            },
            {
                "number": 741,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ أَنْبَأَنَا يَزِيدُ قَالَ حَدَّثَنَا يُونُسُ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ أَحَدُكُمْ قَائِمًا يُصَلِّي فَإِنَّهُ يَسْتُرُهُ إِذَا كَانَ بَيْنَ يَدَيْهِ مِثْلُ آخِرَةِ الرَّحْلِ فَإِنْ لَمْ يَكُنْ بَيْنَ يَدَيْهِ مِثْلُ آخِرَةِ الرَّحْلِ فَإِنَّهُ يَقْطَعُ صَلَاتَهُ الْمَرْأَةُ وَالْحِمَارُ وَالْكَلْبُ الْأَسْوَدُ قُلْتُ مَا بَالُ الْأَسْوَدِ مِنْ الْأَصْفَرِ مِنْ الْأَحْمَرِ فَقَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا سَأَلْتَنِي فَقَالَ الْكَلْبُ الْأَسْوَدُ شَيْطَانٌ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah memberitakan kepada kami [Yazid] dia berkata; telah menceritakan kepada kami [Yunus] dari [Humaid bin Hilal] dari [Abdullah bin Ash-Shamit] dari [Abu Dzarr] dia berkata; Apabila salah seorang diantara kalian sholat, hendaknya dia membuat pembatas di hadapannya seperti kayu yang dijadikan sandaran di belakang pelana. Karena kalau tidak ada pembatasnya, sholatnya akan terputus apabila lewat di hadapannya seorang perempuan, keledai dan anjing hitam. Lalu aku bertanya kepada Abu Dzar, kenapa yang berwarna hitam, bagaimana dengan warna kuning atau merah? Dia menjawab, \"Saya pernah bertanya kepada Rasulullah Shallallahu'alaihi wasallam sebagaimana yang anda tanyakan kepadaku, dan beliau Shallallahu'alaihi wasallam menjawab; Anjing hitam adalah setan.\""
            },
            {
                "number": 742,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنِي شُعْبَةُ وَهِشَامٌ عَنْ قَتَادَةَ قَالَقُلْتُ لِجَابِرِ بْنِ زَيْدٍ مَا يَقْطَعُ الصَّلَاةَ قَالَ كَانَ ابْنُ عَبَّاسٍ يَقُولُ الْمَرْأَةُ الْحَائِضُ وَالْكَلْبُقَالَ يَحْيَى رَفَعَهُ شُعْبَةُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepadaku [Syu'bah] dan [Hisyam] dari [Qatadah] dia berkata; aku bertanya kepada [Jabir bin Zaid] apa yang bisa memutus sholat? Dia menjawab, [Ibnu Abbas] pernah berkata; yang bisa memutus sholat adalah perempuan yang haidl, dan anjing. Yahya berkata; Hadis ini telah dimarfukan oleh Syu'bah."
            },
            {
                "number": 743,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنَا الزُّهْرِيُّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَجِئْتُ أَنَا وَالْفَضْلُ عَلَى أَتَانٍ لَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالنَّاسِ بِعَرَفَةَ ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا فَمَرَرْنَا عَلَى بَعْضِ الصَّفِّ فَنَزَلْنَا وَتَرَكْنَاهَا تَرْتَعُ فَلَمْ يَقُلْ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] dia berkata; telah menceritakan kepada kami [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['ubaidhullah] dari [Ibnu 'Abbas] dia berkata; \"Aku dan Fadl datang dengan naik keledai betina milik kami, dan saat itu Rasulullah Shallallahu'alaihi wasallam sedang sholat bersama orang-orang di Arafah -kemudian dia menyebutkan beberapa kalimat yang maknanya adalah- Maka kami melewati sebagian shaf sholat, lalu kami segera turun dan kami biarkan saja keledai itu makan rumput. Rasulullah Shallallahu'alaihi wasallam juga tidak menegur kami sedikitpun.\""
            },
            {
                "number": 744,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ عَنْ عَبَّاسِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ الْعَبَّاسِ قَالَزَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبَّاسًا فِي بَادِيَةٍ لَنَا وَلَنَا كُلَيْبَةٌ وَحِمَارَةٌ تَرْعَى فَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ وَهُمَا بَيْنَ يَدَيْهِ فَلَمْ يُزْجَرَا وَلَمْ يُؤَخَّرَا",
                "id": "Telah mengabarkan kepada kami ['Abdurrahman bin Khalid] dia berkata; telah menceritakan kepada kami [Hajjaj] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Muhammad bin 'Umar bin 'Ali] dari ['Abbas bin 'ubaidhullah bin 'Abbas] dari [Al Fadhl bin 'Abbas] dia berkata; Rasulullah Shallallahu'alaihi wasallam mengunjungi Abbas di kampung kami, dan kami memelihara seekor anjing kecil dan keledai. Lalu Rasulullah Shallallahu'alaihi wasallam sholat Ashar sedangkan dihadapannya anjing dan keledai itu, beliau tidak menghardiknya dan tidak pula menyuruhnya untuk mundur."
            },
            {
                "number": 745,
                "arab": "أَخْبَرَنَا أَبُو الْأَشْعَثِ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ أَنَّ الْحَكَمَ أَخْبَرَهُ قَالَ سَمِعْتُ يَحْيَى بْنَ الْجَزَّارِ يُحَدِّثُ عَنْ صُهَيْبٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يُحَدِّثُأَنَّهُ مَرَّ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ وَغُلَامٌ مِنْ بَنِي هَاشِمٍ عَلَى حِمَارٍ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَنَزَلُوا وَدَخَلُوا مَعَهُ فَصَلَّوْا وَلَمْ يَنْصَرِفْ فَجَاءَتْ جَارِيَتَانِ تَسْعَيَانِ مِنْ بَنِي عَبْدِ الْمُطَّلِبِ فَأَخَذَتَا بِرُكْبَتَيْهِ فَفَرَعَ بَيْنَهُمَا وَلَمْ يَنْصَرِفْ",
                "id": "Telah mengabarkan kepada kami [Abul Asy'ats] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] bahwasanya [Al Hakim] mengabarkan kepadanya, dia berkata; aku mendengar [Yahya bin Al Jazzar] menceritakan dari [Shuhaib] dia berkata; \"Aku mendengar [Ibnu Abbas] menceritakan bahwa ia pernah lewat di depan Rasulullah Shallallahu'alaihi wasallam bersama anak kecil dari Bani Hasyim dengan mengendarai seekor keledai. dan Rasulullah Shallallahu'alaihi wasallam saat itu sedang mengerjakan sholat. Lalu mereka turun dan masuk bersamanya, kemudian sholat dan beliau belum selesai. Kemudian datanglah dua anak perempuan dari Bani Abdul Muththalib, lantas keduanya berpegangan kedua lututnya, maka beliau Shallallahu'alaihi wasallam menghalangi keduanya dan beliau belum beranjak"
            }
        ]
    }
}