{
    "status": true,
    "data": {
        "start": 2087,
        "end": 2235,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 2087,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ أَبِي عَطِيَّةَ قَالَدَخَلْتُ أَنَا وَمَسْرُوقٌ عَلَى عَائِشَةَ فَقُلْنَا لَهَا يَا أُمَّ الْمُؤْمِنِينَ رَجُلَانِ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدُهُمَا يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ وَالْآخَرُ يُؤَخِّرُ الْإِفْطَارَ وَيُؤَخِّرُ الصَّلَاةَ فَقَالَتْ أَيُّهُمَا يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ قُلْنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ قَالَتْ هَكَذَا كَانَ يَصْنَعُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ أَبُو مُوسَى رَضِيَ اللَّهُ عَنْهُمَا",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Abu Mu'awiyah] dari [Al A'masy] dari ['Umarah] dari [Abu 'Athiyyah] dia berkata; aku dan Masruq masuk menemui ['Aisyah] lalu kami berkata kepadanya; \"Wahai Ummul Mukminin, ada dua sahabat Nabi shallallahu 'alaihi wasallam; salah seorang dari keduanya menyegerakan berbuka dan menyegerakan sholat, sedangkan yang lain mengakhirkan berbuka dan mengakhirkan sholat?\" Ia bertanya; \"Siapakah di antara keduanya yang menyegerakan berbuka dan menyegerakan sholat?\" kami menjawab; \"Abdullah bin Mas'ud.\" Aisyah berkata; \"Demikianlah Rasulullah shallallahu 'alaihi wasallam melakukannya. Sedangkan yang lain ialah Abu Musa -radliallahu 'anhuma-.\""
            },
            {
                "number": 2088,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْحَمِيدِ صَاحِبِ الزِّيَادِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُحَدِّثُ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَدَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَسَحَّرُ فَقَالَ إِنَّهَا بَرَكَةٌ أَعْطَاكُمْ اللَّهُ إِيَّاهَا فَلَا تَدَعُوهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah memberitakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Abdul Hamid] -sahabat Az Ziyadi- dia berkata; aku mendengar ['Abdullah bin Al Harits] menceritakan dari [seorang sahabat Nabi shallallahu 'alaihi wasallam]; Aku pernah masuk menemui Nabi shallallahu 'alaihi wasallam saat beliau sedang makan sahur, lalu beliau bersabda: \"Sesungguhnya itu adalah berkah yang Allah berikan kepada kalian, maka janganlah kalian meninggalkannya.\""
            },
            {
                "number": 2089,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ بَصْرِيٌّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ يُونُسَ بْنِ سَيْفٍ عَنْ الْحَارِثِ بْنِ زِيَادٍ عَنْ أَبِي رُهْمٍ عَنْ الْعِرْبَاضِ بْنِ سَارِيَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَدْعُو إِلَى السَّحُورِ فِي شَهْرِ رَمَضَانَ وَقَالَ هَلُمُّوا إِلَى الْغَدَاءِ الْمُبَارَكِ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf Al Bashri] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dari [Mu'awiyah bin Shalih] dari [Yunus bin Saif] dari [Al Harits bin Ziyad] dari [Abu Ruhm] dari [Al 'Irbadh bin Sariyah] dia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam di mana beliau mengajak makan sahur di bulan ramadhan, beliau bersabda: \"Kemarilah kalian menuju makan yang diberkahi.\""
            },
            {
                "number": 2090,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ بَقِيَّةَ بْنِ الْوَلِيدِ قَالَ أَخْبَرَنِي بَحِيرُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ الْمِقْدَامِ بْنِ مَعْدِ يكَرِبَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَيْكُمْ بِغَدَاءِ السُّحُورِ فَإِنَّهُ هُوَ الْغَدَاءُ الْمُبَارَكُ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Baqiyyah bin Al Walid] dia berkata; telah mengabarkan kepadaku [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Al Miqdam bin Ma'dikarib] dari Nabi bersabda: \"Hendaknya kalian makan sahur karena ia adalah makan yang diberkahi.\""
            },
            {
                "number": 2091,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ثَوْرٍ عَنْ خَالِدِ بْنِ مَعْدَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِرَجُلٍ هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ يَعْنِي السَّحُورَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Tsaur] dari [Khalid bin Ma'dan] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada seseorang, \"Kemarilah kamu menuju makan yang diberkahi.\" -yaitu; sahur.-"
            },
            {
                "number": 2092,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ مُوسَى بْنِ عُلَيٍّ عَنْ أَبِيهِ عَنْ أَبِي قَيْسٍ عَنْ عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فَصْلَ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السُّحُورِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Musa bin 'Ali] dari [bapaknya] dari [Abu Qais] dari ['Amru bin Al 'Ash] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perbedaan antara puasa kita dan puasa ahli kitab adalah makan sahur.\""
            },
            {
                "number": 2093,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَلِكَ عِنْدَ السُّحُورِ يَا أَنَسُ إِنِّي أُرِيدُ الصِّيَامَ أَطْعِمْنِي شَيْئًا فَأَتَيْتُهُ بِتَمْرٍ وَإِنَاءٍ فِيهِ مَاءٌ وَذَلِكَ بَعْدَ مَا أَذَّنَ بِلَالٌ فَقَالَ يَا أَنَسُ انْظُرْ رَجُلًا يَأْكُلْ مَعِي فَدَعَوْتُ زَيْدَ بْنَ ثَابِتٍ فَجَاءَ فَقَالَ إِنِّي قَدْ شَرِبْتُ شَرْبَةَ سَوِيقٍ وَأَنَا أُرِيدُ الصِّيَامَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أُرِيدُ الصِّيَامَ فَتَسَحَّرَ مَعَهُ ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdurrazzaq] dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Qatadah] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda -ketika sahur-: \"Wahai Anas, aku ingin berpuasa, berilah sedikit makanan.\" Lalu aku datang dengan membawa kurma dan wadah yang berisi air -yaitu setelah Bilal adzan-. Lalu beliau bersabda: \"Wahai Anas, lihatlah seorang yang -mau- makan bersamaku.\" Maka aku memenggil Zaid bin Tsabit, lalu ia datang dan berkata; \"Aku sudah minum seteguk minuman yang terbuat dari tepung dan aku ingin berpuasa.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku juga ingin berpuasa.\" Lalu beliau sahur bersamanya, kemudian berdiri lalu sholat dua rakaat, kemudian keluar untuk melaksanakan sholat.\""
            },
            {
                "number": 2094,
                "arab": "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ بْنِ هِلَالٍ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ الْبَرَاءِ بْنِ عَازِبٍأَنَّ أَحَدَهُمْ كَانَ إِذَا نَامَ قَبْلَ أَنْ يَتَعَشَّى لَمْ يَحِلَّ لَهُ أَنْ يَأْكُلَ شَيْئًا وَلَا يَشْرَبَ لَيْلَتَهُ وَيَوْمَهُ مِنْ الْغَدِ حَتَّى تَغْرُبَ الشَّمْسُ حَتَّى نَزَلَتْ هَذِهِ الْآيَةُ{ وَكُلُوا وَاشْرَبُوا إِلَى الْخَيْطِ الْأَسْوَدِ }قَالَ وَنَزَلَتْ فِي أَبِي قَيْسِ بْنِ عَمْرٍو أَتَى أَهْلَهُ وَهُوَ صَائِمٌ بَعْدَ الْمَغْرِبِ فَقَالَ هَلْ مِنْ شَيْءٍ فَقَالَتْ امْرَأَتُهُ مَا عِنْدَنَا شَيْءٌ وَلَكِنْ أَخْرُجُ أَلْتَمِسُ لَكَ عَشَاءً فَخَرَجَتْ وَوَضَعَ رَأْسَهُ فَنَامَ فَرَجَعَتْ إِلَيْهِ فَوَجَدَتْهُ نَائِمًا وَأَيْقَظَتْهُ فَلَمْ يَطْعَمْ شَيْئًا وَبَاتَ وَأَصْبَحَ صَائِمًا حَتَّى انْتَصَفَ النَّهَارُ فَغُشِيَ عَلَيْهِ وَذَلِكَ قَبْلَ أَنْ تَنْزِلَ هَذِهِ الْآيَةُ فَأَنْزَلَ اللَّهُ فِيهِ",
                "id": "Telah mengabarkan kepadaku [Hilal bin Al 'Ala bin Hilal] dia berkata; telah menceritakan kepada kami [Husain bin 'Ayyasy] dia berkata; telah menceritakan kepada kami [Zuhair] dia berkata; telah menceritakan kepada kami [Abu Ishaq] dari [Al Barra' bin 'Azib] bahwa salah seorang dari mereka jika tidur sebelum makan malam, maka tidak boleh baginya makan apapun, dan tidak boleh minum pada malam itu serta pada hari itu, mulai pagi sampai matahari terbenam. Hingga turun ayat ini: \"Dan makan serta minumlah.\" Sampai firman Allah \"benang hitam.\" Dia mengatakan; \"Ayat ini turun berkenaan dengan masalah Abu Qais bin Amru, saat ia menemui istrinya setelah maghrib, sedangkan ia dalam keadaan berpuasa, lalu ia bertanya; \"Apakah ada sesuatu?\" Istrinya menjawab; \"Kita tidak memiliki apa-apa, tetapi aku keluar mencari makan malam untukmu\", lalu ia keluar, sementara Abu Qais merebahkan kepalanya lalu tidur. Kemudian istrinya pulang dan mendapatinya sedang tidur, lalu ia membangunkannya, namun ia tidak makan sedikitpun, ia melalui waktu malam dan pagi dalam keadaan berpuasa, hingga pertengahan siang, lalu ia pingsan. Kejadian tersebut sebelum ayat ini turun, lalu Allah menurunkan ayat tersebut tentang dirinya.\""
            },
            {
                "number": 2095,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ تَعَالَى{ حَتَّى يَتَبَيَّنَ لَكُمْ الْخَيْطُ الْأَبْيَضُ مِنْ الْخَيْطِ الْأَسْوَدِ }قَالَ هُوَ سَوَادُ اللَّيْلِ وَبَيَاضُ النَّهَارِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Jarir] dari [Mutharrif] dari [Asy Sya'bi] dari ['Adi bin Hatim] bahwa ia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang firman Allah Ta'ala: \" Hingga terang bagimu benang putih dan benang hitam.\" (Qs. Al Baqarah 2: 187) Beliau bersabda: \"Yaitu hitamnya malam dan putihnya siang.\""
            },
            {
                "number": 2096,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ عَنْ ابْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بِلَالًا يُؤَذِّنُ بِلَيْلٍ لِيُنَبِّهَ نَائِمَكُمْ وَيُرْجِعَ قَائِمَكُمْ وَلَيْسَ الْفَجْرُ أَنْ يَقُولَ هَكَذَا وَأَشَارَ بِكَفِّهِ وَلَكِنْ الْفَجْرُ أَنْ يَقُولَ هَكَذَا وَأَشَارَ بِالسَّبَّابَتَيْنِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [At Taimi] dari [Abu 'Utsman] dari [Ibnu Mas'ud] dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Bilal adzan di waktu malam untuk membangunkan orang yang tidur di antara kalian, dan mengembalikan orang yang sedang sholat di antara kalian -agar beristirahat dan mempersiapkan segala sesuatu sebelum masuknya waktu fajar-. Saat fajar bukanlah mengatakan begini -beliau mengisyaratkan dengan telapak tangannya, sebab kemunculan fajar tidak seperti itu- tetapi waktu fajar ialah dengan mengatakan begini -beliau mengisyaratkan dengan dua jari telunjuk-.\""
            },
            {
                "number": 2097,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ أَنْبَأَنَا سَوَادَةُ بْنُ حَنْظَلَةَ قَالَ سَمِعْتُ سَمُرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغُرَّنَّكُمْ أَذَانُ بِلَالٍ وَلَا هَذَا الْبَيَاضُ حَتَّى يَنْفَجِرَ الْفَجْرُ هَكَذَا وَهَكَذَا يَعْنِي مُعْتَرِضًاقَالَ أَبُو دَاوُدَ وَبَسَطَ بِيَدَيْهِ يَمِينًا وَشِمَالًا مَادًّا يَدَيْهِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Abu Dawud] dia berkata; telah menceritakan kepada kami [Syu'bah]; telah memberitakan kepada kami [Sawadah bin Hanzhalah] dia berkata; aku mendengar [Samurah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian tertipu adzan Bilal dan juga warna putih ini, hingga fajar bersinar begini dan begini.\" Artinya: cahaya yang melintang.\" Abu Daud (salah seorang perawi hadits ini) berkata: \"Dan beliau membentangkan kedua tangannya ke arah kanan dan ke arah kiri dengan memenjangkan kedua tangannya.\""
            },
            {
                "number": 2098,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقَدَّمُوا قَبْلَ الشَّهْرِ بِصِيَامٍ إِلَّا رَجُلٌ كَانَ يَصُومُ صِيَامًا أَتَى ذَلِكَ الْيَوْمُ عَلَى صِيَامِهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Al Walid] dari [Al Auza'i] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian mendahului dengan berpuasa sebelum bulan (ramadhan), kecuali orang yang biasa berpuasa dan hari itu bertepatan dengan waktu puasanya.\""
            },
            {
                "number": 2099,
                "arab": "أَخْبَرَنِي عِمْرَانُ بْنُ يَزِيدَ بْنِ خَالِدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ قَالَ أَنْبَأَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى قَالَ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ أَخْبَرَنِي أَبُو هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَتَقَدَّمَنَّ أَحَدٌ الشَّهْرَ بِيَوْمٍ وَلَا يَوْمَيْنِ إِلَّا أَحَدٌ كَانَ يَصُومُ صِيَامًا قَبْلَهُ فَلْيَصُمْهُ",
                "id": "Telah mengabarkan kepadaku ['Imran bin Yazid bin Khalid] dia berkata; telah menceritakan kepada kami [Muhammad bin Syu'aib] dia berkata; telah memberitakan kepada kami [Al Auza'i] dari [Yahya] dia berkata; telah menceritakan kepadaku [Abu Salamah] dia berkata; telah mengabarkan kepadaku [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali seseorang mendahului bulan (ramadhan) dengan (berpuasa) sehari dan tidak pula dua hari, kecuali seseorang yang biasa berpuasa sebelumnya, maka berpuasalah.\""
            },
            {
                "number": 2100,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَتَقَدَّمُوا الشَّهْرَ بِصِيَامِ يَوْمٍ أَوْ يَوْمَيْنِ إِلَّا أَنْ يُوَافِقَ ذَلِكَ يَوْمًا كَانَ يَصُومُهُ أَحَدُكُمْقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala] dia berkata; telah menceritakan kepada kami [Abu Khalid] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mendahului bulan ramadhan dengan puasa sehari atau dua hari kecuali jika ia telah biasa berpuasa (sunnah) pada hari itu.\" Abdurrahman berkata ini adalah salah."
            },
            {
                "number": 2101,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ سَالِمٍ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلَّا أَنَّهُ كَانَ يَصِلُ شَعْبَانَ بِرَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf] dan [Muhammad bin Basysyar] -dan lafadz ini miliknya- mereka berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Salim] dari [Abu Salamah] dari [Ummu Salamah] dia berkata; \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam berpuasa dua bulan berturut-turut, hanya saja beliau menyambung bulan Sya'ban dengan ramadhan.\""
            },
            {
                "number": 2102,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ تَوْبَةَ الْعَنْبَرِيِّ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصِلُ شَعْبَانَ بِرَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [An Nadlr] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Taubah Al 'Anbari] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Ummu Salamah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menyambung bulan Sya'ban dengan ramadhan.\""
            },
            {
                "number": 2103,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ حَدَّثَهُ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِأَنَّهُ سَأَلَ عَائِشَةَ عَنْ صِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لَا يَصُومُ وَكَانَ يَصُومُ شَعْبَانَ أَوْ عَامَّةَ شَعْبَانَ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Usamah bin Zaid] bahwasanya [Muhammad bin Ibrahim] menceritakan kepadanya dari [Abu Salamah bin 'Abdurrahman] bahwasanya ia bertanya kepada ['Aisyah] tentang puasa Rasulullah shallallahu 'alaihi wasallam? Maka ia menjawab; \"Rasulullah shallallahu 'alaihi wasallam berpuasa hingga kami mengatakan; 'Beliau tidak pernah berbuka' dan beliau berbuka hingga kami mengatakan; 'Beliau tidak pernah berpuasa', beliau berpuasa pada satu bulan penuh di bulan Sya'ban atau kebanyakan pada bulan Sya'ban.\""
            },
            {
                "number": 2104,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سَعْدِ بْنِ الْحَكَمِ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا نَافِعُ بْنُ يَزِيدَ أَنَّ ابْنَ الْهَادِ حَدَّثَهُ أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ حَدَّثَهُ عَنْ أَبِي سَلَمَةَ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْلَقَدْ كَانَتْ إِحْدَانَا تُفْطِرُ فِي رَمَضَانَ فَمَا تَقْدِرُ عَلَى أَنْ تَقْضِيَ حَتَّى يَدْخُلَ شَعْبَانُ وَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ فِي شَهْرٍ مَا يَصُومُ فِي شَعْبَانَ كَانَ يَصُومُهُ كُلَّهُ إِلَّا قَلِيلًا بَلْ كَانَ يَصُومُهُ كُلَّهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sa'd bin Al Hakam] dia berkata; [pamanku] telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami [Nafi' bin Yazid], [Ibnul Had] menceritakan kepadanya, bahwasanya [Muhammad bin Ibrahim] menceritakan kepadanya dari [Abu Salamah bin 'Abdurrahman] dari ['Aisyah] dia berkata; \"Sungguh salah seorang dari kami pernah berbuka pada bulan ramadhan, kemudian tidak sanggup untuk mengqadhanya hingga masuk bulan Sya'ban. Rasulullah shallallahu 'alaihi wasallam tidak pernah berpuasa satu bulan penuh seperti pada bulan Sya'ban; beliau berpuasa semuanya (satu bulan penuh) kecuali hanya sedikit (beberapa hari); bahkan beliau pernah berpuasa semuanya (satu bulan penuh).\""
            },
            {
                "number": 2105,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي لَبِيدٍ عَنْ أَبِي سَلَمَةَ قَالَسَأَلْتُ عَائِشَةَ فَقُلْتُ أَخْبِرِينِي عَنْ صِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ يَصُومُ حَتَّى نَقُولَ قَدْ صَامَ وَيُفْطِرُ حَتَّى نَقُولَ قَدْ أَفْطَرَ وَلَمْ يَكُنْ يَصُومُ شَهْرًا أَكْثَرَ مِنْ شَعْبَانَ كَانَ يَصُومُ شَعْبَانَ إِلَّا قَلِيلًا كَانَ يَصُومُ شَعْبَانَ كُلَّهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Yazid] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Abdullah bin Abu Labid] dari [Abu Salamah] dia berkata; Aku bertanya kepada ['Aisyah], lalu aku katakana; \"Beritahukan kepadaku tentang puasa Rasulullah shallallahu 'alaihi wasallam?\" ia menjawab; \"Beliau berpuasa hingga kami katakan, 'Sungguh beliau -seakan-akan selalu- berpuasa dan beliau berbuka hingga kami katakan, 'Sungguh beliau -seakan-akan selalu- berbuka'. Dan beliau tidak pernah berpuasa selama satu bulan yang lebih banyak dari bulan Sya'ban; (pada satu tahun) beliau berpuasa penuh di bulan Sya'ban kecuali hanya sedikit (beberapa hari); -namun pada tahun yang lainnya- beliau berpuasa di bulan Sya'ban semuanya (sebulan penuh).\""
            },
            {
                "number": 2106,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْلَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَهْرٍ مِنْ السَّنَةِ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ كَانَ يَصُومُ شَعْبَانَ كُلَّهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Mu'adz bin Hisyam] dia berkata; [bapakku] telah menceritakan kepadaku dari [Yahya bin Abu Katsir] dia berkata; telah menceritakan kepadaku [Abu Salamah bin 'Abdurrahman] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah berpuasa satu bulan dalam satu tahun yang lebih banyak dari puasa beliau di bulan Sya'ban. Beliau berpuasa di bulan Sya'ban semuanya (sebulan penuh).\""
            },
            {
                "number": 2107,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ خَالِدِ بْنِ سَعْدٍ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَعْبَانَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami [Abu Dawud] dari [Sufyan] dari [Manshur] dari [Khalid bin Sa'd] dari ['Aisyah] dia berkata; \"Nabi shallallahu 'alaihi wasallam berpuasa di bulan Sya'ban.\""
            },
            {
                "number": 2108,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ عَنْ عَبْدَةَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْلَا أَعْلَمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا قَامَ لَيْلَةً حَتَّى الصَّبَاحِ وَلَا صَامَ شَهْرًا كَامِلًا قَطُّ غَيْرَ رَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Harun bin Ishaq] dari ['Abdah] dari [Sa'id] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari ['Aisyah] dia berkata; \"Aku tidak pernah mengetahui Rasulullah shallallahu 'alaihi wasallam membaca al-qur'an semuanya (seluruh al-qur'an) dalam satu malam, tidak pernah sholat malam hingga pagi dan tidak pula berpuasa satu bulan penuh sama sekali selain pada bulan ramadhan.\""
            },
            {
                "number": 2109,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي يُوسُفَ الصَّيْدَلَانِيُّ حَرَّانِيٌّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَسَأَلْتُهَا عَنْ صِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ قَدْ صَامَ وَيُفْطِرُ حَتَّى نَقُولَ قَدْ أَفْطَرَ وَلَمْ يَصُمْ شَهْرًا تَامًّا مُنْذُ أَتَى الْمَدِينَةَ إِلَّا أَنْ يَكُونَ رَمَضَانُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Yusuf Ash Shaidalani Al Harrani] dia berkata; telah menceritakan kepada kami [Muhammad bin Salamah] dari [Hisyam] dari [Ibnu Sirin] dari ['Abdullah bin Syaqiq] dari ['Aisyah] dia berkata; Aku pernah bertanya kepadanya tentang puasa Rasulullah shallallahu 'alaihi wasallam? ia menjawab; \"Rasulullah shallallahu 'alaihi wasallam berpuasa hingga kami katakan, 'Sungguh beliau -seakan-akan selalu- berpuasa' dan beliau berbuka hingga kami katakana; 'Sungguh beliau -seakan-akan selalu- berbuka'. Dan beliau tidak pernah berpuasa selama satu bulan penuh sejak beliau datang ke Madinah kecuali di bulan ramadhan.\""
            },
            {
                "number": 2110,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ أَنْبَأَنَا خَالِدٌ وَهُوَ ابْنُ الْحَارِثِ عَنْ كَهْمَسٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَقُلْتُ لِعَائِشَةَ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاةَ الضُّحَى قَالَتْ لَا إِلَّا أَنْ يَجِيءَ مِنْ مَغِيبِهِ قُلْتُ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَهْرًا كُلَّهُ قَالَتْ لَا مَا عَلِمْتُ صَامَ شَهْرًا كُلَّهُ إِلَّا رَمَضَانَ وَلَا أَفْطَرَ حَتَّى يَصُومَ مِنْهُ حَتَّى مَضَى لِسَبِيلِهِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah memberitakan kepada kami [Khalid bin Al Harits] dari [Kahmas] dari ['Abdullah bin Syaqiq] dia berkata; Aku pernah bertanya kepada [Aisyah]; \"Apakah Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat Dluha?\" Ia menjawab; \"Tidak, kecuali jika beliau datang dari bepergian.\" Aku bertanya; \"Apakah Rasulullah shallallahu 'alaihi wasallam berpuasa satu bulan penuh?\" Ia menjawab; \"Tidak, aku tidak pernah mengetahui beliau berpuasa satu bulan penuh kecuali di bulan ramadhan dan tidak pernah berbuka hingga berpuasa dari bulan itu sampai beliau melakukan pepergian.\""
            },
            {
                "number": 2111,
                "arab": "أَخْبَرَنَا أَبُو الْأَشْعَثِ عَنْ يَزِيدَ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَقُلْتُ لِعَائِشَةَ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاةَ الضُّحَى قَالَتْ لَا إِلَّا أَنْ يَجِيءَ مِنْ مَغِيبِهِ قُلْتُ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُ صَوْمٌ مَعْلُومٌ سِوَى رَمَضَانَ قَالَتْ وَاللَّهِ إِنْ صَامَ شَهْرًا مَعْلُومًا سِوَى رَمَضَانَ حَتَّى مَضَى لِوَجْهِهِ وَلَا أَفْطَرَ حَتَّى يَصُومَ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Abul Asy'ats] dari [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Al Jurairi] dari ['Abdullah bin Syaqiq] dia berkata; Aku berkata kepada ['Aisyah] dia berkata; Aku pernah bertanya kepada Aisyah; \"Apakah Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat Dluha?\" Ia menjawab; \"Tidak, kecuali jika ia datang dari bepergian.\" Aku bertanya; \"Apakah Rasulullah shallallahu 'alaihi wasallam memiliki puasa tertentu selain ramadhan?\" Ia menjawab; \"Demi Allah, beliau tidak pernah mengetahui beliau berpuasa tertentu selama satu bulan selain ramadhan, hingga berlalu dan tidak berbuka hingga beliau berpuasa dari bulan itu'.\""
            },
            {
                "number": 2112,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ عَنْ بَقِيَّةَ قَالَ حَدَّثَنَا بَحِيرٌ عَنْ خَالِدٍ عَنْ جُبَيْرِ بْنِ نُفَيْرٍأَنَّ رَجُلًا سَأَلَ عَائِشَةَ عَنْ الصِّيَامِ فَقَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ شَعْبَانَ كُلَّهُ وَيَتَحَرَّى صِيَامَ الِاثْنَيْنِ وَالْخَمِيسِ",
                "id": "Telah mengabarkan kepadaku ['Amr bin 'Utsman] dari [Baqiyyah] dia berkata; telah menceritakan kepada kami [Bahir] dari [Khalid] dari [Jubair bin Nufair] bahwasanya seorang lelaki bertanya kepada ['Aisyah] ia menjawab; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam berpuasa di bulan Sya'ban semuanya (satu bulan penuh) dan memilih berpuasa pada hari senin dan kamis.\""
            },
            {
                "number": 2113,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ قَالَ حَدَّثَنَا ثَوْرٌ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ رَبِيعَةَ الْجُرَشِيِّ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَعْبَانَ وَرَمَضَانَ وَيَتَحَرَّى الِاثْنَيْنِ وَالْخَمِيسَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami ['Abdullah bin Dawud] dia berkata; telah menceritakan kepada kami [Tsaur] dari [Khalid bin Ma'dan] dari [Rabi'ah Al Juraisyi] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam berpuasa di bulan Sya'ban dan ramadhan serta memilih berpuasa pada hari senin dan kamis.\""
            },
            {
                "number": 2114,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْأَشَجُّ عَنْ أَبِي خَالِدٍ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ أَبِي إِسْحَقَ عَنْ صِلَةَ قَالَكُنَّا عِنْدَ عَمَّارٍ فَأُتِيَ بِشَاةٍ مَصْلِيَّةٍ فَقَالَ كُلُوا فَتَنَحَّى بَعْضُ الْقَوْمِ قَالَ إِنِّي صَائِمٌ فَقَالَ عَمَّارٌ مَنْ صَامَ الْيَوْمَ الَّذِي يُشَكُّ فِيهِ فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Sa'id Al Asyja'i] dari [Abu Khalid] dari ['Amru bin Qais] dari [Abu Ishaq] dari [Shilah] dia berkata; kami berada di rumah Ammar, kemudian diberi kambing panggang, ia lalu berkata, \"Makanlah\", namun ada sebagian orang yang menjauh. Ia berkata, \"Aku sedang berpuasa.\" Maka [Ammar] berkata; \"Barangsiapa yang berpuasa di hari yang diragukan, maka sungguh ia telah mendurhakai Abul Qasim shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2115,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ أَبِي يُونُسَ عَنْ سِمَاكٍ قَالَدَخَلْتُ عَلَى عِكْرِمَةَ فِي يَوْمٍ قَدْ أُشْكِلَ مِنْ رَمَضَانَ هُوَ أَمْ مِنْ شَعْبَانَ وَهُوَ يَأْكُلُ خُبْزًا وَبَقْلًا وَلَبَنًا فَقَالَ لِي هَلُمَّ فَقُلْتُ إِنِّي صَائِمٌ قَالَ وَحَلَفَ بِاللَّهِ لَتُفْطِرَنَّ قُلْتُ سُبْحَانَ اللَّهِ مَرَّتَيْنِ فَلَمَّا رَأَيْتُهُ يَحْلِفُ لَا يَسْتَثْنِي تَقَدَّمْتُ قُلْتُ هَاتِ الْآنَ مَا عِنْدَكَ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ حَالَ بَيْنَكُمْ وَبَيْنَهُ سَحَابَةٌ أَوْ ظُلْمَةٌ فَأَكْمِلُوا الْعِدَّةَ عِدَّةَ شَعْبَانَ وَلَا تَسْتَقْبِلُوا الشَّهْرَ اسْتِقْبَالًا وَلَا تَصِلُوا رَمَضَانَ بِيَوْمٍ مِنْ شَعْبَانَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Ibnu 'Adi] dari [Abu Yunus] dari [Simak] dia berkata; aku masuk menemui ['Ikrimah] di hari yang dipermasalahkan, 'Apakah hari itu ia berada di bulan ramadhan atau masih berada di bulan Sya'ban?! ' Sementara saat ia sedang makan roti, sayur dan susu, lalu ia berkata kepadaku; \"Kemarilah.\" Aku berkata; \"Aku sedang berpuasa.\" Ia berkata dengan bersumpah atas nama Allah; sungguh kamu benar-benar akan berbuka.\" Aku berkata; \"Subhanallah\" -dua kali-, setelah aku melihatnya bersumpah dengan tidak ada pengecualian (tidak ada redaksi Insya Allah), maka aku maju seraya kukatakan; \"Sekarang berikan -hujjah- yang ada padamu!\" ia berkata; \"Aku mendengar [Ibnu Abbas] berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berpuasalah kalian karena melihatnya dan berbukalah karena melihatnya. Jika ada mendung atau gelap yang menghalangi antara kalian dan hilal, maka sempurnakanlah bilangan -bulan-, yaitu bilangan bulan Sya'ban. Dan janganlah kalian menghadap bulan (ramadhan) serta menyambung bulan ramadhan dengan satu hari dari bulan Sya'ban.\""
            },
            {
                "number": 2116,
                "arab": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ قَالَ أَخْبَرَنِي أَبِي عَنْ جَدِّي قَالَ أَخْبَرَنِي شُعَيْبُ بْنُ إِسْحَقَ عَنْ الْأَوْزَاعِيِّ وَابْنُ أَبِي عَرُوبَةَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ أَلَا لَا تَقَدَّمُوا الشَّهْرَ بِيَوْمٍ أَوْ اثْنَيْنِ إِلَّا رَجُلٌ كَانَ يَصُومُ صِيَامًا فَلْيَصُمْهُ",
                "id": "Telah mengabarkan kepada kami ['Abdul Malik bin Syu'aib bin Al Laits bin Sa'd] dia berkata; [bapakku] telah mengabarkan kepadaku dari [kakekku], dia berkata; telah mengabarkan kepadaku [Syu'aib bin Ishaq] dari [Al Auza'i] dan [Ibnu Abu 'Arubah] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Ketahuilah, janganlah kalian mendahului bulah (ramadhan) dengan berpuasa sehari atau dua hari, kecuali seseorang yang biasa berpuasa, maka hendaknya ia berpuasa.\""
            },
            {
                "number": 2117,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ أَنْبَأَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin 'Abdul Hakim] dari [Syu'aib] dari [Al Laits] dia berkata; telah memberitakan kepada kami [Khalid] dari [Ibnu Abu Hilal] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang melakukan qiyamullail dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2118,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ جَبَلَةَ قَالَ حَدَّثَنَا الْمُعَافَى قَالَ حَدَّثَنَا مُوسَى عَنْ إِسْحَقَ بْنِ رَاشِدٍ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُرَغِّبُ النَّاسَ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةِ أَمْرٍ فِيهِ فَيَقُولُ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Jabalah] dia berkata; telah menceritakan kepada kami [Al Mu'afa] dia berkata; telah menceritakan kepada kami [Musa] dari [Ishaq bin Rasyid] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari ['Aisyah] istri Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam menganjurkan manusia untuk melakukan qiyamullail di bulan ramadhan tanpa menyuruh mereka dengan perintah yang mengharuskan dalam hal itu, lalu bersabda: \"Barangsiapa yang melakukan qiyamullail dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2119,
                "arab": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ أَنْبَأَنَا إِسْحَقُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ عَنْ يُونُسَ الْأَيْلِيِّ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فِي جَوْفِ اللَّيْلِ يُصَلِّي فِي الْمَسْجِدِ فَصَلَّى بِالنَّاسِ وَسَاقَ الْحَدِيثَ وَفِيهِ قَالَتْ فَكَانَ يُرَغِّبُهُمْ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةٍ وَيَقُولُ مَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ قَالَ فَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْأَمْرُ عَلَى ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Zakaria bin Yahya] dia berkata; telah memberitakan kepada kami [Ishaq] dia berkata; telah memberitakan kepada kami ['Abdullah bin Al Harits] dari [Yunus Al Aili] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwasanya ['Aisyah] mengabarkan kepadanya; Rasulullah shallallahu 'alaihi wasallam keluar di tengah malam untuk melakukan sholat di masjid, lalu beliau sholat bersama orang banyak… dan ia menyebutkan hadits tersebut. Di dalamnya -terdapat redaksi-: Aisyah berkata; \"Beliau menganjurkan mereka untuk melakukan qiyamullail di bulan ramadhan tanpa menyuruh mereka dengan perintah yang mengharuskan dan bersabda: \"Barangsiapa yang melakukan qiyamullail pada malam lailatul Qadar dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\" Ia berkata; \"Lalu Rasulullah shallallahu 'alaihi wasallam wafat dan perintah tetap sepeti itu.\""
            },
            {
                "number": 2120,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ جَوْفِ اللَّيْلِ فَصَلَّى فِي الْمَسْجِدِ وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرَغِّبُهُمْ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةِ أَمْرٍ فِيهِ فَيَقُولُ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Khalid] dia berkata; telah menceritakan kepada kami [Bisyr bin Syu'aib] dari [bapaknya] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwasanya ['Aisyah] mengabarkan kepadanya; Rasulullah shallallahu 'alaihi wasallam keluar di tengah malam lalu beliau melakukan sholat di masjid… dan ia menyebutkan hadits. Di dalam hadits tersebut, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam menganjurkan mereka untuk melakukan qiyamullail di bulan ramadhan tanpa menyuruh mereka dengan perintah yang mengharuskan lalu bersabda: \"Barangsiapa yang melakukan qiyamullail pada malam lailatul Qadar di bulan ramadhan dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2121,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِرَمَضَانَ مَنْ قَامَهُ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Khalid] dia berkata; telah menceritakan kepada kami [Bisyr bin Syu'aib] dari [bapaknya] dari [Az Zuhri] dia berkata; telah menceritakan kepada kami [Abu Salamah bin 'Abdurrahman] bahwasanya [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda tentang ramadhan: \"Barangsiapa yang melakukan qiyamullail di bulan itu dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2122,
                "arab": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةٍ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Nuh bin Habib] dia berkata; telah menceritakan kepada kami ['Abdurrazzaq] dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam menganjurkan untuk melakukan qiyamullail di bulan ramadhan tanpa menyuruh mereka dengan perintah yang mengharuskan, beliau bersabda: \"Barangsiapa yang melakukan qiyamullail di bulan ramadhan dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu."
            },
            {
                "number": 2123,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang melakukan qiyamullail di bulan ramadhan dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2124,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي ابْنُ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnul Qasim] dari [Malik] dia berkata; telah menceritakan kepadaku [Ibnu Syihab] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang melakukan qiyamullail di bulan ramadhan dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2125,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ رَمَضَانَ وَفِي حَدِيثِ قُتَيْبَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ شَهْرَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dan [Muhammad bin 'Abdullah bin Yazid] mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang berpuasa ramadhan -dalam suatu lafazh yang \"Barangsiapa yang melakukan qiyamullail di bulan ramadhan\"- dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu. Dan, barangsiapa yang melakukan qiyamullail pada malam lailatul Qadar dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2126,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa ramadhan dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2127,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى وَمُحَمَّدُ بْنُ هِشَامٍ وَأَبُو الْأَشْعَثِ وَاللَّفْظُ لَهُ قَالُوا حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dan [Muhammad bin Hisyam] dan [Abul Asy'ats] dan lafazh ini miliknya, mereka berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Hisyam] dari [Yahya bin Abu Katsir] dari [Abu Salamah bin 'Abdurrahman] dia berkata; telah menceritakan kepadaku [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa ramadhan dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah lalu. Dan, barangsiapa yang melakukan qiyamullail pada malam lailatul Qadar dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2128,
                "arab": "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ عَنْ مَرْوَانَ أَنْبَأَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَامَ شَهْرَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepadaku [Mahmud bin Khalid] dari [Marwan]; telah memberitakan kepada kami [Mu'awiyah bin Sallam] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam dari bersabda: \"Barangsiapa yang melakukan qiyamullail di bulan ramadhan dengan penuh keimanan dan mengharap pahala, akan diampuni dari dosanya yang telah lalu. Dan barangsiapa yang melakukan qiyamullail pada malam lailatul Qadar dengan penuh keimanan dan mengharap pahala, maka akan diampuni dari dosanya yang telah berlalu.\""
            },
            {
                "number": 2129,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ قَالَ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنِي النَّضْرُ بْنُ شَيْبَانَ أَنَّهُ لَقِيَ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ فَقَالَ لَهُ حَدِّثْنِي بِأَفْضَلِ شَيْءٍ سَمِعْتَهُ يُذْكَرُ فِي شَهْرِ رَمَضَانَ فَقَالَ أَبُو سَلَمَةَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ ذَكَرَ شَهْرَ رَمَضَانَ فَفَضَّلَهُ عَلَى الشُّهُورِ وَقَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا خَرَجَ مِنْ ذُنُوبِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ أَنْبَأَنَا الْقَاسِمُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا النَّضْرُ بْنُ شَيْبَانَ عَنْ أَبِي سَلَمَةَ فَذَكَرَ مِثْلَهُ وَقَالَ مَنْ صَامَهُ وَقَامَهُ إِيمَانًا وَاحْتِسَابًا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Al Fadhl bin Dukain] dia berkata; telah menceritakan kepada kami [Nashr bin 'Ali] dia berkata; telah menceritakan kepadaku [An Nadlr bin Syaiban] bahwasanya ia bertemu dengan [Abu Salamah bin 'Abdurrahman], lalu ia berkata; ceritakan kepadaku tentang hal yang paling utama yang pernah engkau dengar di bulan ramadhan? Maka Abu Salamah berkata; telah menceritakan kepadaku ['Abdurrahman bin 'Auf] dari Rasulullah shallallahu 'alaihi wasallam bahwasanya beliau menyebutkan tentang bulan ramadhan dan beliau mengutamakannya dari bulan yang lain, beliau bersabda: \"Barangsiapa yang sholat dimalam hari bulan ramadhan dengan keimanan dan mengharapkan pahala maka dosa-dosanya akan keluar seperti hari dimana ia baru dilahirkan oleh ibunya, \" Abu Abdurrahman berkata; 'Ini adalah salah, yang benar adalah Abu Salamah dari Abu Hurairah Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Annadlr bin Syumail] dia berkata; Telah memberitakan kepada kami [Qasim bin Fadhl] dia berkata; Telah menceritakan kepada kami [Annadlr bin Syaiban] dari [Abu Salamah] lalu ia menyebutkan seperti itu juga dan dia berkata; 'Barangsiapa yang berpuasa dan sholat dimalamnya dengan keimanan dan mengharapkan pahala.'"
            },
            {
                "number": 2130,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو هِشَامٍ قَالَ حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا النَّضْرُ بْنُ شَيْبَانَ قَالَ قُلْتُ لِأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ حَدِّثْنِي بِشَيْءٍ سَمِعْتَهُ مِنْ أَبِيكَ سَمِعَهُ أَبُوكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ بَيْنَ أَبِيكَ وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدٌ فِي شَهْرِ رَمَضَانَ قَالَ نَعَمْ حَدَّثَنِي أَبِي قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى فَرَضَ صِيَامَ رَمَضَانَ عَلَيْكُمْ وَسَنَنْتُ لَكُمْ قِيَامَهُ فَمَنْ صَامَهُ وَقَامَهُ إِيمَانًا وَاحْتِسَابًا خَرَجَ مِنْ ذُنُوبِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Abu Hisyam] dia berkata; telah menceritakan kepada kami [Al Qasim bin Al Fadl] dia berkata; telah menceritakan kepada kami [An Nadlr bin Syaiban] dia berkata; aku berkata kepada [Abu Salamah bin 'Abdurrahman]; \"Ceritakan kepadaku mengenai sesuatu tentang bulan ramadhan yang kamu dengar dari Bapakmu, dari Rasulullah Shalallahu 'Alaihi Wa Sallam, yang mana antara Rasulullah Shalallahu 'Alaihi Wa Sallam dan Bapakmu tidak ada perantara seorangpun. Abu Salamah menjawab; 'Ya, ' Telah menceritakan kepadaku [Bapakku] dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Sesungguhnya Allah Tabaaraka Wata'ala telah mewajibkan kepada kalian puasa di bulan ramadhan, dan aku mensunnahkan sholat malamnya. Barang siapa berpuasa dibulan tersebut dan sholat di malamnya karena iman dan mengaharap pahala dariNya, maka dosa-dosanya akan keluar darinya sebagaimana hari dimana ia dilahirkan oleh ibunya.\""
            },
            {
                "number": 2131,
                "arab": "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ زَيْدٍ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ وَلِلصَّائِمِ فَرْحَتَانِ حِينَ يُفْطِرُ وَحِينَ يَلْقَى رَبَّهُ وَالَّذِي نَفْسِي بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ",
                "id": "Telah mengabarkan kepadaku [Hilal bin Al 'Ala] dia berkata; [bapakku] telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami ['ubaidhullah] dari [Zaid] dari [Abu Ishaq] dari ['Abdullah bin Al Harits] dari ['Ali bin Abu Thalib] dari Rasulullah beliau bersabda: \"Sesungguhnya Allah Tabaraka wa Ta'ala berfirman: \"Puasa itu adalah untukku dan Aku yang akan memberinya pahala, dan bagi seorang yang berpuasa ia memiliki dua kebahagiaan yaitu ketika ia berbuka dan ketika ia bertemu dengan Rabbnya, demi yang jiwaku berada ditanganNya sungguh bau mulut seorang yang berpuasa itu lebih harum disisi Allah daripada aroma minyak kesturi.\""
            },
            {
                "number": 2132,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ قَالَ عَبْدُ اللَّهِقَالَ اللَّهُ عَزَّ وَجَلَّ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ وَلِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ حِينَ يَلْقَى رَبَّهُ وَفَرْحَةٌ عِنْدَ إِفْطَارِهِ وَلَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Abul Ahwash] dia berkata; ['Abdullah] berkata; Allah -Azza wa Jalla- berfirman: \"Puasa itu untuk-Ku dan Aku yang akan membalasnya. Orang yang berpuasa itu mempunyai dua kegembiraan, kegembiraan ketika bertemu Rabb-nya dan ketika berbuka. Dan aroma mulut orang yang berpuasa sungguh lebih harum di sisi Allah daripada aroma minyak kesturi.\""
            },
            {
                "number": 2133,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حَرْبٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ حَدَّثَنَا أَبُو سِنَانٍ ضِرَارُ بْنُ مُرَّةَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ وَلِلصَّائِمِ فَرْحَتَانِ إِذَا أَفْطَرَ فَرِحَ وَإِذَا لَقِيَ اللَّهَ فَجَزَاهُ فَرِحَ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Harb] dia berkata; telah menceritakan kepada kami [Muhammad bin Fudhail] dia berkata; telah menceritakan kepada kami [Abu Sinan Dhirar bin Murrah] dari [Abu Shalih] dari [Abu Sa'id] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah -Tabaraka wa Ta'ala- berfirman: 'Puasa itu untuk-Ku dan Aku akan membalasnya. Dan orang yang berpuasa itu mempunyai dua kegembiraan; ketika berbuka ia gembira dan ketika bertemu Rabb-nya, lalu Dia membalasnya, ia pun bergembira. Demi Dzat yang jiwa Muhammad berada di tangan-Nya, bau mulut orang yang berpuasa sungguh lebih harum di sisi Allah daripada aroma minyak kesturi.\""
            },
            {
                "number": 2134,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرٌو أَنَّ الْمُنْذِرَ بْنَ عُبَيْدٍ حَدَّثَهُ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الصِّيَامُ لِي وَأَنَا أَجْزِي بِهِ وَالصَّائِمُ يَفْرَحُ مَرَّتَيْنِ عِنْدَ فِطْرِهِ وَيَوْمَ يَلْقَى اللَّهَ وَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Dawud] dari [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku ['Amr] bahwasanya [Al Mudzir bin 'Ubaid] menceritakan kepadanya dari [Abu Shalih As Samman] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Puasa itu untuk-Ku dan Aku yang akan membalasnya. Orang yang berpuasa bergembira dua kali; ketika berbuka dan pada saat bertemu Allah. Dan aroma mulut orang yang berpuasa sungguh lebih harum di sisi Allah daripada aroma minyak kesturi.\""
            },
            {
                "number": 2135,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ حَسَنَةٍ عَمِلَهَا ابْنُ آدَمَ إِلَّا كُتِبَ لَهُ عَشْرُ حَسَنَاتٍ إِلَى سَبْعِ مِائَةِ ضِعْفٍ قَالَ اللَّهُ عَزَّ وَجَلَّ إِلَّا الصِّيَامَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِنْ أَجْلِي الصِّيَامُ جُنَّةٌ لِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ عِنْدَ فِطْرِهِ وَفَرْحَةٌ عِنْدَ لِقَاءِ رَبِّهِ وَلَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Tidak ada kebaikan yang dikerjakan anak Adam kecuali akan ditulis untuknya sepuluh kebaikan hingga tujuh ratus kali lipat. Allah -Azza wa Jalla- berfirman: 'Kecuali puasa, maka sesungguhnya puasa itu untuk-Ku dan Aku akan membalasnya, ia meninggalkan syahwat dan makanannya hanya karena Aku. Puasa itu perisai. Orang yang berpuasa mempunyai dua kegembiraan; satu kegembiraan ketika berbuka dan kegembiraan ketika bertemu Rabb-nya. Dan aroma mulut orang yang berpuasa sungguh lebih harum di sisi Allah daripada aroma minyak kesturi.\""
            },
            {
                "number": 2136,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ عَنْ حَجَّاجٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ أَبِي صَالِحٍ الزَّيَّاتِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلَّا الصِّيَامَ هُوَ لِي وَأَنَا أَجْزِي بِهِ وَالصِّيَامُ جُنَّةٌ إِذَا كَانَ يَوْمُ صِيَامِ أَحَدِكُمْ فَلَا يَرْفُثْ وَلَا يَصْخَبْ فَإِنْ شَاتَمَهُ أَحَدٌ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي صَائِمٌ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ مِنْ رِيحِ الْمِسْكِ لِلصَّائِمِ فَرْحَتَانِ يَفْرَحُهُمَا إِذَا أَفْطَرَ فَرِحَ بِفِطْرِهِ وَإِذَا لَقِيَ رَبَّهُ عَزَّ وَجَلَّ فَرِحَ بِصَوْمِهِ",
                "id": "Telah mengabarkan kepadaku [Ibrahim bin Al Hasan] dari [Hajjaj] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku ['Atha] dari [Abu Shalih Az Ziyyat] bahwasanya ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semua amal perbuatan anak Adam adalah untuknya kecuali puasa, ia untuk-Ku dan Aku akan membalasnya. Dan puasa itu adalah perisai. Jika salah seorang dari kalian berada pada hari puasa, maka tidak boleh melakukan rafats (berbicara keji yang termasuk di dalamnya adalah jima) dan tidak boleh membuat kegaduhan. Jika seseorang mencacinya atau menyerangnya, maka hendaklah ia mengatakan; 'Sesungguhnya aku sedang berpuasa.' Demi Dzat yang jiwa Muhammad ada di tangan-Nya, sungguh aroma mulut orang yang berpuasa lebih harum di sisi Allah -pada hari Kiamat- dari pada aroma minyak kesturi. Orang yang berpuasa mempunyai dua kegembiraan, ia bergembira dengan keduanya; jika berbuka, ia bergenbira dengan berbukanya dan jika bertemu dengan Rabb-nya -Azza wa Jalla-, ia bergembira dengan puasanya.\""
            },
            {
                "number": 2137,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ جُرَيْجٍ قِرَاءَةً عَلَيْهِ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ قَالَ أَخْبَرَنِي عَطَاءٌ الزَّيَّاتُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ عَزَّ وَجَلَّ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلَّا الصِّيَامَ هُوَ لِي وَأَنَا أَجْزِي بِهِ الصِّيَامُ جُنَّةٌ فَإِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلَا يَرْفُثْ وَلَا يَصْخَبْ فَإِنْ شَاتَمَهُ أَحَدٌ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي امْرُؤٌ صَائِمٌ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِوَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ أَبِي هُرَيْرَةَ وَسَعِيدِ بْنِ الْمُسَيَّبِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] dia berkata; telah memberitakan kepada kami [Suwaid] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Ibnu Juraij] -secara baca- dari ['Atha bin Abu Rabbah] dia berkata; telah mengabarkan kepadaku ['Atha Az Ziyyat] bahwasanya ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Azza wa Jalla berfirman: \"Semua amal perbuatan anak Adam adalah untuknya, kecuali puasa, ia untuk-Ku dan Aku akan membalasnya. Puasa itu adalah perisai. Jika salah seorang dari kalian berada pada hari puasa, maka tidak boleh melakukan rafats (berkata kotor dll) dan tidak boleh membuat kegaduhan. Jika seseorang mencacinya atau menyerangnya, maka hendaklah ia mengatakan; 'Sesungguhnya aku sedang berpuasa.' Dan, demi Dzat yang jiwa Muhammad ada di tangan-Nya, aroma mulut orang yang berpuasa lebih harum di sisi Allah -pada hari Kiamat- dari pada aroma minyak kesturi.\" Hadits ini telah diriwayatkan dari Abu Hurairah dan Sa'id Musayyab."
            },
            {
                "number": 2138,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ عَزَّ وَجَلَّ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلَّا الصِّيَامَ هُوَ لِي وَأَنَا أَجْزِي بِهِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلْفَةُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah menceritakan kepadaku [Sa'id bin Al Musayyab] bahwasanya [Abu Hurairah] berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Azza wa Jalla berfirman: 'Semua amal perbuatan anak Adam adalah untuknya, kecuali puasa, ia untuk-Ku dan Aku akan membalasnya. Demi Dzat yang jiwa Muhammad ada di tangan-Nya, sungguh aroma mulut orang yang berpuasa lebih harum di sisi Allah -pada hari Kiamat- dari pada aroma minyak kesturi.\""
            },
            {
                "number": 2139,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عِيسَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرٍو عَنْ بُكَيْرٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ حَسَنَةٍ يَعْمَلُهَا ابْنُ آدَمَ فَلَهُ عَشْرُ أَمْثَالِهَا إِلَّا الصِّيَامَ لِي وَأَنَا أَجْزِي بِهِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Isa] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari ['Amr] dari [Bukair] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Setiap kebaikan yang dilakukan oleh anak Adam, maka untuknya sepuluh kebaikan yang sama, kecuali puasa, (puasa itu) untuk-Ku dan Aku akan membalasnya.\""
            },
            {
                "number": 2140,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ الضَّبِّيَّ حَدَّثَهُ عَنْ رَجَاءِ بْنِ حَيْوَةَ قَالَ حَدَّثَنَا أَبُو أُمَامَةَ الْبَاهِلِيُّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِأَمْرٍ يَنْفَعُنِي اللَّهُ بِهِ قَالَ عَلَيْكَ بِالصِّيَامِ فَإِنَّهُ لَا مِثْلَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Jarir bin Hazim] bahwasanya [Muhammad bin 'Abdullah bin Abu Ya'qub Adl Dlabbi] menceritakan kepadanya dari [Raja' bin Haiwah] dia berkata; telah menceritakan kepada kami [Abu Umamah Al Bahili] dia berkata; \"Aku mengatakan; 'Wahai Rasulullah shallallahu 'alaihi wasallam, perintahlah aku dengan suatu perintah yang dengannya Allah memberikan manfaat kepadaku', beliau bersabda: \"Hendaklah kamu berpuasa, karena ia tidak ada bandingannya.\""
            },
            {
                "number": 2141,
                "arab": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الضَّعِيفُ شَيْخٌ صَالِحٌ وَالضَّعِيفُ لَقَبٌ لِكَثْرَةِ عِبَادَتِهِ قَالَ أَخْبَرَنَا يَعْقُوبُ الْحَضْرَمِيُّ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ عَنْ أَبِي نَصْرٍ عَنْ رَجَاءِ بْنِ حَيْوَةَ عَنْ أَبِي أُمَامَةَأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْعَمَلِ أَفْضَلُ قَالَ عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لَا عِدْلَ لَهُ",
                "id": "Telah mengabarkan kepadaku ['Abdullah bin Muhammad Adh Dha'if] -syaikh yang shalih dan lemah, digelari seperti ini karena banyaknya dia beribadah- dia berkata; telah mengabarkan kepada kami [Ya'qub Al Hadhrami] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin 'Abdullah bin Abu Ya'qub] dari [Abu Nashr] dari [Raja' bin Haiwah] dari [Abu Umamah] bahwa ia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam, lalu aku berkata; \"Amal apa yang paling utama?\" Beliau bersabda: \"Hendaklah kamu berpuasa, karena ia tidak ada bandingannya.\""
            },
            {
                "number": 2142,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ مُحَمَّدٍ هُوَ ابْنُ السَّكَنِ أَبُو عُبَيْدِ اللَّهِ قَالَ حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ الضَّبِّيِّ عَنْ أَبِي نَصْرٍ الْهِلَالِيِّ عَنْ رَجَاءِ بْنِ حَيْوَةَ عَنْ أَبِي أُمَامَةَ قَالَ قُلْتُيَا رَسُولَ اللَّهِ مُرْنِي بِعَمَلٍ قَالَ عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لَا عَدْلَ لَهُ قُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِعَمَلٍ قَالَ عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لَا عِدْلَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Muhammad bin As Sakan Abu 'ubaidhullah] dia berkata; telah menceritakan kepada kami [Yahya bin Katsir] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Abu Ya'qub Adl Dlabbi] dari [Abu Nashr Al Hilali] dari [Raja' bin Haiwah] dari [Abu Umamah] dia berkata; Aku berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, perintahlah aku dengan suatu amal.\" Beliau bersabda: \"Hendaklah kamu berpuasa, karena ia tidak ada bandingannya.\" Aku berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, perintahlah aku dengan suatu amal.\" Beliau bersabda: \"Hendaklah kamu berpuasa, karena ia tidak ada bandingannya.\""
            },
            {
                "number": 2143,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سُلَيْمَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ وَالْحَكَمِ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّوْمُ جُنَّةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Yahya bin Hammad] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Sulaiman] dari [Habib bin Abu Tsabit] dan [Al Hakam] dari [Maimun bin Abu Syabib] dari [Mu'adz bin Jabal] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Puasa itu perisai.\""
            },
            {
                "number": 2144,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ قَالَ سَمِعْتُ عُرْوَةَ بْنَ النَّزَّالِ يُحَدِّثُ عَنْ مُعَاذٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّوْمُ جُنَّةٌأَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ عَنْ حَجَّاجٍ عَنْ شُعْبَةَ قَالَ لِي الْحَكَمُ سَمِعْتُهُ مِنْهُ مُنْذُ أَرْبَعِينَ سَنَةً ثُمَّ قَالَ الْحَكَمُ وَحَدَّثَنِي بِهِ مَيْمُونُ بْنُ أَبِي شَبِيبٍ عَنْ مُعَاذِ بْنِ جَبَلٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] mereka berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dia berkata; aku mendengar ['Urwah bin An Nazzal] menceritakan dari [Mu'adz] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Puasa itu perisai.\" Telah mengabarkan kepadaku [Ibrahim bin Hasan] dari [Hajjaj] dari [Syu'bah], [Hakam] berkata kepadaku, Aku mendengar darinya sejak empat puluh tahun, kemudian Al Hakam berkata; 'Dan telah menceritakan kepadaku tentang hal itu, dari [Maimun bin Abu Syabib] dari [Mu'adz bin Jabal]."
            },
            {
                "number": 2145,
                "arab": "و أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ أَنْبَأَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ جُرَيْجٍ قِرَاءَةً عَنْ عَطَاءٍ قَالَ أَنْبَأَنَا عَطَاءٌ الزَّيَّاتُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصِّيَامُ جُنَّةٌ",
                "id": "Dan telah mengabarkan kepada kami [Muhammad bin Hatim]; telah memberitakan kepada kami [Suwaid] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Ibnu Juraij] secara baca dari ['Atha] dia berkata; telah memberitakan kepada kami ['Atha Az Zayyat] bahwasanya ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Puasa itu perisai.\""
            },
            {
                "number": 2146,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ أَنَّ مُطَرِّفًا رَجُلًا مِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ حَدَّثَهُأَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ دَعَا لَهُ بِلَبَنٍ لِيَسْقِيَهُ فَقَالَ مُطَرِّفٌ إِنِّي صَائِمٌ فَقَالَ عُثْمَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصِّيَامُ جُنَّةٌ كَجُنَّةِ أَحَدِكُمْ مِنْ الْقِتَالِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Sa'id bin Abu Hind] bahwasanya [Mutharrif] -seorang lelaki dari Bani 'Amir bin Sha'sha'ah- menceritakan kepadanya bahwasanya ['Utsman bin Abul 'Ash] meminta diambilkan susu untuk memberikan minum kepadanya, Mutharif berkata; \"Sesungguhnya aku sedang berpuasa.\" Lalu Utsman berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Puasa itu perisai, seperti perisai salah seorang di antara kalian dari peperangan.\""
            },
            {
                "number": 2147,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ مُطَرِّفٍ قَالَدَخَلْتُ عَلَى عُثْمَانَ بْنِ أَبِي الْعَاصِ فَدَعَا بِلَبَنٍ فَقُلْتُ إِنِّي صَائِمٌ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصَّوْمُ جُنَّةٌ مِنْ النَّارِ كَجُنَّةِ أَحَدِكُمْ مِنْ الْقِتَالِأَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو مُصْعَبٍ عَنْ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ قَالَ دَخَلَ مُطَرِّفٌ عَلَى عُثْمَانَ نَحْوَهُ مُرْسَلٌ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Al Hasan] dia berkata; telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Ibnu Ishaq] dari [Sa'id bin Abu Hind] dari [Mutharrif] dia berkata; \"Aku masuk menemui [Utsman bin Abu Al Ash], lalu ia minta diambilkan susu, maka aku berkata; \"Sesungguhnya aku sedang berpuasa.\" Lalu ia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Puasa itu perisai, seperti perisai salah seorang di antara kalian dari peperangan'.\" Telah mengabarkan kepadaku [Zakaria bin Yahya] dia berkata; telah menceritakan kepada kami [Abu Mush'ab] dari [Al Mughirah] dari ['Abdullah bin Sa'id bin Abu Hind] dari [Muhammad bin Ishaq] dari [Sa'id bin Abu Hind] dia berkata; 'Mutharrif masuk menemui Utsman.... selanjutnya sebagaimana Hadits di atas secara mursal.'"
            },
            {
                "number": 2148,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الْآدَمِيُّ قَالَ حَدَّثَنَا مَعْنٌ عَنْ خَارِجَةَ بْنِ سُلَيْمَانَ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ عُرْوَةَ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الصِّيَامُ جُنَّةٌ مِنْ النَّارِ فَمَنْ أَصْبَحَ صَائِمًا فَلَا يَجْهَلْ يَوْمَئِذٍ وَإِنْ امْرُؤٌ جَهِلَ عَلَيْهِ فَلَا يَشْتُمْهُ وَلَا يَسُبَّهُ وَلْيَقُلْ إِنِّي صَائِمٌ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Al Adami] dia berkata; telah menceritakan kepada kami [Ma'n] dari [Kharijah bin Sulaiman] dari [Yazid bin Ruman] dari ['Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Puasa itu adalah perisai dari api neraka, barangsiapa yang berpuasa, maka janganlah berbuat bodoh ketika itu, dan jika seseorang membodohinya, maka janganlah mencacinya dan jangan mencelanya, hendaklah ia mengatakan, ' aku sedang berpuasa, ' demi Dzat yang jiwa Muhammad ada di tangan-Nya, aroma mulut orang yang berpuasa lebih harum di sisi Allah -pada hari Kiamat- dari pada aroma minyak kesturi.\""
            },
            {
                "number": 2149,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حَبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مِسْعَرٍ عَنْ الْوَلِيدِ بْنِ أَبِي مَالِكٍ قَالَ حَدَّثَنَا أَصْحَابُنَا عَنْ أَبِي عُبَيْدَةَ قَالَالصِّيَامُ جُنَّةٌ مَا لَمْ يَخْرِقْهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] dia berkata; telah memberitakan kepada kami [Habban] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Mis'ar] dari [Al Walid bin Abu Malik] dia berkata; telah menceritakan kepada kami [shahabat-shahabat kami] dari [Abu 'Ubaidah] dia berkata; \"Puasa itu adalah perisai, selagi ia tidak merusaknya -dengan maksiat-.\""
            },
            {
                "number": 2150,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَخْبَرَنِي أَنَسٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ زَحْزَحَ اللَّهُ وَجْهَهُ عَنْ النَّارِ بِذَلِكَ الْيَوْمِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami [Yunus bin 'Abdul A'la] dia berkata; telah mengabarkan kepadaku [Anas] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa berpuasa sehari di jalan Allah -Azza wa Jalla-, Allah menjauhkan wajahnya dari api neraka selama tujuh puluh tahun karena hari itu.\""
            },
            {
                "number": 2151,
                "arab": "أَخْبَرَنَا دَاوُدُ بْنُ سُلَيْمَانَ بْنِ حَفْصٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ الضَّرِيرُ عَنْ سُهَيْلٍ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ بِذَلِكَ الْيَوْمِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami [Dawud bin Sulaiman bin Hafsh] dia berkata; telah menceritakan kepada kami [Abu Mu'awiyah Adl Dlarir] dari [Suhail] dari [Al Maqburi] dari [Abu Sa'id Al Khudri] dia berkata; dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berpuasa sehari dijalan Allah, Allah menjauhkan antara ia dan neraka selama tujuh puluh tahun karena hari itu.\""
            },
            {
                "number": 2152,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ أَخْبَرَنِي سُهَيْلٌ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ عَزَّ وَجَلَّ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ya'qub] dia berkata; telah menceritakan kepada kami [Ibnu Abu Maryam] dia berkata; telah menceritakan kepada kami [Sa'id bin 'Abdurrahman] dia berkata; telah mengabarkan kepadaku [Suhail] dari [Bapaknya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berpuasa sehari di jalan Allah, Allah -Azza wa Jalla- menjauhkan wajahnya dari api neraka selama tujuh puluh tahun karena hari itu.\""
            },
            {
                "number": 2153,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُهَيْلٍ عَنْ صَفْوَانَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ بَاعَدَ اللَّهُ وَجْهَهُ مِنْ جَهَنَّمَ سَبْعِينَ عَامًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Suhail] dari [Shafwan] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa berpuasa sehari di jalan Allah -Azza wa Jalla-, Allah menjauhkan wajahnya dari neraka Jahanam selama tujuh puluh tahun.\""
            },
            {
                "number": 2154,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ الْهَادِ عَنْ سُهَيْلٍ عَنْ ابْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ يَصُومُ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ إِلَّا بَعَّدَ اللَّهُ عَزَّ وَجَلَّ بِذَلِكَ الْيَوْمِ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin 'Abdul Hakim] dari [Syu'aib] dia berkata; telah memberitakan kepada kami [Al Laits] dari [Ibnul Had] dari [Suhail] dari [Ibnu Abu 'Ayyasy] dari [Abu Sa'id] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba yang berpuasa sehari di jalan Allah -Azza wa Jalla-, melainkan Allah -Azza wa Jalla- menjauhkan wajahnya dari api neraka selama tujuh puluh tahun karena hari itu.\""
            },
            {
                "number": 2155,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ عَنْ حُمَيْدِ بْنِ الْأَسْوَدِ قَالَ حَدَّثَنَا سُهَيْلٌ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ بَاعَدَهُ اللَّهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Qaza'ah] dari [Humaid bin Al Aswad] dia berkata; telah menceritakan kepada kami [Suhail] dari [An Nu'man bin Abu 'Ayyasy] dia berkata; aku mendengar [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berpuasa sehari di jalan Allah -Azza wa Jalla-, Allah menjauhkan ia dari api neraka selama tujuh puluh tahun.\""
            },
            {
                "number": 2156,
                "arab": "أَخْبَرَنَا مُؤَمَّلُ بْنُ إِهَابٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ وَسُهَيْلُ بْنُ أَبِي صَالِحٍ سَمِعَا النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ تَبَارَكَ وَتَعَالَى بَاعَدَ اللَّهُ وَجْهَهُ عَنْ النَّارِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami [Muammal bin Ihab] dia berkata; telah menceritakan kepada kami ['Abdurrazzaq] dia berkata; telah memberitakan kepada kami [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku [Yahya bin Sa'id] dan [Suhail bin Abu Shalih], mereka mendengar dari [An Nu'man bin Abu 'Ayyasy] dia berkata; aku mendengar [Abu Sa'id Al Khudri] berkata; \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berpuasa sehari di jalan Allah -Tabaraka wa Ta'ala-, Allah menjauhkan wajahnya dari api neraka selama tujuh puluh tahun.\""
            },
            {
                "number": 2157,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ نَيْسَابُورِيٌّ قَالَ حَدَّثَنَا يَزِيدُ الْعَدَنِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَصُومُ عَبْدٌ يَوْمًا فِي سَبِيلِ اللَّهِ إِلَّا بَاعَدَ اللَّهُ تَعَالَى بِذَلِكَ الْيَوْمِ النَّارَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Munir An Naisaburi] dia berkata; telah menceritakan kepada kami [Yazid Al 'Adani] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Suhail bin Abu Shalih] dari [An Nu'man bin Abu 'Ayyasy] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba yang berpuasa sehari di jalan Allah, melainkan Allah -Ta'ala- akan jauhkan neraka dari wajahnya selama tujuh puluh tahun karena hari itu.\""
            },
            {
                "number": 2158,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا قَاسِمٌ عَنْ سُفْيَانَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ حَرَّ جَهَنَّمَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Harb] dia berkata; telah menceritakan kepada kami [Qasim] dari [Sufyan] dari [Suhail bin Abu Shalih] dari [An Nu'man bin Abu 'Ayyasy] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa berpuasa sehari di jalan Allah, Allah menjauhkan panasnya neraka Jahanam dari wajahnya karena hari itu selama tujuh puluh tahun.\""
            },
            {
                "number": 2159,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ قَرَأْتُ عَلَى أَبِي حَدَّثَكُمْ ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُمَيٍّ عَنْ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ النَّارَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Ahmad bin Muhammad bin Hanbal] dia berkata; aku membaca kitab [bapakku], telah menceritakan kepada kalian [Ibnu Numair] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Sumayyi] dari [An Nu'man bin Abu 'Ayyasy] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berpuasa sehari di jalan Allah, Allah menjauhkan neraka dari wajahnya selama tujuh puluh tahun karena hari itu.\""
            },
            {
                "number": 2160,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ عَنْ مُحَمَّدِ بْنِ شُعَيْبٍ قَالَ أَخْبَرَنِي يَحْيَى بْنُ الْحَارِثِ عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّهُ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ بَاعَدَ اللَّهُ مِنْهُ جَهَنَّمَ مَسِيرَةَ مِائَةِ عَامٍ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Khalid] dari [Muhammad bin Syu'aib] dia berkata; telah mengabarkan kepadaku [Yahya bin Al Harits] dari [Al Qasim Abu 'Abdurrahman] bahwasanya ia menceritakan kepadanya dari ['Uqbah bin 'Amir] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang berpuasa sehari dijalan Allah Azza wa Jalla maka Allah menjauhkan darinya neraka Jahannam sejauh perjalanan seratus tahun.\""
            },
            {
                "number": 2161,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ عَنْ أُمِّ الدَّرْدَاءِ عَنْ كَعْبِ بْنِ عَاصِمٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Sufyan] dari [Az Zuhri] dari [Shafwan bin 'Abdullah] dari [Ummu Ad Darda'] dari [Ka'b bin 'Ashim] dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk kebajikan berpuasa dalam perjalanan.\""
            },
            {
                "number": 2162,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ الَّذِي قَبْلَهُ لَا نَعْلَمُ أَحَدًا تَابَعَ ابْنَ كَثِيرٍ عَلَيْهِ",
                "id": "Telah mengabarkan kepadaku [Ibrahim bin Ya'qub] dia berkata; telah menceritakan kepada kami [Muhammad bin Katsir] dari [Al Auza'i] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk kebajikan berpuasa dalam perjalanan.\" Abu Abdurrahman berkata; 'Ini adalah salah dan yang benar adalah Hadits sebelumnya, kami tidak mengetahui seorang pun yang mengikuti Ibnu Katsir atas hal itu.'"
            },
            {
                "number": 2163,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرٌ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى نَاسًا مُجْتَمِعِينَ عَلَى رَجُلٍ فَسَأَلَ فَقَالُوا رَجُلٌ أَجْهَدَهُ الصَّوْمُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Bakr] dari ['Umarah bin Ghaziyyah] dari [Muhammad bin 'Abdurrahman] dari [Jabir bin 'Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah melihat sekelompok orang yang sedang berkumpul mengerumuni seseorang, lalu beliau bertanya? mereka menjawab; \"Ia adalah orang yang tertekan -karena- puasa.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk kebajikan berpuasa dalam perjalanan.\""
            },
            {
                "number": 2164,
                "arab": "أَخْبَرَنِي شُعَيْبُ بْنُ شُعَيْبِ بْنِ إِسْحَقَ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِرَجُلٍ فِي ظِلِّ شَجَرَةٍ يُرَشُّ عَلَيْهِ الْمَاءُ قَالَ مَا بَالُ صَاحِبِكُمْ هَذَا قَالُوا يَا رَسُولَ اللَّهِ صَائِمٌ قَالَ إِنَّهُ لَيْسَ مِنْ الْبِرِّ أَنْ تَصُومُوا فِي السَّفَرِ وَعَلَيْكُمْ بِرُخْصَةِ اللَّهِ الَّتِي رَخَّصَ لَكُمْ فَاقْبَلُوهَاأَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا الْفِرْيَابِيُّ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي يَحْيَى قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي مَنْ سَمِعَ جَابِرًا نَحْوَهُ",
                "id": "Telah mengabarkan kepadaku [Syu'aib bin Syu'aib bin Ishaq] dia berkata; telah menceritakan kepada kami ['Abdul Wahhab bin Sa'id] dia berkata; telah menceritakan kepada kami [Syu'aib] dia berkata; telah menceritakan kepada kami [Al Auza'i] dia berkata; telah menceritakan kepadaku [Yahya bin Abu Katsir] dia berkata; telah mengabarkan kepadaku [Muhammad bin 'Abdurrahman] dia berkata; telah mengabarkan kepadaku [Jabir bin 'Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam melewati seseorang yang berada di bawah naungan pohon, dirinya disiram air, beliau bertanya: \"Apa yang telah terjadi pada teman kalian ini?!\" mereka menjawab; \"Wahai Rasulullah shallallahu 'alaihi wasallam, ia sedang berpuasa.\" Beliau bersabda: \"Bukan termasuk kebajikan jika kalian berpuasa dalam perjalanan dan hendaklah kalian mengambil keringanan yang Allah berikan kepada kalian, terimalah keringanan tersebut.\" Telah mengabarkan kepada kami [Mahmud bin Khalid] dia berkata; telah menceritakan kepada kami [Al Firyabi] dia berkata; telah menceritakan kepada kami [Al Auza'i] dia bekata; telah menceritakan kepadaku [Yahya] dia berkata; Telah mengabarkan kepadaku [Muhammad bin Abdurrahman] dia berkata; telah menceritakan kepadaku [orang yang mendengar Hadits] dari [Jabir]; mengenai Hadits yang serupa."
            },
            {
                "number": 2165,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَاعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ عَلَيْكُمْ بِرُخْصَةِ اللَّهِ عَزَّ وَجَلَّ فَاقْبَلُوهَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami ['Ali bin Al Mubarak] dari [Yahya bin Abu Katsir] dari [Muhammad bin 'Abdurrahman bin Tsauban] dari [Jabir bin 'Abdullah Radliallahu? nhuma], dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Bukan termasuk kebajikan berpuasa dalam perjalanan. Hendaklah kalian mengambil keringanan yang diberikan Allah -Azza wa Jalla-, terimalah keringanan tersebut.\""
            },
            {
                "number": 2166,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ عُثْمَانَ بْنِ عُمَرَ قَالَ أَنْبَأَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ رَجُلٍ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari ['Utsman bin 'Umar] dia berkata; telah memberitakan kepada kami ['Ali bin Al Mubarak] dari [Yahya] dari [Muhammad bin 'Abdurrahman] dari [seorang lelaki] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk kebajikan jika kalian berpuasa dalam perjalanan.\""
            },
            {
                "number": 2167,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَخَالِدُ بْنُ الْحَارِثِ عَنْ شُعْبَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَسَنٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا قَدْ ظُلِّلَ عَلَيْهِ فِي السَّفَرِ فَقَالَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dan [Khalid bin Al Harits] dari [Syu'bah] dari [Muhammad bin 'Abdurrahman] dari [Muhammad bin 'Amr bin Hasan] dari [Jabir bin 'Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam melihat seseorang yang menaungi dirinya dengan sesuatu -karena panas dan dahaga- dalam perjalanan, maka beliau bersabda: \"Bukan termasuk kebajikan berpuasa dalam perjalanan.\""
            },
            {
                "number": 2168,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ الْهَادِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ عَامَ الْفَتْحِ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ كُرَاعَ الْغَمِيمِ فَصَامَ النَّاسُ فَبَلَغَهُ أَنَّ النَّاسَ قَدْ شَقَّ عَلَيْهِمْ الصِّيَامُ فَدَعَا بِقَدَحٍ مِنْ الْمَاءِ بَعْدَ الْعَصْرِ فَشَرِبَ وَالنَّاسُ يَنْظُرُونَ فَأَفْطَرَ بَعْضُ النَّاسِ وَصَامَ بَعْضٌ فَبَلَغَهُ أَنَّ نَاسًا صَامُوا فَقَالَ أُولَئِكَ الْعُصَاةُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin 'Abdul Hakam] dari [Syu'aib] dia berkata; telah memberitakan kepada kami [Al Laits] dari [Ibnul Had] dari [Ja'far bin Muhammad] dari [Bapaknya] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam berangkat ke Mekkah pada tahun kemenangan kota Mekkah di bulan ramadhan, lalu beliau berpuasa hingga sampai di Kura' Al Ghamim dan orang-orang ikut berpuasa, kemudian berita sampai kepada beliau, bahwa orang-orang merasa berat untuk berpuasa, lalu setelah Ashar beliau meminta segelas air, kemudian minum dan orang-orang melihatnya, maka sebagian orang berbuka dan sebagian lainnya berpuasa, setelah sampai berita kepada beliau bahwa -ada sebagian- orang yang berpuasa, beliau bersabda: \"Mereka adalah orang-orang yang durhaka.\""
            },
            {
                "number": 2169,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبدِ اللَّهِ وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَا حَدَّثَنَا أَبُو دَاوُدَ عَنْ سُفْيَانَ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِطَعَامٍ بِمَرِّ الظَّهْرَانِ فَقَالَ لِأَبِي بَكْرٍ وَعُمَرَ أَدْنِيَا فَكُلَا فَقَالَا إِنَّا صَائِمَانِ فَقَالَ ارْحَلُوا لِصَاحِبَيْكُمْ اعْمَلُوا لِصَاحِبَيْكُمْأَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ قَالَ أَخْبَرَنِي الْأَوْزَاعِيُّ عَنْ يَحْيَى أَنَّهُ حَدَّثَهُ عَنْ أَبِي سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَغَدَّى بِمَرِّ الظَّهْرَانِ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ فَقَالَ الْغَدَاءَ مُرْسَلٌ أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا عَلِيٌّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا بِمَرِّ الظَّهْرَانِ مُرْسَلٌ",
                "id": "Telah mengabarkan kepada kami [Harun bin 'Abdullah] dan ['Abdurrahman bin Muhammad bin Sallam] mereka berkata; telah menceritakan kepada kami [Abu Dawud] dari [Sufyan] dari [Al Auza'i] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Nabi shallallahu 'alaihi wasallam diberi makanan di Marr Azh-Zhahran, maka beliau bersabda kepada Abu Bakar dan Umar: \"Mendekatlah kalian berdua dan makanlah.\" Lalu keduanya berkata; ' kami sedang berpuasa.' Maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Pergilah kalian untuk menemui dua sahabat kalian dan buatkan sesuatu untuk dua sahabat kalian.' Telah mengabarkan kepada kami [Imran bin Yazid] dia berkata; Telah menceritakan kepada kami [Muhammad bin Syu'aib] dia berkata; telah mengabarkan kepadakku [Al Auza'i] dari [Yahya] dia berkata kepadanya, dari [Abu Salamah] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda ketika Rasulullah shallallahu 'alaihi wasallam makan siang di Marr Azh-Zhahran, beliau bersama Abu Bakar dan Umar, beliau berkata: 'Makan sianglah'. Secara mursal. Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Utsman bin Umar] dia berkata; telah menceritakan kepada kami [Ali] dari [Yahya] dari [Abu Salamah] bahwasanya Rasulullah shallallahu 'alaihi wasallam, Abu Bakar dan Umar berada di Marr Azh-Zhahran. Secara mursal."
            },
            {
                "number": 2170,
                "arab": "أَخْبَرَنِي عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ عَنْ مُحَمَّدِ بْنِ شُعَيْبٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ قَالَ أَخْبَرَنِي عَمْرُو بْنُ أُمَيَّةَ الضَّمْرِيُّ قَالَقَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ فَقَالَ انْتَظِرْ الْغَدَاءَ يَا أَبَا أُمَيَّةَ فَقُلْتُ إِنِّي صَائِمٌ فَقَالَ تَعَالَ ادْنُ مِنِّي حَتَّى أُخْبِرَكَ عَنْ الْمُسَافِرِ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepadaku ['Abdah bin 'Abdurrahim] dari [Muhammad bin Syu'aib] dia berkata; telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abu Salamah] dia berkata; telah mengabarkan kepadaku ['Amru bin Umayyah Adl Dlamri] dia berkata; Aku datang untuk menemui Rasulullah shallallahu 'alaihi wasallam dari bepergian, lalu beliau bersabda: \"Tunggulah makan siang wahai Abu Umayah!\" Kemudian aku berkata; \" aku sedang berpuasa.\" Maka beliau bersabda: \"Kemari, mendekatlah kepadaku hingga kuberitahukan kepadamu tentang -sesuatu yang berkenaan dengan- orang yang bepergian. Allah -Azza wa Jalla- telah membebaskan puasa dan setengah sholat darinya.\""
            },
            {
                "number": 2171,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو قِلَابَةَ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيُّ عَنْ أَبِيهِ قَالَقَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا تَنْتَظِرُ الْغَدَاءَ يَا أَبَا أُمَيَّةَ قُلْتُ إِنِّي صَائِمٌ فَقَالَ تَعَالَ أُخْبِرْكَ عَنْ الْمُسَافِرِ إِنَّ اللَّهَ وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepadaku ['Amru bin 'Utsman] dia berkata; telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] dia berkata; telah menceritakan kepadaku [Yahya bin Abu Katsir] dia berkata; telah menceritakan kepadaku [Abu Qilabah] dia berkata; telah menceritakan kepadaku [Ja'far bin 'Amri bin Umayyah Adl Dlamri] dari [bapaknya], dia berkata; \"Aku pernah datang untuk menemui Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Tidakkah kamu menunggu makan siang wahai Abu Umayah?\" Aku berkata; \" aku sedang berpuasa.\" Maka beliau bersabda: \"Kemari, mendekatlah kepadaku hingga kuberitahukan kepadamu tentang -sesuatu yang berkenaan dengan- orang yang bepergian. Allah Azza Wa Jalla telah membebaskan puasa dan setengah sholat darinya.\""
            },
            {
                "number": 2172,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَاجِرِ عَنْ أَبِي أُمَيَّةَ الضَّمْرِيِّ قَالَقَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ فَسَلَّمْتُ عَلَيْهِ فَلَمَّا ذَهَبْتُ لِأَخْرُجَ قَالَ انْتَظِرْ الْغَدَاءَ يَا أَبَا أُمَيَّةَ قُلْتُ إِنِّي صَائِمٌ يَا نَبِيَّ اللَّهِ قَالَ تَعَالَ أُخْبِرْكَ عَنْ الْمُسَافِرِ إِنَّ اللَّهَ تَعَالَى وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلَاةِأَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الْأَوْزَاعِيِّ قَالَ أَخْبَرَنِي يَحْيَى قَالَ حَدَّثَنِي أَبُو قِلَابَةَ قَالَ حَدَّثَنِي أَبُو الْمُهَاجِرِ قَالَ حَدَّثَنِي أَبُو أُمَيَّةَ يَعْنِي الضَّمْرِيَّ أَنَّهُ قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah memberitakan kepada kami [Abul Mughirah] dia berkata; telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abu Qilabah] dari [Abul Muhajir] dari [Abu Umayyah Adl Dlamri] dia berkata; Aku pernah datang untuk menemui Rasulullah shallallahu 'alaihi wasallam dari bepergian, lalu kuucapkan salam kepada beliau. Setelah aku beranjak keluar, beliau bersabda: \"Tunggulah makan siang wahai Abu Umayah.\" Aku berkata, \" Aku sedang berpuasa wahai Nabiyullah.\" Beliau bersabda: \"Kemarilah, kuberitahukan kepadamu tentang -sesuatu yang berkenaan dengan- orang yang bepergian. Allah telah membebaskan puasa dan setengah sholat darinya.\" Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami [Musa bin Marwan] dia berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Al Auza'i] dia berkata; telah mengabarkan kepadaku [Yahya] dia berkata; telah menceritakan kepadaku [Abu Qilabah] dia berkata; telah menceritakan kepadaku [Abul Muhajir] dia berkata; telah menceritakan kepadaku [Abu Umayyah Adl Dlamri] bahwa dia datang menemui Rasulullah shallallahu 'alaihi wasallam, - kemudian dia menyebutkan Hadits diatas-."
            },
            {
                "number": 2173,
                "arab": "أَخْبَرَنِي شُعَيْبُ بْنُ شُعَيْبِ بْنِ إِسْحَقَ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ حَدَّثَنِي الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي يَحْيَى قَالَ حَدَّثَنِي أَبُو قِلَابَةَ الْجَرْمِيُّ أَنَّ أَبَا أُمَيَّةَ الضَّمْرِيَّ حَدَّثَهُمْأَنَّهُ قَدِمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ فَقَالَ انْتَظِرْ الْغَدَاءَ يَا أَبَا أُمَيَّةَ قُلْتُ إِنِّي صَائِمٌ قَالَ ادْنُ أُخْبِرْكَ عَنْ الْمُسَافِرِ إِنَّ اللَّهَ وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepadaku [Syu'aib bin Syu'aib bin Ishaq] dia berkata; telah menceritakan kepada kami ['Abdul Wahhab] dia berkata; telah menceritakan kepada kami [Syu'aib] dia berkata; telah menceritakan kepadaku [Al Auza'i] dia berkata; telah menceritakan kepadaku [Yahya] dia berkata; telah menceritakan kepadaku [Abu Qilabah Al Jarmi] bahwasanya [Abu Umayyah Adl Dlamri] menceritakan kepada mereka, ia datang untuk menemui Rasulullah shallallahu 'alaihi wasallam dari bepergian, lalu beliau bersabda: \"Tunggulah makan siang, wahai Abu Umayah!\" Aku berkata; \" aku sedang berpuasa.\" Maka beliau bersabda: \"Kemari, mendekatlah kepadaku hingga kuberitahukan kepadamu tentang -sesuatu yang berkenaan dengan- orang yang bepergian. Allah Azza Wa Jalla telah membebaskan puasa dan setengah sholat darinya.\""
            },
            {
                "number": 2174,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ يَزِيدَ بْنِ إِبْرَاهِيمَ الْحَرَّانِيُّ قَالَ حَدَّثَنَا عُثْمَانُ قَالَ حَدَّثَنَا مُعَاوِيَةُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ أَنَّ أَبَا أُمَيَّةَ الضَّمْرِيَّ أَخْبَرَهُأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ وَهُوَ صَائِمٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا تَنْتَظِرْ الْغَدَاءَ قَالَ إِنِّي صَائِمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَالَ أُخْبِرْكَ عَنْ الصِّيَامِ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ عَنْ الْمُسَافِرِ الصِّيَامَ وَنِصْفَ الصَّلَاةِأَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ أَنْبَأَنَا عَلِيٌّ عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ رَجُلٍ أَنَّ أَبَا أُمَيَّةَ أَخْبَرَهُ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'ubaidhullah bin Yazid bin Ibrahim Al Harrani] dia berkata; telah menceritakan kepada kami ['Utsman] dia berkata; telah menceritakan kepada kami [Mu'awiyah] dari [Yahya bin Abu Katsir] dari [Abu Qilabah] bahwasanya [Abu Umayyah Adl Dlamri] menceritakan kepada mereka, ia datang untuk menemui Rasulullah shallallahu 'alaihi wasallam dari bepergian, lalu beliau bersabda: \"Tunggulah makan siang, wahai Abu Umayah!\" Aku berkata; \" aku sedang berpuasa.\" Maka beliau bersabda: \"Kemari, mendekatlah kepadaku hingga kuberitahukan kepadamu tentang -sesuatu yang berkenaan dengan- orang yang bepergian. Allah telah membebaskan puasa dan setengah sholat darinya.\" Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Utsman bin Umar] dia berkata; telah memberitakan kepada kami [Ali] dari [Yahya] dari [Abu Qilabah] dari [seseorang], bahwa [Abu Umayyah] mengabarkan kepadanya, ia datang menemui Rasulullah shallallahu 'alaihi wasallam dari pepergian sebagaimana hadits diatas."
            },
            {
                "number": 2175,
                "arab": "أَخْبَرَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ التَّلِّ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ وَضَعَ عَنْ الْمُسَافِرِ نِصْفَ الصَّلَاةِ وَالصَّوْمَ وَعَنْ الْحُبْلَى وَالْمُرْضِعِ",
                "id": "Telah mengabarkan kepada kami ['Umar bin Muhammad bin Al Hasan bin At Tall] dia berkata; [bapakku] telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami [Sufyan Ats Tsauri] dari [Ayyub] dari [Abu Qilabah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \" Allah telah membebaskan setengah sholat dan puasa dari orang-orang yang bepergian dan dari wanita yang hamil serta menyusui.\""
            },
            {
                "number": 2176,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ حَدَّثَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ شَيْخٍ مِنْ قُشَيْرٍ عَنْ عَمِّهِ حَدَّثَنَاثُمَّ أَلْفَيْنَاهُ فِي إِبِلٍ لَهُ فَقَالَ لَهُ أَبُو قِلَابَةَ حَدِّثْهُ فَقَالَ الشَّيْخُ حَدَّثَنِي عَمِّي أَنَّهُ ذَهَبَ فِي إِبِلٍ لَهُ فَانْتَهَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَأْكُلُ أَوْ قَالَ يَطْعَمُ فَقَالَ ادْنُ فَكُلْ أَوْ قَالَ ادْنُ فَاطْعَمْ فَقُلْتُ إِنِّي صَائِمٌ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ عَنْ الْمُسَافِرِ شَطْرَ الصَّلَاةِ وَالصِّيَامَ وَعَنْ الْحَامِلِ وَالْمُرْضِعِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] dia berkata; telah menceritakan kepada kami [Habban] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Ibnu 'Uyainah] dari [Ayyub] dari [seorang Syaikh yang berasal dari Qusyair], dari [pamannya], dia menceritakan kepada kami, -kemudian kami mengikutinya yang pada waktu itu dia berada diatas untanya-, Maka Abu Qilabah berkata kepadanya; Ceritakanlah kepadanya, syaikh itu berkata; 'Pamanku telah menceritakan kepadaku bahwa ia pernah pergi dengan menaiki untanya yang berakhir di tempat Nabi shallallahu 'alaihi wasallam sedangkan beliau sedang makan -atau ia mengatakan, \"Beliau sedang makan\"-. Maka beliau bersabda: \"Kemari dan makanlah\", atau beliau bersabda: \"Kemari dan makanlah.\" Aku berkata; \" aku sedang berpuasa!\" lalu beliau bersabda: \" Allah -Azza Wa Jalla- telah membebaskan setengah sholat dan puasa dari orang yang bepergian dan dari wanita yang sedang hamil serta menyusui.\""
            },
            {
                "number": 2177,
                "arab": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا سُرَيْجٌ قَالَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ قَالَ حَدَّثَنِي أَبُو قِلَابَةَ هَذَا الْحَدِيثَ ثُمَّ قَالَ هَلْ لَكَ فِي صَاحِبِ الْحَدِيثِ فَدَلَّنِي عَلَيْهِ فَلَقِيتُهُ فَقَالَ حَدَّثَنِي قَرِيبٌ لِي يُقَالُ لَهُ أَنَسُ بْنُ مَالِكٍ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِبِلٍ كَانَتْ لِي أُخِذَتْ فَوَافَقْتُهُ وَهُوَ يَأْكُلُ فَدَعَانِي إِلَى طَعَامِهِ فَقُلْتُ إِنِّي صَائِمٌ فَقَالَ ادْنُ أُخْبِرْكَ عَنْ ذَلِكَ إِنَّ اللَّهَ وَضَعَ عَنْ الْمُسَافِرِ الصَّوْمَ وَشَطْرَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Abu Bakr bin 'Ali] dia berkata; telah menceritakan kepada kami [Suraij] dia berkata; telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Ayyub] dia berkata; telah menceritakan kepadaku [Abu Qilabah] tentang Hadits ini, kemudian dia berkata; 'Apakah kamu tahu [siapa yang membawakan Hadits] ini? Lalu ia menunjukannya, kemudian aku menemuinya, ia berkata; telah menceritakan kepadaku orang yang dekat denganku, yaitu [Anas bin Malik] dia berkata; \"Aku pernah menemui Rasulullah shallallahu 'alaihi wasallam dengan menaiki unta milikku, lalu aku mendapati beliau sedang makan, maka beliau mengajakku makan bersamanya. Aku berkata; \" aku sedang berpuasa.\" Lalu beliau bersabda: \"Kemarilah, kuberitahukan kepadamu tentang hal itu, Allah telah membebaskan puasa dan setengah sholat dari orang yang bepergian.\""
            },
            {
                "number": 2178,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ رَجُلٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَةٍ فَإِذَا هُوَ يَتَغَدَّى قَالَ هَلُمَّ إِلَى الْغَدَاءِ فَقُلْتُ إِنِّي صَائِمٌ قَالَ هَلُمَّ أُخْبِرْكَ عَنْ الصَّوْمِ إِنَّ اللَّهَ وَضَعَ عَنْ الْمُسَافِرِ نِصْفَ الصَّلَاةِ وَالصَّوْمَ وَرَخَّصَ لِلْحُبْلَى وَالْمُرْضِعِأَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي الْعَلَاءِ بْنِ الشِّخِّيرِ عَنْ رَجُلٍ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Khalid Al Hadza'] dari [Abu Qilabah] dari [seseorang], ia berkata: \"Aku pernah menemui Rasulullah shallallahu 'alaihi wasallam karena suatu kebutuhan, ternyata beliau sedang makan siang, beliau bersabda: \"Marilah makan siang.\" Maka aku berkata, \" aku sedang berpuasa.\" Beliau bersabda: \"Kemarilah, kuberitahukan kepadamu tentang puasa, Allah telah membebaskan setengah sholat dan puasa dari orang yang bepergian memberikan keringanan kepada wanita hamil yang sedang menyusui.\" Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; Telah memberitakan kepada kami [Abdullah] dari [Khalid Al Hadza'] dari [Abu Al 'Allaa'i bin As Syakhir] dari [seseorang] seperti itu juga."
            },
            {
                "number": 2179,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ هَانِئِ بْنِ الشِّخِّيرِ عَنْ رَجُلٍ مِنْ بَلْحَرِيشٍ عَنْ أَبِيهِ قَالَكُنْتُ مُسَافِرًا فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا صَائِمٌ وَهُوَ يَأْكُلُ قَالَ هَلُمَّ قُلْتُ إِنِّي صَائِمٌ قَالَ تَعَالَ أَلَمْ تَعْلَمْ مَا وَضَعَ اللَّهُ عَنْ الْمُسَافِرِ قُلْتُ وَمَا وَضَعَ عَنْ الْمُسَافِرِ قَالَ الصَّوْمَ وَنِصْفَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Hani' bin Asy Syikhkhir] dari seseorang yang berasal dari Balharisy, dari [Bapaknya] dia berkata: Aku pernah bepergian, lalu aku menemui Rasulullah shallallahu 'alaihi wasallam, dan -saat itu- aku sedang berpuasa, sedangkan beliau sedang makan. Beliau bersabda: \"Kemarilah.\" Aku berkata; \" aku sedang berpuasa.\" Beliau bersabda: \"Kemarilah, tidakkah kamu mengetahui apa yang telah Allah bebaskan dari orang yang bepergian?\" Aku berkata; \"Apa yang Allah bebaskan dari orang yang bepergian?\" beliau bersabda: \"Puasa dan sholat.\""
            },
            {
                "number": 2180,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ هَانِئِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ رَجُلٍ مِنْ بَلْحَرِيشٍ عَنْ أَبِيهِ قَالَكُنَّا نُسَافِرُ مَا شَاءَ اللَّهُ فَأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَطْعَمُ فَقَالَ هَلُمَّ فَاطْعَمْ فَقُلْتُ إِنِّي صَائِمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُحَدِّثُكُمْ عَنْ الصِّيَامِ إِنَّ اللَّهَ وَضَعَ عَنْ الْمُسَافِرِ الصَّوْمَ وَشَطْرَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami ['Abdurrahman bin Muhammad bin Sallam] dia berkata; telah menceritakan kepada kami [Abu Dawud] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Hani' bin 'Abdullah bin Asy Syikhkhir] dari seorang lelaki yang berasal dari Balharisy, dari [bapaknya], dia berkata; \"Kami pernah bepergian sesuai yang dikehendaki Allah, lalu kami menemui Rasulullah shallallahu 'alaihi wasallam, dan -saat itu- beliau sedang makan. Maka beliau bersabda: \"Mari, makanlah.\" Aku berkata; \" aku sedang berpuasa.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kuceritakan kepada kalian tentang puasa, Allah telah membebaskan puasa dan setengah sholat bagi orang yang bepergian.\""
            },
            {
                "number": 2181,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْكَرِيمِ قَالَ حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ هَانِئِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ قَالَكُنْتُ مُسَافِرًا فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَأْكُلُ وَأَنَا صَائِمٌ فَقَالَ هَلُمَّ قُلْتُ إِنِّي صَائِمٌ قَالَ أَتَدْرِي مَا وَضَعَ اللَّهُ عَنْ الْمُسَافِرِ قُلْتُ وَمَا وَضَعَ اللَّهُ عَنْ الْمُسَافِرِ قَالَ الصَّوْمَ وَشَطْرَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin 'Abdul Karim] dia berkata; telah menceritakan kepada kami [Sahl bin Bakkar] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Hani' bin 'Abdullah bin Asy Syakhkhir] dari [bapaknya] dia berkata; \"Aku pernah bepergian, lalu aku menemui Nabi shallallahu 'alaihi wasallam dan -saat itu- beliau sedang makan dan aku sedang berpuasa. Beliau bersabda: \"Kemarilah.\" Aku berkata, \" aku sedang berpuasa.\" Beliau bertanya: \"Apakah kamu tahu apa yang Allah bebaskan dari orang yang bepergian?\" Aku bertanya; Apa yang telah Allah bebaskan bagi orang yang bebepergian? Beliau bersabda: \"Puasa dan setengah sholat.\""
            },
            {
                "number": 2182,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ قَالَ أَنْبَأَنَا إِسْرَائِيلُ عَنْ مُوسَى هُوَ ابْنُ أَبِي عَائِشَةَ عَنْ غَيْلَانَ قَالَخَرَجْتُ مَعَ أَبِي قِلَابَةَ فِي سَفَرٍ فَقَرَّبَ طَعَامًا فَقُلْتُ إِنِّي صَائِمٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فِي سَفَرٍ فَقَرَّبَ طَعَامًا فَقَالَ لِرَجُلٍ ادْنُ فَاطْعَمْ قَالَ إِنِّي صَائِمٌ قَالَ إِنَّ اللَّهَ وَضَعَ عَنْ الْمُسَافِرِ نِصْفَ الصَّلَاةِ وَالصِّيَامَ فِي السَّفَرِ فَادْنُ فَاطْعَمْ فَدَنَوْتُ فَطَعِمْتُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami ['ubaidhullah] dia berkata; telah memberitakan kepada kami [Israil] dari [Musa bin Abu 'Aisyah] dari [Ghailan] dia berkata; \"Aku pernah keluar bersama [Abu Qilabah] dalam suatu perjalanan, lalu ia menyuguhkan makanan, kemudian aku berkata; \" aku berpuasa.\" Ia berkata; \" Rasulullah shallallahu 'alaihi wasallam pernah berangkat dalam suatu perjalanan, lalu menyuguhkan makanan seraya berkata kepada seseorang: \"Mari, makanlah.\" Orang itu berkata; \" Aku sedang berpuasa.\" Beliau bersabda: \"Allah telah membebaskan setengah sholat dan puasa dalam perjalanan, dari orang yang sedang bepergian, maka kemari dan makanlah.\" Lalu aku mendekat dan makan.\""
            },
            {
                "number": 2183,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ مُوَرِّقٍ الْعِجْلِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ فَنَزَلْنَا فِي يَوْمٍ حَارٍّ وَاتَّخَذْنَا ظِلَالًا فَسَقَطَ الصُّوَّامُ وَقَامَ الْمُفْطِرُونَ فَسَقَوْا الرِّكَابَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ الْمُفْطِرُونَ الْيَوْمَ بِالْأَجْرِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dia berkata; telah menceritakan kepada kami ['Ashim Al Ahwal] dari [Muwarriq Al 'Ijli] dari [Anas bin Malik] dia berkata; \"Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, di antara kami ada yang berpuasa dan ada yang berbuka. Lalu kami singgah di hari yang panas dan kami membuat tempat untuk berteduh, orang-orang yang berpuasa tidak dapat melakukan aktivitas, sedangkan orang-orang yang berbuka mereka dapat melakukannya, lalu mereka memberi minum hewan tunggangannya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang yang berbuka pada hari ini telah pergi dengan membawa pahala.\""
            },
            {
                "number": 2184,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ قَالَ حَدَّثَنَا مَعْنٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَيُقَالُ الصِّيَامُ فِي السَّفَرِ كَالْإِفْطَارِ فِي الْحَضَرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Aban Al Balkhi] dia berkata; telah menceritakan kepada kami [Ma'n] dari [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [Abu Salamah bin 'Abdurrahman] dari ['Abdurrahman bin 'Auf] dia berkata; \"Dikatakan bahwa puasa pada waktu safar seperti halnya berbuka pada waktu mukim (tidak bersafar).\""
            },
            {
                "number": 2185,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ قَالَ حَدَّثَنَا حَمَّادُ الْخَيَّاطِ وَأَبُو عَامِرٍ قَالَا حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَالصَّائِمُ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Ayyub] dia berkata; telah menceritakan kepada kami [Hammad Al Khayyath] dan [Abu 'Amir] mereka berkata; telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [Abu Salamah] dari ['Abdurrahman bin 'Auf] dia berkata; \"Orang yang berpuasa pada waktu safar seperti halnya orang yang berbuka pada waktu mukim (tidak bersafar).\""
            },
            {
                "number": 2186,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِيهِ قَالَالصَّائِمُ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Yahya bin Ayyub] dia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dia berkata; telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [Humaid bin 'Abdurrahman bin 'Auf] dari [Bapaknya] dia berkata; \"Orang yang berpuasa pada waktu safar seperti halnya orang yang berbuka pada waktu mukim (tidak bersafar).\""
            },
            {
                "number": 2187,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا سُوَيْدٌ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فِي رَمَضَانَ فَصَامَ حَتَّى أَتَى قُدَيْدًا ثُمَّ أُتِيَ بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبَ وَأَفْطَرَ هُوَ وَأَصْحَابُهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] dia berkata; telah memberitakan kepada kami [Suwaid] dia berkata; telah mengabarkan kepada kami ['Abdullah] dari [Syu'bah] dari [Al Hakam] dari [Miqsam] dari [Ibnu 'Abbas], bahwa Nabi shallallahu 'alaihi wasallam keluar pada -bulan- ramadhan, lalu beliau berpuasa hingga sampai di Qudaid, kemudian diberi segelas susu, lalu meminumnya. Maka beliau dan para sahabatnya berbuka."
            },
            {
                "number": 2188,
                "arab": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا عَبْثَرٌ عَنْ الْعَلَاءِ بْنِ الْمُسَيَّبِ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَصَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ حَتَّى أَتَى قُدَيْدًا ثُمَّ أَفْطَرَ حَتَّى أَتَى مَكَّةَ",
                "id": "Telah mengabarkan kepada kami [Al Qasim bin Zakaria] dia berkata; telah menceritakan kepada kami [Sa'id bin 'Amr] dia berkata; telah menceritakan kepada kami ['Abtsar] dari [Al 'Ala bin Al Musayyab] dari [Al Hakam bin 'Utaibah] dari [Mujahid] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam berpuasa sejak dari Madinah hingga ke Qudaid, kemudian berbuka hingga sampai di Makkah.\""
            },
            {
                "number": 2189,
                "arab": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ أَنْبَأَنَا الْحَسَنُ بْنُ عِيسَى قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَامَ فِي السَّفَرِ حَتَّى أَتَى قُدَيْدًا ثُمَّ دَعَا بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبَ فَأَفْطَرَ هُوَ وَأَصْحَابُهُ",
                "id": "Telah mengabarkan kepada kami [Zakaria bin Yahya] dia berkata; telah memberitakan kepada kami [Al Hasan bin 'Isa] dia berkata; telah memberitakan kepada kami [Ibnul Mubarak] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Al Hakam] dari [Miqsam] dari [Ibnu 'Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam berpuasa dalam perjalanan hingga sampai Qudaid, kemudian beliau meminta segelas susu, lalu meminumnya, maka beliau dan para sahabatnya berbuka.\""
            },
            {
                "number": 2190,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ فَصَامَ حَتَّى أَتَى عُسْفَانَ فَدَعَا بِقَدَحٍ فَشَرِبَ قَالَ شُعْبَةُ فِي رَمَضَانَفَكَانَ ابْنُ عَبَّاسٍ يَقُولُ مَنْ شَاءَ صَامَ وَمَنْ شَاءَ أَفْطَرَ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Manshur] dari [Mujahid] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah keluar ke Makkah, lalu beliau berpuasa hingga sampai Usfan, kemudian beliau meminta segelas susu dan meminumnya pada -bulan- ramadhan. Ibnu Abbas berkata; \"Barangsiapa yang ingih (berpuasa), boleh berpuasa dan barangsiapa yang ingin (berbuka), boleh berbuka.\""
            },
            {
                "number": 2191,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ عَنْ جَرِيرٍ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَسَافَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِإِنَاءٍ فَشَرِبَ نَهَارًا يَرَاهُ النَّاسُ ثُمَّ أَفْطَرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] dari [Jarir] dari [Manshur] dari [Mujahid] dari [Thawus] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bepergian pada -bulan- ramadhan, lalu ia berpuasa hingga sampai Usfan, kemudian meminta segelas (susu) lalu meminum di siang hari yang dilihat oleh orang banyak, kemudian berbuka.\""
            },
            {
                "number": 2192,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْعَوَّامِ بْنِ حَوْشَبٍ قَالَ قُلْتُ لِمُجَاهِدٍالصَّوْمُ فِي السَّفَرِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ وَيُفْطِرُ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Al 'Awwam bin Hausyab] dia berkata; \"Aku bertanya kepada [Mujahid], \"Tentang berpuasa dalam bepergian?\" ia menjawab; \"Rasulullah shallallahu 'alaihi wasallam berpuasa dan berbuka.\""
            },
            {
                "number": 2193,
                "arab": "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا حُسَيْنٌ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ قَالَ أَخْبَرَنِي مُجَاهِدٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَامَ فِي شَهْرِ رَمَضَانَ وَأَفْطَرَ فِي السَّفَرِ",
                "id": "Telah mengabarkan kepadaku [Hilal bin Al 'Ala] dia berkata; telah menceritakan kepada kami [Husain] dia berkata; telah menceritakan kepada kami [Zuhair] dia berkata; telah menceritakan kepada kami [Abu Ishaq] dia berkata; telah mengabarkan kepadaku [Mujahid] bahwa Rasulullah shallallahu 'alaihi wasallam berpuasa di bulan ramadhan dan berbuka dalam perjalanan.\""
            },
            {
                "number": 2194,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا أَزْهَرُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ قَالَ إِنْ ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا إِنْ شِئْتَ صُمْتَ وَإِنْ شِئْتَ أَفْطَرْتَأَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّ حَمْزَةَ بْنَ عَمْرٍو قَالَ يَا رَسُولَ اللَّهِ مِثْلَهُ مُرْسَلٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah menceritakan kepada kami [Azhar bin Al Qasim] dia berkata; telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Sulaiman bin Yasar] dari [Hamzah bin 'Amru Al Aslami], bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang puasa dalam perjalanan? Beliau bersabda: \"Jika -kemudian beliau menyebutkan kalimat yang artinya- engkau ingin berpuasa, boleh berpuasa dan jika engkau ingin berbuka, boleh berbuka.\" Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Al Laits] dari [Bukair] dari [Sulaiman bin Yasar] bahwa [Hamzah bin Amru] berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam... seperti Hadits diatas secara mursal.\" "
            },
            {
                "number": 2195,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ قَالَ إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari ['Abdul Hamid bin Ja'far] dari ['Imran bin Abu Ansa] dari [Sulaiman bin Yasar] dari [Hamzah] dia berkata; \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang puasa dalam perjalanan, beliau bersabda: \"Jika engkau ingin berpuasa, maka berpuasalah dan jika engkau ingin berbuka, maka berbukalah.\""
            },
            {
                "number": 2196,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا أَبُو بَكْرٍ قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ بْنِ عَمْرٍو قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ فَقَالَ إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Abu Bakr] dia berkata; telah menceritakan kepada kami ['Abdul Hamid bin Ja'far] dari ['Imran bin Abu Anas] dari [Sulaiman bin Yasar] dari [Hamzah bin 'Amr] dia berkata; \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang puasa dalam perjalanan? Beliau bersabda: 'Jika engkau ingin berpuasa, berpuasalah dan jika engkau ingin berbuka, berbukalah'.\""
            },
            {
                "number": 2197,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ وَاللَّيْثُ فَذَكَرَ آخَرَ عَنْ بُكَيْرٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ قَالَيَا رَسُولَ اللَّهِ إِنِّي أَجِدُ قُوَّةً عَلَى الصِّيَامِ فِي السَّفَرِ قَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku ['Amr bin Al Harits] dan [Al Laits] kemudian dia menyebutkan yang selainnya, dari [Bukair] dari [Sulaiman bin Yasar] dari [Hamzah bin 'Amru Al Aslami] dia berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, sungguh aku mampu untuk puasa dalam perjalanan.\" Beliau bersabda: \"Jika engkau ingin berpuasa, berpuasalah dan jika engkau ingin berbuka, berbukalah.\""
            },
            {
                "number": 2198,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ أَنْبَأَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ أَخْبَرَنِي عِمْرَانُ بْنُ أَبِي أَنَسٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَمْزَةَ بْنِ عَمْرٍوأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ قَالَ إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepadaku [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Muhammad bin Bakr] dia berkata; telah memberitakan kepada kami ['Abdul Hamid bin Ja'far] dia berkata; telah mengabarkan kepadaku ['Imran bin Abu Anas] dari [Abu Salamah bin 'Abdurrahman] dari [Hamzah bin 'Amru] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang puasa dalam perjalanan? Beliau bersabda: \"Jika engkau ingin berpuasa, berpuasalah dan jika engkau ingin berbuka, maka berbukalah.\""
            },
            {
                "number": 2199,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا مُحَمَّدٌ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ وَحَنْظَلَةَ بْنِ عَلِيٍّ قَالَ حَدَّثَانِي جَمِيعًا عَنْ حَمْزَةَ بْنِ عَمْرٍو قَالَكُنْتُ أَسْرُدُ الصِّيَامَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَسْرُدُ الصِّيَامَ فِي السَّفَرِ فَقَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Bakkar] dia berkata; telah menceritakan kepada kami [Ahmad bin Khalid] dia berkata; telah menceritakan kepada kami [Muhammad] dari ['Imran bin Abu Anas] dari [Sulaiman bin Yasar] dan [Hanzhalah bin 'Ali] dia berkata; keduanya telah menceritakan kepadaku dari [Hamzah bin 'Amru] dia berkata; \"Di masa Rasulullah shallallahu 'alaihi wasallam aku berpuasa terus-menerus. Lalu aku bertanya; \"Wahai Rasulullah shallallahu 'alaihi wasallam, aku puasa terus-menerus dalam perjalanan? Maka beliau bersabda: \"Jika engkau ingin berpuasa, maka berpuasalah dan jika engkau ingin berbuka, maka berbukalah.\""
            },
            {
                "number": 2200,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ عَنْ حَنْظَلَةَ بْنِ عَلِيٍّ عَنْ حَمْزَةَ قَالَقُلْتُ يَا نَبِيَّ اللَّهِ إِنِّي رَجُلٌ أَسْرُدُ الصِّيَامَ أَفَأَصُومُ فِي السَّفَرِ قَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'd bin Ibrahim] dia berkata; [pamanku] telah menceritakan kepada kami, dia berkata; [bapakku] telah menceritakan kepada kami, dari [Ibnu Ishaq] dari ['Imran bin Abu Anas] dari [Hanzhalah bin 'Ali] dari [Hamzah] dia berkata; Aku bertanya; \"Wahai Nabi Allah, aku sering berpuasa dalam perjalanan?\" Beliau bersabda: \"Jika engkau ingin berpuasa, maka berpuasalah dan jika engkau ingin berbuka, maka berbukalah.\""
            },
            {
                "number": 2201,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي عِمْرَانُ بْنُ أَبِي أَنَسٍ أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ حَدَّثَهُ أَنَّ أَبَا مُرَاوِحٍ حَدَّثَهُ أَنَّ حَمْزَةَ بْنَ عَمْرٍو حَدَّثَهُأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ رَجُلًا يَصُومُ فِي السَّفَرِ فَقَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'd] dia berkata; [pamanku] telah menceritakan kepada kami, dia berkata; [bapakku] telah menceritakan kepada kami, dari [Ibnu Ishaq] dia berkata; telah menceritakan kepadaku ['Imran bin Abu Anas] bahwasanya [Sulaiman bin Yasar] menceritakan kepadanya dari [Abu Murawih] dari [Hamzah bin 'Amru] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam -ia adalah orang yang selalu berpuasa dalam perjalanan-, maka beliau bersabda: \"Jika engkau ingin berpuasa, maka berpuasalah dan jika engkau ingin berbuka, berbukalah.\""
            },
            {
                "number": 2202,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَنْبَأَنَا عَمْرٌو وَذَكَرَ آخَرَ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ أَبِي مُرَاوِحٍ عَنْ حَمْزَةَ بْنِ عَمْرٍوأَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجِدُ فِيَّ قُوَّةً عَلَى الصِّيَامِ فِي السَّفَرِ فَهَلْ عَلَيَّ جُنَاحٌ قَالَ هِيَ رُخْصَةٌ مِنْ اللَّهِ عَزَّ وَجَلَّ فَمَنْ أَخَذَ بِهَا فَحَسَنٌ وَمَنْ أَحَبَّ أَنْ يَصُومَ فَلَا جُنَاحَ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah memberitakan kepada kami ['Amru] -dan dia menyebutkan selainnya- dari [Abul Aswad] dari ['Urwah] dari [Abu Murawih] dari [Hamzah bin 'Amru] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Aku mampu untuk berpuasa dalam perjalanan, apakah aku berdosa?\" Beliau bersabda: \"Itu adalah keringanan dari Allah -Azza Wa Jalla-, barangsiapa mengambilnya, itu baik dan barangsiapa ingin berpuasa, tidak ada dosa atas dirinya.\""
            },
            {
                "number": 2203,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ بِشْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصُومُ فِي السَّفَرِ قَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] dari [Muhammad bin Bisyr] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Hamzah bin 'Amru Al Aslami] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Apakah aku boleh berpuasa dalam perjalanan? Beliau bersabda: \"Jika engkau ingin berpuasa, maka berpuasalah dan jika engkau ingin berbuka, berbukalah.\""
            },
            {
                "number": 2204,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ الْحَسَنِ اللَّانِيُّ بِالْكُوفَةِ قَالَ حَدَّثَنَا عَبْدُ الرَّحِيمِ الرَّازِيُّ عَنْ هِشَامٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ حَمْزَةَ بْنِ عَمْرٍو أَنَّهُ قَالَيَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَصُومُ أَفَأَصُومُ فِي السَّفَرِ قَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Al Hasan Al Lani] -seorang dari Kufah- dia berkata; telah menceritakan kepada kami ['Abdurrahim Ar Razi] dari [Hisyam] dari ['Urwah] dari ['Aisyah] dari [Hamzah bin 'Amru] bahwasanya dia berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, aku sering berpuasa, apakah aku boleh berpuasa dalam perjalanan?\" Beliau bersabda: \"Jika engkau ingin berpuasa, berpuasalah dan jika engkau ingin berbuka, berbukalah.\""
            },
            {
                "number": 2205,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْإِنَّ حَمْزَةَ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ أَصُومُ فِي السَّفَرِ وَكَانَ كَثِيرَ الصِّيَامِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah memberitakan kepada kami [Ibnul Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] dia berkata; bahwasanya Hamzah bertanya kepada Rasulullah shallallahu 'alaihi wasallam: \"Wahai Rasulullah shallallahu 'alaihi wasallam, aku berpuasa dalam perjalanan -ia sering berpuasa-? Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika engkau ingin berpuasa, berpuasalah dan jika engkau ingin berbuka, berbukalah.\""
            },
            {
                "number": 2206,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ ابْنِ عَجْلَانَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْإِنَّ حَمْزَةَ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَصُومُ فِي السَّفَرِ فَقَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepadali ['Amr bin Hisyam] dia berkata; telah menceritakan kepada kami [Muhammad bin Salamah] dari [Ibnu 'Ajlan] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] dia berkata; bahwasanya Hamzah pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam, lalu ia berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, apakah aku boleh berpuasa dalam perjalanan?\" beliau bersabda: \"Jika engkau ingin berpuasa, a berpuasalah dan jika engkau ingin berbuka, berbukalah.\""
            },
            {
                "number": 2207,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ حَمْزَةَ الْأَسْلَمِيَّ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ وَكَانَ رَجُلًا يَسْرُدُ الصِّيَامَ فَقَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdah bin Sulaiman] dia berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] bahwasanya Hamzah Al Aslami pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang berpuasa dalam perjalanan -ia adalah orang yang sering berpuasa-. Maka beliau bersabda: \"Jika engkau ingin berpuasa, maka berpuasalah dan jika engkau ingin berbuka, maka berbukalah.\""
            },
            {
                "number": 2208,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ قَالَ حَدَّثَنَا أَبُو سَعِيدٍ قَالَكُنَّا نُسَافِرُ فِي رَمَضَانَ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ لَا يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا يَعِيبُ الْمُفْطِرُ عَلَى الصَّائِمِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabi] dia berkata; telah menceritakan kepada kami [Hammad] dari [Sa'id Al Jurairi] dari [Abu Nadlrah] dia berkata; telah menceritakan kepada kami [Abu Sa'id] dia berkata; \"Kami pernah bepergian pada -bulan- ramadhan, lalu di antara kami ada yang berpuasa dan ada yang berbuka, orang yang berpuasa tidak mencela orang yang berbuka dan orang yang berbuka tidak mencela orang yang berpuasa.\""
            },
            {
                "number": 2209,
                "arab": "أَخْبَرَنَا سَعِيدُ بْنُ يَعْقُوبَ الطَّالْقَانِيُّ قَالَ حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ عَنْ أَبِي مَسْلَمَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَكُنَّا نُسَافِرُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ وَلَا يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا يَعِيبُ الْمُفْطِرُ عَلَى الصَّائِمِ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Ya'qub Ath Thalqani] dia berkata; telah menceritakan kepada kami [Khalid bin 'Abdullah Al Wasithi] dari [Abu Maslamah] dari [Abu Nadlrah] dari [Abu Sa'id] dia berkata; \"Kami pernah melakukan perjalanan bersama Nabi shallallahu 'alaihi wasallam, lalu di antara kami ada yang berpuasa dan ada yang tidak dan orang yang berpuasa tidak mencela orang yang tidak puasa.\""
            },
            {
                "number": 2210,
                "arab": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ قَالَ حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي نَضْرَةَ عَنْ جَابِرٍ قَالَسَافَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَامَ بَعْضُنَا وَأَفْطَرَ بَعْضُنَا",
                "id": "Telah mengabarkan kepada kami [Abu Bakr bin 'Ali] dia berkata; telah menceritakan kepada kami [Al Qawariri] dia berkata; telah menceritakan kepada kami [Bisyr bin Manshur] dari ['Ashim Al Ahwal] dari [Abu Nadlrah] dari [Jabir] dia berkata; \"Kami pernah bepergian bersama Rasulullah shallallahu 'alaihi wasallam, lalu sebagian kami ada yang berpuasa dan ada yang tidak.\""
            },
            {
                "number": 2211,
                "arab": "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَرْوَانُ قَالَ حَدَّثَنَا عَاصِمٌ عَنْ أَبِي نَضْرَةَ الْمُنْذِرِ عَنْ أَبِي سَعِيدٍ وَجَابِرِ بْنِ عَبْدِ اللَّهِأَنَّهُمَا سَافَرَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَصُومُ الصَّائِمُ وَيُفْطِرُ الْمُفْطِرُ وَلَا يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا الْمُفْطِرُ عَلَى الصَّائِمِ",
                "id": "Telah mengabarkan kepadaku [Ayyub bin Muhammad] dia berkata; telah menceritakan kepada kami [Marwan] dia berkata; telah menceritakan kepada kami ['Ashim] dari [Abu Nadlrah Al Mundzir] dari [Abu Sa'id] dan [Jabir bin 'Abdullah] bahwasanya keduanya bersama Rasulullah shallallahu 'alaihi wasallam, maka yang ingin berpuasa, berpuasa, dan yang ingin berbuka, berbuka. Orang yang berpuasa tidak mencela orang yang berbuka dan orang yang berbuka tidak mencela orang yang berpuasa.\""
            },
            {
                "number": 2212,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ صَائِمًا فِي رَمَضَانَ حَتَّى إِذَا كَانَ بِالْكَدِيدِ أَفْطَرَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['ubaidhullah bin 'Abdullah] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah keluar pada tahun Fathu Makkah (pembukaan atas kota Makkah) dalam keadaan berpuasa pada -bulan- ramadhan, hingga ketika sampai di Kadid, beliau berbuka.\""
            },
            {
                "number": 2213,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا مُفَضَّلٌ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَسَافَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَامَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِإِنَاءٍ فَشَرِبَ نَهَارًا لِيَرَاهُ النَّاسُ ثُمَّ أَفْطَرَ حَتَّى دَخَلَ مَكَّةَ فَافْتَتَحَ مَكَّةَ فِي رَمَضَانَ قَالَ ابْنُ عَبَّاسٍ فَصَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ وَأَفْطَرَ فَمَنْ شَاءَ صَامَ وَمَنْ شَاءَ أَفْطَرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah menceritakan kepada kami [Yahya bin Adam] dia berkata; telah menceritakan kepada kami [Mufadhdhal] dari [Manshur] dari [Mujahid] dari [Thawus] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah bepergian, dan berpuasa hingga sampai Usfan, kemudian meminta segelas -air- dan meminumnya di siang hari agar dilihat orang banyak, lalu beliau berbuka hingga sampai Makkah, kemudian menaklukan Makkah pada -bulan ramadhan.\" Ibnu Abbas berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah berpuasa dalam perjalanan dan -pernah juga- berbuka, barangsiapa yang ingin berpuasa, boleh berpuasa dan barangsiapa yang ingin berbuka, boleh berbuka.\""
            },
            {
                "number": 2214,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ عَنْ وُهَيْبِ بْنِ خَالِدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَوَادَةَ الْقُشَيْرِيُّ عَنْ أَبِيهِ عَنْ أَنَسِ بْنِ مَالِكٍ رَجُلٌ مِنْهُمْأَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ وَهُوَ يَتَغَدَّى فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلُمَّ إِلَى الْغَدَاءِ فَقَالَ إِنِّي صَائِمٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ لِلْمُسَافِرِ الصَّوْمَ وَشَطْرَ الصَّلَاةِ وَعَنْ الْحُبْلَى وَالْمُرْضِعِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur] dia berkata; telah menceritakan kepada kami [Muslim bin Ibrahim] dari [Wuhaib bin Khalid] dia berkata; telah menceritakan kepada kami ['Abdullah bin Suwadah Al Qusyairi] dari [Bapaknya] dari [Anas bin Malik] -salah seorang dari mereka- ia datang menemui Nabi shallallahu 'alaihi wasallam di Madinah, saat beliau sedang makan siang, lalu Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Marilah, makan siang.\" Lalu ia berkata; \"Aku sedang berpuasa.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \" Allah -Azza wa Jalla- membebaskan berpuasa dan setengah sholat dari orang yang bepergian dan dari wanita yang sedang hamil dan yang menyusui.\""
            },
            {
                "number": 2215,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ أَنْبَأَنَا بَكْرٌ وَهُوَ ابْنُ مُضَرَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرٍ عَنْ يَزِيدَ مَوْلَى سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ{ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ }كَانَ مَنْ أَرَادَ مِنَّا أَنْ يُفْطِرَ وَيَفْتَدِيَ حَتَّى نَزَلَتْ الْآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah memberitakan kepada kami [Bakr bin Mudlar] dari ['Amru bin Al Harits] dari [Bukair] dari [Yazid] -budak Salamah bin Al Akwa'- dari [Salamah bin Al Akwa'] dia berkata; \"Ketika ayat ini turun \"Dan wajib bagi orang-orang yang berat menjalankannya (jika mereka tidak puasa) membayar fidyah, (yaitu): memberi makan seorang miskin \" di antara kami ada yang ingin berbuka dan membayar fidyah, hingga turun ayat selanjutnya, lalu ayat tersebut menghapusnya.\""
            },
            {
                "number": 2216,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا وَرْقَاءُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍفِي قَوْلِهِ عَزَّ وَجَلَّ{ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ }يُطِيقُونَهُ يُكَلَّفُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ وَاحِدٍ{ فَمَنْ تَطَوَّعَ خَيْرًا }طَعَامُ مِسْكِينٍ آخَرَ لَيْسَتْ بِمَنْسُوخَةٍ{ فَهُوَ خَيْرٌ لَهُ وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ }لَا يُرَخَّصُ فِي هَذَا إِلَّا لِلَّذِي لَا يُطِيقُ الصِّيَامَ أَوْ مَرِيضٍ لَا يُشْفَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yazid] dia berkata; telah memberitakan kepada kami [Warqa'] dari ['Amr bin Dinar] dari ['Atha] dari [Ibnu 'Abbas] tentang firman Allah Azza wa Jalla: \"Dan wajib bagi orang-orang yang berat menjalankannya (jika mereka tidak berpuasa) membayar fidyah, (yaitu): memberi makan seorang miskin.\" Berat menjalankannya artinya: dibebani membayar fidyah, memberi makan satu orang miskin.\"Barangsiapa yang dengan kerelaan mengerjakan kebajikan.\" Memberi makan seorang miskin yang lain, bukanlah ayat yang mansukh, \"tapi itulah yang baik baginya. Dan berpuasa lebih baik bagimu\" dalam hal ini tidak diberikan keringanan kecuali bagi orang yang tidak mampu berpuasa atau sakit yang tidak diharapkan sembuhnya.\""
            },
            {
                "number": 2217,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا عَلِيٌّ يَعْنِي ابْنَ مُسْهِرٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ مُعَاذَةَ الْعَدَوِيَّةِأَنَّ امْرَأَةً سَأَلَتْ عَائِشَةَ أَتَقْضِي الْحَائِضُ الصَّلَاةَ إِذَا طَهُرَتْ قَالَتْ أَحَرُورِيَّةٌ أَنْتِ كُنَّا نَحِيضُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ نَطْهُرُ فَيَأْمُرُنَا بِقَضَاءِ الصَّوْمِ وَلَا يَأْمُرُنَا بِقَضَاءِ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami ['Ali bin Mushir] dari [Sa'id] dari [Qatadah] dari [Mu'adzah Al 'Adawiyyah] bahwasanya seorang wanita bertanya kepada ['Aisyah], \"Apakah seorang wanita yang haidl boleh mengqadla sholat jika telah suci?\" Aisyah berkata; \"Apakah kamu berpaham Haruriyah (golongan Khawarij)? Kami pernah mengalami haidl pada masa Rasulullah shallallahu 'alaihi wasallam, setelah suci, beliau menyuruh kami untuk mengganti puasa dan tidak menyuruh kami untuk mengqadla sholat.\" "
            },
            {
                "number": 2218,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ سَمِعْتُ أَبَا سَلَمَةَ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْإِنْ كَانَ لَيَكُونُ عَلَيَّ الصِّيَامُ مِنْ رَمَضَانَ فَمَا أَقْضِيهِ حَتَّى يَجِيءَ شَعْبَانُ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; Aku mendengar [Abu Salamah] menceritakan dari ['Aisyah] dia berkata; \"Jika saya harus melaksanakan puasa ramadhan, maka saya tidak mengqadlanya hingga datang -bulan- Sya'ban.\""
            },
            {
                "number": 2219,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ عَبْدِ اللَّهِ بْنِ يُونُسَ أَبُو حَصِينٍ قَالَ حَدَّثَنَا عَبْثَرٌ قَالَ حَدَّثَنَا حُصَيْنٌ عَنْ الشَّعْبِيِّ عَنْ مُحَمَّدِ بْنِ صَيْفِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَاشُورَاءَ أَمِنْكُمْ أَحَدٌ أَكَلَ الْيَوْمَ فَقَالُوا مِنَّا مَنْ صَامَ وَمِنَّا مَنْ لَمْ يَصُمْ قَالَ فَأَتِمُّوا بَقِيَّةَ يَوْمِكُمْ وَابْعَثُوا إِلَى أَهْلِ الْعَرُوضِ فَلْيُتِمُّوا بَقِيَّةَ يَوْمِهِمْ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Ahmad bin 'Abdullah bin Yunus Abu Hashin] dia berkata; telah menceritakan kepada kami ['Abtsar] dia berkata; telah menceritakan kepada kami [Hushain] dari [Asy Sya'bi] dari [Muhammad bin Shaifi] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada hari Asyura: \"Apakah ada salah seorang di antara kalian yang makan pada hari ini?\" Mereka menjawab; \"Di antara kami ada yang berpuasa dan ada yang tidak berpuasa.\" Beliau bersabda: \"Maka sempurnakanlah waktu yang tersisa dari hari kalian ini dan pergilah kepada penduduk (Makkah dan Madinah serta sekitarnya) hendaklah mereka menyempurnakan waktu yang masih tersisa dari hari mereka.\""
            },
            {
                "number": 2220,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى عَنْ يَزِيدَ قَالَ حَدَّثَنَا سَلَمَةُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ أَذِّنْ يَوْمَ عَاشُورَاءَ مَنْ كَانَ أَكَلَ فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ وَمَنْ لَمْ يَكُنْ أَكَلَ فَلْيَصُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Yahya] dari [Yazid] dia berkata; telah menceritakan kepada kami [Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada seseorang: \"Beritahukanlah dengan -adanya- hari Asyura: Barangsiapa yang makan, maka hendaklah ia menyempurnakan waktu yang masih tersisa dari harinya dan barangsiapa yang belum makan, hendaklah ia berpuasa.\""
            },
            {
                "number": 2221,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَاصِمُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ طَلْحَةَ بْنِ يَحْيَى بْنِ طَلْحَةَ عَنْ مُجَاهِدٍ عَنْ عَائِشَةَ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَالَ هَلْ عِنْدَكُمْ شَيْءٌ فَقُلْتُ لَا قَالَ فَإِنِّي صَائِمٌ ثُمَّ مَرَّ بِي بَعْدَ ذَلِكَ الْيَوْمِ وَقَدْ أُهْدِيَ إِلَيَّ حَيْسٌ فَخَبَأْتُ لَهُ مِنْهُ وَكَانَ يُحِبُّ الْحَيْسَ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ أُهْدِيَ لَنَا حَيْسٌ فَخَبَأْتُ لَكَ مِنْهُ قَالَ أَدْنِيهِ أَمَا إِنِّي قَدْ أَصْبَحْتُ وَأَنَا صَائِمٌ فَأَكَلَ مِنْهُ ثُمَّ قَالَ إِنَّمَا مَثَلُ صَوْمِ الْمُتَطَوِّعِ مَثَلُ الرَّجُلِ يُخْرِجُ مِنْ مَالِهِ الصَّدَقَةَ فَإِنْ شَاءَ أَمْضَاهَا وَإِنْ شَاءَ حَبَسَهَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Manshur] dia berkata; telah menceritakan kepada kami ['Ashim bin Yusuf] dia berkata; telah menceritakan kepada kami [Abul Ahwash] dari [Thalhah bin Yahya bin Thalhah] dari [Mujahid] dari ['Aisyah] dia berkata; \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam masuk menemuiku lalu bersabda: \"Apakah kamu memiliki sesuatu?\" Aku menjawab; \"Tidak.\" Beliau bersabda: \" Maka aku berpuasa.\" Kemudian beliau menemuiku lagi setelah hari itu dan telah dihadiahkan hais (makanan yang terbuat dari kurma) untukku, maka kusimpan makanan itu untuk beliau-padahal beliau menyukai hais-. Ia berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, kita diberi hadiah hais, lalu kusimpan makanan itu untukmu.\" Beliau bersabda: \"Bawalah kemari, pagi tadi aku berniat untuk berpuasa.\" Lalu beliau memakannya, kemudian bersabda: ', perumpamaan puasa sunnah seperti seorang yang mengeluarkan hartanya untuk bersedekah, jika ia ingin bersedekah, maka boleh menyedekahkannya dan jika ia ingin manahannya, boleh menahannya.'"
            },
            {
                "number": 2222,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَزِيدُ أَنْبَأَنَا شَرِيكٌ عَنْ طَلْحَةَ بْنِ يَحْيَى بْنِ طَلْحَةَ عَنْ مُجَاهِدٍ عَنْ عَائِشَةَ قَالَتْدَارَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَوْرَةً قَالَ أَعِنْدَكِ شَيْءٌ قَالَتْ لَيْسَ عِنْدِي شَيْءٌ قَالَ فَأَنَا صَائِمٌ قَالَتْ ثُمَّ دَارَ عَلَيَّ الثَّانِيَةَ وَقَدْ أُهْدِيَ لَنَا حَيْسٌ فَجِئْتُ بِهِ فَأَكَلَ فَعَجِبْتُ مِنْهُ فَقُلْتُ يَا رَسُولَ اللَّهِ دَخَلْتَ عَلَيَّ وَأَنْتَ صَائِمٌ ثُمَّ أَكَلْتَ حَيْسًا قَالَ نَعَمْ يَا عَائِشَةُ إِنَّمَا مَنْزِلَةُ مَنْ صَامَ فِي غَيْرِ رَمَضَانَ أَوْ غَيْرِ قَضَاءِ رَمَضَانَ أَوْ فِي التَّطَوُّعِ بِمَنْزِلَةِ رَجُلٍ أَخْرَجَ صَدَقَةَ مَالِهِ فَجَادَ مِنْهَا بِمَا شَاءَ فَأَمْضَاهُ وَبَخِلَ مِنْهَا بِمَا بَقِيَ فَأَمْسَكَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Dawud] dia berkata; telah menceritakan kepada kami [Yazid]; telah memberitakan kepada kami [Syarik] dari [Thalhah bin Yahya bin Thalhah] dari [Mujahid] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah memeriksaku (bertanya kepadaku) sekali, beliau bersabda: \"Apakah kamu memiliki sesuatu?\" Ia menjawab; \"Aku tidak memiliki sesuatu pun.\" Beliau bersabda: \"Maka aku berpuasa.\" Ia berkata, \"Kemudian beliau memeriksaku (bertanya kepadaku) untuk kedua kalinya, dan telah dihadiahkan hais (makanan yang terbuat dari korma) untuk kami, lalu aku datang dengan membawa makanan tersebut, kemudian beliau memakannya, maka aku heran karenanya! Aku bertanya; \"Wahai Rasulullah shallallahu 'alaihi wasallam, engkau masuk menemuiku dalam keadaan berpuasa, kemudian engkau makan hais?\" beliau bersabda: \"Ya, wahai Aisyah, kedudukan orang yang berpuasa selain ramadhan atau selain mengqadha puasa ramadhan, atau puasa sunnah, seperti seorang yang mengeluarkan sedekah hartanya, lalu ia menjadi orang yang dermawan dengan keinginannya, lalu ia meneruskannya dan menjadi kikir dengan -sesuatu- yang masih tersisa, lalu ia menahannya.\""
            },
            {
                "number": 2223,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْهَيْثَمِ قَالَ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ مُجَاهِدٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجِيءُ وَيَقُولُ هَلْ عِنْدَكُمْ غَدَاءٌ فَنَقُولُ لَا فَيَقُولُ إِنِّي صَائِمٌ فَأَتَانَا يَوْمًا وَقَدْ أُهْدِيَ لَنَا حَيْسٌ فَقَالَ هَلْ عِنْدَكُمْ شَيْءٌ قُلْنَا نَعَمْ أُهْدِيَ لَنَا حَيْسٌ قَالَ أَمَا إِنِّي قَدْ أَصْبَحْتُ أُرِيدُ الصَّوْمَ فَأَكَلَخَالَفَهُ قَاسِمُ بْنُ يَزِيدَ",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Al Haitsam] dia berkata; telah menceritakan kepada kami [Abu Bakr Al Hanafi] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Thalhah bin Yahya] dari [Mujahid] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah datang seraya bertanya: \"Apakah kamu memiliki makanan?\" Kami menjawab; \"Tidak.\" Beliau bersabda: \" aku berpuasa.\" Lalu pada suatu hari beliau datang menemui kami dan telah dihadiahkan hais untuk kami, lalu beliau bertanya: \"Apakah kamu memiliki sesuatu?\" Kami menjawab; \"Ya, telah dihadiahkan hais untuk kami.\" Beliau bersabda: \" pagi tadi aku berniat untuk berpuasa.\" Lalu beliau makan.\" Qasim bin Yazid menyelisihinya."
            },
            {
                "number": 2224,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا قَاسِمٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقُلْنَا أُهْدِيَ لَنَا حَيْسٌ قَدْ جَعَلْنَا لَكَ مِنْهُ نَصِيبًا فَقَالَ إِنِّي صَائِمٌ فَأَفْطَرَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Harb] dia berkata; telah menceritakan kepada kami [Qasim] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Thalhah bin Yahya] dari ['Aisyah binti Thalhah] dari ['Aisyah] dia berkata; Pada suatu hari Rasulullah shallallahu 'alaihi wasallam datang menemui kami, lalu kami berkata; \"Telah dihadiahkan hais untuk kami, dan kami sisakan sebagian untuk engkau.\" Maka beliau bersabda: \" aku sedang berpuasa.\" Lalu beliau berbuka.\""
            },
            {
                "number": 2225,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى قَالَ حَدَّثَتْنِي عَائِشَةُ بِنْتُ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِيهَا وَهُوَ صَائِمٌ فَقَالَ أَصْبَحَ عِنْدَكُمْ شَيْءٌ تُطْعِمِينِيهِ فَنَقُولُ لَا فَيَقُولُ إِنِّي صَائِمٌ ثُمَّ جَاءَهَا بَعْدَ ذَلِكَ فَقَالَتْ أُهْدِيَتْ لَنَا هَدِيَّةٌ فَقَالَ مَا هِيَ قَالَتْ حَيْسٌ قَالَ قَدْ أَصْبَحْتُ صَائِمًا فَأَكَلَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Thalhah bin Yahya] dia berkata; telah menceritakan kepadaku ['Aisyah bintu Thalhah] dari ['Aisyah] -Ummul Mukminin-, bahwa Nabi shallallahu 'alaihi wasallam datang menemuinya, saat itu beliau sedang berpuasa, lalu bersabda: \"Pagi ini apakah kamu memiliki sesuatu yang dengannya kamu memberiku makan?\" Ia manjawab; \"Tidak.\" Beliau bersabda: \" aku berpuasa.\" Setelah itu beliau datang lagi menemui Aisyah, lalu Aisyah berkata; \"Sesuatu telah dihadiahkan kepada kita.\" Beliau bertanya: \"Apa itu?\" Ia menjawab; \"Hais.\" Beliau bersabda: \"Pagi tadi aku berniat untuk berpuasa.\" Lalu beliau makan.\""
            },
            {
                "number": 2226,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ عَمَّتِهِ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَقَالَ هَلْ عِنْدَكُمْ شَيْءٌ قُلْنَا لَا قَالَ فَإِنِّي صَائِمٌ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Thalhah bin Yahya] dari ['Aisyah bintu Thalhah] dari ['Aisyah] Ummul Mukminin, dia berkata: Pada suatu hari Rasulullah shallallahu 'alaihi wasallam masuk menemuiku lalu bersabda: \"Apakah kamu memiliki sesuatu?\" Kami menjawab, \"Tidak.\" Beliau bersabda: \"Maka aku berpuasa.\""
            },
            {
                "number": 2227,
                "arab": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ أَخْبَرَنِي أَبِي عَنْ الْقَاسِمِ بْنِ مَعْنٍ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ وَمُجَاهِدٍ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَاهَا فَقَالَ هَلْ عِنْدَكُمْ طَعَامٌ فَقُلْتُ لَا قَالَ إِنِّي صَائِمٌ ثُمَّ جَاءَ يَوْمًا آخَرَ فَقَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّا قَدْ أُهْدِيَ لَنَا حَيْسٌ فَدَعَا بِهِ فَقَالَ أَمَا إِنِّي قَدْ أَصْبَحْتُ صَائِمًا فَأَكَلَأَخْبَرَنِي عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا الْمُعَافَى بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا الْقَاسِمُ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ مُجَاهِدٍ وَأُمِّ كُلْثُومٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى عَائِشَةَ فَقَالَ هَلْ عِنْدَكُمْ طَعَامٌ نَحْوَهُ قَالَ أَبُو عَبْد الرَّحْمَنِ وَقَدْ رَوَاهُ سِمَاكُ بْنُ حَرْبٍ قَالَ حَدَّثَنِي رَجُلٌ عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ",
                "id": "Telah mengabarkan kepadaku [Abu Bakr bin 'Ali] dia berkata; telah menceritakan kepada kami [Nashr bin 'Ali] dia berkata; [bapakku] telah mengabarkan kepadaku dari [Al Qasim bin Ma'n] dari [Thalhah bin Yahya] dari ['Aisyah bintu Thalhah] dan [Mujahid] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam datang menemuinya lalu bersabda: \"Apakah kalian memiliki makanan?\" Aku menjawab, \"Tidak.\" Beliau bersabda: ' aku berpuasa.' Kemudian di hari yang lain beliau datang menemuinya, lalu Aisyah berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, telah dihadiahkan hais untuk kita, maka beliau memintanya dan bersabda: \" pagi tadi aku berniat untuk berpuasa.\" Lalu beliau makan.\" Telah mengabarkan kepadaku ['Amru bin Yahya bin Al Harits] dia berkata; Telah menceritakan kepadaku [Al Mu'afa bin Sulaiman] dia berkata; telah menceritakan kepada kami [Al Qasim] dari [Thalhah bin Yahya] dari [Mujahid] dari [Ummu Kultsum] bahwa Rasulullah shallallahu 'alaihi wasallam menemui Aisyah beliau berkata: 'Apakah kamu memiliki makanan?, -seperti Hadist diatas-. Abu Abdurrahman berkata; dan Simak bin Harb telah meriwayatkannya dia berkata; Telah menceritakan kepadaku seorang laki-laki, dari Aisyah binti Thalhah. "
            },
            {
                "number": 2228,
                "arab": "أَخْبَرَنِي صَفْوَانُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ حَدَّثَنِي رَجُلٌ عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَالَ هَلْ عِنْدَكُمْ مِنْ طَعَامٍ قُلْتُ لَا قَالَ إِذًا أَصُومُ قَالَتْ وَدَخَلَ عَلَيَّ مَرَّةً أُخْرَى فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ أُهْدِيَ لَنَا حَيْسٌ فَقَالَ إِذًا أُفْطِرُ الْيَوْمَ وَقَدْ فَرَضْتُ الصَّوْمَ",
                "id": "Telah mengabarkan kepadaku [Shafwan bin 'Amr] dia berkata; telah menceritakan kepada kami [Ahmad bin Khalid] dia berkata; telah menceritakan kepada kami [Israil] dari [Simak bin Harb] dia berkata; telah menceritakan kepadaku [seorang lelaki] dari ['Aisyah bintu Thalhah] dari ['Aisyah] -Ummul Mukminin-, dia berkata; Pada suatu hari Rasulullah shallallahu 'alaihi wasallam datang seraya berkata: \"Apakah kalian memiliki makanan?\" Aku menjawab, \"Tidak.\" Beliau bersabda: \"Jika demikian, aku berpuasa.\" Aisyah berkata; \"Beliau masuk menemuiku lagi, lalu aku berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, telah dihadiahkan hais untuk kita, \" maka beliau bersabda: \"Jika demikian, hari ini aku berbuka, walaupun aku telah berniat berpuasa.\""
            },
            {
                "number": 2229,
                "arab": "أَخْبَرَنِي الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ شُرَحْبِيلَ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ حَفْصَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُبَيِّتْ الصِّيَامَ قَبْلَ الْفَجْرِ فَلَا صِيَامَ لَهُ",
                "id": "Telah mengabarkan kepadaku [Al Qasim bin Zakaria bin Dinar] dia berkata; telah menceritakan kepada kami [Sa'id bin Syurahbil] dia berkata; telah memberitakan kepada kami [Al Laits] dari [Yahya bin Ayyub] dari ['Abdullah bin Abu Bakr] dari [Salim bin 'Abdullah] dari ['Abdullah bin 'Umar] dari [Hafshah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang tidak berniat puasa pada malam hari sebelum terbit fajar, tidak ada puasa baginya.\""
            },
            {
                "number": 2230,
                "arab": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَ حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ عَنْ حَفْصَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُبَيِّتْ الصِّيَامَ قَبْلَ الْفَجْرِ فَلَا صِيَامَ لَهُ",
                "id": "Telah mengabarkan kepada kami ['Abdul Malik bin Syu'aib bin Al Laits bin Sa'd] dia berkata; [bapakku] telah menceritakan kepadaku dari [kakekku], dia berkata; telah menceritakan kepadaku [Yahya bin Ayyub] dari ['Abdullah bin Abu Bakr] dari [Ibnu Syihab] dari [Salim] dari ['Abdullah] dari [Hafshah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang tidak berniat puasa pada malam hari sebelum terbit fajar, tidak ada puasa baginya.\""
            },
            {
                "number": 2231,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ أَشْهَبَ قَالَ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ وَذَكَرَ آخَرَ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ حَدَّثَهُمَا عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ حَفْصَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُجْمِعْ الصِّيَامَ قَبْلَ طُلُوعِ الْفَجْرِ فَلَا يَصُومُ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin 'Abdullah bin 'Abdul Hakim] dari [Asyhab] dia berkata; telah mengabarkan kepadaku [Yahya bin Ayyub] -dan dia menyebutkan selainnya- bahwasanya ['Abdullah bin Abu Bakr bin Muhammad bin 'Amr bin Hazm] menceritakan kepada keduanya dari [Ibnu Syihab] dari [Salim bin 'Abdullah] dari [Bapaknya] dari [Hafshah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang tidak berniat puasa sebelum terbit fajar, maka ia -dianggap- tidak berpuasa.\""
            },
            {
                "number": 2232,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ الْأَزْهَرِ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُبَيِّتْ الصِّيَامَ مِنْ اللَّيْلِ فَلَا صِيَامَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Al Azhar] dia berkata; telah menceritakan kepada kami ['Abdurrazzaq] dari [Ibnu Juraij] dari [Ibnu Syihab] dari [Salim] dari [Ibnu 'Umar] dari [Hafshah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang tidak berniat puasa dari waktu malam, tidak ada puasa baginya.\""
            },
            {
                "number": 2233,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ عَنْ حَفْصَةَأَنَّهَا كَانَتْ تَقُولُ مَنْ لَمْ يُجْمِعْ الصِّيَامَ مِنْ اللَّيْلِ فَلَا يَصُومُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Mu'tamir] dia berkata; aku mendengar ['ubaidhullah] dari [Ibnu Syihab] dari [Salim] dari ['Abdullah] dari [Hafshah] bahwa ia berkata; \"Barangsiapa yang tidak berniat puasa diwaktu malam, ia -dianggap- tidak berpuasa.\""
            },
            {
                "number": 2234,
                "arab": "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا الْحَسَنُ بْنُ عِيسَى قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ حَفْصَةَ قَالَتْلَا صِيَامَ لِمَنْ لَمْ يُجْمِعْ قَبْلَ الْفَجْرِ",
                "id": "Telah mengabarkan kepadaku [Zakaria bin Yahya] dia berkata; telah menceritakan kepada kami [Al Hasan bin 'Isa] dia berkata; telah memberitakan kepada kami [Ibnul Mubarak] dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Hamzah bin 'Abdullah] dari ['Abdullah bin 'Umar] dari [Hafshah] dia berkata; \"Tidak ada puasa bagi orang yang tidak berniat sebelum terbit fajar.\""
            },
            {
                "number": 2235,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حَبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ وَمَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ عَنْ حَفْصَةَ قَالَتْلَا صِيَامَ لِمَنْ لَمْ يُجْمِعْ الصِّيَامَ قَبْلَ الْفَجْرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] dia berkata; telah memberitakan kepada kami [Habban] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Sufyan bin 'Uyainah] dan [Ma'mar] dari [Az Zuhri] dari [Hamzah bin 'Abdullah bin 'Umar] dari [bapaknya] dari [Hafshah] dia berkata; \"Tidak ada puasa bagi orang yang tidak berniat sebelum terbit fajar.\""
            }
        ]
    }
}