{
    "status": true,
    "data": {
        "start": 1789,
        "end": 1937,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 1789,
                "arab": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ بْنِ عَبْدِ الْجَبَّارِ عَنْ سُفْيَانَ قَالَ قَصَّهُ لَنَا عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ يَقُولُ قَالَ ابْنُ عَبَّاسٍ قَالَتْ عَائِشَةُإِنَّمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَزِيدُ الْكَافِرَ عَذَابًا بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami ['Abdul Jabbar bin Al 'Ala bin 'Abdul Jabbar] dari [Sufyan] dia berkata; ['Amru bin Dinar] mengisahkannya kepada kami, dia berkata; Aku mendengar [Ibnu Mulaikah] berkata; [Ibnu 'Abbas] berkata; ['Aisyah] berkata; \"Hanya saja Rasulullah shallallahu 'alaihi wasallam bersabda: \" Allah -Azza wa Jalla- menambahkan siksa kepada orang kafir karena sebagian tangisan keluarganya atas dirinya'.\""
            },
            {
                "number": 1790,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ الْبَلْخِيُّ قَالَ حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْوَرْدِ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ يَقُولُلَمَّا هَلَكَتْ أُمُّ أَبَانَ حَضَرْتُ مَعَ النَّاسِ فَجَلَسْتُ بَيْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ وَابْنِ عَبَّاسٍ فَبَكَيْنَ النِّسَاءُ فَقَالَ ابْنُ عُمَرَ أَلَا تَنْهَى هَؤُلَاءِ عَنْ الْبُكَاءِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِفَقَالَ ابْنُ عَبَّاسٍ قَدْ كَانَ عُمَرُ يَقُولُ بَعْضَ ذَلِكَ خَرَجْتُ مَعَ عُمَرَ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ رَأَى رَكْبًا تَحْتَ شَجَرَةٍ فَقَالَ انْظُرْ مَنْ الرَّكْبُ فَذَهَبْتُ فَإِذَا صُهَيْبٌ وَأَهْلُهُ فَرَجَعْتُ إِلَيْهِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ هَذَا صُهَيْبٌ وَأَهْلُهُ فَقَالَ عَلَيَّ بِصُهَيْبٍ فَلَمَّا دَخَلْنَا الْمَدِينَةَ أُصِيبَ عُمَرُ فَجَلَسَ صُهَيْبٌ يَبْكِي عِنْدَهُ يَقُولُ وَا أُخَيَّاهُ وَا أُخَيَّاهُ فَقَالَ عُمَرُ يَا صُهَيْبُ لَا تَبْكِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ قَالَ فَذَكَرْتُ ذَلِكَ لِعَائِشَةَ فَقَالَتْ أَمَا وَاللَّهِ مَا تُحَدِّثُونَ هَذَا الْحَدِيثَ عَنْ كَاذِبَيْنِ مُكَذَّبَيْنِ وَلَكِنَّ السَّمْعَ يُخْطِئُ وَإِنَّ لَكُمْ فِي الْقُرْآنِ لَمَا يَشْفِيكُمْ أَلَّا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى وَلَكِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ لَيَزِيدُ الْكَافِرَ عَذَابًا بِبُكَاءِ أَهْلِهِ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Manshur Al Balkhi] dia berkata; telah menceritakan kepada kami ['Abdul Jabbar bin Al warad]; Aku mendengar [Ibnu Abu Mulaikah] berkata; setelah Ibnu Aban meninggal dunia, aku datang bersama banyak orang, dan aku duduk diantara Abdullah bin Umar dan Ibnu Abbas, lalu para wanita menangis. [Ibnu Umar] berkata; \"Tidakkah engkau melarang mereka untuk menangis? aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" si mayit benar-benar akan disiksa karena tangisan sebagian keluarganya atas dirinya'. [Ibnu Abbas] berkata; \" [Umar] pernah mengatakan sebagian hal itu, -saat itu- aku keluar bersama Umar, hingga tatkala kami berada di Baida, ia melihat rombongan penunggang unta yang berada di bawah pohon, ia berkata; \"Lihatlah siapa penunggang unta tersebut?\" kemudian aku pergi, -untuk melihatnya- ternyata Shuhaib dengan keluarganya, lalu aku kembali, kemudian kukatakan; \"Wahai Amirul Mukminin! Mereka ini adalah Shuhaib dan keluarganya. Ia berkata, \"Datanglah Shuhaib kepadaku.\" Setelah kami masuk ke Madinah Umar tertimpa musibah, lalu Shuhaib duduk disisinya seraya berkata, \"Wahai adikku, wahai adikku! Umar berkata, \"Wahai Shuhaib, janganlah kamu menangis, aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: ' si mayit akan disiksa karena tangisan sebagian keluarganya atas dirinya.\" Ia berkata; \"Lalu aku menuturkan hal itu kepada [Aisyah], ia mengatakan; \"Demi Allah! Tidaklah kalian menceritakan hadits ini dari dua orang pendusta yang didustakan, tetapi pendengaran yang salah, di dalam al-qur'an benar-benar terdapat sesuatu yang dapat menentramkan bagi kalian, \"Dan seorang yang berdosa tidak dapat memikul dosa orang lain.\" Tetapi Rasulullah shallallahu 'alaihi wasallam bersabda: \" Allah benar-benar menambahkan siksa terhadap orang kafir karena sebagian tangis keluarganya atas dirinya'.\""
            },
            {
                "number": 1791,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ هُوَ ابْنُ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ أَنَّ سَلَمَةَ بْنَ الْأَزْرَقِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ قَالَمَاتَ مَيِّتٌ مِنْ آلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاجْتَمَعَ النِّسَاءُ يَبْكِينَ عَلَيْهِ فَقَامَ عُمَرُ يَنْهَاهُنَّ وَيَطْرُدُهُنَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُنَّ يَا عُمَرُ فَإِنَّ الْعَيْنَ دَامِعَةٌ وَالْقَلْبَ مُصَابٌ وَالْعَهْدَ قَرِيبٌ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Muhammad bin 'Amru bin Halhalah] dari [Muhammad bin 'Amru bin 'Atha] bahwasanya [Salamah bin Al Azraq] berkata; Aku mendengar [Abu Hurairah] berkata; \"Telah meninggal seseorang dari keluarga Rasulullah Shalallahu 'Alaihi Wa Sallam, lalu para wanita berkumpul menangisinya, maka Umar bangkit melarang mereka menangis dan mengusirnya. Kemudian Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: 'Biarkanlah mereka wahai Umar!, mata mereka mudah mencucurkan air mata, hati mudah bersedih, dan kiamat itu dekat.'"
            },
            {
                "number": 1792,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ حَدَّثَنَا عِيسَى عَنْ الْأَعْمَشِ ح أَنْبَأَنَا الْحَسَنُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ وَشَقَّ الْجُيُوبَ وَدَعَا بِدُعَاءِ الْجَاهِلِيَّةِ وَاللَّفْظُ لِعَلِيٍّ وَقَالَ الْحَسَنُ بِدَعْوَى",
                "id": "Telah mengabarkan kepada kami ['Ali bin Khasyram] dia berkata; telah menceritakan kepada kami ['Isa] dari [Al A'masy]. Demikian juga diriwayatkan dari jalur lain, telah memberitakan kepada kami [Al Hasan bin Isma'il] dia berkata; telah menceritakan kepada kami [Ibnu Idris] dari [Al A'masy] dari ['Abdullah bin Murrah] dari [Masruq] dari ['Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk golongan kami yang menampar pipi, merobek saku dan berseru dengan seruan Jahiliyyah.\" Lafazh ini dari Ali. Al Hasan berkata; -Dengan lafazh -."
            },
            {
                "number": 1793,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَوْفٍ عَنْ خَالِدٍ الْأَحْدَبِ عَنْ صَفْوَانَ بْنِ مُحْرِزٍ قَالَأُغْمِيَ عَلَى أَبِي مُوسَى فَبَكَوْا عَلَيْهِ فَقَالَ أَبْرَأُ إِلَيْكُمْ كَمَا بَرِئَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنَّا مَنْ حَلَقَ وَلَا خَرَقَ وَلَا سَلَقَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Sulaiman bin Harb] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Auf] dari [Khalid Al Ahdab] dari [Shafwan bin Muhriz] dia berkata; [Abu Musa] pernah jatuh pingsan, kemudian mereka menangisinya, lalu ia berkata, \"Aku berlepas diri dari kalian sebagaimana Rasulullah shallallahu 'alaihi wasallam berlepas diri dari kami, 'Bukan golongan kami yang mencukur (rambut kepala dan jenggot), merobek (baju) dan meratap -ketika tertimpa musibah-'.\""
            },
            {
                "number": 1794,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي زُبَيْدٌ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ وَشَقَّ الْجُيُوبَ وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; [Sufyan] dia berkata; telah menceritakan kepadaku [Zubaid] dari [Ibrahim] dari [Masruq] dari ['Abdullah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk golongan kami yang menampar pipi, merobek saku dan berseru dengan seruan Jahiliyyah.\""
            },
            {
                "number": 1795,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ أَنْبَأَنَا جَعْفَرُ بْنُ عَوْنٍ قَالَ حَدَّثَنَا أَبُو عُمَيْسٍ عَنْ أَبِي صَخْرَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ وَأَبِي بُرْدَةَ قَالَالَمَّا ثَقُلَ أَبُو مُوسَى أَقْبَلَتْ امْرَأَتُهُ تَصِيحُ قَالَا فَأَفَاقَ فَقَالَ أَلَمْ أُخْبِرْكِ أَنِّي بَرِيءٌ مِمَّنْ بَرِئَ مِنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَا وَكَانَ يُحَدِّثُهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنَا بَرِيءٌ مِمَّنْ حَلَقَ وَخَرَقَ وَسَلَقَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Utsman bin Hakim] dia berkata; telah memberitakan kepada kami [Ja'far bin 'Aun] dia berkata; telah menceritakan kepada kami [Abu 'Umais] dari [Abu Shakhrah] dari ['Abdurrahman bin Yazid] dan [Abu Burdah] mereka berkata; \"Setelah [Abu Musa] merasa berat (akan meninggal dunia), istrinya menemuinya lalu berteriak!\" Keduanya berkata lagi; \"Kemudian ia sadar\", ia lalu berkata: \"Bukankah telah kuberitahukan kepadamu bahwa aku berlepas diri dari orang yang Rasulullah shallallahu 'alaihi wasallam berlepas diri darinya?!\" Keduanya berkata, 'Ia menceritakan kepada istrinya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: 'Aku berlepas diri dari orang yang mencukur (rambut kepala dan jenggot), merobek (saku) dan meratap - ketika tertimpa musibah -'.\""
            },
            {
                "number": 1796,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ زُبَيْدٍ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ وَشَقَّ الْجُيُوبَ وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Zubaid] dari [Ibrahim] dari [Masruq] dari ['Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bukan termasuk golongan kami orang yang menampar pipi, merobek saku dan berseru dengan seruan Jahiliyyah -ketika tertimpa musibah-.\""
            },
            {
                "number": 1797,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ يَزِيدَ بْنِ أَوْسٍ عَنْ أَبِي مُوسَىأَنَّهُ أُغْمِيَ عَلَيْهِ فَبَكَتْ أُمُّ وَلَدٍ لَهُ فَلَمَّا أَفَاقَ قَالَ لَهَا أَمَا بَلَغَكِ مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْنَاهَا فَقَالَتْ قَالَ لَيْسَ مِنَّا مَنْ سَلَقَ وَحَلَقَ وَخَرَقَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Ibrahim] dari [Yazid bin Aus] dari [Abu Musa] bahwa ia pernah jatuh pingsan, kemudian istrinya menangis, setelah sadar, ia berkata kepadanya: \"Bukankah telah sampai kepadamu apa yang disabdakan Rasulullah shallallahu 'alaihi wasallam?!\" lalu kami bertanya -hal itu- kepada istrinya? Kemudian ia menjawab, beliau bersabda: \"Bukan termasuk golongan kami orang yang meratap, mencukur (rambut kepala dan jenggot) dan merobek (saku) -ketika tertimpa musibah.\""
            },
            {
                "number": 1798,
                "arab": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ يَزِيدَ بْنِ أَوْسٍ عَنْ أُمِّ عَبْدِ اللَّهِ امْرَأَةِ أَبِي مُوسَى عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنَّا مَنْ حَلَقَ وَسَلَقَ وَخَرَقَ",
                "id": "Telah mengabarkan kepada kami ['Abdah bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Yahya bin Adam] dia berkata; telah menceritakan kepada kami [Israil] dari [Manshur] dari [Ibrahim] dari [Yazid bin Aus] dari [Ummu 'Abdullah] -istri Abu Musa- dari [Abu Musa] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk golongan kami orang yang mencukur (rambut kepala dan jenggot), merobek (saku) dan meratap -ketika tertimpa musibah-.\""
            },
            {
                "number": 1799,
                "arab": "أَخْبَرَنَا هَنَّادٌ عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ سَهْمِ بْنِ مِنْجَابٍ عَنْ الْقَرْثَعِ قَالَلَمَّا ثَقُلَ أَبُو مُوسَى صَاحَتْ امْرَأَتُهُ فَقَالَ أَمَا عَلِمْتِ مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ بَلَى ثُمَّ سَكَتَتْ فَقِيلَ لَهَا بَعْدَ ذَلِكَ أَيُّ شَيْءٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ مَنْ حَلَقَ أَوْ سَلَقَ أَوْ خَرَقَ",
                "id": "Telah mengabarkan kepada kami [Hannad] dari [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Sahm bin Minjab] dari [Al Qartsa'] dia berkata; \"Tatkala [Abu Musa] telah merasa berat (akan meninggal dunia), istrinya berteriak! Maka ia berkata, 'Tidakkah engkau tahu apa yang telah disabdakan Rasulullah shallallahu 'alaihi wasallam?! ' ia menjawab; 'Ya', kemudian ia diam. Lalu setelah ditanyakan kepadanya, 'Apa yang telah disabdakan oleh Rasulullah shallallahu 'alaihi wasallam?!\" ia menjawab, ' Rasulullah shallallahu 'alaihi wasallam melaknat orang yang mencukur (rambut kepala), meratap atau merobek (saku) -ketika tertimpa musibah-.\""
            },
            {
                "number": 1800,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَاصِمِ بْنِ سُلَيْمَانَ عَنْ أَبِي عُثْمَانَ قَالَ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ قَالَأَرْسَلَتْ بِنْتُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِ أَنَّ ابْنًا لِي قُبِضَ فَأْتِنَا فَأَرْسَلَ يَقْرَأُ السَّلَامَ وَيَقُولُ إِنَّ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلُّ شَيْءٍ عِنْدَ اللَّهِ بِأَجَلٍ مُسَمًّى فَلْتَصْبِرْ وَلْتَحْتَسِبْ فَأَرْسَلَتْ إِلَيْهِ تُقْسِمُ عَلَيْهِ لَيَأْتِيَنَّهَا فَقَامَ وَمَعَهُ سَعْدُ بْنُ عُبَادَةَ وَمُعَاذُ بْنُ جَبَلٍ وَأُبَيُّ بْنُ كَعْبٍ وَزَيْدُ بْنُ ثَابِتٍ وَرِجَالٌ فَرُفِعَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّبِيُّ وَنَفْسُهُ تَقَعْقَعُ فَفَاضَتْ عَيْنَاهُ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ مَا هَذَا قَالَ هَذَا رَحْمَةٌ يَجْعَلُهَا اللَّهُ فِي قُلُوبِ عِبَادِهِ وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari ['Ashim bin Sulaiman] dari [Abu 'Utsman] dia berkata; telah menceritakan kepadaku [Usamah bin Zaid] dia berkata; \"Putri Nabi shallallahu 'alaihi wasallam mengutus seseorang kepada beliau, 'Bahwa anaku telah meninggal dunia, maka datanglah kepada kami! ' lalu beliau mengirim seseorang untuk mengucapkan salam dan mengatakan: \" milik Allah apa yang telah ia ambil dan miliknya apa yang telah diberikan, segala sesuatu telah ditentukan ajalnya disisi Allah, maka hendaknya bersabar dan berharap pahala.\" Lalu ia mengutus seseorang kepada beliau agar bersumpah akan mendatanginya. Kemudian beliau bangkit dan bersamanya Sa'd bin Ubadah, Mu'adz bin Jabal, Ubay bin Ka'b, Zaid bin Tsabit dan beberapa orang laki-laki. Lalu anak kecil itu dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam, jiwanya berdetak dan kedua matanya meneteskan air mata. Kemudian Sa'd berkata; \"Wahai Rasulullah, apa ini?\" beliau bersabda: \"Ini adalah rahmat yang Allah tumbuhkan didalam hati hamba-hamba-Nya, Allah mengasihi hamba-hamba-Nya yang berbelas kasih.\""
            },
            {
                "number": 1801,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ ثَابِتٍ قَالَ سَمِعْتُ أَنَسًا يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّبْرُ عِنْدَ الصَّدْمَةِ الْأُولَى",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Tsabit] dia berkata; Aku mendengar [Anas] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sabar adalah ketika mendapat tekanan (gejolak, hantaman) pertama kali.\""
            },
            {
                "number": 1802,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا أَبُو إِيَاسٍ وَهُوَ مُعَاوِيَةُ بْنُ قُرَّةَ عَنْ أَبِيهِ رَضِيَ اللَّهُ عَنْهُأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ ابْنٌ لَهُ فَقَالَ لَهُ أَتُحِبُّهُ فَقَالَ أَحَبَّكَ اللَّهُ كَمَا أُحِبُّهُ فَمَاتَ فَفَقَدَهُ فَسَأَلَ عَنْهُ فَقَالَ مَا يَسُرُّكَ أَنْ لَا تَأْتِيَ بَابًا مِنْ أَبْوَابِ الْجَنَّةِ إِلَّا وَجَدْتَهُ عِنْدَهُ يَسْعَى يَفْتَحُ لَكَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah menceritakan kepada kami [Abu Iyas Mu'awiyah bin Qurrah] dari [bapaknya] radliallahu 'anhu bahwa seseorang menemui Nabi shallallahu 'alaihi wasallam dengan membawa anaknya, beliau bertanya kepadanya: \"Apakah engkau mencintainya?\" ia menjawab: Kiranya Allah mencintaimu sebagaimana aku mencintainya. Kemudian hari anak itu meninggal dan ia pun merasa kehilangan. Lantas Ia bertanya tentang keadaan anaknya kepada beliau, lalu beliau bersabda: \"Tidaklah engkau ingin mendatangi pintu surga kecuali telah engkau dapatkan anakmu membukanya untukmu.\""
            },
            {
                "number": 1803,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ قَالَ أَنْبَأَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ أَنَّ عَمْرَو بْنَ شُعَيْبٍ كَتَبَ إِلَى عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ يُعَزِّيهِ بِابْنٍ لَهُ هَلَكَ وَذَكَرَ فِي كِتَابِهِ أَنَّهُ سَمِعَ أَبَاهُ يُحَدِّثُ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَا يَرْضَى لِعَبْدِهِ الْمُؤْمِنِ إِذَا ذَهَبَ بِصَفِيِّهِ مِنْ أَهْلِ الْأَرْضِ فَصَبَرَ وَاحْتَسَبَ وَقَالَ مَا أُمِرَ بِهِ بِثَوَابٍ دُونَ الْجَنَّةِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah menceritakan kepada kami ['Abdullah] dia berkata; telah memberitakan kepada kami ['Umar bin Sa'id bin Abu Husain] bahwa [Amru bin Syu'aib] menulis untuk Abdullah bin Abdurrahman bin Abu Husain yang menyatakan bela sungkawa kepadanya karena anaknya telah meninggal dunia. Dalam tulisan tersebut disebutkan; bahwa ia pernah mendengar [bapaknya] bercerita, dari kakeknya, [Abdullah bin Amru bin Al Ash], ia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \" Allah tidak ridha terhadap hamba-Nya yang beriman apabila sahabat karibnya dari penduduk bumi meninggal dunia, -lalu ia bersabar dan mengharap pahala.\" Beliau bersabda: \" memperoleh ganjaran yang diperintahkan baginya selain surga.\""
            },
            {
                "number": 1804,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي عَمْرٌو قَالَ حَدَّثَنِي بُكَيْرُ بْنُ عَبْدِ اللَّهِ عَنْ عِمْرَانَ بْنِ نَافِعٍ عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ احْتَسَبَ ثَلَاثَةً مِنْ صُلْبِهِ دَخَلَ الْجَنَّةَ فَقَامَتْ امْرَأَةٌ فَقَالَتْ أَوْ اثْنَانِ قَالَ أَوْ اثْنَانِ قَالَتْ الْمَرْأَةُ يَا لَيْتَنِي قُلْتُ وَاحِدًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amru bin As Sarh] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku ['Amru] dia berkata; telah menceritakan kepadaku [Bukair bin 'Abdullah] dari ['Imran bin Nafi'] dari [Hafsh bin 'ubaidhullah] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa berharap pahala dari ketiga anak kandungnya -yang telah meninggal dunia-, maka ia akan masuk surga.\" Lalu ada seorang wanita berdiri, ia berkata, \"Bagaimana dengan dua anak?\" beliau bersabda: \"Atau dua anak. Wanita itu berkata; \"Duhai andai kata aku mengatakan, 'Satu'.\""
            },
            {
                "number": 1805,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمٍ يُتَوَفَّى لَهُ ثَلَاثَةٌ مِنْ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ إِلَّا أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Hammad] dia berkata; telah menceritakan kepada kami ['Abdul Warits] dari ['Abdul 'Aziz] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang muslim yang ditinggal mati ketiga anaknya yang belum berusia dewasa, kecuali Allah akan memasukannya ke surga, karena keutamaan rahmat-Nya kepada mereka.\""
            },
            {
                "number": 1806,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ صَعْصَعَةَ بْنِ مُعَاوِيَةَ قَالَ لَقِيتُ أَبَا ذَرٍّقُلْتُ حَدِّثْنِي قَالَ نَعَمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمَيْنِ يَمُوتُ بَيْنَهُمَا ثَلَاثَةُ أَوْلَادٍ لَمْ يَبْلُغُوا الْحِنْثَ إِلَّا غَفَرَ اللَّهُ لَهُمَا بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] dari [Yunus] dari [Al Hasan] dari [Sha'sha'ah bin Mu'awiyah] dia berkata; Aku bertemu dengan [Abu Dzarr], Aku pernah bertemu dengan Abu Dzar, aku lalu berkata; \"Sampaikanlah hadits kepadaku?\" ia berkata; \"Ya, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah dua orang muslim meninggal dunia, di antara keduanya ada tiga orang anak (mereka adalah tiga bersaudara) yang belum berusia dewasa, kecuali Allah akan memasukkan keduanya ke surga dengan keutamaan rahmatNya kepada mereka.\""
            },
            {
                "number": 1807,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمُوتُ لِأَحَدٍ مِنْ الْمُسْلِمِينَ ثَلَاثَةٌ مِنْ الْوَلَدِ فَتَمَسَّهُ النَّارُ إِلَّا تَحِلَّةَ الْقَسَمِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Ibnu Syihab] dari [Sa'id] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah tiga anak milik salah seorang dari kaum Muslimin meninggal dunia, lalu ia tersentuh api neraka, kecuali sebatas melewatinya saja, yang Allah telah bersumpah siapapun akan melewatinya.\""
            },
            {
                "number": 1808,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ ابْنِ عُلَيَّةَ وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا إِسْحَقُ وَهُوَ الْأَزْرَقُ عَنْ عَوْفٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ مُسْلِمَيْنِ يَمُوتُ بَيْنَهُمَا ثَلَاثَةُ أَوْلَادٍ لَمْ يَبْلُغُوا الْحِنْثَ إِلَّا أَدْخَلَهُمَا اللَّهُ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ الْجَنَّةَ قَالَ يُقَالُ لَهُمْ ادْخُلُوا الْجَنَّةَ فَيَقُولُونَ حَتَّى يَدْخُلَ آبَاؤُنَا فَيُقَالُ ادْخُلُوا الْجَنَّةَ أَنْتُمْ وَآبَاؤُكُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim bin 'Ulayyah] dan ['Abdurrahman bin Muhammad] mereka berkata; telah menceritakan kepada kami [Ishaq Al Azraq] dari ['Auf] dari [Muhammad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah dua orang muslim meninggal dunia, di antara keduanya ada tiga orang anak (mereka adalah tiga bersaudara) yang belum berusia dewasa, kecuali Allah akan memasukkan keduanya ke surga dengan keutamaan rahmatNya kepada mereka.\" Beliau bersabda: \"Dikatakan kepada mereka; 'Masuklah kalian ke surga', lalu mereka berkata, '-Kami tidak akan masuk- hingga bapak-bapak kami masuk! ' lalu dikatakan; 'Masuklah kalian dan bapak-bapak kalian ke surga'.\""
            },
            {
                "number": 1809,
                "arab": "أَخْبَرَنَا إِسْحَقُ قَالَ أَنْبَأَنَا جَرِيرٌ قَالَ حَدَّثَنِي طَلْقُ بْنُ مُعَاوِيَةَ وَحَفْصُ بْنُ غِيَاثٍ قَالَ حَدَّثَنِي جَدِّي طَلْقُ بْنُ مُعَاوِيَةَ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَجَاءَتْ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِابْنٍ لَهَا يَشْتَكِي فَقَالَتْ يَا رَسُولَ اللَّهِ أَخَافُ عَلَيْهِ وَقَدْ قَدَّمْتُ ثَلَاثَةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ احْتَظَرْتِ بِحِظَارٍ شَدِيدٍ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Ishaq] dia berkata; telah memberitakan kepada kami [Jarir] dia berkata; telah menceritakan kepadaku [Thalq bin Mu'awiyah] dan [Hafsh bin Ghiyats] dia berkata; kakekku [Thalq bin Mu'awiyah] menceritakan kepadaku dari [Abu Zur'ah] dari [Abu Hurairah] dia berkata; Seorang wanita datang menemui Rasulullah shallallahu 'alaihi wasallam dengan membawa anaknya yang sedang sakit dan mengeluh. Lalu ia berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, aku khawatir terhadapnya, dan sungguh aku telah mempersembahkan tiga anak'. maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh engkau telah terhalang dengan tabir yang kuat dari api neraka'.\""
            },
            {
                "number": 1810,
                "arab": "أَخْبَرَنَا إِسْحَقُ قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى زَيْدًا وَجَعْفَرًا قَبْلَ أَنْ يَجِيءَ خَبَرُهُمْ فَنَعَاهُمْ وَعَيْنَاهُ تَذْرِفَانِ",
                "id": "Telah mengabarkan kepada kami [Ishaq] dia berkata; telah memberitakan kepada kami [Sulaiman bin Harb] dia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Humaid bin Hilal] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam mengumumkan kematian Zaid dan Ja'far sebelum datang berita mereka, beliau mengumumkan kematian mereka dan beliau meneteskan air mata.\""
            },
            {
                "number": 1811,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ وَابْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى لَهُمَا النَّجَاشِيَّ صَاحِبَ الْحَبَشَةِ الْيَوْمَ الَّذِي مَاتَ فِيهِ وَقَالَ اسْتَغْفِرُوا لِأَخِيكُمْ",
                "id": "Telah mengabarkan kepada kami [Abu Dawud] dia berkata; telah menceritakan kepada kami [Ya'qub] dia berkata; [bapakku] telah menceritakan kepada kami dari [Shalih] dari [Ibnu Syihab] dia berkata; telah menceritakan kepadaku [Abu Salamah] dan [Ibnul Musayyab] bahwasanya [Abu Hurairah] mengabarkan kepada keduanya; \"Rasulullah shallallahu 'alaihi wasallam mengumumkan kematian An-Najasyi, penguasa Habasyah, pada hari wafatnya dan bersabda: \"Mintakanlah ampunan untuk saudara kalian.\""
            },
            {
                "number": 1812,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ هُوَ ابْنُ يَزِيدَ الْمُقْرِئُ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِيءُ قَالَ حَدَّثَنَا أَبِي قَالَ سَعِيدٌ حَدَّثَنِي رَبِيعَةُ بْنُ سَيْفٍ الْمَعَافِرِيُّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَبَيْنَمَا نَحْنُ نَسِيرُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ بَصُرَ بِامْرَأَةٍ لَا تَظُنُّ أَنَّهُ عَرَفَهَا فَلَمَّا تَوَسَّطَ الطَّرِيقَ وَقَفَ حَتَّى انْتَهَتْ إِلَيْهِ فَإِذَا فَاطِمَةُ بِنْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا مَا أَخْرَجَكِ مِنْ بَيْتِكِ يَا فَاطِمَةُ قَالَتْ أَتَيْتُ أَهْلَ هَذَا الْمَيِّتِ فَتَرَحَّمْتُ إِلَيْهِمْ وَعَزَّيْتُهُمْ بِمَيِّتِهِمْ قَالَ لَعَلَّكِ بَلَغْتِ مَعَهُمْ الْكُدَى قَالَتْ مَعَاذَ اللَّهِ أَنْ أَكُونَ بَلَغْتُهَا وَقَدْ سَمِعْتُكَ تَذْكُرُ فِي ذَلِكَ مَا تَذْكُرُ فَقَالَ لَهَا لَوْ بَلَغْتِهَا مَعَهُمْ مَا رَأَيْتِ الْجَنَّةَ حَتَّى يَرَاهَا جَدُّ أَبِيكِقَالَ أَبُو عَبْد الرَّحْمَنِ رَبِيعَةُ ضَعِيفٌ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Fadhalah bin Ibrahim] dia berkata; telah menceritakan kepada kami ['Abdullah bin Yazid Al Muqri']. Demikkian juga diriwayatkan dari jalur lain, telah memberitakan kepada kami [Muhammad bin 'Abdullah bin Yazid Al Muqri'] dia berkata; [bapakku] telah menceritakan kepada kami, [Sa'id] berkata; telah menceritakan kepada kami [Rabi'ah bin Saif Al Ma'afiri] dari [Abu 'Abdurrahman Al Hubuli] dari ['Abdullah bin 'Amru] dia berkata; \"Ketika kami sedang berjalan bersama Rasulullah Shalallahu 'Alaihi Wa Sallam, tiba-tiba aku melihat seorang perempuan yang aku tidak menyangka kalau beliau mengenalinya. Tatkala beliau berjalan di tengah tiba-tiba beliau berhenti hingga wanita itu bertemu dengannya. Ternyata wanita itu adalah Fathimah binti Rasulullah Shalallahu 'Alaihi Wa Sallam. Lalu beliau berkata kepadanya; 'Kenapa kamu keluar dari rumah wahai Fathimah? Fathimah menjawab; 'Aku baru menjenguk keluarga Mayit ini dan aku merasa kasihan terhadap mereka sekaligus berta'ziyah. Rasulullah Shalallahu 'Alaihi Wa Sallam berkata kepadanya; 'Semoga kamu juga menyusul mereka ke kuburan.' Fathimah menjawab; 'Na'udzubillah kalau aku harus menyusul mereka, aku telah mendengar engkau menyebutkan tentang kuburan.' Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Kalau kamu menyusul mereka, kamu tidak akan melihat surga hingga kamu melihat kakek bapakmu.' Abu Abdurrahman berkata; 'Rabi'ah orangnya lemah.'"
            },
            {
                "number": 1813,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ أَنَّ أُمَّ عَطِيَّةَ الْأَنْصَارِيَّةَ قَالَتْدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَتْ ابْنَتُهُ فَقَالَ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حَقْوَهُ وَقَالَ أَشْعِرْنَهَا إِيَّاهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ayub] dari [Muhammad bin Sirin] bahwasanya [Ummu 'Athiyyah Al Anshariah] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah masuk menemui kami ketika puterinya meninggal dunia, lalu beliau bersabda: \"Mandikanlah ia tiga kali, lima kali atau lebih dari itu -jika hal itu kalian pandang perlu- dengan air dan bidara, dan pada bagian terakhir -di campur- dengan kapur barus atau sedikit kapur barus, jika kalian telah selesai, maka beritahulah aku.\" Setelah kami selesai kami memberitahukan kepada beliau, kemudian beliau memberikan kainnya kepada kami seraya bersabda: \"Bungkuslah ia dengan kain ini.\""
            },
            {
                "number": 1814,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْحَسَنِ مَوْلَى أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ عَنْ أُمِّ قَيْسٍ قَالَتْتُوُفِّيَ ابْنِي فَجَزِعْتُ عَلَيْهِ فَقُلْتُ لِلَّذِي يَغْسِلُهُ لَا تَغْسِلْ ابْنِي بِالْمَاءِ الْبَارِدِ فَتَقْتُلَهُ فَانْطَلَقَ عُكَّاشَةُ بْنُ مِحْصَنٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِقَوْلِهَا فَتَبَسَّمَ ثُمَّ قَالَ مَا قَالَتْ طَالَ عُمْرُهَا فَلَا نَعْلَمُ امْرَأَةً عَمِرَتْ مَا عَمِرَتْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Abul Hasan] -budak Ummu Qais bintu Mihshan- dari [Ummu Qais] dia berkata; \"Anakku meninggal maka aku sangat bersedih, aku katakan kepada yang memandikannya; 'Jangan kamu mandikan anakku dengan air dingin, karena jika demikan berarti kamu berarti telah membunuhnya. Ukasyah bin Mihsan lalu pergi menemui Rasulullah shallallahu 'alaihi wasallam mengabarkan perkataannya Ummu Qais. Rasulullah pun tersenyum kemudian bersabda: 'Apa yang dikatakannya akan memanjangkan umurnya.' maka kami tidak mengetahui seorang wanita yang lebih panjang umurnya dari dia.'"
            },
            {
                "number": 1815,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَيُّوبُ سَمِعْتُ حَفْصَةَ تَقُولُ حَدَّثَتْنَا أُمُّ عَطِيَّةَأَنَّهُنَّ جَعَلْنَ رَأْسَ ابْنَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ قُرُونٍ قُلْتُ نَقَضْنَهُ وَجَعَلْنَهُ ثَلَاثَةَ قُرُونٍ قَالَتْ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] dia berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dia berkata; [Ayyub] aku mendengar [Hafshah] berkata; telah menceritakan kepada kami [Ummu 'Athiyyah] bahwa para wanita mengepang rambut kepala putri Nabi shallallahu 'alaihi wasallam menjadi tiga kepangan. Aku berkata; \"Kami mengurainya dan mengepangnya menjadi tiga kepangan?\" ia menjawab, \"Ya.\""
            },
            {
                "number": 1816,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ خَالِدٍ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي غَسْلِ ابْنَتِهِ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Manshur] dia berkata; telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] dia berkata; telah menceritakan kepada kami [Isma'il] dari [Khalid] dari [Hafshah] dari [Ummu 'Athiyyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda tentang memandikan puterinya, \"Mulailah dengan bagian-bagian kanan tubuh dan tempat wudlu dari dirinya.\""
            },
            {
                "number": 1817,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَتْنَا حَفْصَةُ عَنْ أُمِّ عَطِيَّةَ قَالَتْمَاتَتْ إِحْدَى بَنَاتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَرْسَلَ إِلَيْنَا فَقَالَ اغْسِلْنَهَا بِمَاءٍ وَسِدْرٍ وَاغْسِلْنَهَا وِتْرًا ثَلَاثًا أَوْ خَمْسًا أَوْ سَبْعًا إِنْ رَأَيْتُنَّ ذَلِكِ وَاجْعَلْنَ فِي الْآخِرَةِ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حَقْوَهُ وَقَالَ أَشْعِرْنَهَا إِيَّاهُ وَمَشَطْنَاهَا ثَلَاثَةَ قُرُونٍ وَأَلْقَيْنَاهَا مِنْ خَلْفِهَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Hisyam] dia berkata; telah menceritakan kepada kami [Hafshah] dari [Ummu 'Athiyyah] dia berkata; \"Salah seorang puteri Nabi shallallahu 'alaihi wasallam meninggal dunia, lalu beliau mengutus kami, seraya bersabda: \"Mandikanlah ia dengan air dan bidara, dan mandikanlah dengan bilangan ganjil, tiga kali, lima kali atau tujuh kali -jika hal itu kalian anggap perlu-, dan pada terakhir kali dengan sedikit kapur barus, jika kalian telah selesai, maka beritahulah aku.\" Setelah selesai, kami memberitahu beliau, lalu beliau memberikan kainnya kepada kami seraya bersabda: \"Bungkuslah ia dengan kain ini.\" Kami mengepangnya menjadi tiga kepangan dan kami letakkan di belakangnya.\""
            },
            {
                "number": 1818,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ يَزِيدَ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حِقْوَهُ وَقَالَ أَشْعِرْنَهَا إِيَّاهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dari [Yazid] dia berkata; telah menceritakan kepada kami [Ayyub] dari [Muhammad bin Sirin] dari [Ummu 'Athiyyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam masuk menemui kami yang waktu itu kami sedang memandikan puterinya, lalu beliau bersabda: \"Mandikanlah ia tiga kali, lima kali atau lebih dari itu -jika hal itu kalian pandang perlu- dengan air dan daun bidara, dan pada bagian terakhir kali dengan kapur barus atau sedikit kapur barus, jika kalian telah selesai, maka beritahulah aku.\" Setelah kami selesai, kami memberitahukan beliau, kemudian beliau memberikan kainnya kepada kami seraya bersabda: \"Bungkuslah ia dengan kain ini.\""
            },
            {
                "number": 1819,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْتُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَرْسَلَ إِلَيْنَا فَقَالَ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حِقْوَهُ وَقَالَ أَشْعِرْنَهَا إِيَّاهُأَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَ نَحْوَهُ غَيْرَ أَنَّهُ قَالَ ثَلَاثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dia berkata; telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Ummu 'Athiyyah] dia berkata; \"Salah seorang puteri Nabi shallallahu 'alaihi wasallam meninggal dunia, lalu beliau mengutus kami, lalu beliau bersabda: \"Mandikanlah ia tiga kali, lima kali atau lebih dari itu -jika hal itu kalian pandang perlu- dengan air dan daun bidara, dan pada bagian terakhir kali dengan kapur barus atau sedikit kapur barus, jika kalian telah selesai, maka beritahulah aku.\" Setelah kami selesai, kami memberitahukan beliau, kemudian beliau memberikan kainnya kepada kami seraya bersabda: \"Bungkuslah ia dengan kain ini.\" Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Hafshah] dari [Ummu 'Athiyyah] sebagaimana Hadits diatas, namun berbeda pada kalimat, \"Mandikanlah ia tiga kali, lima kali, atau lebih dari itu -jika hal itu kalian pandang perlu.\" Dengan menambahkan tujuh kali."
            },
            {
                "number": 1820,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرٌ عَنْ سَلَمَةَ بْنِ عَلْقَمَةَ عَنْ مُحَمَّدٍ عَنْ بَعْضِ إِخْوَتِهِ عَنْ أُمِّ عَطِيَّةَ قَالَتْتُوُفِّيَتْ ابْنَةٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَنَا بِغَسْلِهَا فَقَالَ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ قَالَتْ قُلْتُ وِتْرًا قَالَ نَعَمْ وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حِقْوَهُ وَقَالَ أَشْعِرْنَهَا إِيَّاهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Bisyr] dari [Salamah bin 'Alqamah] dari [Muhammad] dari [sebagian saudaranya] dari [Ummu 'Athiyyah] dia berkata; Salah seorang puteri Nabi shallallahu 'alaihi wasallam meninggal dunia, lalu beliau menyuruh kami untuk memandikannya, beliau bersabda: \"Mandikanlah ia tiga kali, lima kali, tujuh kali atau lebih dari itu -jika hal itu kalian pandang perlu- Aku berkata; 'Dengan bilangannya yang ganjil?, beliau menjawab: Ya. Beliau melanjutkan; Dan hendaklah pada bagian terakhir kali dengan kapur barus atau sedikit kapur barus, jika kalian telah selesai, maka beritahulah aku.\" Setelah kami selesai, kami memberitahukan beliau, kemudian beliau memberikan kainnya kepada kami seraya bersabda: \"Bungkuslah ia dengan kain ini.\""
            },
            {
                "number": 1821,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حِقْوَهُ وَقَالَ أَشْعِرْنَهَا إِيَّاهُ قَالَ أَوْ قَالَتْ حَفْصَةُ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ سَبْعًاقَالَ وَقَالَتْ أُمُّ عَطِيَّةَ مَشَطْنَاهَا ثَلَاثَةَ قُرُونٍ أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ قَالَ أَخْبَرَتْنِي حَفْصَةُ عَنْ أُمِّ عَطِيَّةَ قَالَتْ وَجَعَلْنَا رَأْسَهَا ثَلَاثَةَ قُرُونٍ أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ وَقَالَتْ حَفْصَةُ عَنْ أُمِّ عَطِيَّةَ وَجَعَلْنَا رَأْسَهَا ثَلَاثَةَ قُرُونٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Zurarah] dia berkata; telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Muhammad] dari [Ummu 'Athiyyah] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam menemui kami yang waktu itu kami sedang memandikan putrinya, lalu beliau bersabda: \"Mandikanlah ia tiga kali, lima kali atau lebih dari itu -jika hal itu kalian pandang perlu- dengan air dan daun bidara, dan pada bagian terakhir kali dengan kapur barus atau sedikit kapur barus, jika kalian telah selesai, maka beritahulah aku.\" Setelah kami selesai, kami memberitahukan beliau, kemudian beliau memberikan kainnya kepada kami seraya bersabda: \"Bungkuslah ia dengan kain ini.\" Ummu 'Athiyyah berkata; 'Mandikanlah ia tiga kali, lima kali, atau tujuh kali. Dan Ummu 'Athiyyah berkata; 'kami mengepangnya dengan tiga kepangan.' Telah mengabarkan kepada kami Muhammad bin Manshur dia berkata; Telah menceritakan kepada kami Sufyan dia berkata; Telah menceritakan kepada kami Ayyub dari Muhammad dia berkata; Telah mengabarkan kepadaku Hafshah dari Ummu 'Athiyyah dia berkata; 'Kami menjadikan rambut kepalanya tiga kepangan. Telah mengabarkan kepada kami Qutaibah bin Sa'id dia berkata; telah menceritakan kepada kami Hammad dari Ayyub dan Hafshah berkata; dari Ummu Athiyyah; 'Kami menjadikan rambut kepalanya menjadi tiga kepangan.'"
            },
            {
                "number": 1822,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَيُّوبُ بْنُ أَبِي تَمِيمَةَ أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ سِيرِينَ يَقُولُكَانَتْ أُمُّ عَطِيَّةَ امْرَأَةٌ مِنْ الْأَنْصَارِ قَدِمَتْ تُبَادِرُ ابْنًا لَهَا فَلَمْ تُدْرِكْهُ حَدَّثَتْنَا قَالَتْ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا أَلْقَى إِلَيْنَا حِقْوَهُ وَقَالَ أَشْعِرْنَهَا إِيَّاهُ وَلَمْ يَزِدْ عَلَى ذَلِكَقَالَ لَا أَدْرِي أَيُّ بَنَاتِهِ قَالَ قُلْتُ مَا قَوْلُهُ أَشْعِرْنَهَا إِيَّاهُ أَتُؤَزَّرُ بِهِ قَالَ لَا أُرَاهُ إِلَّا أَنْ يَقُولَ الْفُفْنَهَا فِيهِ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] dia berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku [Ayyub bin Abu Tamimah] bahwasanya ia mendengar [Muhammad bin Sirin] berkata; bahwasanya [Ummu 'Athiyyah] -seorang wanita Anshar- datang hendak menyusul anaknya, tetapi tidak mendapatkannya! Ia telah menceritakan kepada kami seraya berkata; 'Nabi shallallahu 'alaihi wasallam masuk menemui kami pada saat kami memandikan puterinya, lalu bersabda: \"Mandikanlah ia tiga kali, lima kali atau lebih dari itu -jika hal itu kalian pandang perlu- dengan air dan daun bidara, dan pada bagian terakhir kali dengan kapur barus atau sedikit kapur barus, jika kalian telah selesai, maka beritahulah aku.\" Setelah kami selesai kami memberitahukan beliau, kemudian beliau memberikan kainnya kepada kami seraya bersabda: \"Bungkuslah ia dengan kain ini.' Dan tidak lebih dari itu.\" Muhammad bin Sirrin berkata; \"Aku tidak mengetahui putri beliau yang mana?\" ia berkata; \"Aku bertanya, 'Apa maksud sabda beliau: 'Bungkuslah ia dengan kain ini? Apakah ia diberi pakaian bawah dengan kain tersebut? '.\" Ia menjawab, \"Aku tidak mengetahuinya kecuali beliau hanya bersabda: \"Balutlah ia dengan kain ini.\""
            },
            {
                "number": 1823,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ النَّسَائِيُّ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْتُوُفِّيَ إِحْدَى بَنَاتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ وَاغْسِلْنَهَا بِالسِّدْرِ وَالْمَاءِ وَاجْعَلْنَ فِي آخِرِ ذَلِكِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي قَالَتْ فَآذَنَّاهُ فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ أَشْعِرْنَهَا إِيَّاهُ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf An Nasaa'i] dia berkata; telah menceritakan kepada kami [Yazid] dia berkata; telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] dari [Ummu 'Athiyyah] dia berkata; \"Salah seorang putri Nabi shallallahu 'alaihi wasallam meninggal dunia, lalu beliau bersabda: \"Mandikanlah ia tiga kali, lima kali atau lebih dari itu -jika hal itu kalian pandang perlu- dengan air dan daun bidara, dan pada bagian terakhir kali dengan kapur barus atau sedikit kapur barus, jika kalian telah selesai, maka beritahulah aku.\" Ummu Abu Athahiyyah berkata; Setelah selesai kami memberitahukan beliau, lalu beliau memberikan kainnya kepada kami seraya bersabda: \"Bungkuslah ia dengan kain ini.\""
            },
            {
                "number": 1824,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الرَّقِّيُّ الْقَطَّانُ وَيُوسُفُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ قَالَ أَنْبَأَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُخَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ رَجُلًا مِنْ أَصْحَابِهِ مَاتَ فَقُبِرَ لَيْلًا وَكُفِّنَ فِي كَفَنٍ غَيْرِ طَائِلٍ فَزَجَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْبَرَ إِنْسَانٌ لَيْلًا إِلَّا أَنْ يُضْطَرَّ إِلَى ذَلِكَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَلِيَ أَحَدُكُمْ أَخَاهُ فَلْيُحَسِّنْ كَفْنَهُ",
                "id": "Telah mengabarkan kepada kami ['Abdurrahman bin Khalid Ar Raqqi Al Qaththan] dan [Yusuf bin Sa'id] -dan lafadz ini miliknya- dia berkata; telah memberitakan kepada kami [Hajjaj] dari [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwasanya ia mendengar [Jabir] berkata; \"Rasulullah shallallahu 'alaihi wasallam berkhutbah, beliau menyebutkan salah seorang dari sahabatnya yang meninggal, lalu dikubur pada malam hari dan dikafani dengan kain kafan yang tidak besar, maka Rasulullah shallallahu 'alaihi wasallam mencegah seseorang di kubur di malam hari, kecuali jika mendesak. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian mengurusi saudaranya (yang meninggal), maka hendaknya ia membaguskan kain kafannya'.\""
            },
            {
                "number": 1825,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ أَبِي عَرُوبَةَ يُحَدِّثُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَسُوا مِنْ ثِيَابِكُمْ الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah memberitakan kepada kami [Yahya bin Sa'id] dia berkata; aku mendengar [Sa'id bin Abu 'Arubah] menceritakan dari [Ayyub] dari [Abu Qibalah] dari [Abul Muhallab] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pakailah baju kalian yang berwarna putih, karena itu lebih suci dan lebih baik, dan kafanilah orang-orang yang meninggal diantara kalian dengan kain tersebut.\""
            },
            {
                "number": 1826,
                "arab": "أَخْبَرَنَا إِسْحَقُ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكُفِّنَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثَةِ أَثْوَابٍ سُحُولِيَّةٍ بِيضٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq] dia berkata; telah memberitakan kepada kami ['Abdurrazzaq] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata; \"Nabi shallallahu 'alaihi wasallam dikafani dengan tiga lembar kain putih yang terbuat dari katun.\""
            },
            {
                "number": 1827,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُفِّنَ فِي ثَلَاثَةِ أَثْوَابٍ بِيضٍ سُحُولِيَّةٍ لَيْسَ فِيهَا قَمِيصٌ وَلَا عِمَامَةٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam dikafani dengan tiga lembar kain putih yang terbuat dari katun, tanpa ada baju dan serban.\""
            },
            {
                "number": 1828,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَفْصٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكُفِّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثَةِ أَثْوَابٍ بِيضٍ يَمَانِيَةٍ كُرْسُفٍ لَيْسَ فِيهَا قَمِيصٌ وَلَا عِمَامَةٌ فَذُكِرَ لِعَائِشَةَ قَوْلُهُمْ فِي ثَوْبَيْنِ وَبُرْدٍ مِنْ حِبَرَةٍ فَقَالَتْ قَدْ أُتِيَ بِالْبُرْدِ وَلَكِنَّهُمْ رَدُّوهُ وَلَمْ يُكَفِّنُوهُ فِيهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hafsh] dari [Hisyam] dari [bapaknya] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam dikafani dengan tiga lembar kain putih buatan Yaman berbahan dari katun, tanpa ada baju dan serban.\" Lalu perkataan mereka disebutkan kepada Aisyah, \"(dengan dua kain dan satu kain dari katun bermotif dari Yaman!) \" ia berkata; \"kain katun dengan motif itu telah dibawakan, namun mereka menolaknya dan mereka tidak mengkafani beliau dengan kain itu.\""
            },
            {
                "number": 1829,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ قَالَ حَدَّثَنَا نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَلَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ جَاءَ ابْنُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اعْطِنِي قَمِيصَكَ حَتَّى أُكَفِّنَهُ فِيهِ وَصَلِّ عَلَيْهِ وَاسْتَغْفِرْ لَهُ فَأَعْطَاهُ قَمِيصَهُ ثُمَّ قَالَ إِذَا فَرَغْتُمْ فَآذِنُونِي أُصَلِّي عَلَيْهِ فَجَذَبَهُ عُمَرُ وَقَالَ قَدْ نَهَاكَ اللَّهُ أَنْ تُصَلِّيَ عَلَى الْمُنَافِقِينَ فَقَالَ أَنَا بَيْنَ خِيرَتَيْنِ قَالَ اسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ فَصَلَّى عَلَيْهِ فَأَنْزَلَ اللَّهُ تَعَالَى{ وَلَا تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلَا تَقُمْ عَلَى قَبْرِهِ }فَتَرَكَ الصَّلَاةَ عَلَيْهِمْ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami ['ubaidhullah] dia berkata; telah menceritakan kepada kami [Nafi'] dari ['Abdullah bin 'Umar] dia berkata; Setelah Abdullah bin Ubai meninggal dunia, anaknya datang menemui Nabi shallallahu 'alaihi wasallam, lalu ia berkata; 'Berikanlah baju engkau kepadaku hingga aku mengkafaninya dengan baju itu, sholatkanlah ia dan mintalah ampunan untuknya!\"lalu beliau memberikan bajunya kepada anak tersebut. Kemudian beliau bersabda: \"Jika kalian telah selesai, beritahulah aku, aku akan mensholatkannya. Lalu Umar menariknya seraya berkata; 'Sungguh Allah telah melarang engkau untuk mensholatkan orang-orang munafik'. Maka beliau bersabda: \"Aku berada diantara dua pilihan 'mintalah ampunan untuk mereka atau engkau tidak meminta ampunan untuk mereka', maka beliau mensholatkannya. Kemudian Allah Ta'ala menurunkan ayat, Dan janganlah kamu sekali-kali mensholatkan (jenazah) seorang yang mati diantara mereka, dan janganlah kamu berdiri (mendo'akan) di kuburnya'. maka beliaupun akhirnya tidak lagi mensholatkan mereka.\""
            },
            {
                "number": 1830,
                "arab": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ بْنِ عَبْدِ الْجَبَّارِ عَنْ سُفْيَانَ عَنْ عَمْرٍو قَالَ سَمِعْتُ جَابِرًا يَقُولُأَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْرَ عَبْدِ اللَّهِ بْنِ أُبَيٍّ وَقَدْ وُضِعَ فِي حُفْرَتِهِ فَوَقَفَ عَلَيْهِ فَأَمَرَ بِهِ فَأُخْرِجَ لَهُ فَوَضَعَهُ عَلَى رُكْبَتَيْهِ وَأَلْبَسَهُ قَمِيصَهُ وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami ['Abdul Jabbar bin Al 'Ala bin 'Abdul Jabbar] dari [Sufyan] dari ['Amru] dia berkata; Aku mendengar [Jabir] berkata; \"Nabi shallallahu 'alaihi wasallam pernah mendatangi kuburan Abdullah bin Ubai -sementara ia telah diletakkan didekat lahadnya- lalu beliau berdiri di sampingnya, beliau kemudian menyuruh untuk mengeluarkannya, lalu diletakkan diatas lututnya, beliau kemudian memakaikan bajunya dan meniup sedikit air liurnya.\" Wallahhu Ta'ala A'lam."
            },
            {
                "number": 1831,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ الْبَصْرِىُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ جَابِرًا يَقُولُوَكَانَ الْعَبَّاسُ بِالْمَدِينَةِ فَطَلَبَتْ الْأَنْصَارُ ثَوْبًا يَكْسُونَهُ فَلَمْ يَجِدُوا قَمِيصًا يَصْلُحُ عَلَيْهِ إِلَّا قَمِيصَ عَبْدِ اللَّهِ بْنِ أُبَيٍّ فَكَسَوْهُ إِيَّاهُ",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Muhammad bin 'Abdurrahman Az Zuhri Al Bashri] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr], dia mendengar [Jabir] berkata; ketika itu Abbas berada di Madinah, orang-orang Anshar meminta pakaian agar dipakai olehnya, namun mereka tidak mendapatkan pakaian yang cocok untuknya kecuali pakaian Abdullah bin Ubay maka mereka pun memakaikannya."
            },
            {
                "number": 1832,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ الْأَعْمَشِ ح و أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ قَالَ سَمِعْتُ الْأَعْمَشَ قَالَ سَمِعْتُ شَقِيقًا قَالَ حَدَّثَنَا خَبَّابٌ قَالَهَاجَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبْتَغِي وَجْهَ اللَّهِ تَعَالَى فَوَجَبَ أَجْرُنَا عَلَى اللَّهِ فَمِنَّا مَنْ مَاتَ لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ قُتِلَ يَوْمَ أُحُدٍ فَلَمْ نَجِدْ شَيْئًا نُكَفِّنُهُ فِيهِ إِلَّا نَمِرَةً كُنَّا إِذَا غَطَّيْنَا رَأْسَهُ خَرَجَتْ رِجْلَاهُ وَإِذَا غَطَّيْنَا بِهَا رِجْلَيْهِ خَرَجَتْ رَأْسُهُ فَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُغَطِّيَ بِهَا رَأْسَهُ وَنَجْعَلَ عَلَى رِجْلَيْهِ إِذْخِرًا وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهُوَ يَهْدِبُهَاوَاللَّفْظُ لِإِسْمَعِيلَ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya] dari [Al A'masy]. Demikian juga diriwayatkan dari jalur lain, telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] dia berkata; Aku mendengar [Al A'masy] dia berkata; Aku mendengar [Syaqiq] dia berkata; telah menceritakan kepada kami [Khabbab] dia berkata; \"kami berhijrah bersama Rasulullah shallallahu 'alaihi wasallam dengan mengharap ridla Allah ta'ala, maka Allah akan memberi ganjaran kepada kami, diantara kami ada yang meninggal dan belum mendapatkan ganjaran sedikitpun, diantaranya adalah Mush'ab bin Umair yang terbunuh pada perang Uhud, dan kami tidak mendapatkan sesuatu untuk mengkafaninya kecuali sepotong kain; jika kami menutup kepalanya, kedua kakinya keluar dari kain (terlihat) dan jika kami menutup kakinya, kepalanya keluar dari kain (terlihat). Maka Rasulullah shallallahu 'alaihi wasallam menyuruh kami untuk menutup kepalanya dengan kain tersebut dan menutup kakinya dengan idzkhir (rumput-rumputan berbau harum: penerj). Juga diantara kami ada yang memliki buah yang sudah masak dan ia memetiknya.\" Lafazh ini dari Ismail."
            },
            {
                "number": 1833,
                "arab": "أَخْبَرَنَا عُتْبَةُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا يُونُسُ بْنُ نَافِعٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْسِلُوا الْمُحْرِمَ فِي ثَوْبَيْهِ اللَّذَيْنِ أَحْرَمَ فِيهِمَا وَاغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلَا تُمِسُّوهُ بِطِيبٍ وَلَا تُخَمِّرُوا رَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُحْرِمًا",
                "id": "Telah mengabarkan kepada kami ['Utbah bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Yunus bin Nafi'] dari ['Amru bin Dinar] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandikanlah orang yang berihram itu dengan dua pakaian yang ia kenakan untuk berihram dan mandikanlah ia dengan air dan daun bidara, kafanilah ia dengan dua kainnya, janganlah diberi wangi-wangian (parfum) dan jangan ditutup kepalanya, karena kelak ia akan dibangkitkan pada hari kiamat dalam keadaan berihram.\""
            },
            {
                "number": 1834,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ وَشَبَابَةُ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ خُلَيْدِ بْنِ جَعْفَرٍ سَمِعَ أَبَا نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَطْيَبُ الطِّيبِ الْمِسْكُ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Abu Dawud] dan [Syababah] mereka berkata; telah menceritakan kepada kami [Syu'bah] dari [Khulaid bin Ja'far] dia mendengar [Abu Nadlrah] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Parfum yang paling harum adalah misik.\""
            },
            {
                "number": 1835,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ الدِّرْهَمِيُّ قَالَ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ عَنْ الْمُسْتَمِرِّ بْنِ الرَّيَّانِ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خَيْرِ طِيبِكُمْ الْمِسْكُ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Al Husain Ad Dirhami] dia berkata; telah menceritakan kepada kami [Umayyah bin Khalid] dari [Al Mustamir bin Ar Rayyan] dari [Abu Nadlrah] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diantara parfum kalian yang paling wangi adalah misik.\""
            },
            {
                "number": 1836,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ فِي حَدِيثِهِ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ أَنَّهُ أَخْبَرَهُأَنَّ مِسْكِينَةً مَرِضَتْ فَأُخْبِرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَرَضِهَا وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُ الْمَسَاكِينَ وَيَسْأَلُ عَنْهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَاتَتْ فَآذِنُونِي فَأُخْرِجَ بِجَنَازَتِهَا لَيْلًا وَكَرِهُوا أَنْ يُوقِظُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُخْبِرَ بِالَّذِي كَانَ مِنْهَا فَقَالَ أَلَمْ آمُرْكُمْ أَنْ تُؤْذِنُونِي بِهَا قَالُوا يَا رَسُولَ اللَّهِ كَرِهْنَا أَنْ نُوقِظَكَ لَيْلًا فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى صَفَّ بِالنَّاسِ عَلَى قَبْرِهَا وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dalam haditsnya dari [Malik] dari [Ibnu Syihab] dari [Abu Umamah bin Sahl bin Hunaif] bahwasanya ia mengabarkan kepadanya bahwa seorang wanita miskin sakit, lalu hal itu dikabarkan kepada Rasulullah shallallahu 'alaihi wasallam, dan Rasulullah shallallahu 'alaihi wasallam biasa mengunjungi para fakir miskin serta bertanya tentang keadaan mereka. kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ia meninggal dunia maka beritahulah aku\". Lalu jenazah wanita itu dikeluarkan di malam hari, dan mereka tidak ingin membangunkan Rasulullah shallallahu 'alaihi wasallam (karena takut mengganggu). Pada pagi harinya Rasulullah shallallahu 'alaihi wasallam diberitahukan tentang sesuatu yang terjadi pada wanita itu. Maka beliau bersabda: \"Bukankah aku telah menyuruh kalian untuk memberitahukan kepadaku tentangnya?\" mereka menjawab; \"Wahai Rasulullah shallallahu 'alaihi wasallam kami tidak ingin membangunkan engkau di malam hari\". Lalu Rasulullah shallallahu 'alaihi wasallam keluar hingga orang-orang berbaris bersama beliau di atas kuburannya dan beliau bertakbir empat kali (sholat jenazah).\""
            },
            {
                "number": 1837,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا وُضِعَ الرَّجُلُ الصَّالِحُ عَلَى سَرِيرِهِ قَالَ قَدِّمُونِي قَدِّمُونِي وَإِذَا وُضِعَ الرَّجُلُ يَعْنِي السُّوءَ عَلَى سَرِيرِهِ قَالَ يَا وَيْلِي أَيْنَ تَذْهَبُونَ بِي",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Ibnu Abu Dzi'b] dari [Sa'id Al Maqburi] dari ['Abdurrahman bin Mihran] bahwasanya [Abu Hurairah] dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika jenazah orang shalih diletakkan di atas keranda, ia akan mengatakan, \"Segerakanlah aku, Segerakanlah aku! Jika jenazah itu -orang jelek- telah di letakan, ia akan mengatakan, 'celakalah aku! Kemanakah kalian akan membawaku? '.\""
            },
            {
                "number": 1838,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وُضِعَتْ الْجَنَازَةُ فَاحْتَمَلَهَا الرِّجَالُ عَلَى أَعْنَاقِهِمْ فَإِنْ كَانَتْ صَالِحَةً قَالَتْ قَدِّمُونِي قَدِّمُونِي وَإِنْ كَانَتْ غَيْرَ صَالِحَةٍ قَالَتْ يَا وَيْلَهَا إِلَى أَيْنَ تَذْهَبُونَ بِهَا يَسْمَعُ صَوْتَهَا كُلُّ شَيْءٍ إِلَّا الْإِنْسَانَ وَلَوْ سَمِعَهَا الْإِنْسَانُ لَصَعِقَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Sa'id bin Abu Sa'id] dari [bapaknya] bahwasanya ia mendengar [Abu Sa'id Al Khudri] dia berkata; \"Jika jenazah telah diletakkan, maka orang-orang membawanya diatas pundak-pundak mereka. Jika orang baik maka akan berkata; \"Segeralah aku, Segeralah aku! Jika jenazah itu bukan orang shalih ia akan mengatakan, 'celakalah aku! Kemanakah kalian akan membawanya?! ' segala sesuatu akan mendengar suaranya kecuali manusia! andaikata manusia mendengarnya, pasti akan pingsan.\""
            },
            {
                "number": 1839,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ وَإِنْ تَكُ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] haditsnya telah sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bergegaslah dalam membawa jenazah -menuju kuburan-, jika jenazahnya orang shalih maka menyegerakannya itu lebih baik. Namun jika bukan orang shalih, maka sungguh buruk jika kalian meletakkannya di pundak kalian.\""
            },
            {
                "number": 1840,
                "arab": "أَخْبَرَنَا سُوَيْدٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ كَانَتْ صَالِحَةً قَدَّمْتُمُوهَا إِلَى الْخَيْرِ وَإِنْ كَانَتْ غَيْرَ ذَلِكَ كَانَتْ شَرًّا تَضَعُونَهُ عَنْ رِقَابِكُمْ",
                "id": "Telah mengabarkan kepada kami [Suwaid] dia berkata; telah menceritakan kepada kami ['Abdullah] dari [Yunus] dari [Az Zuhri] dia berkata; telah menceritakan kepada kami [Abu Umamah bin Sahl] bahwasanya [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bergegaslah dalam membawa jenazah -menuju kuburan-, jika jenazahnya orang shalih maka menyegerakannya itu lebih baik. Namun jika bukan orang shalih, maka sungguh buruk jika kalian meletakkannya di pundak kalian.\""
            },
            {
                "number": 1841,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ أَنْبَأَنَا عُيَيْنَةُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يُونُسَ قَالَ حَدَّثَنِي أَبِي قَالَشَهِدْتُ جَنَازَةَ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ وَخَرَجَ زِيَادٌ يَمْشِي بَيْنَ يَدَيْ السَّرِيرِ فَجَعَلَ رِجَالٌ مِنْ أَهْلِ عَبْدِ الرَّحْمَنِ وَمَوَالِيهِمْ يَسْتَقْبِلُونَ السَّرِيرَ وَيَمْشُونَ عَلَى أَعْقَابِهِمْ وَيَقُولُونَ رُوَيْدًا رُوَيْدًا بَارَكَ اللَّهُ فِيكُمْ فَكَانُوا يَدِبُّونَ دَبِيبًا حَتَّى إِذَا كُنَّا بِبَعْضِ طَرِيقِ الْمِرْبَدِ لَحِقَنَا أَبُو بَكْرَةَ عَلَى بَغْلَةٍ فَلَمَّا رَأَى الَّذِي يَصْنَعُونَ حَمَلَ عَلَيْهِمْ بِبَغْلَتِهِ وَأَهْوَى إِلَيْهِمْ بِالسَّوْطِ وَقَالَ خَلُّوا فَوَالَّذِي أَكْرَمَ وَجْهَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّا لَنَكَادُ نَرْمُلُ بِهَا رَمَلًا فَانْبَسَطَ الْقَوْمُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah memberitakan kepada kami ['Uyainah bin 'Abdurrahman bin Yunus] dia berkata; [bapakku] telah menceritakan kepadaku, dia berkata; \"Aku menyaksikan jenazah Abdurrahman bin Sammurah, dan Ziyad keluar berjalan di depan keranda, lalu orang-orang dari keluarga Abdurrahman dan budak-budak mereka segera menyambut keranda tersebut dengan berjalan kaki. Mereka berkata; \"Pelan-pelan semoga Allah memberkati kalian.\" Lalu mereka berjalan perlahan-lahan, hingga ketika kami berada di dalam Mirbad, kami bertemu dengan [Abu Bakrah] sedang berada di atas bighal (kuda kecil). Setelah melihat apa yang mereka perbuat, ia membawa mereka di atas bighalnya dan mengulurkan cambuknya untuk manuntun mereka seraya berkata; 'Minggirlah, demi Dzat yang telah memulyakan wajah Abul Qasim shallallahu 'alaihi wasallam, aku mendapatkan kami bersama Rasulullah shallallahu 'alaihi wasallam, dan kami hampir membawanya (jenazah) dengan cepat.' Maka orang-orang pun bergembira.\""
            },
            {
                "number": 1842,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ وَهُشَيْمٌ عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَلَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّا لَنَكَادُ نَرْمُلُ بِهَا رَمَلًاوَاللَّفْظُ حَدِيثُ هُشَيْمٍ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dari [Isma'il] dan [Husyaim] dari ['Uyainah bin 'Abdurrahman] dari [bapaknya] dari [Abu Bakrah] dia berkata; \"Sungguh aku telah melihat kami bersama Rasulullah shallallahu 'alaihi wasallam dan saat itu kami hampir berjalan cepat dengan -membawa- jenazah.\" Lafazh ini dari Hadits Husyaim."
            },
            {
                "number": 1843,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ عَنْ يَحْيَى أَنَّ أَبَا سَلَمَةَ حَدَّثَهُ عَنْ أَبِي سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَرَّتْ بِكُمْ جَنَازَةٌ فَقُومُوا فَمَنْ تَبِعَهَا فَلَا يَقْعُدْ حَتَّى تُوضَعَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Durusta] dia berkata; telah menceritakan kepada kami [Abu Isma'il] dari [Yahya] bahwasanya [Abu Salamah] menceritakan kepadanya dari [Abu Sa'id] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika sebuah jenazah melewati kalian maka berdirilah, barangsiapa yang mengikutinya janganlah ia duduk hingga jenazah itu dikuburkan.\""
            },
            {
                "number": 1844,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عَامِرِ بْنِ رَبِيعَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَأَى أَحَدُكُمْ الْجَنَازَةَ فَلَمْ يَكُنْ مَاشِيًا مَعَهَا فَلْيَقُمْ حَتَّى تُخَلِّفَهُ أَوْ تُوضَعَ مِنْ قَبْلِ أَنْ تُخَلِّفَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu 'Umar] dari ['Amir bin Rabi'ah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang di antara kalian melihat jenazah dan tidak mengiringinya, hendaknya berdiri hingga jenazah melewatinya atau jenazah diletakkan sebelum melewatinya.\""
            },
            {
                "number": 1845,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ عَامِرِ بْنِ رَبِيعَةَ الْعَدَوِيِّعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِذَا رَأَيْتُمْ الْجَنَازَةَ فَقُومُوا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Salim] dari [bapaknya] dari ['Amir bin Rabi'ah Al 'Adawi] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Jika kalian melihat jenazah, berdirilah hingga jenazah melewati kalian atau jenazah diletakkan.\""
            },
            {
                "number": 1846,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ هِشَامٍ ح و أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الْجَنَازَةَ فَقُومُوا فَمَنْ تَبِعَهَا فَلَا يَقْعُدْ حَتَّى تُوضَعَ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il] dari [Hisyam]. Demikian juga diriwayatkan dari jalur lain, telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] dari [Abu Sa'id] dia berkata; \"Jika kalian melihat jenazah, berdirilah, barang siapa yang mengikutinya, maka janganlah ia duduk sampai jenazah diletakkan.\""
            },
            {
                "number": 1847,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ قَالَامَا رَأَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهِدَ جَنَازَةً قَطُّ فَجَلَسَ حَتَّى تُوضَعَ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] dia berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dari [Ibnu 'Ajlan] dari [Sa'id] dari [Abu Hurairah] dan [Abu Sa'id] mereka berkata; \"Tidaklah kami melihat Rasulullah shallallahu 'alaihi wasallam menyaksikan jenazah kemudian duduk, hingga jenazah tersebut di letakkan.\""
            },
            {
                "number": 1848,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا زَكَرِيَّا عَنْ الشَّعْبِيِّ قَالَ قَالَ أَبُو سَعِيدٍ ح و أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَقَ قَالَ حَدَّثَنَا أَبُو زَيْدٍ سَعِيدُ بْنُ الرَّبِيعِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ قَالَ سَمِعْتُ الشَّعْبِيَّ يُحَدِّثُ عَنْ أَبِي سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرُّوا عَلَيْهِ بِجَنَازَةٍ فَقَامَ وَقَالَ عَمْرٌو إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّتْ بِهِ جَنَازَةٌ فَقَامَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami [Zakaria] dari [Asy Sya'bi] dia berkata; [Abu Sa'id] berkata; 'Demikian juga diriwayatkan dari jalur lain, telah mengabarkan kepada kami [Ibrahim bin Ya'qub bin Ishaq] dia berkata; telah menceritakan kepada kami [Abu Zaid Sa'id bin Ar Rabi'] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Abdullah bin Abu As Safar] dia berkata; Aku mendengar [Asy Sya'bi] menceritakan dari [Abu Sa'id] bahwa Rasulullah shallallahu 'alaihi wasallam pernah melewati jenazah, beliau lalu berdiri. Amru berkata; \"Bahwa satu jenazah -diusung- lewat di hadapan Rasulullah shallallahu 'alaihi wasallam, lalu beliau berdiri.\""
            },
            {
                "number": 1849,
                "arab": "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ قَالَ حَدَّثَنَا مَرْوَانُ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ قَالَ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ عَنْ عَمِّهِ يَزِيدَ بْنِ ثَابِتٍأَنَّهُمْ كَانُوا جُلُوسًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَلَعَتْ جَنَازَةٌ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَامَ مَنْ مَعَهُ فَلَمْ يَزَالُوا قِيَامًا حَتَّى نَفَذَتْ",
                "id": "Telah mengabarkan kepadaku [Ayyub bin Muhammad Al Wazzan] dia berkata; telah menceritakan kepada kami [Marwan] dia berkata; telah menceritakan kepada kami ['Utsman bin Hakim] dia berkata; telah mengabarkan kepadaku [Kharijah bin Zaid bin Tsabit] dari pamannya [Yazid bin Tsabit] bahwa ketika mereka duduk bersama Nabi shallallahu 'alaihi wasallam, ada jenazah muncul (melewatinya), maka Rasulullah shallallahu 'alaihi wasallam berdiri dan orang-orang yang bersamanya pun ikut berdiri. Mereka terus berdiri hingga jenazah itu lewat.\""
            },
            {
                "number": 1850,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَكَانَ سَهْلُ ابْنُ حُنَيْفٍ وَقَيْسُ بْنُ سَعْدِ بْنِ عُبَادَةَ بِالْقَادِسِيَّةِ فَمُرَّ عَلَيْهِمَا بِجَنَازَةٍ فَقَامَا فَقِيلَ لَهُمَا إِنَّهَا مِنْ أَهْلِ الْأَرْضِ فَقَالَا مُرَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَنَازَةٍ فَقَامَ فَقِيلَ لَهُ إِنَّهُ يَهُودِيٌّ فَقَالَ أَلَيْسَتْ نَفْسًا",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari ['Abdurrahman bin Abu Laila] dia berkata; [Sahl bin Hunaif] dan [Qais bin Sa'd bin 'Ubadah] berada di Qadisiyyah, lalu sebuah jenazah melewati mereka, kemudian keduanya berdiri, lalu dikatakan kepada mereka berdua ia adalah penduduk asli. keduanya berkata; telah melewati sebuah jenazah di depan Rasulullah shallallahu 'alaihi wasallam, lalu beliau berdiri dan dikatakan kepada beliau bahwa ia adalah seorang Yahudi kemudian beliau bersabda: \"Bukankah ia juga orang?.\""
            },
            {
                "number": 1851,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ هِشَامٍ ح و أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَمَرَّتْ بِنَا جَنَازَةٌ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقُمْنَا مَعَهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا هِيَ جَنَازَةُ يَهُودِيَّةٍ فَقَالَ إِنَّ لِلْمَوْتِ فَزَعًا فَإِذَا رَأَيْتُمْ الْجَنَازَةَ فَقُومُوااللَّفْظُ لِخَالِدٍ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il] dari [Hisyam]. Demikian juga diriwayatkan dari jalur lain, dan telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Hisyam] dari [Yahya bin Abu Katsir] dari ['ubaidhullah bin Miqsam] dari [Jabir bin 'Abdullah] dia berkata; \"Sebuah jenazah lewat didepan kami lalu Rasulullah shallallahu 'alaihi wasallam berdiri dan kami berdiri bersama beliau, aku berkata; 'Ya Rasulullah ia adalah jenazah seorang wanita Yahudi.' Beliau bersabda: \" Sungguh kematian membawa ketakutan, jika kalian melihat jenazah maka berdirilah.\" Lafazh ini dari Khalid."
            },
            {
                "number": 1852,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ قَالَكُنَّا عِنْدَ عَلِيٍّ فَمَرَّتْ بِهِ جَنَازَةٌ فَقَامُوا لَهَا فَقَالَ عَلِيٌّ مَا هَذَا قَالُوا أَمْرُ أَبِي مُوسَى فَقَالَ إِنَّمَا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِجَنَازَةِ يَهُودِيَّةٍ وَلَمْ يَعُدْ بَعْدَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] dari [Abu Ma'mar] dia berkata; \"Kami pernah berada di tempat [Ali], lalu ada jenazah lewat di hadapannya, maka mereka berdiri demi jenazah tersebut, lalu Ali bertanya: \"Apa ini?\" mereka menjawab; \"Urusan Abu Musa\". Ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berdiri karena ada jenazah seorang Yahudi dan setelah itu beliau tidak melakukan lagi'.\""
            },
            {
                "number": 1853,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍأَنَّ جَنَازَةً مَرَّتْ بِالْحَسَنِ بْنِ عَلِيٍّ وَابْنِ عَبَّاسٍ فَقَامَ الْحَسَنُ وَلَمْ يَقُمْ ابْنُ عَبَّاسٍ فَقَالَ الْحَسَنُ أَلَيْسَ قَدْ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِجَنَازَةِ يَهُودِيٍّ قَالَ ابْنُ عَبَّاسٍ نَعَمْ ثُمَّ جَلَسَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Muhammad]; bahwasanya sebuah jenazah -diusung- lewat di hadapan [Hasan bin Ali] dan [Ibnu Abbas], lalu Hasan berdiri dan Ibnu Abbas tidak berdiri, kemudian Hasan berkata, \"Bukankah Rasulullah shallallahu 'alaihi wasallam berdiri untuk jenazah seorang wanita Yahudi?!\" Ibnu Abbas berkata; \"Benar, kemudian beliau duduk.\""
            },
            {
                "number": 1854,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا مَنْصُورٌ عَنْ ابْنِ سِيرِينَ قَالَمُرَّ بِجَنَازَةٍ عَلَى الْحَسَنِ بْنِ عَلِيٍّ وَابْنِ عَبَّاسٍ فَقَامَ الْحَسَنُ وَلَمْ يَقُمْ ابْنُ عَبَّاسٍ فَقَالَ الْحَسَنُ لِابْنِ عَبَّاسٍ أَمَا قَامَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ عَبَّاسٍ قَامَ لَهَا ثُمَّ قَعَدَ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Husyaim] dia berkata; telah memberitakan kepada kami [Manshur] dari [Ibnu Sirin] dia berkata; \"Ada jenazah diusung melewati [Al Hasan bin Ali] dan [Ibnu Abbas], lalu Al Hasan berdiri namun Ibnu Abbas tidak berdiri, Maka Al Hasan bertanya kepada Ibnu Abbas; 'Bukankah Rasulullah shallallahu 'alaihi wasallam berdiri karena ada jenazah? ' Ibnu Abbas berkata; 'Beliau berdiri untuknya, kemudian duduk.'"
            },
            {
                "number": 1855,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ ابْنِ عُلَيَّةَ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي مِجْلَزٍ عَنْ ابْنِ عَبَّاسٍ وَالْحَسَنِ بْنِ عَلِيٍّمَرَّتْ بِهِمَا جَنَازَةٌ فَقَامَ أَحَدُهُمَا وَقَعَدَ الْآخَرُ فَقَالَ الَّذِي قَامَ أَمَا وَاللَّهِ لَقَدْ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ قَامَ قَالَ لَهُ الَّذِي جَلَسَ لَقَدْ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ جَلَسَ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dari [Ibnu 'Ulayyah] dari [Sulaiman At Taimi] dari [Abu Mijlaz] dari [Ibnu 'Abbas] dan [Al Hasan bin 'Ali], ada jenazah -diusung- lewat dihadapan mereka berdua, lalu salah satu dari keduanya berdiri dan yang lain duduk. Orang yang berdiri berkata; \"Demi Allah! Sungguh aku mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam berdiri?!\" Orang yang duduk berkata kepadanya; 'Sungguh aku mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam duduk.'"
            },
            {
                "number": 1856,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ هَارُونَ الْبَلْخِيُّ قَالَ حَدَّثَنَا حَاتِمٌ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ أَنَّ الْحَسَنَ بْنَ عَلِيٍّكَانَ جَالِسًا فَمُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَامَ النَّاسُ حَتَّى جَاوَزَتْ الْجَنَازَةُ فَقَالَ الْحَسَنُ إِنَّمَا مُرَّ بِجَنَازَةِ يَهُودِيٍّ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى طَرِيقِهَا جَالِسًا فَكَرِهَ أَنْ تَعْلُوَ رَأْسَهُ جَنَازَةُ يَهُودِيٍّ فَقَامَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Harun Al Balkhi] dia berkata; telah menceritakan kepada kami [Hatim] dari [Ja'far bin Muhammad] dari [bapaknya] bahwasanya [Al Hasan bin 'Ali] Bahwa Al Hasan bin Ali sedang duduk, lalu ada jenazah -diusung- melewatinya, orang-orang berdiri hingga jenazah itu lewat. Lalu Al Hasan berkata: \"Jenazah seorang Yahudi diusung, sementara Rasulullah shallallahu 'alaihi wasallam sedang duduk di jalan yang dilewatinya, beliau tidak senang ada jenazah seorang yahudi berada di atas kepalanya, lalu beliau berdiri!\""
            },
            {
                "number": 1857,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِجَنَازَةِ يَهُودِيٍّ مَرَّتْ بِهِ حَتَّى تَوَارَتْو أَخْبَرَنِي أَبُو الزُّبَيْرِ أَيْضًا أَنَّهُ سَمِعَ جَابِرًا رَضِيَ اللَّهُ عَنْهُ يَقُولُ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ لِجَنَازَةِ يَهُودِيٍّ حَتَّى تَوَارَتْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah menceritakan kepada kami ['Abdurrazzaq] dia berkata; telah memberitakan kepada kami [Ibnu Juraij] dia berkata; Telah mengabarkan kepadaku [Abu Az Zubair] bahwasanya ia mendengar [Jabir] berkata; \"Nabi shallallahu 'alaihi wasallam berdiri karena ada jenazah seorang Yahudi yang diusung melewati beliau hingga jenazah tersebut tidak terlihat.\""
            },
            {
                "number": 1858,
                "arab": "أَخْبَرَنَا إِسْحَقُ قَالَ أَنْبَأَنَا النَّضْرُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ جَنَازَةً مَرَّتْ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ فَقِيلَ إِنَّهَا جَنَازَةُ يَهُودِيٍّ فَقَالَ إِنَّمَا قُمْنَا لِلْمَلَائِكَةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq] dia berkata; telah memberitakan kepada kami [An Nadhr] dia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Qatadah] dari [Anas] bahwa ada jenazah diusung melewati Rasulullah shallallahu 'alaihi wasallam, beliau berdiri, lalu dikatakan, \" Jenazah itu adalah seorang yahudi?! beliau bersabda: \" kami berdiri karena ada malaikat.\""
            },
            {
                "number": 1859,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ أَنَّهُ كَانَ يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَالَ مُسْتَرِيحٌ وَمُسْتَرَاحٌ مِنْهُ فَقَالُوا مَا الْمُسْتَرِيحُ وَمَا الْمُسْتَرَاحُ مِنْهُ قَالَ الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَأَذَاهَا وَالْعَبْدُ الْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلَادُ وَالشَّجَرُ وَالدَّوَابُّ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Muhammad bin 'Amr bin Halhalah] dari [Ma'bad bin Ka'b bin Malik] dari [Abu Qatadah bin Rib'i] ia bercerita bahwa Rasulullah shallallahu 'alaihi wasallam pernah dilewati jenazah, beliau kemudian bersabda: \"Dia beristirahat atau -sesuatu- diistirahatkan darinya.\" Lalu mereka bertanya, \"apa yang dimaksud dengan 'dia sedang beristirahat' dan apa yang dimaksud dengan 'diistirahatkan darinya? ' beliau bersabda: \"Seorang hamba yang beriman beristirahat dari penderitaan dunia dan penganiayaannya, sedangkan seorang hamba yang kafir (banyak berbuat dosa), para hamba, negeri, pohon dan binatang diistirahatkan darinya.\""
            },
            {
                "number": 1860,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبِ بْنِ أَبِي كَرِيمَةَ الْحَرَّانِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَهُوَ الْحَرَّانِيُّ عَنْ أَبِي عَبْدِ الرَّحِيمِ حَدَّثَنِي زَيْدٌ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ مَعْبَدِ بْنِ كَعْبٍ عَنْ أَبِي قَتَادَةَ قَالَكُنَّا جُلُوسًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ طَلَعَتْ جَنَازَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَرِيحٌ وَمُسْتَرَاحٌ مِنْهُ الْمُؤْمِنُ يَمُوتُ فَيَسْتَرِيحُ مِنْ أَوْصَابِ الدُّنْيَا وَنَصَبِهَا وَأَذَاهَا وَالْفَاجِرُ يَمُوتُ فَيَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلَادُ وَالشَّجَرُ وَالدَّوَابُّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Wahb bin Abu Karimah Al Harrani] dia berkata; telah menceritakan kepada kami [Muhammad bin Salamah Al Harrani] dari [Abu 'Abdurrahim]; telah menceritakan kepadaku [Zaid] dari [Wahb bin Kaisan] dari [Ma'bad bin Ka'b] dari [Abu Qatadah] dia berkata; \"Kami pernah duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba ada jenazah -yang diusung- muncul, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia beristirahat atau -sesuatu- diistirahatkan darinya.\" Jika seorang mukmin meninggal dunia, ia beristirahat dari beban berat dunia, penderitaan dan penganiayaannya, dan jika seorang yang fajir meninggal dunia, para hamba, negeri, pohon dan binatang diistirahatkan darinya.\""
            },
            {
                "number": 1861,
                "arab": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ أَنَسٍ قَالَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَبَتْ وَمُرَّ بِجَنَازَةٍ أُخْرَى فَأُثْنِيَ عَلَيْهَا شَرًّا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَبَتْ فَقَالَ عُمَرُ فِدَاكَ أَبِي وَأُمِّي مُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا فَقُلْتَ وَجَبَتْ وَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا شَرًّا فَقُلْتَ وَجَبَتْ فَقَالَ مَنْ أَثْنَيْتُمْ عَلَيْهِ خَيْرًا وَجَبَتْ لَهُ الْجَنَّةُ وَمَنْ أَثْنَيْتُمْ عَلَيْهِ شَرًّا وَجَبَتْ لَهُ النَّارُ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الْأَرْضِ",
                "id": "Telah mengabarkan kepadaku [Ziyad bin Ayyub] dia berkata; telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami ['Abdul 'Aziz] dari [Anas] dia berkata; \"Ada jenazah -di usung- melewati Nabi shallallahu 'alaihi wasallam, lalu jenazah tersebut dipuji dengan kebaikan. Nabi shallallahu 'alaihi wasallam bersabda: \"Wajib.\" Dan ada jenazah yang lain -diusung- melewati beliau, lalu jenazah itu dikecam dengan keburukan, Nabi shallallahu 'alaihi wasallam bersabda: \"Wajib.\" Umar kemudian berkata, \"Demi bapak dan ibuku sebagai tebusannya! Ada jenazah -diusung- melewati beliau, lalu dikecam dengan keburukan, kemudian engkau bersabda: \"Wajib.\" beliau bersabda: \"Barang siapa yang kalian puji dengan kebaikan, wajib baginya surga dan barang siapa yang kalian kecam dengan keburukan, wajib baginya neraka. Kalian adalah saksi Allah di bumi.\""
            },
            {
                "number": 1862,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ إِبْرَاهِيمَ بْنَ عَامِرٍ وَجَدَّهُ أُمَيَّةُ بْنُ خَلَفٍ قَالَ سَمِعْتُ عَامِرَ بْنَ سَعْدٍ عَنْ أَبِي هُرَيْرَةَ قَالَمَرُّوا بِجَنَازَةٍ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَثْنَوْا عَلَيْهَا خَيْرًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَبَتْ ثُمَّ مَرُّوا بِجَنَازَةٍ أُخْرَى فَأَثْنَوْا عَلَيْهَا شَرًّا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَبَتْ قَالُوا يَا رَسُولَ اللَّهِ قَوْلُكَ الْأُولَى وَالْأُخْرَى وَجَبَتْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَلَائِكَةُ شُهَدَاءُ اللَّهِ فِي السَّمَاءِ وَأَنْتُمْ شُهَدَاءُ اللَّهِ فِي الْأَرْضِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Hisyam bin 'Abdul Malik] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; Aku mendengar [Ibrahim bin 'Amir] -dan kakeknya Umayyah bin Khalaf- berkata; Aku mendengar ['Amir bin Sa'd] dari [Abu Hurairah] dia berkata; \"Ada jenazah -diusung- melewati Nabi shallallahu 'alaihi wasallam, lalu mereka memujinya dengan kebaikan! Nabi shallallahu 'alaihi wasallam bersabda: \"Wajib, \" kemudian ada jenazah lain yang -di usung- melewati beliau, lalu mereka mengacamnya dengan keburukan, Nabi shallallahu 'alaihi wasallam bersabda: \"Wajib, \" lalu mereka berkata: \"Wahai Rasulullah shallallahu 'alaihi wasallam perkataan engkau kepada yang pertama dan yang lainnya adalah \"Wajib?\" Nabi shallallahu 'alaihi wasallam bersabda: \"Malaikat adalah saksi Allah di langit dan manusia adalah saksi Allah di bumi.\""
            },
            {
                "number": 1863,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ وَعَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَا حَدَّثَنَا دَاوُدُ بْنُ أَبِي الْفُرَاتِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِي الْأَسْوَدِ الدِّيْلِيِّ قَالَأَتَيْتُ الْمَدِينَةَ فَجَلَسْتُ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَى صَاحِبِهَا خَيْرًا فَقَالَ عُمَرُ وَجَبَتْ ثُمَّ مُرَّ بِأُخْرَى فَأُثْنِيَ عَلَى صَاحِبِهَا خَيْرًا فَقَالَ عُمَرُ وَجَبَتْ ثُمَّ مُرَّ بِالثَّالِثِ فَأُثْنِيَ عَلَى صَاحِبِهَا شَرًّا فَقَالَ عُمَرُ وَجَبَتْ فَقُلْتُ وَمَا وَجَبَتْ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ قُلْتُ كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا مُسْلِمٍ شَهِدَ لَهُ أَرْبَعَةٌ قَالُوا خَيْرًا أَدْخَلَهُ اللَّهُ الْجَنَّةَ قُلْنَا أَوْ ثَلَاثَةٌ قَالَ أَوْ ثَلَاثَةٌ قُلْنَا أَوْ اثْنَانِ قَالَ أَوْ اثْنَانِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Hisyam bin 'Abdul Malik] dan ['Abdullah bin Yazid] mereka berkata; telah menceritakan kepada kami [Dawud bin Abul Furat] dia berkata; telah menceritakan kepada kami ['Abdullah bin Buraidah] dari [Abul Aswad Ad Daili] dia berkata; Aku datang ke madinah, lalu aku duduk di hadapan [Umar Al Khattab], kemudian ada jenazah diusung -lewat- di hadapannya dan jenazah itu dipuji dengan kebaikan, Umar lalu berkata; \"Wajib\". Kemudian ada jenazah lain yang di usung -lewat- di hadapannya dan jenazah itu dikecam dengan keburukan, umar lalu berkata; \"Wajib.\" Kemudian ada jenazah ketiga -diusung- lewat di hadapannya dan jenazah tersebut dicekam dengan keburukan, Umar lalu berkata; \"Wajib.\" Aku bertanya, \"Apa yang wajib, wahai amirul mukminin?\" ia menjawab, \"Aku mengatakan sebagaimana Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang muslim mana saja yang disaksikan untuk dirinya oleh empat orang, dan mereka mengatakan kebaikan, Allah akan memasukannya ke dalam surga, \" kami berkata, \"Atau tiga.\" Beliau bersabda: \"Atau tiga.\" Kami berkata; \"Atau dua.\" Beliau bersabda: \"Atau dua.\""
            },
            {
                "number": 1864,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنِي أَحْمَدُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْذُكِرَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَالِكٌ بِسُوءٍ فَقَالَ لَا تَذْكُرُوا هَلْكَاكُمْ إِلَّا بِخَيْرٍ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ya'qub] dia berkata; telah menceritakan kepadaku [Ahmad bin Ishaq] dia berkata; telah menceritakan kepada kami [Wuhaib] dia berkata; telah menceritakan kepada kami [Manshur bin 'Abdurrahman] dari [ibunya] dari ['Aisyah] dia berkata; \"Kejelekan seorang yang telah meninggal dunia pernah disebutkan di hadapan Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian menyebutkan orang-orang yang telah meninggal dunia di antara kalian kecuali dengan kebaikan.\""
            },
            {
                "number": 1865,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ بِشْرٍ وَهُوَ ابْنُ الْمُفَضَّلِ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَسُبُّوا الْأَمْوَاتَ فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari [Bisyr bin Al Mufadldlal] dari [Syu'bah] dari [Sulaiman Al A'masy] dari [Mujahid] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mencela orang-orang yang telah meninggal dunia, karena mereka telah sampai kepada apa yang mereka lakukan (pembalasan amal).\""
            },
            {
                "number": 1866,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتْبَعُ الْمَيِّتَ ثَلَاثَةٌ أَهْلُهُ وَمَالُهُ وَعَمَلُهُ فَيَرْجِعُ اثْنَانِ أَهْلُهُ وَمَالُهُ وَيَبْقَى وَاحِدٌ عَمَلُهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Abdullah bin Abu Bakr] dia berkata; Aku mendengar [Anas bin Malik] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga hal yang akan menyertai mayit; Keluarganya, hartanya dan amal perbuatannya, lalu yang dua kembali yaitu keluarganya dan hartanya, dan satu yang tetap bersamanya, yaitu amal perbuatannya.\""
            },
            {
                "number": 1867,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْمُؤْمِنِ عَلَى الْمُؤْمِنِ سِتُّ خِصَالٍ يَعُودُهُ إِذَا مَرِضَ وَيَشْهَدُهُ إِذَا مَاتَ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَنْصَحُ لَهُ إِذَا غَابَ أَوْ شَهِدَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Muhammad bin Musa] dari [Sa'id bin Abu Sa'id] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hak orang mukmin terhadap mukmin yang lainnya ada enam hal: menjenguknya jika ia sakit, menyaksikannya jika ia meninggal dunia, memenuhi panggilannya jika ia mengundang, mengucapkan salam kepadanya jika bertemu, mendo'akannya jika ia bersin dan menasehatinya jika ia tidak nampak atau hadir.\""
            },
            {
                "number": 1868,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ الْبَلْخِيُّ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ ح وَأَنْبَأَنَا هَنَّادُ بْنُ السَّرِيِّ فِي حَدِيثِهِ عَنْ أَبِي الْأَحْوَصِ عَنْ أَشْعَثَ عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ قَالَ هَنَّادٌ قَالَ الْبَرَاءُ بْنُ عَازِبٍ وَقَالَ سُلَيْمَانُ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ وَتَشْمِيتِ الْعَاطِسِ وَإِبْرَارِ الْقَسَمِ وَنُصْرَةِ الْمَظْلُومِ وَإِفْشَاءِ السَّلَامِ وَإِجَابَةِ الدَّاعِي وَاتِّبَاعِ الْجَنَائِزِ وَنَهَانَا عَنْ خَوَاتِيمِ الذَّهَبِ وَعَنْ آنِيَةِ الْفِضَّةِ وَعَنْ الْمَيَاثِرِ وَالْقَسِّيَّةِ وَالْإِسْتَبْرَقِ وَالْحَرِيرِ وَالدِّيبَاجِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Manshur Al Balkhi] dia berkata; telah menceritakan kepada kami [Abul Ahwash]. Demikian juga diriwayatkan dari jalur lain, dan telah memberitakan kepada kami [Hannad bin As Sari] dalam haditsnya dari [Abul Ahwash] dari [Asy'ats] dari [Mu'awiyah bin Suwaid]; berkata [Hannad]; berkata [Al Barra' bin 'Azib]; dan berkata [Sulaiman] dari [Al Barra' bin 'Azib] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kita untuk melakukan tujuh hal dan melarang kita dari tujuh hal: menyuruh kita untuk menjenguk orang-orang sakit, mendo'akan yang bersin, melaksanakan sesuai sumpah, memenuhi undangan serta mengikuti jenazah, dan melarang kita dari cincin yang terbuat dari emas, tempat minum yang terbuat dari perak, pelana yang terbuat dari sutra, Qasiyyah (pakaian bergaris yang ada sutranya), Istabrq (sutra tebal), sutra tipis, dan diybaj (pakaian yang serat kainnya terbuat dari sutra).\""
            },
            {
                "number": 1869,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْثَرٌ عَنْ بُرْدٍ أَخِي يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَبِعَ جَنَازَةً حَتَّى يُصَلَّى عَلَيْهَا كَانَ لَهُ مِنْ الْأَجْرِ قِيرَاطٌ وَمَنْ مَشَى مَعَ الْجَنَازَةِ حَتَّى تُدْفَنَ كَانَ لَهُ مِنْ الْأَجْرِ قِيرَاطَانِ وَالْقِيرَاطُ مِثْلُ أُحُدٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami ['Abtsar] dari [Burd] -saudara Yazid bin Abu Ziyad- dari [Al Musayyab bin Rafi'] dia berkata; aku mendengar [Al Barra' bin 'Azib] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mengiringi jenazah hingga mensholatkannya, baginya pahala satu qirath, dan barangsiapa yang berjalan bersama jenazah hingga dikuburkan, baginya pahala dua qirah dan satu qirah seperti gunung Uhud.\""
            },
            {
                "number": 1870,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغَفَّلِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَبِعَ جِنَازَةً حَتَّى يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطَانِ فَإِنْ رَجَعَ قَبْلَ أَنْ يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Asy'ats] dari [Al Hasan] dari ['Abdullah bin Al Mughaffal] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mengantar jenazah hingga selesai penguburannya ia mendapatkan dua qirath, namun jika ia kembali sebelum selesai dari penguburannya ia mendapatkan satu qirath.\""
            },
            {
                "number": 1871,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ وَأَخُوهُ الْمُغِيرَةُ جَمِيعًا عَنْ زِيَادِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub] dia berkata; telah menceritakan kepada kami ['Abdul Wahid bin Washil] dia berkata; telah menceritakan kepada kami [Sa'id bin 'ubaidhullah] -dan juga saudaranya yakni [Al Mughirah] - dari [Ziyad bin Jubair] dari [bapaknya] dari [Al Mughirah bin Syu'bah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang menaiki kendaraan ia di belakang jenazah, sedangkan orang yang berjalan ia di tempat mana saja yang ia kehendaki, dan anak kecil di sholatkan -jika meninggal dunia-.\""
            },
            {
                "number": 1872,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ بَكَّارٍ الْحَرَّانِيُّ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ عَنْ سَعِيدٍ الثَّقَفِيِّ عَنْ عَمِّهِ زِيَادِ بْنِ جُبَيْرِ بْنِ حَيَّةَ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ",
                "id": "Telah mengabarkan kepadaku [Ahmad bin Bakkar Al Harrani] dia berkata; telah menceritakan kepada kami [Bisyr bin As Sari] dari [Sa'id Ats Tsaqafi] dari pamannya [Ziyad bin Jubair bin Hayyah] dari [bapaknya] dari [Al Mughirah bin Syu'bah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang menaiki kendaraan ia di belakang jenazah, sedangkan orang yang berjalan ia di tempat mana saja yang ia kehendaki, dan anak kecil di sholatkan -jika meninggal dunia-.\""
            },
            {
                "number": 1873,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ حُجْرٍ وَقُتَيْبَةُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَمْشُونَ أَمَامَ الْجَنَازَةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dan ['Ali bin Hujr] dan [Qutaibah] dari [Sufyan] dari [Az Zuhri] dari [Salim] dari [bapaknya] bahwasanya ia melihat Rasulullah shallallahu 'alaihi wasallam, Abu Bakar dan Umar Radliallahu'anhuma berjalan di depan jenazah."
            },
            {
                "number": 1874,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا سُفْيَانُ وَمَنْصُورٌ وَزِيَادٌ وَبَكْرٌ هُوَ ابْنُ وَائِلٍ كُلُّهُمْ ذَكَرُوا أَنَّهُمْ سَمِعُوا مِنَ الزُّهْرِيِّ يُحَدِّثُ أَنَّ سَالِمًا أَخْبَرَهُ أَنَّ أَبَاهُ أَخْبَرَهُأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ يَمْشُونَ بَيْنَ يَدَيْ الْجَنَازَةِ بَكْرٌ وَحْدَهُ لَمْ يَذْكُرْ عُثْمَانَقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ مُرْسَلٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Yazid] dia berkata; [bapakku] telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami [Hammam] dia berkata; telah menceritakan kepada kami [Sufyan] dan [Manshur] dan [Ziyad] dan [Bakr bin Wail], mereka menyebutkan bahwasanya mereka mendengar dari [Az Zuhri] bercerita, [Salim] telah mengabarkan kepadanya, [Bapaknya] telah mengabarkan kepadanya bahwa ia melihat Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, Umar dan Utsman berjalan di depan jenazah. Hanya Bakr saja yang tidak menyebutkan Utsman. Abu Abdurrahman berkata; 'Ini salah, yang benar hadits ini mursal.'"
            },
            {
                "number": 1875,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ وَعَمْرُو بْنُ زُرَارَةَ النَّيْسَابُورِيُّ قَالَا حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخَاكُمْ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dan ['Amru bin Zurarah An Naisaburi] mereka berkata; telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Abu Qilabah] dari [Abul Muhallab] dari ['Imran bin Hushain] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" saudara kalian telah meninggal dunia, berdirilah kemudian sholatkanlah atasnya.\""
            },
            {
                "number": 1876,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ عَمَّتِهِ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ خَالَتِهَا أُمِّ الْمُؤْمِنِينَ عَائِشَةَ قَالَتْأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَبِيٍّ مِنْ صِبْيَانِ الْأَنْصَارِ فَصَلَّى عَلَيْهِ قَالَتْ عَائِشَةُ فَقُلْتُ طُوبَى لِهَذَا عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ لَمْ يَعْمَلْ سُوءًا وَلَمْ يُدْرِكْهُ قَالَ أَوَ غَيْرُ ذَلِكَ يَا عَائِشَةُ خَلَقَ اللَّهُ عَزَّ وَجَلَّ الْجَنَّةَ وَخَلَقَ لَهَا أَهْلًا وَخَلَقَهُمْ فِي أَصْلَابِ آبَائِهِمْ وَخَلَقَ النَّارَ وَخَلَقَ لَهَا أَهْلًا وَخَلَقَهُمْ فِي أَصْلَابِ آبَائِهِمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur]; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepada kami [Thalhah bin Yahya] dari bibinya ['Aisyah binti Thalhah] dari sepupunya [Ummul Mu'minin 'Aisyah] dia berkata; Bayi dari Anshar yang telah meninggal dunia dibawa ke Rasulullah shallallahu 'alaihi wasallam, lalu beliau melaksanakan sholat atasnya. Aisyah berkata lagi; \"Aku mengatakan; 'Berbahagialah bayi ini, ia adalah salah satu burung-burung kecil di surga, dia belum pernah melakukan kejelekan dan belum pernah menemuinya'.\" Beliau bersabda: \"Bahkan tidak seperti itu wahai Aisyah, Allah -Azza wa jalla- telah menciptakan surga, menciptakan penghuninya dan menciptakan mereka dari tulang rusuk bapak mereka. Serta menciptakan neraka, menciptakan penghuninya dan menciptakan mereka dari tulang rusuk bapak mereka.\""
            },
            {
                "number": 1877,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ قَالَ سَمِعْتُ زِيَادَ بْنَ جُبَيْرٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّهُ ذَكَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Sa'id bin 'ubaidhullah] dia berkata; Aku mendengar [Ziyad bin Jubair] menceritakan dari [bapaknya] dari [Al Mughirah bin Syu'bah] dia menyebutkan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang menaiki kendaraan ia di belakang jenazah, sedangkan orang yang berjalan ia di tempat mana saja yang ia kehendaki, dan anak kecil di sholatkan -jika meninggal dunia-.\""
            },
            {
                "number": 1878,
                "arab": "أَخْبَرَنَا إِسْحَقُ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَوْلَادِ الْمُشْرِكِينَ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ",
                "id": "Telah mengabarkan kepada kami [Ishaq] dia berkata; telah memberitakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Atha bin Yazid Al Laitsi] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya tentang anak-anak kaum Musyrikin? lalu beliau bersabda: \"Allah maha mengetahui terhadap apa yang mereka perbuat.\""
            },
            {
                "number": 1879,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسٍ هُوَ ابْنُ سَعْدٍ عَنْ طَاوُسٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ أَوْلَادِ الْمُشْرِكِينَ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Al Aswad bin 'Amir] dia berkata; telah menceritakan kepada kami [Hammad] dari [Qais bin Sa'd] dari [Thawus] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam ditanya tentang anak-anak kaum Musyrikin? lalu beliau bersabda: \"Allah maha mengetahui terhadap apa yang mereka perbuat.\""
            },
            {
                "number": 1880,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَوْلَادِ الْمُشْرِكِينَ فَقَالَ خَلَقَهُمْ اللَّهُ حِينَ خَلَقَهُمْ وَهُوَ يَعْلَمُ بِمَا كَانُوا عَامِلِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya tentang anak-anak kaum musyrikin? Lalu beliau bersabda: \"Allah menciptakan mereka, dan Dia maha mengetahui terhadap apa yang mereka perbuat.\""
            },
            {
                "number": 1881,
                "arab": "أَخْبَرَنِي مُجَاهِدُ بْنُ مُوسَى عَنْ هُشَيْمٍ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَرَارِيِّ الْمُشْرِكِينَ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ",
                "id": "Telah mengabarkan kepadaku [Mujahid bin Musa] dari [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dia berkata; \"Nabi shallallahu 'alaihi wasallam ditanya tentang anak cucu kaum musyrikin, lalu beliau bersabda: \"Allah maha mengetahui terhadap apa yang mereka perbuat.\""
            },
            {
                "number": 1882,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عِكْرِمَةُ بْنُ خَالِدٍ أَنَّ ابْنَ أَبِي عَمَّارٍ أَخْبَرَهُ عَنْ شَدَّادِ بْنِ الْهَادِأَنَّ رَجُلًا مِنْ الْأَعْرَابِ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَآمَنَ بِهِ وَاتَّبَعَهُ ثُمَّ قَالَ أُهَاجِرُ مَعَكَ فَأَوْصَى بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْضَ أَصْحَابِهِ فَلَمَّا كَانَتْ غَزْوَةٌ غَنِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْيًا فَقَسَمَ وَقَسَمَ لَهُ فَأَعْطَى أَصْحَابَهُ مَا قَسَمَ لَهُ وَكَانَ يَرْعَى ظَهْرَهُمْ فَلَمَّا جَاءَ دَفَعُوهُ إِلَيْهِ فَقَالَ مَا هَذَا قَالُوا قِسْمٌ قَسَمَهُ لَكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَهُ فَجَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا هَذَا قَالَ قَسَمْتُهُ لَكَ قَالَ مَا عَلَى هَذَا اتَّبَعْتُكَ وَلَكِنِّي اتَّبَعْتُكَ عَلَى أَنْ أُرْمَى إِلَى هَاهُنَا وَأَشَارَ إِلَى حَلْقِهِ بِسَهْمٍ فَأَمُوتَ فَأَدْخُلَ الْجَنَّةَ فَقَالَ إِنْ تَصْدُقْ اللَّهَ يَصْدُقْكَ فَلَبِثُوا قَلِيلًا ثُمَّ نَهَضُوا فِي قِتَالِ الْعَدُوِّ فَأُتِيَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحْمَلُ قَدْ أَصَابَهُ سَهْمٌ حَيْثُ أَشَارَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهُوَ هُوَ قَالُوا نَعَمْ قَالَ صَدَقَ اللَّهَ فَصَدَقَهُ ثُمَّ كَفَّنَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جُبَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَدَّمَهُ فَصَلَّى عَلَيْهِ فَكَانَ فِيمَا ظَهَرَ مِنْ صَلَاتِهِ اللَّهُمَّ هَذَا عَبْدُكَ خَرَجَ مُهَاجِرًا فِي سَبِيلِكَ فَقُتِلَ شَهِيدًا أَنَا شَهِيدٌ عَلَى ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku ['Ikrimah bin Khalid] bahwasanya [Ibnu Abu 'Ammar] mengabarkan kepadanya dari [Syaddad bin Al Had] bahwa seorang laki-laki dari seorang badui datang menemui Nabi shallallahu 'alaihi wasallam, lalu ia beriman dan mengikuti beliau. Kemudian dia berkata, \"Aku akan berhijrah bersama engkau?\" beliau berwasiat dengan orang tersebut kepada sebagian sahabat beliau. Setelah terjadi perang, Nabi shallallahu 'alaihi wasallam mendapatkan ghanimah (harta rampasan perang) berupa tawanan, beliau membagikan dan membagi untuknya, lalu beliau memberikan kepada para sahabat beliau sesuatu yang beliau bagi untuknya dan ia sendiri sedang mengatur urusan mereka. Setelah ia datang, ia memberikannya kepada orang itu, lalu ia berkata; \"Apa ini?\" mereka menjawab; \"Bagian yang telah Nabi shallallahu 'alaihi wasallam bagi untukmu.\" Kemudian ia mengambilnya dan membawanya menemui Nabi shallallahu 'alaihi wasallam, lalu bertanya; \"Apa ini?\" beliau bersabda: 'Aku telah membaginya untukmu.' Ia berkata; \"Bukan untuk hal ini aku mengikuti engkau. Tapi aku mengikuti engkau agar aku dilemparkan ke sini -ia mengisyaratkan tombaknya ke tenggorokannya- lalu aku mati dan masuk surga.\" beliau bersabda: \"Jika jujur kepada Allah, niscaya Allah akan membalas sikap kejujuranmu.\" Lalu mereka diam sejenak, kemudian bangkit melawan musuh, orang tersebut dibawa ke tempat Nabi shallallahu 'alaihi wasallam dengan cara diangkut, ia terkena tombak yang diisyaratkan, lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah ia orangnya?!\" mereka menjawab; \"ya.\" Beliau bersabda: \"Dia benar dalam berjanji kepada Allah, Allah membalasnya dengan kebenaran.\" Kemudian Nabi shallallahu 'alaihi wasallam mengkafaninya dengan jubah beliau shallallahu 'alaihi wasallam, beliau mengajukan dan mensholatkannya. Do'a yang nampak dalam sholat beliau yaitu, \"Ya Allah, inilah hamba-Mu, ia telah keluar jihad di jalan-Mu, lalu ia terbunuh dalam keadaan Syahid, aku menjadi saksi atas hal tersebut.\""
            },
            {
                "number": 1883,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلَاتَهُ عَلَى الْمَيِّتِ ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ إِنِّي فَرَطٌ لَكُمْ وَأَنَا شَهِيدٌ عَلَيْكُمْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Yazid] dari [Abul Khair] dari ['Uqbah] bahwa suatu hari Rasulullah shallallahu 'alaihi wasallam keluar untuk mensholatkan para sahabat yang gugur dalam perang Uhud, beliau mensholatinya sebagaimana mensholati mayit, kemudian beliau naik mimbar, lalu bersabda: \" Aku pendahulu bagi kalian dan aku sebagai saksi atas kalian.\""
            },
            {
                "number": 1884,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ أَيُّهُمَا أَكْثَرُ أَخْذًا لِلْقُرْآنِ فَإِذَا أُشِيرَ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ قَالَ أَنَا شَهِيدٌ عَلَى هَؤُلَاءِ وَأَمَرَ بِدَفْنِهِمْ فِي دِمَائِهِمْ وَلَمْ يُصَلِّ عَلَيْهِمْ وَلَمْ يُغَسَّلُوا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Abdurrahman bin Ka'b bin Malik], [Jabir bin 'Abdullah] mengabarkan kepadanya; bahwa Rasulullah shallallahu 'alaihi wasallam menggabungkan (menghimpun) dua orang yang gugur pada perang Uhud dalam satu kain, kemudian beliau bersabda: \"Manakah diantara keduanya yang paling banyak hapalan al-qur'an?\" ketika diisyaratkan kepada salah satu dari keduanya, beliau mendahulukannya ketika memasukkan kedalam lahd, beliau bersabda: \"Aku adalah saksi atas mereka.\" Dan beliau menyuruh mereka untuk menguburkan mereka dengan darah yang ada pada diri mereka, mereka tidak disholatkan dan tidak dimandikan."
            },
            {
                "number": 1885,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى وَنُوحُ بْنُ حَبِيبٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا مِنْ أَسْلَمَ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاعْتَرَفَ بِالزِّنَا فَأَعْرَضَ عَنْهُ ثُمَّ اعْتَرَفَ فَأَعْرَضَ عَنْهُ ثُمَّ اعْتَرَفَ فَأَعْرَضَ عَنْهُ حَتَّى شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبِكَ جُنُونٌ قَالَ لَا قَالَ أَحْصَنْتَ قَالَ نَعَمْ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَ فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ فَأُدْرِكَ فَرُجِمَ فَمَاتَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرًا وَلَمْ يُصَلِّ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya] dan [Nuh bin Habib] mereka berkata; telah menceritakan kepada kami ['Abdurrazzaq] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah bin 'Abdurrahman] dari [Jabir bin 'Abdullah] bahwa ada seorang laki-laki dari suku Aslam datang menemui Nabi shallallahu 'alaihi wasallam, ia mengaku telah berbuat zina, beliau berpaling darinya. Kemudian ia mengaku lagi, dan beliau berpaling darinya. Kemudian ia mengaku lagi-telah melakukan zina-, dan beliau berpaling darinya hingga dia bersaksi atas dirinya empat kali. Lalu Nabi shallallahu 'alaihi wasallam bertanya: \"Apakah kamu gila?\"ia menjawab, \"tidak.\" Beliau bertanya: \"Apakah kamu telah menikah?\" ia menjawab; \"Ya.\" Nabi shallallahu 'alaihi wasallam menyuruh orang tersebut untuk dirajam. Setelah batu-batu menimpanya dan ia merasa tidak sanggup dan lemah, ia berlari, lalu ditangkap dan dirajam lagi, lalu ia meninggal dunia. kemudian Nabi shallallahu 'alaihi wasallam berkoemntar kebaikan terhadapnya dan tidak mensholatkannya."
            },
            {
                "number": 1886,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنِّي زَنَيْتُ وَهِيَ حُبْلَى فَدَفَعَهَا إِلَى وَلِيِّهَا فَقَالَ أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَأْتِنِي بِهَا فَلَمَّا وَضَعَتْ جَاءَ بِهَا فَأَمَرَ بِهَا فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ رَجَمَهَا ثُمَّ صَلَّى عَلَيْهَا فَقَالَ لَهُ عُمَرُ أَتُصَلِّي عَلَيْهَا وَقَدْ زَنَتْ فَقَالَ لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ تَوْبَةً أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ عَزَّ وَجَلَّ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Hisyam] dari [Yahya bin Abu Katsir] dari [Abu Qilabah] dari [Abul Muhallab] dari ['Imran bin Hushain] bahwa seorang wanita dari Juhainah datang menemui Rasulullah shallallahu 'alaihi wasallam lalu berkata; \"Sungguh aku telah berzina!\" sedangkan ia dalam keadaan hamil, lalu beliau menyerahkan wanita tersebut kepada walinya seraya bersabda: \"Berbuatlah baiknya terhadapnya, jika ia telah melahirkan, datanglah engkau kepadaku bersamanya.\" Setelah ia melahirkan, walinya datang bersamanya, lalu beliau memerintahkan (untuk merajamnya), dan beliau mensholatinya. Lalu Umar berkata pada Nabi shallallahu 'alaihi wasallam: \"Apakah engkau mensholatinya padahal dia berbuat zina?\" beliau bersabda: \"Sungguh ia telah bertaubat, andaikata taubatnya dibagikan antara tujuh puluh penduduk Madinah, niscaya akan mencukupi mereka. Apakah engkau menemukan taubat yang lebih mulia darinya yang telah mendern dirinya kepada Allah -Azza wa Jalla? -\""
            },
            {
                "number": 1887,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا هُشَيْمٌ عَنْ مَنْصُورٍ وَهُوَ ابْنُ زَاذَانَ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا أَعْتَقَ سِتَّةً مَمْلُوكِينَ لَهُ عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرَهُمْ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَغَضِبَ مِنْ ذَلِكَ وَقَالَ لَقَدْ هَمَمْتُ أَنْ لَا أُصَلِّيَ عَلَيْهِ ثُمَّ دَعَا مَمْلُوكِيهِ فَجَزَّأَهُمْ ثَلَاثَةَ أَجْزَاءٍ ثُمَّ أَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Husyaim] dari [Manshur bin Zadzan] dari [Al Hasan] dari ['Imran bin Hushain] bahwa seorang laki-laki telah memerdekakan enam budak miliknya ketika akan meninggal dunia, padahal ia tidak memiliki harta selain mereka. Lalu hal itu sampai kepada Nabi shallallahu 'alaihi wasallam, kemudian beliau marah atas hal itu dan bersabda: \"Sungguh semula aku telah berminat untuk tidak mensholatkannya.\" Kemudian beliau memanggil para budaknya dan membagi mereka menjadi tiga bagian, lalu mengundi di antara mereka. Beliau memerdekakan dua orang dan menjadikan empat orang tetap sebagai budak."
            },
            {
                "number": 1888,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَبِي عَمْرَةَ عَنْ زَيْدِ بْنِ خَالِدٍ قَالَمَاتَ رَجُلٌ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلُّوا عَلَى صَاحِبِكُمْ إِنَّهُ غَلَّ فِي سَبِيلِ اللَّهِ فَفَتَّشْنَا مَتَاعَهُ فَوَجَدْنَا فِيهِ خَرَزًا مِنْ خَرَزِ يَهُودَ مَا يُسَاوِي دِرْهَمَيْنِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yahya bin Sa'id Al Anshari] dari [Muhammad bin Yahya bin Habbab] dari [Abu 'Amrah] dari [Zaid bin Khalid] dia berkata; \"Seorang laki-laki meninggal pada perang Khaibar, lalu Nabi shallallahu 'alaihi wasallam bersabda: 'sholatlah kalian atas kematian sahabat kalian, dia telah berbuat curang. kemudian kami memeriksa harta yang dia miliki, dan kami mendapatkan darinya tombak Yahudi yang senilai dua dirham'.\" "
            },
            {
                "number": 1889,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي قَتَادَةَ يُحَدِّثُ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ مِنْ الْأَنْصَارِ لِيُصَلِّيَ عَلَيْهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلُّوا عَلَى صَاحِبِكُمْ فَإِنَّ عَلَيْهِ دَيْنًا قَالَ أَبُو قَتَادَةَ هُوَ عَلَيَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْوَفَاءِ قَالَ بِالْوَفَاءِ فَصَلَّى عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Abu Dawud] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Utsman bin 'Abdullah bin Mauhab]; Aku mendengar ['Abdullah bin Abu Qatadah] menceritakan dari [bapaknya] bahwa jenazah laki-laki dari kaum Anshar dibawa kepada Rasulullah shallallahu 'alaihi wasallam agar baliau mensholatinya, lalu beliau bersabda: \"sholatilah sahabat kalian, karena ia masih memiliki utang.\" Abu Qatadah berkata; \"Utang itu menjadi utangku.\" Nabi shallallahu 'alaihi wasallam bertanya; 'Untuk melunasinya? ' ia menjawab, 'Untuk melunasinya.' Lalu beliau mensholatinya.\""
            },
            {
                "number": 1890,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ قَالَ حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ الْأَكْوَعِ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَنَازَةٍ فَقَالُوا يَا نَبِيَّ اللَّهِ صَلِّ عَلَيْهَا قَالَ هَلْ تَرَكَ عَلَيْهِ دَيْنًا قَالُوا نَعَمْ قَالَ هَلْ تَرَكَ مِنْ شَيْءٍ قَالُوا لَا قَالَ صَلُّوا عَلَى صَاحِبِكُمْ قَالَ رَجُلٌ مِنْ الْأَنْصَارِ يُقَالُ لَهُ أَبُو قَتَادَةَ صَلِّ عَلَيْهِ وَعَلَيَّ دَيْنُهُ فَصَلَّى عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dan [Muhammad bin Al Mutsanna] mereka berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Yazid bin Abu 'Ubaid] dia berkata; telah menceritakan kepada kami [Salamah bin Al Akwa'] dia berkata; \"Seorang jenazah pernah dibawa kepada Nabi shallallahu 'alaihi wasallam, lalu mereka berkata; \"Wahai Nabi Allah, sholatilah ia.\" Beliau bertanya: 'Apakah ia meninggalkan sesuatu? ' mereka menjawab; \"tidak.\" Beliau bersabda: 'sholatilah shahabat kalian.' Seorang laki-laki Anshar yang bernama Abu Qatadah berkata; 'sholatilah ia dan utangnya menjadi tanggunganku.' Lalu beliau mensholatinya.\""
            },
            {
                "number": 1891,
                "arab": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ الْقُوْمَسِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّي عَلَى رَجُلٍ عَلَيْهِ دَيْنٌ فَأُتِيَ بِمَيْتٍ فَسَأَلَ أَعَلَيْهِ دَيْنٌ قَالُوا نَعَمْ عَلَيْهِ دِينَارَانِ قَالَ صَلُّوا عَلَى صَاحِبِكُمْ قَالَ أَبُو قَتَادَةَ هُمَا عَلَيَّ يَا رَسُولَ اللَّهِ فَصَلَّى عَلَيْهِ فَلَمَّا فَتَحَ اللَّهُ عَلَى رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ مَنْ تَرَكَ دَيْنًا فَعَلَيَّ وَمَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ",
                "id": "Telah mengabarkan kepada kami [Nuh bin Habib Al Qumasi] dia berkata; telah menceritakan kepada kami ['Abdurrazzaq] dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Jabir] dia berkata; Nabi shallallahu 'alaihi wasallam tidak pernah mensholati jenazah yang memiliki utang lalu didatangkan kepada beliau seorang yang telah meninggal, beliau bertanya; \"Apakah ia masih memiliki utang?\" mereka menjawab, \"ya, ia memiliki utang dua dinar.\" Beliau bersabda: \"sholatilah sahabat kalian.\" Abu Qatadah berkata; \"Dua dinar itu menjadi tanggunganku wahai Rasulullah!\" lalu beliau mensholatinya. Setelah Allah memberi kemenangan kepada Rasul-Nya shallallahu 'alaihi wasallam, beliau bersabda: \"Aku lebih berhak terhadap setiap mu'min dari dirinya sendiri, barangsiapa meninggalkan utang, menjadi tanggunganku dan barang siapa yang meninggalkan harta, untuk ahli warisnya.\""
            },
            {
                "number": 1892,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ وَابْنُ أَبِي ذِئْبٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا تُوُفِّيَ الْمُؤْمِنُ وَعَلَيْهِ دَيْنٌ سَأَلَ هَلْ تَرَكَ لِدَيْنِهِ مِنْ قَضَاءٍ فَإِنْ قَالُوا نَعَمْ صَلَّى عَلَيْهِ وَإِنْ قَالُوا لَا قَالَ صَلُّوا عَلَى صَاحِبِكُمْ فَلَمَّا فَتَحَ اللَّهُ عَزَّ وَجَلَّ عَلَى رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَمَنْ تُوُفِّيَ وَعَلَيْهِ دَيْنٌ فَعَلَيَّ قَضَاؤُهُ وَمَنْ تَرَكَ مَالًا فَهُوَ لِوَرَثَتِهِ",
                "id": "Telah mengabarkan kepada kami [Yunus bin 'Abdul A'la] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus] dan [Ibnu Abu Dzi'b] dari [Ibnu Syihab] dari [Abu Salamah] dari [Abu Hurairah] bahwa ketika seorang mukmin meninggal dunia dan ia memiliki hutang, Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah ia meninggalkan sesuatu yang bisa dipakai untuk melunasi utangnya?\" Jika mereka menjawab, \"Ya.\" Beliau mensholatinya. Jika mereka menjawab, \"Tidak.\" Beliau bersabda: \"sholatilah sahabat kalian.\" Setelah Allah memberi kemenangan kepada Rasul-Nya shallallahu 'alaihi wasallam, beliau bersabda: \"Aku lebih berhak terhadap setiap mukmin dari mereka sendiri, barangsiapa meninggal dunia dan ia memiliki utang, menjadi kewajibanku untuk melunasinya dan barangsiapa yang meninggalkan harta, hal itu untuk ahli warisnya.\""
            },
            {
                "number": 1893,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا أَبُو خَيْثَمَةَ زُهَيْرٌ قَالَ حَدَّثَنَا سِمَاكٌ عَنْ ابْنِ سَمُرَةَأَنَّ رَجُلًا قَتَلَ نَفْسَهُ بِمَشَاقِصَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَنَا فَلَا أُصَلِّي عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah memberitakan kepada kami [Abul Walid] dia berkata; telah menceritakan kepada kami [Abu Khaitsamah Zuhair] dia berkata; telah menceritakan kepada kami [Simak] dari [Ibnu Samurah] bahwa seorang laki-laki bunuh diri dengan mata tombak, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adapun aku, tidak akan mensholatinya.\""
            },
            {
                "number": 1894,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ سَمِعْتُ ذَكْوَانَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ فَهُوَ فِي نَارِ جَهَنَّمَ يَتَرَدَّى خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ تَحَسَّى سُمًّا فَقَتَلَ نَفْسَهُ فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ ثُمَّ انْقَطَعَ عَلَيَّ شَيْءٌ خَالِدٌ يَقُولُ كَانَتْ حَدِيدَتُهُ فِي يَدِهِ يَجَأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Sulaiman]; Aku mendengar [Dzakwan] menceritakan dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Siapa yang menjatuhkan diri dari gunung, lalu meninggal dunia, ia akan jatuh ke neraka jahannam, ia kekal serta abadi di dalamnya selama-lamanya. Barangsiapa yang menegak racun, lalu meninggal dunia, racunnya ada di tangannya, ia akan menegaknya di neraka jahannam, ia kekal serta abadi di dalamnya selama-lamanya. Dan barang siapa yang bunuh diri dengan besi, besi itu akan ada di tangannya, dengannya ia akan menghujamkan ke perutnya di neraka jahannam, ia kekal dan abadi di dalamnya selama-lamanya.\""
            },
            {
                "number": 1895,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَلَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَيٍّ ابْنُ سَلُولَ دُعِيَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ عَلَيْهِ فَلَمَّا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَثَبْتُ إِلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ تُصَلِّي عَلَى ابْنِ أُبَيٍّ وَقَدْ قَالَ يَوْمَ كَذَا وَكَذَا كَذَا وَكَذَا أُعَدِّدُ عَلَيْهِ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ أَخِّرْ عَنِّي يَا عُمَرُ فَلَمَّا أَكْثَرْتُ عَلَيْهِ قَالَ إِنِّي قَدْ خُيِّرْتُ فَاخْتَرْتُ فَلَوْ عَلِمْتُ أَنِّي لَوْ زِدْتُ عَلَى السَّبْعِينَ غُفِرَ لَهُ لَزِدْتُ عَلَيْهَا فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ انْصَرَفَ فَلَمْ يَمْكُثْ إِلَّا يَسِيرًا حَتَّى نَزَلَتْ الْآيَتَانِ مِنْ بَرَاءَةَ{ وَلَا تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلَا تَقُمْ عَلَى قَبْرِهِ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ }فَعَجِبْتُ بَعْدُ مِنْ جُرْأَتِي عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ وَاللَّهُ وَرَسُولُهُ أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Hujain bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari ['ubaidhullah bin 'Abdullah] dari ['Abdullah bin 'Abbas] dari ['Umar bin Al Khaththab] dia berkata; Setelah Abdullah bin Ubai bin Salul meninggal dunia, Rasulullah shallallahu 'alaihi wasallam diundang untuk mensholatinya. Setelah Rasulullah shallallahu 'alaihi wasallam berdiri untuk melaksanakan sholat, aku meloncat ke arah beliau, lalu aku berkata, \"Wahai Rasulullah shallallahu 'alaihi wasallam, engkau mensholati Ibnu Ubbay, padahal ia telah mengatakan hari ini dan itu begini dan itu begitu?! Aku menyebut kejelekannya, Rasulullah shallallahu 'alaihi wasallam tersenyum seraya bersabda: \"Tundalah -perkataanmu- dariku wahai Umar!\" setelah aku mengulang menyebut-nyebut kejelekannya, beliau bersabda: \" Aku telah diberikan pilihan, aku memilih. Andaikata aku tahu, kalau aku menambahnya lebih dari tujuh puluh ia akan diampuni, niscaya aku menambahnya!.\"Lalu Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat atasnya, kemudian beliau pergi dan tidak berada di tempat itu kecuali hanya sejenak, hingga turun dua ayat dari surah Bara'ah, \"(Dan janganlah kamu sekali-kali mensholatkan (jenazah) seorang yang mati di antara mereka, dan janganlah kamu berdiri (mendo'akan) di kuburnya. mereka telah kafir kepada Allah dan RasulNya dan mereka mati dalam keadaan fasik.\" (Qs. At-Taubah 9: 84). Setelah itu aku heran atas keberanianku terhadap Rasulullah shallallahu 'alaihi wasallam ketika itu. Dan hanya Allah dan Rasul-Nya yang lebih mengatahui.\""
            },
            {
                "number": 1896,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ حُجْرٍ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْمَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلَّا فِي الْمَسْجِدِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dan ['Ali bin Hujr] mereka berkata; telah menceritakan kepada kami ['Abdul 'Aziz bin Muhammad] dari ['Abdul Wahid bin Hamzah] dari ['Abbad bin 'Abdullah bin Az Zubair] dari ['Aisyah] dia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam mensholati Suhail bin Baidla' melainkan di dalam masjid.\""
            },
            {
                "number": 1897,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ أَنَّ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَخْبَرَهُ أَنَّ عَائِشَةَ قَالَتْمَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلَّا فِي جَوْفِ الْمَسْجِدِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Naslr] dia berkata; telah menceritakan kepada kami ['Abdullah] dari [Musa bin 'Uqbah] dari ['Abdul Wahid bin Hamzah], ['Abbad bin 'Abdullah bin Az Zubair] mengabarkan kepadanya bahwasanya ['Aisyah] dia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam mensholati Suhail bin Baidla' melainkan di dalam masjid.\""
            },
            {
                "number": 1898,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ أَنَّهُ قَالَاشْتَكَتْ امْرَأَةٌ بِالْعَوالِي مِسْكِينَةٌ فَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُهُمْ عَنْهَا وَقَالَ إِنْ مَاتَتْ فَلَا تَدْفِنُوهَا حَتَّى أُصَلِّيَ عَلَيْهَا فَتُوُفِّيَتْ فَجَاءُوا بِهَا إِلَى الْمَدِينَةِ بَعْدَ الْعَتَمَةِ فَوَجَدُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَامَ فَكَرِهُوا أَنْ يُوقِظُوهُ فَصَلَّوْا عَلَيْهَا وَدَفَنُوهَا بِبَقِيعِ الْغَرْقَدِ فَلَمَّا أَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءُوا فَسَأَلَهُمْ عَنْهَا فَقَالُوا قَدْ دُفِنَتْ يَا رَسُولَ اللَّهِ وَقَدْ جِئْنَاكَ فَوَجَدْنَاكَ نَائِمًا فَكَرِهْنَا أَنْ نُوقِظَكَ قَالَ فَانْطَلِقُوا فَانْطَلَقَ يَمْشِي وَمَشَوْا مَعَهُ حَتَّى أَرَوْهُ قَبْرَهَا فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَفُّوا وَرَاءَهُ فَصَلَّى عَلَيْهَا وَكَبَّرَ أَرْبَعًا",
                "id": "Telah mengabarkan kepada kami [Yunus bin 'Abdul A'la] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Abu Umamah bin Sahl bin Hunaif] bahwasanya dia berkata; \"Ada seorang wanita -miskin- yang tinggal di dataran tinggi mengadu kesakitan, Rasulullah shallallahu 'alaihi wasallam bertanya kepada mereka tentang keadaannya dan bersabda: \"Jika ia meninggal dunia, janganlah kalian menguburkannya hingga aku mensholatinya.\" Kemudian ia meninggal dunia dan mereka membawanya ke Madinah setelah hari nampak gelap (setelah sholat 'Isya), saat itu mereka mendapatkan Rasulullah shallallahu 'alaihi wasallam telah tidur, mereka enggan untuk membangunkan beliau, lalu mereka mensholatinya dan menguburkannya di Baqi' Al Gharqad. Saat pagi harinya mereka datang menemui Rasulullah shallallahu 'alaihi wasallam, lalu beliau bertanya kepada mereka tentang wanita itu. Mereka menjawab; \"Ia telah dikuburkan wahai Rasulullah shallallahu 'alaihi wasallam, sungguh kami telah datang untuk menemui engkau, namun kami mendapatkan engkau sedang tidur, kami tidak ingin membangunkan engkau, beliau bersabda: \"Berangkatlah.\" Lalu beliau berangkat dengan berjalan kaki dan mereka berjalan bersama beliau, hingga mereka memperlihatkan kuburannya kepada Nabi. Lalu Rasulullah shallallahu 'alaihi wasallam berdiri dan mereka berdiri di belakang beliau, kemudian beliau melaksanakan sholat atasnya dan bertakbir empat kali.\""
            },
            {
                "number": 1899,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَخَاكُمْ النَّجَاشِيَّ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ فَقَامَ فَصَفَّ بِنَا كَمَا يُصَفُّ عَلَى الْجَنَازَةِ وَصَلَّى عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ubaid] dari [Hafsh bin Ghiyats] dari [Ibnu Juraij] dari ['Atha] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Saudara kalian An Najasyi telah meninggal dunia, berdirilah dan sholatilah ia.\" Lalu beliau berdiri dan berbaris bersama kami seperti berbaris untuk melaksanakan sholat jenazah dan beliau pun melaksanakan sholat atasnya.\""
            },
            {
                "number": 1900,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى لِلنَّاسِ النَّجَاشِيَّ الْيَوْمَ الَّذِي مَاتَ فِيهِ ثُمَّ خَرَجَ بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ فَصَلَّى عَلَيْهِ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Naslr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam memberitahukan kematian An Najazyi kepada orang-orang di hari kematiannya, beliau keluar bersama mereka ke tempat sholat, lalu berbaris, kemudian melaksanakan sholat atasnya dan bertakbir empat kali takbir.\""
            },
            {
                "number": 1901,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَنَعَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّجَاشِيَّ لِأَصْحَابِهِ بِالْمَدِينَةِ فَصَفُّوا خَلْفَهُ فَصَلَّى عَلَيْهِ وَكَبَّرَ أَرْبَعًاقَالَ أَبُو عَبْد الرَّحْمَنِ ابْنُ الْمُسَيَّبِ إِنِّي لَمْ أَفْهَمْهُ كَمَا أَرَدْتَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah menceritakan kepada kami ['Abdurrazzaq] dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnul Musayyab] dan [Abu Salamah] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memberitahukan kematian An Najasyi kepada para sahabat di Madinah, lalu mereka berbaris di belakang beliau, kemudian mensholatinya dan bertakbir empat kali.\" Abu Abdurrahman berkata; 'Aku belum mengerti tentang Ibnu Musayyab sebagaimana yang kamu maksudkan.'"
            },
            {
                "number": 1902,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَخَاكُمْ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ فَصَفَفْنَا عَلَيْهِ صَفَّيْنِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Isma'il] dari [Ayyub] dari [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Saudara kalian telah meninggal dunia, berdirilah dan laksanakanlah sholat atasnya.\" Lalu mereka berbaris menjadi dua barisan.\""
            },
            {
                "number": 1903,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو دَاوُدَ سَمِعْتُ شُعْبَةَ يَقُولُ السَّاعَةَ يَخْرُجُ السَّاعَةَ يَخْرُجُ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَكُنْتُ فِي الصَّفِّ الثَّانِي يَوْمَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى النَّجَاشِيِّ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Abu Dawud]; Aku mendengar [Syu'bah] berkata; \"Sekarang Abu Jubair akan keluar (dari rumahnya), sekarang Abu Jubair akan keluar (dari rumahnya). Telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] dia berkata; \"Aku berada di barisan kedua di hari ketika Rasulullah shallallahu 'alaihi wasallam mensholati An Najasyi.\""
            },
            {
                "number": 1904,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا يُونُسُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخَاكُمْ النَّجَاشِيَّ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ قَالَ فَقُمْنَا فَصَفَفْنَا عَلَيْهِ كَمَا يُصَفُّ عَلَى الْمَيِّتِ وَصَلَّيْنَا عَلَيْهِ كَمَا يُصَلَّى عَلَى الْمَيِّتِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] dia berkata; telah menceritakan kepada kami [Yunus] dari [Muhammad bin Sirin] dari [Abul Muhallab] dari ['Imran bin Hushain] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Saudara kalian meninggal dunia, berdirilah dan laksanakanlah sholat atasnya.\" Ia berkata: \"Lalu kami berbaris seperti saat berbaris untuk mensholati mayit dan kami mensholatinya seperti mensholati mayit.\""
            },
            {
                "number": 1905,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ ابْنِ بُرَيْدَةَ عَنْ سَمُرَةَ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُمِّ كَعْبٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ فِي وَسَطِهَا",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari ['Abdul Warits] dia berkata; telah menceritakan kepada kami [Husain] dari [Ibnu Buraidah] dari [Samurah] dia berkata; \"Aku mensholati Ummu Ka'ab bersama Rasulullah shallallahu 'alaihi wasallam disaat darah nifasnya keluar. Lalu Rasulullah shallallahu 'alaihi wasallam berdiri dalam sholat pada posisi tengah jenazah tersebut.\""
            },
            {
                "number": 1906,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا سَعِيدٌ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عَمَّارٍ قَالَحَضَرَتْ جَنَازَةُ صَبِيٍّ وَامْرَأَةٍ فَقُدِّمَ الصَّبِيُّ مِمَّا يَلِي الْقَوْمَ وَوُضِعَتْ الْمَرْأَةُ وَرَاءَهُ فَصَلَّى عَلَيْهِمَا وَفِي الْقَوْمِ أَبُو سَعِيدٍ الْخُدْرِيُّ وَابْنُ عَبَّاسٍ وَأَبُو قَتَادَةَ وَأَبُو هُرَيْرَةَ فَسَأَلْتُهُمْ عَنْ ذَلِكَ فَقَالُوا السُّنَّةُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Yazid] dia berkata; [bapakku] telah menceritakan kepada kami, dia berkata; telah menceritakan kepada kami [Sa'id] dia berkata; telah menceritakan kepadaku [Yazid bin Abu Habib] dari ['Atha bin Abu Rabah] dari ['Ammar] dia berkata; \"-Saat- jenazah bayi laki-laki dan seorang wanita datang, jenazah bayi laki-laki dikedepankan di dekat kaum dan wanita tersebut diletakkan di belakangnya, lalu keduanya disholati dan diantara kaum tersebut ada [Abu Sa'id Al Khudri], [Ibnu Abbas], [Abu Qatadah] dan [Abu Hurairah], lalu aku bertanya tentang hal itu? mereka mengatakan; \"Itu adalah sunnah.\""
            },
            {
                "number": 1907,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ نَافِعًا يَزْعُمُأَنَّ ابْنَ عُمَرَ صَلَّى عَلَى تِسْعِ جَنَائِزَ جَمِيعًا فَجَعَلَ الرِّجَالَ يَلُونَ الْإِمَامَ وَالنِّسَاءَ يَلِينَ الْقِبْلَةَ فَصَفَّهُنَّ صَفًّا وَاحِدًا وَوُضِعَتْ جَنَازَةُ أُمِّ كُلْثُومِ بِنْتِ عَلِيٍّ امْرَأَةِ عُمَرَ بْنِ الْخَطَّابِ وَابْنٍ لَهَا يُقَالُ لَهُ زَيْدٌ وُضِعَا جَمِيعًا وَالْإِمَامُ يَوْمَئِذٍ سَعِيدُ بْنُ الْعَاصِ وَفِي النَّاسِ ابْنُ عُمَرَ وَأَبُو هُرَيْرَةَ وَأَبُو سَعِيدٍ وَأَبُو قَتَادَةَ فَوُضِعَ الْغُلَامُ مِمَّا يَلِي الْإِمَامَ فَقَالَ رَجُلٌ فَأَنْكَرْتُ ذَلِكَ فَنَظَرْتُ إِلَى ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ وَأَبِي قَتَادَةَ فَقُلْتُ مَا هَذَا قَالُوا هِيَ السُّنَّةُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah memberitakan kepada kami ['Abdurrazzaq] dia berkata; telah memberitakan kepada kami [Ibnu Juraij] dia berkata; Aku mendengar [Nafi'] menganggap bahwa [Ibnu Umar] pernah mensholati Sembilan orang jenazah secara bersama. Mereka meletakkan jenazah laki-laki di dekat Imam dan jenazah wanita di dekat kiblat, lalu mensejajarkan jenazah wanita menjadi satu barisan sambil diletakkan jenazah Ummu Kulstum binti Ali istri Umar bin Al Khattab dan anaknya yang bernama Zaid, keduanya diletakkan secara bersamaan. Dan yang menjadi Imam pada saat itu adalah Sa'id bin Al Ash sedangkan di antara para makmum terdapat Ibnu Umar, Abu Hurairah, Abu Sa'id dan Abu Qatadah. Lalu diletakan anak kecil tersebut di dekat imam. Ada seorang yang mengatakan; \" Aku mengingkari hal itu, kamudian aku melihat kearah [Ibnu Abbas], [Abu Hurairah], [Abu Sa'id] dan [Abu Qatadah]. Lalu aku berkata.\"Apa-apaan ini!\" mereka mengatakan; \"Inilah sunnah.\""
            },
            {
                "number": 1908,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ وَالْفَضْلُ بْنُ مُوسَى ح و أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ حُسَيْنٍ الْمُكْتِبِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى أُمِّ فُلَانٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ فِي وَسَطِهَا",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Ibnul Mubarak] dan [Al Fadhl bin Musa]. Dan diriwayatkan pula dari jalur lain, telah mengabarkan kepada kami [Suwaid] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Husain Al Muktib] dari ['Abdullah bin Buraidah] dari [Samurah bin Jundub] bahwa Rasulullah shallallahu 'alaihi wasallam mensholati Ummu fulan -yang meninggal dalam keadaan nifas-. lalu Rasulullah shallallahu 'alaihi wasallam berdiri di posisi tengah jenazah tersebut."
            },
            {
                "number": 1909,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى لِلنَّاسِ النَّجَاشِيَّ وَخَرَجَ بِهِمْ فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari [Sa'id] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam memberitahukan kematian An Najasyi kepada orang-orang, lalu beliau keluar bersama mereka kemudian berbaris bersama mereka dan bertakbir empat kali takbir."
            },
            {
                "number": 1910,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ قَالَمَرِضَتْ امْرَأَةٌ مِنْ أَهْلِ الْعَوَالِي وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْسَنَ شَيْءٍ عِيَادَةً لِلْمَرِيضِ فَقَالَ إِذَا مَاتَتْ فَآذِنُونِي فَمَاتَتْ لَيْلًا فَدَفَنُوهَا وَلَمْ يُعْلِمُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَصْبَحَ سَأَلَ عَنْهَا فَقَالُوا كَرِهْنَا أَنْ نُوقِظَكَ يَا رَسُولَ اللَّهِ فَأَتَى قَبْرَهَا فَصَلَّى عَلَيْهَا وَكَبَّرَ أَرْبَعًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Umamah bin Sahl] dia berkata; Seorang wanita dari penduduk daratan tinggi sakit, sementara Nabi shallallahu 'alaihi wasallam adalah orang yang paling baik dalam urusan menjenguk orang sakit, lalu beliau bersabda: \"Jika ia meninggal dunia, beritahulah aku.\" Lalu ia meninggal dunia di malam hari dan mereka menguburnya tanpa memberitahu Nabi shallallahu 'alaihi wasallam saat pagi harinya, beliau bertanya tentang wanita itu, mereka menjawab; \"Kami tidak ingin membangunkanmu wahai Rasulullah!\" Kontan beliau mendatangi kuburannya, mensholatinya dan bertakbir empat kali (melakukan sholat jenazah)."
            },
            {
                "number": 1911,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ ابْنِ أَبِي لَيْلَى أَنَّ زَيْدَ بْنَ أَرْقَمَصَلَّى عَلَى جَنَازَةٍ فَكَبَّرَ عَلَيْهَا خَمْسًا وَقَالَ كَبَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah menceritakan kepadaku ['Amru bin Murrah] dari [Ibnu Abu Laila] bahwasanya [Zaid bin Arqam] mensholati seorang jenazah, lalu ia bertakbir lima kali dan berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah melakukannya -seperti ini-.\""
            },
            {
                "number": 1912,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ أَبِي حَمْزَةَ بْنِ سُلَيْمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى جَنَازَةٍ يَقُولُ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَاعْفُ عَنْهُ وَعَافِهِ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِمَاءٍ وَثَلْجٍ وَبَرَدٍ وَنَقِّهِ مِنْ الْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنْ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَقِهِ عَذَابَ الْقَبْرِ وَعَذَابَ النَّارِقَالَ عَوْفٌ فَتَمَنَّيْتُ أَنْ لَوْ كُنْتُ الْمَيِّتَ لِدُعَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِذَلِكَ الْمَيِّتِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amru bin As Sarh] dari [Ibnu Wahab] dia berkata; telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Abu Hamzah bin Sulaim] dari ['Abdurrahman bin Jubair] dari [bapaknya] dari ['Auf bin Malik] dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam mensholati jenazah dengan berdo'a: \"Ya Allah, berilah ampunan kepadanya. Kasihilah ia, maafkanlah ia dan selamatkanlah ia. Muliakanlah saat turunnya, luaskanlah kuburannya, mandikanlah ia dengan air, salju dan embun, bersihkanlah ia dari kotoran seperti baju putih yang dibersihkan dari kotoran, gantikan rumah yang lebih baik dari rumahnya, istri yang lebih baik dari istrinya, dan lindungilah dari adzab kubur dan adzab Neraka.\" Auf berkata; \"Aku pun berharap, andaikata aku menjadi mayit itu, karena do'a Rasulullah shallallahu 'alaihi wasallam untuk mayit tersebut.\""
            },
            {
                "number": 1913,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ حَبِيبِ بْنِ عُبَيْدٍ الْكَلَاعِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ قَالَ سَمِعْتُ عَوْفَ بْنَ مَالِكٍ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى مَيِّتٍ فَسَمِعْتُ فِي دُعَائِهِ وَهُوَ يَقُولُ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ وَنَقِّهِ مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَأَدْخِلْهُ الْجَنَّةَ وَنَجِّهِ مِنْ النَّارِ أَوْ قَالَ وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ",
                "id": "Telah mengabarkan kepada kami [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Ma'n] dia berkata; telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Habib bin 'Ubaid Al Kala'i] dari [Jubair bin Nufair Al Hadlrami] dia berkata; aku mendengar ['Auf bin Malik] berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam mensholati mayit, lalu aku mendengar dalam do'anya beliau mengucapkan: \"Ya Allah, ampunilah ia, kasihanilah ia, selamatkan dan maafkanlah ia. Muliakanlah saat turunnya, luaskanlah kuburannya, mandikanlah ia dengan air, salju dan embun, bersihkanlah kesalahan darinya seperti baju putih yang dibersihkan dari kotoran, gantikanlah rumah yang lebih baik dari rumahnya, istri yang lebih baik dari istrinya, masukkanlah ia ke dalam surga, selamatkanlah ia dari neraka -atau beliau bersabda: - dan lindungilah ia dari siksa kubur.\""
            },
            {
                "number": 1914,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ رُبَيِّعَةَ السُّلَمِيِّ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عُبَيْدِ بْنِ خَالِدٍ السُّلَمِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آخَى بَيْنَ رَجُلَيْنِ فَقُتِلَ أَحَدُهُمَا وَمَاتَ الْآخَرُ بَعْدَهُ فَصَلَّيْنَا عَلَيْهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قُلْتُمْ قَالُوا دَعَوْنَا لَهُ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ اللَّهُمَّ أَلْحِقْهُ بِصَاحِبِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَيْنَ صَلَاتُهُ بَعْدَ صَلَاتِهِ وَأَيْنَ عَمَلُهُ بَعْدَ عَمَلِهِ فَلَمَا بَيْنَهُمَا كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِقَالَ عَمْرُو بْنُ مَيْمُونٍ أَعْجَبَنِي لِأَنَّهُ أَسْنَدَ لِي",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dia berkata; Aku mendengar ['Amru bin Maimun] menceritakan dari ['Abdullah bin Rubai'ah As Sulami] -dan dia termasuk sahabat Rasulullah shallallahu 'alaihi wasallam- dari ['Ubaid bin Khalid As Sulami] bahwa Rasulullah shallallahu 'alaihi wasallam mensaudarakan antara dua orang, lalu salah satu dari keduanya terbunuh dan yang lain meniggal dunia setelahnya. Kemudian kami mensholatinya. Nabi shallallahu 'alaihi wasallam bertanya: \"Apa yang kalian ucapkan?\" mereka menjawab, \"kami berdo'a untuknya; \"Ya Allah, berilah ampunan kepadanya, ya Allah, rahmatilah ia, ya Allah, pertemukanlah ia dengan sahabatnya!\" Nabi shallallahu 'alaihi wasallam bersabda: \"Dimanakah letak keistimewaan sholatnya dibandingkan sholat kawannya (kawan yang meninggal duluan)? Dan dimanakah letak amalannya dibandingkan amalan (kawan yang meninggal duluan)? Perbedaan antara keduanya bagaikan antara langit dan bumi.\""
            },
            {
                "number": 1915,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي إِبْرَاهِيمَ الْأَنْصَارِيِّ عَنْ أَبِيهِأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي الصَّلَاةِ عَلَى الْمَيِّتِ اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَذَكَرِنَا وَأُنْثَانَا وَصَغِيرِنَا وَكَبِيرِنَا",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Hisyam bin Abu 'Abdullah] dari [Yahya bin Abu Katsir] dari [Abu Ibrahim Al Anshari] dari [bapaknya] bahwasanya ia mendengar Nabi shallallahu 'alaihi wasallam berdo'a saat mensholati mayit, \"Ya Allah berilah ampunan bagi yang masih hidup di antara kami dan yang sudah meninggal dunia, orang yang hadir di antara kami dan yang tidak hadir, kaum laki-laki di antara kami dan kaum wanita, orang yang masih muda di antara kami dan orang yang sudah tua.\""
            },
            {
                "number": 1916,
                "arab": "أَخْبَرَنَا الْهَيْثَمُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ وَهُوَ ابْنُ سَعْدٍ قَالَ حَدَّثَنَا أَبِي عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ قَالَصَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ وَسُورَةٍ وَجَهَرَ حَتَّى أَسْمَعَنَا فَلَمَّا فَرَغَ أَخَذْتُ بِيَدِهِ فَسَأَلْتُهُ فَقَالَ سُنَّةٌ وَحَقٌّ",
                "id": "Telah mengabarkan kepada kami [Al Haitsam bin Ayyub] dia berkata; telah menceritakan kepada kami [Ibrahim bin Sa'd] dia berkata; [bapakku] telah menceritakan kepada kami dari [Thalhah bin 'Abdullah bin 'Auf] dia berkata; \"Aku pernah mensholati jenazah di belakang [Ibnu Abbas], lalu ia membaca surah Al Fatihah dan surah lain, ia mengeraskan (bacaannya) hingga terdengar oleh kami. Setelah selesai, kutarik tangannya, lalu aku bertanya kepadanya? Ia menjawab, \"Ini adalah sunnah dan kebenaran.\""
            },
            {
                "number": 1917,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ قَالَصَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ فَسَمِعْتُهُ يَقْرَأُ بِفَاتِحَةِ الْكِتَابِ فَلَمَّا انْصَرَفَ أَخَذْتُ بِيَدِهِ فَسَأَلْتُهُ فَقُلْتُ تَقْرَأُ قَالَ نَعَمْ إِنَّهُ حَقٌّ وَسُنَّةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari [Thalhah bin 'Abdullah] dia berkata; \"Aku pernah mensholati jenazah di belakang [Ibnu Abbas], lalu aku mendengar ia membaca surah Al Fatihah, setelah selesai, kutarik tangannya, lalu aku bertanya kepadanya dengan berkata; \"Engkau membaca -surah setelah Al Fatihah-?\" ia menjawab; \"Ya, ini adalah kebenaran dan sunnah.\""
            },
            {
                "number": 1918,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ أَنَّهُ قَالَالسُّنَّةُ فِي الصَّلَاةِ عَلَى الْجَنَازَةِ أَنْ يَقْرَأَ فِي التَّكْبِيرَةِ الْأُولَى بِأُمِّ الْقُرْآنِ مُخَافَتَةً ثُمَّ يُكَبِّرَ ثَلَاثًا وَالتَّسْلِيمُ عِنْدَ الْآخِرَةِأَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ مُحَمَّدِ بْنِ سُوَيْدٍ الدِّمَشْقِيِّ الْفِهْرِيِّ عَنْ الضَّحَّاكِ بْنِ قَيْسٍ الدِّمَشْقِيِّ بِنَحْوِ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Abu Umamah] bahwasanya ia berkata; \"Yang sesuai sunnah pada sholat jenazah adalah membaca Al Fatihah pada takbir pertama dengan suara pelan, kemudian bertakbir tiga kali dan mengucapkan salam pada rakaat terakhir.\" Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Muhammad bin Suwaid Ad Dimasyqi Al Fihri] dari [Dlahhak bin Qais Ad Dimasyqi] seperti itu juga."
            },
            {
                "number": 1919,
                "arab": "أَخْبَرَنَا سُوَيْدٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ سَلَّامِ بْنِ أَبِي مُطِيعٍ الدِّمَشْقِيِّ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ رَضِيعِ عَائِشَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ مَيِّتٍ يُصَلِّي عَلَيْهِ أُمَّةٌ مِنْ الْمُسْلِمِينَ يَبْلُغُونَ أَنْ يَكُونُوا مِائَةً يَشْفَعُونَ إِلَّا شُفِّعُوا فِيهِقَالَ سَلَّامٌ فَحَدَّثْتُ بِهِ شُعَيْبَ بْنَ الْحَبْحَابِ فَقَالَ حَدَّثَنِي بِهِ أَنَسُ بْنُ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Suwaid] dia berkata; telah menceritakan kepada kami ['Abdullah] dari [Sallam bin Abu Muthi' Ad Dimasyqi] dari [Ayyub] dari [Abu Qibalah] dari ['Abdullah bin Yazid] -saudara sepersusuan 'Aisyah- dari ['Aisyah Radliyatul anha], dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidaklah seorang mayit disholati oleh umat dari kalangan kaum Muslimin yang jumlah mereka mencapai seratus, semuanya memberikan kesaksian baik, kecuali akan diberi syafa'at padanya.\" [Sallam] berkata; ' hal itu aku ceritakan kepada [Syu'aib bin Al Habhab] lalu ia berkata; ' [Anas bin Malik] telah menceritakan hal itu kepadaku dari Nabi shallallahu 'alaihi wasallam.'"
            },
            {
                "number": 1920,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ رَضِيعٍ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمُوتُ أَحَدٌ مِنْ الْمُسْلِمِينَ فَيُصَلِّي عَلَيْهِ أُمَّةٌ مِنْ النَّاسِ فَيَبْلُغُوا أَنْ يَكُونُوا مِائَةً فَيَشْفَعُوا إِلَّا شُفِّعُوا فِيهِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Zurarah] dia berkata; telah memberitakan kepada kami [Isma'il] dari [Ayyub] dari [Abu Qilabah] dari ['Abdullah bin Yazid] -saudara sepersusuan 'Aisyah- dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah seorang dari kaum Muslimin meninggal dunia kemudian disholati oleh umat manusia yang jumlah mereka seratus, lalu kemudian mereka memberi kesaksian baik, kecuali akan diberi syafa'at padanya.\""
            },
            {
                "number": 1921,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ سَوَاءٍ أَبُو الْخَطَّابِ قَالَ حَدَّثَنَا أَبُو بَكَّارٍ الْحَكَمُ بْنُ فَرُّوخَ قَالَ صَلَّى بِنَا أَبُو الْمَلِيحِ عَلَى جَنَازَةٍ فَظَنَنَّا أَنَّهُ قَدْ كَبَّرَ فَأَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ أَقِيمُوا صُفُوفَكُمْ وَلْتَحْسُنْ شَفَاعَتُكُمْ قَالَ أَبُو الْمَلِيحِ حَدَّثَنِي عَبْدُ اللَّهِ وَهُوَ ابْنُ سَلِيطٍ عَنْ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ وَهِيَ مَيْمُونَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْأَخْبَرَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ مَيِّتٍ يُصَلِّي عَلَيْهِ أُمَّةٌ مِنْ النَّاسِ إِلَّا شُفِّعُوا فِيهِفَسَأَلْتُ أَبَا الْمَلِيحِ عَنْ الْأُمَّةِ فَقَالَ أَرْبَعُونَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Muhammad bin Sawa Abul Khaththab] dia berkata; telah menceritakan kepada kami [Abu Bakkar Al Hakam bin Farrukh] dia berkata; \"Abul Malih pernah mensholati jenazah bersama kami, lalu kami mengira beliau telah bertakbir! Kemudian beliau menghadapkan wajahnya ke arah kami seraya berkata; \"Luruskan barisan dan berikanlah kesaksian baik kalian.\" [Abul Malih] berkata: Telah menceritakan kepadaku [Abdullah] -yakni Ibnu Salith-dari salah seorang Ibu para Mukminin -yaitu [Maimunah] istri Nabi shallallahu 'alaihi wasallam-, ia berkata: \"Nabi shallallahu 'alaihi wasallam mengabarkan kepadaku, beliau bersabda: \"Tidaklah seseorang meninggal dunia, kemudian mati disholati oleh segolongan umat manusia, kecuali akan diberi syafa'at'.\" Lalu aku bertanya kepada Abul Mulih apa maksud tentang segolongan umat? Ia menjawab; \"Empat puluh orang.\""
            },
            {
                "number": 1922,
                "arab": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ وَمَنْ انْتَظَرَهَا حَتَّى تُوضَعَ فِي اللَّحْدِ فَلَهُ قِيرَاطَانِ وَالْقِيرَاطَانِ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ",
                "id": "Telah mengabarkan kepada kami [Nuh bin Habib] dia berkata; telah memberitakan kepada kami ['Abdurrazaaq] dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mensholati jenazah, baginya pahala satu qirath dan barang siapa yang menunggunya sampai dimasukkan ke dalam liang lahad, baginya pahala dua qirath. Dua qirath besarnya seperti dua gunung yang besar.\""
            },
            {
                "number": 1923,
                "arab": "أَخْبَرَنَا سُوَيْدٌ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ الْأَعْرَجُ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَهِدَ جَنَازَةً حَتَّى يُصَلَّى عَلَيْهَا فَلَهُ قِيرَاطٌ وَمَنْ شَهِدَ حَتَّى تُدْفَنَ فَلَهُ قِيرَاطَانِ قِيلَ وَمَا الْقِيرَاطَانِ يَا رَسُولَ اللَّهِ قَالَ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ",
                "id": "Telah mengabarkan kepada kami [Suwaid] dia berkata; telah mengabarkan kepada kami ['Abdullah] dari [Yunus] dari [Az Zuhri] dia berkata; telah memberitakan kepada kami ['Abdurrahman Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menyaksikan jenazah hingga mensholatinya, baginya pahala satu qirath dan barang siapa yang menyaksikan hingga dikubur, baginya pahala dua qirath.\" "
            },
            {
                "number": 1924,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ عَوْفٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَبِعَ جَنَازَةَ رَجُلٍ مُسْلِمٍ احْتِسَابًا فَصَلَّى عَلَيْهَا وَدَفَنَهَا فَلَهُ قِيرَاطَانِ وَمَنْ صَلَّى عَلَيْهَا ثُمَّ رَجَعَ قَبْلَ أَنْ تُدْفَنَ فَإِنَّهُ يَرْجِعُ بِقِيرَاطٍ مِنْ الْأَجْرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah kami [Muhammad bin Ja'far] dari ['Auf] dari [Muhammad bin Sirin] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mengiringi jenazah seorang muslim dengan mengharap pahala, lalu mensholatinya dan menguburkannya, baginya pahala dua qirath, dan barangsiapa yang mensholatinya, kemudian pulang sebelum dikubur, dia pulang dengan membawa pahala satu qirath.\""
            },
            {
                "number": 1925,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ قَالَ حَدَّثَنَا مَسْلَمَةُ بْنُ عَلْقَمَةَ قَالَ أَنْبَأَنَا دَاوُدُ عَنْ عَامِرٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَبِعَ جَنَازَةً فَصَلَّى عَلَيْهَا ثُمَّ انْصَرَفَ فَلَهُ قِيرَاطٌ مِنْ الْأَجْرِ وَمَنْ تَبِعَهَا فَصَلَّى عَلَيْهَا ثُمَّ قَعَدَ حَتَّى يُفْرَغَ مِنْ دَفْنِهَا فَلَهُ قِيرَاطَانِ مِنْ الْأَجْرِ كُلُّ وَاحِدٍ مِنْهُمَا أَعْظَمُ مِنْ أُحُدٍ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Qaza'ah] dia berkata; telah menceritakan kepada kami [Maslamah bin 'Alqamah] dia berkata; telah memberitakan kepada kami [Dawud] dari ['Amir] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mengikuti jenazah, lalu mensholatinya kemudian pulang, baginya pahala satu qirath. Dan barangsiapa yang mengikutinya, lalu mensholatinya, kemudian duduk hingga selesai dari penguburannya, baginya pahala dua qirath, masing-masing dari keduanya lebih besar dari gunung Uhud.\""
            },
            {
                "number": 1926,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ هِشَامٍ وَالْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الْجَنَازَةَ فَقُومُوا وَمَنْ تَبِعَهَا فَلَا يَقْعُدَنَّ حَتَّى تُوضَعَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Naslr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Hisyam] dan [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Salalmah] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian melihat jenazah, berdirilah dan apabila mengiringinya, janganlah ia duduk hingga jenazah itu diletakkan."
            },
            {
                "number": 1927,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ وَاقِدٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ مَسْعُودِ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍأَنَّهُ ذُكِرَ الْقِيَامُ عَلَى الْجَنَازَةِ حَتَّى تُوضَعَ فَقَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَعَدَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Waqid] dari [Nafi' bin Jubair] dari [Mas'ud bin Al Hakam] dari ['Ali bin Abu Thalib], disebutkan tentang berdiri ketika ada jenazah hingga diletakkan! Ali bin Abu Thalib berkata; \"Rasulullah shallallahu 'alaihi wasallam berdiri kemudian duduk.\""
            },
            {
                "number": 1928,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ مَسْعُودِ بْنِ الْحَكَمِ عَنْ عَلِيٍّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فَقُمْنَا وَرَأَيْنَاهُ قَعَدَ فَقَعَدْنَا",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah mengabarkan kepadaku [Muhammad bin Al Munkadir] dari [Mas'ud bin Al Hakam] dari ['Ali] dia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam berdiri, lalu kami pun berdiri dan kami melihat beliau duduk, lalu kami pun duduk.\""
            },
            {
                "number": 1929,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ زَاذَانَ عَنْ الْبَرَاءِ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةٍ فَلَمَّا انْتَهَيْنَا إِلَى الْقَبْرِ وَلَمْ يُلْحَدْ فَجَلَسَ وَجَلَسْنَا حَوْلَهُ كَأَنَّ عَلَى رُءُوسِنَا الطَّيْرَ",
                "id": "Telah mengabarkan kepada kami [Harun bin Ishaq] dia berkata; telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari ['Amru bin Qais] dari [Al Minhal bin 'Amru] dari [Zadzan] dari [Al Barra'] dia berkata; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam -rangka mengiringi- jenazah. Setelah kami berhenti di kuburan -namun kuburan belum di gali-, beliau duduk dan kami pun duduk di sekitar beliau, seolah-olah di kepala kami ada burung.\""
            },
            {
                "number": 1930,
                "arab": "أَخْبَرَنَا هَنَّادٌ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِقَتْلَى أُحُدٍ زَمِّلُوهُمْ بِدِمَائِهِمْ فَإِنَّهُ لَيْسَ كَلْمٌ يُكْلَمُ فِي اللَّهِ إِلَّا يَأْتِي يَوْمَ الْقِيَامَةِ يَدْمَى لَوْنُهُ لَوْنُ الدَّمِ وَرِيحُهُ رِيحُ الْمِسْكِ",
                "id": "Telah mengabarkan kepada kami [Hannad] dari [Ibnul Mubarak] dari [Ma'mar] dari [Az Zuhri] dari ['Abdullah bin Tsa'labah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda untuk orang-orang yang terbunuh dalam perang Uhud, \"Selimutilah mereka bersama darah yang ada pada tubuh mereka, sungguh tidak ada luka yang tergores di jalan Allah kecuali pada hari kiamat dia akan datang dengan berlumuran darah, warnanya seperti warna darah dan baunya adalah bau misik.\""
            },
            {
                "number": 1931,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا سَعِيدُ بْنُ السَّائِبِ عَنْ رَجُلٍ يُقَالُ لَهُ عُبَيْدُ اللَّهِ بْنُ مُعَيَّةَ قَالَأُصِيبَ رَجُلَانِ مِنْ الْمُسْلِمِينَ يَوْمَ الطَّائِفِ فَحُمِلَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ أَنْ يُدْفَنَا حَيْثُ أُصِيبَا وَكَانَ ابْنُ مُعَيَّةَ وُلِدَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Sa'id bin As Saib] dari seorang lelaki yang bernama ['ubaidhullah bin Mu'ayyah] dia berkata; \"Dua orang dari kaum Muslimin gugur pada perang Thaif, lalu mereka berdua dibawa kepada Nabi shallallahu 'alaihi wasallam, beliau memerintahkan agar mereka dikubur sebagaimana mereka meninggal, dan Ibnu Mu'ayyah dilahirkan pada masa Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1932,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ قَيْسٍ عَنْ نُبَيْحٍ الْعَنَزِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلَى أُحُدٍ أَنْ يُرَدُّوا إِلَى مَصَارِعِهِمْ وَكَانُوا قَدْ نُقِلُوا إِلَى الْمَدِينَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepada kami [Al Aswad bin Qais] dari [Nubaih Al 'Anazi] dari [Jabir bin 'Abdullah] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan orang-orang yang terbunuh dalam perang Uhud agar dikembalikan ke tempat mereka terbunuh, padahal mereka telah dipindahkan ke Madinah.\""
            },
            {
                "number": 1933,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ نُبَيْحٍ الْعَنَزِىِّ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ادْفِنُوا الْقَتْلَى فِي مَصَارِعِهِمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Al Aswad bin Qais] dari [Nubaih Al? nazi] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Kuburkanlah orang-orang yang terbunuh di tempat mereka terbunuh.\""
            },
            {
                "number": 1934,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ نَاجِيَةَ بْنِ كَعْبٍ عَنْ عَلِيٍّ قَالَقُلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عَمَّكَ الشَّيْخَ الضَّالَّ مَاتَ فَمَنْ يُوَارِيهِ قَالَ اذْهَبْ فَوَارِ أَبَاكَ وَلَا تُحْدِثَنَّ حَدَثًا حَتَّى تَأْتِيَنِي فَوَارَيْتُهُ ثُمَّ جِئْتُ فَأَمَرَنِي فَاغْتَسَلْتُ وَدَعَا لِي وَذَكَرَ دُعَاءً لَمْ أَحْفَظْهُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya] dari [Sufyan] dia berkata; telah menceritakan kepadaku [Abu Ishaq] dari [Najiyah bin Ka'ab] dari ['Ali] dia berkata; \"Aku pernah bertanya kepada Nabi shallallahu 'alaihi wasallam, \" paman engkau, orang tua yang sesat telah meninggal dunia! Siapa yang menguburkannya?\" beliau bersabda: \"Pergilah, lalu kuburkan bapakmu dan janganlah sekali-kali kamu melakukan suatu hal, hingga kamu datang menemuiku.\" Kemudian aku menguburkannya dan datang menemuinya, lalu beliau memerintahkanku untuk mandi, aku mandi dan beliau berdo'a untukku. Beliau menyebutkan suatu do'a yang tidak aku hafal.\""
            },
            {
                "number": 1935,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنْ سَعْدٍ قَالَأَلْحِدُوا لِي لَحْدًا وَانْصِبُوا عَلَيَّ نَصْبًا كَمَا فُعِلَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami ['Abdullah bin Ja'far] dari [Isma'il bin Muhammad bin Sa'ad] dari [bapaknya] dari [Sa'ad] dia berkata; \"Galilah lahd untukku, dan tegakkan (gundukkan tanah) di atasku, sebagaimana telah dibuatkan untuk Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1936,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَبُو عَامِرٍ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدٍ عَنْ عَامِرِ بْنِ سَعْدٍأَنَّ سَعْدًا لَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ أَلْحِدُوا لِي لَحْدًا وَانْصِبُوا عَلَيَّ نَصْبًا كَمَا فُعِلَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Abu 'Amir] dari ['Abdullah bin Ja'far] dari [Isma'il bin Muhammad] dari ['Amir bin Sa'd] bahwasanya [Sa'd] ketika menjelang wafatnya berkata; \"Galilah lahd untukku dan tegakkan (gundukkan tanah) di atasku, sebagaimana telah dibuatkan untuk Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1937,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو عَبْدِ الرَّحْمَنِ الْأَذْرَمِيُّ عَنْ حُكَّامِ بْنِ سَلْمٍ الرَّازِيِّ عَنْ عَلِيِّ بْنِ عَبْدِ الْأَعْلَى عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَا",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Muhammad Abu 'Abdurrahman Al Adzrami] dari [Hukkam bin Salm Ar Razi] dari ['Ali bin 'Abdul A'la] dari [bapaknya] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Liang lahad (galian yang dimiringkan) ditanah adalah untuk kita sedangkan Syaq (galian yang sekelilingnya di semen) adalah untuk selain kita.\""
            }
        ]
    }
}