{
    "status": true,
    "data": {
        "start": 4173,
        "end": 4321,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 4173,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَفْتَرِقَا إِلَّا بَيْعَ الْخِيَارِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, lafazh hadits ini adalah lafazh Al Harits, dari [Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli setiap mereka memiliki hak memilih atas sahabatnya selama mereka belum berpisah, kecuali jual beli dengan syarat ada hak memilih.\""
            },
            {
                "number": 4174,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا أَوْ يَكُونَ خِيَارًا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah], ia berkata; telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah, atau merupakan jual beli dengan syarat memiliki hak memilih.\""
            },
            {
                "number": 4175,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيٍّ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا مُحْرِزٌ بُنُ الْوَضَّاحُ عَنْ إِسْمَعِيلَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا إِلَّا أَنْ يَكُونَ الْبَيْعُ كَانَ عَنْ خِيَارٍ فَإِنْ كَانَ الْبَيْعُ عَنْ خِيَارٍ فَقَدْ وَجَبَ الْبَيْعُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ali Al Marwazi], ia berkata; telah menceritakan kepada kami [Muhriz bin Al Wadhdhah] dari [Isma'il] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah, kecuali jual beli tersebut dengan syarat adanya hak memilih, apabila jual beli tersebut dengan syarat adanya hak memilih maka jual beli tersebut telah tetap.\""
            },
            {
                "number": 4176,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ قَالَ أَمْلَى عَلَيَّ نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَبَايَعَ الْبَيِّعَانِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مِنْ بَيْعِهِ مَا لَمْ يَفْتَرِقَا أَوْ يَكُونَ بَيْعُهُمَا عَنْ خِيَارٍ فَإِنْ كَانَ عَنْ خِيَارٍ فَقَدْ وَجَبَ الْبَيْعُ",
                "id": "Telah mengabarkan kepada kami [Ali bin Maimun], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij], ia berkata; Ali mendektekan kepada [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila dua orang yang berjual beli telah melakukan jual beli maka setiap mereka memiliki hak memilih dalam jual belinya selama mereka belum berpisah, atau jual beli mereka dengan syarat adanya hak memilih, apabila dengan syarat adanya hak memilih maka jual beli tersebut telah tetap.\""
            },
            {
                "number": 4177,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا أَوْ يَقُولَ أَحَدُهُمَا لِلْآخَرِ اخْتَرْ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Abdul A'la], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penjual dan pembali memiliki hak memilih selama mereka belum berpisah, atau salah seorang dari mereka mengatakan kepada yang lain; pilihlah.\""
            },
            {
                "number": 4178,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَفْتَرِقَا أَوْ يَكُونَ بَيْعَ خِيَارٍ وَرُبَّمَا قَالَ نَافِعٌ أَوْ يَقُولَ أَحَدُهُمَا لِلْآخَرِ اخْتَرْ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Ibnu Ulayyah], ia berkata; telah memberitakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pedagang dan pembeli memiliki hak memilih hingga mereka memilih, atau jual beli tersebut adalah jual beli dengan syarat adanya hak memilih.\""
            },
            {
                "number": 4179,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَفْتَرِقَا أَوْ يَكُونَ بَيْعَ خِيَارٍ وَرُبَّمَا قَالَ نَافِعٌ أَوْ يَقُولَ أَحَدُهُمَا لِلْآخَرِ اخْتَرْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pedagang dan pembeli memiliki hak memilih atau merupakan jual beli dengan syarat adanya hak memilih.\" Dan terkadang Nafi' mengatakan; atau salahj seorang dari mereka berkata kepada yang lain; pilihlah."
            },
            {
                "number": 4180,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَبَايَعَ الرَّجُلَانِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ حَتَّى يَفْتَرِقَا وَقَالَ مَرَّةً أُخْرَى مَا لَمْ يَتَفَرَّقَا وَكَانَا جَمِيعًا أَوْ يُخَيِّرَ أَحَدُهُمَا الْآخَرَ فَإِنْ خَيَّرَ أَحَدُهُمَا الْآخَرَ فَتَبَايَعَا عَلَى ذَلِكَ فَقَدْ وَجَبَ الْبَيْعُ فَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا الْبَيْعَ فَقَدْ وَجَبَ الْبَيْعُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Apabila dua orang saling berjaul beli maka setiap mereka memiliki hak memilih hingga mereka berpisah\" dan berkata sekali lagi; selama mereka belum berpisah atau salah seorang diantara mereka memberikan hak memilih kepada yang lain, maka apabila salah seorang diantara mereka memberikan hak memilih kepada kepada yang lain kemudian mereka berjual beli atas dasar hal tersebut maka jual beli mereka telah tetap, kemudian apabila mereka berpisah setelah melakukan jual beli dan salah seorang diantara mereka tidak meninggalkan jual beli maka jual beli tersebut telah tetap\" "
            },
            {
                "number": 4181,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ يَقُولُ سَمِعْتُ نَافِعًا يُحَدِّثُ عَنْ ابْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْمُتَبَايِعَيْنِ بِالْخِيَارِ فِي بَيْعِهِمَا مَا لَمْ يَفْتَرِقَا إِلَّا أَنْ يَكُونَ الْبَيْعُ خِيَارًاقَالَ نَافِعٌ فَكَانَ عَبْدُ اللَّهِ إِذَا اشْتَرَى شَيْئًا يُعْجِبُهُ فَارَقَ صَاحِبَهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Abdul Wahhab], ia berkata; saya mendengar [Yahya bin Sa'id] berkata; saya mendengar [Nafi'] menceritakan dari [Ibnu Umar] dari Rasulullah shallallahu 'alaihi wasallam; sesungguhnya dua orang yang berjual beli memiliki hak memilih dalam jual beli selama mereka belum berpisah kecuali jual beli tersebut berdasarkan atas hak memilih. Nafi' berkata; dan Abdullah apabila membeli sesuatu yang menarik baginya maka ia cepat meninggalkan pemiliknya."
            },
            {
                "number": 4182,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ حَدَّثَنَا نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَبَايِعَانِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Husyaim] dari [Yahya bin Sa'id], ia berkata; telah menceritakan kepada kami [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli tidak ada jual beli antara mereka berdua hingga mereka berpisah, kecuali jual beli dengah syarat adanya hak memilih.\""
            },
            {
                "number": 4183,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَيِّعَيْنِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dari [Isma'il] dari [Abdullah bin Dinar] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\""
            },
            {
                "number": 4184,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ عَنْ ابْنِ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّ بَيِّعَيْنِ فَلَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Abdul Hakam] dari [Syu'aib] dari [Al Laits] dari [Ibnu Al Had] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\""
            },
            {
                "number": 4185,
                "arab": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَيِّعَيْنِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ",
                "id": "Telah mengabarkan kepada kami [Abdul Hamid bin Muhammad], ia berkata; telah menceritakan kepada kami [Makhlad], ia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\""
            },
            {
                "number": 4186,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرٍ قَالَ حَدَّثَنَا أَبِي عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّ بَيِّعَيْنِ لَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman bin Daud], ia berkata; telah menceritakan kepada kami [Ishaq bin Bakr], ia berkata; telah menceritakan kepada kami [ayahku] dari [Yazid] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\""
            },
            {
                "number": 4187,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ عَنْ بَهْزِ بْنِ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ بَيِّعَيْنِ فَلَا بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلَّا بَيْعَ الْخِيَارِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yazid] dari [Bahz bin Asad], ia berkata; telah menceritakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepada kami [Abdullah bin Dinar] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli tidak ada jual beli diantara mereka hingga mereka berpisah kecuali jual beli dengan syarat adanya hak memilih.\""
            },
            {
                "number": 4188,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا أَوْ يَكُونَ بَيْعُهُمَا عَنْ خِيَارٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Setiap dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah atau jual beli mereka dengan syarat adanya hak memilih.\""
            },
            {
                "number": 4189,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَتَفَرَّقَا أَوْ يَأْخُذَ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ الْبَيْعِ مَا هَوِيَ وَيَتَخَايَرَانِ ثَلَاثَ مَرَّاتٍ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam], ia berkata; telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [Al Hasan] dari [Samrah] bahwasanya Nabi shallallahu 'alaihi wasallam bersabda: \"Penjual dan pembeli mempunyai hak memilih hingga mereka berpisah atau setiap mereka mengambil yang ia inginkan dari jual beli tersebut dan saling memilih sebanyak tiga kali.\""
            },
            {
                "number": 4190,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا وَيَأْخُذْ أَحَدُهُمَا مَا رَضِيَ مِنْ صَاحِبِهِ أَوْ هَوِيَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim], ia berkata; telah menceritakan kepada kami [Yazid], ia berkata; telah memberitakan kepada kami [Hammam] dari [Qatadah] dari [Al Hasan] dari [Samurah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah dan sebelum salah seorang dari mereka mengambil apa yang ia ridhai dari sahabatnya atau ia inginkan.\""
            },
            {
                "number": 4191,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا إِلَّا أَنْ يَكُونَ صَفْقَةَ خِيَارٍ وَلَا يَحِلُّ لَهُ أَنْ يُفَارِقَ صَاحِبَهُ خَشْيَةَ أَنْ يَسْتَقِيلَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah memberitakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \" Dua orang yang berjual beli memiliki hak memilih selama mereka belum berpisah kecuali jika ada kesepakatan hak memilih, dan tidak halal baginya untuk meninggalkan sahabatnya karena takut jika ia membatalkan jual beli tersebut.\""
            },
            {
                "number": 4192,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَجُلًا ذَكَرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ يُخْدَعُ فِي الْبَيْعِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بِعْتَ فَقُلْ لَا خِلَابَةَ فَكَانَ الرَّجُلُ إِذَا بَاعَ يَقُولُ لَا خِلَابَةَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa seorang laki-laki menyebutkan kepada Nabi shallallahu 'alaihi wasallam bahwa ia tertipu dalam berjual beli. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apabila engkau menjual maka katakanlah; tidak boleh ada penipuan.\" Kemudian orang tersebut apabila hendak menjual maka ia mengatakan; tidak boleh ada penipuan. "
            },
            {
                "number": 4193,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ رَجُلًا كَانَ فِي عُقْدَتِهِ ضَعْفٌ كَانَ يُبَايِعُ وَأَنَّ أَهْلَهُ أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا نَبِيَّ اللَّهِ احْجُرْ عَلَيْهِ فَدَعَاهُ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَاهُ فَقَالَ يَا نَبِيَّ اللَّهِ إِنِّي لَا أَصْبِرُ عَنْ الْبَيْعِ قَالَ إِذَا بِعْتَ فَقُلْ لَا خِلَابَةَ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Hammad], ia berkata; telah menceritakan kepada kami [Abdul A'la] dari [Sa'id] dari [Qatadah] dari [Anas] bahwa ada seseorang yang memiliki kelemahan pada lisannya, keluarganya mendatangi Nabi shallallahu 'alaihi wasallam dan berkata; wahai Nabi Allah, laranglah ia berjualan, lalu Nabi shallallahu 'alaihi wasallam memanggilnya dan melarangnya, ia berkata; wahai Rasulullah, sesungguhnya saya tidak sabar untuk berjual beli. Beliau bersabda: \"Jika engkau berjualan maka katakanlah tidak boleh ada tipuan.\""
            },
            {
                "number": 4194,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو كَثِيرٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَاعَ أَحَدُكُمْ الشَّاةَ أَوْ اللَّقْحَةَ فَلَا يُحَفِّلْهَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdur Razzaq] telah menceritakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir], ia berkata; telah menceritakan kepadaku [Abu Katsir] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian menjual kambing atau unta perah maka janganlah engkau menahan air susunya.\""
            },
            {
                "number": 4195,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَلَقَّوْا الرُّكْبَانَ لِلْبَيْعِ وَلَا تُصَرُّوا الْإِبِلَ وَالْغَنَمَ مَنْ ابْتَاعَ مِنْ ذَلِكَ شَيْئًا فَهُوَ بِخَيْرِ النَّظَرَيْنِ فَإِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ أَنْ يَرُدَّهَا رَدَّهَا وَمَعَهَا صَاعُ تَمْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah kalian menyambut orang-orang yang membawa barang dagangan ke kota untuk berjual beli, dan jangan kalian menahan air susu unta dan kambing dalam kantongnya. Barang siapa yang membeli sesuatu dari hal tersebut maka ia berhak memilih yang terbaik dari dua pendapatnya, apabila ia mau maka ia bisa menahannya dan apabila ia mau ingin mengembalikannya maka ia mengembalikannya disertai dengan satu sha' kurma.\" "
            },
            {
                "number": 4196,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ قَالَ حَدَّثَنِي دَاوُدُ بْنُ قَيْسٍ عَنْ ابْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى مُصَرَّاةً فَإِنْ رَضِيَهَا إِذَا حَلَبَهَا فَلْيُمْسِكْهَا وَإِنْ كَرِهَهَا فَلْيَرُدَّهَا وَمَعَهَا صَاعٌ مِنْ تَمْرٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Abdullah bin Al Harits], ia berkata; telah menceritakan kepada kami [Daud bin Qais], dari [Ibnu Yasar] dari [Abu Hurairah] dari Rasulullah beliau bersabda: \"Barang siapa yang membeli hewan yang ditahan ais susu yang ada dalam kantongnya kemudian apabila ia ridha terhadapnya ketika memerahnya maka hendaknya ia menahannya dan apabila ia tidak menyukainya maka hendaknya ia mengembalikannya di sertai satu sha' kurma.\" "
            },
            {
                "number": 4197,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ مُحَفَّلَةً أَوْ مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ إِنْ شَاءَ أَنْ يُمْسِكَهَا أَمْسَكَهَا وَإِنْ شَاءَ أَنْ يَرُدَّهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ لَا سَمْرَاءَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Muhammad], ia berkata; saya mendengar [Abu Hurairah] berkata; Abu Al Qasim shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli hewan yang ditahan air susu yang ada dalam kantongnya maka ia memiliki hak memilih selama tiga hari, apabila ia ingin menahannya maka ia menahannya dan apabila ia ingin mengembalikannya maka ia mengembalikannya disertai satu sha' kurma tidak harus yang berwarna sawo matang.\" "
            },
            {
                "number": 4198,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ وَوَكِيعٌ قَالَا حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ مَخْلَدِ بْنِ خُفَافٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْخَرَاجَ بِالضَّمَانِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Isa bin Yunus] dan [Waki'] mereka berkata; telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Makhlad bin Khufaf] dari ['Urwah] dari ['Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam menetapkan bahwa manfaat yang di dapat disertai dengan tanggungan."
            },
            {
                "number": 4199,
                "arab": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ تَمِيمٍ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنِي شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّلَقِّي وَأَنْ يَبِيعَ مُهَاجِرٌ لِلْأَعْرَابِيِّ وَعَنْ التَّصْرِيَةِ وَالنَّجْشِ وَأَنْ يَسْتَامَ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ وَأَنْ تَسْأَلَ الْمَرْأَةُ طَلَاقَ أُخْتِهَا",
                "id": "Telah mengabarkan kepadaku [Abdullah bin Muhammad bin Tamim], ia berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; telah menceritakan kepadaku [Syu'bah] dari ['Adi bin Tsabit] dari [Abu Hazim] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menyambut orang-orang yang membawa dagangan sebelum sampai pasar, dan seorang muhajir menjualkan barang untuk orang badui, dan dari menahan air susu hewan dalam kantongnya, serta seseorang menawar atas penawaran saudaranya dan seorang wanita meminta agar saudaranya dicerai."
            },
            {
                "number": 4200,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الزِّبْرِقَانِ قَالَ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ الْحَسَنِ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ وَإِنْ كَانَ أَبَاهُ أَوْ أَخَاهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepadaku [Muhammad bin Az Zibriqan], ia berkata; telah menceritakan kepada kami [Yunus bin 'Ubaid] dari [Al Hasan] dari [Anas] bahwasanya Nabi shallallahu 'alaihi wasallam melarang orang yang tinggal di kota menjualkan untuk orang yang di pelosok walaupun ia adalah bapak atau saudaranya."
            },
            {
                "number": 4201,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنِي سَالِمُ بْنُ نُوحٍ قَالَ أَنْبَأَنَا يُونُسُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَنُهِينَا أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ وَإِنْ كَانَ أَخَاهُ أَوْ أَبَاهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna], ia berkata; telah menceritakan kepadaku [Salim bin Nuh], ia berkata; telah memberitakan kepada kami [Yunus] dari [Muhammad bin Sirin] dari [Anas bin Malik], ia berkata; kita dilarang orang yang tinggal di kota menjualkan untuk orang yang tinggal di pelosok walaupun ia adalah saudara atau bapaknya."
            },
            {
                "number": 4202,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَنَسٍ قَالَنُهِينَا أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] dari [Anas], ia berkata; kita dilarang orang yang tinggal di kota menjualkan untuk orang yang tinggal di pelosok."
            },
            {
                "number": 4203,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبِيعُ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan], ia berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia telah mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh orang yang tinggal di kota menjualkan untuk orang yang tinggal di desa, biarkan manusia Allah memberi rizki sebagian mereka dengan sebagian yang lain.\""
            },
            {
                "number": 4204,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَلَقَّوْا الرُّكْبَانَ لِلْبَيْعِ وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلَا تَنَاجَشُوا وَلَا يَبِيعُ حَاضِرٌ لِبَادٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah menyambut orang yang membawa barang dagangan sebelum sampai pasar dan janganlah sebagian kalian menjual di atas jual beli sebagian yang lainnya dan janganlah berpura-pura menawar agar mengecoh pembeli yang lain, dan janganlah orang yang tinggal di kota menjualkan untuk orang yang tinggal di pelosok.\""
            },
            {
                "number": 4205,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ بْنِ أَعْيَنَ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ أَبِيهِ عَنْ كَثِيرِ بْنِ فَرْقَدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ النَّجْشِ وَالتَّلَقِّي وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ",
                "id": "Telah mengabarkan kepada kami [Abdurrahman bin Abdullah bin Abdul Hakam bin A'yan], ia berkata; telah menceritakan kepada kami [Syu'aib bin Al Laits] dari [ayahnya] dari [Katsir bin Farqad] dari [Nafi'] dari [Abdullah] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau melarang dari menawar barang tidak untuk membelinya tapi agar harganya naik, menyambut orang yang membawa barang dagangan sebelum sampai ke pasar, serta orang yang tinggal di kota menjualkan untuk orang yang tinggal di pelosok."
            },
            {
                "number": 4206,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّلَقِّي",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menyambut orang yang membawa barang dagang sebelum sampai pasar."
            },
            {
                "number": 4207,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ قُلْتُ لِأَبِي أُسَامَةَ أَحَدَّثَكُمْ عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تَلَقِّي الْجَلْبِ حَتَّى يَدْخُلَ بِهَا السُّوقَ فَأَقَرَّ بِهِ أَبُو أُسَامَةَ وَقَالَ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; saya berkata kepada [Abu Usamah]; apakah ['ubaidhullah] menceritakan kepadamu dari [Nafi'] dari [Ibnu Umar], Ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menyambut orang yang membawa dagangan sebelum masuk pasar hingga ia masuk pasar. Kemudian Abu Usamah mengakui dan mengatakan; ya. "
            },
            {
                "number": 4208,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَلَقَّى الرُّكْبَانُ وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍقُلْتُ لِابْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لَا يَكُونُ لَهُ سِمْسَارٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'], ia berkata; telah memberitakan kepada kami [Abdur Razzaq], ia berkata; telah memberitakan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang menyambut orang yang membawa dagangan sebelum masuk pasar dan orang yang tinggal di kota menjualkan barang untuk orang yang tinggal di pelosok. Saya berkata kepada Ibnu Abbas; apa maksud perkataan orang yang tinggal di kota untuk orang yang tinggal di pelosok? Ia berkata; tidak boleh menjadi calo untuknya. "
            },
            {
                "number": 4209,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَنْبَأَنَا هِشَامُ بْنُ حَسَّانَ الْقُرْدُوسِيُّ أَنَّهُ سَمِعَ ابْنَ سِيرِينَ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَلَقَّوْا الْجَلْبَ فَمَنْ تَلَقَّاهُ فَاشْتَرَى مِنْهُ فَإِذَا أَتَى سَيِّدُهُ السُّوقَ فَهُوَ بِالْخِيَارِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan], ia berkata; telah menceritakan kepada kami [Hajjaj bin Muhammad], ia berkata; telah memberitakan kepada kami [Ibnu Juraij], ia berkata; telah memberitakan kepada kami [Hisyam bin Hassan Al Qurdusi] bahwa ia mendengar [Ibnu Sirin] berkata; saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menyambut orang yang membawa barang dagangan sebelum sampai pasar, barang siapa yang menyambutnya kemudian membeli darinya kemudian apabila pemiliknya datang ke pasar maka ia memiliki hak untuk memilih. "
            },
            {
                "number": 4210,
                "arab": "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبِيعَنَّ حَاضِرٌ لِبَادٍ وَلَا تَنَاجَشُوا وَلَا يُسَاوِمْ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ وَلَا يَخْطُبْ عَلَى خِطْبَةِ أَخِيهِ وَلَا تَسْأَلْ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْتَفِئَ مَا فِي إِنَائِهَا وَلِتُنْكَحَ فَإِنَّمَا لَهَا مَا كَتَبَ اللَّهُ لَهَا",
                "id": "Telah mengabarkan kepada kami [Mujahid bin Musa], ia berkata; telah menceritakan kepada kami [Isma'il] dari [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah orang yang tinggal di kota menjualkan barang untuk orang yang tinggal di pelosok, dan janganlah menawar untuk mengecohkan pembeli yang lain, janganlah seseorang menawar penawaran saudaranya dan janganlah ia meminang atas pinangan saudaranya dan janganlah seorang wanita meminta agar saudaranya dicerai agar ia mendapatkan apa yang ada dalam periuknya dan agar ia dinikahi, karena sesungguhnya ia mendapatkan apa yang telah Allah tetapkan baginya.\" "
            },
            {
                "number": 4211,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ وَاللَّيْثُ وَاللَّفْظُ لَهُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَبِيعُ أَحَدُكُمْ عَلَى بَيْعِ أَخِيهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dan [Al Laits], lafazhnya adalah lafazh Al Laits, dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Janganlah salah seorang diantara kalian menjual atas penjualan saudaranya.\""
            },
            {
                "number": 4212,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ حَتَّى يَبْتَاعَ أَوْ يَذَرَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Abu Mu'awiyah], ia berkata; telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah seseorang menjual atas penjualan saudaranya hingga ia membeli atau meninggalkan.\""
            },
            {
                "number": 4213,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّجْشِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melarang dari menawar barang untuk mengecoh pembeli yang lain."
            },
            {
                "number": 4214,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ قَالَ حَدَّثَنَا أَبِي عَنْ الزُّهْرِيِّ أَخْبَرَنِي أَبُو سَلَمَةَ وَسَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلَا يَبِيعُ حَاضِرٌ لِبَادٍ وَلَا تَنَاجَشُوا وَلَا يَزِيدُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلَا تَسْأَلْ الْمَرْأَةُ طَلَاقَ الْأُخْرَى لِتَكْتَفِئَ مَا فِي إِنَائِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya], ia berkata; telah menceritakan kepada kami [Bisyr bin Syu'aib], ia berkata; telah menceritakan kepada kami [ayahku] dari [Az Zuhri] telah mengabarkan kepadaku [Abu Salamah] dan [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seseorang menjual di atas jualan saudaranya dan janganlah orang yang tinggal di kota menjual barang untuk orang yang tinggal di pelosok, dan janganlah menawar barang untuk mengecoh pembeli, janganlah seseorang menambah atas penjualan saudaranya, dan janganlah seorang wanita meminta wanita yang lain dicerai agar ia mendapatkan apa yang ada dalam periuknya. "
            },
            {
                "number": 4215,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ حَاضِرٌ لِبَادٍ وَلَا تَنَاجَشُوا وَلَا يَزِيدُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلَا تَسْأَلْ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَسْتَكْفِئَ بِهِ مَا فِي صَحْفَتِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Yazid], ia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak boleh orang yang tinggal di kota menjualkan barang untuk orang yang tinggal di pelosok, dan janganlah menawar barang untuk mengecoh pembeli, janganlah seseorang menambah atas penjualan saudaranya, dan janganlah seorang wanita meminta saudarinya dicerai agar ia mendapatkan apa yang ada dalam periuknya. "
            },
            {
                "number": 4216,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا الْمُعْتَمِرُ وَعِيسَى بْنُ يُونُسَ قَالَا حَدَّثَنَا الْأَخْضَرُ بْنُ عَجْلَانَ عَنْ أَبِي بَكْرٍ الْحَنَفِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَاعَ قَدَحًا وَحِلْسًا فِيمَنْ يَزِيدُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Al Mu'tamir] dan [Isa bin Yunus] mereka berkata; telah menceritakan kepada kami [Al Akhdhar bin 'Ajlan] dari [Abu Bakar Al Hanafi] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam menjual gelas dan alas pelana kepada orang yang menambahkan harga. "
            },
            {
                "number": 4217,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ وَأَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Muhammad bin Yahya bin Habban] serta [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah (yaitu barang dagangan apapun yang disentuh wajib untuk dibayar tanpa mengetahui kondisi barang tersebut), serta munabadzah (yaitu jual beli dengan saling melemparkan barang yang akan dijual tanpa diketahui barangnya)."
            },
            {
                "number": 4218,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَقَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُلَامَسَةِ لَمْسِ الثَّوْبِ لَا يَنْظُرُ إِلَيْهِ وَعَنْ الْمُنَابَذَةِ وَهِيَ طَرْحُ الرَّجُلِ ثَوْبَهُ إِلَى الرَّجُلِ بِالْبَيْعِ قَبْلَ أَنْ يُقَلِّبَهُ أَوْ يَنْظُرَ إِلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ya'qub bin Ishaq], ia berkata; telah menceritakan kepada kami [Abdullah bin Yusuf], ia berkata; telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab], ia berkata; telah memberitakan kepadaku ['Amir bin Sa'd bin Abu Waqqash] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah yaitu menyentuh pakaian dan tidak melihatnya. Dan beliau melarang dari munabadzah yaitu seseorang melempar pakaiannya kepada seseorang untuk dijual kepadanya sebelum ia membalik baju tersebut atau melihat kepadanya."
            },
            {
                "number": 4219,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِ فِي الْبَيْعِ",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la] serta [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari ['Amir bin Sa'd] dari [Abu Sa'id Al Khudri], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah, dan munabadzah dalam berjual beli. "
            },
            {
                "number": 4220,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits Al Marwazi], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Atho` bin Yazid] dari [Abu Sa'id Al Kudri], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari dua macam jual beli yaitu mulamasah dan munbadzah."
            },
            {
                "number": 4221,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُصَفَّى بْنِ بَهْلُولٍ عَنْ مُحَمَّدِ بْنِ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُ سَعِيدًا يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُلَامَسَةِ وَالْمُنَابَذَةِ وَالْمُلَامَسَةُ أَنْ يَتَبَايَعَ الرَّجُلَانِ بِالثَّوْبَيْنِ تَحْتَ اللَّيْلِ يَلْمِسُ كُلُّ رَجُلٍ مِنْهُمَا ثَوْبَ صَاحِبِهِ بِيَدِهِ وَالْمُنَابَذَةُ أَنْ يَنْبِذَ الرَّجُلُ إِلَى الرَّجُلِ الثَّوْبَ وَيَنْبِذَ الْآخَرُ إِلَيْهِ الثَّوْبَ فَيَتَبَايَعَا عَلَى ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mushaffa bin Bahlul] dari [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri], ia berkata; saya mendengar [Sa'id] berkata; saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah dan menabadzah. Dan mulamasah adalah dua orang melakukan jual beli dengan dua pakaian dimalam hari setiap orang dari mereka menyentuh pakaian temannya dengan tangannya, sedangkan munabadzah adalah seseorang melemparkan pakaian kepada orang lain dan orang yang lain melemparkan baju kepadanya dan mereka berjual beli atas dasar seperti itu. "
            },
            {
                "number": 4222,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ عَامِرَ بْنَ سَعْدٍ أَخْبَرَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ رَضِيَ اللَّهُ عَنْهُ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُلَامَسَةِ وَالْمُلَامَسَةُ لَمْسُ الثَّوْبِ لَا يَنْظُرُ إِلَيْهِ وَعَنْ الْمُنَابَذَةِ وَالْمُنَابَذَةُ طَرْحُ الرَّجُلِ ثَوْبَهُ إِلَى الرَّجُلِ قَبْلَ أَنْ يُقَلِّبَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Daud], ia berkata; telah menceritakan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [ayahku] dari [Shalih] dari [Ibnu Syihab] bahwa ['Amir bin Sa'd] telah mengabarkan kepadanya bahwa [Abu Sa'id Al Khudri] radliallahu 'anhu berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari mulamasah, dan mulamasah adalah menyentuh baju dan tidak melihat kepadanya, dan dari munabadzah. Munabadzah adalah seseorang melemparkan baju kepada orang lain sebelum ia membaliknya. "
            },
            {
                "number": 4223,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ أَمَّا الْبَيْعَتَانِ فَالْمُلَامَسَةُ وَالْمُنَابَذَةُ وَالْمُنَابَذَةُ أَنْ يَقُولَ إِذَا نَبَذْتُ هَذَا الثَّوْبَ فَقَدْ وَجَبَ يَعْنِي الْبَيْعَ وَالْمُلَامَسَةُ أَنْ يَمَسَّهُ بِيَدِهِ وَلَا يَنْشُرَهُ وَلَا يُقَلِّبَهُ إِذَا مَسَّهُ فَقَدْ وَجَبَ الْبَيْعُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'], ia berkata; telah menceritakan kepada kami [Abdur Razzaq], ia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Atho` bin Yazid] dari [Abu Sa'id Al Khudri], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari dua pakaian dan dari dua macam jual beli. Adapun dua macam jual beli yaitu mulamasah dan munabadzah, yaitu berkata; apabila saya melempar baju ini maka telah terjadi jual beli. Sedangkan mulamasah yaitu memegang dengan tangannya dan tidak membukanya serta membalikkannya, apabila ia memegangnya maka telah terjadi jual beli. "
            },
            {
                "number": 4224,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ قَالَ بَلَغَنِي عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسَتَيْنِ وَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ عَنْ الْمُنَابَذَةِ وَالْمُلَامَسَةِ وَهِيَ بُيُوعٌ كَانُوا يَتَبَايَعُونَ بِهَا فِي الْجَاهِلِيَّةِ",
                "id": "Telah mengabarkan kepada kami [Harun bin Zaid bin Abu Az Zarqa`], ia berkata; telah menceritakan kepada kami [ayahku], ia berkata; telah menceritakan kepada kami [Ja'far bin Burqan], ia berkata; telah sampai kepadaku dari [Az Zuhri] dari [Salim] dari [ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari dua pakaian dan Rasulullah shallallahu 'alaihi wasallam melarang kita dari dua jual beli yaitu munabadzah dan mulamasah itu adalah jual beli yang mereka lakukan pada masa Jahiliyah."
            },
            {
                "number": 4225,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ عَنْ خُبَيْبٍ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ بَيْعَتَيْنِ أَمَّا الْبَيْعَتَانِ فَالْمُنَابَذَةُ وَالْمُلَامَسَةُوَزَعَمَ أَنَّ الْمُلَامَسَةَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ أَبِيعُكَ ثَوْبِي بِثَوْبِكَ وَلَا يَنْظُرُ وَاحِدٌ مِنْهُمَا إِلَى ثَوْبِ الْآخَرِ وَلَكِنْ يَلْمِسُهُ لَمْسًا وَأَمَّا الْمُنَابَذَةُ أَنْ يَقُولُ أَنْبِذُ مَا مَعِي وَتَنْبِذُ مَا مَعَكَ لِيَشْتَرِيَ أَحَدُهُمَا مِنْ الْآخَرِ وَلَا يَدْرِي كُلُّ وَاحِدٍ مِنْهُمَا كَمْ مَعَ الْآخَرِ وَنَحْوًا مِنْ هَذَا الْوَصْفِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Al Mu'tamir], ia berkata; saya mendengar ['ubaidhullah] dari [Khubaib] dari [Hafsh bin 'Ashim] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang dari dua macam jual beli, yaitu munabadzah dan mulamasah. Dan ia mengatakan bahwa mulamasah adalah seseorang berkata kepada orang lain; saya jual kepadamu bajuku dengan bajumu dan setiap mereka tidak melihat kepada baju orang lain akan tetapi ia menyentuhnya sekali. Adapun munabadzah adalah mengatakan saya lemparkan apa yang ada padaku dan engkau melemparkan apa yang ada padamu, agar keduanya saling membeli dari yang lainnya, dan setiap mereka tidak mengetahui berapa yang ada pada orang lain. Dan yang serupa dengan sifat ini."
            },
            {
                "number": 4226,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْحَصَاةِ وَعَنْ بَيْعِ الْغَرَرِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah], ia berkata; telah mengabarkan kepadaku [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual dengan cara hashah (jual beli, dan jual beli gharar (tidak jelas)."
            },
            {
                "number": 4227,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Janganlah menjual buah hingga kelihatan layaknya\", beliau melarang penjual dan pembeli. "
            },
            {
                "number": 4228,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual buah hingga kelihatan kelayakannya. "
            },
            {
                "number": 4229,
                "arab": "أَخْبَرَنِي يُونُسُ بْنُ عَبْدِ الْأَعْلَى وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي سَعِيدٌ وَأَبُو سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ وَلَا تَبْتَاعُوا الثَّمَرَ بِالتَّمْرِقَالَ ابْنُ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ مِثْلِهِ سَوَاءً",
                "id": "Telah mengabarkan kepadaku [Yunus bin Abdul A'la] serta [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab], ia berkata; telah menceritakan kepadaku [Sa'id] dan [Abu Salamah] bahwa [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian jual buah hingga terlihat kelayakannya, dan janganlah kalian beli buah dengan buah.\" [Ibnu Syihab] berkata; telah menceritakan kepadaku [Salim bin Abdullah] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari hal seperti itu. "
            },
            {
                "number": 4230,
                "arab": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا حَنْظَلَةُ قَالَ سَمِعْتُ طَاوُسًا يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُقَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلَاحُهُ",
                "id": "Telah mengabarkan kepada kami [Abdul Hamid bin Muhammad], ia berkata; telah menceritakan kepada kami [Makhlad bin Yazid], ia berkata; telah menceritakan kepada kami [Hanzhalah], ia berkata; saya mendengar [Thawus] berkata; saya mendengar [Ibnu Umar] berkata; Rasulullah shallallahu 'alaihi wasallam berdiri diantara kami dan bersabda: \"Janganlah kalian jual buah hingga nampak kelayakannya.\""
            },
            {
                "number": 4231,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَأَنْ يُبَاعَ الثَّمَرُ حَتَّى يَبْدُوَ صَلَاحُهُ وَأَنْ لَا يُبَاعَ إِلَّا بِالدَّنَانِيرِ وَالدَّرَاهِمِ وَرَخَّصَ فِي الْعَرَايَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij] dari ['Atho`] saya mendengar [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang dari mukhabarah, muzabanah dan muhaqalah serta menjual buah hingga nampak kelayakannya, dan agar tidak dijual kecuali dengan dinar dan dirham. dan beliau memberikan keringanan dalam hal 'araya (membeli pohon kurma dengan kurma). "
            },
            {
                "number": 4232,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْمُفَضَّلُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ وَأَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَبَيْعِ الثَّمَرِ حَتَّى يُطْعَمَ إِلَّا الْعَرَايَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Mufadhdhal] dari [Ibnu Juraij] dari ['Atho`] dan [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam melarang dari mukhabarah, muzabanah dan muhaqalah, serta menjual buah hingga dapat dimakan kecuali 'araya. "
            },
            {
                "number": 4233,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ النَّخْلِ حَتَّى يُطْعَمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Hisyam] dari [Abu Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kurma hingga dapat dimakan."
            },
            {
                "number": 4234,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تُزْهِيَ قِيلَ يَا رَسُولَ اللَّهِ وَمَا تُزْهِيَ قَالَ حَتَّى تَحْمَرَّ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَأَيْتَ إِنْ مَنَعَ اللَّهُ الثَّمَرَةَ فَبِمَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Humaid Atha Thawil] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual buah hingga layak, Rasulullah ditanya; wahai Rasulullah, apakah yang dimaksud dengan layak itu? Beliau bersabda: \"Hingga memerah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana pendapatmu apabila Allah menolak tumbuhnya buah maka dengan apakah salah seorang dari kalian mengambil harta saudaranya?\""
            },
            {
                "number": 4235,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلَا يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan], ia berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; telah berkata; [Ibnu Juraij]; telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau menjual buah kepada saudaramu kemudian buah tersebut tertimpa bencana maka tidak halal bagimu untuk mengambil sebagian darinya, dengan apakah engkau mengambil harta saudaramu dengan tanpa hak?\""
            },
            {
                "number": 4236,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ قَالَ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ أَنَّهُ سَمِعَ ابْنَ جُرَيْجٍ يُحَدِّثُ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَاعَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلَا يَأْخُذْ مِنْ أَخِيهِ وَذَكَرَ شَيْئًا عَلَى مَا يَأْكُلُ أَحَدُكُمْ مَالَ أَخِيهِ الْمُسْلِمِ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin 'Ammar], ia berkata; telah menceritakan kepada kami [Yahya bin Hamzah], ia berkata; telah menceritakan kepada kami [Tsaur bin Yazid] bahwa ia mendengar [Ibnu Juraij] bercerita dari [Abu Az Zubair Al Makki] dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: barang siapa yang menjual buah kemudian terkena bencana maka janganlah ia mengambil dari saudaranya sesuatupun, atas dasar apakah salah seorang dari kalian memakan harta saudaranya?\""
            },
            {
                "number": 4237,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حُمَيْدٍ وَهُوَ الْأَعْرَجُ عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَضَعَ الْجَوَائِحَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Humaid yaitu Al A'raj] dari [Sulaiman bin 'Atiq] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam meletakkan sebagian tanggungan karena adanya musibah yang menimpa."
            },
            {
                "number": 4238,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَأُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَصَدَّقُوا عَلَيْهِ فَتَصَدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Bukair] dari ['Iyadh bin Abdullah] dari [Abu Sa'id Al Khudri], ia berkata; seorang laki-laki tertimpa musibah pada zaman Nabi shallallahu 'alaihi wasallam pada buah-buahan yang ia beli, sehingga hutangnya menjadi banyak. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersedekahlah kepadanya.\" Maka orang-orang bersedekah kepadanya namun belum bisa melunasi hutang. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah apa yang kalian dapatkan dan kalian tidak memiliki selain itu.\" "
            },
            {
                "number": 4239,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ سُلَيْمَانَ بْنِ عَتِيكٍ قَالَ قُتَيْبَةُ عَتِيكٌ بِالْكَافِ وَالصَّوَابُ عَتِيقٌ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ سِنِينَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Humaid Al A'raj] dari [Sulaiman bin 'Atik], ia mengatakan; Qutaibah bin 'Atik dengan huruf kaf, yang benar adalah 'Atiq. Dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, beliau melarang dari menjual buah beberapa tahun yang akan datang. "
            },
            {
                "number": 4240,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِو قَالَ ابْنُ عُمَرَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الْعَرَايَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual buah dengan kurma. [Ibnu Umar] berkata; telah menceritakan kepadaku [Zaid bin Tsabit] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam hal 'araya."
            },
            {
                "number": 4241,
                "arab": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ أَنْ يُبَاعَ مَا فِي رُءُوسِ النَّخْلِ بِتَمْرٍ بِكَيْلٍ مُسَمًّى إِنْ زَادَ لِي وَإِنْ نَقَصَ فَعَلَيَّ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Ibnu 'Ulaiyah], ia berkata; telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari muzabanah, dan muzabanah adalah menjual apa yang ada di atas pohon kurma dengan kurma dengan takaran tertentu, ia mengatakan; apabila lebih maka untukku dan apabila kurang maka menjadi tanggunganku."
            },
            {
                "number": 4242,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ الثَّمَرِ بِالتَّمْرِ كَيْلًا وَبَيْعُ الْكَرْمِ بِالزَّبِيبِ كَيْلًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari muzabanah, dan muzabanah adalah menjual kurma dengan kurma dengan takaran, serta menjual anggur dengan kismis dengan takaran. "
            },
            {
                "number": 4243,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ طَارِقٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Thariq] dari [Sa'id bin Al Musayyab] dari [Rafi' bin Khadij], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari muhaqalah dan muzabanah."
            },
            {
                "number": 4244,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الْعَرَايَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [ayahnya], ia berkata; telah menceritakan kepadaku [Zaid bin Tsabit] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam hal 'araya."
            },
            {
                "number": 4245,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الْعَرَايَا بِالتَّمْرِ وَالرُّطَبِ",
                "id": "Telah berkata [Al Harits bin Miskin] dengan membacakan riwayat, dan saya mendengar, dari [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab], ia berkata; telah menceritakan kepadaku [Kharijah bin Zaid bin Tsabit] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam hal membeli pohon kurma dengan buah kurma atau ruthab. "
            },
            {
                "number": 4246,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ عَنْ زَيْدِ بْنِ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا تُبَاعُ بِخِرْصِهَا",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah], ia berkata; telah mengabarkan kepadaku [Nafi'] dari [Abdullah] dari [Zaid bin Tsabit] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam menjual 'araya dijual dengan taksirannya. "
            },
            {
                "number": 4247,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرِيَّةِ بِخِرْصِهَا تَمْرًا",
                "id": "Telah mengabarkan kepada kami [Isa bin Hammad], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Yahya bin Sa'id] dari [Nafi'] dari [Ibnu Umar], ia berkata; telah menceritakan kepadaku [Zaid bin Tsabit] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan dalam menjual 'araya dengan kurma secara taksiran. "
            },
            {
                "number": 4248,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ سَالِمًا أَخْبَرَهُ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ إِنَّ زَيْدَ بْنَ ثَابِتٍ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا بِالرُّطَبِ وَبِالتَّمْرِ وَلَمْ يُرَخِّصْ فِي غَيْرِ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Abu Daud], ia berkata; telah menceritakan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [ayahku] dari [Shalih] dari [Ibnu Syihab] bahwa [Salim] telah mengabarkan kepadanya bahwa ia mendengar [Abdullah bin Umar] berkata; sesungguhnya [Zaid bin Tsabit] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam memberikan keringanan untuk menjual pohon kurma dengan ruthab dan kurma dan tidak memberikan keringanan dalam perkara selain itu. "
            },
            {
                "number": 4249,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لَهُ عَنْ عَبْدِ الرَّحْمَنِ عَنْ مَالِكٍ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ أَبِي سُفْيَانَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي الْعَرَايَا أَنْ تُبَاعَ بِخِرْصِهَا فِي خَمْسَةِ أَوْسُقٍ أَوْ مَا دُونَ خَمْسَةِ أَوْسُقٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dan [Ya'qub bin Ibrahim], lafazhnya adalah lafazh Ya'qub, dari [Abdurrahman] dari [Malik] dari [Daud bin Al Hushain] dari [Abu Sufyan] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam memberikan keringanan dalam 'araya agar dijual dengan penaksirannya, lima wasaq atau kurang dari lima wasaq. "
            },
            {
                "number": 4250,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ وَرَخَّصَ فِي الْعَرَايَا أَنْ تُبَاعَ بِخِرْصِهَا يَأْكُلُهَا أَهْلُهَا رُطَبًا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin Abdurrahman], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Yahya] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual buah hingga nampak kelayakannya, dan memberikan keringanan dalalm hal 'araya di beli dengan perkiraannya, dan dimakan pemiliknya dalam bentuk ruthab. "
            },
            {
                "number": 4251,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ كَثِيرٍ قَالَ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ أَنَّ رَافِعَ بْنَ خَدِيجٍ وَسَهْلَ بْنَ أَبِي حَثْمَةَ حَدَّثَاهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ بَيْعُ الثَّمَرِ بِالتَّمْرِ إِلَّا لِأَصْحَابِ الْعَرَايَا فَإِنَّهُ أَذِنَ لَهُمْ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Isa], ia berkata; telah menceritakan kepada kami [Abu Usamah], ia berkata; telah menceritakan kepadaku [Al Walid bin Katsir], ia berkata; telah mengabarkan kepadaku [Busyair bin Yasar] bahwa [Rafi' bin Khadij] serta [Sahl bin Abu Hatsmah] telah menceritakan kepdanya bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari muzabanah yaitu menjual buah dengan kurma, kecuali bagi pemilik 'araya, sesungguhnya beliau mengizinkannya. "
            },
            {
                "number": 4252,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ قَالُوارَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Busyair bin Yasar] dari [para sahabat] Rasulullah shallallahu 'alaihi wasallam bahwa mereka berkta; Rasulullah shallallahu 'alaihi wasallam memberikan keringanan untuk menjual 'araya dengan penaksirannya. "
            },
            {
                "number": 4253,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مَالِكٌ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ عَنْ زَيْدِ بْنِ أَبِي عَيَّاشٍ عَنْ سَعْدٍ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّمْرِ بِالرُّطَبِ فَقَالَ لِمَنْ حَوْلَهُ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ قَالُوا نَعَمْ فَنَهَى عَنْهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Malik], ia berkata; telah menceritakan kepadaku [Abdullah bin Yazid] dari [Zaid bin Abu 'Ayyasy] dari [Sa'd], ia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya mengenai menjual kurma dengan ruthab kemudian beliau bertanya kepada orang di sekitarnya: \"Apakah ruthab akan berkurang apabila mongering?\" mereka berkata; ya. Kemudian beliau melarangnya. "
            },
            {
                "number": 4254,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ الْفِرْيَابِيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ زَيْدٍ عَنْ سَعْدِ بْنِ مَالِكٍ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرُّطَبِ بِالتَّمْرِ فَقَالَ أَيَنْقُصُ إِذَا يَبِسَ قَالُوا نَعَمْ فَنَهَى عَنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ali bin Maimun], ia berkata; telah menceritakan kepada kami [Muhammad bin Yusuf Al Firyabi], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Umayyah] dari [Abdullah bin Yazid] dari [Zaid] dari [Sa'd bin Malik], ia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya mengenai jual beli ruthab dengan kurma. Lalu beliau bertanya: \"Apakah ruthab akan berkurang apabila mengering?\" mereka berkata; ya. Kemudian beliau melarang. "
            },
            {
                "number": 4255,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الصُّبْرَةِ مِنْ التَّمْرِ لَا يُعْلَمُ مَكِيلُهَا بِالْكَيْلِ الْمُسَمَّى مِنْ التَّمْرِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan], ia berkata; telah menceritakan kepada kami [Hajjaj], telah berkata [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] berkata bahwa ia mendengar [Jabir bin Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kumpulan kurma yang tidak diketahui takarannya dengan kurma dengan takaran tertentu. "
            },
            {
                "number": 4256,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُبَاعُ الصُّبْرَةُ مِنْ الطَّعَامِ بِالصُّبْرَةِ مِنْ الطَّعَامِ وَلَا الصُّبْرَةُ مِنْ الطَّعَامِ بِالْكَيْلِ الْمُسَمَّى مِنْ الطَّعَامِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan], ia berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak boleh menjual sekumpulan makanan dengan sekumpulan makanan dan sekumpulan makanan dengan makanan dengan takaran tertentu.\""
            },
            {
                "number": 4257,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُزَابَنَةِ أَنْ يَبِيعَ ثَمَرَ حَائِطِهِ وَإِنْ كَانَ نَخْلًا بِتَمْرٍ كَيْلًا وَإِنْ كَانَ كَرْمًا أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلًا وَإِنْ كَانَ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ نَهَى عَنْ ذَلِكَ كُلِّهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari muzabanah dengan menjual buah kebunnya apabila berupa pohon kurma dengan kurma dalam bentuk takaran, apabila pohon anggur menjualnya dengan kismis dalam bentuk takaran, dan apabila tanaman menjualnya dengan makanan dalam bentuk takaran. Beliau melarang dari semua itu. "
            },
            {
                "number": 4258,
                "arab": "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَعَنْ بَيْعِ الثَّمَرِ قَبْلَ أَنْ يُطْعَمَ وَعَنْ بَيْعِ ذَلِكَ إِلَّا بِالدَّنَانِيرِ وَالدَّرَاهِمِ",
                "id": "Telah mengabarkan kepada kami [Abdul Hamid bin Muhammad], ia berkata; telah menceritakan kepada kami [Makhlad bin Yazid], ia berkata; telah menceritakan kepada kami [Ibnu Juraij] dari ['Atho`] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari mukhabarah, muzabanah, muhaqalah dan dari menjual buah sebelum bisa dimakan dan dari menjual hal tersebut kecuali dengan dinar dan dirham. "
            },
            {
                "number": 4259,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ النَّخْلَةِ حَتَّى تَزْهُوَ وَعَنْ السُّنْبُلِ حَتَّى يَبْيَضَّ وَيَأْمَنَ الْعَاهَةَ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kurma yang masih di pohon hingga memerah dan dari bulir hingga mengeras bijinya, dan aman dari bencana. Beliau melarang penjual dan pembeli. "
            },
            {
                "number": 4260,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أَبِي صَالِحٍأَنَّ رَجُلًا مَنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّا لَا نَجِدُ الصَّيْحَانِيَّ وَلَا الْعِذْقَ بِجَمْعِ التَّمْرِ حَتَّى نَزِيدَهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعْهُ بِالْوَرِقِ ثُمَّ اشْتَرِ بِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Al A'masy] dari [Habib bin Abu Tsabit] dari [Abu Shalih] bahwa [seseorang dari sahabat] Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya bahwa ia mengatakan; wahai Rasulullah, kami tidak mendapatkan Shaihani (jenis kurma yang baik) atau Al 'Idzq dengan kurma Jam' kecuali kami menambahkan mereka, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Juallah kurma dengan uang perak lalu belilah dengannya.\""
            },
            {
                "number": 4261,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَعَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعْمَلَ رَجُلًا عَلَى خَيْبَرَ فَجَاءَ بِتَمْرٍ جَنِيبٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا قَالَ لَا وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِصَاعَيْنِ وَالصَّاعَيْنِ بِالثَّلَاثِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَفْعَلْ بِعْ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat, dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Abdul Majid bin Suhail] dari [Sa'id bin Al Musayyab] dari [Abu Sa'id Al Khudri] dan dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam menggunakan tenaga orang untuk menggarap lahan Khaibar, kemudian orang tersebut datang membawa kurma Janih. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah seluruh kurma Khaibar seperti ini?\" orang tersebut berkata; tidak, demi Allah wahai Rasulullah, sesungguhnya kami mengambil satu sha' dengan dua sha', mengambil dua sha' dengan tiga sha'. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan kalian lakukan, juallah kurma jam' dengan uang dirham kemudian belilah dengan dirham tersebut kurma Janih.\" "
            },
            {
                "number": 4262,
                "arab": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ وَإِسْمَعِيلُ بْنُ مَسْعُودٍ وَاللَّفْظُ لَهُ عَنْ خَالِدٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِتَمْرٍ رَيَّانَ وَكَانَ تَمْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْلًا فِيهِ يُبْسٌ فَقَالَ أَنَّى لَكُمْ هَذَا قَالُوا ابْتَعْنَاهُ صَاعًا بِصَاعَيْنِ مِنْ تَمْرِنَا فَقَالَ لَا تَفْعَلْ فَإِنَّ هَذَا لَا يَصِحُّ وَلَكِنْ بِعْ تَمْرَكَ وَاشْتَرِ مِنْ هَذَا حَاجَتَكَ",
                "id": "Telah mengabarkan kepada kami [Nashr bin Ali] dan [Isma'il bin Mas'ud] dan lafazhnya adalah lafazh Isma'il, dari [Khalid], ia berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Sa'id bin Al Musayyab] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam diberi kurman Rayyan sedangkan kurma Rasulullah shallallahu 'alaihi wasallam adalah kurma Ba'l yang basah, kemudian beliau bersabda: \"Dari manakah kalian mendapatkan hal ini?\" mereka berkata; kami membelinya satu sha' dengan dua sha' dari kurma kami. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan engkau lakukan, sesungguhnya hal tidaklah sah, akan tetapi juallah kurmamu dan belilah dari penjualan ini apa yang engkau kehendaki.\""
            },
            {
                "number": 4263,
                "arab": "حَدَّثَنِي إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا أَبُو سَعِيدٍ الْخُدْرِيُّ قَالَكُنَّا نُرْزَقُ تَمْرَ الْجَمْعِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَبِيعُ الصَّاعَيْنِ بِالصَّاعِ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا صَاعَيْ تَمْرٍ بِصَاعٍ وَلَا صَاعَيْ حِنْطَةٍ بِصَاعٍ وَلَا دِرْهَمًا بِدِرْهَمَيْنِ",
                "id": "Telah mengabarkan kepadaku [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Hisyam] dari [Yahya bin Abu Katsir] dari [Abu Salamah bin Abdurrahman], ia berkata; telah menceritakan kepada kami [Abu Sa'id Al Khudri], ia berkata; dahulu kami mendapatkan rizqi kurma Jam' pada zaman Rasulullah shallallahu 'alaihi wasallam, kemudian kami menjual dua sha' dengan satu sha'. Kemudian hal tersebut sampai kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Jangan engkau jual dua sha' kurma dengan satu sha' dan dua sha' gandum dengan satu sha', serta satu dirham dengan dua dirham.\""
            },
            {
                "number": 4264,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ عَنْ يَحْيَى وَهُوَ ابْنُ حَمْزَةَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى قَالَ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ حَدَّثَنِي أَبُو سَعِيدٍ قَالَكُنَّا نَبِيعُ تَمْرَ الْجَمْعِ صَاعَيْنِ بِصَاعٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَاعَيْ تَمْرٍ بِصَاعٍ وَلَا صَاعَيْ حِنْطَةٍ بِصَاعٍ وَلَا دِرْهَمَيْنِ بِدِرْهَمٍ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin 'Ammar] dari [Yahya yaitu Ibnu Hamzah], ia berkata; telah menceritakan kepada kami [Al Auza'i] dari [Yahya], ia berkata; telah menceritakan kepadaku [Abu Salamah], ia berkata; telah menceritakan kepadaku [Abu Sa'id], ia berkata; dahulu kami menjual kurma Jam' dua Sha' dengan satu sha'. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan engkau jual dua sha' kurma dengan satu sha' dan dua sha' gandum dengan satu sha', serta satu dirham dengan dua dirham.\""
            },
            {
                "number": 4265,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ عَنْ يَحْيَى وَهُوَ ابْنُ حَمْزَةَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي يَحْيَى قَالَ حَدَّثَنِي عُقْبَةُ بْنُ عَبْدِ الْغَافِرِ قَالَ حَدَّثَنِي أَبُو سَعِيدٍ قَالَأَتَى بِلَالٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ بَرْنِيٍّ فَقَالَ مَا هَذَا قَالَ اشْتَرَيْتُهُ صَاعًا بِصَاعَيْنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوِّهْ عَيْنُ الرِّبَا لَا تَقْرَبْهُ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin 'Ammar] dari [Yahya yaitu Ibnu Hamzah], ia berkata; telah menceritakan kepada kami [Al Auza'i], ia berkata; telah menceritakan kepadaku [Yahya], ia berkata; telah menceritakan kepadaku ['Uqbah bin Abdul Ghafir], ia berkata; telah menceritakan kepadaku [Abu Sa'id], ia berkata; telah datang Bilal kepada Rasulullah shallallahu 'alaihi wasallam membawa kurma Barni, kemudian beliau bersabda: \"Apa ini?\" Ia berkata; saya membelinya satu sha' dengan dua sha'. Lalu beliau bersabda: \"Aduh, bentuk riba, janganlah engkau dekati.\""
            },
            {
                "number": 4266,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالْوَرِقِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلَّا هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلَّا هَاءَ وَهَاءَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Malik bin Aus bin Al Hadatsan] bahwa Ia mendengar [Umar bin Al Khathab] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menjual emas dengan perak adalah riba, kecuali serah terima secara langsung, kurma dengan kurma adalah riba kecuali serah terima secara langsung, gandum dengan gandum adalah riba kecuali serah terima secara langsung, jewawut dengan jewawut adalah riba kecuali serah terima secara langsung.\""
            },
            {
                "number": 4267,
                "arab": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّمْرُ بِالتَّمْرِ وَالْحِنْطَةُ بِالْحِنْطَةِ وَالشَّعِيرُ بِالشَّعِيرِ وَالْمِلْحُ بِالْمِلْحِ يَدًا بِيَدٍ فَمَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى إِلَّا مَا اخْتَلَفَتْ أَلْوَانُهُ",
                "id": "Telah mengabarkan kepada kami [Washil bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Ibnu Fudhail] dari [ayahnya] dari [Abu Zur'ah] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kurma dengan kurma, gandum dengan gandum, jewawut dengan jewawut, garam dengan garam dengan serah terima secara langsung, barang siapa menambah atau meminta tambahan maka sungguh ia telah melakukan riba kecuali yang berbeda warnanya.\""
            },
            {
                "number": 4268,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا سَلَمَةُ وَهُوَ ابْنُ عَلْقَمَةَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ مُسْلِمِ بْنِ يَسَارٍ وَعَبْدِ اللَّهِ بْنِ عَتِيكٍ قَالَا جَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَمُعَاوِيَةَ حَدَّثَهُمْ عُبَادَةُ قَالَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْوَرِقِ بِالْوَرِقِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ وَالتَّمْرِ بِالتَّمْرِ قَالَ أَحَدُهُمَا وَالْمِلْحِ بِالْمِلْحِ وَلَمْ يَقُلْهُ الْآخَرُ إِلَّا مِثْلًا بِمِثْلٍ يَدًا بِيَدٍ وَأَمَرَنَا أَنْ نَبِيعَ الذَّهَبَ بِالْوَرِقِ وَالْوَرِقَ بِالذَّهَبِ وَالْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَا قَالَ أَحَدُهُمَا فَمَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Bazi'], ia berkata; telah menceritakan kepada kami [Yazid], ia berkata; telah menceritakan kepada kami [Salamah yaitu Ibnu 'Alqamah] dari [Muhammad bin Sirin] dari [Muslim bin Yasar] dan [Abdullah bin 'Atik] mereka berkata; di dalam rumah terdapat 'Ubadah bin Ash Shamit dan Mu'awiyah, ['Ubadah] menceritakan kepada mereka, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang kita dari menjual emas dengan emas, perak dengan perak, gandum dengan gandum, jewawut dengan jewawut dan kurma dengan kurma. Salah seorang dari mereka berdua berkata; dan garam dengan garam, sedangkan yang lain tidak mengatakan hal tersebut. Kecuali dengan semisal dengan yang semisal, dan dengan serah terima secara langsung. Dan beliau memerintahkan agar kami menjual emas dengan perak, dan perak dengan emas, gandum dengan jewawut dengan serah terima secara langsung bagaimanapun yang kami kehendaki. Barang siapa menambah atau meminta tambahan maka sungguh ia telah melakukan riba."
            },
            {
                "number": 4269,
                "arab": "أَخْبَرَنَا الْمُؤَمَّلُ بْنُ هِشَامٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ عُلَيَّةَ عَنْ سَلَمَةَ بْنِ عَلْقَمَةَ عَنْ ابْنِ سِيرِينَ قَالَ حَدَّثَنِي مُسْلِمُ بْنُ يَسَارٍ وَعَبْدُ اللَّهِ بْنُ عُبَيْدٍ وَقَدْ كَانَ يُدْعَى ابْنَ هُرْمُزَ قَالَ جَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَبَيْنَ مُعَاوِيَةَ حَدَّثَهُمْ عُبَادَةُ قَالَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْفِضَّةِ بِالْفِضَّةِ وَالتَّمْرِ بِالتَّمْرِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ قَالَ أَحَدُهُمَا وَالْمِلْحِ بِالْمِلْحِ وَلَمْ يَقُلْهُ الْآخَرُ إِلَّا سَوَاءً بِسَوَاءٍ مِثْلًا بِمِثْلٍ قَالَ أَحَدُهُمَا مَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى وَلَمْ يَقُلْهُ الْآخَرُ وَأَمَرَنَا أَنْ نَبِيعَ الذَّهَبَ بِالْفِضَّةِ وَالْفِضَّةَ بِالذَّهَبِ وَالْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَا",
                "id": "Telah mengabarkan kepada kami [Al Muammal bin Hisyam], ia berkata; telah menceritakan kepada kami [Isma'il yaitu Ibnu 'Ulayyah] dari [Salamah bin 'Alqamah] dari [Ibnu Sirin], ia berkata; telah menceritakan kepadaku [Muslim bin Yasar] dan [Abdullah bin Atik] dan ia dahulu dipanggil dengan nama Ibnu Hurmuz, ia berkata; sementara di dalam rumah terdapat 'Ubadah bin Ash Shamit dan Mu'awiyah, ['Ubadah] menceritakan kepada mereka, ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang kita dari menjual emas dengan emas, perak dengan perak, kurma dengan kurma, gandum dengan gandum, jewawut dengan jewawut. Salah seorang dari mereka berdua berkata; dan garam dengan garam, sedangkan yang lain tidak mengatakan hal tersebut. Kecuali secara sama-sama, semisal dengan yang semisal. Salah seorang diantara mereka berdua mengatakan; Barang siapa menambah atau meminta tambahan maka sungguh ia telah melakukan riba. Dan yang lainnya tidak mengatakannya. Dan beliau memerintahkan agar kami menjual emas dengan perak, dan perak dengan emas, gandum dengan jewawut dan jewawut dengan gandum, dengan serah terima secara langsung bagaimanapun yang kami kehendaki. "
            },
            {
                "number": 4270,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنِي مُسْلِمُ بْنُ يَسَارٍ وَعَبْدُ اللَّهِ بْنُ عُبَيْدٍ قَالَا جَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَبَيْنَ مُعَاوِيَةَ فَقَالَ عُبَادَةُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَبِيعَ الذَّهَبَ بِالذَّهَبِ وَالْوَرِقَ بِالْوَرِقِ وَالْبُرَّ بِالْبُرِّ وَالشَّعِيرَ بِالشَّعِيرِ وَالتَّمْرَ بِالتَّمْرِ قَالَ أَحَدُهُمَا وَالْمِلْحَ بِالْمِلْحِ وَلَمْ يَقُلْ الْآخَرُ إِلَّا سَوَاءً بِسَوَاءٍ مِثْلًا بِمِثْلٍ قَالَ أَحَدُهُمَا مَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى وَلَمْ يَقُلْ الْآخَرُ وَأَمَرَنَا أَنْ نَبِيعَ الذَّهَبَ بِالْوَرِقِ وَالْوَرِقَ بِالذَّهَبِ وَالْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَافَبَلَغَ هَذَا الْحَدِيثُ مُعَاوِيَةَ فَقَامَ فَقَالَ مَا بَالُ رِجَالٍ يُحَدِّثُونَ أَحَادِيثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ صَحِبْنَاهُ وَلَمْ نَسْمَعْهُ مِنْهُ فَبَلَغَ ذَلِكَ عُبَادَةَ بْنَ الصَّامِتِ فَقَامَ فَأَعَادَ الْحَدِيثَ فَقَالَ لَنُحَدِّثَنَّ بِمَا سَمِعْنَاهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنْ رَغِمَ مُعَاوِيَةُ خَالَفَهُ قَتَادَةُ رَوَاهُ عَنْ مُسْلِمِ بْنِ يَسَارٍ عَنْ أَبِي الْأَشْعَثِ عَنْ عُبَادَةَ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Bisyr bin Al Mufadhdhal], ia berkata; telah menceritakan kepada kami [Salamah bin 'Alqamah] dari [Muhammad], ia berkata; telah menceritakan kepadaku [Muslim bin Yasar] dan [Abdullah bin Atik], mereka mengatakan; sementara di dalam rumah terdapat 'Ubadah bin Ash Shamit dan Mu'awiyah, kemudian ['Ubadah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang kami dari menjual emas dengan emas, perak dengan perak, gandum dengan gandum, jewawut dengan jewawut, dan kurma dengan kurma. Salah seorang dari mereka berdua berkata; dan garam dengan garam, sedangkan yang lain tidak mengatakan hal tersebut. Kecuali secara sama-sama, semisal dengan yang semisal. Salah seorang diantara mereka berdua mengatakan; Barang siapa menambah atau meminta tambahan maka sungguh ia telah melakukan riba. Dan yang lainnya tidak mengatakannya. Dan beliau memerintahkan agar kami menjual emas dengan perak, dan perak dengan emas, gandum dengan jewawut dan jewawut dengan gandum, dengan serah terima secara langsung bagaimanapun yang kami kehendaki. Kemudian hadits ini sampai kepada Mu'awiyah, kemudian ia berdiri dan berkata; bagaimana keadaan orang-orang yang meriwayatkan hadits-hadits dari Rasulullah shallallahu 'alaihi wasallam, dan kami telah menemani beliau dan belum mendengarnya dari beliau. Kemudian hal tersebut sampai kepada Ubadah bin Ash Shamit, lalu ia berdiri dan mengulangi hadits tersebut. Kemudian berkata; sungguh kami akan ceritakan apa yang telah kami dengar dari Rasulullah shallallahu 'alaihi wasallam walaupun Mu'awiyah tidak menyukainya. Qatadah menyelisinya, ia meriwayatkannya dari Muslim bin Yasar dari Abu Al Asy'ats dari Ubadah. "
            },
            {
                "number": 4271,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ عَنْ عَبْدَةَ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ مُسْلِمِ بْنِ يَسَارٍ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ وَكَانَ بَدْرِيًّا وَكَانَ بَايَعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا يَخَافَ فِي اللَّهِ لَوْمَةَ لَائِمٍ أَنَّ عُبَادَةَقَامَ خَطِيبًا فَقَالَ أَيُّهَا النَّاسُ إِنَّكُمْ قَدْ أَحْدَثْتُمْ بُيُوعًا لَا أَدْرِي مَا هِيَ أَلَا إِنَّ الذَّهَبَ بِالذَّهَبِ وَزْنًا بِوَزْنٍ تِبْرُهَا وَعَيْنُهَا وَإِنَّ الْفِضَّةَ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ تِبْرُهَا وَعَيْنُهَا وَلَا بَأْسَ بِبَيْعِ الْفِضَّةِ بِالذَّهَبِ يَدًا بِيَدٍ وَالْفِضَّةُ أَكْثَرُهُمَا وَلَا تَصْلُحُ النَّسِيئَةُ أَلَا إِنَّ الْبُرَّ بِالْبُرِّ وَالشَّعِيرَ بِالشَّعِيرِ مُدْيًا بِمُدْيٍ وَلَا بَأْسَ بِبَيْعِ الشَّعِيرِ بِالْحِنْطَةِ يَدًا بِيَدٍ وَالشَّعِيرُ أَكْثَرُهُمَا وَلَا يَصْلُحُ نَسِيئَةً أَلَا وَإِنَّ التَّمْرَ بِالتَّمْرِ مُدْيًا بِمُدْيٍ حَتَّى ذَكَرَ الْمِلْحَ مُدًّا بِمُدٍّ فَمَنْ زَادَ أَوْ اسْتَزَادَ فَقَدْ أَرْبَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Adam] dari ['Abdah] dari [Ibnu Abu 'Arubah] dari [Qatadah] dari [Muslim bin Yasar] dari [Al Asy'ats Ash Shan'ani] dari ['Ubadah bin Ash Shamit] yang merupakan orang Badr, dan telah membai'at Nabi shallallahu 'alaihi wasallam untuk tidak takut karena Allah kepada celaan orang yang mencela. Bahwa 'Ubadah berdiri melakukan ceramah, ia berkata; wahai manusia, sungguh kalian telah mengadakan jual beli, saya tidak tahu apa itu, ketahuilah sesungguhnya emas dengan emas satu timbangan dengan satu timbangan, baik yang masih murni atau mata uangnya, dan perak dengan perak, satu timbangan dengan satu timbangan, baik yang masih murni atau mata uangnya. Dan tidak mengapa menjual perak dengan emas dengan serah terima secara langsung dan perak lebih banyak, tidak boleh ditunda. Ketahuilah sesungguhnya gandum dengan gandum, dan jewawut-dengan jewawut satu mudyun (jenis takaran penduduk Syam) dengan satu mudyun dan tidak mengapa menjual jewawut dengan gandum dengan serah terima secara langsung, dan jewawut lebih banyak, dan tidak boleh menunda. Ketahuilah sesungguhnya kurma dengan kurma satu mudyun dengan satu mudyun....hingga ia menyebutkan garam satu mud dengan satu mud. Barang siapa yang menambah atau meminta tambahan maka sungguh ia telah melakukan riba. "
            },
            {
                "number": 4272,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَإِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَا حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ قَالَ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي الْخَلِيلِ عَنْ مُسْلِمٍ الْمَكِّيِّ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالذَّهَبِ تِبْرُهُ وَعَيْنُهُ وَزْنًا بِوَزْنٍ وَالْفِضَّةُ بِالْفِضَّةِ تِبْرُهُ وَعَيْنُهُ وَزْنًا بِوَزْنٍ وَالْمِلْحُ بِالْمِلْحِ وَالتَّمْرُ بِالتَّمْرِ وَالْبُرُّ بِالْبُرِّ وَالشَّعِيرُ بِالشَّعِيرِ سَوَاءً بِسَوَاءٍ مِثْلًا بِمِثْلٍ فَمَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى وَاللَّفْظُ لِمُحَمَّدٍ لَمْ يَذْكُرْ ابْنُ يَعْقُوبَ وَالشَّعِيرُ بِالشَّعِيرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Ibrahim bin Ya'qub] mereka berkata; telah menceritakan kepada kami ['Amr bin 'Ashim], ia berkata; telah menceritakan kepada kami [Hammam], ia berkata; telah menceritakan kepada kami [Qatadah] dari [Abu Al Khalil] dari [Muslim Al Makki] dari [Abu Al Asy'ats Ash Shan'ani] dari ['Ubadah bin Ash Shamit], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan emas yang murni dan mata uangnya satu timbangan dengan satu timbangan, perak dengan perak yang murni dan mata uangnya satu timbangan dengan satu timbangan, garam dengan garam, kurma dengan kurma, gandum dengan gandum, dan jewawut dengan jewawut secara sama-sama dan semisal dengan semisal. Barang siapa yang menambah atau minta tambahan maka sungguh ia telah melakukan riba.\" Lafazhnya adalah lafazh Muhammad, Ibnu Ya'qub tidak menyebutkan; dan jewawut dengan jewawut."
            },
            {
                "number": 4273,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ سُلَيْمَانَ بْنِ عَلِيٍّ أَنَّ أَبَا الْمُتَوَكِّلِ مَرَّ بِهِمْ فِي السُّوقِ فَقَامَ إِلَيْهِ قَوْمٌ أَنَا مِنْهُمْ قَالَ قُلْنَا أَتَيْنَاكَ لِنَسْأَلَكَ عَنْ الصَّرْفِ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّقَالَ لَهُ رَجُلٌ مَا بَيْنَكَ وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ لَيْسَ بَيْنِي وَبَيْنَهُ غَيْرُهُ قَالَ فَإِنَّ الذَّهَبَ بِالذَّهَبِ وَالْوَرِقَ بِالْوَرِقِ قَالَ سُلَيْمَانُ أَوْ قَالَ وَالْفِضَّةَ بِالْفِضَّةِ وَالْبُرَّ بِالْبُرِّ وَالشَّعِيرَ بِالشَّعِيرِ وَالتَّمْرَ بِالتَّمْرِ وَالْمِلْحَ بِالْمِلْحِ سَوَاءً بِسَوَاءٍ فَمَنْ زَادَ عَلَى ذَلِكَ أَوْ ازْدَادَ فَقَدْ أَرْبَى وَالْآخِذُ وَالْمُعْطِي فِيهِ سَوَاءٌ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid] dari [Sulaiman bin Ali] bahwa [Abu Al Mutawalli] melewati orang-orang di pasar kemudian beberapa orang datang kepadanya dan saya termasuk diantara mereka. Sulaiman mengatakan; kami mengatakan; kami datang kepadamu untuk bertanya mengenai barter. Ia berkata; saya mendengar [Abu Sa'id Al Khudri].... kemudian seorang laki-laki berkata kepadanya; apakah tidak ada orang antara engkau dan Rasulullah shallallahu 'alaihi wasallam selain Abu Sa'id Al Khudri? Abu Al Mutawalli berkata; tidak ada orang antara saya dengan Rasulullah shallallahu 'alaihi wasallam selain dia. Ia berkata; sesungguhnya emas dengan emas, perak dengan perak, gandum dengan gandum, jewawut dengan jewawut, kurma dengan kurma dan garam dengan garam secara sama-sama, barang siapa menambah hal itu atau minta tambahan maka ia telah melakukan riba, orang yang mengambil dan yang memberi adalah sama. "
            },
            {
                "number": 4274,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ قَالَ إِسْمَعِيلُ حَدَّثَنَا حَكِيمُ بْنُ جَابِرٍ ح وَأَنْبَأَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ إِسْمَعِيلَ قَالَ حَدَّثَنَا حَكِيمُ بْنُ جَابِرٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الذَّهَبُ الْكِفَّةُ بِالْكِفَّةِ وَلَمْ يَذْكُرْ يَعْقُوبُ الْكِفَّةُ بِالْكِفَّةِفَقَالَ مُعَاوِيَةُ إِنَّ هَذَا لَا يَقُولُ شَيْئًا قَالَ عُبَادَةُ إِنِّي وَاللَّهِ مَا أُبَالِي أَنْ لَا أَكُونَ بِأَرْضٍ يَكُونُ بِهَا مُعَاوِيَةُ إِنِّي أَشْهَدُ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Harun bin Abdullah], ia berkata; telah menceritakan kepada kami [Abu Usamah], ia berkata; telah berkata [Isma'il]; telah menceritakan kepada kami [Hakim bin Jabir]. Dari jalur lain; Telah menceritakan dan memberitakan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Yahya] dari [Isma'il], ia berkata; telah menceritakan kepada kami [Hakim bin Jabir] dari ['Ubadah bin Ash Shamit], ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan emas satu timbangan dengan satu timbangan Ya'qub tidak menyebutkan; \"satu timbangan dengan satu timbangan\". Mu'awiyah berkata; sesungguhnya orang ini tidak mengatakan sesuatupun. 'Ubadah berkata; demi Allah sesungguhnya saya tidak peduli untuk tidak berada di negeri yang padanya terdapat Mu'awiyah, sesungguhnya saya bersaksi bahwa saya mendengar Rasulullah shallallahu 'alaihi wasallam mengatakan hal tersebut."
            },
            {
                "number": 4275,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ مُوسَى بْنِ أَبِي تَمِيمٍ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لَا فَضْلَ بَيْنَهُمَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Musa bin Abu Tamim] dari [Sa'id bin Yasar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dinar dengan dinar, dan dirham dengan dirham, tidak boleh ada lebih diantara keduanya.\""
            },
            {
                "number": 4276,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ عَنْ مُجَاهِدٍ قَالَ قَالَ عُمَرُالدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لَا فَضْلَ بَيْنَهُمَا هَذَا عَهْدُ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْنَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Humaid bin Qais Al Makki] dari [Mujahid], ia berkata; [Umar] berkata; dinar dengan dinar, dirham dengan dirham tidak boleh ada kelebihan diantara keduanya. Hal ini adalah janji Nabi kita kepada kita. "
            },
            {
                "number": 4277,
                "arab": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي نُعْمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ مِثْلًا بِمِثْلٍ وَالْفِضَّةُ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ مِثْلًا بِمِثْلٍ فَمَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى",
                "id": "Telah mengabarkan kepada kami [Washil bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Muhammad bin Fudhail] dari [ayahnya] dari [Ibnu Abu Nu'aim] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan emas, satu timbangan dengan satu timbangan dan semisal dengan yang semisalnya, perak dengan perak satu timbangan dengan satu timbangan, semisalnya dengan semisalnya. Barang siapa yang menambah atau meminta tambahan maka ia telah melakukan riba.\""
            },
            {
                "number": 4278,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلَّا مِثْلًا بِمِثْلٍ وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلَا تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلَّا مِثْلًا بِمِثْلٍ وَلَا تَبِيعُوا مِنْهَا شَيْئًا غَائِبًا بِنَاجِزٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menjual emas dengan emas kecuali semisalnya dengan yang semisalnya, dan janganlah kalian melebihkan sedikitpun darinya, baik dengan ditunda atau secara kuntan. "
            },
            {
                "number": 4279,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ وَإِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَا حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ نَافِعٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَصُرَ عَيْنِي وَسَمِعَ أُذُنِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ النَّهْيَ عَنْ الذَّهَبِ بِالذَّهَبِ وَالْوَرِقِ بِالْوَرِقِ إِلَّا سَوَاءً بِسَوَاءٍ مِثْلًا بِمِثْلٍ وَلَا تَبِيعُوا غَائِبًا بِنَاجِزٍ وَلَا تُشِفُّوا أَحَدَهُمَا عَلَى الْآخَرِ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dan [Isma'il bin Mas'ud] mereka berkata; telah menceritakan kepada kami [Yazid yaitu Ibnu Zurai'], ia berkata; telah menceritakan kepada kami [Ibnu 'Aun] dari [Nafi'] dari [Abu Sa'id Al Khudri], ia berkata; mataku telah melihat dan telingaku mendengar dari Rasulullah shallallahu 'alaihi wasallam dan beliau menyebutkan larangan dari menjual emas dengan emas, perak dengan perak kecuali secara sama - sama, dan semisalnya dengan yang semisalnya, dan janganlah kalian menjual yang tidak kuntan dengan yang kuntan, dan janganlah kalian melebihkan salah satu dari keduanya atas yang lainnya."
            },
            {
                "number": 4280,
                "arab": "حَدَّثَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّ مُعَاوِيَةَ بَاعَ سِقَايَةً مِنْ ذَهَبٍ أَوْ وَرِقٍ بِأَكْثَرَ مِنْ وَزْنِهَا فَقَالَ أَبُو الدَّرْدَاءِسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ مِثْلِ هَذَا إِلَّا مِثْلًا بِمِثْلٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Zaid bin Aslam] dari ['Atho` bin Yasar] bahwa Mu'awiyah menjual geriba dari emas atau perak dengan lebih dari timbanganya, kemudian [Abu Ad Darda`] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang hal seperti ini kecuali semisalnya dengan yang semisalnya."
            },
            {
                "number": 4281,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي شُجَاعٍ سَعِيدِ بْنِ يَزِيدَ عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ عَنْ حَنَشٍ الصَّنْعَانِيِّ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَاشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلَادَةً فِيهَا ذَهَبٌ وَخَرَزٌ بِاثْنَيْ عَشَرَ دِينَارًا فَفَصَّلْتُهَا فَوَجَدْتُ فِيهَا أَكْثَرَ مِنْ اثْنَيْ عَشَرَ دِينَارًا فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا تُبَاعُ حَتَّى تُفَصَّلَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Abu Syuja' Sa'id bin Yazid] dari [Khalid bin Abu Imran] dari [Hanasy Ash Shan'ani] dari [Fadhalah bin 'Ubaid], ia berkata; saya membeli kalung yang mengandung emas serta mutiara padanya saat Perang Khaibar, dengan harga dua belas dinar. Kemudian saya memisahkannya dan mendapatinya lebih dari dua belas dinar, kemudian hal tersebut disebutkan kepada Nabi shallallahu 'alaihi wasallam lalu beliau bersabda: \"Tidak boleh dijual hingga emas tersebut dipisahkan.\""
            },
            {
                "number": 4282,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ عَنْ حَنَشٍ الصَّنْعَانِيِّ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَأَصَبْتُ يَوْمَ خَيْبَرَ قِلَادَةً فِيهَا ذَهَبٌ وَخَرَزٌ فَأَرَدْتُ أَنْ أَبِيعَهَا فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ افْصِلْ بَعْضَهَا مِنْ بَعْضٍ ثُمَّ بِعْهَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Manshur], ia berkata; telah menceritakan kepada kami [Muhammad bin Mahbub], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Khalid bin Abu Imran] dari [Hanasy Ash Shan'ani] dari [Fadhalah bin 'Ubaid], ia berkata; pada saat perang Khaibar saya mendapatkan kalung yang mengandung emas dan mutiara, kemudian saya hendak menjualnya, kemudian hal tersebut diutarakan kepada Nabi shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Pisahkan sebagian dari sebagiannya kemudian juallah.\" "
            },
            {
                "number": 4283,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ أَبِي الْمِنْهَالِ قَالَبَاعَ شَرِيكٌ لِي وَرِقًا بِنَسِيئَةٍ فَجَاءَنِي فَأَخْبَرَنِي فَقُلْتُ هَذَا لَا يَصْلُحُ فَقَالَ قَدْ وَاللَّهِ بِعْتُهُ فِي السُّوقِ وَمَا عَابَهُ عَلَيَّ أَحَدٌ فَأَتَيْتُ الْبَرَاءَ بْنَ عَازِبٍ فَسَأَلْتُهُ فَقَالَ قَدِمَ عَلَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَنَحْنُ نَبِيعُ هَذَا الْبَيْعَ فَقَالَ مَا كَانَ يَدًا بِيَدٍ فَلَا بَأْسَ وَمَا كَانَ نَسِيئَةً فَهُوَ رِبًاثُمَّ قَالَ لِي ائْتِ زَيْدَ بْنَ أَرْقَمَ فَأَتَيْتُهُ فَسَأَلْتُهُ فَقَالَ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] dari ['Amr] dari [Abu Al Minhal], ia berkata; Syarik menjualkan perak untukku dengan tidak tunai, kemudian ia datang dan mengabarkan kepadaku, maka saya katakan; ini tidak boleh. Lalu ia berkata; cukup, demi Allah, saya telah menjualnya di pasar dan tidak ada seorang seorangpun yang mencelaku. Kemudian saya datang kepada [Al Barra` bin 'Azib] dan bertanya kepadanya, lalu ia berkata; Nabi shallallahu 'alaihi wasallam datang kepada kami di Madinah dan kami sedang berjual beli seperti ini, kemudian beliau bersabda: \"Selama serah terima secara langsung maka tidak mengapa, dan yang tidak tunai maka itu Adalah riba.\" Kemudian ia berkata kepadaku; datanglah kepada [Zaid bin Arqam]. Kemudian saya datang kepada dan bertanya kepadanya, lalu ia mengatakan seperti itu. "
            },
            {
                "number": 4284,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ وَعَامِرُ بْنُ مُصْعَبٍ أَنَّهُمَا سَمِعَا أَبَا الْمِنْهَالِ يَقُولُ سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ وَزَيْدَ بْنَ أَرْقَمَ فَقَالَاكُنَّا تَاجِرَيْنِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْنَا نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّرْفِ فَقَالَ إِنْ كَانَ يَدًا بِيَدٍ فَلَا بَأْسَ وَإِنْ كَانَ نَسِيئَةً فَلَا يَصْلُحُ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan], ia berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; telah berkata [Ibnu Juraij]; telah mengabarkan kepadaku ['Amr bin Dinar] serta ['Amir bin Mush'ab] bahwa mereka telah mendengar [Abu Al Minhal] berkata; saya mendengar [Al Bara` bin 'Azib] dan [Zaid bin Arqam] berkata; dahulu kami adalah pedagang pada zaman Rasulullah shallallahu 'alaihi wasallam kemudian kami bertanya kepada Nabi Allah shallallahu 'alaihi wasallam mengenai barter, lalu beliau bersabda: \"Apabila serah terima secara langsung maka tidak mengapa dan apabila tidak tunai maka tidak boleh.\""
            },
            {
                "number": 4285,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ حَبِيبٍ قَالَ سَمِعْتُ أَبَا الْمِنْهَالِ قَالَسَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ عَنْ الصَّرْفِ فَقَالَ سَلْ زَيْدَ بْنَ أَرْقَمَ فَإِنَّهُ خَيْرٌ مِنِّي وَأَعْلَمُ فَسَأَلْتُ زَيْدًا فَقَالَ سَلْ الْبَرَاءَ فَإِنَّهُ خَيْرٌ مِنِّي وَأَعْلَمُ فَقَالَا جَمِيعًا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْوَرِقِ بِالذَّهَبِ دَيْنًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah bin Al Hakam] dari [Muhammad] telah menceritakan kepada kami [Syu'bah] dari [Habib], dia berkata; \"Saya mendengar [Abu Al Minhal] berkata; \"Saya bertanya kepada [Al Bara` bin 'Azib] mengenai barter, kemudian dia berkata; \"Tanyakan kepada [Zaid bin Arqam], sesungguhnya dia lebih baik dariku dan lebih mengetahui.\" Lalu saya bertanya kepada Zaid kemudian dia berkata; \"Tanyakan kepada Al Bara` sesungguhnya dia lebih baik dariku dan lebih mengetahui.\" Kemudian mereka berdua berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang menjual perak dengan emas dengan cara dihutang.\" "
            },
            {
                "number": 4286,
                "arab": "وَفِيمَا قُرِئَ عَلَيْنَا أَحْمَدُ بْنُ مَنِيعٍ قَالَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْفِضَّةِ بِالْفِضَّةِ وَالذَّهَبِ بِالذَّهَبِ إِلَّا سَوَاءً بِسَوَاءٍ وَأَمَرَنَا أَنْ نَبْتَاعَ الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْنَا وَالْفِضَّةَ بِالذَّهَبِ كَيْفَ شِئْنَا",
                "id": "Dan di antara yang dibacakan kepada kami oleh [Ahmad bin Mani'], dia berkata; telah menceritakan kepada kami ['Abbad bin Al 'Awwab] telah menceritakan kepada kami [Yahya bin Abu Ishaq] telah menceritakan kepada kami [Abdur Rahman bin Abu Bakrah] dari [ayahnya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang menjual perak dengan perak dan emas dengan emas kecuali bila sama ukuran\/beratnya, dan beliau memerintahkan kami agar menjual emas dengan perak semau kami serta perak dengan emas semau kami.\" "
            },
            {
                "number": 4287,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدِ بْنِ كَثِيرٍ الْحَرَّانِيُّ قَالَ حَدَّثَنَا أَبُو تَوْبَةَ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ قَالَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَبِيعَ الْفِضَّةَ بِالْفِضَّةِ إِلَّا عَيْنًا بِعَيْنٍ سَوَاءً بِسَوَاءٍ وَلَا نَبِيعَ الذَّهَبَ بِالذَّهَبِ إِلَّا عَيْنًا بِعَيْنٍ سَوَاءً بِسَوَاءٍ بِسَوَاءٍ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَبَايَعُوا الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْتُمْ وَالْفِضَّةَ بِالذَّهَبِ كَيْفَ شِئْتُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Muhammad bin Katsir Al Harrani] telah menceritakan kepada kami [Abu Taubah] telah menceritakan kepada kami [Mu'awiyah bin Sallam] dari [Yahya bin Abu Katsir] dari [Abdur Rahman bin Abu Bakrah] dari [ayahnya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang kami untuk menjual perak dengan perak kecuali secara kontan dan keduanya sama beratnya. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Juallah emas dengan perak bagaimanapun kalian mau, dan perak dengan emas bagaimanapun kalian mau.\""
            },
            {
                "number": 4288,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا رِبًا إِلَّا فِي النَّسِيئَةِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Sufyan] dari ['ubaidhullah bin Abu Yazid], dia telah mendengar [Ibnu Abbas] berkata; \"Telah menceritakan kepadaku [Usamah bin Zaid] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada riba kecuali di dalam kredit.\""
            },
            {
                "number": 4289,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ أَبِي صَالِحٍ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُقُلْتُ لِابْنِ عَبَّاسٍ أَرَأَيْتَ هَذَا الَّذِي تَقُولُ أَشَيْئًا وَجَدْتَهُ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ أَوْ شَيْئًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا وَجَدْتُهُ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ وَلَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ أُسَامَةُ بْنُ زَيْدٍ أَخْبَرَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا الرِّبَا فِي النَّسِيئَةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari ['Amru] dari [Abu Shalih], dia mendengar [Abu Sa'id Al Khudri] berkata; saya berkata kepada [Ibnu Abbas]; \"Bagaimana pendapatmu mengenai sesuatu yang engkau katakan ini, apakah itu adalah sesuatu yang engkau dapatkan di dalam Kitab Allah 'azza wajalla atau sesuatu yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam?\" Ibnu Abbas berkata; \"Saya tidak mendapatkannya dalam Kitab Allah 'azza wajalla dan tidak pula mendengarnya dari Rasulullah shallallahu 'alaihi wasallam akan tetapi [Usamah bin Zaid] telah mengabarkan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya riba itu hanya ada dalam pembayaran yang ditangguhkan.\""
            },
            {
                "number": 4290,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى عَنْ أَبِي نُعَيْمٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَكُنْتُ أَبِيعُ الْإِبِلَ بِالْبَقِيعِ فَأَبِيعُ بِالدَّنَانِيرِ وَآخُذُ الدَّرَاهِمَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ حَفْصَةَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أَسْأَلَكَ إِنِّي أَبِيعُ الْإِبِلَ بِالْبَقِيعِ فَأَبِيعُ بِالدَّنَانِيرِ وَآخُذُ الدَّرَاهِمَ قَالَ لَا بَأْسَ أَنْ تَأْخُذَهَا بِسِعْرِ يَوْمِهَا مَا لَمْ تَفْتَرِقَا وَبَيْنَكُمَا شَيْءٌ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Yahya] dari [Abu Nu'aim] telah menceritakan kepada kami [Hammad bin Salamah] dari [Simak bin Harb] dari [Sa'id bin Jubair] dari [Ibnu Umar], dia berkata; \"Saya pernah menjual unta di Baqi' saya menjualnya dengan beberapa dinar, dan kuambil beberapa dirham, kemudian saya datang menemui Nabi shallallahu 'alaihi wasallam di rumah Hafshah, saya berkata; \"Wahai Rasulullah, saya ingin bertanya. Sesungguhnya saya menjual unta di Baqi', saya menjualnya dengan dinar dan mengambil dirham.\" Beliau bersabda: \"Tidak mengapa engkau mengambilnya dengan harga pada hari itu, selama kalian berdua belum berpisah sementara (ketika itu) di antara kalian ada sesuatu.\""
            },
            {
                "number": 4291,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ ابْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَكُنْتُ أَبِيعُ الذَّهَبَ بِالْفِضَّةِ أَوْ الْفِضَّةَ بِالذَّهَبِ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ بِذَلِكَ فَقَالَ إِذَا بَايَعْتَ صَاحِبَكَ فَلَا تُفَارِقْهُ وَبَيْنَكَ وَبَيْنَهُ لَبْسٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak] dari [Ibnu Jubair] dari [Ibnu Umar], dia berkata; \"Saya pernah menjual emas dengan perak atau perak dengan emas kemudian saya datang menemui Rasulullah shallallahu 'alaihi wasallam dan mengabarkan kepada beliau mengenai hal tersebut. Lalu beliau bersabda: \"Apabila engkau menjual kepada sahabatmu maka janganlah engkau meninggalkannya sedang diantara kalian ada ketidak jelasan.\""
            },
            {
                "number": 4292,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ أَنْبَأَنَا مُوسَى بْنُ نَافِعٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍأَنَّهُ كَانَ يَكْرَهُ أَنْ يَأْخُذَ الدَّنَانِيرَ مِنْ الدَّرَاهِمِ وَالدَّرَاهِمَ مِنْ الدَّنَانِيرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Waki'] telah memberitakan kepada kami [Musa bin Nafi'] dari [Sa'id bin Jubair] bahwa dia membenci untuk mengambil dinar sebagai ganti dari dirham dan mengambil dirham sebagai ganti dari dinar."
            },
            {
                "number": 4293,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ أَنْبَأَنَا مُؤَمَّلٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي هَاشِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَأَنَّهُ كَانَ لَا يَرَى بَأْسًا يَعْنِي فِي قَبْضِ الدَّرَاهِمِ مِنْ الدَّنَانِيرِ وَالدَّنَانِيرِ مِنْ الدَّرَاهِمِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah memberitakan kepada kami [Muammal] telah menceritakan kepada kami [Sufyan] dari [Abu Hasyim] dari [Sa'id bin Jubair] dari [Ibnu Umar] bahwa dia berpendapat, tidak mengapa mengenai pengambilan dirham sebagai ganti dari dinar dan mengambil dinar sebagai ganti dari dirham."
            },
            {
                "number": 4294,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الْهُذَيْلِ عَنْ إِبْرَاهِيمَفِي قَبْضِ الدَّنَانِيرِ مِنْ الدَّرَاهِمِ أَنَّهُ كَانَ يَكْرَهُهَا إِذَا كَانَ مِنْ قَرْضٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdur Rahman] telah menceritakan kepada kami [Sufyan] dari [Abu Al Hudzail] dari [Ibrahim] mengenai pengambilan dinar sebagai ganti dari dirham bahwa dia membencinya apabila berasal dari hutang."
            },
            {
                "number": 4295,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُوسَى أَبِي شِهَابٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍأَنَّهُ كَانَ لَا يَرَى بَأْسًا وَإِنْ كَانَ مِنْ قَرْضٍأَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا مُوسَى بْنُ نَافِعٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ بِمِثْلِهِ قَالَ أَبُو عَبْد الرَّحْمَنِ كَذَا وَجَدْتُهُ فِي هَذَا الْمَوْضِعِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdur Rahman] telah menceritakan kepada kami [Sufyan] dari [Musa Abu Syihab] dari [Sa'id bin Jubair] bahwa dia melihat tidak mengapa walaupun berasal dari hutang. Telah mengabarkan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Musa bin Nafi'] dari [Sa'id bin Jubair] dengan hadits yang semisal. Abu Abdurrahman berkata; \"Demikianlah yang saya dapatkan pada permasalahan ini."
            },
            {
                "number": 4296,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ قَالَ حَدَّثَنَا الْمُعَافَى عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ رُوَيْدَكَ أَسْأَلُكَ إِنِّي أَبِيعُ الْإِبِلَ بِالْبَقِيعِ بِالدَّنَانِيرِ وَآخُذُ الدَّرَاهِمَ قَالَ لَا بَأْسَ أَنْ تَأْخُذَ بِسِعْرِ يَوْمِهَا مَا لَمْ تَفْتَرِقَا وَبَيْنَكُمَا شَيْءٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Ammar] telah menceritakan kepada kami [Al Mu'afa] dari [Hammad bin Salamah] dari [Simak bin Harb] dari [Sa'id bin Jubair] dari [Ibnu Umar], dia berkata; \"Saya datang menemui Nabi shallallahu 'alaihi wasallam dan mengatakan; \"Perlahan, saya akan bertanya kepada Tuan. Sesungguhnya saya menjual unta di Baqi' dengan dinar dan mengambil dirham.\" Beliau bersabda: \"Tidak mengapa engkau mengambil harga pada hari itu selama belum berpisah sementara diantara kalian terdapat sesuatu.\" "
            },
            {
                "number": 4297,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مُحَارِبُ بْنُ دِثَارٍ عَنْ جَابِرٍ قَالَلَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ دَعَا بِمِيزَانٍ فَوَزَنَ لِي وَزَادَنِي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] telah menceritakan kepada kami [Khalid] dari [Syu'bah] telah memberitakan kepadaku [Muharib bin Ditsar] dari [Jabir], dia berkata; \"Tatkala Nabi shallallahu 'alaihi wasallam datang ke Madinah, beliau meminta timbangan, kemudian beliau menimbang untukku dan menambahiku.\""
            },
            {
                "number": 4298,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ سُفْيَانَ عَنْ مِسْعَرٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرٍ قَالَقَضَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَزَادَنِي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dan [Muhammad bin Abdullah bin Yazid] dari [Sufyan] dari [Mis'ar] dari [Muharib bin Ditsar] dari [Jabir], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam membayarku dan beliau menambahiku.\""
            },
            {
                "number": 4299,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ سِمَاكٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ قَالَجَلَبْتُ أَنَا وَمَخْرَفَةُ الْعَبْدِيُّ بَزًّا مِنْ هَجَرَ فَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ بِمِنًى وَوَزَّانٌ يَزِنُ بِالْأَجْرِ فَاشْتَرَى مِنَّا سَرَاوِيلَ فَقَالَ لِلْوَزَّانِ زِنْ وَأَرْجِحْ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Abdur Rahman] dari [Sufyan] dari [Simak] dari [Suwaid bin Qais], dia berkata; \"Saya dan Makhrafah Al 'Abdi mendatangkan kain sutera dari Hajar, kemudian Rasulullah shallallahu 'alaihi wasallam mendatangi kami ketika kami berada di Mina, dan terdapat seorang penimbang yang menimbang dengan upah, kemudian beliau membeli beberapa celana panjang dari kami, kemudian beliau berkata kepada penimbang tersebut: \"Timbanglah dan lebihkan.\""
            },
            {
                "number": 4300,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ أَبَا صَفْوَانَ قَالَبِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرَاوِيلَ قَبْلَ الْهِجْرَةِ فَأَرْجَحَ لِي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] dari [Muhammad] telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb], dia berkata; \"Saya mendengar [Abu Shafwan] berkata; \"Saya menjual beberapa celana panjang kepada Rasulullah shallallahu 'alaihi wasallam sebelum berhijrah dan beliau melebihkan berat timbangannya untukku.\" "
            },
            {
                "number": 4301,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ عَنْ الْمُلَائِيِّ عَنْ سُفْيَانَ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ قَالَ أَنْبَأَنَا أَبُو نُعَيْمٍ عَنْ سُفْيَانَ عَنْ حَنْظَلَةَ عَنْ طَاوُسٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمِكْيَالُ عَلَى مِكْيَالِ أَهْلِ الْمَدِينَةِ وَالْوَزْنُ عَلَى وَزْنِ أَهْلِ مَكَّةَوَاللَّفْظُ لِإِسْحَقَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dari [Al Mulai] dari [Sufyan]. Dalam jalur lain disebutkan: telah memberitakan kepada kami [Muhammad bin Isma'il] telah memberitakan kepada kami [Abu Nu'aim] dari [Sufyan] dari [Hanzhalah] dari [Thawus] dari [Ibnu Umar], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Takaran itu menyesuaikan dengan takaran penduduk Madinah, sedang timbangan menyesuaikan dengan timbangan penduduk Makkah, \" lafazh hadits tersebut adalah lafazh Ishaq.\""
            },
            {
                "number": 4302,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Al Qasim] dari [Malik] dari [Nafi'] dari [Ibnu Umar], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli makanan maka janganlah dia menjualnya hingga mengambilnya.\""
            },
            {
                "number": 4303,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَقْبِضَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] telah memberitakan kepada kami [Ibnu Al Qasim] dari [Malik] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli makanan maka janganlah dia menjualnya hingga mengambilnya.\""
            },
            {
                "number": 4304,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا قَاسِمٌ عَنْ سُفْيَانَ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِيعُهُ حَتَّى يَكْتَالَهُأَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَالَّذِي قَبْلَهُ حَتَّى يَقْبِضَهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Harb] telah menceritakan kepada kami [Qasim] dari [Sufyan] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli makanan maka janganlah dia menjualnya hingga menakarnya.\" Telah mengabarkan kepada kami [Ishaq bin Manshur] telah memberitakan kepada kami [Abdur Rahman] dari [Sufyan] dari ['Amru] dari [Thawus] dari [Ibnu Abbas], dia berkata; \"Saya mendengar Nabi shallallahu 'alaihi wasallam (bersabda) dengan hadits seperti itu dan yang sebelumnya hingga dia mengambilnya.\""
            },
            {
                "number": 4305,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ طَاوُسٍ عَنْ طَاوُسٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُأَمَّا الَّذِي نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُبَاعَ حَتَّى يُسْتَوْفَى الطَّعَامُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Sufyan] dari [Ibnu Thawus] dari [Thawus], dia berkata; \"Saya mendengar [Ibnu Abbas] berkata; \"Adapun yang dilarang Rasulullah shallallahu 'alaihi wasallam untuk dijual hingga diambil adalah makanan.\""
            },
            {
                "number": 4306,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِيعُهُ حَتَّى يَقْبِضَهُقَالَ ابْنُ عَبَّاسٍ فَأَحْسَبُ أَنَّ كُلَّ شَيْءٍ بِمَنْزِلَةِ الطَّعَامِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah menceritakan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli makanan maka janganlah dia menjualnya hingga mengambilnya.\" Ibnu Abbas berkata; \"Saya mengira bahwa segala sesuatu sama dengan makanan.\" "
            },
            {
                "number": 4307,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ عَنْ حَجَّاجِ بْنِ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ صَفْوَانَ بْنِ مَوْهَبٍ أَنَّهُ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ صَيْفِيٍّ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبِعْ طَعَامًا حَتَّى تَشْتَرِيَهُ وَتَسْتَوْفِيَهُأَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ وَأَخْبَرَنِي عَطَاءٌ ذَلِكَ عَنْ عَبْدِ اللَّهِ بْنِ عِصْمَةَ الْجُشَمِيِّ عَنْ حَكِيمِ بْنِ حِزَامٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepadaku [Ibrahim bin Al Hasan] dari [Hajjaj bin Muhammad] telah berkata [Ibnu Juraij] telah mengabarkan kepadaku ['Atho`] dari [Shafwan bin Mauhab] bahwa dia telah dikabarkan kepadanya dari [Abdullah bin Muhammad bin Shaifi] dari [Hakim bin Hizam], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah engkau menjual makanan hingga engkau membeli dan mengambilnya.\" Telah mengabarkan kepada kami [Ibrahim bin Al Hasan], ia berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; telah berkata [Ibnu Juraij] dan telah mengabarkan kepadaku ['Atho`] dari [Abdullah bin 'Ishmah Al Jusyami] dari [Hakim bin Hizam] dari Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 4308,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ حِزَامِ بْنِ حَكِيمٍ قَالَ قَالَ حَكِيمُ بْنُ حِزَامٍابْتَعْتُ طَعَامًا مِنْ طَعَامِ الصَّدَقَةِ فَرَبِحْتُ فِيهِ قَبْلَ أَنْ أَقْبِضَهُ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ لَا تَبِعْهُ حَتَّى تَقْبِضَهُ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Manshur], ia berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Abdul 'Aziz bin Rufai'] dari ['Atho` bin Abu Rabah] dari [Hizam bin Hakim], ia berkata; telah berkata [Hakim bin Hizam]; saya membeli makanan dari makanan sedekah kemudian mendapatkan keuntungan padanya sebelum mengambilnya, kemudian saya datang kepada Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepada beliau. Kemudian beliau bersabda: \"Janganlah engkau menjualnya hingga engkau mengambilnya.\""
            },
            {
                "number": 4309,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ الْمُنْذِرِ بْنِ عُبَيْدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَبِيعَ أَحَدٌ طَعَامًا اشْتَرَاهُ بِكَيْلٍ حَتَّى يَسْتَوْفِيَهُ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud] dan [Al Harits bin Miskin] dengan membacakan riwayat, dan saya mendengar, dari [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Al Mundzir bin 'Ubaid] dari [Al Qasim bin Muhammad] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melarang seseorang menjual makanan yang ia beli dengan takaran hingga ia mengambilnya."
            },
            {
                "number": 4310,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَكُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنْ الْمَكَانِ الَّذِي ابْتَعْنَا فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Abdullah bin Umar], ia berkata; kami pada zaman Rasulullah shallallahu 'alaihi wasallam membeli makanan kemudian diutus kepada kami orang yang memerintahkan kami untuk memindahnya dari tempat kami membelinya ke tempat lainnya sebelum menjualnya."
            },
            {
                "number": 4311,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّهُمْ كَانُوا يَبْتَاعُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَعْلَى السُّوقِ جُزَافًا فَنَهَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعُوهُ فِي مَكَانِهِ حَتَّى يَنْقُلُوهُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah], ia berkata; telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] bahwa mereka dahulu membeli pada zaman Rasulullah shallallahu 'alaihi wasallam di atas pasar tanpa diketahui kadarnya, kemudian Rasulullah shallallahu 'alaihi wasallam melarang mereka untuk menjualnya di tempatnya hingga ia memindahnya. "
            },
            {
                "number": 4312,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ حَدَّثَهُمْأَنَّهُمْ كَانُوا يَبْتَاعُونَ الطَّعَامَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الرُّكْبَانِ فَنَهَاهُمْ أَنْ يَبِيعُوا فِي مَكَانِهِمْ الَّذِي ابْتَاعُوا فِيهِ حَتَّى يَنْقُلُوهُ إِلَى سُوقِ الطَّعَامِ",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Abdullah bin Abdullah bin Abdul Hakam], ia berkata; telah menceritakan kepada kami [Syu'aib bin Al Laits] dari [ayahnya] dari [Muhammad bin Abdur Rahman] dari [Nafi'] bahwa [Ibnu Umar] telah menceritakan kepada mereka bahwa mereka membeli makanan pada zaman Rasulullah shallallahu 'alaihi wasallam dari orang-orang membawa dagangan ke pasar kemudian beliau melarang mereka untuk menjual di tempat mereka membelinya hingga memindahnya ke pasar makanan. "
            },
            {
                "number": 4313,
                "arab": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَرَأَيْتُ النَّاسَ يُضْرَبُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَرَوْا الطَّعَامَ جُزَافًا أَنْ يَبِيعُوهُ حَتَّى يُؤْوُوهُ إِلَى رِحَالِهِمْ",
                "id": "Telah mengabarkan kepada kami [Nashr bin Ali], ia berkata; telah menceritakan kepada kami [Yazid] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [ayahnya], ia berkata; saya melihat manusia pada zaman Rasulullah shallallahu 'alaihi wasallam mendapatkan hukuman apabila mereka membeli makanan tidak diketahui kadarnya dan menjualnya kecuali mereka mengambilnya ada memindahkannya ke tempat tinggal mereka. "
            },
            {
                "number": 4314,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْاشْتَرَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ وَرَهَنَهُ دِرْعَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Adam] dari [Hafsh bin Ghiyats] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam membeli makanan dari seorang Yahudi hingga suatu tempo dan beliau menggadaikan baju zirahnya kepadanya. "
            },
            {
                "number": 4315,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّهُ مَشَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخُبْزِ شَعِيرٍ وَإِهَالَةٍ سَنِخَةٍ قَالَ وَلَقَدْ رَهَنَ دِرْعًا لَهُ عِنْدَ يَهُودِيٍّ بِالْمَدِينَةِ وَأَخَذَ مِنْهُ شَعِيرًا لِأَهْلِهِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Hisyam], ia berkata; telah menceritakan kepada kami [Qatadah] dari [Anas bin Malik] bahwa ia berjalan kepada Rasulullah shallallahu 'alaihi wasallam membawa roti dari gandum dan lemak cair yang telah berubah baunya. Ia berkata; sungguh beliau telah menggadaikan baju zirahnya pada seorang Yahudi di Madinah dan darinya ia mengambil gandum untuk keluarganya. "
            },
            {
                "number": 4316,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَحُمَيْدُ بْنُ مَسْعَدَةَ عَنْ يَزِيدَ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ سَلَفٌ وَبَيْعٌ وَلَا شَرْطَانِ فِي بَيْعٍ وَلَا بَيْعُ مَا لَيْسَ عِنْدَكَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] dan [Humaid bin Mas'adah] dari [Yazid], ia berkata; telah menceritakan kepada kami [Ayyub] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal jual beli dengan syarat diberi hutang, serta dua syarat dalam jual beli serta menjual apa yang tidak kamu miliki.\""
            },
            {
                "number": 4317,
                "arab": "أَخْبَرَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ عَبَّادِ بْنِ الْعَوَّامِ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ أَبِي رَجَاءٍ قَالَ عُثْمَانُ هُوَ مُحَمَّدُ بْنُ سَيْفٍ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى رَجُلٍ بَيْعٌ فِيمَا لَا يَمْلِكُ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Abdullah], ia berkata; telah menceritakan kepada kami [Sa'id bin Sulaiman] dari ['Abbad bin Al 'Awwam] dari [Sa'id bin Abu 'Arubah] dari [Abu Raja`], Utsman berkata dia adalah Muhammad bin Saif dari [Mathar] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh seseorang menjual sesuatu yang tidak ia miliki.\" "
            },
            {
                "number": 4318,
                "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ حَدَّثَنَا أَبُو بِشْرٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ يَأْتِينِي الرَّجُلُ فَيَسْأَلُنِي الْبَيْعَ لَيْسَ عِنْدِي أَبِيعُهُ مِنْهُ ثُمَّ أَبْتَاعُهُ لَهُ مِنْ السُّوقِ قَالَ لَا تَبِعْ مَا لَيْسَ عِنْدَكَ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah menceritakan kepada kami [Abu Bisyr] dari [Yusuf bin Mahak] dari [Hakim bin Hizam], ia berkata; saya bertanya kepada Nabi shallallahu 'alaihi wasallam, saya katakan; wahai Rasulullah, datang kepadaku seorang laki-laki dan meminta kepadaku untuk menjual apa yang tidak ada padaku, saya jual kepadanya kemudian saya membeli membeli untuknya dari pasar. Beliau bersabda: \"Janganlah engkau menjual apa yang tidak engkau miliki.\""
            },
            {
                "number": 4319,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْمُجَالِدِ قَالَ سَأَلْتُ ابْنَ أَبِي أَوْفَىعَنْ السَّلَفِ قَالَ كُنَّا نُسْلِفُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ فِي الْبُرِّ وَالشَّعِيرِ وَالتَّمْرِ إِلَى قَوْمٍ لَا أَدْرِي أَعِنْدَهُمْ أَمْ لَاوَابْنُ أَبْزَى قَالَ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Yahya] dari [Syu'bah] dari [Abdullah bin Abu Al Mujalid], ia berkata; saya bertanya kepada [Ibnu Abu Aufa] mengenai jual beli secara salaf. Ia berkata; dahulu kami melakukan salaf pada zaman Rasulullah shallallahu 'alaihi wasallam, Abu Bakr dan Umar dalam gandum dan jewawut serta kurma kepada suatu kaum yang saya tidak mengetahui apakah mereka memiliki atau tidak. Dan [Ibnu Abzaa] mengatakan seperti itu. "
            },
            {
                "number": 4320,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ أَنْبَأَنَا شُعْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي الْمُجَالِدِ وَقَالَ مَرَّةً عَبْدُ اللَّهِ وَقَالَ مَرَّةً مُحَمَّدٌ قَالَتَمَارَى أَبُو بُرْدَةَ وَعَبْدُ اللَّهِ بْنُ شَدَّادٍ فِي السَّلَمِ فَأَرْسَلُونِي إِلَى ابْنِ أَبِي أَوْفَى فَسَأَلْتُهُ فَقَالَ كُنَّا نُسْلِمُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى عَهْدِ أَبِي بَكْرٍ وَعَلَى عَهْدِ عُمَرَ فِي الْبُرِّ وَالشَّعِيرِ وَالزَّبِيبِ وَالتَّمْرِ إِلَى قَوْمٍ مَا نُرَى عِنْدَهُمْوَسَأَلْتُ ابْنَ أَبْزَى فَقَالَ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan], ia berkata; telah menceritakan kepada kami [Abu Daud], ia berkata; telah memberitakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepada kami [Ibnu Abu Al Mujalid] dan ia mengatakan terkadang Abdullah dan terkadang Muhammad, ia berkata; Abu Burdah Abdullah bin Syaddad berselisih menganai jual belia secara salam. Kemudian mereka mengutusku kepada [Ibnu Abu Aufa] kemudian saya bertanya kepadanya. Lalu ia berkata; dahulu kami melakukan jual beli dengan cara dihutang pada zaman Rasulullah shallallahu 'alaihi wasallam, dan zaman Abu Bakr serta Umar pada gandum dan jewawut, kismis serta kurma kepada beberapa orang yang kami lihat memiliki barang tersebut. Dan saya bertanya kepada [Ibnu Abza] kemudian ia berkata seperti itu. "
            },
            {
                "number": 4321,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ عَنْ أَبِي الْمِنْهَالِ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ قَالَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي التَّمْرِ السَّنَتَيْنِ وَالثَّلَاثَ فَنَهَاهُمْ وَقَالَ مَنْ أَسْلَفَ سَلَفًا فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Abdullah bin Katsir] dari [Abu Al Minhal], ia berkata; saya mendengar [Ibnu Abbas] berkata; Rasulullah shallallahu 'alaihi wasallam datang ke Madinah dan mereka melakukan jual beli secara salaf pada kurma selama dalam jangka dua tahun dan tiga tahun. Kemudian beliau melarang mereka dan bersabda: \"Barang siapa yang memberikan hutang maka hendaknya ia menghutangi pada takaran yang diketahui, timbangan yang diketahui hingga jangka yang diketahui.\" "
            }
        ]
    }
}