{
    "status": true,
    "data": {
        "start": 1044,
        "end": 1192,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 1044,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ أَنَّهُ حَدَّثَهُمْ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ إِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ حَتَّى يُحَاذِيَ بِهِمَا فُرُوعَ أُذُنَيْهِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Nashr bin 'Ashim] bahwasanya dia menceritakan kepada mereka, dari [Malik bin Al Huwairits] bahwa dia pernah melihat Rasulullah Shallallahu'alaihi wasallam mengangkat kedua tangannya saat hendak ruku' serta saat mengangkat kepalanya dari ruku', hingga sejajar dengan bagian atas telinganya."
            },
            {
                "number": 1045,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَرْفَعُ يَدَيْهِ إِذَا دَخَلَ فِي الصَّلَاةِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ رَبَّنَا لَكَ الْحَمْدُ وَكَانَ لَا يَرْفَعُ يَدَيْهِ بَيْنَ السَّجْدَتَيْنِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami [Malik bin Anas] dari [Az Zuhri] dari [Salim] dari [Bapaknya] bahwa Rasulullah Shallallahu'alaihi wasallam mengangkat kedua tangannya sejajar dengan kedua bahunya saat memulai sholat, saat mengangkat kepala dari ruku', serta saat mengucapkan, \"Sami'allahu liman hamidah (Allah Maha Mendengar semua yang memuji-Nya).\" Lantas mengucapkan, \"Rabbana lakal hamdu. (Wahai Tuhan kami, hanya untuk-Mu segala pujian).\" Beliau Shallallahu'alaihi wasallam tidak melakukannya pada dua sujud."
            },
            {
                "number": 1046,
                "arab": "قَالَ الْبُخَارِي أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّهُ قَالَأَلَا أُصَلِّي بِكُمْ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى فَلَمْ يَرْفَعْ يَدَيْهِ إِلَّا مَرَّةً وَاحِدَةً",
                "id": "Al Bukhari berkata; Telah mengabarkan kepada kami [Mahmud bin Ghailan Al Marwazi] dia berkata; telah menceritakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Ashijm bin Kulaib] dari ['Abdurrahman bin Al Aswad] dari ['Alqamah] dari ['Abdullah] dia berkata; \"Maukah kalian aku peragakan cara sholat Rasulullah Shallallahu'alaihiwasallam?\" Lalu ia mengerjakan sholat, dan ia tidak mengangkat kedua tangannya kecuali hanya sekali."
            },
            {
                "number": 1047,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا كَبَّرَ لِلرُّكُوعِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَهُمَا كَذَلِكَ أَيْضًا وَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ وَكَانَ لَا يَفْعَلُ ذَلِكَ فِي السُّجُودِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Malik] dari [Ibnu Syihab] dari [Salim] dari [Ibnu 'Umar] bahwa jika Rasulullah Shallallahu'alaihi wasallam memulai sholat maka beliau mengangkat kedua tangannya sampai lurus dengan pundaknya. Beliau Shallallahu'alaihi wasallam juga melakukan hal itu saat takbir untuk ruku' dan saat mengangkat kepala dari ruku', sambil mengucapkan doa - yang artinya -: \"Allah Mendengar semua yang memuji-Nya. Wahai Tuhan kami, untuk-Mu segala pujian.\" Beliau Shallallahu'alaihi wasallam tidak melakukannya saat sujud."
            },
            {
                "number": 1048,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami ['Abdurrazzaq] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam apabila mengangkat kepalanya dari ruku' maka beliau mengucapkan: 'allahumma Rabbana Lakal Hamdu (Ya Allah Tuhan kami, untuk-Mu segala pujian) '.\""
            },
            {
                "number": 1049,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ ابْنِ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَقَطَ مِنْ فَرَسٍ عَلَى شِقِّهِ الْأَيْمَنِ فَدَخَلُوا عَلَيْهِ يَعُودُونَهُ فَحَضَرَتْ الصَّلَاةُ فَلَمَّا قَضَى الصَّلَاةَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ",
                "id": "Telah mengabarkan kepada kami [Hunnad bin As Sari] dari [Ibnu 'Uyainah] dari [Az Zuhri] dari [Anas] bahwa Rasulullah Shallallahu'alaihi wasallam pernah jatuh dari kudanya, sehingga beliau Shallallahu'alaihi wasallam terluka di bagian kanan badannya. Lantas para sahabat segera membesuknya, dan tibalah waktu sholat. Setelah selesai sholat beliau Shallallahu'alaihi wasallam bersabda: \"Tidaklah seorang imam itu dijadikan melainkan untuk diikuti. Jika dia ruku ' maka rukulah kalian ', bila ia mengangkat kepalanya maka hendaklah kalian mengangkat kepala, jika sujud maka sujudlah kalian, dan jika ia mengucapkan, 'Sami'allahu liman hamidah (Allah Mendengar semua yang memuji-Nya) ' maka ucapkanlah, 'Rabbana lakal hamdu (Ya Allah, untuk-Mu segala pujian) '.\""
            },
            {
                "number": 1050,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي نُعَيْمُ بْنُ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ يَحْيَى الزُّرَقِيِّ عَنْ أَبِيهِ عَنْ رِفَاعَةَ بْنِ رَافِعٍ قَالَ كُنَّا يَوْمًا نُصَلِّي وَرَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَفَعَ رَأْسَهُ مِنْ الرَّكْعَةِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ رَجُلٌ وَرَاءَهُ رَبَّنَا وَلَكَ الْحَمْدُ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ الْمُتَكَلِّمُ آنِفًا فَقَالَ الرَّجُلُ أَنَا يَا رَسُولَ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ رَأَيْتُ بِضْعَةً وَثَلَاثِينَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَكْتُبُهَا أَوَّلًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah memberitakan kepada kami [Ibnu Al Qasim] dari [Malik] dia berkata; telah menceritakan kepada kami [Nu'aim bin 'Abdullah] dari ['Ali bin Yahya Az Zurqiy] dari [bapaknya] dari [Rifa'ah bin Rafi'] dia berkata; \"Suatu hari aku sholat di belakang Rasulullah Shallallahu'alaihi wasallam, dan saat mengangkat kepalanya dari ruku' beliau mengucapkan, 'Sami'allahu liman hamidah\". Tiba-tiba seseorang di belakangnya mengucapkan, 'Rabbana wa lakal hamdu hamdan katsiran thayyiban mubarakan fiih (Wahai Rabb kami, untuk-Mu segala pujian-pujian yang banyak serta baik, dan diberkahi) '. Setelah Rasulullah Shallallahu'alaihi wasallam selesai sholat, beliau bertanya, 'Siapa yang berbicara saat sholat? 'Lalu ada seorang laki-laki berkata; 'Aku wahai Rasulullah Shallallahu'alaihiwasallam! ' Kemudian Rasulullah Shallallahu'alaihi wasallam bersabda: 'Demi Dzat yang jiwaku ada di tangan-Nya, sungguh, aku melihat tiga puluh lebih malaikat yang berebut untuk menulisnya pertama kali.\""
            },
            {
                "number": 1051,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ فَإِنَّ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Sumiy] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Apabila imam mengucapkan, 'Sami'allahu liman hamidah ' maka ucapkan, 'Rabbana lakal hamdu'. Barangsiapa ucapannya berbarengan dengan ucapan para malaikat, maka dosa-dosa yang telah lewat akan diampuni.\""
            },
            {
                "number": 1052,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ أَنَّهُ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا مُوسَى قَالَ إِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَنَا وَبَيَّنَ لَنَا سُنَّتَنَا وَعَلَّمَنَا صَلَاتَنَا فَقَالَ إِذَا صَلَّيْتُمْ فَأَقِيمُوا صُفُوفَكُمْ ثُمَّ لِيَؤُمَّكُمْ أَحَدُكُمْ فَإِذَا كَبَّرَ الْإِمَامُ فَكَبِّرُوا وَإِذَا قَرَأَ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ فَقُولُوا آمِينَ يُجِبْكُمْ اللَّهُ وَإِذَا كَبَّرَ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا فَإِنَّ الْإِمَامَ يَرْكَعُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ يَسْمَعْ اللَّهُ لَكُمْ فَإِنَّ اللَّهَ قَالَ عَلَى لِسَانِ نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَإِذَا كَبَّرَ وَسَجَدَ فَكَبِّرُوا وَاسْجُدُوا فَإِنَّ الْإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ فَإِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ أَوَّلِ قَوْلِ أَحَدِكُمْ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ سَلَامٌ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ سَلَامٌ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ سَبْعُ كَلِمَاتٍ وَهِيَ تَحِيَّةُ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Yunus bin Jubair] dari [Hiththan bin 'Abdullah] bahwasanya ia mendengar [Abu Musa] berkata; \"Sesungguhnya Nabi Allah Shallallahu'alaihi wasallam pernah berkhutbah di hadapan kami, beliau menjelaskan sunnah dan mengajarkan kami cara sholat, beliau berkata: 'Jika kalian sholat maka luruskan barisan kalian. Hendaklah salah seorang dari kalian menjadi imam. Bila imam bertakbir maka bertakbirlah kalian dan bila imam mengucapkan, \"Ghairil maghdluubi 'alahim waladl-dlaalliin (Bukan orang-orang yang dimurkai dan bukan orang-orang yang sesat) \" maka hendaklah kalian mengucapkan, \"Aamiin (semoga Allah mengabulkan) niscaya Allah akan mengabulkan kalian\". Jika imam bertakbir dan ruku' maka bertakbirlah dan ruku'lah, sesungguhnya imam ruku' dan mengangkat kepala dari ruku' sebelum kalian'. Lalu Nabi Shallallahu'alaihi wasallam bersabda: 'Hendaklah gerakan imam itu kalian ikuti sesudahnya'. Dan jika ia mengangkat kepala dari ruku dengan mengucapkan, \"Sami'allaahu It man lamidah (Allah mendengar orang yang memuji-Nya) \" maka ucapkanlah, \"Allahumma rabbanaa wa lakal hamdu (Wahai Rabb kami, untuk-Mu segala pujian) \" niscaya Allah mendengar kalian. Sesungguhnya Allah berfirman melalui lisan Nabi-Nya, \"Sami'alladhu liman hamidah \". Bila imam bertakbir dan sujud maka ikutlah bertakbir dan sujud, sesungguhnya imam bertakbir dan sujud sebelum kalian'. Lalu Rasulullau Shallallahu'alaihi wasallam bersabda: -'Hendaklah gerakan imam itu kalian ikuti sesudahnya - dan jika ia duduk maka yang pertama kali diucapkan oleh salah seorang dari kalian adalah -doa yang artinya-: \"Ucapan selamat yang baik dan shalawat bagi Allah, semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan semoga juga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan Muhammad adalah hamba dan utusan-Nya\" -ini adalah tujuh kalimat sebagai tahiyyat sholat'.\""
            },
            {
                "number": 1053,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ بْنِ عَازِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ رُكُوعُهُ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَسُجُودُهُ وَمَا بَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Al Hakam] dari ['Abdurrahman bin Abu Laila] dari [Al Barra bin 'Azib] bahwa rukuk Rasulullah Shallallahu'alaihi wasallam dan bila mengangkat kepala dari rukuk juga sujudnya dan -duduk- antara dua sujudnya hampir sama (lamanya)."
            },
            {
                "number": 1054,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ الْحَرَّانِيُّ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ",
                "id": "Telah mengabarkan kepada kami [Abu Dawud Sulaiman bin Saif Al Harraniy] dia berkata; telah menceritakan kepada kami [Sa'id bin 'Amir] dia berkata; telah menceritakan kepada kami [Hisyam bin Hassan] dari [Qais bin Sa'ad] dari ['Atha] dari [Ibnu 'Abbas] bahwa Rasulullah Shallallahu'alaihi wasallam apabila telah mengucapkan, \"Sami'allahu liman hamidah\" maka beliau Shallallahu'alaihi wasallam mengucapkan - doa yang artinya -: 'Ya Allah, segala pujian bagi-Mu sepenuh langit dan sepenuh bumi, juga sepenuh apa yang Engkau kehendaki dari sesuatu setelah itu) '.\""
            },
            {
                "number": 1055,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ عَنْ وَهْبِ بْنِ مِينَاسٍ الْعَدَنِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ السُّجُودَ بَعْدَ الرَّكْعَةِ يَقُولُ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya bin Abu Bakr] dia berkata; telah menceritakan kepada kami [Ibrahim bin Nafi'] dari [Wahb bin Minas Al 'Adaniy] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] bahwa bila Nabi Shallallahu'alaihi wasallam hendak sujud setelah ruku' maka beliau Shallallahu'alaihi wasallam mengucapkan - doa yang artinya -, \"Ya Allah, segala pujian bagi-Mu sepenuh langit dan sepenuh bumi, juga sepenuh apa yang Engkau kehendaki dari sesuatu setelah itu.\""
            },
            {
                "number": 1056,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ أَبُو أُمَيَّةَ الْحَرَّانِيُّ قَالَ حَدَّثَنَا مَخْلَدٌ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَطِيَّةَ بْنِ قَيْسٍ عَنْ قَزَعَةَ بْنِ يَحْيَى عَنْ أَبِي سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ حِينَ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ أَهْلَ الثَّنَاءِ وَالْمَجْدِ خَيْرُ مَا قَالَ الْعَبْدُ وَكُلُّنَا لَكَ عَبْدٌ لَا مَانِعَ لَمَا أَعْطَيْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Hisyam Abu Umayyah Al Harrani] dia berkata; telah menceritakan kepada kami [Makhlad] dari [Sa'id bin 'Abdul 'Aziz] dari ['Athiyyah bin Qais] dari [Qaza'ah bin Yahya] dari [Abu Sa'id] bahwa Rasulullah Shallallahu'alaihi wasallam setelah mengucapkan, \"Sami'allahu liman hamidah\" maka beliau Shallallahu'alaihi wasallam mengucapkan-doa yang artinya-: ' Ya Allah, segala pujian bagi-Mu sepenuh langit dan sepenuh bumi, juga sepenuh apa yang Engkau kehendaki dari sesuatu setelah itu, Yang berhak menerima pujian dan keluhuran.- Itulah sebaik-baik yang diucapkan oleh seorang hamba- dan kami semua adalah hamba-Mu. Tiada yang bisa menghalangi apa yang Engkau berikan dan tidak memberi manfaat harta kekayaan dari-Mu kepada pemiliknya.'"
            },
            {
                "number": 1057,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي حَمْزَةَ عَنْ رَجُلٍ مِنْ بَنِي عَبْسٍ عَنْ حُذَيْفَةَأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَسَمِعَهُ حِينَ كَبَّرَ قَالَ اللَّهُ أَكْبَرُ ذَا الْجَبَرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ وَكَانَ يَقُولُ فِي رُكُوعِهِ سُبْحَانَ رَبِّيَ الْعَظِيمِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ لِرَبِّيَ الْحَمْدُ لِرَبِّيَ الْحَمْدُ وَفِي سُجُودِهِ سُبْحَانَ رَبِّيَ الْأَعْلَى وَبَيْنَ السَّجْدَتَيْنِ رَبِّي اغْفِرْ لِي رَبِّي اغْفِرْ لِي وَكَانَ قِيَامُهُ وَرُكُوعُهُ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَسُجُودُهُ وَمَا بَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amr bin Murrah] dari [Abu Hamzah] dari [seorang lelaki] dari bani 'Abas, dari [Hudzaifah] bahwa suatu malam ia pernah sholat bersama Rasulullah Shallallahu'alaihi wasallam. la mendengar Rasulullah Shallallahu'alaihi wasallam mengucapkan: \"Allahu Akbar dzal Jabaruuti wal Malaakuti wal Kibriyaai wal 'Adzamti (Allah Maha Besar, Maha Suci Dzat yang mempunyai hak memaksa dan kekuasaan serta yang memiliki kesombongan dan keagungan) \" setelah takbir. Saat ruku' beliau mengucapkan, \"Subbhana Rabbiyal 'Azhiim (Maha Suci Tuhanku yang Maha Agung).\" Jika mengangkat kepala dari ruku' maka beliau mengucapkan: \"Lirabbil Hamdu lirabbil hamdu (Segala pujian bagi Rabbku, segala pujian bagi Rabbku).\" Saat sujud beliau mengucapkan, \"Subbhana Rabbiyal A'laa (Maha Suci Tuhanku yang Maha Tinggi) \", sedangkan saat dua sujud beliau mengucapkan, \"Rabbighfirlii, rabbighfirlii (Wahai Tuhanku ampunilah aku. Wahai Tuhanku, ampunilah aku).\" Berdirinya Rasulullah Shallallahu'alaihi wasallam, ruku'nya, sujudnya, serta saat duduk diantara dua sujud dan saat mengangkat kepala dari ruku', semuanya hampir sama (lamanya)."
            },
            {
                "number": 1058,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي مِجْلَزٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا بَعْدَ الرُّكُوعِ يَدْعُو عَلَى رِعْلٍ وَذَكْوَانَ وَعُصَيَّةَ عَصَتْ اللَّهَ وَرَسُولَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Jarir] dari [Sulaiman At Tamimi] dari [Abu Mijlaz] dari [Anas bin Malik] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam pernah qunut setelah ruku' selama satu bulan, dalam doanya dia melaknat suku Ri'il, Dakwan, serta Ushayyah, karena mereka berbuat maksiat kepada Allah dan Rasul-Nya.\""
            },
            {
                "number": 1059,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَأَنَّ أَنَسَ بْنَ مَالِكٍ سُئِلَ هَلْ قَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الصُّبْحِ قَالَ نَعَمْ فَقِيلَ لَهُ قَبْلَ الرُّكُوعِ أَوْ بَعْدَهُ قَالَ بَعْدَ الرُّكُوعِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Ibnu Sirin] bahwasanya [Anas bin Malik] ditanya, \"Apakah Rasulullah Shallallahu'alaihi wasallam pernah qunut saat sholat Subuh? la menjawab, \"Ya.\" Lalu ia ditanya lagi, \"Setelah atau sebelum ruku'?\" la menjawab; \"Setelah ruku', \""
            },
            {
                "number": 1060,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ يُونُسَ عَنْ ابْنِ سِيرِينَ قَالَحَدَّثَنِي بَعْضُ مَنْ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ فَلَمَّا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فِي الرَّكْعَةِ الثَّانِيَةِ قَامَ هُنَيْهَةً",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Bisyr bin Al Mufadhfhal] dari [Yunus] dari [Ibnu Sirin] dia berkata; \" [Sebagian orang] yang pernah sholat Subuh bersama Rasulullah Shallallahu'alaihi wasallam bercerita kepadaku bahwa setelah Rasulullah Shallallahu'alaihi wasallam mengucapkan, 'Sami'allahu liman hamidah pada rakaat kedua\" beliau Shallallahu'alaihi wasallam berdiri sejenak.' "
            },
            {
                "number": 1061,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَفِظْنَاهُ مِنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَلَمَّا رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ مِنْ الرَّكْعَةِ الثَّانِيَةِ مِنْ صَلَاةِ الصُّبْحِ قَالَ اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ وَسَلَمَةَ بْنَ هِشَامٍ وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ وَالْمُسْتَضْعَفِينَ بِمَكَّةَ اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَاجْعَلْهَا عَلَيْهِمْ سِنِينَ كَسِنِي يُوسُفَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; kami menghafal dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dia berkata; \"Setelah Rasulullah Shallallahu'alaihi wasallam mengangkat kepalanya dari rakaat kedua pada sholat Subuh, beliau mengucapkan-doa yang artinya-: 'Ya Allah, selamatkanlah Al Walid bin Al Walid, Salamah bin Hisyam, Ayyasy bin Abu Rabi'ah, serla orang-orang lemah di Makkah. Ya Allah, tampakkan kehancuran-Mu (siksaan-Mu) kepada Bani Mudlar dan jadikanlah tahun-tahun mereka seperti tahun-tahunnya Yusuf (yang penuh paceklik dan kekeringan -penerj) '.\""
            },
            {
                "number": 1062,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ ابْنِ أَبِي حَمْزَةَ قَالَ حَدَّثَنِي مُحَمَّدٌ قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ كَانَ يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو فِي الصَّلَاةِ حِينَ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ يَقُولُ وَهُوَ قَائِمٌ قَبْلَ أَنْ يَسْجُدَ اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ وَسَلَمَةَ بْنَ هِشَامٍ وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ وَالْمُسْتَضْعَفِينَ مِنْ الْمُؤْمِنِينَ اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَاجْعَلْهَا عَلَيْهِمْ كَسِنِي يُوسُفَ ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ فَيَسْجُدُ وَضَاحِيَةُ مُضَرَ يَوْمَئِذٍ مُخَالِفُونَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Utsman] dia berkata; telah menceritakan kepada kami [Baqiyyah] dari [Ibnu Abu Hamzah] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Sa'id bin Al Musayyab] dan [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah Shallallahu'alaihi wasallam pernah berdoa dalam sholat ketika beliau Shallallahu'alaihi wasallam selesai mengucapkan, \"Sami'allahu liman hamidah rabbana lakal hamdu (Allah Maha Mendengar terhadap semua yang memuji-Nya. Ya Allah, hanya untuk-Mu).\" Kemudian beliau mengucapkan doa - sambil berdiri sebelum sujud -, \"Ya Allah, selamatkanlah Al Walid bin Al Walid, Salamah bin Hisyam, Ayyasy bin Abu Rabi 'ah, serta orang-orang lemah dari kalangan kaum mukmin. Ya Allah, timpakan siksaan-Mu kepada Bani Mudhar dan jadikanlah tahun-tahun mereka seperti tahun-tahun Yusuf (penuh penderitaan, paceklik, kekeringan -penerj).\" Kemudian beliau Shallallahu'alaihi wasallam mengucapkan, \"Allahu Akbar\" lantas sujud. Bani Mudhar saat itu menyelisihi (tidak mentaati) Rasulullah Shallallallahu'alaihi wasallam."
            },
            {
                "number": 1063,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ قَالَ حَدَّثَنَا النَّضْرُ قَالَ أَنْبَأَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَلَأُقَرِّبَنَّ لَكُمْ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَكَانَ أَبُو هُرَيْرَةَ يَقْنُتُ فِي الرَّكْعَةِ الْآخِرَةِ مِنْ صَلَاةِ الظُّهْرِ وَصَلَاةِ الْعِشَاءِ الْآخِرَةِ وَصَلَاةِ الصُّبْحِ بَعْدَ مَا يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَيَدْعُو لِلْمُؤْمِنِينَ وَيَلْعَنُ الْكَفَرَةَ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Salm Al Balkhi] dia berkata; telah menceritakan kepada kami [An Nadhr] dia berkata; telah memberitakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; \"Akan aku mudahkan kalian untuk memahami cara sholatnya Rasulullah Shallallahu'alaihiwasallam.\" Lalu Abu Hurairah melakukan qunut pada rakaat terakhir saat sholat Zuhur, Isya', serta Subuh setelah mengucapkan, \"Sami'allahu liman hamidah.\" Beliau Shallallahu'alaihi wasallam berdoa kebaikan bagi orang-orang mukmin dan melaknat orang-orang kafir.\""
            },
            {
                "number": 1064,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ عَنْ سُفْيَانَ وَشُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ ح و أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ وَسُفْيَانَ قَالَا حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ بْنِ عَازِبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْنُتُ فِي الصُّبْحِ وَالْمَغْرِبِ وَقَالَ عُبَيْدُ اللَّهِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dari ['Abdurrahman] dari [Sufyan] dan [Syu'bah] dari ['Amr bin Murrah] -lewat jalur periwayatan lain-- dan telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dari [Syu'bah] dan [Sufyan] mereka berdua berkata; telah menceritakan kepada kami ['Amr bin Murrah] dari [Ibnu Abu Laila] dari [Al Barra bin 'Azib] bahwa Nabi Shallallahu'alaihi wasallam pernah qunut saat sholat Subuh dan Maghrib. Dan ubaidhullah mengatakannya; dengan lafazh ('Inna Rasulullah Shallallahu'alaihi wasallam)."
            },
            {
                "number": 1065,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ ح وَهِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ شَهْرًا قَالَ شُعْبَةُ لَعَنَ رِجَالًا وَقَالَ هِشَامٌ يَدْعُو عَلَى أَحْيَاءٍ مِنْ أَحْيَاءِ الْعَرَبِ ثُمَّ تَرَكَهُ بَعْدَ الرُّكُوعِ هَذَا قَوْلُ هِشَامٍ وَقَالَ شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ شَهْرًا يَلْعَنُ رِعْلًا وَذَكْوَانَ وَلِحْيَانَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Abu Dawud] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas]. Dari jalur lain, dari [Hisyam] dari [Qatadah] dari [Anas] bahwa Rasulullah Shallallahu'alaihi wasallam pernah qunut selama satu bulan - Syu'bah berkata; 'Beliau melaknat beberapa laki-laki.' Hisyam berkata; 'Mendoakan kejelekan (melaknat) beberapa kabilah (suku) dari kabilah-kabilah Arab, kemudian meninggalkannya setelah ruku'-. Ini adalah perkataan Hisyam. Sedangkan perkataan Syu'bah dari Qatadah Anas, bahwa Rasulullah Shallallahu'alaihi wasallam pernah qunut selama satu bulan: beliau melaknat Bani Ri'il, Dzakwan, dan Lihyan."
            },
            {
                "number": 1066,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ رَفَعَ رَأْسَهُ مِنْ صَلَاةِ الصُّبْحِ مِنْ الرَّكْعَةِ الْآخِرَةِ قَالَ اللَّهُمَّ الْعَنْ فُلَانًا وَفُلَانًا يَدْعُو عَلَى أُنَاسٍ مِنْ الْمُنَافِقِينَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ لَيْسَ لَكَ مِنْ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ }",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdurrazzaq] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Bapaknya] bahwa ia pernah mendengar Rasulullah Shallallahu'alaihi wasallam ketika mengangkat kepalanya dari ruku' terakhir pada sholat Subuh mengucapkan: \"Ya Allah, laknatlah si Fulan dan si Fulan.\" Beliau mendoakan kejelekan kepada kalangan munafik, lalu Allah Azza wa Jalla menurunkan ayat; \"Tidak ada sedikitpun campur tanganmu dalam urusan mereka itu atau Allah menerima taubat mereka atau mengadzab mereka karena sesungguhnya mereka itu orang-orang yang zalim\" (Qs. Aali 'Imraan (3): 128)."
            },
            {
                "number": 1067,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ شَهْرًا يَدْعُو عَلَى حَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ ثُمَّ تَرَكَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Mu'adz bin Hisyam] dia berkata; [Bapakku] telah menceritakan kepadaku dari [Qatadah] dari [Anas] bahwa Rasulullah Shallallahu'alaihi wasallam pernah qunut selama satu bulan; beliau mendoakan kejelekan kepada suatu kabilah dari kabilah-kabilah Arab, kemudian beliau Shallallahu'alaihi wasallam meninggalkan (qunut) nya."
            },
            {
                "number": 1068,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ خَلَفٍ وَهُوَ ابْنُ خَلِيفَةَ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِيهِ قَالَصَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَقْنُتْوَصَلَّيْتُ خَلْفَ أَبِي بَكْرٍ فَلَمْ يَقْنُتْ وَصَلَّيْتُ خَلْفَ عُمَرَ فَلَمْ يَقْنُتْ وَصَلَّيْتُ خَلْفَ عُثْمَانَ فَلَمْ يَقْنُتْ وَصَلَّيْتُ خَلْفَ عَلِيٍّ فَلَمْ يَقْنُتْ ثُمَّ قَالَ يَا بُنَيَّ إِنَّهَا بِدْعَةٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Khalaf bin Khalifah] dari [Abu Malik Al Asyja'i] dari [bapaknya] dia berkata; \"Aku pernah sholat di belakang Rasulullah Shallallahu'alaihi wasallam, dan beliau tidak qunut. Aku juga pernah sholat di belakang Abu Bakar, dan ia tidak qunut. Aku pernah sholat di belakang Umar, dan beliau tidak qunut. Aku pernah sholat di belakang Utsman, dan beliau tidak qunut. Aku juga pernah sholat di belakang Ali, dan beliau juga tidak qunut. Kemudian ia berkata, 'Wahai anakku, itu adalah bid'ah.\""
            },
            {
                "number": 1069,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ سَعِيدِ بْنِ الْحَارِثِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فَآخُذُ قَبْضَةً مِنْ حَصًى فِي كَفِّي أُبَرِّدُهُ ثُمَّ أُحَوِّلُهُ فِي كَفِّي الْآخَرِ فَإِذَا سَجَدْتُ وَضَعْتُهُ لِجَبْهَتِي",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami ['Abbad] dari [Muhammad bin 'Amr] dari [Sa'id bin Al Harits] dari [Jabir bin 'Abdullah] dia berkata; \"Kami pernah sholat Zhuhur bersama Rasulullah Shallallahu'alaihi wasallam, lalu aku mengambil segenggam kerikil di telapak tanganku untuk kudinginkan. Kemudian aku pindahkan ke telapak tanganku yang lain, dan jika aku sujud maka aku letakkan kerikil itu pada dahiku.\""
            },
            {
                "number": 1070,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ غَيْلَانَ بْنِ جَرِيرٍ عَنْ مُطَرِّفٍ قَالَصَلَّيْتُ أَنَا وَعِمْرَانُ بْنُ حُصَيْنٍ خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَكَانَ إِذَا سَجَدَ كَبَّرَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ السُّجُودِ كَبَّرَ وَإِذَا نَهَضَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ فَلَمَّا قَضَى أَخَذَ عِمْرَانُ بِيَدِي فَقَالَ لَقَدْ ذَكَّرَنِي هَذَا قَالَ كَلِمَةً يَعْنِي صَلَاةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabiy] dia berkata; telah menceritakan kepada kami [Hammad] dari [Ghailan bin Jarir] dari [Mutharrif] dia berkata; aku sholat bersama 'Imran bin Hushain di belakang 'Ali bin Abu Thalib dan beliau jika hendak sujud dan jika hendak mengangkat kepalanya dari sujud maka ia bertakbir. Demikian pula jika bangkit dari (duduk) setelah dua rakaat. Setelah selesai sholat [Imran] memegang tanganku dan berkata; 'Ini mengingatkanku -ia mengatakan ucapan yang maksudnya sholat nabi Muhammad Shallallahu'alaihi wasallam- '.\""
            },
            {
                "number": 1071,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُعَاذٌ وَيَحْيَى قَالَا حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ وَيُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِوَكَانَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا يَفْعَلَانِهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Mu'adz] dan [Yahya] mereka berdua berkata; telah menceritakan kepada kami [Zuhair] dia berkata; telah menceritakan kepadaku [Abu Ishaq] dari ['Abdurrahman bin Al Aswad] dari ['Alqamah] dan [Al Aswad] dari ['Abdullah bin Mas'ud] dia berkata; \"Dulu Rasulullah Shallallahu'alaihi wasallam selalu takbir pada setiap turun ataupun bangun. Beliau Shallallahu'alaihi wasallam juga mengucapkan salam kekanan dan ke kiri. Abu Bakar dan Umar Radliyallahu'anhu juga melakukannya.\""
            },
            {
                "number": 1072,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ قَالَ سَمِعْتُ يُوسُفَ وَهُوَ ابْنُ مَاهَكَ يُحَدِّثُ عَنْ حَكِيمٍ قَالَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا أَخِرَّ إِلَّا قَائِمًا",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Abu Basyr] dia berkata; aku mendengar [Yusuf bin Mahak] menceritakan dari [Hakim] dia berkata; \"Aku berbai'at kepada Rasulullah Shallallahu'alaihi wasallam untuk tidak turun menuju sujud kecuali jika betul-betul telah berada dalam posisi berdiri tegak (dalam sholat).\""
            },
            {
                "number": 1073,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَفَعَ يَدَيْهِ فِي صَلَاتِهِ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَإِذَا سَجَدَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ السُّجُودِ حَتَّى يُحَاذِيَ بِهِمَا فُرُوعَ أُذُنَيْهِحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَفَعَ يَدَيْهِ فَذَكَرَ مِثْلَهُ أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ فِي الصَّلَاةِ فَذَكَرَ نَحْوَهُ وَزَادَ فِيهِ وَإِذَا رَكَعَ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ السُّجُودِ فَعَلَ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhamamd bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Ibnu Abu 'Adiy] dari [Syu'bah] dari [Qatadah] dari [Nashr bin 'Ashim] dari [Malik bin Al Huwairits] bahwasanya ia pernah melihat Rasulullah Shallallahu'alaihi wasallam saat sholat mengangkat kedua tangannya sejajar dengan kedua telinganya, juga ketika hendak ruku', saat mengangkat kepalanya dari ruku', saat sujud, dan ketika mengangkat kepalanya dari sujud. Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Abdul A'la] dia berkata; Telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Nashr bin 'Ashim] dari [Malik bin Al Huwairits] bahwa dia melihat Rasulullah Shallallahu'alaihi wasallam mengangkat kedua tangannya (maka ia menyebutkan hal yang senada dengan hadits sebelumnya). Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Mu'adz bin Hisyam] dia berkata; telah menceritakan kepadaku [Bapakku] dari [Qatadah] dari [Nashr bin Ashim] dari [Malik bin Al Huwairits] bahwa Rasulullah Shallallahu'alaihi wasallam tatkala masuk untuk memulai sholat...(ia menyebutkan hal yang senada dengan hadits sebelumnya). Dia menambahkan: Beliau juga melakukan hal itu ketika hendak ruku', saat mengangkat kepala dari ruku' dan ketika hendak mengangkat kepala dari sujud."
            },
            {
                "number": 1074,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْكُوفِيُّ الْمُحَارِبِيُّ قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ إِذَا افْتَتَحَ الصَّلَاةَ وَإِذَا رَكَعَ وَإِذَا رَفَعَ وَكَانَ لَا يَفْعَلُ ذَلِكَ فِي السُّجُودِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ubaid Al Kufi Al Muharibi] dia berkata; telah menceritakan kepada kami [Ibnul Mubarak] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu 'Umar] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam jika berdiri untuk sholat maka beliau mengangkat kedua tangannya. Begitu juga saat ruku' dan saat mengangkat kepala dari ruku', tetapi beliau Shallallahu'alaihi wasallam tidak melakukan hal tersebut saat sujud.\""
            },
            {
                "number": 1075,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى الْقُوْمَسِيُّ الْبَسْطَامِيُّ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ وَضَعَ رُكْبَتَيْهِ قَبْلَ يَدَيْهِ وَإِذَا نَهَضَ رَفَعَ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin 'Isa Al Qaumasi Al Basthami] dia berkata; telah menceritakan kepada kami [Yazid bin Harun] dia berkata; telah memberitakan kepada kami [Syarik] dari ['Ashim bin Kulaib] dari [bapaknya] dari [Wa'il bin Hujr] dia berkata; \"Aku melihat Rasulullah Shallallahu'alaihi wasallam meletakan lututnya terlebih dahulu sebelum kedua tangannya apabila hendak sujud, dan mengangkat kedua tangannya dahulu sebelum kedua lututnya apabila bangkit dari sujud.\" "
            },
            {
                "number": 1076,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ حَسَنٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْمِدُ أَحَدُكُمْ فِي صَلَاتِهِ فَيَبْرُكَ كَمَا يَبْرُكُ الْجَمَلُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami ['Abdullah bin Nafi'] dari [Muhammad bin 'Abdullah bin Hasan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam bersabda: 'Hendaklah Salah seorang dari kalian dalam sholatnya turun (untuk sujud) seperti turunnya unta, yaitu meletakkan kedua lututnya lebih dahulu sebelum kedua tangannya.\""
            },
            {
                "number": 1077,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ مِنْ كِتَابِهِ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ أَحَدُكُمْ فَلْيَضَعْ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ وَلَا يَبْرُكْ بُرُوكَ الْبَعِيرِ",
                "id": "Telah mengabarkan kepada kami [Harun bin Muhammad bin Bakkar bin Bilal] dari kitabnya dia berkata; telah menceritakan kepada kami [Marwan bin Muhammad] dia berkata; telah menceritakan kepada kami ['Abdul 'Aziz bin Muhammad] dia berkata; telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Al Hasan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam bersabda: 'Jika salah seorang dari kalian hendak sujud, maka hendaklah ia meletakkan kedua tangannya sebelum kedua lututnya dan janganlah ia turun (untuk sujud) seperti menderumnya unta.\""
            },
            {
                "number": 1078,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ دَلُّوَيْهِ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَرَفَعَهُ قَالَ إِنَّ الْيَدَيْنِ تَسْجُدَانِ كَمَا يَسْجُدُ الْوَجْهُ فَإِذَا وَضَعَ أَحَدُكُمْ وَجْهَهُ فَلْيَضَعْ يَدَيْهِ وَإِذَا رَفَعَهُ فَلْيَرْفَعْهُمَا",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub Dalluwaih] dia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah] dia berkata; telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu 'Umar] -ia menisbatkan hadits ini kepada Nabi Shallallahu'alaihi wasallam- ia berkata; \"Kedua tangan wajib bersujud sebagaimana wajah juga ikut sujud. Jika salah seorang dari kalian telah meletakkan wajahnya, maka hendaklah ia meletakkan kedua tangannya, dan jika mengangkatnya maka hendaklah ia mengangkat keduanya.\""
            },
            {
                "number": 1079,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَأُمِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةِ أَعْضَاءٍ وَلَا يَكُفَّ شَعْرَهُ وَلَا ثِيَابَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari ['Amr] dari [Thawus] dari [Ibnu 'Abbas] dia berkata: \"Nabi Shallallahu'alaihi wasallam diperintahkan sujud di atas tujuh anggota tubuh tanpa mengikat rambut atau melipat bajunya (untuk menghindari debu).\" "
            },
            {
                "number": 1080,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرٌ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَجَدَ الْعَبْدُ سَجَدَ مِنْهُ سَبْعَةُ آرَابٍ وَجْهُهُ وَكَفَّاهُ وَرُكْبَتَاهُ وَقَدَمَاهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Bakr] dari [Ibnul Had] dari [Muhammad bin Ibrahim] dari ['Amir bin Sa'd] dari [Al 'Abbas bin 'Abdul Muththalib] bahwasanya dia mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika ada seorang hamba yang sujud, maka ia sujud dengan tujuh anggola lubuhnya; wajahnya, kedua telapak tangannya, kedua lulutnya, dan kedua telapak kakinya.\""
            },
            {
                "number": 1081,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَصُرَتْ عَيْنَايَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى جَبِينِهِ وَأَنْفِهِ أَثَرُ الْمَاءِ وَالطِّينِ مِنْ صُبْحِ لَيْلَةِ إِحْدَى وَعِشْرِينَمُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] telah dibacakan kepadanya yang saya mendengarnya, dan lafazhnya miliknya dari [Ibnul Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari [Yazid bin 'Abdullah bin Al Had] dari [Muhammad bin Ibrahim bin Al Harits] dari [Abu Salamah] dari [Abu Sa'id Al Khudri] dia berkata, \"Mataku melihat dahi dan hidung Rasulullah Shallallahu'alaihi wasallam ada bekas air dan lumpur pada pagi hari, tanggal dua puluh satu.\" (Diringkas)."
            },
            {
                "number": 1082,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ وَهْبٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةٍ لَا أَكُفَّ الشَّعْرَ وَلَا الثِّيَابَ الْجَبْهَةِ وَالْأَنْفِ وَالْيَدَيْنِ وَالرُّكْبَتَيْنِ وَالْقَدَمَيْنِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amr bin As-Sarh] dan [Yunus bin 'Abdul A'la] dan [Al Harits bin Miskin] telah dibacakan kepadanya yang saya mendengarnya, dan lafazhnya miliknya dari [Ibnu Wahb] dari [Ibnu Juraij] dari ['Abdullah bin Thawus] dari [bapaknya] dari [Ibnu 'Abbas] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Aku diperintahkan sujud di atas tujuh anggota badan, tanpa mengikat rambut atau melipat baju, yaitu wajah, kedua telapak tangan, kedua lutut, dan kedua telapak kaki.\""
            },
            {
                "number": 1083,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ النَّسَائِيُّ قَالَ حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةِ أَعْظُمٍ عَلَى الْجَبْهَةِ وَأَشَارَ بِيَدِهِ عَلَى الْأَنْفِ وَالْيَدَيْنِ وَالرُّكْبَتَيْنِ وَأَطْرَافِ الْقَدَمَيْنِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Manshur An Nasaa'i] dia berkata; telah menceritakan kepada kami [Al Mu'alla bin Asad] dia berkata; telah menceritakan kepada kami [Wuhaib] dari ['Abdullah bin Thawus] dari [bapaknya] dari [Ibnu 'Abbas] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda: \"Aku diperintahkan sujud di atas tujuh anggota badan, yaitu dahi -ia menunjukkan dengan tangannya ke arah hidung-, kedua tangan, kedua lutut, dan ujung jari-jari kedua telapak kaki.\""
            },
            {
                "number": 1084,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الْمَكِّيُّ وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأُمِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعٍ وَنُهِيَ أَنْ يَكْفِتَ الشَّعْرَ وَالثِّيَابَ عَلَى يَدَيْهِ وَرُكْبَتَيْهِ وَأَطْرَافِ أَصَابِعِهِقَالَ سُفْيَانُ قَالَ لَنَا ابْنُ طَاوُسٍ وَوَضَعَ يَدَيْهِ عَلَى جَبْهَتِهِ وَأَمَرَّهَا عَلَى أَنْفِهِ قَالَ هَذَا وَاحِدٌ وَاللَّفْظُ لِمُحَمَّدٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur Al Makki] dan ['Abdullah Muhammad bin 'Abdurrahman Az Zuhri] mereka berdua berkata; telah menceritakan kepada kami [Sufyan] dari [Ibnu Thawus] dari [bapaknya] dari [Ibnu 'Abbas] bahwa Nabi Shallallahu'alaihi wasallam diperintahkan sujud di atas tujuh anggota badan -dan dilarang mengikat rambut dan melipat baju- yaitu kedua tangan, kedua lutut, dan ujung jari-jemari (kaki). Sufyan berkata; \"Ibnu Thawus berkata kepada kami; 'la meletakkan kedua tangannya di atas dahi dan hidungnya, lalu berkata, \"Ini adalah satu bagian.\" Lafazh ini dari Muhammad."
            },
            {
                "number": 1085,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ أَنْبَأَنَا ابْنُ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَجَدَ الْعَبْدُ سَجَدَ مَعَهُ سَبْعَةُ آرَابٍ وَجْهُهُ وَكَفَّاهُ وَرُكْبَتَاهُ وَقَدَمَاهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Hakim] dari [Syu'aib] dari [Al Laits] dia berkata; telah memberitakan kepada kami [Ibnu Al Had] dari [Muhammad bin Ibrahim bin Al Harits] dari ['Amir bin Sa'ad bin Abu Waqqash] dari ['Abbas bin 'Abdul Muththalib] bahwa ia pernah mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jika seorang hamba sujud, maka ia sujud dengan tujuh anggota badanya, yaitu wajah, kedua telapak tangan, kedua lutut, dan kedua telapak kaki.\""
            },
            {
                "number": 1086,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ عَائِشَةَ قَالَتْفَقَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَانْتَهَيْتُ إِلَيْهِ وَهُوَ سَاجِدٌ وَقَدَمَاهُ مَنْصُوبَتَانِ وَهُوَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَبِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Ubdah] dia berkata; telah menceritakan kepada kami ['ubaidhullah bin 'Umar] dari [Muhammad bin Yahya bin Habban] dari [Al A'raj] dari [Abu Hurairah] dari ['Aisyah] dia berkata; \"Suatu malam aku kehilangan Rasulullah Shallallahu'alaihi wasallam, dan aku menyentuh beliau yang sedang sujud, sedangkan kedua telapak kakinya tegak, dan beliau mengucapkan doa - yang artinya -: 'Ya Allah, aku berlindung dengan keridhaan-Mu dari kemurkaan-Mu, (berlindung juga) dengan kemurahan-Mu dari siksa-Mu. Aku (berlindung) dengan-Mu dan dari adzab-Mu. Aku tidak bisa menghitung pujian kepada-Mu, Engkau sebagaimana yang telah Engkau memuji terhadap diri-Mu sendiri'.\""
            },
            {
                "number": 1087,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَطَاءٍ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَهْوَى إِلَى الْأَرْضِ سَاجِدًا جَافَى عَضُدَيْهِ عَنْ إِبِطَيْهِ وَفَتَخَ أَصَابِعَ رِجْلَيْهِمُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami ['Abdul Humaid bin Ja'far] dia berkata; telah menceritakan kepada kami [Muhammad bin 'Atha] dari [Abu Humaid As Sa'idi] dia berkata; \"Rasulullah Shallallahu'alaihi wasallam apabila hendak turun untuk sujud maka beliau shallallahu 'alaihi wasallam merenggangkan lengan dari kedua ketiaknya dan menancapkan (menegakkan) jari-jemari kedua kakinya.\" (diringkas)."
            },
            {
                "number": 1088,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ نَاصِحٍ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ سَمِعْتُ عَاصِمَ بْنَ كُلَيْبٍ يَذْكُرُ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَقَدِمْتُ الْمَدِينَةَ فَقُلْتُ لَأَنْظُرَنَّ إِلَى صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَبَّرَ وَرَفَعَ يَدَيْهِ حَتَّى رَأَيْتُ إِبْهَامَيْهِ قَرِيبًا مِنْ أُذُنَيْهِ فَلَمَّا أَرَادَ أَنْ يَرْكَعَ كَبَّرَ وَرَفَعَ يَدَيْهِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ كَبَّرَ وَسَجَدَ فَكَانَتْ يَدَاهُ مِنْ أُذُنَيْهِ عَلَى الْمَوْضِعِ الَّذِي اسْتَقْبَلَ بِهِمَا الصَّلَاةَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Nashih] dia berkata; telah menceritakan kepada kami [Ibnu Idris] dia berkata; aku mendengar ['Ashim bin Kulaib] menyebutkan dari [bapaknya] dari [Wa'il bin Hujr] dia berkata; \"Aku datang ke Madinah, lalu aku berkata; 'Aku benar-benar pernah melihat sholatnya Rasulullah Shallallahu'alaihi wasallam, beliau Shallallahu'alaihi wasallam bertakbir dengan mengangkat kedua tangan hingga' aku melihat kedua jempolnya berdekatan dengan kedua telinganya, dan ketika hendak ruku' beliau bertakbir dan mengangkat kedua tangannya, kemudian mengangkat kepalanya sambil mengucapkan, \"Sami'allahu liman Hamidah.\" Kemudian ia bertakbir dan sujud. Kedua tanganya sejajar dengan kedua telinganya, seperti posisi saat menghadap kiblat'.\""
            },
            {
                "number": 1089,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ قَالَ حَدَّثَنَا أَبُو الْعَلَاءِ وَاسْمُهُ أَيُّوبُ بْنُ أَبِي مِسْكِينٍ عَنْ قَتَادَةَ عَنْ أَنَسٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَفْتَرِشْ أَحَدُكُمْ ذِرَاعَيْهِ فِي السُّجُودِ افْتِرَاشَ الْكَلْبِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yazid bin Harun] dia berkata; telah menceritakan kepada kami [Abul 'Alaa Ayyub bin Abu Miskin] dari [Qatadah] dari [Anas] dari Rasulullah Shallallahu'alaihi wasallam, beliau bersabda: \"Janganlah salah seorang dari kalian menghamparkan kedua lengannya (di tanah) dalam sujud seperti anjing yang menghamparkan (kedua sikunya).\""
            },
            {
                "number": 1090,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ الْمَرْوَزِيُّ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ قَالَوَصَفَ لَنَا الْبَرَاءُ السُّجُودَ فَوَضَعَ يَدَيْهِ بِالْأَرْضِ وَرَفَعَ عَجِيزَتَهُ وَقَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ",
                "id": "Telah mengkhabarkan kepada kami ['Ali bin Hujr Al Marwazi] dia berkata; telah memberitakan kepada kami [Syarik] dari [Abu Ishaq] dia berkata; Al Barra' menjelaskan sujud kepada kami, maka ia meletakkan kedua tangannya dan mengangkat perutnya dari menempel tanah. [Al Barra] berkata; Beginilah yang dilakukan oleh Rasulullah Shalallahu 'Alaihi Wa sallam. "
            },
            {
                "number": 1091,
                "arab": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ الْمَرْوَزِيُّ قَالَ أَنْبَأَنَا ابْنُ شُمَيْلٍ هُوَ النَّضْرُ قَالَ أَنْبَأَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى جَخَّى",
                "id": "Telah mengabarkan kepada kami ['Ubdah bin 'Abdurrahim Al Marwazi] dia berkata; telah memberitakan kepada kami [Ibnu Syumail An Nadhr] dia berkata; telah memberitakan kepada kami [Yunus bin Abu Ishaq] dari [Abu Ishaq] dari [Al Barra'] bahwa Rasulullah Shallallahu'alaihi wasallam bila sholat maka beliau merenggangkan kedua sikunya dari kedua lambungnya, dan menjauhkan perutnya dari tanah."
            },
            {
                "number": 1092,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرٌ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ الْأَعْرَجِ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَلَّى فَرَّجَ بَيْنَ يَدَيْهِ حَتَّى يَبْدُوَ بَيَاضُ إِبْطَيْهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Bakr] dari [Ja'far bin Abu Rabi'ah] dari [Al A'raj] dari ['Abdullah bin Malik bin Buhainah] bahwa Rasulullah Shallallahu'alaihi wasallam apabila melaksanakan sholat maka beliau merenggangkan kedua sikunya hingga kelihatan ketiaknya yang putih."
            },
            {
                "number": 1093,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ عِمْرَانَ عَنْ أَبِي مِجْلَزٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَ قَالَلَوْ كُنْتُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَبْصَرْتُ إِبْطَيْهِقَالَ أَبُو مِجْلَزٍ كَأَنَّهُ قَالَ ذَلِكَ لِأَنَّهُ فِي صَلَاةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Bazi'] dia berkata; telah menceritakan kepada kami [Mu'tamir bin Sulaiman] dari ['Imran] dari [Abu Mijlaz] dari [Basyir bin Nahik] dari [Abu Hurairah] dia berkata; \"Seandainya aku berada di hadapan Rasulullah Shallallahu'alaihi wasallam (saat sujud), maka aku pasti bisa melihat ketiak Rasulullah Shallallahu'alaihi wasallam.\" Abu Mijlaz (perawi) berkata; \"Sepertinya ia mengatakan demikian karena ia dalam keadaan (di waktu) sholat.\""
            },
            {
                "number": 1094,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَقْرَمَ عَنْ أَبِيهِ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكُنْتُ أَرَى عُفْرَةَ إِبْطَيْهِ إِذَا سَجَدَ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Dawud bin Qais] dari ['Ubaidillah bin 'Abdullah bin Aqram] dari [Bapaknya], dia berkata; \"Aku sholat bersama Rasulullah Shallallahu'alaihi wasallam dan aku melihat putihnya ketiak beliau Shallallahu'alaihi wasallam apabila sujud.\""
            },
            {
                "number": 1095,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ الْأَصَمِّ عَنْ عَمِّهِ يَزِيدَ وَهُوَ ابْنُ الْأَصَمِّ عَنْ مَيْمُونَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَجَدَ جَافَى يَدَيْهِ حَتَّى لَوْ أَنَّ بَهْمَةً أَرَادَتْ أَنْ تَمُرَّ تَحْتَ يَدَيْهِ مَرَّتْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Ubaidillah bin 'Abdullah bin Al Asham] dari pamannya [Yazid bin Al Asham] dari [Maimunah] bahwa Nabi Shallallahu'alaihi wasallam bila sujud maka beliau merenggangkan kedua sikunya dari lambung, hingga apabila ada anak kambing (yang baru lahir) yang hendak lewat di bawah kedua tangannya maka ia bisa melewatinya."
            },
            {
                "number": 1096,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ ح و أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًاعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اعْتَدِلُوا فِي السُّجُودِ وَلَا يَبْسُطْ أَحَدُكُمْ ذِرَاعَيْهِ انْبِسَاطَ الْكَلْبِاللَّفْظُ لِإِسْحَقَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdah] dia berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] -dan lewat jalur periwayatan lain-- dan telah mengabarkan kepada kami [Isma'il bin Mas'ud] dari [Khalid] dari [Syu'bah] dari [Qatadah] dia berkata; Aku mendengar [Anas] dari Rasulullah Shallallahu'alaihi wasallam beliau bersabda: \"Luruslah saat sujud. Janganlah salah seorang dari kalian membentangkan kedua lengannya seperti anjing.\" Lafazh ini dari Ishaq."
            },
            {
                "number": 1097,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ الْمَرْوَزِيُّ قَالَ أَنْبَأَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُجْزِئُ صَلَاةٌ لَا يُقِيمُ الرَّجُلُ فِيهَا صُلْبَهُ فِي الرُّكُوعِ وَالسُّجُودِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Khasyram Al Marwazi] dia berkata; telah memberitakan kepada kami ['Isa bin Yunus] dari [Al A'masy] dari ['Umarah] dari [Abu Ma'mar] dari [Abu Mas'ud] dia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"sholat seseorang tidak sah bila tulang rusuk (punggung) nya tidak tegak (thuma 'ninah) saat ruku' dan sujud.\""
            },
            {
                "number": 1098,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ أَنَّ تَمِيمَ بْنَ مَحْمُودٍ أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ شِبْلٍ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَلَاثٍ عَنْ نَقْرَةِ الْغُرَابِ وَافْتِرَاشِ السَّبُعِ وَأَنْ يُوَطِّنَ الرَّجُلُ الْمَقَامَ لِلصَّلَاةِ كَمَا يُوَطِّنُ الْبَعِيرُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin 'Abdul Hakim] dari [Syu'aib] dari [Al Laits] dia berkata; telah menceritakan kepada kami [Khalid] dari [Ibnu Abu Hilal] dari [Ja'far bin 'Abdullah] telah mengabarkan kepadanya [Tamim bin Mahmud] telah mengabarkan kepadanya ['Abdurrahman bin Syibl] bahwa Rasulullah Shallallahu'alaihi wasallam melarang tiga hal -dalam sholat-: mematuk seperti burung Gagak, menghamparkan kedua lengan seperti binatang buas, dan membentuk tempat khusus baginya untuk sholat sebagaimana unta membentuk tempat khusus untuk menderum."
            },
            {
                "number": 1099,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ الْبَصْرِيُّ عَنْ يَزِيدَ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ وَرَوْحٌ يَعْنِي ابْنَ الْقَاسِمِ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعَةٍ وَلَا أَكُفَّ شَعْرًا وَلَا ثَوْبًا",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah Al Bashri] dari [Yazid] -yaitu Ibnu Zura'i- dia berkata; telah menceritakan kepada kami [Syu'bah] dan [Rauh] yaitu Ibnu Al Qashim dari [Amr bin Dinar] dari [Thawus] dari [Ibnu Abbas] dia berkata; \"Nabi Shallallahu'alaihiwasallam Bersabda: Aku diperintahkan sujud di atas tujuh anggota badan, tanpa mengikat rambut atau baju.\""
            },
            {
                "number": 1100,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو السَّرْحِيُّ مِنْ وَلَدِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَنْبَأَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ بُكَيْرًا حَدَّثَهُ أَنَّ كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّهُ رَأَى عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُصَلِّي وَرَأْسُهُ مَعْقُوصٌ مِنْ وَرَائِهِ فَقَامَ فَجَعَلَ يَحُلُّهُ فَلَمَّا انْصَرَفَ أَقْبَلَ إِلَى ابْنِ عَبَّاسٍ فَقَالَ مَا لَكَ وَرَأْسِي قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّمَا مَثَلُ هَذَا مَثَلُ الَّذِي يُصَلِّي وَهُوَ مَكْتُوفٌ",
                "id": "Telah mengabarkan kepada kami [Amr bin Sawwad bin Al Aswad bin Amr As-Sarhiy] -ia salah seorang anak Abdullah bin Sa'ad bin Abu Sarh- dia berkata; telah memberitakan kepada kami [Ibnu Wahab] dia berkata; telah memberitakan kepada kami [Amr bin Al Harits] bahwasanya [Bukair] telah bercerita kepadanya bahwa [Kuraiba] -budak Ibnu Abbas- berkata kepadanya dari [Abdullah bin Abbas] bahwa dia melihat Abdullah bin Al Harits sedang sholat dan rambut kepalanya dililit ke belakang, lalu dia bangkit dan melepaskan ikatan tersebut. Setelah selesai sholat, dia menghadap Ibnu Abbas dan berkata; \"Kenapa kamu dengan (melepaskan ikatan) kepalaku?\" Ia menjawab; \"Aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: 'Perumpamaan orang ini -yang sholat dengan mengikat rambutnya- seperti orang yang sholat sedangkan kedua tangannya diikat ke belakang'.\""
            },
            {
                "number": 1101,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الْمَكِّيُّ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَأُمِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةِ أَعْظُمٍ وَنُهِيَ أَنْ يَكُفَّ الشَّعْرَ وَالثِّيَابَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur Al Makii] dari [Sufyan] dari ['Amr] dari [Thawus] dari [Ibnu 'Abbas] dia berkata; \"Nabi Shallallahu'alaihiwasallam diperintahkan sujud di atas tujuh anggota badan dan melarang mengikat rambut atau melipat baju.\""
            },
            {
                "number": 1102,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ خَالِدِ بْنِ عَبْدِ الرَّحْمَنِ هُوَ السُّلَمِيُّ قَالَ حَدَّثَنِي غَالِبٌ الْقَطَّانُ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ عَنْ أَنَسٍ قَالَكُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالظَّهَائِرِ سَجَدْنَا عَلَى ثِيَابِنَا اتِّقَاءَ الْحَرِّ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah bin Mubarak] dari [Khalid bin 'Abdurrahman As-Sulami] dia berkata telah menceritakan kepada kami [Ghalib Al Quththan] dari [Bakr bin 'Abdullah Al Muzanni] dari [Anas] dia berkata; \"Kami pernah sholat di belakang Rasulullah Shallallahu'alaihiwasallam pada pertengahan siang (saat panas sekali), lalu kami sujud di atas baju-baju kami untuk menghindari panas.\" "
            },
            {
                "number": 1103,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتِمُّوا الرُّكُوعَ وَالسُّجُودَ فَوَاللَّهِ إِنِّي لَأَرَاكُمْ مِنْ خَلْفِ ظَهْرِي فِي رُكُوعِكُمْ وَسُجُودِكُمْ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdah] dari [Sa'id] dari [Qatadah] dari [Anas] dari Rasulullah Shallallahu'alaihiwasallam, beliau bersabda: \"Sempurnakanlah ruku' dan sujud kalian. Demi Allah, aku melihat kalian dari balik punggungku saat kalian sedang melakukan ruku ' dan sujud.\""
            },
            {
                "number": 1104,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ وَعُثْمَانُ بْنُ عُمَرَ قَالَ أَبُو عَلِيٍّ حَدَّثَنَا وَقَالَ عُثْمَانُ أَنْبَأَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَنَهَانِي حِبِّي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَلَاثٍ لَا أَقُولُ نَهَى النَّاسَ نَهَانِي عَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيِّ وَعَنْ الْمُعَصْفَرِ الْمُفَدَّمَةِ وَلَا أَقْرَأُ سَاجِدًا وَلَا رَاكِعًا",
                "id": "Telah mengabarkan kepada kami [Abu Dawud Sulaiman bin Saif] dia berkata; telah menceritakan kepada kami [Abu 'Ali Al Hanafi] dan ['Utsman bin 'Umar], Abu 'Ali berkata; telah menceritakan kepada kami dan 'Utsman berkata; telah memberitakan kepada kami [Dawud bin Qais] dari [Ibrahim bin 'Abdullah bin Hunain] dari [bapaknya] dari [Ibnu 'Abbas] dari ['Ali bin Abu Thalib] Radliyallahu'anhu dia berkata; \"Kekasihku, Rasulullah Shallallahu'alaihiwasallam melarangku tiga hal -aku tidak mengatakan beliau melarang manusia- untuk memakai cincin emas, pakaian yang berbordir sutra, pakaian yang dicelup warna kuning menyala, dan melarang membaca (Al Qur'an) saat aku ruku' dan sujud.\""
            },
            {
                "number": 1105,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ ح وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُ سَمِعَ عَلِيًّا قَالَنَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقْرَأَ رَاكِعًا أَوْ سَاجِدًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amr bin As-Sarh] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dari [Yunus] dan [Al Harits bin Miskin] telah dibacakan kepadanya dan saya mendengarkannya dari [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dia berkata; Telah mengabarkan kepadaku [Ibrahim bin 'Abdullah] bahwasanya [bapaknya] menceritakan kepadanya, dia mendengar [Ali] berkata; \"Rasulullah Shallallahu'alaihiwasallam melarangku membaca (Al Qur'an) saat ruku' dan sujud.\""
            },
            {
                "number": 1106,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ الْمَرْوَزِيُّ قَالَ أَنْبَأَنَا إِسْمَعِيلُ هُوَ ابْنُ جَعْفَرٍ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ سُحَيْمٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَكَشَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السِّتْرَ وَرَأْسُهُ مَعْصُوبٌ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ فَقَالَ اللَّهُمَّ قَدْ بَلَّغْتُ ثَلَاثَ مَرَّاتٍ إِنَّهُ لَمْ يَبْقَ مِنْ مُبَشِّرَاتِ النُّبُوَّةِ إِلَّا الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْعَبْدُ أَوْ تُرَى لَهُ أَلَا وَإِنِّي قَدْ نُهِيتُ عَنْ الْقِرَاءَةِ فِي الرُّكُوعِ وَالسُّجُودِ فَإِذَا رَكَعْتُمْ فَعَظِّمُوا رَبَّكُمْ وَإِذَا سَجَدْتُمْ فَاجْتَهِدُوا فِي الدُّعَاءِ فَإِنَّهُ قَمِنٌ أَنْ يُسْتَجَابَ لَكُمْ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr Al Marwazi] dia berkata; telah memberitakan kepada kami [Ismail ibnu Ja'far] dia berkata; telah menceritakan kepada kami [Sulaiman bin Suhaim] dari [Ibrahim bin Abdullah bin Ma'bad bin 'Abbas] dari [bapaknya] dari ['Abdullah bin 'Abbas] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam suatu saat menyingkap tirai, dan kepalanya dililit (diperban) dengan kain karena sakit -yang akhirnya menyebabkan beliau meninggal dunia- lalu beliau Shallallahu'alaihiwasallam bersabda: 'Ya Allah, telah kusampaikan - tiga kali -, sesungguhnya tidak tersisa lagi kabar kenabian kecuali mimpi yang benar, yakni mimpi yang dilihat atau diperlihatkan kepada seorang hamba '. Kemudian beliau Shallallahu'alaihiwasallam menambahkan, 'Ketahuilah, aku dilarang membaca (Al Qur'an) saat ruku' atau sujud. Ketika ruku' maka agungkanlah Rabb kalian dan ketika sujud maka bersungguh-sungguhlah dalam berdoa. karena saat itu kemungkinan besar doa kalian dikabulkan.'"
            },
            {
                "number": 1107,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي رِشْدِينَ وَهُوَ كُرَيْبٌ عَنْ ابْنِ عَبَّاسٍ قَالَبِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ بِنْتِ الْحَارِثِ وَبَاتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَهَا فَرَأَيْتُهُ قَامَ لِحَاجَتِهِ فَأَتَى الْقِرْبَةَ فَحَلَّ شِنَاقَهَا ثُمَّ تَوَضَّأَ وُضُوءًا بَيْنَ الْوُضُوءَيْنِ ثُمَّ أَتَى فِرَاشَهُ فَنَامَ ثُمَّ قَامَ قَوْمَةً أُخْرَى فَأَتَى الْقِرْبَةَ فَحَلَّ شِنَاقَهَا ثُمَّ تَوَضَّأَ وُضُوءًا هُوَ الْوُضُوءُ ثُمَّ قَامَ يُصَلِّي وَكَانَ يَقُولُ فِي سُجُودِهِ اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَاجْعَلْ فِي سَمْعِي نُورًا وَاجْعَلْ فِي بَصَرِي نُورًا وَاجْعَلْ مِنْ تَحْتِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ يَسَارِي نُورًا وَاجْعَلْ أَمَامِي نُورًا وَاجْعَلْ خَلْفِي نُورًا وَأَعْظِمْ لِي نُورًا ثُمَّ نَامَ حَتَّى نَفَخَ فَأَتَاهُ بِلَالٌ فَأَيْقَظَهُ لِلصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Hunnad bin As Sari] dari [Abul Ahwas] dari [Sa'id bin Masruq] dari [Salamah bin Kuhail] dari [Abu Risydin Karib] dari [Ibnu 'Abbas] dia berkata; \"Aku pernah menginap di rumah bibiku Maimunah binti Al Harits, dan Rasulullah Shallallahu'alaihiwasallam juga bermalam di sana. Aku melihat beliau bangun untuk suatu keperluan, lalu mengambil qirbah (kantong kulit untuk tempat air) kemudian melepaskan tali pengikat tutupnya, lantas beliau wudhu dengan sederhana. Setelah itu Rasulullah Shallallahu'alaihiwasallam pergi ke tempat tidur dan tertidur, kemudian bangun lagi. Lalu beliau mengambil qirbahnya lagi dan melepaskan tali, penutupnya lantas berwudhu' dengan wudhu yang sederhana, kemudian berdiri untuk sholat. Ketika sujud beliau berdoa: 'Ya Allah, berikanlah cahaya dalam hati dan lisanku, pendengaranku dan penglihatanku. Berilah cahaya dari arah bawahku, atasku, sebelah kananku, sebelah kiriku, sebelah depanku, sebelah belakangku, serta pada jiwaku, dan agungkanlah cahaya itu padaku, kemudian beliau tidur hingga terdengar napas tidur beliau, lalu Bilal mendatanginya dan membangunkannya untuk sholat'.\""
            },
            {
                "number": 1108,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي يَتَأَوَّلُ الْقُرْآنَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Sufyan] dari [Manshur] dari [Abu Adl Dluha] dari [Masruq] dari ['Aisyah] dia berkata; Rasulullah Shallallahu'alaihiwasallam saat ruku' dan sujud membaca doa -yang artinya-: \"Ya Allah, Maha Suci Engkau Rabb kami dan kami memuji-Mu. Ya Allah, ampunilah aku.\" Ini merupakan tafsiran dari Al Qur'an."
            },
            {
                "number": 1109,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي يَتَأَوَّلُ الْقُرْآنَ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghalian] dia berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Manshur] dari [Abu Adl Dluhaa] dari [Masruq] dari ['Aisyah] dia berkata; bahwa Rasulullah Shallallahu'alaihiwasallam saat ruku' dan sujud membaca doa -yang artinya-: \"Ya Allah, Maha Suci Engkau Rabb kami dan kami memuji-Mu. Ya Allah, ampunilah aku.\" Ini merupakan tafsiran dari Al Qur'an."
            },
            {
                "number": 1110,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْفَقَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَظَنَنْتُ أَنَّهُ أَتَى بَعْضَ جَوَارِيهِ فَطَلَبْتُهُ فَإِذَا هُوَ سَاجِدٌ يَقُولُ رَبِّ اغْفِرْ لِي مَا أَسْرَرْتُ وَمَا أَعْلَنْتُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Hilal bin Yasaf] dari ['Aisyah] Radliyallahu'anha dia berkata; \"Aku pernah kehilangan Rasulullah Shallallahu'alaihi wasallam, dan kukira beliau telah mendatangi sebagian istrinya yang lain. Aku mencarinya dan ternyata beliau sedang sujud. Beliau Shallallahu'alaihiwasallam mengucapkan doa -yang artinya-: \"Ya Allah, ampunilah aku dari apa yang aku perlihatkan dan yang aku sembunyikan.\""
            },
            {
                "number": 1111,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ هُوَ ابْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ قَالَ حَدَّثَنِي عَمِّي الْمَاجِشُونُ بْنُ أَبِي سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيٍّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَجَدَ يَقُولُ اللَّهُمَّ لَكَ سَجَدْتُ وَلَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَصَوَّرَهُ فَأَحْسَنَ صُورَتَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dia berkata; telah menceritakan kepada kami ['Abdul 'Aziz bin Abu Salamah] dia berkata; telah menceritakan kepadaku pamanku [Al Majisyun bin Abu Salamah] dari ['Abdurrahman Al A'raj] dari ['ubaidhullah bin Abu Rafi'] dari ['Ali] bahwa Rasulullah Shallallahu'alaihiwasallam bila sujud mengucapkan doa, Ya Allah, kepada-Mu aku sujud, kepada-Mu aku pasrah, dan kepada-Mu aku beriman. Wajahku sujud kepada Dzat yang telah menciptakannya dan membentuknya serta membuat bentuknya dengan sangat bagus, lalu la menciptakan pendengaran dan penglihatannya. Maha Suci Allah sebaik-sebaik pencipta."
            },
            {
                "number": 1112,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ عُثْمَانَ قَالَ أَنْبَأَنَا أَبُو حَيْوَةَ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي سُجُودِهِ اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ وَأَنْتَ رَبِّي سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin 'Utsman] dia berkata; telah memberitakan kepada kami [Abu Haiwah] dia berkata; telah menceritakan kepada kami [Syu'aib bin Abu Hamzah] dari [Muhammad bin Al Munkadir] dari [Jabir bin 'Abdullah] dari Nabi Shallallahu'alaihi wasallam, beliau Shallallahu'alaihiwasallam dalam' sujudnya mengucapkan doa: Ya Allah, kepada-Mu aku sujud, kepada-Mu aku beriman, dan kepada-Mu aku pasrah. Engkau Rabbku, wajahku sujud kepada Dzat yang telah menciptakannya dan membentuknya, serta membuat bentuknya dengan sangat bagus, lalu la menciptakan pendengaran dan penglihatannya. Maha Suci Allah sebaik-baik pencipta.\""
            },
            {
                "number": 1113,
                "arab": "أَخْبَرَنَا سَوَّارُ بْنُ عَبْدِ اللَّهِ بْنِ سَوَّارٍ الْقَاضِي وَمُحَمَّدُ بْنُ بَشَّارٍ عَنْ عَبْدِ الْوَهَّابِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ أَبِي الْعَالِيَةِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي سُجُودِ الْقُرْآنِ بِاللَّيْلِ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ",
                "id": "Telah mengabarkan kepada kami [Sawwar bin 'Abdullah bin Sawwar Al Qadli] dan [Muhammad bin Basysyar] dari ['Abdul Wahhab] dia berkata; telah menceritakan kepada kami [Khalid] dari [Abul 'Aliyah] dari ['Aisyah] bahwa Rasulullah Shallallahu'alaihiwasallam pada suatu malam saat sujud (tilawah\/ayat alquran yang terdapat ayat sajdah) mengucapkan doa, \"Wajahku sujud kepada Dzat yang telah menciptakannya dan membentuknya, serta membuat bentuknya dengan sangat bagus, lalu la menciptakan pendengaran dan penglihatannya dengan segala daya dan kekuatan-Nya.\""
            },
            {
                "number": 1114,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَائِشَةَ قَالَتْفَقَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَوَجَدْتُهُ وَهُوَ سَاجِدٌ وَصُدُورُ قَدَمَيْهِ نَحْوَ الْقِبْلَةِ فَسَمِعْتُهُ يَقُولُ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَأَعُوذُ بِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنَتْ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Jarir] dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim] dari ['Aisyah] dia berkata; \"Suatu malam aku kehilangan Rasulullah Shallallahu'alaihiwasallam dan aku menyentuh beliau yang sedang sujud, sedangkan kedua telapak kakinya tegak menghadap kiblat. Beliau mengucapkan doa, 'Ya Allah, aku berlindung dengan keridhaan-Mu dari kemurkaan-Mu dan dengan kemurahan-Mu dari siksa-Mu. Aku (berlindung) kepada-Mu dari adzab-Mu, aku tidak bisa menghitung pujian kepada-Mu, Engkau sebagaimana yang Engkau memuji diri-Mu sendiri.\""
            },
            {
                "number": 1115,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ سَوَّارٍ قَالَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَمْرِو بْنِ قَيْسٍ الْكِنْدِيِّ أَنَّهُ سَمِعَ عَاصِمَ بْنَ حُمَيْدٍ يَقُولُ سَمِعْتُ عَوْفَ بْنَ مَالِكٍ يَقُولُقُمْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَدَأَ فَاسْتَاكَ وَتَوَضَّأَ ثُمَّ قَامَ فَصَلَّى فَبَدَأَ فَاسْتَفْتَحَ مِنْ الْبَقَرَةِ لَا يَمُرُّ بِآيَةِ رَحْمَةٍ إِلَّا وَقَفَ وَسَأَلَ وَلَا يَمُرُّ بِآيَةِ عَذَابٍ إِلَّا وَقَفَ يَتَعَوَّذُ ثُمَّ رَكَعَ فَمَكَثَ رَاكِعًا بِقَدْرِ قِيَامِهِ يَقُولُ فِي رُكُوعِهِ سُبْحَانَ ذِي الْجَبَرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ ثُمَّ سَجَدَ بِقَدْرِ رُكُوعِهِ يَقُولُ فِي سُجُودِهِ سُبْحَانَ ذِي الْجَبَرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ ثُمَّ قَرَأَ آلَ عِمْرَانَ ثُمَّ سُورَةً ثُمَّ سُورَةً فَعَلَ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Al Hasan bin Sawwar] dia berkata; telah menceritakan kepada kami [Laits bin Sa'ad] dari [Mu'awiyah bin Shalih] dari ['Amr bin Qais Al Kindi] bahwasanya dia mendengan ['Ashim bin Humaid] berkata; aku mendengar ['Auf bin Malik] berkata; \"Aku pernah bangun bersama Nabi Shallallahu'alaihi wasallam, lalu beliau mulai bersiwak dan berwudhu. Kemudian beliau berdiri dan sholat. Beliau mengawali sholatnya dengan membaca surat Al Baqarah. Beliau tidak melewati ayat tentang rahmat kecuali beliau berhenti dan memohon (rahmat). Beliau juga tidak melewati ayat tentang adzab kecuali beliau berhenti dan berlindung darinya. Kemudian beliau ruku' hingga ia tenang dalam keadaan ruku' seukuran berdirinya, sambil membaca: 'Subhana dzil jabaruuti wal malakuuti wal kibriyaai wal 'adzamati (Maha Suci Dzat yang mempunyai hak memaksa dan kekuasaan, serta yang memiliki kesombongan dan keagungan) ' saat ruku'. Lantas beliau Shallallahu'alaihiwasallam sujud seukuran ruku'nya tadi dengan membaca: 'Subhana dzil jabaruuti wal malakuuti wal kibriyaai wal 'adzamati'. Kemudian beliau membaca surat Ali 'Imran, kemudian surat lainnya, dan beliau juga melakukan hal yang sama - di rakaat berikutnya -.\" "
            },
            {
                "number": 1116,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَاسْتَفْتَحَ بِسُورَةِ الْبَقَرَةِ فَقَرَأَ بِمِائَةِ آيَةٍ لَمْ يَرْكَعْ فَمَضَى قُلْتُ يَخْتِمُهَا فِي الرَّكْعَتَيْنِ فَمَضَى قُلْتُ يَخْتِمُهَا ثُمَّ يَرْكَعُ فَمَضَى حَتَّى قَرَأَ سُورَةَ النِّسَاءِ ثُمَّ قَرَأَ سُورَةَ آلِ عِمْرَانَ ثُمَّ رَكَعَ نَحْوًا مِنْ قِيَامِهِ يَقُولُ فِي رُكُوعِهِ سُبْحَانَ رَبِّيَ الْعَظِيمِ سُبْحَانَ رَبِّيَ الْعَظِيمِ سُبْحَانَ رَبِّيَ الْعَظِيمِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ وَأَطَالَ الْقِيَامَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ يَقُولُ فِي سُجُودِهِ سُبْحَانَ رَبِّيَ الْأَعْلَى سُبْحَانَ رَبِّيَ الْأَعْلَى سُبْحَانَ رَبِّيَ الْأَعْلَى لَا يَمُرُّ بِآيَةِ تَخْوِيفٍ أَوْ تَعْظِيمٍ لِلَّهِ عَزَّ وَجَلَّ إِلَّا ذَكَرَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Jarir] dari [Al A'masy] dari [Sa'ad bin 'Ubaidah] dari [Al Mustaurid bin Al Ahnaf] dari [Shilah bin Zufar] dari [Hudzaifah] dia berkata; \"Pada suatu malam aku mengerjakan sholat bersama Rasulullah Shallallahu'alaihiwasallam, beliau mulai dengan membaca surat Al Baqarah. Beliau telah membaca seratus ayat dan belum ruku lalu tetap membacanya.\" Hudzaifah berkata; \"Beliau menyelesaikannya pada dua rakaat, lantas berlalu.\" Hudzaifah berkata lagi; \"Beliau menyelesaikannya kemudian ruku' dan terus berlalu hinggga beliau membaca surat An-Nisaa', kemudian membaca surat Ali 'Imraan, lalu ruku' yang lamanya seperti berdiri. Saat ruku' beliau mengucapkan, 'Subhana rabbiyal 'adzimi, subhana rabbiyal 'adzimi, subhana rabbiyal 'adzimi (Maha suci Tuhan-ku yang Maha Agung) '. Lalu beliau mengangkat kepala sambil mengucapkan, 'Sami'allahu liman hamidah rabbana lakal hamdu (Allah Maha mendengar orang yang memuji-Nya, segala puji untuk-Mu) '. Beliau memperpanjang berdirinya kemudian sujud, dan beliau memperlama sujudnya sambil mengucapkan, 'Subhana rabbiyal a'laa, subhana rabbiyal a'laa, subhana rabbiyal a'laa (Maha Suci Tuhanku yang Maha Tinggi) '. Beliau Shallallahu'alaihiwasallam tidak melalui ayat ancaman atau pengagungan Allah Azza wa Jalla kecuali beliau Shallallahu'alaihiwasallam berdzikir kepada-Nya.\""
            },
            {
                "number": 1117,
                "arab": "أَخْبَرَنَا بُنْدَارٌ مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ وَابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ قَالَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
                "id": "Telah mengabarkan kepada kami [Bundar Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] dan [Ibnu Abu 'Adi] dari [Syu'bah] dia berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Mutharrif] dari ['Aisyah] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam ketika ruku' dan sujudnya memperbanyak bacaan, 'Subbuuhun qudduusun, rabbul malaaikati warruh (Maha Suci dan Maha Qudus, Rabb para malaikat dan malaikat Jibril) '.\""
            },
            {
                "number": 1118,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ بْنِ عُمَرَ بْنِ كَيْسَانَ قَالَ حَدَّثَنِي أَبِي عَنْ وَهْبِ بْنِ مَانُوسَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُمَا رَأَيْتُ أَحَدًا أَشْبَهَ صَلَاةً بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ هَذَا الْفَتَى يَعْنِي عُمَرَ بْنَ عَبْدِ الْعَزِيزِ فَحَزَرْنَا فِي رُكُوعِهِ عَشْرَ تَسْبِيحَاتٍ وَفِي سُجُودِهِ عَشْرَ تَسْبِيحَاتٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah menceritakan kepada kami ['Abdullah bin Ibrahim bin 'Umar bin Kaisan] dia berkata; [bapakku] telah menceritakan kepadaku dari [Wahb bin Manus] dia berkata; aku mendengar [Sa'id bin Jubair] berkata; aku mendengar [Anas bin Malik] berkata; \"Tidaklah aku melihat seorangpun yang sholatnya lebih menyerupai sholat Rasulullah Shalallahu 'Alaihi Wa Sallam dari pemuda ini, -yaitu Umar bin Abdul Aziz-. Kami mengira dia membaca sepuluh tasbih dalam setiap ruku dan sujudnya.\""
            },
            {
                "number": 1119,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ أَبُو يَحْيَى بِمَكَّةَ وَهُوَ بَصْرِيٌّ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّ عَلِيَّ بْنَ يَحْيَى بْنِ خَلَّادِ بْنِ مَالِكِ بْنِ رَافِعِ بْنِ مَالِكٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ عَمِّهِ رِفَاعَةَ بْنِ رَافِعٍ قَالَبَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ وَنَحْنُ حَوْلَهُ إِذْ دَخَلَ رَجُلٌ فَأَتَى الْقِبْلَةَ فَصَلَّى فَلَمَّا قَضَى صَلَاتَهُ جَاءَ فَسَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى الْقَوْمِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ اذْهَبْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ فَذَهَبَ فَصَلَّى فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمُقُ صَلَاتَهُ وَلَا يَدْرِي مَا يَعِيبُ مِنْهَا فَلَمَّا قَضَى صَلَاتَهُ جَاءَ فَسَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى الْقَوْمِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ اذْهَبْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ فَأَعَادَهَا مَرَّتَيْنِ أَوْ ثَلَاثًا فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ مَا عِبْتَ مِنْ صَلَاتِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا لَمْ تَتِمَّ صَلَاةُ أَحَدِكُمْ حَتَّى يُسْبِغَ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ عَزَّ وَجَلَّ فَيَغْسِلَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَيَمْسَحَ بِرَأْسِهِ وَرِجْلَيْهِ إِلَى الْكَعْبَيْنِ ثُمَّ يُكَبِّرَ اللَّهَ عَزَّ وَجَلَّ وَيَحْمَدَهُ وَيُمَجِّدَهُ قَالَ هَمَّامٌ وَسَمِعْتُهُ يَقُولُ وَيَحْمَدَ اللَّهَ وَيُمَجِّدَهُ وَيُكَبِّرَهُ قَالَ فَكِلَاهُمَا قَدْ سَمِعْتُهُ يَقُولُ قَالَ وَيَقْرَأَ مَا تَيَسَّرَ مِنْ الْقُرْآنِ مِمَّا عَلَّمَهُ اللَّهُ وَأَذِنَ لَهُ فِيهِ ثُمَّ يُكَبِّرَ وَيَرْكَعَ حَتَّى تَطْمَئِنَّ مَفَاصِلُهُ وَتَسْتَرْخِيَ ثُمَّ يَقُولَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ يَسْتَوِيَ قَائِمًا حَتَّى يُقِيمَ صُلْبَهُ ثُمَّ يُكَبِّرَ وَيَسْجُدَ حَتَّى يُمَكِّنَ وَجْهَهُ وَقَدْ سَمِعْتُهُ يَقُولُ جَبْهَتَهُ حَتَّى تَطْمَئِنَّ مَفَاصِلُهُ وَتَسْتَرْخِيَ وَيُكَبِّرَ فَيَرْفَعَ حَتَّى يَسْتَوِيَ قَاعِدًا عَلَى مَقْعَدَتِهِ وَيُقِيمَ صُلْبَهُ ثُمَّ يُكَبِّرَ فَيَسْجُدَ حَتَّى يُمَكِّنَ وَجْهَهُ وَيَسْتَرْخِيَ فَإِذَا لَمْ يَفْعَلْ هَكَذَا لَمْ تَتِمَّ صَلَاتُهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin yazid Al Muqri Abu Yahya] di Mekkah dan dia adalah orang Bashrah dia berkata; telah menceritakan kepada kami [bapakku], dia berkata; telah menceritakan kepada kami [Hammam] dia berkata; telah menceritakan kepada kami [Ishaq bin 'Abdullah bin Abu Thalhah] bahwasanya ['Ali bin Yahya bin Khallad bin Malik bin Rafi' bin Malik], telah menceritakan kepadanya dari [Bapaknya], dari pamannya [Rifa'ah bin Rafi'] dia berkata; \"Tatkala Rasulullah Shallallahu'alaihiwasallam sedang duduk-duduk dan kami di sekelilingnya, tiba-tiba ada seorang laki-laki masuk ke dalam masjid dan menghadap ke kiblat, lalu sholat. Setelah selesai sholat ia datang kepada Rasulullah Shallallahu'alaihiwasallam sambil mengucapkan salam kepada beliau dan kepada kaum Muslimin, maka beliau Shallallahu'alaihiwasallam membalas salamnya lalu bersabda kepadanya: \"Alaikassalam, kembalilah dan sholatlah lagi, sesungguhnya engkau belum sholat'. Lalu ia pergi dan sholat lagi. Rasulullah Shallallahu'alaihiwasallam mengawasi sholatnya tanpa ia sadari kesalahannya! Setelah selesai dari sholatnya ia datang lagi kepada Rasulullah Shallallahu'alaihiwasallam sambil mengucapkan salam kepadanya dan kepada kaum Muslimin, maka beliau Shallallahu'alaihiwasallam membalas salamnya lalu bersabda kepadanya, ' 'Alaikassalam, kembalilah dan sholatlah lagi, sesungguhnya, engkau belum sholat'. la mengulanginya dua atau tiga kali, lantas orang tersebut berkata; 'Wahai Rasulullah Shallallahu'alaihiwasallam, apa yang engkau cela dari sholatku? ' Rasulullah Shallallahu'alaihiwasallam bersabda: \"Belum sempurna sholat salah seorang dari kalian hingga ia menyempurnakan wudhunya sebagaimana yang telah \"Allah Azza wa Jalla perintahkan, Membasuh wajahnya dan kedua tangannya sampai ke siku-sikunya, mengusap kepalanya dan membasuh kedua kakinya sampai ke kedua mata kakinya, lalu bertakbir kepada Allah Azza wa Jalla -dan memuji serta mengagungkan-Nya-Pada lafazh lain: beliau mengatakan: lalu memuji Allah dan mengagungkan-Nya. Rifa'ah berkata; \"Kedua (kalimat) tadi kudengar dari Rasulullah Shallallahu'alaihi wasallam.\" Lalu membaca Al Qur'an yang mudah baginya, yang diajarkan oleh Allah dan diizinkan-Nya. Kemudian bertakbir lalu ruku' hingga tenang persendiannya, kemudian mengucapkan, \"Sami'allahu liman hamidah.\" Kemudian ia berdiri tegak hingga lurus punggungnya, lalu bertakbir dan sujud hingga menempelkan wajahnya-pada lafazh lain: dahinya-hingga tenang persendiannya, kemudian bertakbir dan bangkit dari sujud hingga duduk di tempatnya dan lurus punggungya. Lantas bertakbir dan sujud lagi hingga menempel wajahnya dan tenang. Jika tidak melakukan seperti itu maka belum sempurna sholatnya'.\""
            },
            {
                "number": 1120,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرٍو يَعْنِي ابْنَ الْحَارِثِ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ سُمَيٍّ أَنَّهُ سَمِعَ أَبَا صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ عَزَّ وَجَلَّ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاءَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari ['Amr ibnu Al Harits] dari ['Umarah bin Ghaziyah] dari [Sumayya] bahwasanya dia mendengar [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah Shallallahu'alaihiwasallam bersabda: \"Keadaan hamba yang paling dekat dengan Allah Azza wa Jalla adalah saat ia sujud, maka perbanyaklah berdoa saat sujud.\""
            },
            {
                "number": 1121,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ عَنْ هِقْلِ بْنِ زِيَادٍ الدِّمَشْقِيِّ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي رَبِيعَةُ بْنُ كَعْبٍ الْأَسْلَمِيُّ قَالَكُنْتُ آتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِوَضُوئِهِ وَبِحَاجَتِهِ فَقَالَ سَلْنِي قُلْتُ مُرَافَقَتَكَ فِي الْجَنَّةِ قَالَ أَوَ غَيْرَ ذَلِكَ قُلْتُ هُوَ ذَاكَ قَالَ فَأَعِنِّي عَلَى نَفْسِكَ بِكَثْرَةِ السُّجُودِ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin 'Ammar] dari [Hiql bin Ziyad Ad Dimsyqi] dia berkata; telah menceritakan kepada kami [Al Auza'i] dia berkata; telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Abu Salamah bin 'Abdurrahman] dia berkata; telah menceritakan kepada kami [Rabi'ah bin Ka'ab Al Aslami] dia berkata; \"Aku pernah datang kepada Rasulullah Shallallahu'alaihiwasallam dengan membawa air wudhunya dan kebutuhannya. Lalu Rasulullah Shallallahu'alaihiwasallam bersabda kepadaku: 'Mintalah kepadaku Aku lalu berkata; 'Aku ingin bersama engkau di surga'. Beliau menegaskan, 'Adakah yang lain? 'Aku menjawab, 'Itu saja'. Beliau Shallallahu'alaihiwasallam bersabda: 'Bantu aku untuk dirimu sendiri dengan memperbanyak sujud'.\""
            },
            {
                "number": 1122,
                "arab": "أَخْبَرَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ أَنْبَأَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ هِشَامٍ الْمُعَيْطِيُّ قَالَ حَدَّثَنِي مَعْدَانُ بْنُ طَلْحَةَ الْيَعْمُرِيُّ قَالَلَقِيتُ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ دُلَّنِي عَلَى عَمَلٍ يَنْفَعُنِي أَوْ يُدْخِلُنِي الْجَنَّةَ فَسَكَتَ عَنِّي مَلِيًّا ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ عَلَيْكَ بِالسُّجُودِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ يَسْجُدُ لِلَّهِ سَجْدَةً إِلَّا رَفَعَهُ اللَّهُ عَزَّ وَجَلَّ بِهَا دَرَجَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةًقَالَ مَعْدَانُ ثُمَّ لَقِيتُ أَبَا الدَّرْدَاءِ فَسَأَلْتُهُ عَمَّا سَأَلْتُ عَنْهُ ثَوْبَانَ فَقَالَ لِي عَلَيْكَ بِالسُّجُودِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ يَسْجُدُ لِلَّهِ سَجْدَةً إِلَّا رَفَعَهُ اللَّهُ بِهَا دَرَجَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةً",
                "id": "Telah mengabarkan kepada kami [Abu 'Ammar Al Husain bin Huraits] dia berkata; telah memberitakan kepada kami [Al Walid bin Muslim] dia berkata; telah menceritakan kepada kami [Al Auza'i] dia berkata; telah menceritakan kepada kami [Al Walid bin Hisyam Al Mu'aithi] dia berkata; telah menceritakan kepada kami [Ma'dan bin Thalhah Al Ya'muri] dia berkata; \"Aku berjumpa dengan [Tsauban] -hamba sahaya Rasulullah Shallallahu'alaihiwasallam- lalu aku berkata; Tunjukkan padaku suatu perbuatan yang bermanfaat bagiku dan dapat membuatku masuk surga'. la terdiam beberapa saat, kemudian menoleh kepadaku dan berkata; 'Perbanyaklah bersujud, karena aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidaklah seorang hamba sujud kepada Allah satu kali sujud kecuali Allah Azza wa Jalla mengangkat derajatnya dan menghapus satu kesalahan karenanya.\" Ma'dan berkata; \"Kemudian aku berjumpa dengan [Abu Darda], maka aku bertanya kepadanya suatu hal yang aku tanyakan kepada Tsauban. la berkata; 'Perbanyaklah bersujud, karena aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidaklah seorang hamba sujud kepada Allah satu kali sujud kecuali Allah Azza wa Jalla mengangkat derajatnya dan menghapuskan satu kesalahan dengannya.\""
            },
            {
                "number": 1123,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ لُوَيْنٌ بِالْمَصِّيْصَةِ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ مَعْمَرٍ وَالنُّعْمَانُ بْنُ رَاشِدٍ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ قَالَ كُنْتُ جَالِسًا إِلَى أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ فَحَدَّثَ أَحَدُهُمَا حَدِيثَ الشَّفَاعَةِ وَالْآخَرُ مُنْصِتٌ قَالَ فَتَأْتِي الْمَلَائِكَةُ فَتَشْفَعُ وَتَشْفَعُ الرُّسُلُ وَذَكَرَ الصِّرَاطَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكُونُ أَوَّلَ مَنْ يُجِيزُ فَإِذَا فَرَغَ اللَّهُ عَزَّ وَجَلَّ مِنْ الْقَضَاءِ بَيْنَ خَلْقِهِ وَأَخْرَجَ مِنْ النَّارِ مَنْ يُرِيدُ أَنْ يُخْرِجَ أَمَرَ اللَّهُ الْمَلَائِكَةَ وَالرُّسُلَ أَنْ تَشْفَعَ فَيُعْرَفُونَ بِعَلَامَاتِهِمْ إِنَّ النَّارَ تَأْكُلُ كُلَّ شَيْءٍ مِنْ ابْنِ آدَمَ إِلَّا مَوْضِعَ السُّجُودِ فَيُصَبُّ عَلَيْهِمْ مِنْ مَاءِ الْجَنَّةِ فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Sulaiman Luwain bil Mashishah] dari [Hammad bin Zaid] dari [Ma'mar] dan [Nu'man bin Rasyid] dari [Az Zuhri] dari ['Atha bin Yazid] dia berkata; \"Aku pernah duduk di samping [Abu Hurairah] dan [Abu Sa'id], lalu salah seorang dari keduanya memberitahukan tentang hadits syafaat, sedangkan yang lain diam, ia berkata; 'Lalu malaikat datang dan memberi syafaat. Para Rasul juga memberi syafaat'. la menyebutkan tentang Shirath. Dia mengatakan bahwa Rasulullah Shallallahu'alaihiwasallam bersabda: 'Aku menjadi orang pertama kali yang diperbolehkan. Jika Allah Azza wa Jalla selesai memutuskan (hukum) di antara hamba-hamba-Nya, maka Dia mengeluarkan orang yang dikehendaki-Nya dari neraka. Allah memerintahkan para malaikat dan rasul-Nya untuk memberi syafaat, kemudian mereka dapat dikenali dengan tanda-tanda mereka. Sesungguhnya api neraka memakan segala apa yang ada pada manusia, kecuali tempat sujud. Lalu mereka akan disiram dengan air dari surga, lalu mereka akan tumbuh laksana tumbuhnya tanaman pada hanyutan banjir'.\""
            },
            {
                "number": 1124,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ الْبَصْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ أَبِيهِ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِحْدَى صَلَاتَيْ الْعِشَاءِ وَهُوَ حَامِلٌ حَسَنًا أَوْ حُسَيْنًا فَتَقَدَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَهُ ثُمَّ كَبَّرَ لِلصَّلَاةِ فَصَلَّى فَسَجَدَ بَيْنَ ظَهْرَانَيْ صَلَاتِهِ سَجْدَةً أَطَالَهَا قَالَ أَبِي فَرَفَعْتُ رَأْسِي وَإِذَا الصَّبِيُّ عَلَى ظَهْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ سَاجِدٌ فَرَجَعْتُ إِلَى سُجُودِي فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ قَالَ النَّاسُ يَا رَسُولَ اللَّهِ إِنَّكَ سَجَدْتَ بَيْنَ ظَهْرَانَيْ صَلَاتِكَ سَجْدَةً أَطَلْتَهَا حَتَّى ظَنَنَّا أَنَّهُ قَدْ حَدَثَ أَمْرٌ أَوْ أَنَّهُ يُوحَى إِلَيْكَ قَالَ كُلُّ ذَلِكَ لَمْ يَكُنْ وَلَكِنَّ ابْنِي ارْتَحَلَنِي فَكَرِهْتُ أَنْ أُعَجِّلَهُ حَتَّى يَقْضِيَ حَاجَتَهُ",
                "id": "Telah mengabarkan kepada kami ['Abdurrahman bin Muhammad bin Sallam] dia berkata; telah menceritakan kepada kami [Yazid bin Harun] dia berkata; telah memberitakan kepada kami [Jarir bin Hazim] dia berkata; telah menceritakan kepada kami [Muhammad bin Abu Ya'qub Al Bashri] dari ['Abdullah bin Syaddad] dari [bapaknya], dia berkata; \"Rasulullah Shallallahu'alaihiwasallam pergi kepada kami didalam salah satu sholat 'Isya', ia membawa Hasan atau Husain. Kemudian Rasulullah Shallallahu'alaihiwasallam ke depan dan meletakkan (Hasan dan Husain), kemudian beliau bertakbir untuk sholat lalu mengerjakan sholat. Saat sholat beliau sujud yang lama, maka ayahku berkata, 'Lalu aku mengangkat kepalaku, dan ternyata ada anak kecil di atas punggung Rasulullah Shallallahu'alaihiwasallam yang sedang sujud, lalu aku kembali sujud'. Setelah Rasulullah Shallallahu'alaihiwasallam selesai sholat, orang-orang berkata, 'Wahai Rasulullah Shallallahu'alaihiwasallam saat sholat engkau memperlama sujud, hingga kami mengira bahwa ada sesuatu yang telah terjadi atau ada wahyu yang diturunkan kepadamu? ' Beliau Shallallahu'alaihiwasallam menjawab, 'Bukan karena semua itu, tetapi cucuku (Hasan dan Husain) menjadikanku sebagai kendaraan, maka aku tidak mau\" membuatnya terburu-buru, (aku biarkan) hingga ia selesai dari bermainnya'.\""
            },
            {
                "number": 1125,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ دُكَيْنٍ وَيَحْيَى بْنُ آدَمَ قَالَا حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ وَعَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ وَقِيَامٍ وَقُعُودٍ وَيُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ حَتَّى يُرَى بَيَاضُ خَدِّهِقَالَ وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَفْعَلَانِ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrohim] dia berkata; telah memberitakan kepada kami [Al Fadhl bin Dukain] dan [Yahya bin Adam] mereka berdua berkata; telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari ['Abdurrahman bin Al Aswadi] dari [bapaknya] dan [Alqamah] dari ['Abdullah] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam selalu takbir pada setiap turun ataupun bangun. Beliau Shallallahu'alaihiwasallam juga mengucapkan salam ke kanan dan ke kiri, 'Assalamu'alaikum warahmatullah' hingga terlihat pipinya yang putih.\" la berkata; \"Aku melihat Abu Bakar dan Umar Radliyallahu'anhuma melakukannya juga.\" "
            },
            {
                "number": 1126,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ فِي الصَّلَاةِ رَفَعَ يَدَيْهِ وَإِذَا رَكَعَ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ السُّجُودِ فَعَلَ مِثْلَ ذَلِكَ كُلَّهُ يَعْنِي رَفْعَ يَدَيْهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam] dia berkata; [bapakkku] telah menceritakan kepadaku dari [Qatadah] dari [Nashr bin 'Ashim] dari [Malik bin Al Huwairits] bahwa jika Rasulullah Shallallahu'alaihiwasallam masuk untuk memulai sholat, maka beliau mengangkat kedua tangannya. Beliau juga melakukan hal itu ketika hendak ruku', saat mengangkat kepala dari ruku', dan ketika hendak bangkit dari sujud.\""
            },
            {
                "number": 1127,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا افْتَتَحَ الصَّلَاةَ كَبَّرَ وَرَفَعَ يَدَيْهِ وَإِذَا رَكَعَ وَبَعْدَ الرُّكُوعِ وَلَا يَرْفَعُ بَيْنَ السَّجْدَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dari [Sufyan] dari [Az Zuhri] dari [Salim] dari [bapaknya] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam jika memulai sholat maka beliau bertakbir lalu mengangkat kedua tangannya. Begitu juga saat hendak ruku' dan setelah ruku'. Beliau Shallallahu'alaihiwasallam tidak melakukannya diantara dua sujud.\""
            },
            {
                "number": 1128,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي حَمْزَةَ سَمِعَهُ يُحَدِّثُ عَنْ رَجُلٍ مِنْ عَبْسٍ عَنْ حُذَيْفَةَأَنَّهُ انْتَهَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ إِلَى جَنْبِهِ فَقَالَ اللَّهُ أَكْبَرُ ذُو الْمَلَكُوتِ وَالْجَبَرُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ ثُمَّ قَرَأَ بِالْبَقَرَةِ ثُمَّ رَكَعَ فَكَانَ رُكُوعُهُ نَحْوًا مِنْ قِيَامِهِ فَقَالَ فِي رُكُوعِهِ سُبْحَانَ رَبِّيَ الْعَظِيمِ سُبْحَانَ رَبِّيَ الْعَظِيمِ وَقَالَ حِينَ رَفَعَ رَأْسَهُ لِرَبِّيَ الْحَمْدُ لِرَبِّيَ الْحَمْدُ وَكَانَ يَقُولُ فِي سُجُودِهِ سُبْحَانَ رَبِّيَ الْأَعْلَى سُبْحَانَ رَبِّيَ الْأَعْلَى وَكَانَ يَقُولُ بَيْنَ السَّجْدَتَيْنِ رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Syu'bah] dari ['Amr bin Murrah] dari [Abu Hamzah], dari [seseorang] dari 'Abs dari [Hudzaifah] bahwa ia menemui Rasulullah Shallallahu'alaihiwasallam, lalu ia berdiri di sampingnya, kemudian beliau mengucapkan: \"Allahu akbar dzul malaakuti wal jabaruuti wal kibriya'ai wal 'adzamati (Allah Maha Besar, Dzat yang memiliki kerajaan dan keperkasaan, serta yang memiliki kesombongan dan keagungan).\" Kemudian beliau membaca Al Baqarah, lalu ruku' dan-lama-ruku'nya seperti berdirinya. Saat ruku' beliau mengucapkan, \"Subhana Rabbiyal 'Azhiimi, Subhana Rabbiyal 'Azhiimi (Maha Suci Tuhanku yang Maha Agung, Maha Suci Tuhanku yang Maha Agung).\" Jika beliau mengangkat kepala dari ruku', maka beliau mengucapkan, \"Lirabbil hamdu lirabbil hamdu (Segala pujian bagi Tuhanku, segala pujian bagi Tuhanku).\" Saat sujud beliau mengucapkan, \"Subhana Rabbiyal A'laa (Maha Suci Tuhanku yang Maha Tinggi).\" Sedangkan diantara dua sujud beliau membaca, \"Rabbighfirlii, rahhighfirlii (Wahai Rabbku ampunilah aku, wahai Rabbku ampunilah aku).\""
            },
            {
                "number": 1129,
                "arab": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ اللَّهِ بْنِ مُوسَى الْبَصْرِيُّ قَالَ حَدَّثَنَا النَّضْرُ بْنُ كَثِيرٍ أَبُو سَهْلٍ الْأَزْدِيُّ قَالَصَلَّى إِلَى جَنْبِي عَبْدُ اللَّهِ بْنُ طَاوُسٍ بِمِنًى فِي مَسْجِدِ الْخَيْفِ فَكَانَ إِذَا سَجَدَ السَّجْدَةَ الْأُولَى فَرَفَعَ رَأْسَهُ مِنْهَا رَفَعَ يَدَيْهِ تِلْقَاءَ وَجْهِهِفَأَنْكَرْتُ أَنَا ذَلِكَ فَقُلْتُ لِوُهَيْبِ بْنِ خَالِدٍ إِنَّ هَذَا يَصْنَعُ شَيْئًا لَمْ أَرَ أَحَدًا يَصْنَعُهُ فَقَالَ لَهُ وَهَيْبٌ تَصْنَعُ شَيْئًا لَمْ نَرَ أَحَدًا يَصْنَعُهُ فَقَالَ عَبْدُ اللَّهِ بْنُ طَاوُسٍ رَأَيْتُ أَبِي يَصْنَعُهُ وَقَالَ أَبِي رَأَيْتُ ابْنَ عَبَّاسٍ يَصْنَعُهُ وَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُهُ",
                "id": "Telah mengabarkan kepada kami [Musa bin 'Abdullah bin Musa Al Bashri] dia berkata; telah menceritakan kepada kami [An Nadlr bin Katsir Abu Sahl Al Azdi] dia berkata; \"Abdullah bin Thawus sholat di sampingku saat di Mina, di dalam masjid AI Khaif. Jika ia sujud pada rakaat pertama maka ia mengangkat kepalanya dari sujud dengan mengangkat kedua tangannya di hadapan wajahnya, dan aku mengingkari hal itu. Lalu aku berkata kepada Wuhaib bin Khalid, 'Orang ini telah berbuat sesuatu yang tidak pernah kulihat ada orang yang melakukannya'. Lalu Wuhaib berkata kepadanya, 'Kamu telah berbuat sesuatu yang tidak pernah kami lihat ada orang yang melakukannya! ' [Abdullah bin Thawus] berkata; 'Aku melihat ayahku melakukannya. [Ayahku] juga mengatakan bahwa dirinya melihat Ibnu Abbas melakukannya, dan [Ibnu Abbas] juga mengatakan bahwa ia pernah melihat Rasulullah Shallallahu'alaihiwasallam melakukan hal itu'.\""
            },
            {
                "number": 1130,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ دُحَيْمٌ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الْأَصَمِّ قَالَ حَدَّثَنِي يَزِيدُ بْنُ الْأَصَمِّ عَنْ مَيْمُونَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ خَوَّى بِيَدَيْهِ حَتَّى يُرَى وَضَحَ إِبْطَيْهِ مِنْ وَرَائِهِ وَإِذَا قَعَدَ اطْمَأَنَّ عَلَى فَخِذِهِ الْيُسْرَى",
                "id": "Telah mengabarkan kepada kami ['Abdurrahman bin Ibrahim Duhaim] dia berkata; telah menceritakan kepada kami [Marwan bin Mu'awiyah] dia berkata; telah menceritakan kepada kami ['ubaidhullah bin 'Abdullah bin Al Ashammi] dia berkata; telah menceritakan kepada kami [Yazid bin Al Ashammi] dari [Maimunah] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam jika sujud maka beliau menjauhkan kedua sikunya (dari kedua lambungnya) hingga kedua ketiaknya yang putih terlihat dari belakang. Bila beliau duduk maka beliau duduk dengan tenang di atas paha kirinya.\""
            },
            {
                "number": 1131,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو قُدَامَةَ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ قَالَ حَدَّثَنِي الْحَكَمُ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ قَالَكَانَ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُكُوعُهُ وَسُجُودُهُ وَقِيَامُهُ بَعْدَ مَا يَرْفَعُ رَأْسَهُ مِنْ الرُّكُوعِ وَبَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id Abu Qudamah] dia berkata; telah menceritakan kepada kami [Yahya] dari [Syu'bah] dia berkata; telah menceritakan kepada kami [Al Hakam] dari [Ibnu Abi Laila] dari [Al Barra] dia berkata; \"(Lama) sholat Rasulullah Shallallahu'alaihiwasallam ruku'nya, sujudnya, berdirinya setelah mengangkat kepalanya dari ruku' dan diantara dua sujudnya, semuanya hampir sama.\""
            },
            {
                "number": 1132,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ الْأَسْوَدِ وَعَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي كُلِّ رَفْعٍ وَوَضْعٍ وَقِيَامٍ وَقُعُودٍ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ رَضِيَ اللَّهُ عَنْهُمْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari ['Abdurrahman bin Al Aswad] dari [Al Aswad] dan ['Alqamah] dari ['Abdullah] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam selalu takbir pada setiap turun ataupun bangun. Juga setiap hendak berdiri ataupun duduk. Abu Bakar, Umar dan Utsman radliyallahu'anhum juga melakukannya.\""
            },
            {
                "number": 1133,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا حُجَيْنٌ وَهُوَ ابْنُ الْمُثَنَّى قَالَ حَدَّثَنَا لَيْثٌ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ يُكَبِّرُ حِينَ يَقُومُ ثُمَّ يُكَبِّرُ حِينَ يَرْكَعُ ثُمَّ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ حِينَ يَرْفَعُ صُلْبَهُ مِنْ الرَّكْعَةِ ثُمَّ يَقُولُ وَهُوَ قَائِمٌ رَبَّنَا لَكَ الْحَمْدُ ثُمَّ يُكَبِّرُ حِينَ يَهْوِي سَاجِدًا ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ ثُمَّ يُكَبِّرُ حِينَ يَسْجُدُ ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأَسَهُ ثُمَّ يَفْعَلُ ذَلِكَ فِي الصَّلَاةِ كُلِّهَا حَتَّى يَقْضِيَهَا وَيُكَبِّرُ حِينَ يَقُومُ مِنْ الثِّنْتَيْنِ بَعْدَ الْجُلُوسِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah menceritakan kepada kami [Hujain bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Laits] dari ['Uqail] dari [Ibnu Syihab] dia berkata; Telah mengabarkan kepadaku [Abu Bakr bin Abdurrahman bin Al Harits bin Hisyam] bahwasanya ia mendengar [Abu Hurairah] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam jika bangun untuk sholat maka beliau bertakbir dan bila hendak ruku' maka beliau juga bertakbir. Kemudian beliau mengucapkan, 'Sami'allahu liman hamidah' ketika mengangkat punggungnya dari ruku'. Lalu sambil berdiri beliau mengucapkan, 'Rabbana lakal hamdu. ' Kemudian ia bertakbir ketika turun untuk sujud, lalu bertakbir ketika mengangkat kepalanya. Lantas beliau bertakbir ketika sujud, kemudian bertakbir lagi saat mengangkat kepalanya. Beliau melakukan semua hal itu sampai selesai sholat. Beliau juga bertakbir ketika bangun dari dua rakaat setelah duduk.\""
            },
            {
                "number": 1134,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ قَالَجَاءَنَا أَبُو سُلَيْمَانَ مَالِكُ بْنُ الْحُوَيْرِثِ إِلَى مَسْجِدِنَا فَقَالَ أُرِيدُ أَنْ أُرِيَكُمْ كَيْفَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَالَ فَقَعَدَ فِي الرَّكْعَةِ الْأُولَى حِينَ رَفَعَ رَأْسَهُ مِنْ السَّجْدَةِ الْآخِرَةِ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub] dia berkata; telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dia berkata; [Abu Sulaiman Malik bin Al Huwairits] datang ke masjid kami, lalu berkata; \"Aku ingin memperlihatkan cara sholat Rasulullah Shallallahu'alaihiwasallam kepada kalian'.\" Abu Qilabah berkata lagi; \"Beliau duduk pada rakaat pertama ketika mengangkat kepalanya saat sujud terakhir.\""
            },
            {
                "number": 1135,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا هُشَيْمٌ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فَإِذَا كَانَ فِي وَتْرٍ مِنْ صَلَاتِهِ لَمْ يَنْهَضْ حَتَّى يَسْتَوِيَ جَالِسًا",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Husyaim] dari [Khalid] dari [Abu Qilabah] dari [Malik bin Al Huwairits] dia berkata; \"Aku melihat Rasulullah Shallallahu'alaihiwasallam sholat; jika dalam (rakaat) ganjil dari sholatnya maka beliau tidak bangun hingga ia duduk dengan lurus.\""
            },
            {
                "number": 1136,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ أَبِي قِلَابَةَ قَالَكَانَ مَالِكُ بْنُ الْحُوَيْرِثِ يَأْتِينَا فَيَقُولُ أَلَا أُحَدِّثُكُمْ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُصَلِّي فِي غَيْرِ وَقْتِ الصَّلَاةِ فَإِذَا رَفَعَ رَأْسَهُ مِنْ السَّجْدَةِ الثَّانِيَةِ فِي أَوَّلِ الرَّكْعَةِ اسْتَوَى قَاعِدًا ثُمَّ قَامَ فَاعْتَمَدَ عَلَى الْأَرْضِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Busysyar] dia berkata; telah menceritakan kepada kami ['Abdul Wahhab] dia berkata; telah menceritakan kepada kami [Khalid] dari [Abu Qilabah] dia berkata; bahwa [Malik bin Huwairits] datang kepada kami lalu berkata, \"Maukah kalian aku perlihatkan cara Rasulullah Shallallahu'alaihiwasallam sholat?\" Lalu -Malik- mengerjakan sholat diluar waktu sholat; jika mengangkat kepalanya saat sujud kedua pada rakaat pertama maka ia duduk dalam keadaan lurus, kemudian bangun dengan bertumpu ke tanah."
            },
            {
                "number": 1137,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ وَضَعَ رُكْبَتَيْهِ قَبْلَ يَدَيْهِ وَإِذَا نَهَضَ رَفَعَ يَدَيْهِ قَبْلَ رُكْبَتَيْهِقَالَ أَبُو عَبْد الرَّحْمَنِ لَمْ يَقُلْ هَذَا عَنْ شَرِيكٍ غَيْرُ يَزِيدَ بْنِ هَارُونَ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah memberitakan kepada kami [Yazid bin Harun] dia berkata; telah memberitakan kepada kami [Syarik] dari ['Ashim bin Kulaib] dari [bapaknya] dari [Wail bin Hujr] dia berkata; \"Aku melihat Rasulullah Shallallahu'alaihiwasallam apabila hendak sujud, beliau meletakan kedua lututnya sebelum kedua tangannya, dan apabila bangkit, beliau mengangkat kedua tangannya sebelum kedua lututnya. Abu Abdurrahman berkata; 'Tidak ada yang mengatakan perkataan ini dari Syarik kecuali Yazid bin Harun. Wallahu Ta'ala A'lam.'"
            },
            {
                "number": 1138,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَأَنَّ أَبَا هُرَيْرَةَ كَانَ يُصَلِّي بِهِمْ فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ فَإِذَا انْصَرَفَ قَالَ وَاللَّهِ إِنِّي لَأَشْبَهُكُمْ صَلَاةً بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Ibnu Syihab] dari [Abu Salamah] bahwasanya [Abu Hurairah] pernah sholat bersama mereka', ia bertakbir setiap hendak turun atau bangkit. Tatkala selesai sholat ia berkata; \"Demi Allah, aku adalah orang yang sholatnya paling mirip dengan Rasulullah Shallallahu'alaihi wasallam.\""
            },
            {
                "number": 1139,
                "arab": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ وَسَوَّارُ بْنُ عَبْدِ اللَّهِ بْنِ سَوَّارٍ قَالَا حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِأَنَّهُمَا صَلَّيَا خَلْفَ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ فَلَمَّا رَكَعَ كَبَّرَ فَلَمَّا رَفَعَ رَأْسَهُ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ سَجَدَ وَكَبَّرَ وَرَفَعَ رَأْسَهُ وَكَبَّرَ ثُمَّ كَبَّرَ حِينَ قَامَ مِنْ الرَّكْعَةِ ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَقْرَبُكُمْ شَبَهًا بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا زَالَتْ هَذِهِ صَلَاتُهُ حَتَّى فَارَقَ الدُّنْيَاوَاللَّفْظُ لِسَوَّارٍ",
                "id": "Telah mengabarkan kepada kami [Nashr bin 'Ali] dan [Sawwar bin 'Abdullah bin Sawwar] dia berkata; telah menceritakan kepada kami ['Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari [Abu Bakr bin 'Abdurrahman] dan dari [Abu Salamah bin 'Abdurrahman] bahwasanya keduanya sholat di belakang [Abu Hurairah] Radliyallahu'anhu; bila hendak ruku' maka ia bertakbir. Jika ia mengangkat kepalanya dari ruku' maka ia mengucapkan, \"Sami'allahu liman hamidah rabbana lakal hamdu (Allah Mendengar semua yang memuji-Nya. Ya Allah, untuk-Mu segala pujian).\" Kemudian ia bertakbir ketika turun untuk sujud dan bertakbir ketika hendak bangun dari rakaat. Kemudian ia berkata; \"Demi Dzat yang jiwaku ada di tangan-Nya, aku adalah orang yang paling serupa dengan Rasulullah Shallallahu'alaihiwasallam, dan masih seperti inilah sholat beliau sampai meninggal dunia.\" Lafazh ini milik Surur."
            },
            {
                "number": 1140,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّهُ قَالَإِنَّ مِنْ سُنَّةِ الصَّلَاةِ أَنْ تُضْجِعَ رِجْلَكَ الْيُسْرَى وَتَنْصِبَ الْيُمْنَى",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Al Qasim bin Muhammad] dari ['Abdullah bin 'Abdullah bin 'Umar] dari [bapaknya] dia berkata; \"Termasuk sunnah sholat adalah engkau menidurkan kaki kiri dan menegakkan kaki kanan.\" "
            },
            {
                "number": 1141,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرِ بْنِ مُضَرَ قَالَ حَدَّثَنِي أَبِي عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ يَحْيَى أَنَّ الْقَاسِمَ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَمِنْ سُنَّةِ الصَّلَاةِ أَنْ تَنْصِبَ الْقَدَمَ الْيُمْنَى وَاسْتِقْبَالُهُ بِأَصَابِعِهَا الْقِبْلَةَ وَالْجُلُوسُ عَلَى الْيُسْرَى",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman bin Dawud] dia berkata; telah menceritakan kepada kami [Ishaq bin Bakr bin Mudhar] dia berkata; [bapakku] telah menceritakan kepadaku dari ['Amr bin Al Harits] dari [Yahya] bahwasanya [Al Qasim] menceritakan kepadanya dari ['Abdullah bin 'Abdullah bin 'Umar] dari [bapaknya] dia berkata; \"Termasuk sunnah sholat adalah engkau menegakkan kaki kanan dan menghadapkan jari-jemari kedua kaki ke kiblat, serta duduk di atas kaki kiri.\""
            },
            {
                "number": 1142,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا عَاصِمُ بْنُ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُهُ يَرْفَعُ يَدَيْهِ إِذَا افْتَتَحَ الصَّلَاةَ حَتَّى يُحَاذِيَ مَنْكِبَيْهِ وَإِذَا أَرَادَ أَنْ يَرْكَعَ وَإِذَا جَلَسَ فِي الرَّكْعَتَيْنِ أَضْجَعَ الْيُسْرَى وَنَصَبَ الْيُمْنَى وَوَضَعَ يَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى وَنَصَبَ أُصْبُعَهُ لِلدُّعَاءِ وَوَضَعَ يَدَهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى قَالَ ثُمَّ أَتَيْتُهُمْ مِنْ قَابِلٍ فَرَأَيْتُهُمْ يَرْفَعُونَ أَيْدِيَهُمْ فِي الْبَرَانِسِ",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin 'Abdullah bin Yazid Al Muqri'] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepada kami ['Ashim bin Kulaib] dari [Bapaknya] dari [Wail bin Hujr] dia berkata; \"Aku datang kepada Rasulullah Shalallahu 'Alaihi Wa Sallam dan melihat beliau mengangkat kedua tangannya sejajar dengan kedua bahunya bila memulai sholat, demikian juga saat ketika hendak ruku'. Dan saat duduk pada dua rakaat, beliau Shalallahu 'Alaihi Wa Sallam memiringkan kaki kiri dan menegakkan kaki kanan, meletakkan tangan kanan di atas paha kanan, menegakkan jari untuk berdoa, dan meletakkan tangan kiri di atas paha kiri.\" Beliau Shalallahu 'Alaihi Wa Sallam berkata; \"Kemudian aku datang kepada mereka di waktu lain dan aku melihat mereka mengangkat kedua tangan mereka di burnus (kain yang biasa di pakai untuk menutup kepala).\""
            },
            {
                "number": 1143,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ عَنْ عَلِيِّ بْنِ عَبْدِ الرَّحْمَنِ الْمُعَاوِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ رَأَى رَجُلًا يُحَرِّكُ الْحَصَى بِيَدِهِ وَهُوَ فِي الصَّلَاةِ فَلَمَّا انْصَرَفَ قَالَ لَهُ عَبْدُ اللَّهِ لَا تُحَرِّكْ الْحَصَى وَأَنْتَ فِي الصَّلَاةِ فَإِنَّ ذَلِكَ مِنْ الشَّيْطَانِ وَلَكِنْ اصْنَعْ كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ قَالَ وَكَيْفَ كَانَ يَصْنَعُ قَالَ فَوَضَعَ يَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى وَأَشَارَ بِأُصْبُعِهِ الَّتِي تَلِي الْإِبْهَامَ فِي الْقِبْلَةِ وَرَمَى بِبَصَرِهِ إِلَيْهَا أَوْ نَحْوِهَا ثُمَّ قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Muslim bin Abu Maryam] dari ['Ali bin 'Abdurrahman Al Mu'awiy] dari ['Abdullah bin 'Umar] dia melihat seorang laki-laki menggerak-gerakkan kerikil dengan tangannya saat sholat. Setelah selesai, Abdullah berkata kepadanya; \"Janganlah kamu menggerak-gerakkan kerikil saat sholat, sesungguhnya itu perbuatan syetan. Berbuatlah sebagaimana yang dilakukan oleh Rasulullah Shallallahu'alaihi wasallam.\" la berkata; \"Bagaimana cara Rasulullah Shallallahu'alaihiwasallam melakukannya?\" Aku menjawab; \"Beliau meletakkan tangan kanan di atas paha kanan, lalu menunjukkan jari telunjuknya ke kiblat dan mengarahkan pandangan ke jari tersebut-atau ke sekitarnya.\" Kemudian ia berkata, \"Begitulah cara Rasulullah Shallallahu'alaihiwasallam melakukannya.\""
            },
            {
                "number": 1144,
                "arab": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى السِّجْزِيُّ يُعْرَفُ بِخَيَّاطِ السُّنَّةِ نَزَلَ بِدِمَشْقَ أَحَدُ الثِّقَاتِ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ عِيسَى قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ قَالَ حَدَّثَنَا مَخْرَمَةُ بْنُ بُكَيْرٍ قَالَ أَنْبَأَنَا عَامِرُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ فِي الثِّنْتَيْنِ أَوْ فِي الْأَرْبَعِ يَضَعُ يَدَيْهِ عَلَى رُكْبَتَيْهِ ثُمَّ أَشَارَ بِأُصْبُعِهِ",
                "id": "Telah mengabarkan kepada kami [Zakaria bin Yahya As Sijziy] yang dikenal dengan penjahit sunnah dia tinggal di Damakus, salah satu orang yang tsiqah (terpercaya) dia berkata; telah menceritakan kepada kami [Al Hasan bin 'Isa] dia berkata; telah memberitakan kepada kami [Ibnul Mubarak] dia berkata; telah menceritakan kepada kami [Makhramah bin Bukair] dia berkata; telah memberitakan kepada kami ['Amir bin 'Abdullah bin Az Zubair] dari [bapaknya] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam apabila duduk pada dua rakaat atau empat rakaat maka beliau meletakkan kedua tangan di atas paha, kemudian mengisyaratkan dengan jarinya.\""
            },
            {
                "number": 1145,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ عَنْ الْأَشْجَعِيِّ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ قَالَعَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَقُولَ إِذَا جَلَسْنَا فِي الرَّكْعَتَيْنِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim Ad-Dauraqiy] dari [Al Asyja'iy] dari [Sufyan] dari [Abu Ishaq] dari [Al Aswad] dari ['Abdullah] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam mengajarkan doa saat duduk pada dua rakaat kepada kami - yang artinya -: \"Penghormatan, rahmat dan kebaikan hanya milik Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah dan Muhammad adalah hamba dan utusan-Nya'.\""
            },
            {
                "number": 1146,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا إِسْحَقَ يُحَدِّثُ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا لَا نَدْرِي مَا نَقُولُ فِي كُلِّ رَكْعَتَيْنِ غَيْرَ أَنْ نُسَبِّحَ وَنُكَبِّرَ وَنَحْمَدَ رَبَّنَا وَإِنَّ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَّمَ فَوَاتِحَ الْخَيْرِ وَخَوَاتِمَهُ فَقَالَ إِذَا قَعَدْتُمْ فِي كُلِّ رَكْعَتَيْنِ فَقُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَلْيَتَخَيَّرْ أَحَدُكُمْ مِنْ الدُّعَاءِ أَعْجَبَهُ إِلَيْهِ فَلْيَدْعُ اللَّهَ عَزَّ وَجَلَّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; aku mendengar [Abu Ishaq] menceritakan dari [Abu Al Ahwash] dari ['Abdullah] dia berkata; \"Kami dulu tidak mengetahui apa yang mesti diucapkan saat duduk pada dua rakaat selain bertasbih, bertakbir, dan memuji Rabb kami, lalu Nabi Muhammad Shallallahu'alaihiwasallam mengajari pembuka dan penutup kebaikan. Kemudian beliau Shallallahu'alaihiwasallam bersabda: 'Jika kalian duduk pada setiap dua rakaat, maka ucapkan-doa yang artinya: \"Penghormatan. rahmat dan kebaikan hanya milik Allah. Semoga keselamatan, rahmat dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah dan Muhammad adalah hamba dan utusan-Nya '.\" Hendaklah salah seorang dari kalian memilih doa yang disukainya, dan hendaklah ia berdoa kepada Allah 'azza wajalla.\""
            },
            {
                "number": 1147,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْثَرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَعَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّشَهُّدَ فِي الصَّلَاةِ وَالتَّشَهُّدَ فِي الْحَاجَةِ فَأَمَّا التَّشَهُّدُ فِي الصَّلَاةِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ إِلَى آخِرِ التَّشَهُّدِأَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ آدَمَ قَالَ سَمِعْتُ سُفْيَانَ يَتَشَهَّدُ بِهَذَا فِي الْمَكْتُوبَةِ وَالتَّطَوُّعِ وَيَقُولُ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح وَحَدَّثَنَا مَنْصُورٌ وَحَمَّادٌ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami ['Abtsar] dari [Al A'masy] dari [Abu Ishaq] dari [Abu Al Ahwash] dari ['Abdullah] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam mengajari kami tasyahud dalam sholat dan tasyahud dalam (khutbah) Hajah. Tasyahud dalam sholat adalah, 'At-tahiyyatut lillahi wash-shalawaatu wath-thayyibaatu, assalaamu 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, assalaamu 'alainaa wa 'ala 'ibadillaahish-shaalihiin, asyhadu allaa ilaah illallaah wa asyhadu anna muhammadan Abduhu wa rasuuluh' (penghormatan, rahmat dan kebaikan hanya milik yang baik dan Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah kecuali Allah, dan Muhammad adalah hamba dan utusan-Nya) ' sampai akhir tasyahud.\" Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya yaitu Ibnu Adam] dia berkata; 'Aku mendengar [Sufyan] bertasyahud dengan lafazh ini dalam sholat wajib maupun sunnah, dan dia berkata; telah menceritakan kepada kami [Abu Ishaq] dari [Abu Ahwash] dari [Abdullah] dari Nabi Shallallahu'alaihiwasallam. Dan pada jalur lain, telah menceritakan kepada kami [Manshur] dan [Hammad] dari [Abu Wa'il] dari [Abdullah] dari Nabi Shallallahu'alaihi wasallam."
            },
            {
                "number": 1148,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ زَيْدَ بْنَ أَبِي أُنَيْسَةَ الْجَزَرِيَّ حَدَّثَهُ أَنَّ أَبَا إِسْحَقَ حَدَّثَهُ عَنْ الْأَسْوَدِ وَعَلْقَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَعْلَمُ شَيْئًا فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُولُوا فِي كُلِّ جَلْسَةٍ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amr bin Sarh] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; Telah mengabarkan kepadaku ['Amr bin Al Harits] bahwasanya [Zaid bin Abu Unaisah Al Jazariy] menceritakan kepadanya bahwasanya [Abu Ishaq] menceritakan kepadanya dari [Al Aswad] dan [Alqamah] dari ['Abdullah bin Mas'ud] dia berkata; \"Kami bersama Rasulullah Shallallahu'alaihiwasallam dalam keadaan tidak mengetahui apa-apa, lalu Rasulullah Shallallahu'alaihiwasallam bersabda kepada kami, 'Pada setiap duduk (tasyahud) ucapkanlah, \"At-tahiyyatut lillahi wash-shalawaatu wath-thayyibaatu, assalaamu 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, asalaamu 'alainaa wa 'ala 'ibadillaahish-shaalihiin, asyhadu allaa ilaah illallaah wa asyhadu anna muhammadan Abduhu wa rasuuluh (penghormatan, rahmat dan kebaikan hanya untuk Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah kecuali Allah, dan Muhammad adalah hamba dan utusan-Nya).\""
            },
            {
                "number": 1149,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ جَبَلَةَ الرَّافِقِيُّ قَالَ حَدَّثَنَا الْعَلَاءُ بْنُ هِلَالٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ وَهُوَ ابْنُ عَمْرٍو وَعَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ بْنِ قَيْسٍ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا لَا نَدْرِي مَا نَقُولُ إِذَا صَلَّيْنَا فَعَلَّمَنَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَوَامِعَ الْكَلِمِ فَقَالَ لَنَا قُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُقَالَ عُبَيْدُ اللَّهِ قَالَ زَيْدٌ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَ لَقَدْ رَأَيْتُ ابْنَ مَسْعُودٍ يُعَلِّمُنَا هَؤُلَاءِ الْكَلِمَاتِ كَمَا يُعَلِّمُنَا الْقُرْآنَ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Jabalah Ar Rafiqiy] dia berkata; telah menceritakan kepada kami [Al 'Ala bin Hilal] dia berkata; telah menceritakan kepada kami ['ubaidhullah bin 'Amr] dan dari [Zaid bin Abu Unaisah] dari [Hammad] dari [Ibrahim] dari [Alqamah bin Qais] dari ['Abdullah] dia berkata; \"Kami dulu tidak tahu apa yang mesti diucapkan jika kami dalam sholat. Lalu Nabi Allah Shallallahu'alaihiwasallam mengajarkan \"Jawami'ul kalim' (kalimat yang singkat penuh makna) Beliau Shallallahu'alaihiwasallam bersabda: 'Ucapkanlah, \"At-tahiyyatu lillahi wash-shalawaatu wath-thayyibaatu, assalaamu 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, assalaamu 'alainaa wa 'ala 'ibadillaahish-shaalihiin, asyhadu allaa ilaah illallaah wa asyhadu anna Muhammadan Abduhu wa rasuuluh (penghormatan, rahmat dan kebaikan hanya untuk Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan Muhammad adalah hamba dan utusan-Nya).\" ubaidhullah berkata; Zaid berkata; dari Hammad dari Ibrahim dari Alqomah, dia berkata; 'Aku telah melihat Ibnu Mas'ud mengajarkan kalimat tersebut kepada kami, sebagaimana ia mengajarkan Al Qur'an kepada kami.'"
            },
            {
                "number": 1150,
                "arab": "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الرَّقِّيُّ قَالَ حَدَّثَنَا حَارِثُ بْنُ عَطِيَّةَ وَكَانَ مِنْ زُهَّادِ النَّاسِ عَنْ هِشَامٍ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ ابْنِ مَسْعُودٍ قَالَكُنَّا إِذَا صَلَّيْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَقُولُ السَّلَامُ عَلَى اللَّهِ السَّلَامُ عَلَى جِبْرِيلَ السَّلَامُ عَلَى مِيكَائِيلَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُولُوا السَّلَامُ عَلَى اللَّهِ فَإِنَّ اللَّهَ هُوَ السَّلَامُ وَلَكِنْ قُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepadaku ['Abdurrahman bin Khalid Ar Riqqiy] dia berkata; telah menceritakan kepada kami [Harits bin 'Athiyyah] dan dia adalah termasuk orang yang paling zuhud, dari [Hisyam] dari [Hammad] dari [Ibrahim] dari ['Alqamah] dari [Ibnu Mas'ud] dia berkata; \"Kami dulu sholat bersama Rasulullah Shallallahu'alaihiwasallam dengan mengucapkan, 'Assalaamu 'alallah, Assalaamu 'alaa Jibriil, Assalaamu 'ala Mikail (Keselamatan atas Allah, keselamatan atas Jibril, keselamatan atas Mikail) '. Kemudian Rasulullah Shallallahu'alaihiwasallam bersabda: 'Janganlah kalian mengalakan; \"Assalaamu 'alallah (Keselamatan atas Allah) \" karena Allah adalah Assalaam (Maha pemberi keselamatan), tetapi ucapkanlah, \"At Tahiyyatut lillaahi wash-shalawaatu wath-thayyibaatu, assalaamu 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, assalaamu 'alainaa wa 'ala 'ibadillaahish-shaalihiin, asyhadu allaa ilaah illallaah wahdahu laa syariikalah wa asyhadu anna muhammadan abduhu warasuuluh (penghormatan yang baik dan shalawat bagi Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah semata tiada sekutu bagi-Nya, dan aku bersaksi Muhammad adalah hamba dan utusan-Nya).\""
            },
            {
                "number": 1151,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ هُوَ الدَّسْتَوَائِيُّ عَنْ حَمَّادٍ عَنْ أَبِي وَائِلٍ عَنْ ابْنِ مَسْعُودٍ قَالَكُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَقُولُ السَّلَامُ عَلَى اللَّهِ السَّلَامُ عَلَى جِبْرِيلَ السَّلَامُ عَلَى مِيكَائِيلَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُولُوا السَّلَامُ عَلَى اللَّهِ فَإِنَّ اللَّهَ هُوَ السَّلَامُ وَلَكِنْ قُولُوا التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Hisyam Ad Dastawaiy] dari [Hammad] dari [Abu Wa'il] dari [Ibnu Mas'ud] dia berkata; \"Kami sholat bersama Rasulullah Shallallahu'alaihiwasallam dengan mengucapkan, 'Assalaamu 'alallah, Assalaamu 'alaa Jibriil, Assalaamu 'ala Mikail (Keselamatan atas Allah, keselamatan atas Jibril, keselamatan atas Mikail) '. Kemudian Rasulullah Shallallahu'alaihiwasallam bersabda: 'Janganlah kalian mengatakan; \"Assalaamu 'alallah (Keselamatan atas Allah) \" karena Allah adalah Assalaam (Maha pemberi keselamatan), tetapi ucapkanlah, \"At-Tahiyyatut lillaahi wash-shalawaatu wath-thayyibaatu, assalaamu 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, assalaamu 'alainaa wa 'ala 'ibadillaahish-shaalihiin, asyhadu allaa ilaah illallaah wa asyhadu anna muhammadan abduhu warasuuluh (penghormatan yang baik dan shalawat bagi Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan Muhammad adalah hamba dan utusan-Nya).\""
            },
            {
                "number": 1152,
                "arab": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ الْعَسْكَرِيُّ قَالَ حَدَّثَنَا غُنْدَرٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ وَمَنْصُورٍ وَحَمَّادٍ وَمُغِيرَةَ وَأَبِي هَاشِمٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي التَّشَهُّدِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُقَالَ أَبُو عَبْد الرَّحْمَنِ أَبُو هَاشِمٍ غَرِيبٌ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Khalild Al'Askariy] dia berkata; telah menceritakan kepada kami [Ghundar] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Sulaiman], [Manshur], [Hammad], [Mughirah] dan [Abu Hasyim] dari [Abu Wa'il] dari ['Abdullah] dari dari Nabi Shallallahu'alaihiwasallam, beliau Shallallahu'alaihiwasallam pada tasyahud mengucapkan doa, \"At-tahiyyatut lillahi wash-shalawaatu wath-thayyibaatu, assalaamu 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, assalaamu 'alainaa wa 'ala 'ibadillaahish-shaalihiin, asyhadu allaa ilaah illallaah wa asyhadu anna muhammadan abduhu wa rasuuluh (penghormatan, rahmat dan kebaikan dan hanya milik Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan Muhammad adalah hamba dan utusan-Nya).\" Abu Abdurrahman berkata; 'Abu Hasyim orangnya gharib (asing).'"
            },
            {
                "number": 1153,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ دُكَيْنٍ قَالَ حَدَّثَنَا سَيْفٌ الْمَكِّيُّ قَالَ سَمِعْتُ مُجَاهِدًا يَقُولُ حَدَّثَنِي أَبُو مَعْمَرٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ يَقُولُعَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّشَهُّدَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنْ الْقُرْآنِ وَكَفُّهُ بَيْنَ يَدَيْهِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Al Fadhl bin Dukain] dia berkata; telah menceritakan kepada kami [Saif Al Makkiy] dia berkata; aku mendengar [Mujahid] berkata; telah menceritakan kepadaku [Abu Ma'mar] dia berkata; aku mendengar ['Abdullah] berkata; \"Rasulullah Shallallahu'alaihiwasallam mengajarkan kami cara tasyahud sebagaimana beliau mengajarkan kami suatu surat dari Al Qur'an-dan telapak tangannya di hadapannya-: 'At-tahiyyatut lillaahi wash-shalawaatu wath-thayyibaatu, assalaamu 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, assalaamu 'alainaa wa 'ala 'ibadillaahish-shaalihiin, asyhadu allaa ilaah illallaah wa asyhadu anna Muhamadan abduhu wa rasuuluh (penghormatan, rahmat dan kebaikan henya untuk Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak diibadahi selain Allah, dan Muhammad adalah hamba dan utusan-Nya)."
            },
            {
                "number": 1154,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو قُدَامَةَ السَّرْخَسِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَنِي قَتَادَةُ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ أَنَّ الْأَشْعَرِيَّ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَنَا فَعَلَّمَنَا سُنَّتَنَا وَبَيَّنَ لَنَا صَلَاتَنَا فَقَالَ أَقِيمُوا صُفُوفَكُمْ ثُمَّ لِيَؤُمَّكُمْ أَحَدُكُمْ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَالَ وَلَا الضَّالِّينَ فَقُولُوا آمِينَ يُجِبْكُمْ اللَّهُ وَإِذَا كَبَّرَ الْإِمَامُ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا فَإِنَّ الْإِمَامَ يَرْكَعُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ يَسْمَعْ اللَّهُ لَكُمْ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ عَلَى لِسَانِ نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ إِذَا كَبَّرَ الْإِمَامُ وَسَجَدَ فَكَبِّرُوا وَاسْجُدُوا فَإِنَّ الْإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ فَإِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ أَوَّلِ قَوْلِ أَحَدِكُمْ أَنْ يَقُولَ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id Abu Qudamah As Sarkhasi] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami [Hisyam] dia berkata; telah menceritakan kepada kami [Qatadah] dari [Yunus bin Jubair] dari [Hiththan bin 'Abdullah] bahwasanya [Al Asy'ari] berkata; \"Nabi Allah Shallallahu'alaihiwasallam pernah berkhutbah di hadapan kami, beliau menjelaskan sunnah dan mengajarkan cara sholat dengan bersabda: 'Jika kalian sholat maka luruskanlah barisan kalian, kemudian hendaklah salah seorang dari kalian menjadi imam. Bila imam bertakbir maka bertakbirlah kalian, dan bila imam mengucapkan, \"Waladl Dlaalliin\" maka ucapkan: \"Aamiin\" semoga Allah mengabulkan permohonan kalian. Jika imam bertakbir dan ruku' maka bertakbirlah dan rukulah, sesungguhnya imam ruku' dan mengangkat kepala dari ruku' sebelum kalian.-Nabi Shallallahu'alaihiwasallam bersabda: \"Gerakan imam harus kalian ikuti sesudahnya. Jika ia mengangkat (kepala dari ruku') dengan mengucapkan: \"Sami'allahu liman hamidah (Allah mendengar orang yang memuji-Nya) \"maka ucapkan: \"Allahumma rabbanaa wa lakal hamdu (Wahai Rabb kami, untuk-Mu segala puji) \" semoga Allah mendengar kalian. Sesungguhnya Allah berfirman dengan lisan Nabi Shallallahu'alaihi wasallam; \"Sami'allahu liman hamidah.\"Bila imam bertakbir dan sujud maka ikutlah bertakbir dan sujud, sesungguhnya imam bertakbir dan sujud sebelum kalian - Nabi Allah Shallallahu'alaihiwasallam bersabda: Gerakan Imam harus kalian ikuti sesudahnya-dan jika ia duduk maka yang pertama kali diucapkan oleh salah seorang dari kalian adalah: At-tahiyyatut-thayyibaatus-shalawaatu lillahi, As-salaamun 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, salaamun 'alaina wa 'ala 'ibadillahish-shaalihiin, asyhadu allaa ilaah illallaah wa asyhadu anna muhammadan abduhu wa rasuuluh (Penghormatan, rahmat dan kebaikan hanya untuk Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada Engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan Muhammad adalah hamba dan utusan-Nya).\""
            },
            {
                "number": 1155,
                "arab": "أَخْبَرَنَا أَبُو الْأَشْعَثِ أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ الْبَصْرِيُّ قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ حَدَّثَنَا أَبِي يُحَدِّثُ عَنْ قَتَادَةَ عَنْ أَبِي غَلَّابٍ وَهُوَ يُونُسُ بْنُ جُبَيْرٍ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِأَنَّهُمْ صَلَّوْا مَعَ أَبِي مُوسَى فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ أَوَّلِ قَوْلِ أَحَدِكُمْ التَّحِيَّاتُ لِلَّهِ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami [Abul Asy'ats Ahmad bin Al Miqdam Al 'Ijliy Al Bashriy] dia berkata; telah menceritakan kepada kami [Al Mu'tamir] dia berkata; [bapakku] telah menceritakan kepada kami dari [Qatadah] dari [Abu Ghallab Yunus bin Jubair] dari [Hiththan bin 'Abdullah] bahwasanya mereka sholat bersama [Abu Musa] maka dia berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Hendaklah yang pertama kali diucapkan oleh salah seorang diantara kalian ketika duduk adalah, At-tahiyyatu lillah At thayyibaatus-shalawaatu lillahi, As-salaamun 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, salaamun 'alaina wa 'ala 'ibadillahish-shaalihiin, asyhadu allaa ilaah illallaah wahdahu laa syarikalah, wa asyhadu anna muhammadan abduhu wa rasuuluh (Penghormatan, rahmat dan kebaikan hanya untuk Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada Engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah semata tiada sekutu bagi-Nya, dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya).\""
            },
            {
                "number": 1156,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ وَطَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا الْقُرْآنَ وَكَانَ يَقُولُ التَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ سَلَامٌ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ سَلَامٌ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits bin Sa'ad] dari [Abu Az Zubair] dari [Sa'id bin Jubair] dan [Thawus] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam mengajari kami tasyahud sebagaimana beliau mengajari kami Al Qur'an, beliau bersabda: 'At-tahiyyatul-Mubarakaatu-shalawaatut-thayyibaatu lillahi, Salaamun 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, salaamun 'alaina wa 'ala 'ibadillahish-shaalihiin, asyhadu allaa ilaah illallaah wa asyhadu anna muhammadan abduhu wa rasuuluh (Penghormatan, rahmat dan kebaikan hanya untuk Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada Engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya).\""
            },
            {
                "number": 1157,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ أَيْمَنَ وَهُوَ ابْنُ نَابِلٍ يَقُولُ حَدَّثَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنْ الْقُرْآنِ بِسْمِ اللَّهِ وَبِاللَّهِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَسْأَلُ اللَّهَ الْجَنَّةَ وَأَعُوذُ بِاللَّهِ مِنْ النَّارِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Al Mu'tamir] dia berkata; aku mendengar [Aiman bin Nabil] dia berkata; telah menceritakan kepadaku [Abu Az Zubair] dari [Jabir] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam mengajari kami tasyahud sebagaimana beliau mengajari kami surat dari Al Qur'an, dengan menyebut nama Allah dan demi Allah, At-tahiyyatu lillah -wash shalawaatu wat thayyibaat, As-salaamun 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakaatuh, salaamun 'alaina wa 'ala 'ibadillahish-shaalihiin, asyhadu allaa ilaah illallaah, wa asyhadu anna muhammadan abduhu wa rasuuluh as alullahal jannata wa a'udzu billahi minannar. (Penghormatan, rahmat dan kebaikan hanya untuk Allah. Semoga keselamatan, rahmat, dan keberkahan tetap ada pada Engkau wahai Nabi. Keselamatan juga semoga ada pada hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Dzat yang berhak disembah selain Allah, dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya. Aku memohon surgaNya kepada Allah dan aku berlindung kepada-Nya dari adzab neraka).\""
            },
            {
                "number": 1158,
                "arab": "أَخْبَرَنَا الْهَيْثَمُ بْنُ أَيُّوبَ الطَّالَقَانِيُّ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ حَدَّثَنَا أَبِي عَنْ أَبِي عُبَيْدَةَ بْنِ مَسْعُودٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّكْعَتَيْنِ كَأَنَّهُ عَلَى الرَّضْفِقُلْتُ حَتَّى يَقُومَ قَالَ ذَلِكَ يُرِيدُ",
                "id": "Telah mengabarkan kepada kami [Al Haitsam bin Ayyub Ath Thalaqaniy] dia berkata; telah menceritakan kepada kami [Ibrahim bin Sa'ad bin Ibrahim bin 'Abdurrahman bin 'Auf] dia berkata; [bapakku] telah menceritakan kepada kami dari [Abu 'Ubaidah bin Mas'ud] dari [bapaknya] dia berkata; Rasulullah Shalallahu 'Alaihi Wa sallam ketika hendak bangkit dari raka'at pertama beliau duduk seakan-akan berada di atas batu yang di panaskan, hingga beliau segera berdiri lagi."
            },
            {
                "number": 1159,
                "arab": "أَخْبَرَنِي يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ الْبَصْرِيُّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ ابْنِ بُحَيْنَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فَقَامَ فِي الشَّفْعِ الَّذِي كَانَ يُرِيدُ أَنْ يَجْلِسَ فِيهِ فَمَضَى فِي صَلَاتِهِ حَتَّى إِذَا كَانَ فِي آخِرِ صَلَاتِهِ سَجَدَ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ ثُمَّ سَلَّمَ",
                "id": "Telah mengabarkan kepadaku [Yahya bin Habib bin 'Arabiy Al Bashriy] dia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya] dari ['Abdurrahman Al A'raj] dari [Ibnu Buhainah]. Pernah Nabi Shalallahu 'Alaihi Wa sallam sholat. Saat beliau menyelesaikan rakaat genap (dua atau empat) dan berkehendak duduk, beliau terus melanjutkan sholatnya hingga ketika beliau sudah hampir selesai dari sholatnya, beliau sujud dua kali sebelum mengucapkan salam. Setelah itu beliau mengucapkan salam."
            },
            {
                "number": 1160,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ سَيْفٍ قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ ابْنِ بُحَيْنَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فَقَامَ فِي الرَّكْعَتَيْنِ فَسَبَّحُوا فَمَضَى فَلَمَّا فَرَغَ مِنْ صَلَاتِهِ سَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Abu Dawud Sulaiman bin Saif] dia berkata; telah menceritakan kepada kami [Wahab bin Jarir] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Sa'id] dari ['Abdurrahman Al A'raj] dari [Ibnu Buhainah] bahwa Nabi Shalallahu 'Alaihi Wa sallam sholat dua raka'at. Tiba-tiba beliau bangkit, orang-orangpun mengucapkan subhanallah, namun beliau tetap melanjutkan sholatnya hingga ketika beliau telah selesai sholatnya beliau sujud dua kali kemudian salam. "
            },
            {
                "number": 1161,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَصَمِّ قَالَسُئِلَ أَنَسُ بْنُ مَالِكٍ عَنْ التَّكْبِيرِ فِي الصَّلَاةِ فَقَالَ يُكَبِّرُ إِذَا رَكَعَ وَإِذَا سَجَدَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ السُّجُودِ وَإِذَا قَامَ مِنْ الرَّكْعَتَيْنِ فَقَالَ حُطَيْمٌ عَمَّنْ تَحْفَظُ هَذَا فَقَالَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا ثُمَّ سَكَتَ فَقَالَ لَهُ حُطَيْمٌ وَعُثْمَانُ قَالَ وَعُثْمَانُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari ['Abdurrahman bin Al Ashammi] dia berkata; [Anas bin Malik] pernah ditanya tentang takbir dalam sholat, lalu ia menjawab, 'Bertakbir jika hendak ruku', sujud, mengangkat kepala dari sujud, dan saat hendak bangkit dari rakaat kedua'. Huthaim berkata; 'Dari siapa kamu menghafal hal ini?\" la menjawab, 'Dari Nabi Shallallahu'alaihiwasallam, Abu Bakar, dan Umar radliallahu 'anhuma'. kemudian ia terdiam. Huthaim berkata kepadanya; 'Utsman juga? ' la menjawab; juga 'Utsman'.\""
            },
            {
                "number": 1162,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ حَدَّثَنَا غَيْلَانُ بْنُ جَرِيرٍ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ قَالَصَلَّى عَلِيُّ بْنُ أَبِي طَالِبٍ فَكَانَ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ يُتِمُّ التَّكْبِيرَ فَقَالَ عِمْرَانُ بْنُ حُصَيْنٍ لَقَدْ ذَكَّرَنِي هَذَا صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dia berkata; telah menceritakan kepada kami [Ghailan bin Jarir] dari [Muththarrif bin 'Abdullah] dia berkata; \"Ali bin Thalib ketika sholat dia bertakbir jika hendak turun, Jika hendak mengangkat kepalanya dari sujud ia juga bertakbir, dan ia menyempurnakan takbirnya.\" [Imran bin Hushain] berkata; \"Ini mengingatkanku kepada sholatnya Rasulullah Shalallahu 'Alaihi Wa Sallam.\""
            },
            {
                "number": 1163,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّقَالَ سَمِعْتُهُ يُحَدِّثُ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ السَّجْدَتَيْنِ كَبَّرَ وَرَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ كَمَا صَنَعَ حِينَ افْتَتَحَ الصَّلَاةَ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim Ad-Dauraqiy] dan [Muhammad bin Basysyar] -dan lafadz baginya- mereka berdua berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami ['Abdul Humaid bin Ja'far] dia berkata; telah menceritakan kepadaku [Muhammad bin 'Amr bin 'Atha] dari [Abu Humaid As Sa'idi] dia berkata; aku mendengarnya dia berkata; \"Rasulullah Shallallahu'alaihiwasallam bila bangun dari dua sujud maka beliau bertakbir dengan mengangkat kedua tangan hingga sejajar dengan kedua bahu, sebagaimana yang beliau perbuat saat mengawali sholat.\""
            },
            {
                "number": 1164,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ وَهُوَ ابْنُ عُمَرَ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَرْفَعُ يَدَيْهِ إِذَا دَخَلَ فِي الصَّلَاةِ وَإِذَا أَرَادَ أَنْ يَرْكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَإِذَا قَامَ مِنْ الرَّكْعَتَيْنِ يَرْفَعُ يَدَيْهِ كَذَلِكَ حَذْوَ الْمَنْكِبَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la Ash Shan'aniy] dia berkata; telah menceritakan kepada kami [Al Mu'tamir] dia berkata; aku mendengar ['ubaidhullah bin 'Umar] dari [Ibnu Syihab] dari [Salim] dari [Ibnu 'Umar] dari Rasulullah Shallallahu'alaihiwasallam, bahwa beliau mengangkat kedua tangan bila memulai sholat, ruku', serta jika mengangkat kepala dari ruku'. Dan jika berdiri dari dua rakaat maka beliau mengangkat kedua tangan sejajar dengan kedua bahu."
            },
            {
                "number": 1165,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ عُمَرَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَانْطَلَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصْلِحُ بَيْنَ بَنِي عَمْرِو بْنِ عَوْفٍ فَحَضَرَتْ الصَّلَاةُ فَجَاءَ الْمُؤَذِّنُ إِلَى أَبِي بَكْرٍ فَأَمَرَهُ أَنْ يَجْمَعَ النَّاسَ وَيَؤُمَّهُمْ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَقَ الصُّفُوفَ حَتَّى قَامَ فِي الصَّفِّ الْمُقَدَّمِ وَصَفَّحَ النَّاسُ بِأَبِي بَكْرٍ لِيُؤْذِنُوهُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ أَبُو بَكْرٍ لَا يَلْتَفِتُ فِي الصَّلَاةِ فَلَمَّا أَكْثَرُوا عَلِمَ أَنَّهُ قَدْ نَابَهُمْ شَيْءٌ فِي صَلَاتِهِمْ فَالْتَفَتَ فَإِذَا هُوَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَوْمَأَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْ كَمَا أَنْتَ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ رَجَعَ الْقَهْقَرَى وَتَقَدَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى فَلَمَّا انْصَرَفَ قَالَ لِأَبِي بَكْرٍ مَا مَنَعَكَ إِذْ أَوْمَأْتُ إِلَيْكَ أَنْ تُصَلِّيَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ مَا كَانَ يَنْبَغِي لِابْنِ أَبِي قُحَافَةَ أَنْ يَؤُمَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ لِلنَّاسِ مَا بَالُكُمْ صَفَّحْتُمْ إِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ ثُمَّ قَالَ إِذَا نَابَكُمْ شَيْءٌ فِي صَلَاتِكُمْ فَسَبِّحُوا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Bazi'] dia berkata; telah menceritakan kepada kami ['Abdul A'la bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami ['ubaidhullah bin 'Umar] dari [Abu Hazim] dari [Sahl bin Sa'ad] dia berkata; Pernah Rasulullah Shallallahu'alaihiwasallam pergi untuk mendamaikan Bani Amru bin Auf yang mempunyai suatu masalah. Ketika' tiba waktu sholat, muadzin datang kepada Abu Bakar dan menyuruhnya mengumpulkan orang-orang dan mengimami mereka. Kemudian datang Rasulullah Shallallahu'alaihiwasallam melalui celah-celah barisan sholat hingga beliau Shallallahu'alaihiwasallam berdiri di barisan terdepan. Orang-orang lalu mulai menepukkan tangannya kepada Abu Bakar untuk memberitahu keberadaan Rasulullah Shallallahu'alaihiwasallam, namun Abu Bakar tidak menoleh dalam sholatnya. Setelah orang-orang banyak yang menepukkan tangannya (sebagai isyarat), Abu Bakar tahu bahwa mereka mengingatkan sesuatu, maka ia menoleh dan mendapati Rasulullah Shallallahu'alaihiwasallam. Rasulullah Shallallahu'alaihiwasallam mengisyaratkan kepadanya untuk terus melanjutkan sholatnya. Maka Abu Bakar mengangkat kedua tangannya dan memuji Allah dengan ucapan Rasulullah Shallallahu'alaihiwasallam lantas mundur ke belakang, maka Rasulullah Shallallahu'alaihiwasallam maju untuk menjadi imam. Setelah selesai sholat beliau Shallallahu'alaihiwasallam bertanya kepada Abu Bakar, 'Wahai Abu Bakar, apakah yang menghalangimu untuk sholat menjadi imam bagi manusia saat kuisyaratkan demikian? ' Abu Bakar berkata; 'Tidaklah pantas bagi Ibnu Quhafah untuk mengimami sholat Rasulullah Shallallahu'alaihi wasallam'. Kemudian beliau Shallallahu'alaihiwasallam bersabda kepada orang-orang: 'Wahai manusia sekalian, kenapa kalian bertepuk tangan. Tepuk tangan hanya untuk wanita. Jika terjadi sesuatu dalam sholat kalian, maka ucapkan, \"Subhanallah (Maha suci Allah).\""
            },
            {
                "number": 1166,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْثَرٌ عَنْ الْأَعْمَشِ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ رَافِعُو أَيْدِينَا فِي الصَّلَاةِ فَقَالَ مَا بَالُهُمْ رَافِعِينَ أَيْدِيَهُمْ فِي الصَّلَاةِ كَأَنَّهَا أَذْنَابُ الْخَيْلِ الشُّمُسِ اسْكُنُوا فِي الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami ['Abtsar] dari [Al A'masy] dari [Al Musayyib bin Rafi'] dari [Tamim bin Tharafah] dari [Jabir bin Samurah] dia berkata; dia berkata; \"Rasulullah Shallallahu'alaihiwasallam menemui kami dan kami dalam keadaan mengangkat tangan saat sholat, maka beliau bersabda: 'Kenapa mereka? Mereka mengangkat tangan-tangan mereka saat sholat laksana ekor-ekor kuda liar (yang tidak bisa diam), Tenanglah kalian dalam sholat'.\""
            },
            {
                "number": 1167,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ مِسْعَرٍ عَنْ عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكُنَّا نُصَلِّي خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُسَلِّمُ بِأَيْدِينَا فَقَالَ مَا بَالُ هَؤُلَاءِ يُسَلِّمُونَ بِأَيْدِيهِمْ كَأَنَّهَا أَذْنَابُ خَيْلٍ شُمُسٍ أَمَا يَكْفِي أَحَدُهُمْ أَنْ يَضَعَ يَدَهُ عَلَى فَخِذِهِ ثُمَّ يَقُولَ السَّلَامُ عَلَيْكُمْ السَّلَامُ عَلَيْكُمْ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami [Yahya bin Adam] dari [Mis'ar] dari ['ubaidhullah bin Al Qibthiyyah] dari [Jabir bin Samurah] dia berkata; \"Kami pernah sholat di belakang Rasulullah Shallallahu'alaihiwasallam, lalu kami memberi salam dengan tangan-tangan kami, maka beliau bersabda: 'Kenapa mereka memberi salam dengan tangan-tangan mereka? Mereka laksana ekor-ekor kuda liar! Cukuplah salah seorang dari mereka meletakkan tangannya di atas pahanya kemudian mengucapkan, \"Assalamu 'alaikum, assalamu 'alaikum.\""
            },
            {
                "number": 1168,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ نَابِلٍ صَاحِبِ الْعَبَاءِ عَنْ ابْنِ عُمَرَ عَنْ صُهَيْبٍ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَمَرَرْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَيَّ إِشَارَةً وَلَا أَعْلَمُ إِلَّا أَنَّهُ قَالَ بِإِصْبَعِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Bukair] dari [Nabil] -sahabat Al 'Aba- dari [Ibnu 'Umar] dari [Shuhaib] sahabat Rasulullah Shallallahu'alaihiwasallam dia berkata; \"Aku pernah melewati Rasulullah Shallallahu'alaihiwasallam yang sedang sholat, lalu aku mengucapkan salam kepada beliau, dan beliau membalasnya dengan isyarat tangan. Setahuku beliau tidak mengucapkan apa-apa selain memberi isyarat dengan tangan. "
            },
            {
                "number": 1169,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الْمَكِّيُّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ زَيْدِ ابْنِ أَسْلَمَ قَالَ قَالَ ابْنُ عُمَرَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسْجِدَ قُبَاءَ لِيُصَلِّيَ فِيهِ فَدَخَلَ عَلَيْهِ رِجَالٌ يُسَلِّمُونَ عَلَيْهِ فَسَأَلْتُ صُهَيْبًا وَكَانَ مَعَهُ كَيْفَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ إِذَا سُلِّمَ عَلَيْهِ قَالَ كَانَ يُشِيرُ بِيَدِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur Al Makkiy] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Zaid bin Aslam] dia berkata; [Ibnu 'Umar] berkata; \"Nabi Shallallahu'alaihiwasallam masuk ke dalam masjid Quba untuk sholat di dalamnya, lalu ada beberapa orang yang mengucapkan salam kepada beliau. Aku lalu bertanya kepada [Shuhaib] -ia saat itu bersama Rasulullah Shallallahu'alaihiwasallam-, 'Bagaimana Rasulullah Shallallahu'alaihiwasallam berbuat tatkala ada yang memberi salam kepadanya? ' la menjawab, \"Beliau Shallallahu'alaihiwasallam menjawab dengan isyarat tangannya.\""
            },
            {
                "number": 1170,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا وَهْبٌ يَعْنِي ابْنَ جَرِيرٍ قَالَ حَدَّثَنَا أَبِي عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَمَّارِ بْنِ يَاسِرٍأَنَّهُ سَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَرَدَّ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Busysyar] dia berkata; telah menceritakan kepada kami [Wahab bin Jarir] dia berkata; [bapakku] telah menceritakan kepada kami dari [Qais bin Sa'ad] dari ['Atha] dari [Muhammad bin 'Ali] dari ['Ammar bin Yasir] bahwa ia pernah mengucapkan salam kepada Rasulullah Shallallahu'alaihiwasallam saat beliau sedang sholat, dan beliau Shallallahu'alaihiwasallam membalas salamnya."
            },
            {
                "number": 1171,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَةٍ ثُمَّ أَدْرَكْتُهُ وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَأَشَارَ إِلَيَّ فَلَمَّا فَرَغَ دَعَانِي فَقَالَ إِنَّكَ سَلَّمْتَ عَلَيَّ آنِفًا وَأَنَا أُصَلِّي وَإِنَّمَا هُوَ مُوَجَّهٌ يَوْمَئِذٍ إِلَى الْمَشْرِقِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam pernah mengutusku untuk suatu keperluan beliau, dan kudapati beliau sedang sholat. Aku mengucapkan salam kepada beliau dan beliau memberi isyarat kepadaku. Ketika selesai sholat beliau memanggilku dan berkata: 'Kamu tadi mengucapkan salam kepadaku sementara aku sedang sholat'. Ketika itu beliau menghadap timur.\""
            },
            {
                "number": 1172,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ الْبَعْلَبَكِّيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورَ عَنْ عَمْرِو بْنِ الْحَارِثِ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَبَعَثَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ وَهُوَ يَسِيرُ مُشَرِّقًا أَوْ مُغَرِّبًا فَسَلَّمْتُ عَلَيْهِ فَأَشَارَ بِيَدِهِ ثُمَّ سَلَّمْتُ عَلَيْهِ فَأَشَارَ بِيَدِهِ فَانْصَرَفْتُ فَنَادَانِي يَا جَابِرُ فَنَادَانِي النَّاسُ يَا جَابِرُ فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَلَّمْتُ عَلَيْكَ فَلَمْ تَرُدَّ عَلَيَّ قَالَ إِنِّي كُنْتُ أُصَلِّي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hasyim Al Ba'labakiy] dia berkata; telah menceritakan kepada kami [Muhammad bin Syu'aib bin Syabur] dari ['Amr bin Al Harits] dia berkata; Telah mengabarkan kepadaku [Abu Az Zubair] dari [Jabir], dia berkata; \"Rasulullah Shallallahu'alaihiwasallam mengutusku, lalu aku datang kepadanya, dan beliau sedang berjalan ke timur atau barat, maka aku mengucapkan salam kepadanya dan beliau Shallallahu'alaihiwasallam memberi isyarat dengan tangannya. Kemudian aku mengucapkan salam kepadanya dan beliau Shallallahu'alaihiwasallam memberi isyarat dengan tangannya. Lalu aku pergi, namun beliau Shallallahu'alaihiwasallam memanggilku, 'Wahai Jabir'. Orang-orang pun ikut memanggilku, 'Wahai Jabir'. Lalu aku mendatanginya dan kukatakan, 'Wahai Rasulullah Shallallahu'alaihiwasallam, aku memberi salam kepada engkau tetapi engkau tidak membalasnya! ' Beliau Shallallahu'alaihiwasallam berkata: 'Aku sedang sholat\""
            },
            {
                "number": 1173,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَالْحُسَيْنُ بْنُ حُرَيْثٍ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ فِي الصَّلَاةِ فَلَا يَمْسَحْ الْحَصَى فَإِنَّ الرَّحْمَةَ تُوَاجِهُهُ",
                "id": "Telah mengkhabarkan kepada kami [Qutaibah bin Sa'id] dan [Al Husain bin Harits] -dan lafadz ini miliknya- dari [Sufyan] dari [Az Zuhri] dari [Abu Al Ahwash] dari [Abu Dzarr] dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Apabila salah seorang diantara kalian sholat, jangan menghapus batu-batu kerikil kecil (di waktu sujud), karena hal itu akan menghalanginya dari mendapat Rahmat Allah.\""
            },
            {
                "number": 1174,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي مُعَيْقِيبٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَمَرَّةً",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdulah bin Al Mubarak] dari [Al Auza'i] dari [Yahya bin Abi Katsir] dia berkata; telah menceritakan kepadaku [Abu Salamah bin 'Abdurrahman] dia berkata; telah menceritakan kepada kami [Mu'aiqib] bahwasanya Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika engkau memang harus melakukannya, maka lakukanlah sekali saja.\""
            },
            {
                "number": 1175,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَشُعَيْبُ بْنُ يُوسُفَ عَنْ يَحْيَى وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا بَالُ أَقْوَامٍ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ فِي صَلَاتِهِمْ فَاشْتَدَّ قَوْلُهُ فِي ذَلِكَ حَتَّى قَالَ لَيَنْتَهُنَّ عَنْ ذَلِكَ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dan [Syu'aib bin Yusuf] dari [Yahya bin Sa'id Al Qaththan] dari [Ibnu Abu 'Arubah] dari [Qatadah] dari [Anas bin Malik] bahwasanya Rasulullah Shallallahu'alaihiwasallam bersabda: \"Kenapa orang-orang mengangkat pandangan ke langit saat sholat?\" Suara beliau meninggi ketika mengucapkan hal itu, hingga beliau berkata, \"Berhentilah dari hal itu, atau pandangan mereka akan hilang.\" "
            },
            {
                "number": 1176,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا كَانَ أَحَدُكُمْ فِي الصَّلَاةِ فَلَا يَرْفَعْ بَصَرَهُ إِلَى السَّمَاءِ أَنْ يُلْتَمَعَ بَصَرُهُ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Yunus] dari [Ibnu Syihab] dari ['ubaidhullah bin 'Abdullah] bahwasanya [seorang laki-laki] sahabat nabi Shallallahu'alaihiwasallam bercerita kepadanya ia mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika salah seorang dari kalian sholat, janganlah memandang ke langil (ke atas) dikhawatirkun pandangannya akan tersambar."
            },
            {
                "number": 1177,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُ أَبَا الْأَحْوَصِ يُحَدِّثُنَا فِي مَجْلِسِ سَعِيدِ ابْنِ الْمُسَيَّبِ وَابْنُ الْمُسَيَّبِ جَالِسٌ أَنَّهُ سَمِعَ أَبَا ذَرٍّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ اللَّهُ عَزَّ وَجَلَّ مُقْبِلًا عَلَى الْعَبْدِ فِي صَلَاتِهِ مَا لَمْ يَلْتَفِتْ فَإِذَا صَرَفَ وَجْهَهُ انْصَرَفَ عَنْهُ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah bin Al Mubarak] dari [Yunus] dari [Az Zuhri] dia berkata; aku mendengar [Abu Al Ahwash] menceritakan kepada kami di majlis Sa'id bin Al Musayyib dan Ibnu Al Musayyib waktu itu sedang duduk mendengar [Abu Dzarr] berkata; Rasululllah Shallallahu'alaihiwasallam bersabda: \"Allah Azza wa Jalla akan selalu menghadap seorang hamba ketika dia sholat selagi hamba tersebut tidak menoleh, apabila dia menoleh maka Allah pun berpaling darinya.\""
            },
            {
                "number": 1178,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا زَائِدَةُ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الِالْتِفَاتِ فِي الصَّلَاةِ فَقَالَ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ الصَّلَاةِأَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَشْعَثَ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِي عَطِيَّةَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Zaidah] dari [Asy'ats bin Abu Asy Sya'tsa] dari [bapaknya] dari [Masruq] dari ['Aisyah] Radliyallahu'anha dia berkata; \"Aku bertanya kepada Rasulullah Shallallahu'alaihiwasallam tentang menoleh saat sholat, lalu beliau menjawab: 'Itu adalah pencopetan (perampasan) yang dilakukan oleh setan dari sholat'.\" Telah mengabarkan kepada kami Amr bin Ali dia berkata; Telah menceritakan kepada kami Abdurrahman dia berkata; Telah menceritakan Abul Ahwash dari Asy'ats dari Bapaknya dari Masruq dari Aisyah dari Nabi shallallahu 'alaihi wasallam dengan hadis yang semisal tadi. Telah mengabarkan kepada kami Amr bin Ali dia berkata; Telah menceritakan kepada kami Abdurrahman dia berkata; Telah menceritakan kepada kami Israil dari Asy'ats bin Abu Sya'tsa dari Abu Athiyyah dari Masruq dari Aisyah dari Nabi shallallahu 'alaihi wasallam dengan hadis seperti itu juga."
            },
            {
                "number": 1179,
                "arab": "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ بْنِ هِلَالٍ قَالَ حَدَّثَنَا الْمُعَافَى بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا الْقَاسِمُ وَهُوَ ابْنُ مَعْنٍ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ عَنْ أَبِي عَطِيَّةَ قَالَ قَالَتْ عَائِشَةُإِنَّ الِالْتِفَاتَ فِي الصَّلَاةِ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Hilal bin Al 'Ala bin Hilal] dia berkata; telah menceritakan kepada kami [Al Mu'afa bin Sulaiman] dia berkata; telah menceritakan kepada kami [Al Qasim bin Ma'an] dari [Al A'masy] dari ['Umarah] dari [Abu 'Athiyyah] dia berkata; ['Aisyah'] berkata; \"Menoleh dalam sholat adalah pencopetan (perampasan) yang dilakukan oleh setan dari sholat.\""
            },
            {
                "number": 1180,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُ قَالَاشْتَكَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّيْنَا وَرَاءَهُ وَهُوَ قَاعِدٌ وَأَبُو بَكْرٍ يُكَبِّرُ يُسْمِعُ النَّاسَ تَكْبِيرَهُ فَالْتَفَتَ إِلَيْنَا فَرَآنَا قِيَامًا فَأَشَارَ إِلَيْنَا فَقَعَدْنَا فَصَلَّيْنَا بِصَلَاتِهِ قُعُودًا فَلَمَّا سَلَّمَ قَالَ إِنْ كُنْتُمْ آنِفًا تَفْعَلُونَ فِعْلَ فَارِسَ وَالرُّومِ يَقُومُونَ عَلَى مُلُوكِهِمْ وَهُمْ قُعُودٌ فَلَا تَفْعَلُوا ائْتَمُّوا بِأَئِمَّتِكُمْ إِنْ صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِنْ صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir] dia berkata; \"Ketika Rasulullah Shallallahu'alaihiwasallam sakit, kami sholat di belakangnya dan beliau dalam keadaan duduk, sedangkan Abu Bakar memperdengarkan takbirnya kepada orang-orang, maka beliau menoleh kepada kami dan melihat kami dalam keadaan berdiri. Beliau lalu mengisyaratkan kepada kami agar kami sholat dengan duduk. Setelah salam (selesai) beliau bersabda: 'Jika kalian seperti tadi, maka kalian melakukan perbuatan orang-orang Persia dan Romawi; mereka berdiri kepada raja-raja mereka yang sedang duduk. Janganlah kalian melakukan hal itu. Ikutilah imam-imam kalian, jika ia sholat dengan berdiri maka sholatlah dengan berdiri, dan jika ia sholat dengan duduk maka sholatlah dengan duduk'.\""
            },
            {
                "number": 1181,
                "arab": "أَخْبَرَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ بْنُ أَبِي هِنْدٍ عَنْ ثَوْرِ بْنِ زَيْدٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْتَفِتُ فِي صَلَاتِهِ يَمِينًا وَشِمَالًا وَلَا يَلْوِي عُنُقَهُ خَلْفَ ظَهْرِهِ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ammar Al Husain bin Huraits] dia berkata; telah menceritakan kepada kami [Al Fadhl bin Musa] dari ['Abdullah bin Sa'id bin Abu Hindun] dari [Tsaur bin Zaid] dari ['Ikrimah] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam pernah menoleh ke kanan dan ke kiri dalam sholatnya, dan beliau tidak memutar lehernya ke belakang punggungnya.\""
            },
            {
                "number": 1182,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ سُفْيَانَ وَيَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ ضَمْضَمِ بْنِ جَوْسٍ عَنْ أَبِي هُرَيْرَةَ قَالَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْأَسْوَدَيْنِ فِي الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Sufyan] dan [Yazid bin Zurai'] dari [Ma'mar] dari [Yahya bin Abu Katsir] dari [Dhamdham bin Jaus] dari [Abu Hurairah] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam memerintahkan untuk membunuh aswadain (dua hewan hitam, ular dan kalajengking) saat sholat.\""
            },
            {
                "number": 1183,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو دَاوُدَ قَالَ حَدَّثَنَا هِشَامٌ وَهُوَ ابْنُ أَبِي عَبْدِ اللَّهِ عَنْ مَعْمَرٍ عَنْ يَحْيَى عَنْ ضَمْضَمٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْأَسْوَدَيْنِ فِي الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah menceritakan kepada kami [Sulaiman bin Dawud Abu Dawud] dia berkata; telah menceritakan kepada kami [Hisyam bin Abu 'Abdullah] dari [Ma'mar] dari [Yahya] dari [Dhamdham] dari [Abu Hurairah] dia berkata: \"Rasulullah Shallallahu'alaihiwasallam memerintahkan untuk membunuh aswadain (dua hewan hitam, ular dan kalajengking) saat sholat.\""
            },
            {
                "number": 1184,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ أَبِي قَتَادَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي وَهُوَ حَامِلٌ أُمَامَةَ فَإِذَا سَجَدَ وَضَعَهَا وَإِذَا قَامَ رَفَعَهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Malik] dari ['Amir bin 'Abdullah bin Az Zubair] dari ['Amr bin Sulaim] dari [Abu Qatadah] bahwa Rasulullah Shallallahu'alaihiwasallam sholat dengan menggendong Umamah, apabila sujud maka beliau meletakkannya, dan jika berdiri maka beliau mengangkatnya kembali."
            },
            {
                "number": 1185,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ أَبِي قَتَادَةَ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّ النَّاسَ وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ عَلَى عَاتِقِهِ فَإِذَا رَكَعَ وَضَعَهَا فَإِذَا فَرَغَ مِنْ سُجُودِهِ أَعَادَهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Utsman bin Abi Sulaiman] dari ['Amir bin 'Abdullah bin Az Zubair] dari ['Amr bin Sulaim] dari [Abu Qatadah] dia berkata; \"Aku melihat Rasulullah Shallallahu'alaihiwasallam mengimami sholat manusia dengan menggendong Umamah binti Abu Al Ash di pundaknya. Jika ruku' maka beliau meletakkannya dan ketika selesai dari sujud maka beliau menggendongnya kembali.\""
            },
            {
                "number": 1186,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ قَالَ حَدَّثَنَا بُرْدُ بْنُ سِنَانٍ أَبُو الْعَلَاءِ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْاسْتَفْتَحْتُ الْبَابَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي تَطَوُّعًا وَالْبَابُ عَلَى الْقِبْلَةِ فَمَشَى عَنْ يَمِينِهِ أَوْ عَنْ يَسَارِهِ فَفَتَحَ الْبَابَ ثُمَّ رَجَعَ إِلَى مُصَلَّاهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Hatim bin Wardan] dia berkata; Telah menceritakan kepada kami [Burd bin Sinan Abu Al 'Alaa] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata; \"Aku membuka pintu dan Rasulullah Shallallahu'alaihiwasallam sedang sholat sunnah, sedangkan pintu-berada-di arah kiblat, lalu beliau berjalan ke kanan atau ke kirinya, lantas beliau membuka pintu kemudian kembali ke tempat sholatnya.\""
            },
            {
                "number": 1187,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ زَادَ ابْنُ الْمُثَنَّى فِي الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Qatadah] dan [Muhammad bin Al Mutsanna] -dan lafad ini miliknya- mereka berdua berkatan; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi Shallallahu'alaihiwasallam, beliau bersabda: \"Bertasbih (mengucap subhanallah) adalah bagi laki-laki dan tepuk tangan adalah bagi perempuan.\" -Ibnu Mutsanna menambahkan; -saat sholat\"-."
            },
            {
                "number": 1188,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Sa'id bin Al Musayyab] dan [Abu Salamah bin 'Abdurrahman] bahwasanya keduanya mendengar [Abu Hurairah] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Bertasbih (mengucap subhanallah) adalah bagi laki-laki dan tepuk tangan bagi perempuan.\""
            },
            {
                "number": 1189,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْفُضَيْلُ بْنُ عِيَاضٍ عَنْ الْأَعْمَشِ ح وَأَنْبَأَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Fudhail bin 'Iyadh] dari [Al A'masy] -lewat jalur periwayatan lain-- dan telah memberitakan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Sulaiman Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah Shallallahu'alaihiwasallam bersabda; \"Bertasbih bagi laki-laki dan lepuk tangan bagi perempuan.\""
            },
            {
                "number": 1190,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَوْفٍ قَالَ حَدَّثَنِي مُحَمَّدٌ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Auf] dia berkata; telah menceritakan kepadaku [Muhammad] dari [Abu Hurairah] dari Rasulullah Shallallahu'alaihiwasallam beliau bersabda; \"Bertasbih bagi laki-laki dan bertepuk tangan bagi perempuan.\""
            },
            {
                "number": 1191,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ الْمُغِيرَةِ عَنْ الْحَارِثِ الْعُكْلِيِّ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُجَيٍّ عَنْ عَلِيٍّ قَالَكَانَ لِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَاعَةٌ آتِيهِ فِيهَا فَإِذَا أَتَيْتُهُ اسْتَأْذَنْتُ إِنْ وَجَدْتُهُ يُصَلِّي فَتَنَحْنَحَ دَخَلْتُ وَإِنْ وَجَدْتُهُ فَارِغًا أَذِنَ لِي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] dia berkata; telah menceritakan kepada kami [Jarir] dari [Al Mughirah] dari [Al Harits Al 'Ukliy] dari [Abu Zur'ah bin 'Amr bin Jarir] dia berkata; telah menceritakan kepada kami ['Abdullah bin Nujayy] dari ['Ali] dia berkata; \"Aku mempunyai satu saat dari Rasulullah Shalallahu 'Alaihi Wa Sallam untuk menemuinya. Apabila aku menemuinya aku meminta izin terlebih dahulu. Jika beliau sedang sholat, maka beliau berdehem -sebagai tanda beliau merasa keberatan- aku masuk. Dan jika beliau sedang longgar, beliau mempersilahkanku.\""
            },
            {
                "number": 1192,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا ابْنُ عَيَّاشٍ عَنْ مُغِيرَةَ عَنْ الْحَارِثِ الْعُكْلِيِّ عَنْ ابْنِ نُجَيٍّ قَالَ قَالَ عَلِيٌّكَانَ لِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَدْخَلَانِ مَدْخَلٌ بِاللَّيْلِ وَمَدْخَلٌ بِالنَّهَارِ فَكُنْتُ إِذَا دَخَلْتُ بِاللَّيْلِ تَنَحْنَحَ لِي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ubaid] dia berkata; telah menceritakan kepada kami [Ibnu 'Ayyasy] dari [Mughirah] dari [Al Harits Al 'Ukliy] dari [Ibnu Nujayy] dia berkata; ['Ali] berkata; Aku mempunyai dua kesempatan dari Rasulullah Shalallahu 'Alaihi Wa Sallam untuk menemuinya. Yaitu kesempatan di malam hari dan kesempatan di siang hari. Apabila aku menemuinya di waktu malam, beliau berdehem kepadaku.\""
            }
        ]
    }
}