{
    "status": true,
    "data": {
        "start": 4322,
        "end": 4470,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 4322,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي رَافِعٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا فَأَتَاهُ يَتَقَاضَاهُ بَكْرَهُ فَقَالَ لِرَجُلٍ انْطَلِقْ فَابْتَعْ لَهُ بَكْرًا فَأَتَاهُ فَقَالَ مَا أَصَبْتُ إِلَّا بَكْرًا رَبَاعِيًا خِيَارًا فَقَالَ أَعْطِهِ فَإِنَّ خَيْرَ الْمُسْلِمِينَ أَحْسَنُهُمْ قَضَاءً",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali], ia berkata; telah menceritakan kepada kami [Abdur Rahman], ia berkata; telah menceritakan kepada kami [Malik] dari [Zaid bin Aslam] dari ['Atho` bin Yasar] dari [Abu Rafi'] bahwa Rasulullah shallallahu 'alaihi wasallam menghutang unta muda kepada seseorang, kemudian orang tersebut datang kepada beliau menuntut unta mudanya, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepada seseorang: \"Pergilah dan belikan untuknya unta muda.\" Kemudian orang tersebut datang kepada beliau dan berkata; saya tidak mendapatkan kecuali unta muda yang berumur empat tahun. Kemudian beliau bersabda: \"Berikan kepadanya sesungguhnya sebaik-baik orang muslim adalah orang yang paling baik dalam membayar.\""
            },
            {
                "number": 4323,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ لِرَجُلٍ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِنٌّ مِنْ الْإِبِلِ فَجَاءَ يَتَقَاضَاهُ فَقَالَ أَعْطُوهُ فَلَمْ يَجِدُوا إِلَّا سِنًّا فَوْقَ سِنِّهِ قَالَ أَعْطُوهُ فَقَالَ أَوْفَيْتَنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ خِيَارَكُمْ أَحْسَنُكُمْ قَضَاءً",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur], ia berkata; telah menceritakan kepada kami [Abu Nu'aim], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Abu Salamah] dari [Abu Hurairah], ia berkata; dahulu terdapat seseorang yang memiliki hak atas Rasulullah shallallahu 'alaihi wasallam berupa unta satu tahun, lalu ia datang kepada beliau menuntut, kemudian beliau bersabda: \"Berilah ia.\" Kemudian mereka tidak mendapatkan kecuali yang berumur di atas umur unta tersebut. Beliau bersabda: \"Berikan kepadanya.\" Orang tersebut berkata; engkau telah memenuhi hakku. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sebaik-baik kalian adalah yang paling baik membayarnya.\" "
            },
            {
                "number": 4324,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ هَانِئٍ يَقُولُ سَمِعْتُ عِرْبَاضَ بْنَ سَارِيَةَ يَقُولُبِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَكْرًا فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ أَجَلْ لَا أَقْضِيكَهَا إِلَّا نَجِيبَةً فَقَضَانِي فَأَحْسَنَ قَضَائِي وَجَاءَهُ أَعْرَابِيٌّ يَتَقَاضَاهُ سِنَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطُوهُ سِنًّا فَأَعْطَوْهُ يَوْمَئِذٍ جَمَلًا فَقَالَ هَذَا خَيْرٌ مِنْ سِنِّي فَقَالَ خَيْرُكُمْ خَيْرُكُمْ قَضَاءً",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdur Rahman bin Mahdi], ia berkata; telah menceritakan kepada kami [Mu'awiyah bin Shalih] ia berkata; saya mendengar [Sa'id bin Hani'] berkata; saya mendengar ['Irbadh bin Sariyah] berkata; saya menjual kepada Rasulullah shallallahu 'alaihi wasallam seekor unta muda. Lalu saya mendatangi beliau menuntut anak unta itu, beliau bersabda: \" Baiklah aku tidak akan membayarnya kepadamu kecuali dengan seekor unta yang berharga, \" lalu beliau membayarku dengan pembayaran yang terbaik, kemudian datanglah kepada beliau seorang badui menuntut seekor unta yang berumur kepada beliau, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \" berikan unta kepadanya, \" lalu mereka pada hari itu memberikan unta, lalu ia berkata; ini lebih baik dari untaku, kemudian beliau bersabda: \" sebaik-baik kalian adalah yang paling baik membayarnya.\""
            },
            {
                "number": 4325,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَيَزِيدُ بْنُ زُرَيْعٍ وَخَالِدُ بْنُ الْحَارِثِ قَالُوا حَدَّثَنَا شُعْبَةُ و أَخْبَرَنِي أَحْمَدُ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali], ia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dan [Yazid bin Zurai'] dan [Khalid bin Al Harits] mereka berkata; telah menceritakan kepada kami [Syu'bah] dan telah mengabarkan kepadaku [Ahmad bin Fadhalah bin Ibrahim], ia berkata; telah menceritakan kepada kami ['ubaidhullah bin Musa], ia berkata; telah menceritakan kepada kami [Al Hasan bin Shalih] dari [Ibnu Abu 'Arubah] dari [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual hewan dengan hewan secara kredit."
            },
            {
                "number": 4326,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَجَاءَ عَبْدٌ فَبَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْهِجْرَةِ وَلَا يَشْعُرُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ عَبْدٌ فَجَاءَ سَيِّدُهُ يُرِيدُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعْنِيهِ فَاشْتَرَاهُ بِعَبْدَيْنِ أَسْوَدَيْنِ ثُمَّ لَمْ يُبَايِعْ أَحَدًا بَعْدُ حَتَّى يَسْأَلَهُ أَعَبْدٌ هُوَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir], ia berkata; telah datang seorang budak kemudian membai'at Rasulullah shallallahu 'alaihi wasallam untuk melakukan hijrah, dan Nabi shallallahu 'alaihi wasallam tidak merasakan bahwa ia adalah seorang budak. Kemudian tuannya datang menginginkannya. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Juallah dia kepadaku.\" Kemudian beliau membelinya dengan dua orang budak hitam, kemudian beliau tidak membai'at seseorang hingga bertanya kepadanya apakah ia budak? "
            },
            {
                "number": 4327,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَيُّوبَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ السَّلَفُ فِي حَبَلِ الْحَبَلَةِ رِبًا",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hakim], ia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Ayyub] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari Nabi beliau bersabda: \"salaf (mendahulukan pembayaran dan mengakhirkan barang pembelian) dalam hablil hablah (menjual janin yang nantinya ada dalam janin unta) adalah riba.\""
            },
            {
                "number": 4328,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Sa'id bin Jubair] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual janin yang ada dalam janin unta. "
            },
            {
                "number": 4329,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual janin yang ada dalam janin unta."
            },
            {
                "number": 4330,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ وَكَانَ بَيْعًا يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ كَانَ الرَّجُلُ يَبْتَاعُ جَزُورًا إِلَى أَنْ تُنْتِجَ النَّاقَةُ ثُمَّ تُنْتِجُ الَّتِي فِي بَطْنِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melarang dari melarang dari menjual hablul hablah, dan hal itu merupakan jual beli yang dilakukan orang-orang ahli Jahiliyah, yaitu seseorang membeli unta sembelihan hingga waktu unta melahirkan dan anaknya yang ada dalam perutnya itupun melahirkan"
            },
            {
                "number": 4331,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ السِّنِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual hingga beberapa tahun. "
            },
            {
                "number": 4332,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ سُلَيْمَانَ وَهُوَ ابْنُ عَتِيقٍ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ السِّنِينَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Humaid Al A'raj] dari [Sulaiman yaitu Ibnu 'Atiq] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual hingga beberapa tahun. "
            },
            {
                "number": 4333,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا عُمَارَةُ بْنُ أَبِي حَفْصَةَ قَالَ أَنْبَأَنَا عِكْرِمَةُ عَنْ عَائِشَةَ قَالَتْكَانَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُرْدَيْنِ قِطْرِيَّيْنِ وَكَانَ إِذَا جَلَسَ فَعَرِقَ فِيهِمَا ثَقُلَا عَلَيْهِ وَقَدِمَ لِفُلَانٍ الْيَهُودِيِّ بَزٌّ مِنْ الشَّأْمِ فَقُلْتُ لَوْ أَرْسَلْتَ إِلَيْهِ فَاشْتَرَيْتَ مِنْهُ ثَوْبَيْنِ إِلَى الْمَيْسَرَةِ فَأَرْسَلَ إِلَيْهِ فَقَالَ قَدْ عَلِمْتُ مَا يُرِيدُ مُحَمَّدٌ إِنَّمَا يُرِيدُ أَنْ يَذْهَبَ بِمَالِي أَوْ يَذْهَبَ بِهِمَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَذَبَ قَدْ عَلِمَ أَنِّي مِنْ أَتْقَاهُمْ لِلَّهِ وَآدَاهُمْ لِلْأَمَانَةِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali], ia berkata; telah menceritakan kepada kami [Yazid bin Zurai'], ia berkata; telah menceritakan kepada kami ['Umarah bin Abu Hafshah], ia berkata; telah memberitakan kepada kami ['Ikrimah] dari ['Aisyah] ia berkata; dulu Rasulullah shallallahu 'alaihi wasallam mengenakan dua kain burdah yang tebal, jika beliau duduk lalu berkeringat maka kain itu memberatkannya, dan telah datang kepada seorang Yahudi sejenis pakaian sutera, lalu saya katakan; seandainya anda mengutus seseorang kemudian membeli darinya dua pakaian hingga waktu mendapatkan kemudaha. Lalu beliau mengutus seseorang kepadanya, kemudian orang Yahudi itu berkata; aku tahu apa yang diinginkan Muhammad, ia hanya ingin untuk pergi dengan hartaku atau ia pergi dengan keduanya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \" ia dusta, sesungguhnya ia telah mengetahui bahwa aku adalah yang paling takut kepada Allah dari mereka dan yang paling menjaga amanat.\""
            },
            {
                "number": 4334,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ سَلَفٍ وَبَيْعٍ وَشَرْطَيْنِ فِي بَيْعٍ وَرِبْحِ مَا لَمْ يُضْمَنْ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dari [Khalid] dari [Husain Al Mu'allim] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari jual beli dengan syarat diberi hutang, dua syarat dalam jual beli dan keuntungan sesuatu yang belum ditanggung."
            },
            {
                "number": 4335,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا أَيُّوبُ قَالَ حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ قَالَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ حَتَّى ذَكَرَ عَبْدَ اللَّهِ بْنَ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ سَلَفٌ وَبَيْعٌ وَلَا شَرْطَانِ فِي بَيْعٍ وَلَا رِبْحُ مَا لَمْ يُضْمَنْ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah], ia berkata; telah menceritakan kepada kami [Ayyub], ia berkata; telah menceritakan kepada kami ['Amru bin Syu'aib], ia berkata; telah menceritakan kepadaku [ayahku] dari [ayahnya] hingga ia menyebutkan [Abdullah bin 'Amru], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal jual beli dengan syarat diberi hutang, dua syarat dalam jual beli dan keuntungan sesuatu yang belum ditanggung.\""
            },
            {
                "number": 4336,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ سَلَفٍ وَبَيْعٍ وَعَنْ شَرْطَيْنِ فِي بَيْعٍ وَاحِدٍ وَعَنْ بَيْعِ مَا لَيْسَ عِنْدَكَ وَعَنْ رِبْحِ مَا لَمْ يُضْمَنْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'], ia berkata; telah menceritakan kepada kami [Abdur Razzaq], ia berkata; telah menceritakan kepada kami [Ma'mar] dari [Ayyub] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari jual beli dengan syarat diberi hutang, dua syarat dalam satu akad jual beli, dan menjual sesuatu yang tidak engkau miliki."
            },
            {
                "number": 4337,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] dan [Ya'qub bin Ibrahim] dan [Muhammad bin Al Mutsanna] mereka berkata; telah menceritakan kepada kami [Yahya bin Sa'id], ia berkata; telah menceritakan kepada kami [Muhammad bin 'Amru], ia berkata; telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari dua jual beli dalam satu akad jual beli."
            },
            {
                "number": 4338,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ قَالَ حَدَّثَنَا يُونُسُ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَعَنْ الثُّنْيَا إِلَّا أَنْ تُعْلَمَ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami ['Abbad bin Al Awwam], ia berkata; telah menceritakan kepada kami [Sufyan bin Husain], ia berkata; telah menceritakan kepada kami [Yunus] dari ['Atho`] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam melarang dari muhaqalah, muzabanah dan mukhabarah serta pengecualian kecuali diketahui."
            },
            {
                "number": 4339,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ و أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا أَيُّوبُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَالْمُعَاوَمَةِ وَالثُّنْيَا وَرَخَّصَ فِي الْعَرَايَا",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ayyub] dan telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah], ia berkata; telah memberitakan kepada kami [Ayyub] dari [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari muhaqalah, muzabanah dan mukhabarah dan mu'awamah (menjual buah yang ada di atas pohon beberapa tahun sebelum nampak buah tersebut) serta pengecualian dan beliau memberikan keringanan dalam hal 'araya."
            },
            {
                "number": 4340,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرِئٍ أَبَّرَ نَخْلًا ثُمَّ بَاعَ أَصْلَهَا فَلِلَّذِي أَبَّرَ ثَمَرُ النَّخْلِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Siapapun orang yang mengawinkan pohon kurma kemudian menjual pokoknya maka bagi orang yang mengawinkan mendapatkan buah pohon kurma kecuali apabila orang yang membeli mensyaratkan buah tersebut untuknya.\""
            },
            {
                "number": 4341,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ابْتَاعَ نَخْلًا بَعْدَ أَنْ تُؤَبَّرَ فَثَمَرَتُهَا لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَمَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membeli pohon kurma setelah dikawinkan maka buahnya untuk orang yang membeli kecuali orang yang membeli mensyaratkan buah tersebut untuknya, dan barang siapa yang membeli budak dan ia memiliki harta maka hartanya milik orang yang menjual kecuali orang yang membeli mensyaratkannya.\""
            },
            {
                "number": 4342,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا سَعْدَانُ بْنُ يَحْيَى عَنْ زَكَرِيَّا عَنْ عَامِرٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَأَعْيَا جَمَلِي فَأَرَدْتُ أَنْ أُسَيِّبَهُ فَلَحِقَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَعَا لَهُ فَضَرَبَهُ فَسَارَ سَيْرًا لَمْ يَسِرْ مِثْلَهُ فَقَالَ بِعْنِيهِ بِوُقِيَّةٍ قُلْتُ لَا قَالَ بِعْنِيهِ فَبِعْتُهُ بِوُقِيَّةٍ وَاسْتَثْنَيْتُ حُمْلَانَهُ إِلَى الْمَدِينَةِ فَلَمَّا بَلَغْنَا الْمَدِينَةَ أَتَيْتُهُ بِالْجَمَلِ وَابْتَغَيْتُ ثَمَنَهُ ثُمَّ رَجَعْتُ فَأَرْسَلَ إِلَيَّ فَقَالَ أَتُرَانِي إِنَّمَا مَاكَسْتُكَ لِآخُذَ جَمَلَكَ خُذْ جَمَلَكَ وَدَرَاهِمَكَ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah memberitakan kepada kami [Sa'dan bin Yahya] dari [Zakariya] dari ['Amir] dari [Jabir bin Abdullah], ia berkata; saya pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan kemudian untaku tidak mampu untuk berjalan, lalu saya hendak meninggalkannya kemudian Rasulullah shallallahu 'alaihi wasallam menyusulku dan memanggil kemudian memukul unta tersebut sehingga ia berjalan yang sebelumnya tidak berjalan seperti itu. Lalu beliau bersabda: 'Juallah unta tersebut kepadaku dengan satu uqiyah.\" Maka saya katakan; tidak. Beliau bersabda: 'Juallah unta tersebut kepadaku.\" Kemudian saya menjual kepadanya dengan satu uqiyah dan saya mensyaratkan untuk membawaku ke Madinah. Setelah kami sampai Madinah maka saya mendatangi beliau dengan membawa unta tersebut, dan saya mengambil harganya, kemudian kembali. Lalu beliau mengirim utusan kepadaku dan beliau bersabda: \"Apakah engkau mengira bahwa saya menawarmu agar untuk mengambil untamu? Ambillah unta dan uang dirhammu.\""
            },
            {
                "number": 4343,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ الطَّبَّاعِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ الشَّعْبِيِّ عَنْ جَابِرٍ قَالَغَزَوْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى نَاضِحٍ لَنَا ثُمَّ ذَكَرْتُ الْحَدِيثَ بِطُولِهِ ثُمَّ ذَكَرَ كَلَامًا مَعْنَاهُ فَأُزْحِفَ الْجَمَلُ فَزَجَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْتَشَطَ حَتَّى كَانَ أَمَامَ الْجَيْشِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا جَابِرُ مَا أَرَى جَمَلَكَ إِلَّا قَدْ انْتَشَطَ قُلْتُ بِبَرَكَتِكَ يَا رَسُولَ اللَّهِ قَالَ بِعْنِيهِ وَلَكَ ظَهْرُهُ حَتَّى تَقْدَمَ فَبِعْتُهُ وَكَانَتْ لِي إِلَيْهِ حَاجَةٌ شَدِيدَةٌ وَلَكِنِّي اسْتَحْيَيْتُ مِنْهُ فَلَمَّا قَضَيْنَا غَزَاتَنَا وَدَنَوْنَا اسْتَأْذَنْتُهُ بِالتَّعْجِيلِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي حَدِيثُ عَهْدٍ بِعُرْسٍ قَالَ أَبِكْرًا تَزَوَّجْتَ أَمْ ثَيِّبًا قُلْتُ بَلْ ثَيِّبًا يَا رَسُولَ اللَّهِ إِنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو أُصِيبَ وَتَرَكَ جَوَارِيَ أَبْكَارًا فَكَرِهْتُ أَنْ آتِيَهُنَّ بِمِثْلِهِنَّ فَتَزَوَّجْتُ ثَيِّبًا تُعَلِّمُهُنَّ وَتُؤَدِّبُهُنَّ فَأَذِنَ لِي وَقَالَ لِي ائْتِ أَهْلَكَ عِشَاءً فَلَمَّا قَدِمْتُ أَخْبَرْتُ خَالِي بِبَيْعِي الْجَمَلَ فَلَامَنِي فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدَوْتُ بِالْجَمَلِ فَأَعْطَانِي ثَمَنَ الْجَمَلِ وَالْجَمَلَ وَسَهْمًا مَعَ النَّاسِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Abdullah], ia berkata; telah menceritakan kepada kami [Muhammad bin Isa bin Ath Thabba'], ia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Asy Sya'bi] dari [Jabir], ia berkata; saya berperang bersama Nabi shallallahu 'alaihi wasallam di atas unta kami, kemudian saya menyebutkan peristiwa tersebut. Kemudian unta tersebut mengalami keletihan lalu Nabi shallallahu 'alaihi wasallam menghardiknya sehingga ia menjadi semangat kembali hingga berada di hadapan pasukan. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Jabir, saya tidak melihat kecuali telah bersemangat kembali.\" Maka saya katakan; karena berkahmu wahai Rasulullah! Beliau bersabda: \"Juallah kepadaku, dan engkau mendapatkan tunggangannya hingga engkau sampai Madinah.\" Kemudian saya menjualnya padahal saya sangat membutuhkannya, akan tetapi saya malu dari beliau. Kemudian tatkala kami telah menyelesaikan perang kami dan kami telah dekat dengan Madinah, maka saya meminta izin untuk mendahului. Saya katakan; wahai Rasulullah, saya adalah orang yang baru menikah. Beliau bersabda: \"Engkau menikahi gadis atau janda?\" Saya mengatakan; janda wahai Rasulullah, sesungguhnya Abdullah bin 'Amru telah terbunuh dan ia meninggalkan beberapa orang anak wanita yang masih gadis, dan saya tidak suka untuk mendatangi mereka dengan wanita yang seperti mereka, sehingga saya menikahi janda yang akan mengajari dan mendidik mereka. Kemudian beliau mengizinkan saya, dan bersabda: \"Datanglah kepada keluargamu pada saat isya`.\" Kemudian tatkala saya telah sampai maka saya khabarkan penjualan ont a tesebut kepada bibiku, lalu ia mencelaku. Tatkala Rasulullah shallallahu 'alaihi wasallam telah sampai maka saya datang kepada beliau membawa unta. Kemudian beliau memberiku harga unta serta unta itu sendiri, dan saham saya bersama orang-orang."
            },
            {
                "number": 4344,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ وَكُنْتُ عَلَى جَمَلٍ فَقَالَ مَا لَكَ فِي آخِرِ النَّاسِ قُلْتُ أَعْيَا بَعِيرِي فَأَخَذَ بِذَنَبِهِ ثُمَّ زَجَرَهُ فَإِنْ كُنْتُ إِنَّمَا أَنَا فِي أَوَّلِ النَّاسِ يُهِمُّنِي رَأْسُهُ فَلَمَّا دَنَوْنَا مِنْ الْمَدِينَةِ قَالَ مَا فَعَلَ الْجَمَلُ بِعْنِيهِ قُلْتُ لَا بَلْ هُوَ لَكَ يَا رَسُولَ اللَّهِ قَالَ لَا بَلْ بِعْنِيهِ قُلْتُ لَا بَلْ هُوَ لَكَ قَالَ لَا بَلْ بِعْنِيهِ قَدْ أَخَذْتُهُ بِوُقِيَّةٍ ارْكَبْهُ فَإِذَا قَدِمْتَ الْمَدِينَةَ فَأْتِنَا بِهِ فَلَمَّا قَدِمْتُ الْمَدِينَةَ جِئْتُهُ بِهِ فَقَالَ لِبِلَالٍ يَا بِلَالُ زِنْ لَهُ أُوقِيَّةً وَزِدْهُ قِيرَاطًا قُلْتُ هَذَا شَيْءٌ زَادَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُفَارِقْنِي فَجَعَلْتُهُ فِي كِيسٍ فَلَمْ يَزَلْ عِنْدِي حَتَّى جَاءَ أَهْلُ الشَّامِ يَوْمَ الْحَرَّةِ فَأَخَذُوا مِنَّا مَا أَخَذُوا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`], ia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Salim bin Abu Al Ja'd] dari [Jabir bin Abdullah], ia berkata; kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu safar, dan saya berada di atas unta. Kemudian beliau bersabda: \"Kenapa engkau berada di bagian belakang?\" Saya katakan; untaku keletihan. Kemudian beliau memegang ekornya dan menghardiknya, lalu saya berada di depan orang-orang dan kepala unta tersebut membuatkan merasa khawatir. Kemudian tatkala kami telah mendekati Madinah beliau bersabda: \"Apa yang dilakukan unta tersebut? Juallah kepadaku.\" Saya mengatakan; tidak, melainkan unta tersebut untukmu wahai Rasulullah. Beliau bersabda: \"Tidak, juallah kepadaku.\" Saya mengatakan; tidak, melainkan unta tersebut untukmu. Beliau bersabda: \"Tidak, julallah kepadaku, saya beli dengan satu uqiyah, naiklah kemudian apabila engkau telah sampai Madinah maka datanglah kepada kami membawa unta tersebut.\" Tatkala saya telah sampai Madinah maka saya mendatanginya membawa unta tersebut. Kemudian beliau bersabda kepada Bilal: \"Wahai Bilal, timbanglah untuknya satu uqiyah dan tambahlah satu qirath.\" Ini adalah sesuatu yang dilebihkan Rasulullah shallallahu 'alaihi wasallam untukku, dan beliau tidak meninggalkanku. Kemudian saya meletakkannya di sebuah kantong, dan tetap ada padaku hingga penduduk Syam datang menyerang pada saat perang Harrah, dan mereka mengambil dari kami apa yang telah mereka ambil."
            },
            {
                "number": 4345,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَأَدْرَكَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُنْتُ عَلَى نَاضِحٍ لَنَا سَوْءٍ فَقُلْتُ لَا يَزَالُ لَنَا نَاضِحُ سَوْءٍ يَا لَهْفَاهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَبِيعُنِيهِ يَا جَابِرُ قُلْتُ بَلْ هُوَ لَكَ يَا رَسُولَ اللَّهِ قَالَ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ قَدْ أَخَذْتُهُ بِكَذَا وَكَذَا وَقَدْ أَعَرْتُكَ ظَهْرَهُ إِلَى الْمَدِينَةِ فَلَمَّا قَدِمْتُ الْمَدِينَةَ هَيَّأْتُهُ فَذَهَبْتُ بِهِ إِلَيْهِ فَقَالَ يَا بِلَالُ أَعْطِهِ ثَمَنَهُ فَلَمَّا أَدْبَرْتُ دَعَانِي فَخِفْتُ أَنْ يَرُدَّهُ فَقَالَ هُوَ لَكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam menemuiku dan saya berada di atas unta kami yang lemah. Kemudian saya katakan; aduh, kami senantiasa memiliki unta yang lemah. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah engkau akan menjualnya kepadaku wahai Jabir?\" Maka saya katakan; unta itu untukmu wahai Rasulullah! Beliau bersabda: \"Ya Allah, ampunilah dia. Ya Allah, rahmatilah dia, sungguh saya telah membelinya dengan sekian dan sekian. Dan saya telah meminjamkan punggungnya hingga sampai Madinah.\" Kemudian setelah saya sampai Madinah, saya mempersiapkan unta tersebut dan pergi membawanya kepada beliau. Kemudian beliau bersabda: \"Wahai Bilal, berikan hartanya kepadanya.\" Kemudian setelah saya pergi maka beliau memanggilku, maka saya khawatir beliau mengembalikannya. Beliau bersabda: \"Unta itu untukmu.\" "
            },
            {
                "number": 4346,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ أَبِي قَالَ حَدَّثَنَا أَبُو نَضْرَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا نَسِيرُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عَلَى نَاضِحٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ قُلْتُ نَعَمْ هُوَ لَكَ يَا نَبِيَّ اللَّهِ قَالَ أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ قُلْتُ نَعَمْ هُوَ لَكَ يَا نَبِيَّ اللَّهِ قَالَ أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ قُلْتُ نَعَمْ هُوَ لَكَقَالَ أَبُو نَضْرَةَ وَكَانَتْ كَلِمَةً يَقُولُهَا الْمُسْلِمُونَ افْعَلْ كَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Al Mu'tamir], ia berkata; saya mendengar [ayahku] berkata; telah menceritakan kepada kami [Abu Nadhrah] dari [Jabir bin Abdullah], ia berkata; kami pernah berjalan bersama Rasulullah shallallahu 'alaihi wasallam dan saya berada di atas unta. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: 'Apakah engkau menjualnya kepadaku dengan sekian serta sekian dan Allah mengampuni dosamu?\" Maka saya katakan; ya, unta itu untukmu wahai Nabi Allah. Beliau bersabda: 'Apakah engkau menjualnya kepadaku dengan sekian serta sekian dan Allah mengampuni dosamu?\" Maka saya katakan; ya, unta itu untukmu wahai Nabi Allah. 'Apakah engkau menjualnya kepadaku dengan sekian serta sekian dan Allah mengampuni dosamu?\" Maka saya katakan; ya, unta itu untukmu wahai Nabi Allah. Abu Nadhrah mengatakan; dan hal itu menjadi perkataan yang dikatakan oleh orang-orang muslim; lakukanlah demikian dan demikian dan semoga Allah mengampunimu."
            },
            {
                "number": 4347,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْاشْتَرَيْتُ بَرِيرَةَ فَاشْتَرَطَ أَهْلُهَا وَلَاءَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعْتِقِيهَا فَإِنَّ الْوَلَاءَ لِمَنْ أَعْطَى الْوَرِقَ قَالَتْ فَأَعْتَقْتُهَا قَالَتْ فَدَعَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَيَّرَهَا مِنْ زَوْجِهَا فَاخْتَارَتْ نَفْسَهَا وَكَانَ زَوْجُهَا حُرًّا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah], ia berkata; saya membeli Barirah kemudian pemiliknya mensyaratkan perwaliannya. Lalu hal tersebut saya utarakan kepada Nabi shallallahu 'alaihi wasallam kemudian beliau bersabda: \"Bebaskan dia, sesungguhnya perwalian itu untuk orang yang memberikan perak (pembeli).\" Aisyah berkata; kemudian Rasulullah shallallahu 'alaihi wasallam memanggil Barirah dan memberikan pilihan kepadanya terhadap suaminya, maka ia memilih dirinya. Suaminya pada saat itu adalah orang merdeka. "
            },
            {
                "number": 4348,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ قَالَ سَمِعْتُ الْقَاسِمَ يُحَدِّثُ عَنْ عَائِشَةَأَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ بَرِيرَةَ لِلْعِتْقِ وَأَنَّهُمْ اشْتَرَطُوا وَلَاءَهَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرِيهَا فَأَعْتِقِيهَا فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ وَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَحْمٍ فَقِيلَ هَذَا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ وَخُيِّرَتْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepada kami [Muhammad], ia berkata; telah menceritakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepada kami [Abdur Rahman bin Al Qasim], ia berkata; saya mendengar [Al Qasim] bercerita dari [Aisyah] bahwa ia ingin membeli Barirah untuk di merdekakan. Dan mereka mensyaratkan perwaliannya, lalu Aisyah mengutarakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Belilah dia dan merdekakan, sesungguhnya perwalian adalah untuk orang yang memerdekakan.\" Dan Rasulullah shallallahu 'alaihi wasallam telah diberi daging kemudian dikatakan; daging ini disedekahkan kepada Barirah. Kemudian beliau bersabda: \"Itu sedekah baginya dan bagi kita sebagai hadiah.\" Kemudian Barirah diminta untuk memilih."
            },
            {
                "number": 4349,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ عَائِشَةَ أَرَادَتْ أَنْ تَشْتَرِيَ جَارِيَةً تَعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ الْوَلَاءَ لَنَا فَذَكَرَتْ ذَلِكِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا يَمْنَعُكِ ذَلِكِ فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Aisyah ingin membeli seorang budak wanita yang akan ia merdekakan, kemudian pemiliknya berkata; kami akan menjualnya kepadamu dengan syarat perwalian untuk kami. Kemudian Aisyah mengutarakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Hal itu tidak menghalangimu, sesungguhnya perwalian adalah untuk orang yang memerdekakan.\""
            },
            {
                "number": 4350,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْمَغَانِمِ حَتَّى تُقْسَمَ وَعَنْ الْحَبَالَى أَنْ يُوطَأْنَ حَتَّى يَضَعْنَ مَا فِي بُطُونِهِنَّ وَعَنْ لَحْمِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Hafsh bin Abdullah], ia berkata; telah menceritakan kepadaku [ayahku], ia berkata; telah menceritakan kepadaku [Ibrahim] dari [Yahya bin Sa'id] dari ['Amru bin Syu'aib] dari [Abdullah bin Abu Najih] dari [Mujahid] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual harta rampasan perang hingga dibagikan, dan dari wanita-wanita hamil untuk digauli hingga melahirkan kandungannya, dan dari daging setiap yang memiliki taring dari binatang buas."
            },
            {
                "number": 4351,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشُّفْعَةُ فِي كُلِّ شِرْكٍ رَبْعَةٍ أَوْ حَائِطٍ لَا يَصْلُحُ لَهُ أَنْ يَبِيعَ حَتَّى يُؤْذِنَ شَرِيكَهُ فَإِنْ بَاعَ فَهُوَ أَحَقُّ بِهِ حَتَّى يُؤْذِنَهُ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Zurarah], ia berkata; telah memberitakan kepada kami [Isma'il] dari [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hak membeli terlebih dahulu ada dalam setiap rumah yang dimiliki bersama, atau kebun dan tidak boleh ia menjual hingga memberi tahu sekutunya, kemudian apabila ia menjual maka sekutunya tersebut lebih berhak terhadapnya hingga ia memberi izin untuk menjualnya.\""
            },
            {
                "number": 4352,
                "arab": "أَخْبَرَنَا الْهَيْثَمُ بْنُ مَرْوَانَ بْنِ الْهَيْثَمِ بْنِ عِمْرَانَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ حَمْزَةَ عَنْ الزُّبَيْدِيِّ أَنَّ الزُّهْرِيَّ أَخْبَرَهُ عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ أَنَّ عَمَّهُ حَدَّثَهُ وَهُوَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعَ فَرَسًا مِنْ أَعْرَابِيٍّ وَاسْتَتْبَعَهُ لِيَقْبِضَ ثَمَنَ فَرَسِهِ فَأَسْرَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبْطَأَ الْأَعْرَابِيُّ وَطَفِقَ الرِّجَالُ يَتَعَرَّضُونَ لِلْأَعْرَابِيِّ فَيَسُومُونَهُ بِالْفَرَسِ وَهُمْ لَا يَشْعُرُونَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعَهُ حَتَّى زَادَ بَعْضُهُمْ فِي السَّوْمِ عَلَى مَا ابْتَاعَهُ بِهِ مِنْهُ فَنَادَى الْأَعْرَابِيُّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ كُنْتَ مُبْتَاعًا هَذَا الْفَرَسَ وَإِلَّا بِعْتُهُ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ سَمِعَ نِدَاءَهُ فَقَالَ أَلَيْسَ قَدْ ابْتَعْتُهُ مِنْكَ قَالَ لَا وَاللَّهِ مَا بِعْتُكَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ ابْتَعْتُهُ مِنْكَ فَطَفِقَ النَّاسُ يَلُوذُونَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِالْأَعْرَابِيِّ وَهُمَا يَتَرَاجَعَانِ وَطَفِقَ الْأَعْرَابِيُّ يَقُولُ هَلُمَّ شَاهِدًا يَشْهَدُ أَنِّي قَدْ بِعْتُكَهُ قَالَ خُزَيْمَةُ بْنُ ثَابِتٍ أَنَا أَشْهَدُ أَنَّكَ قَدْ بِعْتَهُ قَالَ فَأَقْبَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى خُزَيْمَةَ فَقَالَ لِمَ تَشْهَدُ قَالَ بِتَصْدِيقِكَ يَا رَسُولَ اللَّهِ قَالَ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهَادَةَ خُزَيْمَةَ شَهَادَةَ رَجُلَيْنِ",
                "id": "Telah mengabarkan kepada kami [Al Haitsam bin Marwan bin Imran], ia berkata; telah menceritakan kepada kami [Muhammad bin Bakkar], ia berkata; telah menceritakan kepada kami [Yahya yaitu Ibnu Hamzah] dari [Az Zubaidi] bahwa [Az Zuhri] telah mengabarkan kepadanya dari ['Umarah bin Khuzaimah] bahwa [pamannya] berkata kepadanya yang termasuk seorang sahabat Nabi shallallahu 'alaihi wasallam telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam membeli seekor kuda dari seorang badui dan ia mengikuti beliau untuk mengambil uangnya, lalu Nabi shallallahu 'alaihi wasallam mempercepat jalannya sedangkan orang badui itu memperlambat jalannya, lalu orang-orang mulai mendatangi badui itu dan menawarnya, mereka tidak mengetahui jika Nabi shallallahu 'alaihi wasallam telah membelinya hingga salah seorang dari mereka menambah harganya melebihi harga yang telah dibeli beliau, lalu orang badui itu memanggil Nabi shallallahu 'alaihi wasallam dan berkata apakah engkau jadi membeli kudaku ini jika tidak maka aku akan menjualnya, Nabi shallallahu 'alaihi wasallam berdiri begitu mendengar panggilan orang badui itu, beliau bersabda: \"Bukankah aku telah membelinya darimu?\" Ia menjawab tidak, demi Allah aku tidak menjualnya kepadamu, lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Aku telah membelinya darimu, \" lalu orang-orang mulai mengerumunin Nabi shallallahu 'alaihi wasallam dan orang badui itu, kemudian mereka berdua kembali, orang badui itu berkata datangkan seorang saksi bahwa aku telah menjualnya kepadamu, Khuzaimah bin Tasbit berkata aku bersaksi bahwa engkau telah menjualnya, lalu Nabi shallallahu 'alaihi wasallam menerima persaksian Kuzaimah dan bersabda: \"Karena apa engkau bersaksi, \" ia berkata dengan mempercayaimu ya Rasulullah ia berkata lalu Rasulullah shallallahu 'alaihi wasallam menjadikan persaksian Khuzaimah dengan dua orang saksi."
            },
            {
                "number": 4353,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِدْرِيسَ قَالَ حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ قَالَ حَدَّثَنَا أَبِي عَنْ أَبِي عُمَيْسٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ الْأَشْعَثِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ عَبْدُ اللَّهِسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا اخْتَلَفَ الْبَيِّعَانِ وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ فَهُوَ مَا يَقُولُ رَبُّ السِّلْعَةِ أَوْ يَتْرُكَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Idris], ia berkata; telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyats], ia berkata; telah menceritakan kepada kami [ayahku] dari [Abu 'Umais] ia berkata; telah menceritakan kepadaku [Abdur Rahman bin Qais bin Muhammad bin Al Asy'ats] dari [ayahnya] dari [kakekknya], [Abdullah] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dua orang yang berjual beli berselisih dan tidak ada bukti diantara keduanya maka yang diambil adalah perkataan pemilik barang atau mereka berdua meninggalkannya.\""
            },
            {
                "number": 4354,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ وَيُوسُفُ بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ وَاللَّفْظُ لِإِبْرَاهِيمَ قَالُوا حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي إِسْمَعِيلُ بْنُ أُمَيَّةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُبَيْدٍ قَالَ حَضَرْنَا أَبَا عُبَيْدَةَ بْنَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍأَتَاهُ رَجُلَانِ تَبَايَعَا سِلْعَةً فَقَالَ أَحَدُهُمَا أَخَذْتُهَا بِكَذَا وَبِكَذَا وَقَالَ هَذَا بِعْتُهَا بِكَذَا وَكَذَا فَقَالَ أَبُو عُبَيْدَةَ أُتِيَ ابْنُ مَسْعُودٍ فِي مِثْلِ هَذَا فَقَالَ حَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِمِثْلِ هَذَا فَأَمَرَ الْبَائِعَ أَنْ يَسْتَحْلِفَ ثُمَّ يَخْتَارَ الْمُبْتَاعُ فَإِنْ شَاءَ أَخَذَ وَإِنْ شَاءَ تَرَكَ",
                "id": "Telah mengabarkan kepadaku [Ibrahim bin Al Hasan] dan [Yusuf bin Sa'id] dan [Abdur Rahman bin Khalid], lafazhnya adalah lafazh Ibrahim, mereka berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; telah berkata [Ibnu Juraij]; telah mengabarkan kepadaku [Isma'il bin Umayyah] dari [Abdul Malik bin 'Ubaid], ia berkata; kami bersama 'Ubaidah bin Abdullah bin Mas'ud, telah datang kepadanya dua orang yang berjual beli suatu barang. Kemudian salah seorang diantara mereka berkata; saya membelinya dengan sekian dan sekian. Dan yang lain berkata; saya menjualnya dengan sekian dan sekian. Lalu [Abu 'Ubaidah] berkata; [Ibnu Mas'ud] dihadapkan pada permasalahan seperti ini, kemudian ia berkata; saya bersama Rasulullah shallallahu 'alaihi wasallam dan beliau dihadapkan pada permasalahan seperti ini kemudian beliau memerintahkan penjual agar bersumpah kemudian pembeli memilih, apabila mau maka ia mengambilnya dan apabila mau maka ia meninggalkannya."
            },
            {
                "number": 4355,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْاشْتَرَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ يَهُودِيٍّ طَعَامًا بِنَسِيئَةٍ وَأَعْطَاهُ دِرْعًا لَهُ رَهْنًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Harb], ia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam membeli makanan dengan kredit dari seorang Yahudi, dan beliau memberikan kepadanya baju zirah beliau sebagai gadaian. "
            },
            {
                "number": 4356,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ عَنْ هِشَامٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلَاثِينَ صَاعًا مِنْ شَعِيرٍ لِأَهْلِهِ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Hammad], ia berkata; telah menceritakan kepada kami [Sufyan bin Habib] dari [Hisyam] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam meninggal dan baju zirahnya tergadaikan pada seorang Yahudi dengan tiga pulu sha' jewawut untuk keluarganya. "
            },
            {
                "number": 4357,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَأَعْتَقَ رَجُلٌ مِنْ بَنِي عُذْرَةَ عَبْدًا لَهُ عَنْ دُبُرٍ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَكَ مَالٌ غَيْرُهُ قَالَ لَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَشْتَرِيهِ مِنِّي فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ الْعَدَوِيُّ بِثَمَانِ مِائَةِ دِرْهَمٍ فَجَاءَ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ ابْدَأْ بِنَفْسِكَ فَتَصَدَّقْ عَلَيْهَا فَإِنْ فَضَلَ شَيْءٌ فَلِأَهْلِكَ فَإِنْ فَضَلَ مِنْ أَهْلِكَ شَيْءٌ فَلِذِي قَرَابَتِكَ فَإِنْ فَضَلَ مِنْ ذِي قَرَابَتِكَ شَيْءٌ فَهَكَذَا وَهَكَذَا وَهَكَذَا يَقُولُ بَيْنَ يَدَيْكَ وَعَنْ يَمِينِكَ وَعَنْ شِمَالِكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir], ia berkata; seseorang dari Bani 'Udzrah telah memerdekakan seorang budaknya apabila ia telah meninggal. Kemudian hal tersebut sampai kepada Rasulullah shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Apakah engkau memiliki harta selainnya?\" Ia berkata; tidak. Kemudian beliau bersabda: \"Siapakah yang akan membelinya dariku?\" Lalu budak tersebut dibeli Nu'aim bin Abdullah Al 'Adawi dengan harga delapan ratus dirham. kemudian ia membawanya kepada Rasulullah shallallahu 'alaihi wasallam. Lalu Rasulullah shallallahu 'alaihi wasallam menyerahkannya kepada orang tersebut kemudian bersabda: \"Mulailah dari dirimu, dan bersedekahlah kepadanya, kemudian apabila tersisa maka sisa tersebut untuk keluargamu, apabila tersisa dari keluargamu maka untuk kerabatmu, apabila tersisa dari kerabatmu maka demikian, demikian dan demikian.\" Beliau bersabda; untuk orang yang dihadapanmu, di sebelah kananmu dn sebelah kirimu.\" "
            },
            {
                "number": 4358,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ أَبُو مَذْكُورٍ أَعْتَقَ غُلَامًا لَهُ عَنْ دُبُرٍ يُقَالُ لَهُ يَعْقُوبُ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَدَعَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ يَشْتَرِيهِ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ بِثَمَانِ مِائَةِ دِرْهَمٍ فَدَفَعَهَا إِلَيْهِ وَقَالَ إِذَا كَانَ أَحَدُكُمْ فَقِيرًا فَلْيَبْدَأْ بِنَفْسِهِ فَإِنْ كَانَ فَضْلًا فَعَلَى عِيَالِهِ فَإِنْ كَانَ فَضْلًا فَعَلَى قَرَابَتِهِ أَوْ عَلَى ذِي رَحِمِهِ فَإِنْ كَانَ فَضْلًا فَهَا هُنَا وَهَا هُنَا",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Isma'il], ia berkata; telah menceritakan kepada kami [Ayyub] dari [Abu Az Zubair] dari [Jabir] bahwa seorang laki-laki dari Anshar yang dipanggil Abu Madzkur memerdekakan budaknya yang bernama Ya'qub apabila ia meninggal, ia tidak memiliki harta selainnya. Lalu Rasulullah shallallahu 'alaihi wasallam meminta agar budak tersebut didatangkan, kemudian beliau bersabda: \"Siapakah yang akan membelinya?\" kemudian ia dibeli Nu'aim bin Abdullah dengan harga delapan ratus dirham. kemudian beliau menyerahkannya kepada orang Anshar tersebut dan bersabda: Apabila salah seorang diantara kalian fakir maka hendaknya ia memulai dari dirinya, kemudian apabila tersisa maka diberikan kepada keluarganya, kemudian apabila tersisa maka diberikan kepada kerabatnya kemudian apabila tersisa maka diberikan ke sini dan ke sini.\""
            },
            {
                "number": 4359,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ وَابْنُ أَبِي خَالِدٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَاعَ الْمُدَبَّرَ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan], ia berkata; telah menceritakan kepada kami [Waki'], ia berkata; telah menceritakan kepada kami [Sufyan] dan [Ibnu Abu Khalid] dari [Salamah bin Khuhail] dari ['Atho`] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam menjual budak yang dimerdekakan apabila tuannya meninggal. "
            },
            {
                "number": 4360,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَخْبَرَتْهُأَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِي كِتَابَتِهَا شَيْئًا فَقَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لِأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ وَيَكُونَ لَنَا وَلَاؤُكِ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعِي وَأَعْتِقِي فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ فَمَنْ اشْتَرَطَ شَيْئًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ وَإِنْ اشْتَرَطَ مِائَةَ شَرْطٍ وَشَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah], ia telah mengabarkan kepadanya bahwa Barirah datang kepada Aisyah meminta bantuan dalam menyelesaikan perjanjian pembebasannya. Kemudian Aisyah berkata kepadanya; kembalilah kepada tuanmu, apabila mereka ingin saya membayar perjanjian pembebasanmu dan perwaliannya untukku maka saya akan melakukannya. Kemudian Barirah menyebutkan hal tersebut kepada tuannyada mereka menolak, dan mengatakan; apabila ia ingin mengharapkan pahala dan perwaliannya untuk kami maka silahkan ia melakukannya. Kemudian Aisyah mengungkan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam dan beliau bersabda kepadanya: \"Belilah dan merdekakan, sesungguhnya perwalian itu untuk orang yang memerdekakan.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana keadaan suatu kaum, mereka memberikan syarat yang tidak ada dalam Kitab Allah, barang siapa yang memberi syarat yang tidak ada dalam Kitab Allah, maka ia tidak berhak atas syarat tersebut walaupun ia telah memberikan syarat seratus syarat. Syarat Allah lebih berhak dan lebih kuat. "
            },
            {
                "number": 4361,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي رِجَالٌ مِنْ أَهْلِ الْعِلْمِ مِنْهُمْ يُونُسُ وَاللَّيْثُ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُمْ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْجَاءَتْ بَرِيرَةُ إِلَيَّ فَقَالَتْ يَا عَائِشَةُ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ أُوقِيَّةٌ فَأَعِينِينِي وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا فَقَالَتْ لَهَا عَائِشَةُ وَنَفِسَتْ فِيهَا ارْجِعِي إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أُعْطِيَهُمْ ذَلِكَ جَمِيعًا وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا فَعَرَضَتْ ذَلِكَ عَلَيْهِمْ فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ وَيَكُونَ ذَلِكِ لَنَا فَذَكَرَتْ ذَلِكَ عَائِشَةُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا يَمْنَعُكِ ذَلِكِ مِنْهَا ابْتَاعِي وَأَعْتِقِي فَإِنَّ الْوَلَاءَ لِمَنْ أَعْتَقَ فَفَعَلَتْ وَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسِ فَحَمِدَ اللَّهَ تَعَالَى ثُمَّ قَالَ أَمَّا بَعْدُ فَمَا بَالُ النَّاسِ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنْ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ قَضَاءُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la], ia berkata; telah memberitakan kepada kami [Ibnu Wahb], ia berkata; telah memberitakan kepadaku beberapa orang dari ulama, diantara mereka adalah [Yunus] dan [Al Laits] bahwa [Ibnu Syihab] telah mengabarkan kepada mereka dari ['Urwah] dari [Aisyah] bahwa ia berkata; telah datang Barirah kepadaku dan berkata; wahai Aisyah, sesungguhnya saya telah mengadakan janji dengan tuanku untuk memerdekakan diriku, dengan sembila uqiyah pada setiap tahun satu uqiyah, maka bantulah saya. Dan ia belum membayar sedikitpun dari perjanjian pembebasannya itu. Kemudian Aisyah berkata kepadanya; kembalilah kepada taunmu, apabila mereka ingin saya memberikan itu semua kepada mereka dan perwaliannya untukku maka saya akan melakukannya. Kemudian Barirah pergi menemui tuannya dan menawarkan kepada mereka hal tersebut, namun mereka menolak, dan mengatakan; apabila ia mau mengharapkan pahala maka hendaknya silahkan ia melakukan dan perwalian itu untuk kami. Kemudian Aisyah menyampaikan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau bersabda: \"Hal itu tidak menghalangimu darinya. Belilah dan merdekakan, sesungguhnya perwalian untuk orang yang memerdekakan.\" Kemudian Aisyah melakukannya, dan Rasulullah shallallahu 'alaihi wasallam berdiri diantara manusia kemudian memuji Allah ta'la kemudian bersabda: \"Adapun selanjutnya, bagaimana keadaan orang-orang yang memberikan syarat-syarat yang tidak ada dalam Kitab Allah. Barang siapa yang memberikan syarat yang tidak ada dalam Kitab Allah maka syarat tersebut adalah batil, walaupun seratus syarat. Keputusan Allah lebih berhak dan syarat Allah lebih kuat, sesungguhnya perwalian adalah untuk orang yang memerdekakan.\""
            },
            {
                "number": 4362,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami ['ubaidhullah] dari [Abdullah bin Dinar] dari [Abdullah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual perwalian dan memberikannya. "
            },
            {
                "number": 4363,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual perwalian dan memberikannya."
            },
            {
                "number": 4364,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ شُعْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Syu'bah] dari [Abdullah bin Dinar] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual perwalian dan memberikannya."
            },
            {
                "number": 4365,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى السِّينَانِيُّ عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْمَاءِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits], ia berkata; telah menceritakan kepada kami [Al Fadhl bin Musa As Sinani] dari [Husain bin Waqid] dari [Ayyub As Sakhtiyani] dari ['Atho`] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual air. "
            },
            {
                "number": 4366,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ أَبَا الْمِنْهَالِ يَقُولُ سَمِعْتُ إِيَاسَ بْنَ عُمَرَ وَقَالَ مَرَّةً ابْنَ عَبْدٍ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ بَيْعِ الْمَاءِقَالَ قُتَيْبَةُ لَمْ أَفْقَهْ عَنْهُ بَعْضَ حُرُوفِ أَبِي الْمِنْهَالِ كَمَا أَرَدْتُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dan [Abdullah bin Muhammad bin Abdur Rahman] dan lafazhnya adalah lafazh Abdullah, mereka berkata; telah menceritakan kepada kami [Sufyan] dari ['Amru bin Dinar], ia berkata; saya mendengar [Abu Al Minhal] berkata; saya mendengar [Iyas bin Umar]... (terkadang ia mengatakan; Ibnu ' Abd) berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari menjual air. Qutaibah berkata; saya tidak memahami sebagian yang dikatakan Abu Al Minhal sebagaimana yang saya inginkan. "
            },
            {
                "number": 4367,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا دَاوُدُ عَنْ عَمْرٍو عَنْ أَبِي الْمِنْهَالِ عَنْ إِيَاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ فَضْلِ الْمَاءِوَبَاعَ قَيِّمُ الْوَهَطِ فَضْلَ مَاءِ الْوَهَطِ فَكَرِهَهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id], ia berkata; telah menceritakan kepada kami [Daud] dari ['Amru] dari [Abu Al Minhal] dari [Iyas] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kelebihan air. Dan penjaga Al Wahth telah menjual kelebihan air dan Abdullah bin 'Amru tidak menyukainya. "
            },
            {
                "number": 4368,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ عَنْ حَجَّاجٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّ أَبَا الْمِنْهَالِ أَخْبَرَهُ أَنَّ إِيَاسَ بْنَ عَبْدٍ صَاحِبَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَلَا تَبِيعُوا فَضْلَ الْمَاءِ فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ فَضْلِ الْمَاءِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan] dari [Hajjaj], ia berkata; telah berkata [Ibnu Juraij] berkata; telah mengabarkan kepadaku ['Amru bin Dinar] bahwa [Abu Al Minhal] telah mengabarkan kepadanya bahwa [Iyas bin 'Abd] seorang sahabat Nabi berkata; janganlah kalian menjual kelebihan air, sesungguhnya Nabi melarang dari menjual kelebihan air. "
            },
            {
                "number": 4369,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ وَعْلَةَ الْمِصْرِيِّ أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍعَمَّا يُعْصَرُ مِنْ الْعِنَبِ قَالَ ابْنُ عَبَّاسٍ أَهْدَى رَجُلٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاوِيَةَ خَمْرٍ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ عَلِمْتَ أَنَّ اللَّهَ عَزَّ وَجَلَّ حَرَّمَهَا فَسَارَّ وَلَمْ أَفْهَمْ مَا سَارَّ كَمَا أَرَدْتُ فَسَأَلْتُ إِنْسَانًا إِلَى جَنْبِهِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَ سَارَرْتَهُ قَالَ أَمَرْتُهُ أَنْ يَبِيعَهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا فَفَتَحَ الْمَزَادَتَيْنِ حَتَّى ذَهَبَ مَا فِيهِمَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Zaid bin Aslam] dari [Ibnu Wa'lah Al Mishri] bahwa ia bertanya kepada Ibnu Abbas mengenai apa yang diperas dari anggur, [Ibnu Abbas] berkata; seseorang telah memberikan hadiah kepada Rasulullah shallallahu 'alaihi wasallam geriba yang penuh dengan minuman keras, kemudian Nabi shallallahu 'alaihi wasallam bersabda kepadanya; \"Tidakkah engkau mengetahui bahwa Allah 'azza wajalla telah mengharamkannya?\" kemudian orang tersebut membisikkan dan saya tidak memahami apa yang ia bisikkan seperti saya menginginkan. Kemudian saya bertanya kepada seseorang disampingnya. Lalu Nabi shallallahu 'alaihi wasallam bertanya kepadanya: \"Apa yang engkau bisikkan?\" Orang tersebut berkata; saya memerintahkannya agar menjualnya. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Yang mengharamkannya mengharamkan penjualannya.\" Kemudian beliau membuka dua bejana besar yang terbuat dari kulit hingga terbuang isinya. "
            },
            {
                "number": 4370,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْلَمَّا نَزَلَتْ آيَاتُ الرِّبَا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَتَلَاهُنَّ عَلَى النَّاسِ ثُمَّ حَرَّمَ التِّجَارَةَ فِي الْخَمْرِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan], ia berkata; telah menceritakan kepada kami [Waki'], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Abu Adh Dhuha] dari [Masruq] dari [Aisyah], ia berkata; tatkala turun ayat mengenai riba Rasulullah shallallahu 'alaihi wasallam berdiri di atas mimbar kemudian membacakan ayat tersebut kepada manusia, kemudian beliau mengharamkan penjualan minuman keras. "
            },
            {
                "number": 4371,
                "arab": "حَدَّثَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ عُقْبَةَ بْنَ عَمْرٍو قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Abu Bakr bin Abdur Rahman bin Al Harits bin Hisyam] bahwa ia mendengar [Abu Mas'ud 'Uqbah bin 'Amru], ia berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dari menjual anjing upah pelacur dan bayaran dukun. "
            },
            {
                "number": 4372,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عِيسَى قَالَ أَنْبَأَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَشْيَاءَ حَرَّمَهَا وَثَمَنُ الْكَلْبِ",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Abdullah bin Abdul Hakam], ia berkata; telah menceritakan kepada kami [Sa'id bin Isa], ia berkata; telah memberitakan kepada kami [Al Mufadhdhal bin Fadhalah] dari [Ibnu Juraij] dari ['Atho` bin Abu Rabah] dari [Ibn Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda mengenai apa saja yang diharamkan: \" Dan menjual anjing.\""
            },
            {
                "number": 4373,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ أَنْبَأَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَالسِّنَّوْرِ إِلَّا كَلْبِ صَيْدٍقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا مُنْكَرٌ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan], ia berkata; telah memberitakan kepada kami [Hajjaj bin Muhammad] dari [Hammad bin Salamah] dari [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual anjing dan kucing kecuali anjing pemburu. Abdur Rahman berkata; hadits ini adalah mungkar. "
            },
            {
                "number": 4374,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالْأَصْنَامِ فَقِيلَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُطْلَى بِهَا السُّفُنُ وَيُدَّهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ فَقَالَ لَا هُوَ حَرَامٌ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا حَرَّمَ عَلَيْهِمْ شُحُومَهَا جَمَّلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari ['Atho` bin Abu Rabah] dari [Jabir bin Abdullah] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda pada saat penaklukan Mekkah dan beliau berada di Mekkah: \"Sesungguhnya Allah dan RasulNya telah mengharamkan menjual minuman keras, bangkai, babi dan patung.\" Beliau ditanya; wahai Rasulullah, bagaimana pendapat anda mengenai lemak bangkai, sesungguhnya lemak itu bisa digunakan untuk mengecat kapal, dan meminyaki kulit serta digunakan manusia untuk penerangan. Kemudian beliau bersabda: \"Tidak, itu adalah haram.\" Rasulullah shallallahu 'alaihi wasallam pada saat demikian bersabda: \"Semoga Allah 'azza wajalla memerangi orang-orang Yahudi, Allah telah mengharamkan atas mereka lemaknya lalu mereka mencairkannya, kemudian menjualnya dan memakan uangnya.\""
            },
            {
                "number": 4375,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ عَنْ حَجَّاجٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ ضِرَابِ الْجَمَلِ وَعَنْ بَيْعِ الْمَاءِ وَبَيْعِ الْأَرْضِ لِلْحَرْثِ يَبِيعُ الرَّجُلُ أَرْضَهُ وَمَاءَهُ فَعَنْ ذَلِكَ نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan] dari [Hajjaj], ia berkata; telah berkata [Ibnu Juraij]; telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia telah mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual pengawinan unta, dan dari menjual air, menjual tanah bercocok tanam, yaitu seseorang menjual tanahnya dan airnya. Maka dari hal tersebut Nabi shallallahu 'alaihi wasallam melarang. "
            },
            {
                "number": 4376,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ الْحَكَمِ ح وَأَنْبَأَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَسْبِ الْفَحْلِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ali bin Al Hakam], telah menceritakan dan memberikatakan kepada kami [Humaid bin Mas'adah], ia berkata; telah menceritakan kepada kami [Abdul Warits] dari [Ali bin Al Hakam] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari penyewaan pejantan."
            },
            {
                "number": 4377,
                "arab": "أَخْبَرَنَا عِصْمَةُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ إِبْرَاهِيمَ بْنِ حُمَيْدٍ الرُّوَاسِيِّ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَجَاءَ رَجُلٌ مِنْ بَنِي الصَّعْقِ أَحَدِ بَنِي كِلَابٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ عَسْبِ الْفَحْلِ فَنَهَاهُ عَنْ ذَلِكَ فَقَالَ إِنَّا نُكْرِمُ عَلَى ذَلِكَ",
                "id": "Telah mengabarkan kepada kami ['Ishmah bin Al Fadhl], ia berkata; telah menceritakan kepada kami [Yahya bin Adam] dari [Ibrahim bin Humaid Ar Ruwasi], ia berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Muhammad bin Ibrahim bin Al Harits] dari [Anas bin Malik] ia berkata; seorang laki-laki dari Bani Sha'q salah satu dari Bani Kilab mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya kepada beliau; mengenai penyewakan pejantan. Maka beliau melarang hal itu dan bersabda: \"Sesungguhnya kami memuliakan hal itu.\""
            },
            {
                "number": 4378,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْمُغِيرَةِ قَالَ سَمِعْتُ ابْنَ أَبِي نُعْمٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْبِ الْحَجَّامِ وَعَنْ ثَمَنِ الْكَلْبِ وَعَنْ عَسْبِ الْفَحْلِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dari [Muhammad], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Mughirah], ia berkata; saya mendengar [Ibnu Abu Nu'm], ia berkata; saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari usaha tukang bekam, menjual anjing serta penyewaan pejantan. "
            },
            {
                "number": 4379,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ ابْنِ أَبِي نُعْمٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَسْبِ الْفَحْلِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ali bin Maimun], ia berkata; telah menceritakan kepada kami [Muhammad], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Hisyam] dari [Ibnu Abu Nu'm] dari [Abu Sa'id Said Alkhudri] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari penyewakan pejantan."
            },
            {
                "number": 4380,
                "arab": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ الْأَعْمَشِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ وَعَسْبِ الْفَحْلِ",
                "id": "Telah mengabarkan kepada kami [Washil bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Ibnu Fudhail] dari [Al A'masy] dari [Abu Hazim] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari jual beli anjing dan penyewaan pejantan."
            },
            {
                "number": 4381,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرِئٍ أَفْلَسَ ثُمَّ وَجَدَ رَجُلٌ عِنْدَهُ سِلْعَتَهُ بِعَيْنِهَا فَهُوَ أَوْلَى بِهِ مِنْ غَيْرِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Abu Bakr bin Hazm] dari [Umar bin Abdul Aziz] dari [Abu Bakr bin Abdur Rahman bin Al Harits bin Hisyam] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Siapapun orang yang bangkrut kemudian seseorang mendapati barangnya ada padanya maka ia lebih berhak daripada selainnya.\""
            },
            {
                "number": 4382,
                "arab": "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ وَإِبْرَاهِيمُ بْنُ الْحَسَنِ وَاللَّفْظُ لَهُ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ أَبِي حُسَيْنٍ أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ حَدَّثَهُ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَدِيثِ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يُعْدِمُ إِذَا وُجِدَ عِنْدَهُ الْمَتَاعُ بِعَيْنِهِ وَعَرَفَهُ أَنَّهُ لِصَاحِبِهِ الَّذِي بَاعَهُ",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Khalid] dan [Ibrahim bin Al Hasan], lafazhnya adalah lafazh Ibrahim, ia berkata; telah menceritakan kepada kami [Hajjaj bin Muhammad], ia berkata; telah berkata [Ibnu Juraij]; telah mengabarkan kepadaku [Ibnu Abu Husain] bahwa [Abu Bakr bin Muhammad bin 'Amru bin Hazm] telah mengabarkan kepadanya bahwa [Umar bin Abdul Aziz] telah menceritakan kepadanya dari [Abu Bakr bin Abdur Rahman] dari hadits [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam mengenai seorang laki-laki yang menjadi miskin, apabila didapatkan bersamanya sebuah barang dan ia mengetahuinya, bahwa barang tersebut adalah untuk pemiliknya yang telah menjualnya."
            },
            {
                "number": 4383,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنِي اللَّيْثُ بْنُ سَعْدٍ وَعَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَأُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثِمَارٍ ابْتَاعَهَا وَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَصَدَّقُوا عَلَيْهِ فَتَصَدَّقُوا عَلَيْهِ وَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amru bin As Sarh], ia berkata; telah memberitakan kepada kami [Ibnu Wahb], ia berkata; telah menceritakan kepadaku [Al Laits bin Sa'd] dan ['Amru bin Al Harits] dari [Bukair bin Al Asyajj] dari ['Iyadh bin Abdullah] dari [Abu Sa'id Al Khudri], ia berkata; seeorang pada zaman Rasulullah shallallahu 'alaihi wasallam tertimpa musibah pada buah-buahan yang ia beli sehingga hutangnya menjadi banyak. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersedekahlah kepadanya.\" Kemudian mereka bersedekah kepadanya dan hal itu belum bisa menutup hutannya, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah apa yang kalian dapatkan, dan kalian tidak memiliki hak kecuali hal itu.\""
            },
            {
                "number": 4384,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ ابْنِ جُرَيْجٍ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ قَالَ حَدَّثَنِي أُسَيْدُ بْنُ حُضَيْرِ بْنِ سِمَاكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّهُ إِذَا وَجَدَهَا فِي يَدِ الرَّجُلِ غَيْرِ الْمُتَّهَمِ فَإِنْ شَاءَ أَخَذَهَا بِمَا اشْتَرَاهَا وَإِنْ شَاءَ اتَّبَعَ سَارِقَهُ وَقَضَى بِذَلِكَ أَبُو بَكْرٍ وَعُمَرُ",
                "id": "Telah mengabarkan kepada kami [Harun bin Abdullah], ia berkata; telah menceritakan kepada kami [Hammad bin Mas'adah] dari [Ibnu Juraij] dari [Ikrimah bin Khalid], ia berkata; telah menceritakan kepadaku [Usaid bin Hudhair bin Simak] bahwa Rasulullah shallallahu 'alaihi wasallam memutuskan jika ia mendapatkan barangnya ditangan laki-laki yang tidak tertuduh, maka jika mau ia boleh mengambil dengan memberikan harga belinya, dan jika mau ia boleh menuntut orang yang mencurinya. Dan Abu Bakar serta Umar memutuskan hal seperti itu."
            },
            {
                "number": 4385,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ ذُؤَيْبٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ وَلَقَدْ أَخْبَرَنِي عِكْرِمَةُ بْنُ خَالِدٍ أَنَّ أُسَيْدَ بْنَ حُضَيْرٍ الْأَنْصَارِيَّ ثُمَّ أَحَدَ بَنِي حَارِثَةَ أَخْبَرَهُأَنَّهُ كَانَ عَامِلًا عَلَى الْيَمَامَةِ وَأَنَّ مَرْوَانَ كَتَبَ إِلَيْهِ أَنَّ مُعَاوِيَةَ كَتَبَ إِلَيْهِ أَنَّ أَيَّمَا رَجُلٍ سُرِقَ مِنْهُ سَرِقَةٌ فَهُوَ أَحَقُّ بِهَا حَيْثُ وَجَدَهَا ثُمَّ كَتَبَ بِذَلِكَ مَرْوَانُ إِلَيَّ فَكَتَبْتُ إِلَى مَرْوَانَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِأَنَّهُ إِذَا كَانَ الَّذِي ابْتَاعَهَا مِنْ الَّذِي سَرَقَهَا غَيْرُ مُتَّهَمٍ يُخَيَّرُ سَيِّدُهَا فَإِنْ شَاءَ أَخَذَ الَّذِي سُرِقَ مِنْهُ بِثَمَنِهَا وَإِنْ شَاءَ اتَّبَعَ سَارِقَهُ ثُمَّ قَضَى بِذَلِكَ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ فَبَعَثَ مَرْوَانُ بِكِتَابِي إِلَى مُعَاوِيَةَ وَكَتَبَ مُعَاوِيَةُ إِلَى مَرْوَانَ إِنَّكَ لَسْتَ أَنْتَ وَلَا أُسَيْدٌ تَقْضِيَانِ عَلَيَّ وَلَكِنِّي أَقْضِي فِيمَا وُلِّيتُ عَلَيْكُمَا فَأَنْفِذْ لِمَا أَمَرْتُكَ بِهِ فَبَعَثَ مَرْوَانُ بِكِتَابِ مُعَاوِيَةَ فَقُلْتُ لَا أَقْضِي بِهِ مَا وُلِّيتُ بِمَا قَالَ مُعَاوِيَةُ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur] telah menceritakan kepada kami [Sa'id bin Dzuaib] telah menceritakan kepada kami [Abdur Razzaq] dari [Ibnu Juraij] sungguh telah mengabarkan kepadaku [Ikrimah bin Khalid] bahwa [Usaid bin Hudhair Al Anshari] kemudian salah seorang Bani Haritsah mengabarkan kepadanya bahwa dia adalah seorang gubernur di daerah Yamamah dan bahwa Marwan telah menulis surat kepadanya bahwa Mu'awiyah telah menulis surat kepadanya bahwa siapapun laki-laki yang kecurian suatu barang curian maka dia lebih berhak terhadap barang tersebut, ketika dia mendapatkannya (kembali). Kemudian Marwan menulis surat tersebut kepadaku, saya pun menulis surat kepada Marwan bahwa Nabi shallallahu 'alaihi wasallam memutuskan bahwasanya apabila orang yang membeli barang dari orang yang mencuri bukanlah orang yang tertuduh maka pemiliknya diberi pilihan, apabila mau dia boleh mengambil barang yang dicuri dengan memberikan harganya, dan apabila dia mau maka dia bisa menuntut orang yang mencurinya. Kemudian Abu Bakar, Umar dan Utsman memutuskan dengan hal tersebut. Lalu Marwan mengirim utusan dengan membawa suratku kepada Mu'awiyah. Dan Mu'awiyah menulis kepada Marwan; \"Sesungguhnya bukan engkau dan bukan Usaid yang memutuskan suatu perkara atas diriku, akan tetapi sayalah yang memutuskan perkara yang dikuasakan kepadaku atas kalian, maka lakukanlah apa yang aku perintahkan kepadamu.\" Kemudian Marwan mengirim surat Mu'awiyah kepadaku, lalu saya katakan; \"Selagi saya menjabat, saya tidak akan memutuskan dengan apa yang dikatakan Mu'awiyah.\""
            },
            {
                "number": 4386,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ قَالَ حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ مُوسَى بْنِ السَّائِبِ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلُ أَحَقُّ بِعَيْنِ مَالِهِ إِذَا وَجَدَهُ وَيَتْبَعُ الْبَائِعُ مَنْ بَاعَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Daud] telah menceritakan kepada kami ['Amru bin 'Aun] telah menceritakan kepada kami [Husyaim] dari [Musa bin As Saib] dari [Qatadah] dari [Al Hasan] dari [Samurah], Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seseorang itu lebih berhak terhadap hartanya jika ia mendapatinya, dan seorang penjual menuntut orang yang menjualnya.\""
            },
            {
                "number": 4387,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلْأَوَّلِ مِنْهُمَا وَمَنْ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapapun wanita yang dinikahkan oleh dua orang wali maka ia adalah milik orang yang lebih dahulu dari keduanya, dan barang siapa yang menjual sesuatu kepada dua orang maka sesuatu tersebut milik orang yang lebih dahulu dari keduanya.\""
            },
            {
                "number": 4388,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَاسْتَقْرَضَ مِنِّي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ أَلْفًا فَجَاءَهُ مَالٌ فَدَفَعَهُ إِلَيَّ وَقَالَ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالْأَدَاءُ",
                "id": "Telah menceritakan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Abdur Rahman] dari [Sufyan] dari [Ismail bin Ibrahim bin Abdullah bin Abu Rabi'ah] dari [ayahnya] dari [kakeknya], dia berkata; \"Nabi shallallahu 'alaihi wasallam meminjam uang kepadaku sebanyak empat puluh ribu, lalu ketika beliau memiliki harta beliau menyerahkannya kepadaku dan bersabda: \"Semoga Allah memberkahi keluarga dan hartamu, sesungguhnya balasan bagi peminjaman itu adalah pujian dan pemenuhan (pelunasan).\""
            },
            {
                "number": 4389,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ قَالَ حَدَّثَنَا الْعَلَاءُ عَنْ أَبِي كَثِيرٍ مَوْلَى مُحَمَّدِ بْنِ جَحْشٍ عَنْ مُحَمَّدِ بْنِ جَحْشٍ قَالَكُنَّا جُلُوسًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ ثُمَّ وَضَعَ رَاحَتَهُ عَلَى جَبْهَتِهِ ثُمَّ قَالَ سُبْحَانَ اللَّهِ مَاذَا نُزِّلَ مِنْ التَّشْدِيدِ فَسَكَتْنَا وَفَزِعْنَا فَلَمَّا كَانَ مِنْ الْغَدِ سَأَلْتُهُ يَا رَسُولَ اللَّهِ مَا هَذَا التَّشْدِيدُ الَّذِي نُزِّلَ فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنَّ رَجُلًا قُتِلَ فِي سَبِيلِ اللَّهِ ثُمَّ أُحْيِيَ ثُمَّ قُتِلَ ثُمَّ أُحْيِيَ ثُمَّ قُتِلَ وَعَلَيْهِ دَيْنٌ مَا دَخَلَ الْجَنَّةَ حَتَّى يُقْضَى عَنْهُ دَيْنُهُ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dari [Isma'il] telah menceritakan kepada kami [Al 'Ala`] dari [Abu Katsir], budak Muhammad bin Jahsy dari [Muhammad bin Jahsy], dia berkata; \"Kami pernah duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam kemudian beliau mendongakkan kepala beliau ke langit kemudian beliau meletakkan telapak tangan beliau pada kening beliau kemudian bersabda: \"Subhanallah, apakah yang telah diturunkan dari sikap keras?\" kemudian kami diam dan terkejut. Kemudian setelah besok harinya saya bertanya kepada beliau; \"Wahai Rasulullah, sikap keras apakah yang telah diturunkan ini? Beliau bersabda: \"Demi Dzat yang jiwaku ada di tanganNya, seandainya seseorang terbunuh di jalan Allah, kemudian dihidupkan, kemudian terbunuh, kemudian dihidupkan, kemudian terbunuh dan ia memiliki tanggungan hutang maka ia tidak akan masuk Surga hingga terbayarkan hutangnya.\""
            },
            {
                "number": 4390,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا الثَّوْرِيُّ عَنْ أَبِيهِ عَنْ الشَّعْبِيِّ عَنْ سَمْعَانَ عَنْ سَمُرَةَ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جِنَازَةٍ فَقَالَ أَهَا هُنَا مِنْ بَنِي فُلَانٍ أَحَدٌ ثَلَاثًا فَقَامَ رَجُلٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَنَعَكَ فِي الْمَرَّتَيْنِ الْأُولَيَيْنِ أَنْ لَا تَكُونَ أَجَبْتَنِي أَمَا إِنِّي لَمْ أُنَوِّهْ بِكَ إِلَّا بِخَيْرٍ إِنَّ فُلَانًا لِرَجُلٍ مِنْهُمْ مَاتَ مَأْسُورًا بِدَيْنِهِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abdur Razzaq] telah menceritakan kepada kami [Ats Tsauri] dari [ayahnya] dari [Asy Sya'bi] dari [Sam'an] dari [Samurah], dia berkata; \"Kami bersama Rasulullah shallallahu 'alaihi wasallam ketika mengurusi jenazah, lalu beliau bersabda: \"Apakah disini ada seseorang yang berasal dari Bani Fulan, \" sebanyak tiga kali, lalu berdirilah seseorang, kemudian Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Apa yang menghalangimu untuk menjawabku pada kedua panggilan pertama, aku tidak bermaksud kepadamu selain kebaikan, sesungguhnya Fulan (yaitu seseorang diantara mereka) meninggal dalam keadaan tertahan oleh hutangnya.\""
            },
            {
                "number": 4391,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ زِيَادِ بْنِ عَمْرِو بْنِ هِنْدٍ عَنْ عِمْرَانَ بْنِ حُذَيْفَةَ قَالَكَانَتْ مَيْمُونَةُ تَدَّانُ وَتُكْثِرُ فَقَالَ لَهَا أَهْلُهَا فِي ذَلِكَ وَلَامُوهَا وَوَجَدُوا عَلَيْهَا فَقَالَتْ لَا أَتْرُكُ الدَّيْنَ وَقَدْ سَمِعْتُ خَلِيلِي وَصَفِيِّي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ أَحَدٍ يَدَّانُ دَيْنًا فَعَلِمَ اللَّهُ أَنَّهُ يُرِيدُ قَضَاءَهُ إِلَّا أَدَّاهُ اللَّهُ عَنْهُ فِي الدُّنْيَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ziyad bin 'Amru bin Hindun] dari [Imran bin Hudzaifah], dia berkata; \" [Maimunah] adalah orang yang banyak berhutang, keluarganya memperingatkan akan hal itu, mencelanya dan marah kepadanya. Dia lalu berkata; \"Aku tidak akan meninggalkan hutang, sungguh aku telah mendengar kekasihku dan pilihanku shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang yang banyak berhutang dan Allah mengetahui bahwa ia ingin membayarnya kecuali Allah akan membayarkannya di dunia.\""
            },
            {
                "number": 4392,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَأَنَّ مَيْمُونَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَدَانَتْ فَقِيلَ لَهَا يَا أُمَّ الْمُؤْمِنِينَ تَسْتَدِينِينَ وَلَيْسَ عِنْدَكِ وَفَاءٌ قَالَتْ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَخَذَ دَيْنًا وَهُوَ يُرِيدُ أَنْ يُؤَدِّيَهُ أَعَانَهُ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [ayahku] dari [Al A'masy] dari [Hushain bin Abdur Rahman] dari ['ubaidhullah bin Abdullah bin 'Utbah] bahwa [Maimunah] isteri Nabi shallallahu 'alaihi wasallam berhutang, kemudian dikatakan kepadanya; \"Wahai Ummul Mukminin, engkau berhutang sedangkan engkau tidak mampu melunasi?\" Dia berkata; \"Sesungguhnya saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mengambil hutang dan dia ingin membayarnya maka Allah 'azza wajalla akan membantunya.\""
            },
            {
                "number": 4393,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ وَالظُّلْمُ مَطْلُ الْغَنِيِّ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seseorang diantara kalian dipindahkan kepada orang yang kaya maka hendaknya ia mengikuti, kezhaliman adalah orang kaya yang menunda pembayaran hutang tanpa adanya udzur (syar'i).\""
            },
            {
                "number": 4394,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ وَبْرِ بنِ أَبِي دُلَيْلَةَ عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Adam] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Wabr bin Abu Dulailah] dari [Muhammad bin Maimun] dari ['Amru bin Asy Syarid] dari [ayahnya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penundaan pembayaran hutan yang dilakukan oleh orang yang mampu membayarnya menghalalkan kehormatan (untuk dighibah) dan hukumannya.\" "
            },
            {
                "number": 4395,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا وَبْرُ بْنُ أَبِي دُلَيْلَةَ الطَّائِفِيُّ عَنْ مُحَمَّدِ بْنِ مَيْمُونِ ابْنِ مُسَيْكَةَ وَأَثْنَى عَلَيْهِ خَيْرًا عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Wabr bin Abu Dulailah Ath Thaify] dari [Muhammad bin Maimun bin Musaikah] dan dia memujinya dengan kebaikan dari ['Amru bin Asy Syarid] dari [ayahnya] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Penundaan pembayaran hutan yang dilakukan oleh orang yang mampu membayarnya menghalalkan kehormatan (untuk dighibah) dan hukumannya.\" "
            },
            {
                "number": 4396,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat sedang saya mendengar, lafazhnya adalah lafazh Al Harits, dari [Ibnu Al Qasim] telah menceritakan kepadaku [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penundaan pembayaran hutang yang dilakukan oleh orang yang kaya adalah kezhaliman. Apabila seseorang diantara kalian dipindahkan kepada orang yang kaya maka hendaknya dia mengikuti.\""
            },
            {
                "number": 4397,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِأَنَّ رَجُلًا مِنْ الْأَنْصَارِ أُتِيَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّيَ عَلَيْهِ فَقَالَ إِنَّ عَلَى صَاحِبِكُمْ دَيْنًا فَقَالَ أَبُو قَتَادَةَ أَنَا أَتَكَفَّلُ بِهِ قَالَ بِالْوَفَاءِ قَالَ بِالْوَفَاءِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Sa'id] dari [Utsman bin Abdullah bin Mauhab] dari [Abdullah bin Abu Qatadah] dari [ayahnya] bahwa seseorang dari kalangan Anshar dihadapkan kepada Nabi shallallahu 'alaihi wasallam agar beliau mensholatinya, kemudian beliau bersabda: \"Sesungguhnya sahabat kalian ini memiliki hutang.\" Kemudian Abu Qatadah berkata; \"Saya yang akan menanggungnya.\" Beliau bersabda: \"Dengan membayarnya?\" Dia berkata; \"Dengan membayarnya.\""
            },
            {
                "number": 4398,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ عَنْ وَكِيعٍ قَالَ حَدَّثَنِي عَلِيُّ بْنُ صَالِحٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خِيَارُكُمْ أَحْسَنُكُمْ قَضَاءً",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dari [Waki'] telah menceritakan kepadaku [Ali bin Shalih] dari [Salamah bin Kuhail] dari [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik kalian adalah yang paling baik dalam membayar (hutang).\""
            },
            {
                "number": 4399,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ رَجُلًا لَمْ يَعْمَلْ خَيْرًا قَطُّ وَكَانَ يُدَايِنُ النَّاسَ فَيَقُولُ لِرَسُولِهِ خُذْ مَا تَيَسَّرَ وَاتْرُكْ مَا عَسُرَ وَتَجَاوَزْ لَعَلَّ اللَّهَ تَعَالَى أَنْ يَتَجَاوَزَ عَنَّا فَلَمَّا هَلَكَ قَالَ اللَّهُ عَزَّ وَجَلَّ لَهُ هَلْ عَمِلْتَ خَيْرًا قَطُّ قَالَ لَا إِلَّا أَنَّهُ كَانَ لِي غُلَامٌ وَكُنْتُ أُدَايِنُ النَّاسَ فَإِذَا بَعَثْتُهُ لِيَتَقَاضَى قُلْتُ لَهُ خُذْ مَا تَيَسَّرَ وَاتْرُكْ مَا عَسُرَ وَتَجَاوَزْ لَعَلَّ اللَّهَ يَتَجَاوَزُ عَنَّا قَالَ اللَّهُ تَعَالَى قَدْ تَجَاوَزْتُ عَنْكَ",
                "id": "Telah mengabarkan kepada kami [Isa bin Hammad] telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Zaid bin Aslam] dari [Abu Shalih] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya terdapat seorang laki-laki yang belum pernah berbuat kebaikan sama sekali, dan dia biasa memberikan hutang kepada orang-orang. Kemudian dia berkata kepada utusannya; \"Ambillah apa yang mudah dan tinggalkan apa yang sulit dan maafkan semoga Allah ta'ala mengampuni kita.\" Kemudian tatkala dia meninggal, Allah 'azza wajalla berfirman kepadanya: \"Apakah engkau pernah mengerjakan kebaikan?\" Dia berkata; \"Tidak, hanya saja saya memiliki seorang pembantu dan saya biasa memberikan hutang kepada orang-orang kemudian apabila saya mengutusnya untuk menagih hutang, saya katakan kepadanya; 'Ambillah apa yang mudah dan tinggalkan apa yang sulit dan maafkan, semoga Allah memaafkan kita.\" Allah ta'ala berfirman: sungguh Aku telah memaafkanmu.\""
            },
            {
                "number": 4400,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ رَجُلٌ يُدَايِنُ النَّاسَ وَكَانَ إِذَا رَأَى إِعْسَارَ الْمُعْسِرِ قَالَ لِفَتَاهُ تَجَاوَزْ عَنْهُ لَعَلَّ اللَّهَ تَعَالَى يَتَجَاوَزُ عَنَّا فَلَقِيَ اللَّهَ فَتَجَاوَزَ عَنْهُ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Az Zubaidi] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] bahwa dia mendengar [Abu Hurairah] berkata; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam bersabda: \"Dahulu terdapat seorang laki-laki yang biasa memberikan hutang kepada orang-orang dan apabila ia melihat orang yang dihutangi mengalami kesulitan maka dia berkata kepada pembantunya; \"Maafkan dia, semoga Allah ta'ala memaafkan kita. Kemudian dia bertemu dengan Allah dan Dia pun memaafkannya.\""
            },
            {
                "number": 4401,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ إِسْمَعِيلَ ابْنِ عُلَيَّةَ عَنْ يُونُسَ عَنْ عَطَاءِ بْنِ فَرُّوخَ عَنْ عُثْمَانَ بْنِ عَفَّانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْخَلَ اللَّهُ عَزَّ وَجَلَّ رَجُلًا كَانَ سَهْلًا مُشْتَرِيًا وَبَائِعًا وَقَاضِيًا وَمُقْتَضِيًا الْجَنَّةَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin Ishaq] dari [Isma'il bin 'Ulayyah] dari [Yunus] dari ['Atho` bin Farrukh] dari [Utsman bin Affan] dia berkata; \"Allah shallallahu 'alaihi wasallam bersabda: \"Allah Azza wa jalla memasukkan kedalam surga seseorang yang memudahkan (dalam) menjual dan membeli, memberikan hutang, dan menagih pembayaran hutangnya.\""
            },
            {
                "number": 4402,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَاشْتَرَكْتُ أَنَا وَعَمَّارٌ وَسَعْدٌ يَوْمَ بَدْرٍ فَجَاءَ سَعْدٌ بِأَسِيرَيْنِ وَلَمْ أَجِئْ أَنَا وَعَمَّارٌ بِشَيْءٍ",
                "id": "Telah mengabarkan kepadaku ['Amru bin Ali] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepadaku [Abu Ishaq] dari [Abu 'Ubaidah] dari [Abdullah], dia berkata; \"Saya, 'Ammar dan Sa'd berserikat pada saat perang Badr, kemudian Sa'd datang membawa dua orang tawanan sedang saya dan 'Ammar tidak membawa sesuatupun."
            },
            {
                "number": 4403,
                "arab": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ أُتِمَّ مَا بَقِيَ فِي مَالِهِ إِنْ كَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ",
                "id": "Telah mengabarkan kepada kami [Nuh bin Habib] telah memberitakan kepada kami [Abdur Razzaq] telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memerdekakan bagiannya pada seorang budak maka bagian yang tersisa dari hartanya akan disempurnakan apabila dia memiliki harta yang mencapai harga budak tersebut.\""
            },
            {
                "number": 4404,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ وَكَانَ لَهُ مِنْ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ بِقِيمَةِ الْعَبْدِ فَهُوَ عَتِيقٌ مِنْ مَالِهِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yazid yaitu Ibnu Zurai'] telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memerdekakan bagiannya pada seorang budak padahal dia memiliki harta yang tidak mencapai seluruh harga budak tersebut maka dia dibebaskan dari hartanya tersebut.\""
            },
            {
                "number": 4405,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّكُمْ كَانَتْ لَهُ أَرْضٌ أَوْ نَخْلٌ فَلَا يَبِعْهَا حَتَّى يَعْرِضَهَا عَلَى شَرِيكِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam bersabda: 'Siapapun di antara kalian yang memiliki tanah atau pohon kurma maka janganlah dia menjualnya hingga menawarkannya kepada sekutunya.\""
            },
            {
                "number": 4406,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ أَنْبَأَنَا ابْنُ إِدْرِيسَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشُّفْعَةِ فِي كُلِّ شَرِكَةٍ لَمْ تُقْسَمْ رَبْعَةٍ وَحَائِطٍ لَا يَحِلُّ لَهُ أَنْ يَبِيعَهُ حَتَّى يُؤْذِنَ شَرِيكَهُ فَإِنْ شَاءَ أَخَذَ وَإِنْ شَاءَ تَرَكَ وَإِنْ بَاعَ وَلَمْ يُؤْذِنْهُ فَهُوَ أَحَقُّ بِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] telah memberitakan kepada kami [Ibnu Idris] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memutuskan dengan hak syuf'ah pada setiap serikat yang belum dibagi, rumah dan kebun. Tidak halal baginya untuk menjualnya hingga dia memberitahukan kepada sekutunya jika mau maka dia mengambilnya dan jika mau maka dia meninggalkannya, dan apabila dia menjual tanpa persetujuan sekutunya maka sekutunya lebih berhak terhadapnya.\""
            },
            {
                "number": 4407,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِي رَافِعٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَارُ أَحَقُّ بِسَقَبِهِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] dari ['Amru bin Asy Syarid] dari [Abu Rafi'], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak terhadap apa yang dekat dengan rumahnya.\""
            },
            {
                "number": 4408,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ أَرْضِي لَيْسَ لِأَحَدٍ فِيهَا شَرِكَةٌ وَلَا قِسْمَةٌ إِلَّا الْجُوَارَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَارُ أَحَقُّ بِسَقَبِهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami ['Isa bin Yunus] telah menceritakan kepada kami [Husain Al Mu'allim] dari ['Amru bin Syu'aib] dari ['Amru bin Asy Syarid] dari [ayahnya] bahwa seseorang berkata; \"Wahai Rasulullah, tidak ada yang berserikat dalam kepemilikan tanahku dan tidak ada yang mendapatkan bagian kecuali hanya tetangga.\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang tetangga itu lebih berhak terhadap apa yang dekat dengannya.\""
            },
            {
                "number": 4409,
                "arab": "أَخْبَرَنَا هِلَالُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشُّفْعَةُ فِي كُلِّ مَالٍ لَمْ يُقْسَمْ فَإِذَا وَقَعَتْ الْحُدُودُ وَعُرِفَتْ الطُّرُقُ فَلَا شُفْعَةَ",
                "id": "Telah mengabarkan kepada kami [Hilal bin Bisyr] telah menceritakan kepada kami [Shafwan bin 'Isa] dari [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hak untuk membeli terlebih dahulu ada pada setiap harta yang belum dibagi, apabila telah dibuat batasan dan telah diketahui jalannya maka tidak ada hak membeli terlebih dahulu.\""
            },
            {
                "number": 4410,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ حُسَيْنٍ وَهُوَ ابْنُ وَاقِدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشُّفْعَةِ وَالْجِوَارِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul Aziz bin Abu Rizmah] telah menceritakan kepada kami [Al Fadhl bin Musa] dari [Husain yaitu Ibnu Waqid] dari [Abu Az Zubair] dari [Jabir], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah memutuskan dengan hak membeli terlebih dahulu dan hak tetangga.\""
            },
            {
                "number": 4411,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو مَعْمَرٍ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا قَطَنٌ أَبُو الْهَيْثَمِ قَالَ حَدَّثَنَا أَبُو يَزِيدَ الْمَدَنِيُّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَأَوَّلُ قَسَامَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ كَانَ رَجُلٌ مِنْ بَنِي هَاشِمٍ اسْتَأْجَرَ رَجُلًا مِنْ قُرَيْشٍ مِنْ فَخِذِ أَحَدِهِمْ قَالَ فَانْطَلَقَ مَعَهُ فِي إِبِلِهِ فَمَرَّ بِهِ رَجُلٌ مِنْ بَنِي هَاشِمٍ قَدْ انْقَطَعَتْ عُرْوَةُ جُوَالِقِهِ فَقَالَ أَغِثْنِي بِعِقَالٍ أَشُدُّ بِهِ عُرْوَةَ جُوَالِقِي لَا تَنْفِرُ الْإِبِلُ فَأَعْطَاهُ عِقَالًا يَشُدُّ بِهِ عُرْوَةَ جُوَالِقِهِ فَلَمَّا نَزَلُوا وَعُقِلَتْ الْإِبِلُ إِلَّا بَعِيرًا وَاحِدًا فَقَالَ الَّذِي اسْتَأْجَرَهُ مَا شَأْنُ هَذَا الْبَعِيرِ لَمْ يُعْقَلْ مِنْ بَيْنِ الْإِبِلِ قَالَ لَيْسَ لَهُ عِقَالٌ قَالَ فَأَيْنَ عِقَالُهُ قَالَ مَرَّ بِي رَجُلٌ مِنْ بَنِي هَاشِمٍ قَدْ انْقَطَعَتْ عُرْوَةُ جُوَالِقِهِ فَاسْتَغَاثَنِي فَقَالَ أَغِثْنِي بِعِقَالٍ أَشُدُّ بِهِ عُرْوَةَ جُوَالِقِي لَا تَنْفِرُ الْإِبِلُ فَأَعْطَيْتُهُ عِقَالًا فَحَذَفَهُ بِعَصًا كَانَ فِيهَا أَجَلُهُ فَمَرَّ بِهِ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ أَتَشْهَدُ الْمَوْسِمَ قَالَ مَا أَشْهَدُ وَرُبَّمَا شَهِدْتُ قَالَ هَلْ أَنْتَ مُبَلِّغٌ عَنِّي رِسَالَةً مَرَّةً مِنْ الدَّهْرِ قَالَ نَعَمْ قَالَ إِذَا شَهِدْتَ الْمَوْسِمَ فَنَادِ يَا آلَ قُرَيْشٍ فَإِذَا أَجَابُوكَ فَنَادِ يَا آلَ هَاشِمٍ فَإِذَا أَجَابُوكَ فَسَلْ عَنْ أَبِي طَالِبٍ فَأَخْبِرْهُ أَنَّ فُلَانًا قَتَلَنِي فِي عِقَالٍ وَمَاتَ الْمُسْتَأْجَرُ فَلَمَّا قَدِمَ الَّذِي اسْتَأْجَرَهُ أَتَاهُ أَبُو طَالِبٍ فَقَالَ مَا فَعَلَ صَاحِبُنَا قَالَ مَرِضَ فَأَحْسَنْتُ الْقِيَامَ عَلَيْهِ ثُمَّ مَاتَ فَنَزَلْتُ فَدَفَنْتُهُ فَقَالَ كَانَ ذَا أَهْلَ ذَاكَ مِنْكَ فَمَكُثَ حِينًا ثُمَّ إِنَّ الرَّجُلَ الْيَمَانِيَّ الَّذِي كَانَ أَوْصَى إِلَيْهِ أَنْ يُبَلِّغَ عَنْهُ وَافَى الْمَوْسِمَ قَالَ يَا آلَ قُرَيْشٍ قَالُوا هَذِهِ قُرَيْشٌ قَالَ يَا آلَ بَنِي هَاشِمٍ قَالُوا هَذِهِ بَنُو هَاشِمٍ قَالَ أَيْنَ أَبُو طَالِبٍ قَالَ هَذَا أَبُو طَالِبٍ قَالَ أَمَرَنِي فُلَانٌ أَنْ أُبَلِّغَكَ رِسَالَةً أَنَّ فُلَانًا قَتَلَهُ فِي عِقَالٍ فَأَتَاهُ أَبُو طَالِبٍ فَقَالَ اخْتَرْ مِنَّا إِحْدَى ثَلَاثٍ إِنْ شِئْتَ أَنْ تُؤَدِّيَ مِائَةً مِنْ الْإِبِلِ فَإِنَّكَ قَتَلْتَ صَاحِبَنَا خَطَأً وَإِنْ شِئْتَ يَحْلِفْ خَمْسُونَ مِنْ قَوْمِكَ أَنَّكَ لَمْ تَقْتُلْهُ فَإِنْ أَبَيْتَ قَتَلْنَاكَ بِهِ فَأَتَى قَوْمَهُ فَذَكَرَ ذَلِكَ لَهُمْ فَقَالُوا نَحْلِفُ فَأَتَتْهُ امْرَأَةٌ مِنْ بَنِي هَاشِمٍ كَانَتْ تَحْتَ رَجُلٍ مِنْهُمْ قَدْ وَلَدَتْ لَهُ فَقَالَتْ يَا أَبَا طَالِبٍ أُحِبُّ أَنْ تُجِيزَ ابْنِي هَذَا بِرَجُلٍ مِنْ الْخَمْسِينَ وَلَا تُصْبِرْ يَمِينَهُ فَفَعَلَ فَأَتَاهُ رَجُلٌ مِنْهُمْ فَقَالَ يَا أَبَا طَالِبٍ أَرَدْتَ خَمْسِينَ رَجُلًا أَنْ يَحْلِفُوا مَكَانَ مِائَةٍ مِنْ الْإِبِلِ يُصِيبُ كُلَّ رَجُلٍ بَعِيرَانِ فَهَذَانِ بَعِيرَانِ فَاقْبَلْهُمَا عَنِّي وَلَا تُصْبِرْ يَمِينِي حَيْثُ تُصْبَرُ الْأَيْمَانُ فَقَبِلَهُمَا وَجَاءَ ثَمَانِيَةٌ وَأَرْبَعُونَ رَجُلًا حَلَفُوا قَالَ ابْنُ عَبَّاسٍ فَوَالَّذِي نَفْسِي بِيَدِهِ مَا حَالَ الْحَوْلُ وَمِنْ الثَّمَانِيَةِ وَالْأَرْبَعِينَ عَيْنٌ تَطْرِفُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Qathan Abu Al Haitsam] telah menceritakan kepada kami [Abu Yazid Al Madani] dari [Ikrimah] dari [Ibnu Abbas], dia berkata; \"Qosamah (limapuluh orang bersumpah untuk menghilangkan tuduhan membunuh) yang pertama kali dilakukan pada masa Jahiliyah adalah terhadap seorang dari Bani Hasyim yang mempekerjakan seorang Quraisy dari salah kabilah mereka. Ibnu Abbas berkata; \"Lalu dia pergi bersamanya mengendarai untanya, lalu lewatlah seseorang dari Bani Hasyim yang gagang bejananya yang terbuat dari kulit putus, dia berkata; \"Bantulah aku dengan tali agar aku bisa mengikat gagang bejanaku, unta itu tidak akan kabur.\" Lalu dia memberinya tali untuk mengikat gagang bejananya, ketika mereka singgah dan unta-unta diikat kecuali seekor, majikannya berkata; \"Ada apa dengan unta ini, kenapa dia tidak diikat seperti unta yang lain?\" Pekerjanya menjawab; \"Dia tidak memiliki tali pengikat.\" Majikan berkata; \"Dimana tali pengikatnya?\" Pekerja menjawab; \"Seseorang dari Bani Hasyim yang gagang bejananya putus lewat di depanku. Dia meminta tolong kepadaku dan berkata tolonglah aku dengan sebuah tali hingga aku ikat gagang bejanaku, unta itu tidak akan kabur, lalu aku memberinya. Kemudian majikan itu memukulnya dengan tongkat yang dia bawa yang menjadi penyebab kematiannya. Lalu datanglah seorang penduduk Yaman, sang pekerja berkata; \"Apakah engkau pernah menghadiri Mausim (musim haji)?\" Penduduk Yaman menjawab; \"Aku tidak bisa hadir atau mungkin aku pernah menghadirinya.\" Dia berkata; \"Maukah engkau menyampaikan pesan dariku untuk sekali ini saja?\" Dia menjawab; \"Ya.\" Sang pekerja berkata; \"Jika engkau menghadiri Mausim maka serulah, 'Hai orang-orang quraisy', jika mereka menjawabmu maka panggillah, 'Hai orang-orang Bani Hasyim', jika mereka menjawabmu maka tanyakan perihal Abu Thalib dan kabarkan kepadanya bahwa Fulan membunuhku karena sebuah tali.\" Lalu matilah si pekerja. Ketika si majikan datang, Abu Thalib menemuinya dan berkata; \"Apa yang terjadi dengan teman kami?\" Dia menjawab, \"Dia sakit lalu aku mengobatinya, lalu dia mati maka aku singgah di suatu tempat dan menguburnya.\" Abu Tholib berkata; \"Dia memiliki pekerjaan bagimu, lalu dia berhenti sejenak kemudian datanglah seorang penduduk Yaman yang dia beri wasiat agar dia sampaikan di Mausim. Dia berkata; \"Wahai orang-orang Quraisy!\" Mereka menjawab; \"Ini kami, orang-orang Quraisy.\" \"Wahai orang-orang Bani Hasyim!\" Mereka menjawab; \"Ini kami, orang-orang Bani Hasyim.\" \"Di mana Abu Thalib?\" \"Ini dia Abu Tholib.\" Dia berkata; \"Sesungguhnya Fulan menyuruhku untuk menyampaikan pesan bahwa fulan membunuhnya dengan sebab tali pengikat, lalu Abu Thalib berkata; \"Pilihlah salah satu di antara tiga hal, jika engkau mau maka engkau membayar seratus ekor unta, karena engkau membunuh teman kami secara salah, jika engkau mau maka limapuluh orang dari kaummu bersumpah bahwa engkau tidak membunuhnya, jika engkau enggan maka kami akan membunuhmu.\" Lalu dia mendatangi kaumnya dan mengabari mereka, mereka berkata; \"Kami akan bersumpah.\" lalu seorang wanita dari Bani Hasyim yang pernah menjadi isteri salah seorang dari mereka dan telah melahirkan anaknya berkata; \"Wahai Abu Thalib aku ingin agar engkau memasukkan anak ini ke dalam lima puluh orang dan janganlah engkau anggap sumpahnya.\" Abu Tholib pun melakukannya, lalu datanglah seorang laki-laki dari mereka dan berkata; \"Wahai Abu Thalib, engkau ingin agar lima puluh orang bersumpah untuk mengganti seratus ekor unta, sehingga setiap orang sama dengan dua ekor unta, ini ada dua ekor unta ambillah dariku dan janganlah engkau anggap sumpahku, sebagaimana sumpah-sumpah yang lain.\" Lalu Abu Tholib pun menerima keduanya. Maka datanglah empat puluh delapan orang, mereka bersumpa., Ibnu Abbas berkata; \"Demi Dzat yang jiwaku berada ditanganNya, tidak sampai satu tahun empat puluh delapan orang itu semuanya meninggal.\" "
            },
            {
                "number": 4412,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَيُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَحْمَدُ بْنُ عَمْرٍو قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ وَسُلَيْمَانُ بْنُ يَسَارٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْأَنْصَارِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَرَّ الْقَسَامَةَ عَلَى مَا كَانَتْ عَلَيْهِ فِي الْجَاهِلِيَّةِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amru bin As Sarh] dan [Yunus bin Abdul A'la] telah memberitakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah berkata Ahmad bin 'Amru telah mengabarkan kepadaku [Abu Salamah] dan [Sulaiman bin Yasar] dari [seorang laki-laki] sahabat Rasulullah shallallahu 'alaihi wasallam dari kalangan Anshar bahwa Rasulullah shallallahu 'alaihi wasallam telah menetapkan qasamah sebagaimana yang terjadi pada zaman jahiliyah. "
            },
            {
                "number": 4413,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ وَسُلَيْمَانَ بْنِ يَسَارٍ عَنْ أُنَاسٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ الْقَسَامَةَ كَانَتْ فِي الْجَاهِلِيَّةِ فَأَقَرَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَا كَانَتْ عَلَيْهِ فِي الْجَاهِلِيَّةِ وَقَضَى بِهَا بَيْنَ أُنَاسٍ مِنْ الْأَنْصَارِ فِي قَتِيلٍ ادَّعَوْهُ عَلَى يَهُودِ خَيْبَرَخَالَفَهُمَا مَعْمَرٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hasyim] telah menceritakan kepada kami [Al Walid] telah menceritakan kepada kami [Al Auza'I] dari [Ibnu Syihab] dari [Abu Salamah] dan [Sulaiman bin Yasar] dari [beberapa orang sahabat] Rasulullah shallallahu 'alaihi wasallam bahwa qasamah terjadi pada masa Jahiliyah kemudian Rasulullah shallallahu 'alaihi wasallam menetapkannya sebagaimana yang terjadi pada zaman jahiliyah. Dan beliau memberikan keputusan dengannya terhadap orang-orang Anshar mengenai seseorang yang terbunuh dan mereka menuduh orang-orang Yahudi Khaibar yang melakukannya. Ma'mar menyelisihi keduanya. "
            },
            {
                "number": 4414,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ قَالَكَانَتْ الْقَسَامَةُ فِي الْجَاهِلِيَّةِ ثُمَّ أَقَرَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْأَنْصَارِيِّ الَّذِي وُجِدَ مَقْتُولًا فِي جُبِّ الْيَهُودِ فَقَالَتْ الْأَنْصَارُ الْيَهُودُ قَتَلُوا صَاحِبَنَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnu Al Musayyab], dia berkata; \"Telah terjadi qasamah pada zaman jahiliyah kemudian Rasulullah shallallahu 'alaihi wasallam menetapkannya pada seorang anshar yang didapatkan dalam keadaan terbunuh di wilayah Yahudi, maka orang-orang Anshar berkata orang-orang Yahudi telah membunuh seorang sahabat kami.\""
            },
            {
                "number": 4415,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَنْصَارِيِّ أَنَّ سَهْلَ بْنَ أَبِي حَثْمَةَ أَخْبَرَهُأَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمَا فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ فَقَالُوا وَاللَّهِ مَا قَتَلْنَاهُ ثُمَّ أَقْبَلَ حَتَّى قَدِمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ ثُمَّ أَقْبَلَ هُوَ وَحُوَيِّصَةُ وَهُوَ أَخُوهُ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ كَبِّرْ وَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذَنُوا بِحَرْبٍ فَكَتَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ تَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ قَالُوا لَا قَالَ فَتَحْلِفُ لَكُمْ يَهُودُ قَالُوا لَيْسُوا مُسْلِمِينَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمْ الدَّارَقَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amru bin As Sarh] telah memberitakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik bin Anas] dari [Abu Laila bin Abdullah bin Abdur Rahman Al Anshari] bahwa [Sahl bin Abu Hatsmah] telah mengabarkan kepadanya bahwa Abdullah bin Sahl dan Muhayyishah keluar ke Khaibar karena kesusahan yang menimpa mereka berdua. Kemudian Muhayyishah di datangi dan diberitahu bahwa Abdullah bin Sahl telah terbunuh dan dicampakkan di dalam sumur atau mata air. Kemudian dia mendatangi orang-orang Yahudi lalu berkata; \"Demi Allah, kalian telah membunuhnya.\" Mereka berkata; \"Demi Allah, kami tidak membunuhnya. Kemudian dia berbalik hingga kemudian dia datang menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Kemudian dia dan Huwayyishah yaitu saudara tuanya serta Abdur Rahman bin Sahl datang, lalu Muhayyishah yang tadinya berada di Khaibar maju untuk berbicara, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulukan orang yang paling tua.\" Dan Huwayyishah berbicara kemudian Muhayyishah berbicara. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mereka membayar diyat sahabat kalian atau mereka mengumumkan peperangan?\" Kemudian Nabi shallallahu 'alaihi wasallam menulis surat kepada mereka mengenai hal tersebut, lalu mereka membalas; \"Sesungguhnya kami demi Allah, tidak membunuhnya.\" Kemudian beliau bersabda kepada Huwayyishah dan Muhayyishah serta Abdur Rahman: \"Apakah kalian mau bersumpah dan berhak terhadap darah sahabat kalian?\" mereka berkata; \"Tidak.\" Beliau bersabda: \"Apakah kalian mau orang-orang Yahudi bersumpah kepada kalian?\" Mereka berkata; \"Mereka bukanlah orang-orang muslim. Kemudian Rasulullah shallallahu 'alaihi wasallam membayarnya dari harta beliau, beliau mengirimkan kepada mereka seratus unta hingga dimasukkan ke rumah mereka. Sahl berkata; \"Sungguh seekor unta merah dari unta-unta tersebut menyepakku dengan kakinya.\""
            },
            {
                "number": 4416,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ أَنَّهُأَخْبَرَهُ وَرِجَالٌ كُبَرَاءُ مِنْ قَوْمِهِ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأَتَى مُحَيِّصَةُ فَأَخْبَرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ وَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ قَالُوا وَاللَّهِ مَا قَتَلْنَاهُ فَأَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمُحَيِّصَةَ كَبِّرْ كَبِّرْ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذَنُوا بِحَرْبٍ فَكَتَبَ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ قَالُوا لَا قَالَ فَتَحْلِفُ لَكُمْ يَهُودُ قَالُوا لَيْسُوا بِمُسْلِمِينَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمْ الدَّارَقَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] telah memberitakan kepada kami [Ibnu Al Qasim] telah menceritakan kepadaku [Malik] dari [Abu Laila bin Abdullah bin Abdur Rahman bin Sahl bin Abu Hatsmah] dari [Sahal bin Abi Hatsmah] bahwa dia dan beberapa orang pembesar kaumnya telah mengabarkan kepadanya bahwa Abdullah bin Sahl dan Muhayyishah keluar menuju Khaibar Karena kesusahan yang menimpa mereka. Kemudian Muhayyishah datang dan mengabarkan bahwa Abdullah bin Sahl telah terbunuh dan dilemparkan ke dalam sumur atau mata air. Kemudian dia datang kepada orang-orang Yahudi dan berkata; \"Demi Allah, kalian telah membunuhnya.\" Mereka berkata; \"Demi Allah, kami tidak membunuhnya.\" Kemudian ia pergi hingga datang kepada Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Kemudian dia dan Huwayyishah yaitu kakaknya serta Abdur Rahman bin Sahl datang, lalu Muhayyishah yang tadinya berada di Khaibar maju untuk berbicara, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulukan orang yang paling tua.\" Dan Huwayyishah berbicara kemudian Muhayyishah berbicara. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mereka membayar diyat sahabat kalian atau mereka mengumumkan peperangan?\" kemudian Nabi shallallahu 'alaihi wasallam menulis surat kepada mereka mengenai hal tersebut, lalu mereka menulis; \"Sesungguhnya kami demi Allah, tidak membunuhnya.\" Kemudian beliau bersabda kepada Huwayyishah dan Muhayyishah serta Abdur Rahman: \"Apakah kalian bersumpah dan berhak terhadap darah sahabat kalian?\" mereka berkata; \"Tidak.\" Beliau bersabda: \"Apakah kalian mau orang-orang Yahudi bersumpah untuk kalian?\" mereka berkata; \"Mereka bukanlah orang-orang muslim.\" Kemudian Rasulullah shallallahu 'alaihi wasallam membayarnya dari harta beliau, lalu beliau mengirimkan kepada mereka seratus unta hingga dimasukkan ke rumah mereka. Sahl berkata; \"Sungguh seekor unta merah dari unta-unta tersebut menyepakku dengan kakinya.\" "
            },
            {
                "number": 4417,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَ وَحَسِبْتُ قَالَ وَعَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّهُمَا قَالَاخَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلِ بْنِ زَيْدٍ وَمُحَيِّصَةُ بْنُ مَسْعُودٍ حَتَّى إِذَا كَانَا بِخَيْبَرَ تَفَرَّقَا فِي بَعْضِ مَا هُنَالِكَ ثُمَّ إِذَا بِمُحَيِّصَةَ يَجِدُ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلًا فَدَفَنَهُ ثُمَّ أَقْبَلَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَكَانَ أَصْغَرَ الْقَوْمِ فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ قَبْلَ صَاحِبَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ الْكُبْرَ فِي السِّنِّ فَصَمَتَ وَتَكَلَّمَ صَاحِبَاهُ ثُمَّ تَكَلَّمَ مَعَهُمَا فَذَكَرُوا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتَلَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ صَاحِبَكُمْ أَوْ قَاتِلَكُمْ قَالُوا كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ قَالَ فَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا قَالُوا وَكَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ عَقْلَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah], dia berkata; \"Saya mengira dia mengatakan; dan dari [Rafi' bin Khadij] bahwa mereka berkata; \"Abdullah bin Sahl bin Zaid dan Muhayyishah bin Mas'ud telah keluar hingga ketika mereka sampai di Khaibar mereka berpisah di sebagian tempat di sana, kemudian Muhayyishah mendapatkan Abdullah bin Sahl terbunuh. Lalu dia menguburnya kemudian menghadap kepada Rasulullah shallallahu 'alaihi wasallam bersama dengan Huwayyishah bin Mas'ud serta Abdur Rahman bin Sahl dan dia adalah orang yang paling muda. Kemudian Abdur Rahman pergi untuk berbicara sebelum dua orang sahabatnya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Dahulukanlah yang tua.\" Kemudian dia diam dan dua orang sahabatnya berbicara, kemudian dia berbicara bersama mereka dan mereka menyebutkan kepada Rasulullah shallallahu 'alaihi wasallam mengenai terbunuhnya Abdullah bin Sahl. Lalu beliau bersabda: \"Apakah kalian bersumpah lima puluh sumpah dan kalian berhak terhadap sahabat kalian atau terhadap orang yang menyerang kalian?\" Mereka berkata; \"Bagaimana kami bersumpah sedang kami belum menyaksikan?\" Kemudian beliau bersabda: \"Apakah kalian mau orang-orang Yahudi akan bebas dari tuduhan kalian dengan lima puluh sumpah?\" Mereka berkata; \"Bagaimana kami menerima sumpah orang-orang kafir?\" Kemudian tatkala Rasulullah shallallahu 'alaihi wasallam melihat hal tersebut beliau memberikan diyatnya.\""
            },
            {
                "number": 4418,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ أَنْبَأَنَا حَمَّادٌ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ وَرَافِعِ بْنِ خَدِيجٍ أَنَّهُمَا حَدَّثَاهُأَنَّ مُحَيِّصَةَ بْنَ مَسْعُودٍ وَعَبْدَ اللَّهِ بْنَ سَهْلٍ أَتَيَا خَيْبَرَ فِي حَاجَةٍ لَهُمَا فَتَفَرَّقَا فِي النَّخْلِ فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَجَاءَ أَخُوهُ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ ابْنَا عَمِّهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَكَلَّمَ عَبْدُ الرَّحْمَنِ فِي أَمْرِ أَخِيهِ وَهُوَ أَصْغَرُ مِنْهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكُبْرَ لِيَبْدَأْ الْأَكْبَرُ فَتَكَلَّمَا فِي أَمْرِ صَاحِبِهِمَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرَ كَلِمَةً مَعْنَاهَا يُقْسِمُ خَمْسُونَ مِنْكُمْ فَقَالُوا يَا رَسُولَ اللَّهِ أَمْرٌ لَمْ نَشْهَدْهُ كَيْفَ نَحْلِفُ قَالَ فَتُبَرِّئُكُمْ يَهُودُ بِأَيْمَانِ خَمْسِينَ مِنْهُمْ قَالُوا يَا رَسُولَ اللَّهِ قَوْمٌ كُفَّارٌ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قِبَلِهِقَالَ سَهْلٌ فَدَخَلْتُ مِرْبَدًا لَهُمْ فَرَكَضَتْنِي نَاقَةٌ مِنْ تِلْكَ الْإِبِلِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdah] telah memberitakan kepada kami [Hammad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] dan [Rafi' bin Khadij] bahwa mereka telah menceritakan kepadanya bahwa Muhayyishah bin Mas'ud dan Abdullah bin Sahl datang ke Khaibar untuk suatu keperluan kemudian mereka berpisah di sebuah pohon kurma, lalu Abdullah bin Sahl terbunuh maka saudaranya yaitu Abdur Rahman bin Sahl serta Huwayyishah dan Muhayyishah yakni dua orang anak pamannya datang kepada Rasulullah shallallahu 'alaihi wasallam. Lalu Abdur Rahman berbicara mengenai perkara saudaranya padahal dia adalah orang yang paling muda di antara mereka. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya yang lebih tua memulai terlebih dahulu.\" Kemudian mereka berdua berbicara mengenai perkara sahabat mereka berdua. Kemudian Rasulullah shallallahu 'alaihi wasallam menyebutkan suatu kalimat yang maknanya; lima puluh orang dari kalian bersumpah. Maka mereka berkata; \"Wahai Rasulullah, itu adalah suatu perkara yang tidak kami saksikansendiri, bagaimana kami bersumpah?\" Beliau bersabda: \"Kalian mau orang-orang Yahudi akan bebas dari tuduhan kalian dengan sumpah lima puluh orang di antara mereka.\" Mereka berkata; \"Wahai Rasulullah, mereka adalah orang-orang kafir.\" Kemudian Rasulullah shallallahu 'alaihi wasallam membayar diyatnya dari beliau sendiri. Sahl berkata; \"Saya memasuki kandang milik mereka, kemudian saya disepak oleh seekor unta dari unta-unta tersebut.\""
            },
            {
                "number": 4419,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا بِشْرٌ وَهُوَ ابْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ بْنَ مَسْعُودِ بْنِ زَيْدٍ أَنَّهُمَا أَتَيَا خَيْبَرَ وَهُوَ يَوْمَئِذٍ صُلْحٌ فَتَفَرَّقَا لِحَوَائِجِهِمَا فَأَتَى مُحَيِّصَةُ عَلَى عَبْدِ اللَّهِ بْنِ سَهْلٍ وَهُوَ يَتَشَحَّطُ فِي دَمِهِ قَتِيلًا فَدَفَنَهُ ثُمَّ قَدِمَ الْمَدِينَةَ فَانْطَلَقَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ وَهُوَ أَحْدَثُ الْقَوْمِ سِنًّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ الْكُبْرَ فَسَكَتَ فَتَكَلَّمَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَحْلِفُونَ بِخَمْسِينَ يَمِينًا مِنْكُمْ فَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَرَ قَالَ تُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَأْخُذُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَعَقَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Bisyr yaitu Ibnu Al Mufadhdhal] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] bahwa Abdullah bin Sahl dan Muhayyishah bin Mas'ud bin Zaid datang ke Khaibar pada saat terjadi perdamaian, kemudian mereka berpisah untuk keperluan mereka. Kemudian Muhayyishah mendatangi Abdullah bin Sahl yang mati berlumuran darah, lalu dia menguburkannya. Kemudian dia tiba di Madinah. Maka berangkatlah Abdur Rahman bin Sahl, Huwayyishah dan Muhayyishah menemui Rasulullah shallallahu 'alaihi wasallam, kemudian Abdur Rahman maju untuk berbicara, padahal dia adalah orang yang paling muda. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulukan orang yang paling tua.\" Lalu dia diam kemudian mereka berdua berbicara, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian mau bersumpah dengan lima puluh sumpah dari kalian kemudian mendapat hak terhadap darah sahabat kalian atau terhadap orang yang membunuh kalian?\" Mereka berkata; \"Wahai Rasulullah, bagaimana kami bersumpah sedangkan kami tidak menyaksikan dan tidak melihat?\" Beliau bersabda: \"Kalian mau orang-orang Yahudi akan bebas dari tuduhan kalian dengan lima puluh sumpah?\" Mereka berkata; \"Wahai Rasulullah, bagaimana kami mengambil sumpah orang-orang kafir?\" Kemudian Rasulullah shallallahu 'alaihi wasallam membayar diyatnya dari beliau sendiri. "
            },
            {
                "number": 4420,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَانْطَلَقَ عَبْدُ اللَّهِ بْنُ سَهْلٍ وَمُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ إِلَى خَيْبَرَ وَهِيَ يَوْمَئِذٍ صُلْحٌ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَأَتَى مُحَيِّصَةُ عَلَى عَبْدِ اللَّهِ بْنِ سَهْلٍ وَهُوَ يَتَشَحَّطُ فِي دَمِهِ قَتِيلًا فَدَفَنَهُ ثُمَّ قَدِمَ الْمَدِينَةَ فَانْطَلَقَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ ابْنَا مَسْعُودٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ الْكُبْرَ وَهُوَ أَحْدَثُ الْقَوْمِ فَسَكَتَ فَتَكَلَّمَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَحْلِفُونَ بِخَمْسِينَ يَمِينًا مِنْكُمْ وَتَسْتَحِقُّونَ قَاتِلَكُمْ أَوْ صَاحِبَكُمْ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَرَ فَقَالَ أَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَأْخُذُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَعَقَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Bisyr bin Al Mufadhdhal] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah], dia berkata; \"Abdullah bin Sahl dan Muhayyishah bin Mas'ud bin Zaid datang ke Khaibar dan pada saat itu terjadi perdamaian. Kemudian mereka berpisah untuk keperluan mereka. Lalu Muhayyishah menemui Abdullah bin Sahl telah terbunuh berlumuran darah. Lalu dia menguburkannya. Kemudian dia tiba di Madinah, maka Abdur Rahman bin Sahl dan Huwaishah serta Muhayyishah bin Mas'ud datang menemui Rasulullah shallallahu 'alaihi wasallam. Lalu Abdur Rahman maju untuk berbicara, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulukan orang yang tertua.\" Dia adalah orang yang paling muda, maka dia pun terdiam kemudian mereka berbicara. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian mau bersumpah lima puluh kali sumpah dari kalian dan berhak terhadap orang yang membunuh kalian atau terhadap sahabat kalian?\" Mereka berkata; \"Wahai Rasulullah, bagaimana kami bersumpah sedangkan kami tidak menyaksikan, dan belum melihat?\" Beliau bersabda: \"Apakah kalian mau orang-orang Yahudi akan terbebas dari tuduhan kalian dengan lima kali sumpah?\" Maka mereka berkata; \"Wahai Rasulullah, bagaimana kami mengambil sumpah orang-orang kafir?\" Kemudian Rasulullah shallallahu 'alaihi wasallam membayar diyat dari beliau sendiri. "
            },
            {
                "number": 4421,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ يَقُولُ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الْأَنْصَارِيَّ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَاجَتِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ الْأَنْصَارِيُّ فَجَاءَ مُحَيِّصَةُ وَعَبْدُ الرَّحْمَنِ أَخُو الْمَقْتُولِ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ حَتَّى أَتَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكُبْرَ الْكُبْرَ فَتَكَلَّمَ مُحَيِّصَةُ وَحُوَيِّصَةُ فَذَكَرُوا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحْلِفُونَ خَمْسِينَ يَمِينًا فَتَسْتَحِقُّونَ قَاتِلَكُمْ قَالُوا كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَحْضُرْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ بُشَيْرٌ قَالَ لِي سَهْلُ بْنُ أَبِي حَثْمَةَ لَقَدْ رَكَضَتْنِي فَرِيضَةٌ مِنْ تِلْكَ الْفَرَائِضِ فِي مِرْبَدٍ لَنَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdul Wahhab], dia berkata; saya mendengar [Yahya bin Sa'id] berkata; telah mengabarkan kepadaku [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] bahwa Abdullah bin Sahl Al Anshari dan Muhayyishah bin Mas'ud keluar menuju khaibar, kemudian mereka berpisah untuk keperluan mereka, kemudian Abdullah bin Sahl Al Anshari terbunuh, lalu Muhayyishah dan Abdur Rahman saudara yang terbunuh serta Huwayyishah bin Mas'ud datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu Abdur Rahman maju untuk berbicara, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Dahulukan orang yang paling tua.\" Kemudian Muhayyishah dan Huwayyishah berbicara dan menyebutkan keadaan Abdullah bin Sahl. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian bersumpah lima puluh kali sumpah kemudian mendapatkan hak atas pembunuhnya?\" Mereka berkata; \"Bagaimana kami bersumpah sedangkan kami tidak menyaksikan dan tidak menghadiri?\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang Yahudi akan bebas dari tuduhan kalian dengan lima puluh kali sumpah. Mereka berkata; \"Wahai Rasulullah, bagaimana kita menerima sumpah orang-orang kafir?\" Sahl berkata; \"Kemudian Rasulullah shallallahu 'alaihi wasallam membayar diyatnya.\" Busyair berkata; \"Sahl bin Abu Hatsmah berkata kepadaku; \"Sungguh saya telah ditendang seekor unta dari unta-unta tersebut di dalam kandang milik kami.\" "
            },
            {
                "number": 4422,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَوُجِدَ عَبْدُ اللَّهِ بْنُ سَهْلٍ قَتِيلًا فَجَاءَ أَخُوهُ وَعَمَّاهُ حُوَيِّصَةُ وَمُحَيِّصَةُ وَهُمَا عَمَّا عَبْدِ اللَّهِ بْنِ سَهْلٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكُبْرَ الْكُبْرَ قَالَا يَا رَسُولَ اللَّهِ إِنَّا وَجَدْنَا عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلًا فِي قَلِيبٍ مِنْ بَعْضِ قُلُبِ خَيْبَرَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَتَّهِمُونَ قَالُوا نَتَّهِمُ الْيَهُودَ قَالَ أَفَتُقْسِمُونَ خَمْسِينَ يَمِينًا أَنَّ الْيَهُودَ قَتَلَتْهُ قَالُوا وَكَيْفَ نُقْسِمُ عَلَى مَا لَمْ نَرَ قَالَ فَتُبَرِّئُكُمْ الْيَهُودُ بِخَمْسِينَ أَنَّهُمْ لَمْ يَقْتُلُوهُ قَالُوا وَكَيْفَ نَرْضَى بِأَيْمَانِهِمْ وَهُمْ مُشْرِكُونَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِأَرْسَلَهُ مَالِكُ بْنُ أَنَسٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah], dia berkata; \"Abdullah bin Sahl didapatkan dalam keadaan terbunuh, kemudian saudara dan kedua pamannya yaitu Huwayyishah dan Muhayyishah datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu Abdur Rahman maju untuk berbicara, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulukan yang paling tua.\" Maka mereka berdua berkata; \"Wahai Rasulullah, sesungguhnya kami mendapati Abdullah bin Sahl dalam keadaan terbunuh di dalam sumur Khaibar.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Siapakah yang kalian tuduh?\" mereka berkata; \"Kami menuduh orang-orang Yahudi.\" Beliau bersabda: \"Apakah kalian mau bersumpah lima puluh kali sumpah bahwa orang-orang Yahudi telah membunuhnya?\" Mereka berkata; \"Bagaimana kami bersumpah terhadap apa yang tidak kami lihat?\" Beliau bersabda: \"Apakah kalian mau orang-orang Yahudi terbebas dari tuduhan kalian dengan bersumpah lima puluh sumpah bahwa mereka tidak membunuhnya?\" Mereka berkata; \"Bagaimana kita rela dengan sumpah mereka, sedangkan mereka adalah orang-orang musyrik?\" Kemudian Rasulullah shallallahu 'alaihi wasallam membayar diyat dari beliau sendiri. Hadits tersebut dimursalkan oleh Malik bin Anas. "
            },
            {
                "number": 4423,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ حَدَّثَنِي مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ أَنَّهُ أَخْبَرَهُأَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الْأَنْصَارِيَّ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَقَدِمَ مُحَيِّصَةُ فَأَتَى هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ لِمَكَانِهِ مِنْ أَخِيهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ كَبِّرْ فَتَكَلَّمَ حُوَيِّصَةُ وَمُحَيِّصَةُ فَذَكَرُوا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ قَالَ مَالِكٌ قَالَ يَحْيَى فَزَعَمَ بُشَيْرٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَاهُ مِنْ عِنْدِهِخَالَفَهُمْ سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ",
                "id": "Telah berkata [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Al Qasim], telah menceritakan kepadaku [Malik] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] bahwa dia telah mengabarkan kepadanya bahwa Abdullah bin Sahl Al Anshari dan Muhayyishah bin Mas'ud keluar menuju Khaibar kemudian mereka berpisah karena keperluan mereka. Lalu Abdullah bin Sahl terbunuh, kemudian Muhayyishah dan saudaranya yaitu Huwayyishah serta Abdur Rahman bin Sahl datang kepada Rasulullah shallallahu 'alaihi wasallam. Lalu Abdur Rahman maju untuk berbicara karena posisinya dari saudaranya yaitu Abdullah bin Sahl. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulukan yang lebih tua, dahulukan yang lebih tua.\" Lalu Huwayyishah dan Muhayyishah berbicara dan menyebutkan keadaan Abdullah bin Sahl. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian mau bersumpah lima puluh sumpah dan berhak terhadap darah sahabat kalian atau terhadap pembunuh kalian?\" Malik berkata; Yahya berkata; kemudian Busyair mengaku bahwa Rasulullah shallallahu 'alaihi wasallam membayar diyat dari beliau sendiri. Sa'id bin 'Ubaid Ath Thai menyelisihi hal tersebut.\""
            },
            {
                "number": 4424,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ عَنْ بُشَيْرِ بْنِ يَسَارٍزَعَمَ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ سَهْلُ بْنُ أَبِي حَثْمَةَ أَخْبَرَهُ أَنَّ نَفَرًا مِنْ قَوْمِهِ انْطَلَقُوا إِلَى خَيْبَرَ فَتَفَرَّقُوا فِيهَا فَوَجَدُوا أَحَدَهُمْ قَتِيلًا فَقَالُوا لِلَّذِينَ وَجَدُوهُ عِنْدَهُمْ قَتَلْتُمْ صَاحِبَنَا قَالُوا مَا قَتَلْنَاهُ وَلَا عَلِمْنَا قَاتِلًا فَانْطَلَقُوا إِلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا نَبِيَّ اللَّهِ انْطَلَقْنَا إِلَى خَيْبَرَ فَوَجَدْنَا أَحَدَنَا قَتِيلًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكُبْرَ الْكُبْرَ فَقَالَ لَهُمْ تَأْتُونَ بِالْبَيِّنَةِ عَلَى مَنْ قَتَلَ قَالُوا مَا لَنَا بَيِّنَةٌ قَالَ فَيَحْلِفُونَ لَكُمْ قَالُوا لَا نَرْضَى بِأَيْمَانِ الْيَهُودِ وَكَرِهَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبْطُلَ دَمُهُ فَوَدَاهُ مِائَةً مِنْ إِبِلِ الصَّدَقَةِخَالَفَهُمْ عَمْرُو بْنُ شُعَيْبٍ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sa'id bin 'Ubaid Ath Thai] dari [Busyair bin Yasar] mengaku bahwa seorang laki-laki Anshar yang dipanggil [Sahl bin Abu Hatsmah] telah mengabarkan kepadanya bahwa beberapa orang dari kaumnya pergi ke Khaibar lalu berpisah. Kemudian mereka mendapatkan salah seorang dari mereka terbunuh. Mereka berkata kepada orang-orang yang ada di sekitarnya; \"Kalian telah membunuh sahabat kami.\" Mereka berkata; \"Kami tidak membunuhnya dan tidak mengetahui siapa pembunuhnya.\" Kemudian mereka pergi kepada Nabi shallallahu 'alaihi wasallam lalu berkata; \"Wahai Nabi Allah, kami pergi ke Khaibar dan mendapati salah seorang dari kami terbunuh.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulukan yang besar, dahulukan yang besar.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Kalian datangkan bukti atas orang yang membunuh.\" Mereka berkata; \"Kami tidak memiliki bukti.\" Beliau bersabda: \"Mereka (harus) bersumpah untuk kalian.\" Mereka berkata; \"Kami tidak rela dengan sumpah orang-orang Yahudi.\" Rasulullah shallallahu 'alaihi wasallam tidak ingin darahnya sia-sia, maka beliau membayar diyat seratus unta dari unta shadaqah. 'Amru bin Syu'aib menyelisihi mereka. "
            },
            {
                "number": 4425,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ ابْنَ مُحَيِّصَةَ الْأَصْغَرَ أَصْبَحَ قَتِيلًا عَلَى أَبْوَابِ خَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقِمْ شَاهِدَيْنِ عَلَى مَنْ قَتَلَهُ أَدْفَعْهُ إِلَيْكُمْ بِرُمَّتِهِ قَالَ يَا رَسُولَ اللَّهِ وَمِنْ أَيْنَ أُصِيبُ شَاهِدَيْنِ وَإِنَّمَا أَصْبَحَ قَتِيلًا عَلَى أَبْوَابِهِمْ قَالَ فَتَحْلِفُ خَمْسِينَ قَسَامَةً قَالَ يَا رَسُولَ اللَّهِ وَكَيْفَ أَحْلِفُ عَلَى مَا لَا أَعْلَمُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَسْتَحْلِفُ مِنْهُمْ خَمْسِينَ قَسَامَةً فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ نَسْتَحْلِفُهُمْ وَهُمْ الْيَهُودُ فَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَتَهُ عَلَيْهِمْ وَأَعَانَهُمْ بِنِصْفِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar] telah menceritakan kepada kami [Rauh bin 'Ubadah] telah menceritakan kepada kami ['ubaidhullah bin Al Akhnas] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Ibn Muhayyishah kecil terbunuh di pintu gerbang Khaibar, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Datangkan dua orang saksi atas siapa yang membunuhnya, maka aku akan menyerahkannya kepada kalian dengan tali yang mengikatnya.\" Seseorang berkata; \"Wahai Rasulullah, dari mana aku mendapatkan dua orang saksi, sesungguhnya dia terbunuh di pintu gerbang mereka.\" Beliau bersabda: \"Kalian bersumpah lima puluh kali sumpah.\" Dia berkata; \"Wahai Rasulullah, bagaimana aku bersumpah atas apa yang tidak aku ketahui?\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita minta lima puluh orang dari mereka untuk bersumpah, \" Dia berkata; \"Wahai Rasulullah, bagaimana kita minta mereka bersumpah sedangkan mereka adalah orang-orang Yahudi?\" Rasulullah shallallahu 'alaihi wasallam membagi diyat di antara mereka dan membantu mereka setengahnya."
            },
            {
                "number": 4426,
                "arab": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالتَّارِكُ دِينَهُ الْمُفَارِقُ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Khalid] telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Sulaiman], dia berkata; \"Saya mendengar [Abdullah bin Murrah] dari [Masruq] dari [Abdullah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: 'Tidak halal darah seorang muslim kecuali dengan salah satu dari tiga perkara, yaitu: membunuh jiwa, janda yang berzina, dan orang yang meninggalkan agamanya.\""
            },
            {
                "number": 4427,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَأَحْمَدُ بْنُ حَرْبٍ وَاللَّفْظُ لِأَحْمَدَ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقُتِلَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُفِعَ الْقَاتِلُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ فَقَالَ الْقَاتِلُ يَا رَسُولَ اللَّهِ لَا وَاللَّهِ مَا أَرَدْتُ قَتْلَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِوَلِيِّ الْمَقْتُولِ أَمَا إِنَّهُ إِنْ كَانَ صَادِقًا ثُمَّ قَتَلْتَهُ دَخَلْتَ النَّارَ فَخَلَّى سَبِيلَهُ قَالَ وَكَانَ مَكْتُوفًا بِنِسْعَةٍ فَخَرَجَ يَجُرُّ نِسْعَتَهُ فَسُمِّيَ ذَا النِّسْعَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] dan [Ahmad bin Harb], sedang lafazhnya adalah lafazh Ahmad, mereka berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah], dia berkata, \"Seseorang terbunuh pada masa Rasulullah shallallahu 'alaihi wasallam lalu si pembunuh dilaporkan kepada Nabi shallallahu 'alaihi wasallam, lalu beliau menyerahkan kepada wali korban. Orang yang membunuh berkata; \"Wahai Rasulullah, tidak, demi Allah, aku tidak bermaksud membunuhnya.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepada wali si korban: \"Jika dia benar kemudian engkau membunuhnya maka engkau akan masuk neraka.\" Kemudian wali si korban pun membebaskannya. Ketika itu si pembunuh diikat dengan tali pengekang dari kulit lalu dia keluar dengan menyeret ikatannya sehingga dia dikenal dengan pemilik tali pengekang dari kulit.\""
            },
            {
                "number": 4428,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا إِسْحَقُ عَنْ عَوْفٍ الْأَعْرَابِيِّ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْحَضْرَمِيِّ عَنْ أَبِيهِ قَالَجِيءَ بِالْقَاتِلِ الَّذِي قَتَلَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ بِهِ وَلِيُّ الْمَقْتُولِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَعْفُو قَالَ لَا قَالَ أَتَقْتُلُ قَالَ نَعَمْ قَالَ اذْهَبْ فَلَمَّا ذَهَبَ دَعَاهُ قَالَ أَتَعْفُو قَالَ لَا قَالَ أَتَأْخُذُ الدِّيَةَ قَالَ لَا قَالَ أَتَقْتُلُ قَالَ نَعَمْ قَالَ اذْهَبْ فَلَمَّا ذَهَبَ قَالَ أَمَا إِنَّكَ إِنْ عَفَوْتَ عَنْهُ فَإِنَّهُ يَبُوءُ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ فَعَفَا عَنْهُ فَأَرْسَلَهُ قَالَ فَرَأَيْتُهُ يَجُرُّ نِسْعَتَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] telah menceritakan kepada kami [Ishaq] dari ['Auf Al A'rabi] dari ['Alqamah bin Wail Al Hadhrami] dari [ayahnya], dia berkata; \"Dihadapkan seseorang yang telah membunuh kepada Rasulullah shallallahu 'alaihi wasallam, dia datang bersama wali orang yang terbunuh, lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Maukah engkau memaafkannya?\" Wali korban menjawab; \"Tidak.\" Beliau bersabda: \"Apakah engkau membunuh?\" Si pembunuh menjawab; \"Ya.\" Beliau bersabda: \"Pergilah, \" Ketika dia pergi beliau memanggilnya dan bersabda: \"Maukah engkau memaafkannya?\" Si wali menjawab; \"Tidak.\" Beliau bersabda: \"Maukah engkau mengambil diyat darinya?\" Dia menjawab; \"Tidak.\" Beliau bersabda: \"Apakah engkau membunuh?\" Pembunuh menjawab, \"Ya.\" Beliau bersabda: \"Pergilah.\" Ketika dia pergi beliau bersabda: \"Jika engkau memaafkannya maka dia akan kembali membawa dosamu dan dosa temanmu.\" Lalu si wali pun memaafkan dan melepaskannya. Abu Hurairah berkata; \"Aku melihatnya menyeret tali kekang yang terbuat dari kulit yang mengikatnya.\""
            },
            {
                "number": 4429,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَوْفِ بْنِ أَبِي جَمِيلَةَ قَالَ حَدَّثَنِي حَمْزَةُ أَبُو عُمَرَ الْعَائِذِيُّ قَالَ حَدَّثَنَا عَلْقَمَةُ بْنُ وَائِلٍ عَنْ وَائِلٍ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ جِيءَ بِالْقَاتِلِ يَقُودُهُ وَلِيُّ الْمَقْتُولِ فِي نِسْعَةٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِوَلِيِّ الْمَقْتُولِ أَتَعْفُو قَالَ لَا قَالَ أَتَأْخُذُ الدِّيَةَ قَالَ لَا قَالَ فَتَقْتُلُهُ قَالَ نَعَمْ قَالَ اذْهَبْ بِهِ فَلَمَّا ذَهَبَ بِهِ فَوَلَّى مِنْ عِنْدِهِ دَعَاهُ فَقَالَ لَهُ أَتَعْفُو قَالَ لَا قَالَ أَتَأْخُذُ الدِّيَةَ قَالَ لَا قَالَ فَتَقْتُلُهُ قَالَ نَعَمْ قَالَ اذْهَبْ بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ أَمَا إِنَّكَ إِنْ عَفَوْتَ عَنْهُ يَبُوءُ بِإِثْمِهِ وَإِثْمِ صَاحِبِكَ فَعَفَا عَنْهُ وَتَرَكَهُ فَأَنَا رَأَيْتُهُ يَجُرُّ نِسْعَتَهُأَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا جَامِعُ بْنُ مَطَرٍ الْحَبَطِيُّ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ قَالَ يَحْيَى وَهُوَ أَحْسَنُ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Auf bin Abu Jamilah] telah menceritakan kepadaku [Abu Umar Al 'Aidzi] telah menceritakan kepada kami ['Alqamah bin Wail] dari [Wail], dia berkata; \"Saya menyaksikan Rasulullah shallallahu 'alaihi wasallam pada saat dihadapkan kepada beliau seorang pembunuh yang dituntun oleh wali orang yang dibunuh dengan tali kekang dari kulit. Rasulullah shallallahu 'alaihi wasallam bersabda kepada wali orang yang dibunuh: \"Apakah engkau akan memaafkannya?\" Dia berkata; \"Tidak.\" Beliau bersabda: \"Apakah engkau akan mengambil diyat darinya?\" Dia berkata; \"Tidak.\" Beliau bersabda: \"Engkau akan membunuhnya?\" Dia menjawab; \"Ya.\" Beliau bersabda; \"Pergilah bersamanya!\" Tatkala dia telah pergi bersamanya dan berpaling maka beliau memanggilnya dan bersabda kepadanya: \"Apakah engkau akan memaafkannya?\" Dia berkata; \"Tidak.\" Beliau bersabda: \"Apakah engkau akan mengambil diyat darinya?\" Dia berkata; \"Tidak.\" Beliau bersabda: \"Engkau akan membunuhnya?\" Dia menjawab; \"Ya.\" Beliau bersabda; \"Pergilah bersamanya!\" Pada saat itu beliau bersabda: \"Sesungguhnya apabila engkau memaafkannya maka dia akan kembali membawa dosanya dan dosa sahabatmu.\" Lalu dia memaafkannya dan membiarkannya. Saya melihatnya menyeret tali kekang dari kulit. Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Jami' bin Mathar Al Habathi] dari ['Alqamah bin Wail] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam dengan hadits yang semisal. Yahya berkata; Dia (hadits ini) lebih baik darinya.\""
            },
            {
                "number": 4430,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَهُوَ الْحَوْضِيُّ قَالَ حَدَّثَنَا جَامِعُ بْنُ مَطَرٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَكُنْتُ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ رَجُلٌ فِي عُنُقِهِ نِسْعَةٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ فَضَرَبَ بِهِ رَأْسَ صَاحِبِهِ فَقَتَلَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْفُ عَنْهُ فَأَبَى وَقَالَ يَا نَبِيَّ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ فَضَرَبَ بِهِ رَأْسَ صَاحِبِهِ فَقَتَلَهُ فَقَالَ اعْفُ عَنْهُ فَأَبَى ثُمَّ قَامَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ أُرَاهُ قَالَ فَضَرَبَ رَأْسَ صَاحِبِهِ فَقَتَلَهُ فَقَالَ اعْفُ عَنْهُ فَأَبَى قَالَ اذْهَبْ إِنْ قَتَلْتَهُ كُنْتَ مِثْلَهُ فَخَرَجَ بِهِ حَتَّى جَاوَزَ فَنَادَيْنَاهُ أَمَا تَسْمَعُ مَا يَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَجَعَ فَقَالَ إِنْ قَتَلْتُهُ كُنْتُ مِثْلَهُ قَالَ نَعَمْ أَعْفُ فَخَرَجَ يَجُرُّ نِسْعَتَهُ حَتَّى خَفِيَ عَلَيْنَا",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur] telah menceritakan kepada kami [Hafsh bin Umar yaitu Al Haudhi] telah menceritakan kepada kami [Jami' bin Mathar] dari ['Alqamah bin Wa`il] dari [ayahnya], dia berkata; \"Saya pernah duduk bersama Rasulullah shallallahu 'alaihi wasallam, lalu datanglah seorang laki-laki yang lehernya terikat tali kekang dari kulit, kemudian dia berkata; \"Wahai Rasulullah, sesungguhnya orang ini dan saudaraku pernah menggali sumur kemudian dia mengangkat cangkul dan memukul kepala temannya dengan menggunakan cangkul tersebut, hingga mati.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Maafkan dia.\" Tapi dia enggan untuk memaafkan, dia berkata; \"Wahai Nabi Allah, sesungguhnya orang ini dan saudaraku pernah menggali sumur kemudian dia mengangkat cangkul dan memukul kepala temannya (saudaraku) dengan menggunakan cangkul tersebut, hingga mati.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Maafkan dia.\" Tetapi dia enggan untuk memaafkan. Kemudian dia berdiri dan berkata; \"Wahai Nabi Allah, sesungguhnya orang ini dan saudaraku pernah menggali sumur kemudian dia mengangkat cangkul dan memukul kepala temannya dengan menggunakan cangkul tersebut, hingga mati.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Maafkan dia.\" Tetapi dia enggan untuk memaafkan. Beliau bersabda: \"Pergilah, apabila engkau membunuhnya maka engkau seperti dirinya.\" Kemudian dia keluar membawa orang tersebut hingga berlalu, kemudian kami memanggilnya; \"Tidakkah engkau mendengar apa yang Rasulullah shallallahu 'alaihi wasallam sabdakan?\" Kemudian dia kembali dan berkata; \"Apabila saya membunuhnya maka saya sepertinya?\" Beliau bersabda; \"Ya.\" \"Saya memaafkannya.\" Kemudian orang yang membunuh tersebut keluar dengan menyeret tali kekang dari kulit hingga dia tidak terlihat oleh kami.\""
            },
            {
                "number": 4431,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا حَاتِمٌ عَنْ سِمَاكٍ ذَكَرَ أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ أَخْبَرَهُ عَنْ أَبِيهِأَنَّهُ كَانَ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ بِنِسْعَةٍ فَقَالَ يَا رَسُولَ اللَّهِ قَتَلَ هَذَا أَخِي فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَتَلْتَهُ قَالَ يَا رَسُولَ اللَّهِ لَوْ لَمْ يَعْتَرِفْ أَقَمْتُ عَلَيْهِ الْبَيِّنَةَ قَالَ نَعَمْ قَتَلْتُهُ قَالَ كَيْفَ قَتَلْتَهُ قَالَ كُنْتُ أَنَا وَهُوَ نَحْتَطِبُ مِنْ شَجَرَةٍ فَسَبَّنِي فَأَغْضَبَنِي فَضَرَبْتُ بِالْفَأْسِ عَلَى قَرْنِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ لَكَ مِنْ مَالٍ تُؤَدِّيهِ عَنْ نَفْسِكَ قَالَ يَا رَسُولَ اللَّهِ مَالِي إِلَّا فَأْسِي وَكِسَائِي فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُرَى قَوْمَكَ يَشْتَرُونَكَ قَالَ أَنَا أَهْوَنُ عَلَى قَوْمِي مِنْ ذَاكَ فَرَمَى بِالنِّسْعَةِ إِلَى الرَّجُلِ فَقَالَ دُونَكَ صَاحِبَكَ فَلَمَّا وَلَّى قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ فَأَدْرَكُوا الرَّجُلَ فَقَالُوا وَيْلَكَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ فَرَجَعَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ حُدِّثْتُ أَنَّكَ قُلْتَ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ وَهَلْ أَخَذْتُهُ إِلَّا بِأَمْرِكَ فَقَالَ مَا تُرِيدُ أَنْ يَبُوءَ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ قَالَ بَلَى قَالَ فَإِنْ ذَاكَ قَالَ ذَلِكَ كَذَلِكَأَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا أَبُو يُونُسَ عَنْ سِمَاكِ بْنِ حَرْبٍ أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ حَدَّثَهُ أَنَّ أَبَاهُ حَدَّثَهُ قَالَ إِنِّي لَقَاعِدٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Hatim] dari [Simak], dia menyebutkan bahwa ['Alqamah bin Wail] telah mengabarkan kepadanya dari [ayahnya] bahwa dia pernah duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba datang seorang laki-laki yang menuntun orang lain dengan tali kekang dari kulit lalu berkata; \"Wahai Rasulullah, orang ini telah membunuh saudaraku.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya; \"Apakah engkau membunuhnya?\" Dia berkata; \"Wahai Rasulullah, apabila dia tidak mengaku maka akan saya datangkan bukti.\" Orang tersebut berkata; \"Ya, saya telah membunuhnya.\" Beliau bersabda: \"Bagaimana engkau membunuhnya?\" Orang tersebut menjawab; \"Saya bersamanya mencari kayu bakar dari sebuah pohon, kemudian dia menghinaku dan membuatku marah. Kemudian saya memukul kepalanya dengan menggunakan kapak.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apakah engkau memiliki harta untuk menebus dirimu?\" Orang tersebut berkata; \"Wahai Rasulullah, saya tidak memiliki apapun kecuali kapak dan pakaianku.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apakah engkau melihat bahwa kaummu akan membelimu?\" Dia berkata; \"Saya lebih hina bagi kaumku daripada orang itu.\" Beliau melemparkan tali kekang tersebut kepada orang tersebut dan bersabda: 'Bawalah temanmu.\" Kemudian tatkala dia telah pergi Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila dia membunuhnya berarti dia seperti orang tersebut.\" Kemudian mereka menemui orang tersebut dan berkata; \"Celaka engkau, sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila dia membunuhnya maka dia sepertinya.\" Kemudian orang tersebut kembali kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, saya diberitahu bahwa Tuan mengatakan: \"Apabila dia membunuhnya maka dia sepertinya.\" Tidaklah saya membawanya kecuali dengan perintah Tuan.\" Beliau bersabda: \"Apakah engkau tidak mau dia membawa dosamu dan dosa sahabatmu?\" Dia berkata; \"Ya.\" Beliau bersabda: \"Jika demikian?\" Dia berkata; \"Berarti ya seperti itu.\" Telah mengabarkan kepada kami [Zakariya bin Yahya] telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Abu Yunus] dari [Simak bin Harb] bahwa ['Alqamah bin Wail] telah menceritakan kepadanya bahwa [ayahnya] telah menceritakan kepadanya, dia berkata; \"Saya sedang duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba datang seorang laki-laki yang menuntun orang lain. Sama seperti hadits di atas."
            },
            {
                "number": 4432,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ عَنْ أَبِي عَوَانَةَ عَنْ إِسْمَعِيلَ بْنِ سَالِمٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ أَنَّ أَبَاهُ حَدَّثَهُمْأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ قَدْ قَتَلَ رَجُلًا فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ يَقْتُلُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِجُلَسَائِهِ الْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ قَالَ فَاتَّبَعَهُ رَجُلٌ فَأَخْبَرَهُ فَلَمَّا أَخْبَرَهُ تَرَكَهُ قَالَ فَلَقَدْ رَأَيْتُهُ يَجُرُّ نِسْعَتَهُ حِينَ تَرَكَهُ يَذْهَبُفَذَكَرْتُ ذَلِكَ لِحَبِيبٍ فَقَالَ حَدَّثَنِي سَعِيدُ بْنُ أَشْوَعَ قَالَ وَذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ الرَّجُلَ بِالْعَفْوِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar] telah menceritakan kepada kami [Yahya bin Hammad] dari [Abu 'Awanah] dari [Isma'il bin Salim] dari ['Alqamah bin Wail] bahwa [ayahnya] telah menceritakan kepada mereka bahwa didatangkan kepada Nabi shallallahu 'alaihi wasallam seorang laki-laki yang telah membunuh orang. Kemudian beliau menyerahkannya kepada wali orang yang dibunuh, Nabi shallallahu 'alaihi wasallam bersabda kepada orang-orang yang duduk bersama beliau; \"Orang yang membunuh dan yang dibunuh berada di neraka.\" Kemudian terdapat seseorang yang mengikuti orang yang melapor tadi dan memberitahukan (sabda Nabi tersebut) kepadanya. Kemudian tatkala dia telah memberitahukan kepadanya maka dia meninggalkan orang yang membunuh tersebut. Ayah 'Alqamah berkata; \"Sungguh saya melihatnya menyeret tali kekang dari kulit ketika wali orang yang dibunuh tersebut membiarkannya pergi. Kemudian hal tersebut saya ceritakan kepada [Habib], lalu dia berkata; telah menceritakan kepadaku [Sa'id bin Asywa'], ia berkata dan dia menyebutkan bahwa Nabi shallallahu 'alaihi wasallam memerintahkan orang tersebut untuk memaafkan. "
            },
            {
                "number": 4433,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا ضَمْرَةُ عَنْ عَبْدِ اللَّهِ بْنِ شَوْذَبٍ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَجُلًا أَتَى بِقَاتِلِ وَلِيِّهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْفُ عَنْهُ فَأَبَى فَقَالَ خُذْ الدِّيَةَ فَأَبَى قَالَ اذْهَبْ فَاقْتُلْهُ فَإِنَّكَ مِثْلُهُ فَذَهَبَ فَلُحِقَ الرَّجُلُ فَقِيلَ لَهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اقْتُلْهُ فَإِنَّكَ مِثْلُهُ فَخَلَّى سَبِيلَهُ فَمَرَّ بِي الرَّجُلُ وَهُوَ يَجُرُّ نِسْعَتَهُ",
                "id": "Telah mengabarkan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Dhamrah] dari [Abdullah bin Syaudzab] dari [Tsabit Al Bunani] dari [Anas bin Malik] bahwa seseorang datang dengan pembunuh walinya kepada Rasulullah shallallahu 'alaihi wasallam, lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Maafkanlah dia, \" Namun dia enggan. Beliau bersabda: \"Ambillah diyatnya, \" Tapi dia enggan, beliau bersabda: \"Pergi dan bunuhlah karena engkau sama sepertinya, \" Lalu dia pergi dan bertemu dengan seseorang, dikatakan kepadanya sesungguhnya Rasulullah Shallallahu' alaihi wa sallam bersabda: \"Bunuhlah dia karena engkau sama sepertinya, \" Lalu dia membebaskannya, orang itu melewatiku dan menyeret tali kekang dari kulit."
            },
            {
                "number": 4434,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْحَقَ الْمَرْوَزِيُّ قَالَ حَدَّثَنِي خَالِدُ بْنُ خِدَاشٍ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ بَشِيرِ بْنِ الْمُهَاجِرِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ هَذَا الرَّجُلَ قَتَلَ أَخِي قَالَ اذْهَبْ فَاقْتُلْهُ كَمَا قَتَلَ أَخَاكَ فَقَالَ لَهُ الرَّجُلُ اتَّقِ اللَّهَ وَاعْفُ عَنِّي فَإِنَّهُ أَعْظَمُ لِأَجْرِكَ وَخَيْرٌ لَكَ وَلِأَخِيكَ يَوْمَ الْقِيَامَةِ قَالَ فَخَلَّى عَنْهُ قَالَ فَأُخْبِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَأَخْبَرَهُ بِمَا قَالَ لَهُ قَالَ فَأَعْنَفَهُ أَمَا إِنَّهُ كَانَ خَيْرًا مِمَّا هُوَ صَانِعٌ بِكَ يَوْمَ الْقِيَامَةِ يَقُولُ يَا رَبِّ سَلْ هَذَا فِيمَ قَتَلَنِي",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Ishaq Al Marwazi] telah menceritakan kepadaku [Khalid bin Khidasy] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Basyir bin Al Muhajir] dari [Abdullah bin Buraidah] dari [ayahnya] bahwa seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam lalu berkata; \"Sesungguhnya orang ini telah membunuh saudaraku.\" Beliau bersabda: \"Pergi dan bunuhlah dia sebagaimana dia membunuh saudaramu.\" Kemudian orang tersebut berkata; \"Bertakwalah kepada Allah dan maafkan saya, sesungguhnya hal itu lebih besar pahalanya bagimu dan lebih baik untukmu dan saudaramu pada Hari Kiamat.\" Kemudian orang tersebut melepaskannya. Lalu Nabi shallallahu 'alaihi wasallam diberitahu mengenai hal tersebut kemudian beliau bertanya kepadanya, maka orang tersebut mengabarkan kepada beliau tentang apa yang telah dia katakan kepadanya. Beliau bersabda dan mencelanya: \"Adapun yang lebih baik dari apa yang dia lakukan kepadamu pada hari kiamat adalah dia akan berkata; wahai Tuhanku tanyakan kepada orang ini, kenapa dia membunuhku.\""
            },
            {
                "number": 4435,
                "arab": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ أَنْبَأَنَا عَلِيٌّ وَهُوَ بْنُ صَالِحٍ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابنِ عَبَّاسٍ قَالَكَانَ قُرَيْظَةُ وَالنَّضِيرُ وَكَانَ النَّضِيرُ أَشْرَفَ مِنْ قُرَيْظَةَ وَكَانَ إِذَا قَتَلَ رَجُلٌ مِنْ قُرَيْظَةَ رَجُلًا مِنْ النَّضِيرِ قُتِلَ بِهِ وَإِذَا قَتَلَ رَجُلٌ مِنْ النَّضِيرِ رَجُلًا مِنْ قُرَيْظَةَ أَدَّى مِائَةَ وَسْقٍ مِنْ تَمْرٍ فَلَمَّا بُعِثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتَلَ رَجُلٌ مِنْ النَّضِيرِ رَجُلًا مِنْ قُرَيْظَةَ فَقَالُوا ادْفَعُوهُ إِلَيْنَا نَقْتُلْهُ فَقَالُوا بَيْنَنَا وَبَيْنَكُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَوْهُ فَنَزَلَتْ{ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ }وَالْقِسْطُ النَّفْسُ بِالنَّفْسِ ثُمَّ نَزَلَتْ{ أَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُونَ }",
                "id": "Telah mengabarkan kepada kami [Al Qasim bin Zakariya bin Dinar] telah menceritakan kepada kami ['ubaidhullah bin Musa] telah memberitakan kepada kami ['Ali yaitu Ibnu Shalih] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas], dia berkata; \"Terdapat Bani Quraidhah dan Bani Nadhir, Bani Nadhir lebih mulia dari pada Bani Quraidhah, jika seseorang dari Bani Quraidhah membunuh seorang Bani Nadhir maka dia dibunuh karenanya, dan jika seorang Bani Nadhir membunuh seorang Bani Quraidhah maka dia membayar seratus wasq (satu wasq sama dengan enampuluh sho') dari kurma, ketika Nabi shallallahu 'alaihi wasallam diutus, seorang Bani Nadhir membunuh seorang Bani Quraidhah, mereka berkata kembalikan dia kepada kami agar kami membunuhnya, mereka berkata di antara kami dan kalian ada seorang Nabi shallallahu 'alaihi wasallam, lalu mereka mendatangi beliau, dan turunlah ayat (Jika engkau menghukumi maka hukumilah dengan adil) dan yang dimaksud Qisth adalah nyawa dibalas dengan nyawa, lalu turunlah ayat: (Apakah mereka mengharapkan hukum Jahiliyah) "
            },
            {
                "number": 4436,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ أَخْبَرَنِي دَاوُدُ بْنُ الْحُصَيْنِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ الْآيَاتِ الَّتِي فِي الْمَائِدَةِ الَّتِي قَالَهَا اللَّهُ عَزَّ وَجَلَّ{ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ إِلَى الْمُقْسِطِينَ }إِنَّمَا نَزَلَتْ فِي الدِّيَةِ بَيْنَ النَّضِيرِ وَبَيْنَ قُرَيْظَةَ وَذَلِكَ أَنَّ قَتْلَى النَّضِيرِ كَانَ لَهُمْ شَرَفٌ يُودَوْنَ الدِّيَةَ كَامِلَةً وَأَنَّ بَنِي قُرَيْظَةَ كَانُوا يُودَوْنَ نِصْفَ الدِّيَةِ فَتَحَاكَمُوا فِي ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ذَلِكَ فِيهِمْ فَحَمَلَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْحَقِّ فِي ذَلِكَ فَجَعَلَ الدِّيَةَ سَوَاءً",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'd] telah menceritakan kepada kami [pamanku] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq], telah mengabarkan kepadaku [Daud bin Al Hushain] dari [Ikrimah] dari [Ibnu Abbas] bahwa ayat-ayat yang turun dalam Surat Al Maidah yang Allah 'azza wajalla firmankan yaitu: (Maka putuskanlah (perkara itu) di antara mereka, atau berpalinglah dari mereka) hingga firmanNya: (orang-orang yang adil) ayat tersebut turun mengenai diyat antara Bani Nadhir dan Bani Quraizhah yang demikian itu yaitu bahwa orang-orang yang dibunuh dari Bani Nazhir memiliki kemuliaan, mereka dibayar diyat dengan sempurna, sedang Bani Quraizhah mereka dibayar setengah diyat. Kemudian mereka berhukum kepada Rasulullah shallallahu 'alaihi wasallam, maka Allah 'azza wajalla menurunkan ayat tersebut mengenai mereka. Kemudian Rasulullah shallallahu 'alaihi wasallam membawa mereka di atas kebenaran dalam hal tersebut dan menjadikan diyat sama. "
            },
            {
                "number": 4437,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَانْطَلَقْتُ أَنَا وَالْأَشْتَرُ إِلَى عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فَقُلْنَا هَلْ عَهِدَ إِلَيْكَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ عَامَّةً قَالَ لَا إِلَّا مَا كَانَ فِي كِتَابِي هَذَا فَأَخْرَجَ كِتَابًا مِنْ قِرَابِ سَيْفِهِ فَإِذَا فِيهِ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ وَيَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ أَلَا لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ بِعَهْدِهِ مَنْ أَحْدَثَ حَدَثًا فَعَلَى نَفْسِهِ أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Qais bin 'Ubad], dia berkata; \"Saya dan Al Asytar pergi menemui [Ali radliallahu 'anhu] kemudian kami mengatakan; \"Apakah Rasulullah shallallahu 'alaihi wasallam mewasiatkan sesuatu yang tidak diwasiatkan kepada orang-orang secara umum?\" Dia berkata; \"Tidak, selain apa yang ada dalam catatanku ini. Kemudian dia mengeluarkan catatan dari sarung pedangnya, ternyata isinya adalah bahwa \"Orang-orang mukmin darah mereka sederajat, dan mereka adalah satu tangan atas orang selain mereka, orang yang paling rendah diantara mereka berjalan dengan jaminan keamanan dari mereka, ketahuilah tidaklah orang yang mukmin dibunuh lantaran orang kafir, dan tidak pula dibunuh orang yang memiliki perjanjian selama dalam perjanjiannya, barang siapa yang melakukan perkara yang dilarang maka kerugiannya terhadap dirinya atau melindungi orang yang berbuat kejahatan maka laknat Allah, malaikat dan seluruh manusia tertimpa atas dirinya.\""
            },
            {
                "number": 4438,
                "arab": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْوَاحِدِ قَالَ حَدَّثَنَا عَمْرُو بْنُ عَامِرٍ عَنْ قَتَادَةَ عَنْ أَبِي حَسَّانَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِهِ",
                "id": "Telah mengabarkan kepada kami [Abu Bakar bin Ali] telah menceritakan kepada kami [Al Qawariri] telah menceritakan kepada kami [Muhammad bin Abdul Wahid] telah menceritakan kepada kami ['Amru bin 'Amir] dari [Qatadah] dari [Abu Hassan] dari [Ali radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Orang-orang mukmin darah mereka sederajat, dan mereka adalah satu tangan atas orang selain mereka, orang yang paling rendah diantara mereka berjalan dengan jaminan keamanan dari mereka, ketahuilah tidaklah orang yang mukmin dibunuh lantaran orang kafir, dan tidak pula dibunuh orang yang memiliki perjanjian selama dalam perjanjiannya.\""
            },
            {
                "number": 4439,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ هُوَ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ قَالَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَهُ جَدَعْنَاهُ وَمَنْ أَخْصَاهُ أَخْصَيْنَاهُ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan yaitu Al Marwazi] telah menceritakan kepada kami [Abu Daud Ath Thayalisi] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membunuh budaknya maka kami akan membunuhnya dan barang siapa yang memotong ujung-ujungnya maka kami akan memotong ujung-ujungnya, dan barang siapa yang mengebirinya maka kami akan mengebirinya.\" "
            },
            {
                "number": 4440,
                "arab": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ",
                "id": "Telah mengabarkan kepada kami [Nashr bin Ali] telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"\"Barang siapa yang membunuh budaknya maka kami akan membunuhnya dan barang siapa yang memotong ujung-ujungnya maka kami akan memotong ujung-ujungnya.\""
            },
            {
                "number": 4441,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Al Hasan] dari [Samurah], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"\"Barang siapa yang membunuh budaknya maka kami akan membunuhnya dan barang siapa yang memotong ujung-ujungnya maka kami akan memotong ujung-ujungnya.\""
            },
            {
                "number": 4442,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ طَاوُسًا يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ نَشَدَ قَضَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَقَامَ حَمَلُ بْنُ مَالِكٍ فَقَالَ كُنْتُ بَيْنَ حُجْرَتَيْ امْرَأَتَيْنِ فَضَرَبَتْ إِحْدَاهُمَا الْأُخْرَى بِمِسْطَحٍ فَقَتَلَتْهَا وَجَنِينَهَا فَقَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنِينِهَا بِغُرَّةٍ وَأَنْ تُقْتَلَ بِهَا",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] telah menceritakan kepada kami [Hajjaj bin Muhammad] dari [Ibnu Juraij] telah mengabarkan kepadaku ['Amru bin Dinar] bahwa dia mendengar [Thawus] menceritakan dari [Ibnu Abbas] dari Umar radliallahu 'anhu bahwa dia meminta keputusan Rasulullah shallallahu 'alaihi wasallam mengenai hal itu lalu berdirilah [Hamal bin Malik] lalu berkata; \"Aku berada di antara dua kamar dua orang wanita, lalu seorang dari mereka memukul yang lain dengan tiang kemah hingga membunuhnya beserta janinnya, lalu Nabi shallallahu 'alaihi wasallam menetapkan untuk janinnya dengan seorang budak dan wanita (yang membunuh) itu dibunuh.\""
            },
            {
                "number": 4443,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُأَنَّ يَهُودِيًّا قَتَلَ جَارِيَةً عَلَى أَوْضَاحٍ لَهَا فَأَقَادَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah memberitakan kepada kami ['Abdah] dari [Sa'id] dari [Qatadah] dari [Anas radliallahu 'anhu] bahwa seorang Yahudi membunuh seorang wanita untuk mendapatkan perhiasannya, kemudian Rasulullah shallallahu 'alaihi wasallam membalas karenanya. "
            },
            {
                "number": 4444,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو هِشَامٍ قَالَ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ يَهُودِيًّا أَخَذَ أَوْضَاحًا مِنْ جَارِيَةٍ ثُمَّ رَضَخَ رَأْسَهَا بَيْنَ حَجَرَيْنِ فَأَدْرَكُوهَا وَبِهَا رَمَقٌ فَجَعَلُوا يَتَّبِعُونَ بِهَا النَّاسَ هُوَ هَذَا هُوَ هَذَا قَالَتْ نَعَمْ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Mubarak] telah menceritakan kepada kami [Abu Hisyam] telah menceritakan kepada kami [Aban bin Yazid] dari [Qatadah] dari [Anas bin Malik] bahwa seorang Yahudi mengambil perhiasan dari seorang wanita kemudian menggencet (menjepit) kepalanya di antara dua batu. Kemudian orang-orang menemukannya masih bernyawa, kemudian mereka menyebutkan beberapa orang kepadanya, apakah orang yang membunuh adalah ini? Apakah orang yang membunuh adalah ini? Lalu wanita tersebut berkata; \"Ya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk menangkapnya kemudian kepalanya digencet di antara dua batu.\" "
            },
            {
                "number": 4445,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا يَزِيدُ بْنُ هَارُونَ عَنْ هَمَّامٍ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَخَرَجَتْ جَارِيَةٌ عَلَيْهَا أَوْضَاحٌ فَأَخَذَهَا يَهُودِيٌّ فَرَضَخَ رَأْسَهَا وَأَخَذَ مَا عَلَيْهَا مِنْ الْحُلِيِّ فَأُدْرِكَتْ وَبِهَا رَمَقٌ فَأُتِيَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ قَتَلَكِ فُلَانٌ قَالَتْ بِرَأْسِهَا لَا قَالَ فُلَانٌ قَالَ حَتَّى سَمَّى الْيَهُودِيَّ قَالَتْ بِرَأْسِهَا نَعَمْ فَأُخِذَ فَاعْتَرَفَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] telah memberitakan kepada kami [Yazid bin Harun] dari [Hammam] dari [Qatadah] dari [Anas bin Malik], dia berkata; \"Seorang wanita keluar dengan memakai perhiasan kemudian perhiasan tersebut diambil oleh seorang Yahudi, kemudian dia menggencet kepala wanita tersebut dan mengambil perhiasan yang ada padanya. Lalu wanita tersebut ditemukan masih bernyawa, kemudian dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam lalu beliau bersabda: \"Siapakah yang membunuhmu? Fulan?\" kemudian dia menjawab dengan kepalanya; \"Tidak.\" Beliau bersabda: \"Fulan?\" hingga beliau menyebutkan seorang Yahudi tersebut. Dia menjawab dengan kepalanya; \"Ya.\" Kemudian Yahuditersebut ditangkap dan mengaku, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan agar kepalanya digencet, maka digencetlah kepalanya di antara dua batu.\" "
            },
            {
                "number": 4446,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَحِلُّ قَتْلُ مُسْلِمٍ إِلَّا فِي إِحْدَى ثَلَاثِ خِصَالٍ زَانٍ مُحْصَنٌ فَيُرْجَمُ وَرَجُلٌ يَقْتُلُ مُسْلِمًا مُتَعَمِّدًا وَرَجُلٌ يَخْرُجُ مِنْ الْإِسْلَامِ فَيُحَارِبُ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ فَيُقْتَلُ أَوْ يُصَلَّبُ أَوْ يُنْفَى مِنْ الْأَرْضِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Hafsh bin Abdullah] telah menceritakan kepadaku [ayahku] telah menceritakan kepadaku [Ibrahim] dari [Abdul Aziz bin Rufai'] dari ['Ubaid bin 'Umair] dari ['Aisyah, Ummul mukminin] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Tidak halal membunuh seorang muslim kecuali dengan tiga sifat; seorang pezina yang telah menikah, maka dia dirajam, seseorang yang membunuh orang muslim secara sengaja dan seseorang yang keluar dari Islam lalu memerangi Allah 'azza wajalla dan RasulNya, maka dia dibunuh, atau disalib, atau disingkirkan dari negeri.\" "
            },
            {
                "number": 4447,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُطَرِّفِ بْنِ طَرِيفٍ عَنْ الشَّعْبِيِّ قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ يَقُولُ سَأَلْنَا عَلِيًّا فَقُلْنَاهَلْ عِنْدَكُمْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ سِوَى الْقُرْآنِ فَقَالَ لَا وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ إِلَّا أَنْ يُعْطِيَ اللَّهُ عَزَّ وَجَلَّ عَبْدًا فَهْمًا فِي كِتَابِهِ أَوْ مَا فِي هَذِهِ الصَّحِيفَةِ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ فِيهَا الْعَقْلُ وَفِكَاكُ الْأَسِيرِ وَأَنْ لَا يُقْتَلَ مُسْلِمٌ بِكَافِرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] telah menceritakan kepada kami [Sufyan] dari [Mutharrif bin Tharif] dari [Asy Sya'bi], dia berkata; \"Saya mendengar [Abu Juhaifah] berkata; 'Kami bertanya kepada [Ali]. Kami katakan; 'Apakah engkau memiliki sesuatu dari Rasulullah shallallahu 'alaihi wasallam selain al-qur'an? ' Lalu dia berkata; 'Tidak, demi Dzat yang menumbuhkan biji, dan menciptakan jiwa kecuali Allah 'azza wajalla memberikan pemahaman kepada seorang hamba dalam al-qur'an, atau apa yang ada dalam lembaran ini.' Saya katakan; 'Apa yang ada dalam lembaran tersebut? ' Dia berkata; 'Isinya adalah diyat, pembebasan tawanan, dan seorang muslim tidak dibunuh lantaran orang kafir.\" "
            },
            {
                "number": 4448,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي حَسَّانَ قَالَ قَالَ عَلِيٌّمَا عَهِدَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ دُونَ النَّاسِ إِلَّا فِي صَحِيفَةٍ فِي قِرَابِ سَيْفِي فَلَمْ يَزَالُوا بِهِ حَتَّى أَخْرَجَ الصَّحِيفَةَ فَإِذَا فِيهَا الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Al Hajjaj bin Minhal] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Abu Hassan], [Ali] berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak mewasiatkan sesuatupun kepadaku, tidak juga kepada orang-orang kecuali dalam lembaran yang ada dalam sarung pedangku.\" Mereka terus bertanya hingga dia mengeluarkan lembaran yang ternyata isinya adalah: \"Orang-orang mukmin darah mereka sederajat, dan mereka adalah satu tangan atas orang selain mereka, orang yang paling rendah di antara mereka berjalan dengan jaminan keamanan dari mereka, ketahuilah tidaklah seorang mukmin dibunuh lantaran orang kafir, dan tidak pula dibunuh orang yang memiliki perjanjian selama dalam perjanjiannya\"."
            },
            {
                "number": 4449,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ الْحَجَّاجِ بْنِ الْحَجَّاجِ عَنْ قَتَادَةَ عَنْ أَبِي حَسَّانَ الْأَعْرَجِ عَنْ الْأَشْتَرِ أَنَّهُ قَالَ لِعَلِيٍّإِنَّ النَّاسَ قَدْ تَفَشَّغَ بِهِمْ مَا يَسْمَعُونَ فَإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهِدَ إِلَيْكَ عَهْدًا فَحَدِّثْنَا بِهِ قَالَ مَا عَهِدَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهْدًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ غَيْرَ أَنَّ فِي قِرَابِ سَيْفِي صَحِيفَةً فَإِذَا فِيهَا الْمُؤْمِنُونَ تَتَكَافَأُ دِمَاؤُهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِهِ مُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Hafsh] telah menceritakan kepadaku [ayahku] telah menceritakan kepadaku [Ibrahim bin Thahman] dari [Al Hajjaj bin Al Hajjaj] dari [Qatadah] dari [Abu Hasan Al A'raj] dari [Al Asytar] bahwa dia berkata kepada Ali; \"Sesungguhnya apa yang didengar orang-orang telah menyebar, maaka apabila Rasulullah shallallahu 'alaihi wasallam telah mewasiatkan sesuatu kepadamu maka ceritakan kepada kami.\" ['Ali] berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak mewasiatkan sesuatupun kepadaku yang tidak diwasiatkan kepada manusia, hanya saja dalam sarung pedangku ini terdapat lembaran yang ternyata isinya adalah: \"Orang-orang mukmin darah mereka sederajat, dan mereka adalah satu tangan atas orang selain mereka, orang yang paling rendah diantara mereka berjalan dengan jaminan keamanan dari mereka, ketahuilah tidaklah orang yang mukmin dibunuh lantaran orang kafir, dan tidak pula dibunuh orang yang memiliki perjanjian selama dalam perjanjiannya\"."
            },
            {
                "number": 4450,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ عُيَيْنَةَ قَالَ أَخْبَرَنِي أَبِي قَالَ قَالَ أَبُو بَكْرَةَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ مُعَاهِدًا فِي غَيْرِ كُنْهِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Khalid] dari ['Uyainah] telah mengabarkan kepadaku [ayahku] telah berkata [Abu Bakarah]; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barang siapa yang membunuh orang kafir mu'ahid (ada dalam perjanjian) tidak pada waktunya maka Allah mengharamkan baginya Surga.\""
            },
            {
                "number": 4451,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ يُونُسَ عَنْ الْحَكَمِ بْنِ الْأَعْرَجِ عَنْ الْأَشْعَثِ بْنِ ثُرْمُلَةَ عَنْ أَبِي بَكْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ نَفْسًا مُعَاهِدَةً بِغَيْرِ حِلِّهَا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ أَنْ يَشُمَّ رِيحَهَا",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits] telah menceritakan kepada kami [Isma'il] dari [Yunus] dari [Al Hakam bin Al A'raj] dari [Al Asy'ats bin Tsurmulah] dari [Abu Bakarah], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membunuh orang kafir mu'ahid tidak pada waktu halalnya maka Allah mengharamkan baginya untuk mencium bau Surga.\""
            },
            {
                "number": 4452,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا النَّضْرُ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ رَجُلًا مِنْ أَهْلِ الذِّمَّةِ لَمْ يَجِدْ رِيحَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ عَامًا",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [An Nadhr] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Hilal bin Yasaf] dari [Al Qasim bin Mukhaimirah] dari [seorang sahabat] Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membunuh seseorang dari ahli dzimmah maka dia tidak akan mendapatkan bau Surga padahal baunya tercium dari jarak perjalanan tujuh puluh tahun.\""
            },
            {
                "number": 4453,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ دُحَيْمٌ قَالَ حَدَّثَنَا مَرْوَانُ قَالَ حَدَّثَنَا الْحَسَنُ وَهُوَ ابْنُ عَمْرٍو عَنْ مُجَاهِدٍ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ قَتِيلًا مِنْ أَهْلِ الذِّمَّةِ لَمْ يَجِدْ رِيحَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Ibrahim Dukhaim] telah menceritakan kepada kami [Marwan] telah menceritakan kepada kami [Al Hasan yaitu Ibnu 'Amru] dari [Mujahid] dari [Junadah bin Abu Umayyah] dari [Abdullah bin 'Amru], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membunuh seseorang dari ahli dzimmah maka dia tidak akan mendapatkan bau Surga padahal baunya tercium dari jarak perjalanan empat puluh tahun.\""
            },
            {
                "number": 4454,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ غُلَامًا لِأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَجْعَلْ لَهُمْ شَيْئًا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah memberitakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [Abu Nadhrah] dari [Imran bin Hushain] bahwa seorang anak orang miskin memotong telinga anak orang kaya, lalu mereka mendatangi Nabi shallallahu 'alaihi wasallam dan beliau tidak menetapkan sesuatupun bagi mereka."
            },
            {
                "number": 4455,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا أَبُو خَالِدٍ سُلَيْمَانُ بْنُ حَيَّانَ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْقِصَاصِ فِي السِّنِّ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كِتَابُ اللَّهِ الْقِصَاصُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah memberitakan kepada kami [Abu Khalid Sulaiman bin Hayyan] telah menceritakan kepada kami [Humaid] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam menetapkan qishas pada masalah gigi. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketetapan Allah itu adalah qishas.\""
            },
            {
                "number": 4456,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membunuh budaknya maka kami akan membunuhnya dan barangsiapa memotong ujung-ujung (dari anggota tubuh) budaknya niscaya kami akan memotong ujung-ujungnya.\" "
            },
            {
                "number": 4457,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ خَصَى عَبْدَهُ خَصَيْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُوَاللَّفْظُ لِابْنِ بَشَّارٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar], mereka berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mengebiri budaknya maka kami akan mengebirinya dan barang siapa yang memotong ujung-ujungnya maka kami akan memotong ujungnya.\" Lafazh hadits tersebut adalah lafazh Ibnu Basysyar. "
            },
            {
                "number": 4458,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍأَنَّ أُخْتَ الرُّبَيِّعِ أُمَّ حَارِثَةَ جَرَحَتْ إِنْسَانًا فَاخْتَصَمُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقِصَاصَ الْقِصَاصَ فَقَالَتْ أُمُّ الرَّبِيعِ يَا رَسُولَ اللَّهِ أَيُقْتَصُّ مِنْ فُلَانَةَ لَا وَاللَّهِ لَا يُقْتَصُّ مِنْهَا أَبَدًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُبْحَانَ اللَّهِ يَا أُمَّ الرَّبِيعِ الْقِصَاصُ كِتَابُ اللَّهِ قَالَتْ لَا وَاللَّهِ لَا يُقْتَصُّ مِنْهَا أَبَدًا فَمَا زَالَتْ حَتَّى قَبِلُوا الدِّيَةَ قَالَ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Tsabit] dari [Anas] bahwa saudara perempuan Ar Rubayyi' yaitu Ummu Haritsah telah melukai seseorang kemudian mereka melaporkannya kepada Nabi shallallahu 'alaihi wasallam, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Qishashlah- qishashlah!\". Kemudian Ummu Ar Rabi' berkata; \"Wahai Rasulullah, apakah Fulanah akan diqishash? Tidak, demi Allah, dia tidak akan diqishash selamanya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Subahanallah, wahai ummu Ar Rabi', qishash adalah ketentuan Allah.\" Dia berkata; \"Tidak, demi Allah, dia tidak akan diqishash selamanya. Dan dia terus mengatakan hal tersebut hingga mereka menerima diyat. Beliau bersabda: \"Sesungguhnya di antara hamba-hamba Allah terdapat orang yang apabila dia bersumpah atas nama Allah maka Allah akan menepatinya.\""
            },
            {
                "number": 4459,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ وَإِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرٌ عَنْ حُمَيْدٍ قَالَ ذَكَرَ أَنَسٌأَنَّ عَمَّتَهُ كَسَرَتْ ثَنِيَّةَ جَارِيَةٍ فَقَضَى نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْقِصَاصِ فَقَالَ أَخُوهَا أَنَسُ بْنُ النَّضْرِ أَتُكْسَرُ ثَنِيَّةُ فُلَانَةَ لَا وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا تُكْسَرُ ثَنِيَّةُ فُلَانَةَ قَالَ وَكَانُوا قَبْلَ ذَلِكَ سَأَلُوا أَهْلَهَا الْعَفْوَ وَالْأَرْشَ فَلَمَّا حَلَفَ أَخُوهَا وَهُوَ عَمُّ أَنَسٍ وَهُوَ الشَّهِيدُ يَوْمَ أُحُدٍ رَضِيَ الْقَوْمُ بِالْعَفْوِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dan [Isma'il bin Mas'ud] telah menceritakan kepada kami [Bisyr] dari [Humaid], dia berkata; \" [Anas] menyebutkan bahwa bibinya telah memecahkan gigi seri seorang wanita, kemudian Nabi shallallahu 'alaihi wasallam memutuskan dengan qishash. Kemudian saudaranya yaitu Anas bin An Nadhr mengatakan; \"Apakah gigi seri Fulanah akan dipecahkan? Tidak, demi Dzat yang mengutus Tuan dengan kebenaran, gigi seri Fulanah tidak akan dipecahkan.\" Sebelum itu mereka telah meminta maaf dan denda kepada keluarga wanita tersebut. Setelah saudaranya yang merupakan paman Anas dan pernah mengikuti perang Uhud bersumpah maka orang-orang tersebut rela memberikan maaf. kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya diantara hamba-hamba Allah terdapat orang yang apabila dia bersumpah atas nama Allah maka Allah akan menepatinya.\" "
            },
            {
                "number": 4460,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍ قَالَكَسَرَتْ الرُّبَيِّعُ ثَنِيَّةَ جَارِيَةٍ فَطَلَبُوا إِلَيْهِمْ الْعَفْوَ فَأَبَوْا فَعُرِضَ عَلَيْهِمْ الْأَرْشُ فَأَبَوْا فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِالْقِصَاصِ قَالَ أَنَسُ بْنُ النَّضْرِ يَا رَسُولَ اللَّهِ تُكْسَرُ ثَنِيَّةُ الرُّبَيِّعِ لَا وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا تُكْسَرُ قَالَ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ فَرَضِيَ الْقَوْمُ وَعَفَوْا فَقَالَ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Humaid] dari [Anas], dia berkata; \"Ar Rubayyi' telah memecahkan gigi seri seorang wanita, kemudian mereka meminta kepada wali wanita tersebut untuk memaafkan namun mereka menolak. Kemudian ditawarkan kepada mereka denda, namun mereka menolak, lalu mereka mendatangi Nabi shallallahu 'alaihi wasallam, kemudian beliau memerintahkan untuk diqishash. Anas bin An Nadhr berkata; \"Wahai Rasulullah, apakah gigi seri Ar Rubayyi' akan dipecah? Tidak, demi Dzat yang mengutus Tuan dengan kebenaran. Gigi serinya tidak akan dipecah.\" Beliau bersabda, \"Wahai Anas, ketetapan Allah adalah qishash.\" Kemudian kaum tersebut rela dan memaafkannya.\" Lantas beliau pun bersabda; \"Sesungguhnya di antara hamba-hamba Allah ada yang apabila dia bersumpah atas nama Allah niscaya Allah akan menepatinya.\""
            },
            {
                "number": 4461,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ أَبُو الْجَوْزَاءِ قَالَ أَنْبَأَنَا قُرَيْشُ بْنُ أَنَسٍ عَنْ ابْنِ عَوْنٍ عَنْ ابْنِ سِيرِينَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا عَضَّ يَدَ رَجُلٍ فَانْتَزَعَ يَدَهُ فَسَقَطَتْ ثَنِيَّتُهُ أَوْ قَالَ ثَنَايَاهُ فَاسْتَعْدَى عَلَيْهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَأْمُرُنِي تَأْمُرُنِي أَنْ آمُرَهُ أَنْ يَدَعَ يَدَهُ فِي فِيكَ تَقْضَمُهَا كَمَا يَقْضَمُ الْفَحْلُ إِنْ شِئْتَ فَادْفَعْ إِلَيْهِ يَدَكَ حَتَّى يَقْضَمَهَا ثُمَّ انْتَزِعْهَا إِنْ شِئْتَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Utsman Abu Al Jauza`], ia berkata; telah memberitakan kepada kami [Quraisy bin Anas] dari [Ibnu 'Aun] dari [Ibnu Sirin] dari [Imran bin Hushain] bahwa seorang laki-laki menggigit tangan seorang laki-laki yang lain. Kemudian ia menarik tangannya hingga gigi serinya copot atau beberapa serinya kemudian minta bantuan kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang engkau minta dariku, apakah engkau minta aku agar dia melepaskan tangannya yang ada di mulutmu? Engkau menggigitnya sebagaimana pejantan sedang menggigit, apabila engkau mau maka serahkan tanganmu kepadanya hingga dia menggigitnya kemudian tariklah apabila engkau mau.\""
            },
            {
                "number": 4462,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا عَضَّ آخَرَ عَلَى ذِرَاعِهِ فَاجْتَذَبَهَا فَانْتَزَعَتْ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبْطَلَهَا وَقَالَ أَرَدْتَ أَنْ تَقْضَمَ لَحْمَ أَخِيكَ كَمَا يَقْضَمُ الْفَحْلُ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yazid] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Zurarah bin Aufa] dari [Imran bin Hushain] bahwa seorang laki-laki menggigit seseorang pada hastanya, kemudian orang tersebut menariknya sehingga gigi serinya terlepas. Kemudian hal tersebut dilaporkan kepada Nabi shallallahu 'alaihi wasallam. Lalu beliau membantahnya seraya bersabda: \"Engkau ingin menggigit daging saudaramu sebagaimana pejantan sedang menggigit.\""
            },
            {
                "number": 4463,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَاتَلَ يَعْلَى رَجُلًا فَعَضَّ أَحَدُهُمَا صَاحِبَهُ فَانْتَزَعَ يَدَهُ مِنْ فِيهِ فَنَدَرَتْ ثَنِيَّتُهُ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ لَا دِيَةَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Zurarah] dari [Imran bin Hushain], dia berkata; \"Ya'la berkelahi dengan seseorang, kemudian salah seorang dari mereka menggigit temannya kemudian dia menarik tangannya dari mulut orang yang menggigitnya sehingga gigi seri orang tersebut lepas. Kemudian mereka melaporkan peristiwa tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau bersabda: \"Salah seorang diantara kalian menggigit saudaranya seperti pejantan yang sedang menggigit. Tidak ada diyat untuknya.\""
            },
            {
                "number": 4464,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ يَعْلَى قَالَ فِي الَّذِي عَضَّ فَنَدَرَتْ ثَنِيَّتُهُ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا دِيَةَ لَكَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] telah memberitakan kepada kami [Abdullah] dari [Syu'bah] dari [Qatadah] dari [Zurarah] dari [Imran bin Hushain] bahwa Ya'la berkata mengenai orang yang menggigit kemudian gigi serinya terlepas; sesungguhnya Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada diyat untukmu.\""
            },
            {
                "number": 4465,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو هِشَامٍ قَالَ حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا قَتَادَةُ قَالَ حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا عَضَّ ذِرَاعَ رَجُلٍ فَانْتَزَعَ ثَنِيَّتَهُ فَانْطَلَقَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ أَرَدْتَ أَنْ تَقْضَمَ ذِرَاعَ أَخِيكَ كَمَا يَقْضَمُ الْفَحْلُ فَأَبْطَلَهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Mubarak] telah menceritakan kepada kami [Abu Hisyam] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Qatadah] telah menceritakan kepada kami [Zurarah bin Aufa] dari [Imran bin Hushain] bahwa seorang laki-laki menggigit hasta laki-laki lain hingga gigi serinya lepas. Kemudian dia pergi kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Maka beliau bersabda: \"Engkau ingin menggigit hasta saudaramu sebagaimana pejantan yang sedang menggigit.\" Kemudian beliau membatalkan diyat. "
            },
            {
                "number": 4466,
                "arab": "أَخْبَرَنَا مَالِكُ بْنُ الْخَلِيلِ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ يَعْلَى ابْنِ مُنْيَةَأَنَّهُ قَاتَلَ رَجُلًا فَعَضَّ أَحَدُهُمَا صَاحِبَهُ فَانْتَزَعَ يَدَهُ مِنْ فِيهِ فَقَلَعَ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْبَكْرُ فَأَبْطَلَهَا",
                "id": "Telah mengabarkan kepada kami [Malik bin Al Khalil] telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Al Hakam] dari [Mujahid] dari [Ya'la bin Munyah] bahwa dia berkelahi dengan seseorang, Kemudian salah seorang dari mereka menggigit sahabatnya kemudian orang yang digigit menarik tangannya dari mulutnya hingga gigi seri orang yang menggigitnya lepas. Kemudian hal tersebut dilaporkan kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau bersabda: \"Salah seorang diantara kalian menggigit saudaranya seperti pejantan yang sedang menggigit.\" Lalu beliau membatalkan diyat."
            },
            {
                "number": 4467,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ قَالَ حَدَّثَنَا جَدِّي قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ يَعْلَى ابْنِ مُنْيَةَأَنَّ رَجُلًا مِنْ بَنِي تَمِيمٍ قَاتَلَ رَجُلًا فَعَضَّ يَدَهُ فَانْتَزَعَهَا فَأَلْقَى ثَنِيَّتَهُ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْبَكْرُ فَأَطَلَّهَا أَيْ أَبْطَلَهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin 'Ubaid bin 'Aqil] telah menceritakan kepada kami [kakekku] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Mujahid] dari [Ya'la bin Munyah] bahwa seseorang dari Bani Tamim berkelahi dengan seseorang, kemudian dia menggigit tangan orang tersebut. Orang tersebut menariknya hingga melepaskan gigi serinya. Kemudian mereka melaporkan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau bersabda: \"Salah seorang diantara kalian menggigit saudaranya seperti pejantan yang sedang menggigit. Kemudian beliau membatalkan diyat. "
            },
            {
                "number": 4468,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ أَنْبَأَنَا أَحْمَدُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا مُحَمَّدٌ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ عَنْ عَمَّيْهِ سَلَمَةَ وَيَعْلَى ابْنَيْ أُمَيَّةَ قَالَاخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ وَمَعَنَا صَاحِبٌ لَنَا فَقَاتَلَ رَجُلًا مِنْ الْمُسْلِمِينَ فَعَضَّ الرَّجُلُ ذِرَاعَهُ فَجَذَبَهَا مِنْ فِيهِ فَطَرَحَ ثَنِيَّتَهُ فَأَتَى الرَّجُلُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْتَمِسُ الْعَقْلَ فَقَالَ يَنْطَلِقُ أَحَدُكُمْ إِلَى أَخِيهِ فَيَعَضُّهُ كَعَضِيضِ الْفَحْلِ ثُمَّ يَأْتِي يَطْلُبُ الْعَقْلَ لَا عَقْلَ لَهَا فَأَبْطَلَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Imran bin Bakkar] telah memberitakan kepada kami [Ahmad bin Khalid] telah menceritakan kepada kami [Muhammad] dari ['Atho` bin Abu Rabah] dari [Shafwan bin Abdullah] dari dua orang pamannya, yaitu [Salamah bin Umayyah] dan [Ya'la bin Umayyah]. mereka berkata; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam perang Tabuk dan bersama kami ada seorang sahabat kami. Kemudian dia berkelahi dengan seorang muslim lalu orang tersebut menggigit hastanya kemudian dia menarik tangannya dari mulutnya hingga melepaskan gigi serinya. Lalu orang tersebut datang menghadap kepada Rasulullah shallallahu 'alaihi wasallam mengharapkan diyat. Kemudian beliau bersabda: \"Salah seorang dari kalian mendekati saudaranya kemudian menggigitnya seperti gigitan pejantan, kemudian datang meminta diyat. Tidak ada diyat.\" Maka Rasulullah shallallahu 'alaihi wasallam membatalkan diyat. "
            },
            {
                "number": 4469,
                "arab": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ بْنِ عَبْدِ الْجَبَّارِ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِأَنَّ رَجُلًا عَضَّ يَدَ رَجُلٍ فَانْتُزِعَتْ ثَنِيَّتُهُ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَهْدَرَهَا",
                "id": "Telah mengabarkan kepada kami [Abdul Jabbar bin Al 'Ala` bin Abdul Jabbar] dari [Sufyan] dari ['Amru] dari ['Atho`] dari [Shafwan bin Ya'la] dari [ayahnya] bahwa seorang laki-laki menggigit tangan orang lain kemudian gigi serinya tercabut, kemudian dia datang kepada Nabi shallallahu 'alaihi wasallam dan beliau membatalkannya dan tidak memberinya diyat."
            },
            {
                "number": 4470,
                "arab": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ مَرَّةً أُخْرَى عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ يَعْلَى وَابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ يَعْلَىأَنَّهُ اسْتَأْجَرَ أَجِيرًا فَقَاتَلَ رَجُلًا فَعَضَّ يَدَهُ فَانْتُزِعَتْ ثَنِيَّتُهُ فَخَاصَمَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيَدَعُهَا يَقْضَمُهَا كَقَضْمِ الْفَحْلِ",
                "id": "Telah mengabarkan kepada kami [Abdul Jabbar] sekali lagi dari [Sufyan] dari ['Amru] dari ['Atho`] dari [Shafwan bin Ya'la] dari [Ya'la] dan [Ibnu Juraij] dari ['Atho`] dari [Shafwan bin Ya'la] dari [Ya'laa] bahwa dia mempekerjakan orang upahan kemudian orang tadi berkelahi dengan orang lain dan menggigit tangannya hingga gigi serinya tercabut, kemudian dia melaporkannya kepada Nabi shallallahu 'alaihi wasallam. Lalu beliau bersabda: \"Apakah dia membiarkan tangannya tergigit seperti gigitan pejantan?\""
            }
        ]
    }
}