{
    "status": true,
    "data": {
        "start": 2321,
        "end": 2465,
        "total": 145,
        "book": "tirmidzi",
        "hadits": [
            {
                "number": 2321,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ أَخْبَرَنَا حَاتِمُ بْنُ إِسْمَعِيلَ أَخْبَرَنَا حَمْزَةُ بْنُ أَبِي مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَعَالَى قَالَ لَقَدْ خَلَقْتُ خَلْقًا أَلْسِنَتُهُمْ أَحْلَى مِنْ الْعَسَلِ وَقُلُوبُهُمْ أَمَرُّ مِنْ الصَّبْرِ فَبِي حَلَفْتُ لَأُتِيحَنَّهُمْ فِتْنَةً تَدَعُ الْحَلِيمَ مِنْهُمْ حَيْرَانًا فَبِي يَغْتَرُّونَ أَمْ عَلَيَّ يَجْتَرِئُونَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ عُمَرَ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi] telah menceritakan kepada kami [Muhammad bin 'Abbad] telah menceritakan kepada kami [Hatim bin Isma'il] telah mengkhabarkan kepada kami [Hamzah bin Abu Muhammad] dari [Abdullah bin Dinar] dari [Ibnu Umar] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Allah Ta'ala berfirman: telah Aku ciptakan suatu makhluk yang lidah mereka lebih manis daripada madu sedang hati mereka lebih pahit dari pohon shabir, maka dengan nama-Ku Aku bersumpah, pasti akan Ku-turunkan fitnah kepada mereka sehingga membuat orang sabar kebingungan, maka apakah mereka memperdayakan-Ku atau mereka menantang kepada-Ku?\" Abu Isa berkata: Hadits ini hasan gharib dari Hadits Ibnu Umar, kami tidak mengetahuinya kecuali dari jalur sanad ini."
            },
            {
                "number": 2322,
                "arab": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا ابْنُ الْمُبَارَكِ ح و حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ عَنْ عَلِيِّ بْنِ يَزِيدَ عَنْ الْقَاسِمِ عَنْ أَبِي أُمَامَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَا النَّجَاةُ قَالَ أَمْسِكْ عَلَيْكَ لِسَانَكَ وَلْيَسَعْكَ بَيْتُكَ وَابْكِ عَلَى خَطِيئَتِكَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Shalih bin Abdullah] telah menceritakan kepada kami [Ibnu Al Mubarak], dan telah menceritakan kepada kami [Suwaid] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Yahya bin Ayyub] dari ['Ubaidillah bin Zahr] dari ['Ali bin Yazid] dari [Al Qasim] dari [Abu Umamah] dari ['Uqbah bin 'Amir] berkata, Aku bertanya: Wahai Rasulullah bagaimana supaya selamat? beliau menjawab: \"Jagalah lisanmu, hendaklah rumahmu membuatmu lapang dan menangislah karena dosa dosamu.\" Abu Isa berkata: Hadits ini hasan."
            },
            {
                "number": 2323,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي الصَّهْبَاءِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَفَعَهُ قَالَإِذَا أَصْبَحَ ابْنُ آدَمَ فَإِنَّ الْأَعْضَاءَ كُلَّهَا تُكَفِّرُ اللِّسَانَ فَتَقُولُ اتَّقِ اللَّهَ فِينَا فَإِنَّمَا نَحْنُ بِكَ فَإِنْ اسْتَقَمْتَ اسْتَقَمْنَا وَإِنْ اعْوَجَجْتَ اعْوَجَجْنَاحَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ حَمَّادِ بْنِ زَيْدٍ نَحْوَهُ وَلَمْ يَرْفَعْهُ وَهَذَا أَصَحُّ مِنْ حَدِيثِ مُحَمَّدِ بْنِ مُوسَى قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ وَقَدْ رَوَاهُ غَيْرُ وَاحِدٍ عَنْ حَمَّادِ بْنِ زَيْدٍ وَلَمْ يَرْفَعُوهُ حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي الصَّهْبَاءِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ أَحْسِبُهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Musa Al Bashri] telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu Ash Shahba`] dari [Sa'id bin Jubair] dari [Abu Sa'id Al Khudri] ia memarfu'kannya, ia berkata: \"Bila manusia berada di waktu pagi, seluruh anggota badan menutupi (kesalahan) lisan lalu berkata: Takutlah pada Allah tentang kami, kami bergantung padamu, bila kau lurus kami lurus dan bila kamu bengkok kami bengkok.\" Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Usamah] dari [Hammad bin Zaid] sepertinya tapi ia tidak memarfu'kannya. Dan ini lebih shahih dari hadits Muhammad bin Musa. Berkata Abu Isa: Hadits ini hanya kami ketahui dari hadits Hammad bin Zaid, banyak perawi meriwayatkannya dari Hammad bin Zaid tapi ia tidak memarfu'kannya. Telah menceritakan kepada kami [Shalih bin Abdullah] telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu Ash Shahba`] dari [Sa'id bin Jubair] dari [Abu Sa'id Al Khudri] berkata: Aku mengiranya dari nabi Shallallahu 'alaihi wa Salam, lalu ia menyebut sepertinya."
            },
            {
                "number": 2324,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَتَكَفَّلْ لِي مَا بَيْنَ لَحْيَيْهِ وَمَا بَيْنَ رِجْلَيْهِ أَتَكَفَّلْ لَهُ بِالْجَنَّةِوَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ سَهْلٍ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ سَهْلِ بْنِ سَعْدٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Abdul A'la Ash Shan'ani] telah menceritakan kepada kami [Umar bin 'Ali Al Muqaddami] dari [Abu Hazim] dari [Sahal bin Sa'ad] berkata: \"Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Barangsiapa menjamin apa yang ada diantara dua jambangnya (lisan) dan apa yang diantara kedua kakinya (kemaluan) untukku, aku menjamin surga baginya.\" Dalam hal ini ada hadits serupa dari Abu Hurairah dan Ibnu 'Abbas. Berkata Abu Isa: Hadits Sahal adalah hadits hasan gharib dari hadits Sahal bin Sa'id."
            },
            {
                "number": 2325,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَقَاهُ اللَّهُ شَرَّ مَا بَيْنَ لَحْيَيْهِ وَشَرَّ مَا بَيْنَ رِجْلَيْهِ دَخَلَ الْجَنَّةَقَالَ أَبُو عِيسَى أَبُو حَازِمٍ الَّذِي رَوَى عَنْ أَبِي هُرَيْرَةَ اسْمُهُ سَلْمَانُ مَوْلَى عَزَّةَ الْأَشْجَعِيَّةِ وَهُوَ كُوفِيٌّ وَأَبُو حَازِمٍ الَّذِي رَوَى عَنْ سَهْلِ بْنِ سَعْدٍ هُوَ أَبُو حَازِمٍ الزَّاهِدُ مَدَنِيٌّ وَاسْمُهُ سَلَمَةُ بْنُ دِينَارٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyaj] telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Ibnu 'Ajlan] dari [Abu Hazim] dari [Abu Hurairah] dia berkata Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa yang dijaga Allah dari kejahatan sesuatu yang ada di antara kedua jambangnya (lisan) dan kejahatan apa yang ada di antara kedua kakinya (kemaluan) maka dia masuk surga.\" Abu Isa berkata: Abu Hazim yang telah meriwayatkan dari Abu Hurairah namanya adalah Salman budak 'Azzah Al Asyja'iyyah dia adalah orang Kufah, sedangkan Abu Hazim yang telah meriwayatkan dari Sahl bin Sa'ad dia adalah Abu Hazim Az Zahid dan dia adalah orang Madinah, namanya Salamah bin Dinar, dan hadits ini hasan gharib."
            },
            {
                "number": 2326,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَاعِزٍ عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ حَدِّثْنِي بِأَمْرٍ أَعْتَصِمُ بِهِ قَالَ قُلْ رَبِّيَ اللَّهُ ثُمَّ اسْتَقِمْ قُلْتُ يَا رَسُولَ اللَّهِ مَا أَخْوَفُ مَا تَخَافُ عَلَيَّ فَأَخَذَ بِلِسَانِ نَفْسِهِ ثُمَّ قَالَ هَذَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] dari [Ma'mar] dari [Az Zuhri] dari [Abdurrahman bin Ma'iz] dari [Sufyan bin Abdullah Ats Tsaqafi] berkata: Aku berkata: Wahai Rasulullah, ceritakan padaku suatu hal yang aku jadikan pedoman. Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Katakan: Rabbku Allah kemudian beristiqamahlah.\" Aku bertanya: Wahai Rasulullah, apa yang paling anda takutkan padaku? Beliau memegang lidah beliau lalu menjawab: \"Ini.\" Berkata Abu Isa: Hadits ini hasan shahih dan telah diriwayatkan melalui beberapa sanad dari Sufyan bin Abdullah Ats Tsaqafi."
            },
            {
                "number": 2327,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ اللَّهِ مُحَمَّدُ بْنُ أَبِي ثَلْجٍ الْبَغْدَادِيُّ صَاحِبُ أَحْمَدَ بْنِ حَنْبَلٍ حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاطِبٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُكْثِرُوا الْكَلَامَ بِغَيْرِ ذِكْرِ اللَّهِ فَإِنَّ كَثْرَةَ الْكَلَامِ بِغَيْرِ ذِكْرِ اللَّهِ قَسْوَةٌ لِلْقَلْبِ وَإِنَّ أَبْعَدَ النَّاسِ مِنْ اللَّهِ الْقَلْبُ الْقَاسِيحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ حَدَّثَنِي أَبُو النَّضْرِ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حَاطِبٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حَاطِبٍ",
                "id": "Telah menceritakan kepada kami [Abu 'Abdillah Muhammad bin Abu Tsalj Al Baghdadi] sahabat Ahmad bin Hambal, telah menceritakan kepada kami ['Ali bin Hafsh] telah menceritakan kepada kami [Ibrahim bin 'Abdillah bin Hatib] dari [Abdullah bin Dinar] dari [Ibnu Umar] berkata bahwa Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Janganlah kalian banyak bicara tanpa berdzikir kepada Allah, karena banyak bicara tanpa berdzikir kepada Allah membuat hati menjadi keras, dan orang yang paling jauh dari Allah adalah orang yang berhati keras.\" Telah menceritakan kepada kami [Abu Bakar bin Abu An Nadlar] telah menceritakan kepada kami [Abu An Nadlar] dari [Ibrahim bin Abdullah bin Hatib] dari [Abdullah bin Dinar] dari [Ibnu Umar] dari Nabi Shallallahu 'alaihi wa Salam dengan hadits yang semakna. Abu Isa berkata: Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari hadits Ibrahim bin Abdullah bin Hatib."
            },
            {
                "number": 2328,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ خُنَيْسٍ الْمَكِّيُّ قَال سَمِعْتُ سَعِيدَ بْنَ حَسَّانَ الْمَخْزُومِيَّ قَالَ حَدَّثَتْنِي أُمُّ صَالِحٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ كَلَامِ ابْنِ آدَمَ عَلَيْهِ لَا لَهُ إِلَّا أَمْرٌ بِمَعْرُوفٍ أَوْ نَهْيٌ عَنْ مُنْكَرٍ أَوْ ذِكْرُ اللَّهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُحَمَّدِ بْنِ يَزِيدَ بْنِ خُنَيْسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan yang lainnya mereka berkata: telah menceritakan kepada kami [Muhammad bin Yazid bin Khunais Al Makki] dia berkata: Aku mendengar [Sa'id bin Hassan Al Makhzumi] berkata: telah menceritakan kepadaku [Ummu Shalih] dari [Shafiyyah binti Syaibah] dari [Ummu Habibah] istri Nabi Shallallahu 'alaihi wa Salam dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Setiap perkataan anak cucu Adam itu membahayakannya, tidak berguna baginya kecuali amar ma'ruf, nahi munkar, atau berdzikir kepada Allah.\" Abu Isa berkata: Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari hadits Muhammad bin Yazid bin Khunais."
            },
            {
                "number": 2329,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ حَدَّثَنَا أَبُو الْعُمَيْسِ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ أَبِيهِ قَالَآخَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ سَلْمَانَ وَبَيْنَ أَبِي الدَّرْدَاءِ فَزَارَ سَلْمَانُ أَبَا الدَّرْدَاءِ فَرَأَى أُمَّ الدَّرْدَاءِ مُتَبَذِّلَةً فَقَالَ مَا شَأْنُكِ مُتَبَذِّلَةً قَالَتْ إِنَّ أَخَاكَ أَبَا الدَّرْدَاءِ لَيْسَ لَهُ حَاجَةٌ فِي الدُّنْيَا قَالَ فَلَمَّا جَاءَ أَبُو الدَّرْدَاءِ قَرَّبَ إِلَيْهِ طَعَامًا فَقَالَ كُلْ فَإِنِّي صَائِمٌ قَالَ مَا أَنَا بِآكِلٍ حَتَّى تَأْكُلَ قَالَ فَأَكَلَ فَلَمَّا كَانَ اللَّيْلُ ذَهَبَ أَبُو الدَّرْدَاءِ لِيَقُومَ فَقَالَ لَهُ سَلْمَانُ نَمْ فَنَامَ ثُمَّ ذَهَبَ يَقُومُ فَقَالَ لَهُ نَمْ فَنَامَ فَلَمَّا كَانَ عِنْدَ الصُّبْحِ قَالَ لَهُ سَلْمَانُ قُمْ الْآنَ فَقَامَا فَصَلَّيَا فَقَالَ إِنَّ لِنَفْسِكَ عَلَيْكَ حَقًّا وَلِرَبِّكَ عَلَيْكَ حَقًّا وَلِضَيْفِكَ عَلَيْكَ حَقًّا وَإِنَّ لِأَهْلِكَ عَلَيْكَ حَقًّا فَأَعْطِ كُلَّ ذِي حَقٍّ حَقَّهُ فَأَتَيَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَا ذَلِكَ فَقَالَ لَهُ صَدَقَ سَلْمَانُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَأَبُو الْعُمَيْسِ اسْمُهُ عُتْبَةُ بْنُ عَبْدِ اللَّهِ وَهُوَ أَخُو عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ الْمَسْعُودِيِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Ja'far bin 'Aun] telah menceritakan kepada kami [Abul 'Umais] dari ['Aun bin Abu Juhaifah] dari [bapaknya] berkata: Rasulullah Shallallahu 'alaihi wa Salam mempersaudarakan antara Salman dengan Abu Darda`, kemudian Salman mengunjungi Abu Darda` dan melihat Ummu Darda` berpenampilan kusam, lalu Salman bertanya kepadanya: Kenapa kamu berpenampilan kusam? dia menjawab: Sesungguhnya saudaramu (yaitu Abu Darda`) tidak memerlukan dunia. Abu Juhaifah berkata: Ketika Abu Darda` tiba, didekatkanlah makanan kepada Salman lalu dia (Abu Darda`) berkata: Makanlah karena aku sedang berpuasa, Salman menjawab: Saya tidak akan makan sampai kamu ikut makan. Abu Juhaifah berkata: Abu Darda` akhirnya makan, kemudian ketika tiba waktu malam Abu Darda` pergi untuk melaksanakan sholat namun Salman berkata kepadanya: Tidurlah. Dia pun tidur, kemudian dia pergi untuk sholat malam dan Salman berkata kepadanya: Tidurlah, akhirnya dia tidur, dan ketika menjelang shubuh Salman berkata kepadanya: Sekarang bangunlah, akhirnya keduanya bangun dan melaksanakan sholat, Salman berkata: Sesungguhnya dirimu mempunyai hak atasmu, Rabbmu juga mempunyai hak atasmu, tamumu juga mempunyai hak atasmu dan keluargamu juga mempunyai hak atasmu."
            },
            {
                "number": 2330,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ عَبْدِ الْوَهَّابِ بْنِ الْوَرْدِ عَنْ رَجُلٍ مِنْ أَهْلِ الْمَدِينَةِ قَالَكَتَبَ مُعَاوِيَةُ إِلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا أَنْ اكْتُبِي إِلَيَّ كِتَابًا تُوصِينِي فِيهِ وَلَا تُكْثِرِي عَلَيَّ فَكَتَبَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا إِلَى مُعَاوِيَةَ سَلَامٌ عَلَيْكَ أَمَّا بَعْدُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ الْتَمَسَ رِضَا اللَّهِ بِسَخَطِ النَّاسِ كَفَاهُ اللَّهُ مُؤْنَةَ النَّاسِ وَمَنْ الْتَمَسَ رِضَا النَّاسِ بِسَخَطِ اللَّهِ وَكَلَهُ اللَّهُ إِلَى النَّاسِ وَالسَّلَامُ عَلَيْكَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا كَتَبَتْ إِلَى مُعَاوِيَةَ فَذَكَرَ الْحَدِيثَ بِمَعْنَاهُ وَلَمْ يَرْفَعْهُ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari ['Abdul Wahhab bin Al Ward] dari [seorang penduduk Madinah], dia berkata: Mu'awiyah menulis surat kepada Aisyah Ummul Mu`minin radliallahu 'anha supaya dia menulis surat yang berisi wasiat kepadanya dan isinya tidak panjang panjang, [Aisyah] menulis surat kepada Mu'awiyah: SALAAMUN 'ALAIKA, aku mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa yang mencari keridlaan Allah sekalipun memperoleh kebencian manusia, Allah akan mencukupkan dia dari ketergantungan kepada manusia dan barangsiapa yang mencari keridlaan manusia dengan mendatangkan kemurkaan dari Allah, maka Allah akan menjadikannya bergantung kepada manusia, WASSALAMU 'ALAIKA. Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Sufyan Ats Tsauri] dari [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah], dia menulis surat kepada Mu'awiyah, kemudian dia menyebutkan hadits yang semakna namun tidak memarfu'kannya (tidak menyambungkan sampai Nabi)."
            },
            {
                "number": 2331,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ خَيْثَمَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْكُمْ مِنْ رَجُلٍ إِلَّا سَيُكَلِّمُهُ رَبُّهُ يَوْمَ الْقِيَامَةِ وَلَيْسَ بَيْنَهُ وَبَيْنَهُ تُرْجُمَانٌ فَيَنْظُرُ أَيْمَنَ مِنْهُ فَلَا يَرَى شَيْئًا إِلَّا شَيْئًا قَدَّمَهُ ثُمَّ يَنْظُرُ أَشْأَمَ مِنْهُ فَلَا يَرَى شَيْئًا إِلَّا شَيْئًا قَدَّمَهُ ثُمَّ يَنْظُرُ تِلْقَاءَ وَجْهِهِ فَتَسْتَقْبِلُهُ النَّارُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَقِيَ وَجْهَهُ حَرَّ النَّارِ وَلَوْ بِشِقِّ تَمْرَةٍ فَلْيَفْعَلْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا أَبُو السَّائِبِ حَدَّثَنَا وَكِيعٌ يَوْمًا بِهَذَا الْحَدِيثِ عَنْ الْأَعْمَشِ فَلَمَّا فَرَغَ وَكِيعٌ مِنْ هَذَا الْحَدِيثِ قَالَ مَنْ كَانَ هَا هُنَا مِنْ أَهْلِ خُرَاسَانَ فَلْيَحْتَسِبْ فِي إِظْهَارِ هَذَا الْحَدِيثِ بِخُرَاسَانَ لِأَنَّ الْجَهْمِيَّةَ يُنْكِرُونَ هَذَا اسْمُ أَبِي السَّائِبِ سَلْمُ بْنُ جُنَادَةَ بْنِ سَلْمِ بْنِ خَالِدِ بْنِ جَابِرِ بْنِ سَمُرَةَ الْكُوفِيُّ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Khaitsamah] dari ['Adi bin Hatim] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Tidaklah ada seorang dari kalian melainkan akan diajak bicara Rabbnya pada hari kiamat yang tidak ada penerjemah antara keduanya, ia melihat ke sisi paling membawa berkahnya, ia tidak melihat apa pun kecuali sesuatu yang telah diperbuat, lalu ia melihat ke sisi kirinya, ia tidak melihat apa pun selain sesuatu yang telah diperbuat lalu ia melihat ke arah depannya, lalu neraka menyambutnya.\" Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Barangsiapa di antara kalian bisa menjaga wajahnya dari panasnya neraka meski dengan sebelah kurma hendaklah ia lakukan.\" Berkata Abu Isa: Hadits ini hasan shahih. Telah menceritakan kepada kami [Abu As Sa`ib] telah menceritakan kepada kami [Waki'] pada suatu hari hadits ini dari [Al A'masy], setelah usai menyebut hadits ini Waki' berkata: Siapa pun penduduk Khurasan yang ada di sini, hendaklah mengharap pahala dengan menyebarkan hadits ini di Khurasan karena jahmiyah mengingkari hadits ini. nama Abu As Sa`ib adalah Salm bin Junadah bin Salm bin Khalid bin Jabir bin Samurah Al Kufi."
            },
            {
                "number": 2332,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا حُصَيْنُ بْنُ نُمَيْرٍ أَبُو مِحْصَنٍ حَدَّثَنَا حُسَيْنُ بْنُ قَيْسٍ الرَّحَبِيُّ حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ عَنْ ابْنِ عُمَرَ عَنْ ابْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَزُولُ قَدَمُ ابْنِ آدَمَ يَوْمَ الْقِيَامَةِ مِنْ عِنْدِ رَبِّهِ حَتَّى يُسْأَلَ عَنْ خَمْسٍ عَنْ عُمُرِهِ فِيمَ أَفْنَاهُ وَعَنْ شَبَابِهِ فِيمَ أَبْلَاهُ وَمَالِهِ مِنْ أَيْنَ اكْتَسَبَهُ وَفِيمَ أَنْفَقَهُ وَمَاذَا عَمِلَ فِيمَا عَلِمَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ حَدِيثِ الْحُسَيْنِ بْنِ قَيْسٍ وَحُسَيْنُ بْنُ قَيْسٍ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ وَفِي الْبَاب عَنْ أَبِي بَرْزَةَ وَأَبِي سَعِيدٍ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] telah menceritakan kepada kami [Hushain bin Numair Abu Mihshan] telah menceritakan kepada kami [Husain bin Qais Ar Rahabi] telah menceritakan kepada kami ['Atho` bin Abu Rabah] dari [Ibnu Umar] dari [Ibnu Mas'ud] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Kaki Anak Adam tidaklah bergeser pada hari Kiamat dari sisi Rabbnya sehingga ditanya tentang lima hal; tentang umurnya untuk apa dia habiskan, tentang masa mudanya untuk apa dia pergunakan, tentang hartanya dari mana dia peroleh dan kemana dia infakkan dan tentang apa yang telah dia lakukan dengan ilmunya.\" Abu Isa berkata: Hadits ini gharib, kami tidak mengetahuinya dari hadits Ibnu Mas'ud dari Nabi Shallallahu 'alaihi wa Salam kecuali dari Hadits Al Husain bin Qais, sementara Husain bin Qais dilemahkan dalam masalah hadits karena sisi hafalannya, dan dalam bab ini ada hadits dari Abu Barzah dan Abu Sa'id."
            },
            {
                "number": 2333,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ بْنِ جُرَيْجٍ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَزُولُ قَدَمَا عَبْدٍ يَوْمَ الْقِيَامَةِ حَتَّى يُسْأَلَ عَنْ عُمُرِهِ فِيمَا أَفْنَاهُ وَعَنْ عِلْمِهِ فِيمَ فَعَلَ وَعَنْ مَالِهِ مِنْ أَيْنَ اكْتَسَبَهُ وَفِيمَ أَنْفَقَهُ وَعَنْ جِسْمِهِ فِيمَ أَبْلَاهُقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَسَعِيدُ بْنُ عَبْدِ اللَّهِ بْنِ جُرَيْجٍ هُوَ بَصْرِيٌّ وَهُوَ مَوْلَى أَبِي بَرْزَةَ وَأَبُو بَرْزَةَ اسْمُهُ نَضْلَةُ بْنُ عُبَيْدٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah menceritakan kepada kami [Al Aswad bin 'Amir] telah mengkhabarkan kepada kami [Abu Bakar bin Ayyasy] dari [Al A'masy] dari [Sa'id bin Abdullah bin Juraij] dari [Abu Barzah Al Aslami] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Kedua telapak kaki seorang hamba tidak akan bergeser pada hari kiamat sampai ditanya tentang umurnya untuk apa dia habiskan, tentang ilmunya untuk apa dia amalkan, tentang hartanya dari mana dia peroleh dan kemana dia infakkan dan tentang tubuhnya untuk apa dia gunakan.\" Dia berkata: Hadits ini hasan shahih, adapun Sa'id bin Abdullah bin Juraij dia adalah orang Bashrah dan dia adalah budak Abu Barzah, sedangkan Abu Barzah namanya adalah Nadlah bin 'Ubaid."
            },
            {
                "number": 2334,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَدْرُونَ مَا الْمُفْلِسُ قَالُوا الْمُفْلِسُ فِينَا يَا رَسُولَ اللَّهِ مَنْ لَا دِرْهَمَ لَهُ وَلَا مَتَاعَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُفْلِسُ مِنْ أُمَّتِي مَنْ يَأْتِي يَوْمَ الْقِيَامَةِ بِصَلَاتِهِ وَصِيَامِهِ وَزَكَاتِهِ وَيَأْتِي قَدْ شَتَمَ هَذَا وَقَذَفَ هَذَا وَأَكَلَ مَالَ هَذَا وَسَفَكَ دَمَ هَذَا وَضَرَبَ هَذَا فَيَقْعُدُ فَيَقْتَصُّ هَذَا مِنْ حَسَنَاتِهِ وَهَذَا مِنْ حَسَنَاتِهِ فَإِنْ فَنِيَتْ حَسَنَاتُهُ قَبْلَ أَنْ يُقْتَصَّ مَا عَلَيْهِ مِنْ الْخَطَايَا أُخِذَ مِنْ خَطَايَاهُمْ فَطُرِحَ عَلَيْهِ ثُمَّ طُرِحَ فِي النَّارِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al 'Alla` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] Rasulullah Shallallahu 'alaihi wa salam bertanya: \"Tahukah kalian siapa orang yang rugi itu?\" mereka menjawab: Orang rugi di antara kami wahai Rasulullah adalah orang yang tidak memiliki dirham dan barang. Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Orang rugi dari ummatku adalah orang yang membawa sholat, puasa dan zakat pada hari kiamat, ia datang sementara ia dulu pernah mencela si anu, menuduh berzina si anu, memakan harta si anu, menumpahkan darah si anu dan memukul si anu. Ia duduk lalu kebaikan-kebaikan si ini diqisas dari kebaikan-kebaikannya, bila kebaikan-kebaikannya habis sebelum sepadan dengan kesalahan-kesalahannya, kesalahan-kesalahan mereka diambil lalu dibuang kepadanya, setelah itu dia dilempar ke neraka.\" Berkata Abu Isa: Hadits ini hasan shahih."
            },
            {
                "number": 2335,
                "arab": "حَدَّثَنَا هَنَّادٌ وَنَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ قَالَا حَدَّثَنَا الْمُحَارِبِيُّ عَنْ أَبِي خَالِدٍ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ عَبْدًا كَانَتْ لِأَخِيهِ عِنْدَهُ مَظْلَمَةٌ فِي عِرْضٍ أَوْ مَالٍ فَجَاءَهُ فَاسْتَحَلَّهُ قَبْلَ أَنْ يُؤْخَذَ وَلَيْسَ ثَمَّ دِينَارٌ وَلَا دِرْهَمٌ فَإِنْ كَانَتْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ حَسَنَاتِهِ وَإِنْ لَمْ تَكُنْ لَهُ حَسَنَاتٌ حَمَّلُوا عَلَيْهِ مِنْ سَيِّئَاتِهِمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ سَعِيدٍ الْمَقْبُرِيِّ وَقَدْ رَوَاهُ مَالِكُ بْنُ أَنَسٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Hannad] dan [Nashr bin Abdurrahman Al Kufi] keduanya berkata: telah menceritakan kepada kami [Al Muharibi] dari [Abu Khalid Yazid bin Abdurrahman] dari [Zaid bin Abu 'Unaisah] dari [Sa'id Al Maqburi] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Allah memberikan rahmat kepada seorang hamba yang dizhalimi harga diri dan hartanya oleh saudaranya, kemudian dia (yang zhalim) mendatanginya dan dia (yang dizhalimi) merelakannya sebelum meninggal, tidak ada balasan uang dinar maupun dirham (di akhirat), jika dia (orang yang dizhalimi) memiliki kebaikan niscaya akan dipenuhi kebaikannya namun jika tidak mempunyai kebaikan maka (dosa dosa yang zhalimi) akan di berikan kepadanya (orang yang menzhalimi).\" Abu Isa berkata: Hadits ini hasan shahih gharib dari hadits Sa'id Al Maqburi, [Malik bin Anas] telah meriwayatkannya dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam dengan hadits yang semakna."
            },
            {
                "number": 2336,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَتُؤَدُّنَّ الْحُقُوقَ إِلَى أَهْلِهَا حَتَّى يُقَادَ لِلشَّاةِ الْجَلْحَاءِ مِنْ الشَّاةِ الْقَرْنَاءِوَفِي الْبَاب عَنْ أَبِي ذَرٍّ وَعَبْدِ اللَّهِ بْنِ أُنَيْسٍ قَالَ أَبُو عِيسَى وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al 'Alla` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Hak-hak akan ditunaikan kepada pemiliknya hingga kambing bertanduk di qisas karena kambing botak.\" Dalam hal ini ada hadits serupa dari Abu Hurairah, Abu Dzarr, Abdullah bin Unais. Berkata Abu Isa: Hadits Abu Hurairah hasan shahih."
            },
            {
                "number": 2337,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ حَدَّثَنَا الْمِقْدَادُ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أُدْنِيَتْ الشَّمْسُ مِنْ الْعِبَادِ حَتَّى تَكُونَ قِيدَ مِيلٍ أَوْ اثْنَيْنِ قَالَ سُلَيْمٌ لَا أَدْرِي أَيَّ الْمِيلَيْنِ عَنَى أَمَسَافَةُ الْأَرْضِ أَمْ الْمِيلُ الَّذِي تُكْتَحَلُ بِهِ الْعَيْنُ قَالَ فَتَصْهَرُهُمْ الشَّمْسُ فَيَكُونُونَ فِي الْعَرَقِ بِقَدْرِ أَعْمَالِهِمْ فَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى عَقِبَيْهِ وَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى رُكْبَتَيْهِ وَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى حِقْوَيْهِ وَمِنْهُمْ مَنْ يُلْجِمُهُ إِلْجَامًا فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشِيرُ بِيَدِهِ إِلَى فِيهِ أَيْ يُلْجِمُهُ إِلْجَامًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ وَابْنِ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] telah mengkhabarkan kepada kami [Abdurrahman bin Yazid bin Jabir] telah menceritakan kepadaku [Sulaim bin 'Amir] telah menceritakan kepada kami [Al Miqdad] sahabat Rasulullah Shallallahu 'alahi wa Salam, berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Pada hari kiamat, matahari di dekatkan ke manusia hingga sebatas satu atau dua mil -berkata Sulam: Aku tidak tahu apakah maksud dua mil itu jarak bumi ataukah mil yang dipakai bercalak mata- lalu matahari melehkan mereka, lalu mereka berada dalam keringat sesuai amal perbuatan mereka, di antara mereka ada yang berkeringat hingga tumitnya, ada yang berkeringat hingga lututnya, ada yang berkeringat hingga pinggang dan ada yang benar-benar tenggelam oleh keringat.\" Aku melihat Rasulullah Shallallahu 'alahi wa Salam menunjukkan tangan ke mulut, maksudnya benar-benar tenggelam. Berkata Abu Isa: Hadits ini hasan shahih dan dalam hal ini ada hadits serupa dari Abu Sa'id dan Ibnu Umar."
            },
            {
                "number": 2338,
                "arab": "حَدَّثَنَا أَبُو زَكَرِيَّا يَحْيَى بْنُ دُرُسْتَ الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ حَمَّادٌ وَهُوَ عِنْدَنَا مَرْفُوعٌ{ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ }قَالَ يَقُومُونَ فِي الرَّشْحِ إِلَى أَنْصَافِ آذَانِهِمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abu Zakariya Yahya bin Durusta Al Bashri] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar], berkata Hammad: Itu menurut kami marfu': Pada hari manusia berdiri untuk Rabb semesta alam. Ia berkata: Mereka berdiri dalam keringat hingga mencapai pertengahan telinga mereka. Berkata Abu Isa: Hadits ini hasan shahih. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami ['Isa bin Yunus] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] dari nabi Shallallahu 'alaihi wa Salam sepertinya."
            },
            {
                "number": 2339,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ الْمُغِيرَةِ بْنِ النُّعْمَانِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ حُفَاةً عُرَاةً غُرْلًا كَمَا خُلِقُوا ثُمَّ قَرَأَ{ كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ }وَأَوَّلُ مَنْ يُكْسَى مِنْ الْخَلَائِقِ إِبْرَاهِيمُ وَيُؤْخَذُ مِنْ أَصْحَابِي بِرِجَالٍ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ فَأَقُولُ يَا رَبِّ أَصْحَابِي فَيُقَالُ إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ{ إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ }حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ الْمُغِيرَةِ بْنِ النُّعْمَانِ بِهَذَا الْإِسْنَادِ فَذَكَرَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Ahmad Az Zubairi] telah menceritakan kepada kami [Sufyan] dari [Al Mughirah bin An Nu'man] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Manusia dikumpulkan pada hari kiamat dalam kondisi tanpa alas kaki, telanjang dan belum disunat.\" Kemudian beliau membaca: \"Sebagaimana kami telah memulai panciptaan pertama begitulah Kami akan mengulanginya. Itulah suatu janji yang pasti kami tepati.\" (Al-Anbiyaa`: 104) dan makhluk pertama yang diberi pakaian adalah Ibrahim dan di antara para sahabat-sahabat kami ada yang diambil dari kiki dan kanan, aku berkata: Wahai Rabb, sahabat-sahabatku. Dikatakan: Sesungguhnya engkau tidak tahu apa yang mereka buat-buat setelahmu, mereka tetap murtad sejak kau tinggalkan mereka. Lalu aku berkata seperti yang diucapkan hamba shalih: \"Jika Engkau menyiksa mereka, maka sesungguhnya mereka adalah hamba-hamba Engkau, dan jika Engkau mengampuni mereka, maka sesungguhnya Engkaulah yang Maha Perkasa lagi Maha Bijaksana.\" (Al-Maa`idah: 118) Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Muhammad bin Al Mutsanna] keduanya berkata: telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Al Mughirah bin An Nu'man] dengan sanad ini lalu ia menyebut sepertinya. Berkata Abu Isa: Hadits ini hasan shahih."
            },
            {
                "number": 2340,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّكُمْ مَحْشُورُونَ رِجَالًا وَرُكْبَانًا وَتُجَرُّونَ عَلَى وُجُوهِكُمْوَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Yazid bin Harun] telah mengkhabarkan kepada kami [Bahz bin Hakim] dari [ayahnya] dari [kakeknya] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Sesungguhnya kalian akan dikumpulkan dengan berjalan kaki, berkendaraan dan diseret di atas muka-muka kalian.\" Dalam hal ini ada hadits serupa dari Abu Hurairah. Berkata Abu Isa: Hadits ini hasan shahih."
            },
            {
                "number": 2341,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ عَلِيِّ بْنِ عَلِيٍّ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْرَضُ النَّاسُ يَوْمَ الْقِيَامَةِ ثَلَاثَ عَرْضَاتٍ فَأَمَّا عَرْضَتَانِ فَجِدَالٌ وَمَعَاذِيرُ وَأَمَّا الْعَرْضَةُ الثَّالِثَةُ فَعِنْدَ ذَلِكَ تَطِيرُ الصُّحُفُ فِي الْأَيْدِي فَآخِذٌ بِيَمِينِهِ وَآخِذٌ بِشِمَالِهِقَالَ أَبُو عِيسَى وَلَا يَصِحُّ هَذَا الْحَدِيثُ مِنْ قِبَلِ أَنَّ الْحَسَنَ لَمْ يَسْمَعْ مِنْ أَبِي هُرَيْرَةَ وَقَدْ رَوَاهُ بَعْضُهُمْ عَنْ عَلِيٍّ الرِّفَاعِيِّ عَنْ الْحَسَنِ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عِيسَى وَلَا يَصِحُّ هَذَا الْحَدِيثُ مِنْ قِبَلِ أَنَّ الْحَسَنَ لَمْ يَسْمَعْ مِنْ أَبِي مُوسَى",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] dari ['Ali bin 'Ali] dari [Al Hasan] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Pada hari kiamat manusia diajukan sebanyak tiga kali, dua kali pengajuan untuk bantahan dan alasan-alasan dan pada pengajuan ketiga, saat itu lembaran-lembaran berterbangan ditangan, ada yang mengambil dengan tangan kanannya dan ada yang mengambil dengan tangan kirinya.\" Berkata Abu Isa: Hadits ini tidak shahih karena Al Hasan tidak mendengar dari Abu Hurairah dan sebagaian dari mereka meriwayatkannya dari ['Ali Ar Rifa'i] dari [Al Hasan] dari [Abu Musa] dari nabi Shallallahu 'alaihi wa Salam. Berkata Abu Isa: Hadits ini tidak shahih karena Al Hasan tidak mendengar dari Abu Musa."
            },
            {
                "number": 2342,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ عُثْمَانَ بْنِ الْأَسْوَدِ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نُوقِشَ الْحِسَابَ هَلَكَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ تَعَالَى يَقُولُ{ فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا }قَالَ ذَلِكَ الْعَرْضُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ وَرَوَاهُ أَيُّوبُ أَيْضًا عَنْ ابْنِ أَبِي مُلَيْكَةَ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] dari ['Utsman bin Al Aswad] dari [Ibnu Abi Malikah] dari ['Aisyah] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Barangsiapa didebat saat penghisaban, ia celaka.\" Aku berkata: Wahai Rasulullah, Allah Ta'ala berfirman: \"Adapun orang yang diberikan kitabnya dari sebelah kanannya, maka dia akan diperiksa dengan pemeriksaan yang mudah.\" (Al-Insyiqaaq: 7-8) Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Itu pengajuan.\" Berkata Abu Isa: Hadits ini shahih hasan, dan [Ayyub] juga meriwayatkannya dari [Ibnu Abi Malikah]."
            },
            {
                "number": 2343,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ عَنْ الْحَسَنِ وَقَتَادَةَ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُجَاءُ بِابْنِ آدَمَ يَوْمَ الْقِيَامَةِ كَأَنَّهُ بَذَجٌ فَيُوقَفُ بَيْنَ يَدَيْ اللَّهِ فَيَقُولُ اللَّهُ لَهُ أَعْطَيْتُكَ وَخَوَّلْتُكَ وَأَنْعَمْتُ عَلَيْكَ فَمَاذَا صَنَعْتَ فَيَقُولُ يَا رَبِّ جَمَعْتُهُ وَثَمَّرْتُهُ فَتَرَكْتُهُ أَكْثَرَ مَا كَانَ فَارْجِعْنِي آتِكَ بِهِ فَيَقُولُ لَهُ أَرِنِي مَا قَدَّمْتَ فَيَقُولُ يَا رَبِّ جَمَعْتُهُ وَثَمَّرْتُهُ فَتَرَكْتُهُ أَكْثَرَ مَا كَانَ فَارْجِعْنِي آتِكَ بِهِ كُلِّهِ فَإِذَا عَبْدٌ لَمْ يُقَدِّمْ خَيْرًا فَيُمْضَى بِهِ إِلَى النَّارِقَالَ أَبُو عِيسَى وَقَدَ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ عَنْ الْحَسَنِ قَوْلَهُ وَلَمْ يُسْنِدُوهُ وَإِسْمَعِيلُ بْنُ مُسْلِمٍ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ الْخُدْرِيِّ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah menceritakan kepada kami [Ibnu Al Mubarak] telah mengkhabarkan kepada kami [Isma'il bin Muslim] dari [Al Hasan] dan [Qotadah] dari [Anas] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Pada hari Kiamat anak Adam akan didatangkan seperti anak domba kemudian terhenti di hadapan Allah lalu Allah bertanya kepadanya: Aku telah memberimu, menganugerahkan kepadamu dan memberimu nikmat, lalu apa yang telah kamu lakukan? dia menjawab: Wahai Rabbku, aku telah mengumpulkannya dan mengembangkannya lalu aku tinggalkan menjadi semakin banyak, maka kembalikanlah aku supaya aku bisa membawanya semuanya kepadamu, ternyata hamba ini tidak membawa kebaikan kemudian Allah menyeretnya ke neraka.\" Abu Isa berkata: Banyak perowi yang meriwayatkan hadits ini dari perkataan Al Hasan dan mereka tidak memusnadkannya (tidak menyambungkannya sampai Nabi), adapun Isma'il bin Muslim dia dilemahkan dalam masalah hadits dari sisi hafalannya, dan dalam bab ini ada hadits dari Abu Hurairah dan Abu Sa'id Al Khudri."
            },
            {
                "number": 2344,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ الْبَصْرِيُّ حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ أَبُو مُحَمَّدٍ التَّمِيمِيُّ الْكُوفِيُّ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ وَعَنْ أَبِي سَعِيدٍ قَالَاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِالْعَبْدِ يَوْمَ الْقِيَامَةِ فَيَقُولُ اللَّهُ لَهُ أَلَمْ أَجْعَلْ لَكَ سَمْعًا وَبَصَرًا وَمَالًا وَوَلَدًا وَسَخَّرْتُ لَكَ الْأَنْعَامَ وَالْحَرْثَ وَتَرَكْتُكَ تَرْأَسُ وَتَرْبَعُ فَكُنْتَ تَظُنُّ أَنَّكَ مُلَاقِي يَوْمَكَ هَذَا قَالَ فَيَقُولُ لَا فَيَقُولُ لَهُ الْيَوْمَ أَنْسَاكَ كَمَا نَسِيتَنِيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ وَمَعْنَى قَوْلِهِ الْيَوْمَ أَنْسَاكَ يَقُولُ الْيَوْمَ أَتْرُكُكَ فِي الْعَذَابِ هَكَذَا فَسَّرُوهُ قَالَ أَبُو عِيسَى وَقَدْ فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ هَذِهِ الْآيَةَ{ فَالْيَوْمَ نَنْسَاهُمْ }قَالُوا إِنَّمَا مَعْنَاهُ الْيَوْمَ نَتْرُكُهُمْ فِي الْعَذَابِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad Az Zuhri Al Bashri] telah menceritakan kepada kami [Malik bin Syu'air Abu Muhammad At Tamimi Al Kufi] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dan [Abu Sa'id] keduanya bercerita bahwa Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Pada hari Kiamat seorang hamba akan didatangkan kemudian Allah bertanya kepadanya: Bukankah Aku telah membuatkan pendengaran, penglihatan, harta dan anak untuku, dan Aku telah menundukkan hewan ternak dan tanaman untukmu, Aku telah tingagalkan kamu menjadi pemimpin dan mendapatkan seperempat (harta rampasan), apakah kamu mengira akan menemuiKu saat ini?\" hamba itu menjawab: Tidak. kemudian Allah berfirman kepadanya: Pada hari ini Aku melupakanmu sebagaimana kamu telah melupakanKu.\" Abu Isa berkata: Hadits ini shahih gharib, adapun makna firman Allah \"Pada hari ini Aku melupakanmu, \" dia berkata maksudnya pada hari ini Aku biarkan kamu berada dalam siksaan. Demikianlah para ulama menafsirkan firman tersebut. Abu Isa berkata: Sebagian ahli Ilmu menafsirkan ayat ini \" FAL YAUMA NANSAAHUM (maka pada hari ini (akhirat) kami melupakan mereka) \". (Al A'raaf: 51) mereka berkata: Maknanya adalah pada hari ini Kami biarkan mereka berada dalam siksaan."
            },
            {
                "number": 2345,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنَا يَحْيَى بْنُ أَبِي سُلَيْمَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا }قَالَ أَتَدْرُونَ مَا أَخْبَارُهَا قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّ أَخْبَارَهَا أَنْ تَشْهَدَ عَلَى كُلِّ عَبْدٍ أَوْ أَمَةٍ بِمَا عَمِلَ عَلَى ظَهْرِهَا أَنْ تَقُولَ عَمِلَ كَذَا وَكَذَا يَوْمَ كَذَا وَكَذَا قَالَ فَهَذِهِ أَخْبَارُهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Sa'id bin Abu Ayyub] telah menceritakan kepada kami [Yahya bin Abu Sulaiman] dari [Sa'id Al Maqbari] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alahi wa Salam membaca: \"Pada hari itu bumi menceritakan beritanya.\" (Al-Zalzalah: 4), belia bertanya: \"Tahukah kalian apa berita-beritanya?\" mereka menjawab: Allah dan rasulNya lebih tahu. Beliau bersabda: \"Berita-beritanya adalah perbuatan-perbuatan yang dilakukan oleh hamba lelaki atau perempuan di atas bumi berkata: Ia melakukan ini dan ini, pada hari ini dan ini.\" beliau bersabda: \"Itulah berita-beritanya.\" Berkata Abu Isa: Hadits ini hasan gharib."
            },
            {
                "number": 2346,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَسْلَمَ الْعِجْلِيِّ عَنْ بِشْرِ بْنِ شَغَافٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَجَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا الصُّورُ قَالَ قَرْنٌ يُنْفَخُ فِيهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ سُلَيْمَانَ التَّيْمِيِّ وَلَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِهِ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami ['Abdulah bin Al Mubarak] telah mengkhabarkan kepada kami [Sulaiman At Taimi] dari [Aslam Al 'Ijli] dari [Bisyr bin Syaghaf] dar [Abdullah bin 'Amru bin Al 'Ash] berkata: Seorang badui mendatangi nabi Shallallahu 'alaihi wa Salam, ia berkata: Apa itu sangkakala? Beliau menjawab: \"Tanduk yang ditiup.\" Berkata Abu Isa: Hadits ini hasan dan beberapa perawi meriwayatkan dari Sulaiman At Taimi, kami hanya mengetahuinya dari hadits Sulaiman."
            },
            {
                "number": 2347,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا أَبُو الْعَلَاءِ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ أَنْعَمُ وَصَاحِبُ الْقَرْنِ قَدْ الْتَقَمَ الْقَرْنَ وَاسْتَمَعَ الْإِذْنَ مَتَى يُؤْمَرُ بِالنَّفْخِ فَيَنْفُخُ فَكَأَنَّ ذَلِكَ ثَقُلَ عَلَى أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُمْ قُولُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ عَلَى اللَّهِ تَوَكَّلْنَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ هَذَا الْحَدِيثُ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengkhabarkan kepada kami [Abdullah] telah mengkhabarkan kepada kami [Abu Al 'Alla`] dari ['Athiyah] dari [Abu Sa'id] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Bagaimana aku bersenang-senang sementara malaikat peniup sangkakala telah menelan tanduk (terompet) dan mendengar izin kapankan diperintahkan untuk meniup lalu ia akan meniup.\" Sepertinya hal itu terasa berat oleh para sahabat nabi Shallallahu 'alaihi wa Salam lalu beliau bersabda kepada mereka: \"Ucapkan: HASBUNALLAAH WA NI'MAL WAKILL 'ALALLAAHI TAWAKKALNAA.\" Berkata Abu Isa: Hadits ini hasan dan hadits ini diriwayatkan melalui beberapa sanad dari 'Athiyah dari Abu Sa'id Al Khudri dari nabi Shallallahu 'alaihi wa Salam sepertinya."
            },
            {
                "number": 2348,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِعَارُ الْمُؤْمِنِ عَلَى الصِّرَاطِ رَبِّ سَلِّمْ سَلِّمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ الْمُغِيرَةِ بْنِ شُعْبَةَ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami ['Ali bin Hujr] telah menceritakan kepada kami ['Ali bin Mushir] dari [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'ad] dari [Al Mughirah bin Syu'bah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Syi'arnya orang mukmin pada saat di atas shirath (jembatan penyeberangan) adalah: Wahai Rabb selamatkanlah, selamatkanlah.\" Abu Isa berkata: Hadits ini gharib dari hadits Al Mughirah bin Syu'bah, kami tidak mengetahuinya kecuali dari hadits Abdurrahman bin Ishaq, dan dalam bab ini ada hadits dari Abu Hurairah."
            },
            {
                "number": 2349,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ حَدَّثَنَا حَرْبُ بْنُ مَيْمُونٍ الْأَنْصَارِيُّ أَبُو الْخَطَّابِ حَدَّثَنَا النَّضْرُ بْنُ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَشْفَعَ لِي يَوْمَ الْقِيَامَةِ فَقَالَ أَنَا فَاعِلٌ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ فَأَيْنَ أَطْلُبُكَ قَالَ اطْلُبْنِي أَوَّلَ مَا تَطْلُبُنِي عَلَى الصِّرَاطِ قَالَ قُلْتُ فَإِنْ لَمْ أَلْقَكَ عَلَى الصِّرَاطِ قَالَ فَاطْلُبْنِي عِنْدَ الْمِيزَانِ قُلْتُ فَإِنْ لَمْ أَلْقَكَ عِنْدَ الْمِيزَانِ قَالَ فَاطْلُبْنِي عِنْدَ الْحَوْضِ فَإِنِّي لَا أُخْطِئُ هَذِهِ الثَّلَاثَ الْمَوَاطِنَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ash Shabbah Al Hasyimi] telah menceritakan kepada kami [Badal bin Al Muhabbir] telah menceritakan kepada kami [Harb bin Maimun Al Anshari Abu Al Khaththab] telah menceritakan kepada kami [An Nadlr bin Anas bin Malik] dari [ayahnya] berkata: Aku meminta nabi Shallallahu 'alaihi wa Salam agar memberiku syafaat pada hari kiamat, beliau bersabda: \"Aku akan melakukannya.\" Ia bertanya: Wahai Rasulullah, ke mana aku mencari baginda? Beliau menjawab: \"Carilah aku pada saat pertama kali kau mencari di atas shirath.\" Ia bertanya: Bila aku tidak bertemu dengan baginda di atas shirath? Beliau menjawab: \"Carilah aku di dekat mizan.\" Ia bertanya: Bila aku tidak bertemu dengan baginda di dekat mizan? Beliau menjawab: \"Carilah aku di dekat telaga, karena aku tidak luput dari tiga tempat itu.\" Berkata Abu Isa: Hadits ini hasan gharib, kami hanya mengetahuinya melalui jalur sanad ini."
            },
            {
                "number": 2350,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا أَبُو حَيَّانَ التَّيْمِيُّ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَحْمٍ فَرُفِعَ إِلَيْهِ الذِّرَاعُ فَأَكَلَهُ وَكَانَتْ تُعْجِبُهُ فَنَهَسَ مِنْهَا نَهْسَةً ثُمَّ قَالَ أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ هَلْ تَدْرُونَ لِمَ ذَاكَ يَجْمَعُ اللَّهُ النَّاسَ الْأَوَّلِينَ وَالْآخِرِينَ فِي صَعِيدٍ وَاحِدٍ فَيُسْمِعُهُمْ الدَّاعِي وَيَنْفُذُهُمْ الْبَصَرُ وَتَدْنُو الشَّمْسُ مِنْهُمْ فَبَلَغَ النَّاسُ مِنْ الْغَمِّ وَالْكَرْبِ مَا لَا يُطِيقُونَ وَلَا يَحْتَمِلُونَ فَيَقُولُ النَّاسُ بَعْضُهُمْ لِبَعْضٍ أَلَا تَرَوْنَ مَا قَدْ بَلَغَكُمْ أَلَا تَنْظُرُونَ مَنْ يَشْفَعُ لَكُمْ إِلَى رَبِّكُمْ فَيَقُولُ النَّاسُ بَعْضُهُمْ لِبَعْضٍ عَلَيْكُمْ بِآدَمَ فَيَأْتُونَ آدَمَ فَيَقُولُونَ أَنْتَ أَبُو الْبَشَرِ خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ وَأَمَرَ الْمَلَائِكَةَ فَسَجَدُوا لَكَ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ أَلَا تَرَى مَا قَدْ بَلَغَنَا فَيَقُولُ لَهُمْ آدَمُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنَّهُ قَدْ نَهَانِي عَنْ الشَّجَرَةِ فَعَصَيْتُ نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى نُوحٍ فَيَأْتُونَ نُوحًا فَيَقُولُونَ يَا نُوحُ أَنْتَ أَوَّلُ الرُّسُلِ إِلَى أَهْلِ الْأَرْضِ وَقَدْ سَمَّاكَ اللَّهُ عَبْدًا شَكُورًا اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى إِلَى مَا نَحْنُ فِيهِ أَلَا تَرَى مَا قَدْ بَلَغَنَا فَيَقُولُ لَهُمْ نُوحٌ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنَّهُ قَدْ كَانَ لِي دَعْوَةٌ دَعَوْتُهَا عَلَى قَوْمِي نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى إِبْرَاهِيمَ فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُونَ يَا إِبْرَاهِيمُ أَنْتَ نَبِيُّ اللَّهِ وَخَلِيلُهُ مِنْ أَهْلِ الْأَرْضِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنِّي قَدْ كَذَبْتُ ثَلَاثَ كَذِبَاتٍ فَذَكَرَهُنَّ أَبُو حَيَّانَ فِي الْحَدِيثِ نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى مُوسَى فَيَأْتُونَ مُوسَى فَيَقُولُونَ يَا مُوسَى أَنْتَ رَسُولُ اللَّهِ فَضَّلَكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلَامِهِ عَلَى الْبَشَرِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنِّي قَدْ قَتَلْتُ نَفْسًا لَمْ أُومَرْ بِقَتْلِهَا نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى عِيسَى فَيَأْتُونَ عِيسَى فَيَقُولُونَ يَا عِيسَى أَنْتَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ وَكَلَّمْتَ النَّاسَ فِي الْمَهْدِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ عِيسَى إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَلَمْ يَذْكُرْ ذَنْبًا نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى مُحَمَّدٍ قَالَ فَيَأْتُونَ مُحَمَّدًا فَيَقُولُونَ يَا مُحَمَّدُ أَنْتَ رَسُولُ اللَّهِ وَخَاتَمُ الْأَنْبِيَاءِ وَقَدْ غُفِرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ فَأَنْطَلِقُ فَآتِي تَحْتَ الْعَرْشِ فَأَخِرُّ سَاجِدًا لِرَبِّي ثُمَّ يَفْتَحُ اللَّهُ عَلَيَّ مِنْ مَحَامِدِهِ وَحُسْنِ الثَّنَاءِ عَلَيْهِ شَيْئًا لَمْ يَفْتَحْهُ عَلَى أَحَدٍ قَبْلِي ثُمَّ يُقَالَ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ سَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَرْفَعُ رَأْسِي فَأَقُولُ يَا رَبِّ أُمَّتِي يَا رَبِّ أُمَّتِي يَا رَبِّ أُمَّتِي فَيَقُولُ يَا مُحَمَّدُ أَدْخِلْ مِنْ أُمَّتِكَ مَنْ لَا حِسَابَ عَلَيْهِ مِنْ الْبَابِ الْأَيْمَنِ مِنْ أَبْوَابِ الْجَنَّةِ وَهُمْ شُرَكَاءُ النَّاسِ فِيمَا سِوَى ذَلِكَ مِنْ الْأَبْوَابِ ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ مَا بَيْنَ الْمِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ كَمَا بَيْنَ مَكَّةَ وَهَجَرَ وَكَمَا بَيْنَ مَكَّةَ وَبُصْرَىوَفِي الْبَاب عَنْ أَبِي بَكْرٍ الصِّدِّيقِ وَأَنَسٍ وَعُقْبَةَ بْنِ عَامِرٍ وَأَبِي سَعِيدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو حَيَّانَ التَّيْمِيُّ اسْمُهُ يَحْيَى بْنُ سَعِيدِ بْنِ حَيَّانَ كُوفِيٌّ وَهُوَ ثِقَةٌ وَأَبُو زُرْعَةَ بْنُ عَمْرِو بْنِ جَرِيرٍ اسْمُهُ هَرِمٌ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Abu Hayyan At Taimi] dari [Abu Zur'ah bin 'Amru bin Jarir] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alahi wa Salam diberi daging lalu lengan diangkat pada belia, beliau memakannya dan lengan itu membuat beliau senang, beliau lalu menggigitnya, setelah itu beliau bersabda: \"Aku pemimpin manusia pada hari kiamat, tahukah kalian kenapa? Allah mengumpulkan semua manusia dari yang pertama hingga yang akhir dalam satu tanah lapang, penyeru memperdengarkan mereka, pandangan menembus mereka dan matahari mendekat, duka dan kesusahan manusia sampai pada batas yang tidak mereka mampu dan tidak mampu mereka pikul. Orang-orang saling berkata satu sama lain: Apa kalian tidak melihat yang telah menimpa kalian, apakah kalian tidak melihat siapa yang memberi kalian syafaat kepada Rabb kalian. Orang-orang saling berkata satu sama lain: Hendaklah kalian menemui Adam. Mereka menemui Adam lalu berkata: Engkau adalah nenek moyang manusia, Allah menciptakanmu dengan tanganNya, meniupkan ruhnya padamu dan memerintahkan para malaikat lalu mereka sujud padamu, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Adam berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu Ia melarangku mendekati pohon tapi aku durhaka, diriku, diriku, diriku. Pergilah pada selainku, pergilah ke Nuh. Mereka mendatangi Nuh lalu berkata: Hai Nuh, engkau adalah rasul pertama untuk penduduk bumi, Allah menyebutmu hamba yang sangat bersyukur, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Nuh berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah berdo'a keburukan untuk kaumku, diriku, diriku, diriku, pergilah kepada selainku, pergilah ke Ibrahim. Mereka mendatangi Ibrahim lalu berkata: Wahai Ibrahim, engkau nabi Allah dan kekasihNya dari penduduk bumi, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Nuh berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah bedusta tiga kali -Abu Hayyan menyebut ketiga-tiganya dalam hadits ini- diriku, diriku, diriku, pergilah kepada selainku, pergilah ke Musa. Mereka menemui Musa lalu berkata: Wahai Musa, engkau utusan Allah, Allah melebihkanmu dengan risalah dan kalamNya atas seluruh manusia, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Musa berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah membunuh jiwa padahal aku tidak diperintahkan untuk membunuhnya, diriku, diriku, diriku, pergilah kepada selainku, pergilah ke 'Isa. Mereka mendatangi 'Isa lalu berkata: Hai 'Isa, engkau adalah utusan Allah, kalimatNya yang disampaikan ke maryam, ruh dariNya, engkau berbicara pada manusia saat masih berada dalam buaian, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Isa berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, ia tidak menyebut dosa, diriku, diriku, diriku, pergilah ke selainku, pergilah ke Muhammad. Mereka mendatangi Muhammad lalu berkata: Wahai Muhammad, engkau adalah utusan Allah, penutup para nabi, dosamu yang telah lau dan yang kemudian telah diampuni, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami. Lalu aku pergi hingga sampai di bawah 'arsy, aku tersungkur sujud pada Rabbku lalu Allah memulai dengan pujian dan sanjungan untukku yang belum pernah disampaikan pada seorang pun sebelumku, lalu ada suara: Hai Muhammad, angkatlah kepalamu, mintalah pasti kau diberi, berilah syafaat nicaya kau diizinkan untuk memberi syafaat. Lalu aku mengangkat kepalaku, aku berkata: Wahai Rabb, ummatku, wahai Rabb, ummatku, wahai Rabb, ummatku. Ia berkata: Hai Muhammad, masukkan orang yang tidak dihisab dari ummatmu melalui pintu-pintu surga sebelah kanan dan mereka adalah sekutu semua manusia selain pintu-pintu itu.\" Setelah itu beliau bersabda: \"Demi Dzat yang jiwaku berada ditanganNya, jarak antara dua daun pintu-pintu surga seperti jarak antara Makakah dan Hajar dan seperti jarak antara Makkah dan Bashrah.\" Dalam hal ini ada hadits serupa dari Abu Bakar Ash Shiddiq, Anas, 'Uqbah bin 'Amir, Abu Sa'id. Berkata Abu Isa: Hadits ini hasan shahih dan nama Abu Hayyan At Taimi adalah Yahya bin Sa'id bin Hayyan, orang kufi, terpercaya, dan nama Abu Zur'ah bin 'Amru bin Jarir adalah Harim."
            },
            {
                "number": 2351,
                "arab": "حَدَّثَنَا الْعَبَّاسُ الْعَنْبَرِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَفَاعَتِي لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَفِي الْبَاب عَنْ جَابِرٍ",
                "id": "Telah menceritakan kepada kami [Al 'Abbas Al 'Ambari] telah menceritakan kepada kami ['Abdur Razzaq] dari [Ma'mar] dari [Tsabit] dari [Anas] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Syafaatku untuk pemilik dosa-dosa besar dari ummatku.\" Berkata Abu Isa: Hadits ini hasan shahih gharib melalui sanad ini dan dalam hal ini ada hadits serupa dari Jabir."
            },
            {
                "number": 2352,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ مُحَمَّدِ بْنِ ثَابِتٍ الْبُنَانِيِّ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَفَاعَتِي لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِيقَالَ مُحَمَّدُ بْنُ عَلِيٍّ فَقَالَ لِي جَابِرٌ يَا مُحَمَّدُ مَنْ لَمْ يَكُنْ مِنْ أَهْلِ الْكَبَائِرِ فَمَا لَهُ وَلِلشَّفَاعَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ يُسْتَغْرَبُ مِنْ حَدِيثِ جَعْفَرِ بْنِ مُحَمَّدٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Daud Ath Thayalisi] dari [Muhammad bin Tsabit Al Bunani] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin Abdullah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Syafa'atku untuk ummatku yang berbuat dosa dosa besar.\" Muhammad bin Ali berkata: kemudian Jabir berkata kepadaku: Wahai Muhammad orang yang tidak melakukan dosa besar tidak lagi membutuhkan syafa'at. Abu Isa berkata: Hadits ini hasan gharib dari jalur sanad ini, dan dianggap gharib dari hadits Ja'far bin Muhammad."
            },
            {
                "number": 2353,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ الْأَلْهَانِيِّ قَال سَمِعْتُ أَبَا أُمَامَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَعَدَنِي رَبِّي أَنْ يُدْخِلَ الْجَنَّةَ مِنْ أُمَّتِي سَبْعِينَ أَلْفًا لَا حِسَابَ عَلَيْهِمْ وَلَا عَذَابَ مَعَ كُلِّ أَلْفٍ سَبْعُونَ أَلْفًا وَثَلَاثُ حَثَيَاتٍ مِنْ حَثَيَاتِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin 'Arafah] telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Muhammad bin Ziyad Al Alhani] berkata: Aku mendengar [Abu Umamah] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Rabbku berjanji padaku untuk memasukkan tujuhpuluh ribu orang dari ummatku tanpa hisab dan adzab, setiap seribunya bersama tujuhpuluh ribu dan tiga tangkup (mengambil dengan dua telapak tangan) dari tangkupan (tangan) Nya.\" Berkata Abu Isa: Hadits ini hasan gharib."
            },
            {
                "number": 2354,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَكُنْتُ مَعَ رَهْطٍ بِإِيلِيَاءَ فَقَالَ رَجُلٌ مِنْهُمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَدْخُلُ الْجَنَّةَ بِشَفَاعَةِ رَجُلٍ مِنْ أُمَّتِي أَكْثَرُ مِنْ بَنِي تَمِيمٍ قِيلَ يَا رَسُولَ اللَّهِ سِوَاكَ قَالَ سِوَايَ فَلَمَّا قَامَ قُلْتُ مَنْ هَذَا قَالُوا هَذَا ابْنُ أَبِي الْجَذْعَاءِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَابْنُ أَبِي الْجَذْعَاءِ هُوَ عَبْدُ اللَّهِ وَإِنَّمَا يُعْرَفُ لَهُ هَذَا الْحَدِيثُ الْوَاحِدُ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Khalid Al Hadzdza`] dari [Abdullah bin Syaqiq] berkata: Aku pernah bersama serombongan orang di Iliya`, seseorang dari mereka berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Akan masuk surga karena syafaat seseorang dari ummatku lebih banyak dari Bani Tamim.\" Dikatakan: Wahai Rasulullah, selain baginda? Beliau menjawab: \"Selain aku.\" Saat ia berdiri, aku bertanya: Siapa dia? Mereka menjawab: Dia [Ibnu Abi Al Jadz 'Abdullah']. Berkata Abu Isa: Hadits ini hasan shahih gharib dan Ibnu Abi Al Jadz'a` adalah Abdullah, hanya satu hadits ini saja yang dikenal miliknya."
            },
            {
                "number": 2355,
                "arab": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ الْكُوفِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ عَنْ جِسْرٍ أَبِي جَعْفَرٍ عَنْ الْحَسَنِ الْبَصْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْفَعُ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ يَوْمَ الْقِيَامَةِ بِمِثْلِ رَبِيعَةَ وَمُضَرَ",
                "id": "Telah menceritakan kepada kami [Abu Hisyam Ar Rifa'I Al Kufi] berkata: telah menceritakan kepada kami [Yahya bin Al Yaman] dari [Jisr Abu Ja'far] dari [Al Hasan Al Bashri] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"'Utsman bin 'Affan radliallahu 'anhu pada hari Kiamat memberikan syafa'at untuk seperti kabilah Rabi'ah dan Mudlar.\""
            },
            {
                "number": 2356,
                "arab": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ أُمَّتِي مَنْ يَشْفَعُ لِلْفِئَامِ مِنْ النَّاسِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْقَبِيلَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْعَصَبَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلرَّجُلِ حَتَّى يَدْخُلُوا الْجَنَّةَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Abu 'Ammar Al Husain bin Huraits] telah mengkhabarkan kepada kami [Al Fadll bin Musa] dari [Zakariya bin Abu Za`idah] dari ['Athiyah] dari [Abu Sa'id] Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Sesungguhnya diantara ummatku ada yang memberi syafaat kepada sekelompok orang, ada yang memberi syafaat untuk sekabilah, ada yang memberi syafaat untuk segolongan dan ada yang memberi syafaat untuk seseorang hingga mereka masuk surga.\" Berkata Abu Isa: Hadits ini hasan. "
            },
            {
                "number": 2357,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَانِي آتٍ مِنْ عِنْدِ رَبِّي فَخَيَّرَنِي بَيْنَ أَنْ يُدْخِلَ نِصْفَ أُمَّتِي الْجَنَّةَ وَبَيْنَ الشَّفَاعَةِ فَاخْتَرْتُ الشَّفَاعَةَ وَهِيَ لِمَنْ مَاتَ لَا يُشْرِكُ بِاللَّهِ شَيْئًاوَقَدْ رُوِيَ عَنْ أَبِي الْمَلِيحِ عَنْ رَجُلٍ آخَرَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ عَنْ عَوْفِ بْنِ مَالِكٍ وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ عَوْفِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami ['Abdah] dari [Sa'id] dari [Qatadah] dari [Abu Al Malih] dari ['Auf bin Malik Al Asyja'i] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Ada yang mendatangiku dari Rabbku lalu memberiku pilihan antara separuh dari ummatku masuk surga atau syafaat lalu aku memilih syafaat, syafaat tersebut untuk orang yang meninggal tanpa menyekutukan Allah dengan apa pun.\" Diriwayatkan dari Abu Al Malih dari seorang sahabat nabi Shallallahu 'alaihi wa Salam lain dari nabi Shallallahu 'alaihi wa Salam, ia tidak menyebutkan: Dari 'Auf bin Malik. Dan dalam hadits ini ada kisah panjang. Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qaadah] dari [Abu Al Malih] dari ['Auf bin Malik] dari nabi Shallallahu 'alaihi wa Salam sepertinya."
            },
            {
                "number": 2358,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا بِشْرُ بْنُ شُعَيْبِ بْنِ أَبِي حَمْزَةَ حَدَّثَنِي أَبِي عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي حَوْضِي مِنْ الْأَبَارِيقِ بِعَدَدِ نُجُومِ السَّمَاءِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Bisyr bin Syu'aib bin Abu Hamzah] telah menceritakan kepadaku [ayahku] dari [Az Zuhri] dari [Anas bin Malik], Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Sesungguhnya gelas-gelas di telagaku sejumlah bintang-bintang di langit.\" Berkata Abu Isa: Hadits ini hasan shahih gharib dari jalur sanad ini."
            },
            {
                "number": 2359,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ نِيْزَكَ الْبَغْدَادِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ الدِّمَشْقِيُّ حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِكُلِّ نَبِيٍّ حَوْضًا وَإِنَّهُمْ يَتَبَاهَوْنَ أَيُّهُمْ أَكْثَرُ وَارِدَةً وَإِنِّي أَرْجُو أَنْ أَكُونَ أَكْثَرَهُمْ وَارِدَةًقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ رَوَى الْأَشْعَثُ بْنُ عَبْدِ الْمَلِكِ هَذَا الْحَدِيثَ عَنْ الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَلَمْ يَذْكُرْ فِيهِ عَنْ سَمُرَةَ وَهُوَ أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Nizak Al Baghdadi] telah menceritakan kepada kami [Muhammad bin Bakkar Ad Dimasyqi] telah menceritakan kepada kami [Sa'id bin Basyir] dari [Qatadah] dari [Al Hasan] dari [Samrah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya tiap tiap nabi itu memiliki telaga, dan sesungguhnya mereka saling membangga-banggakan telaga siapakah di antara mereka yang paling banyak pengunjungnya, dan sesungguhnya aku berharap menjadi orang yang paling banyak pengunjungnya.\" Abu Isa berkata: Hadits ini gharib, [Al Asy'ats bin Abdul Malik] telah meriwayatkan hadits ini dari [Al Hasan] dari Nabi Shallallahu 'alaihi wa Salam secara mursal dan di dalamnya tidak menyebutkan: Dari Samuroh dan inilah yang lebih shahih.\""
            },
            {
                "number": 2360,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ عَنْ الْعَبَّاسِ عَنْ أَبِي سَلَّامٍ الْحَبَشِيِّ قَالَبَعَثَ إِلَيَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَحُمِلْتُ عَلَى الْبَرِيدِ قَالَ فَلَمَّا دَخَلَ عَلَيْهِ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ لَقَدْ شَقَّ عَلَى مَرْكَبِي الْبَرِيدُ فَقَالَ يَا أَبَا سَلَّامٍ مَا أَرَدْتُ أَنْ أَشُقَّ عَلَيْكَ وَلَكِنْ بَلَغَنِي عَنْكَ حَدِيثٌ تُحَدِّثُهُ عَنْ ثَوْبَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَوْضِ فَأَحْبَبْتُ أَنْ تُشَافِهَنِي بِهِ قَالَ أَبُو سَلَّامٍ حَدَّثَنِي ثَوْبَانُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَوْضِي مِنْ عَدَنَ إِلَى عَمَّانَ الْبَلْقَاءِ مَاؤُهُ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِ وَأَكَاوِيبُهُ عَدَدُ نُجُومِ السَّمَاءِ مَنْ شَرِبَ مِنْهُ شَرْبَةً لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا أَوَّلُ النَّاسِ وُرُودًا عَلَيْهِ فُقَرَاءُ الْمُهَاجِرِينَ الشُّعْثُ رُءُوسًا الدُّنْسُ ثِيَابًا الَّذِينَ لَا يَنْكِحُونَ الْمُتَنَعِّمَاتِ وَلَا تُفْتَحُ لَهُمْ السُّدَدُقَالَ عُمَرُ لَكِنِّي نَكَحْتُ الْمُتَنَعِّمَاتِ وَفُتِحَ لِيَ السُّدَدُ وَنَكَحْتُ فَاطِمَةَ بِنْتَ عَبْدِ الْمَلِكِ لَا جَرَمَ أَنِّي لَا أَغْسِلُ رَأْسِي حَتَّى يَشْعَثَ وَلَا أَغْسِلُ ثَوْبِي الَّذِي يَلِي جَسَدِي حَتَّى يَتَّسِخَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ ثَوْبَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو سَلَّامٍ الْحَبَشِيُّ اسْمُهُ مَمْطُورٌ وَهُوَ شَامِيٌّ ثِقَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Yahya bin Shalih] telah menceritakan kepada kami [Muhammad bin Al Muhajir] dari [Al 'Abbas] dari [Abu Sallam Al Habasyi] berkata: Umar bin Abdul Aziz mengutusku untuk menjadi tukang antar surat, Abu sallam berkata: Ketika masuk dia berkata: Wahai Amirul mukminin kendaraanku telah keberatan untuk dijadikan transportsi surat menyurat. lalu Umar bin Abdul aziz berkata: Wahai Abu Sallam, aku tidak ingin memberatkanmu akan tetapi karena telah sampai kepadaku hadits yang diriwayatkan olehmu yang kamu ceritakan dari [Tsauban] dari Nabi Shallallahu 'alaihi wa Salam dalam masalah telaga, maka aku ingin bertatap muka denganmu dalam masalah ini, Abu Sallam berkata: Tsauban telah menceritakan kepadaku dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Luasnya telagaku adalah seluas antara Aden sampai Oman Al Balqa', airnya lebih putih dari air susu, lebih manis dari madu dan cangkir-cangkirnya sebanyak bilangan bintang di langit, barangsiapa yang minum satu tegukan air darinya niscaya setelah itu tidak akan merasa haus selamanya, orang yang pertama kali akan mengunjunginya adalah orang orang fakir dari sahabat muhajirin, yang rambut kepalanya acak acakan, pakaiannya kumal dan mereka mereka yang tidak menikahi wanita wanita yang hidup dalam kemewahan, dan orang yang tidak dibukakan pintu (apabila bertamu atau mengetuk pintu rumah orang).\" Umar berkata: Akan tetapi aku telah menikahi seorang wanita yang hidup dalam kemewahan, pintu-pintu rumah juga dibukakan bagiku, dan aku telah menikahi Fathimah binti 'Abdul Malik, tidak ada salahnya aku tidak membasuh kepalaku hingga menjadi acak acakan, aku tidak mencuci pakaian yang ada di tubuhku sampai menjadi kumal.\" Abu Isa berkata: Hadits ini gharib dari jalur sanad ini, hadits ini telah diriwayatkan dari [Ma'dan bin Abu Thalhah] dari [Tsauban] dari Nabi Shallallahu 'alaihi wa Salam, adapun Abu sallam Al Habasyi namanya adalah Mamthur dan dia adalah orang Syam yang tsiqah.\""
            },
            {
                "number": 2361,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ الْعَمِّيُّ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَا آنِيَةُ الْحَوْضِ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ نُجُومِ السَّمَاءِ وَكَوَاكِبِهَا فِي لَيْلَةٍ مُظْلِمَةٍ مُصْحِيَةٍ مِنْ آنِيَةِ الْجَنَّةِ مَنْ شَرِبَ مِنْهَا شَرْبَةً لَمْ يَظْمَأْ آخِرَ مَا عَلَيْهِ عَرْضُهُ مِثْلُ طُولِهِ مَا بَيْنَ عُمَانَ إِلَى أَيْلَةَ مَاؤُهُ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَفِي الْبَاب عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي بَرْزَةَ الْأَسْلَمِيِّ وَابْنِ عُمَرَ وَحَارِثَةَ بْنِ وَهْبٍ وَالْمُسْتَوْرِدِ بْنِ شَدَّادٍ وَرُوِي عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَوْضِي كَمَا بَيْنَ الْكُوفَةِ إِلَى الْحَجَرِ الْأَسْوَدِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu 'Abdush Shamad Al 'Ammi Abdul Aziz bin 'Abdush Shamad] telah menceritakan kepada kami [Abu 'Imran Al Juwaini] dari [Abdullah bin Ash Shamit] dari [Abu Dzarr] berkata: Aku bertanya: Wahai Rasulullah, telaga itu bejananya apa? Beliau menjawab: Demi Dzat yang jiwaku berada di tanganNya, sungguh bejana-bejananya lebih banyak melebihi bilangan bintang-bintang langit pada malam gelap yang tidak ada mendung dan awan, bejana itu kesemuanya dari bejana-bejana surga, barangsiapa meminum satu tegukan darinya, ia tidak akan dahaga hingga tanggungan terakhirnya, lausnya seluas antara Omman hingga Aila, airnya lebih putih dari susu, lebih manis dari madu.\" Berkata Abu Isa: Hadits ini hasan shahih gharib. Dalam hal ini ada hadits serupa dari Hudzaifah bin Al Yaman, Abdullah bin 'AMru, abu Barzah Al Aslami, Ibnu Umar, Haritsah bin Wahab, Al Mustaurid bin Syadad. Dan diriwayatkan dari Ibnu Umar dari nabi Shallallahu 'alaihi wa Salam bersabda: Telagaku sepanjang antara Kufah hingga hajar aswad."
            },
            {
                "number": 2362,
                "arab": "حَدَّثَنَا أَبُو حَصِينٍ عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ يُونُسَ كُوفِيٌّ حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ حَدَّثَنَا حُصَيْنٌ هُوَ ابْنُ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا أُسْرِيَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ يَمُرُّ بِالنَّبِيِّ وَالنَّبِيَّيْنِ وَمَعَهُمْ الْقَوْمُ وَالنَّبِيِّ وَالنَّبِيَّيْنِ وَمَعَهُمْ الرَّهْطُ وَالنَّبِيِّ وَالنَّبِيَّيْنِ وَلَيْسَ مَعَهُمْ أَحَدٌ حَتَّى مَرَّ بِسَوَادٍ عَظِيمٍ فَقُلْتُ مَنْ هَذَا قِيلَ مُوسَى وَقَوْمُهُ وَلَكَنِ ارْفَعْ رَأْسَكَ فَانْظُرْ قَالَ فَإِذَا سَوَادٌ عَظِيمٌ قَدْ سَدَّ الْأُفُقَ مِنْ ذَا الْجَانِبِ وَمِنْ ذَا الْجَانِبِ فَقِيلَ هَؤُلَاءِ أُمَّتُكَ وَسِوَى هَؤُلَاءِ مِنْ أُمَّتِكَ سَبْعُونَ أَلْفًا يَدْخُلُونَ الْجَنَّةَ بِغَيْرِ حِسَابٍ فَدَخَلَ وَلَمْ يَسْأَلُوهُ وَلَمْ يُفَسِّرْ لَهُمْ فَقَالُوا نَحْنُ هُمْ وَقَالَ قَائِلُونَ هُمْ أَبْنَاؤُنَا الَّذِينَ وُلِدُوا عَلَى الْفِطْرَةِ وَالْإِسْلَامِ فَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُمْ الَّذِينَ لَا يَكْتَوُونَ وَلَا يَسْتَرْقُونَ وَلَا يَتَطَيَّرُونَ وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ فَقَامَ عُكَّاشَةُ بْنُ مِحْصَنٍ فَقَالَ أَنَا مِنْهُمْ يَا رَسُولَ اللَّهِ قَالَ نَعَمْ ثُمَّ قَامَ آخَرُ فَقَالَ أَنَا مِنْهُمْ فَقَالَ سَبَقَكَ بِهَا عُكَّاشَةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Abu Hashin Abdullah bin Ahmad bin Yunus Kufi] telah menceritakan kepada kami ['Abtsar bin Al Qasim] telah menceritakan kepada kami [Hushain bin Abdurrahman] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] berkata: Saat nabi Shallallahu 'alaihi wa Salam isra`, ia melintasi satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam bersama kaum mereka, satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam bersama beberapa orang, satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam tidak bersama seorang pun hingga beliau melewati sekumpulan besar manusia, aku bertanya: Siapa dia? Dijawab: Musa dan kaumnya, tapi angkatlah kepalamu lau lihatlah. Ternyata sekelompok besar manusia menutupi ufuk dari sisi ini dan sisi ini. dikatakan: Mereka adalah ummatmu dan diantara ummatmu itu ada tujuhpuluh ribu yang masuk surga tanpa hisab. Beliau masuk lalu para sahabat tidak bertanya kepada beliau dan beliau tidak memberi penjelasan pada mereka, lalu mereka bertanya: Kamikah mereka itu? Ada yang menjawab: Mereka adalah anak-anak kami yang meninggal dunia diatas fitrah dan Islam. Lalu nabi Shallallahu 'alaihi wa Salam keluar dan bersabda: \"Mereka adalah orang-orang yang tidak mengecos (berobat dengan sundutan api), tidak meminta diruqyah, tidak berfirasat buruk karena kedatangan hewan dan mereka bertawakal kepada Rabb mereka.\" 'Ukkasyah bin Mihshan berdiri lalu bertanya: Saya termasuk dari mereka wahai Rasulullah? beliau menjawab: \"Ya.\" Yang lain berdiri lalu bertanya: Saya termasuk dari mereka? Beliau menjawab: \"Kau sudah didahului 'Ukkasyah.\" Berkata Abu Isa: Hadits ini hasan shahih dan dalam hal ini ada hadits serupa dari Ibnu Mas'ud dan Abu Hurairah."
            },
            {
                "number": 2363,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَمَا أَعْرِفُ شَيْئًا مِمَّا كُنَّا عَلَيْهِ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أَيْنَ الصَّلَاةُ قَالَ أَوَلَمْ تَصْنَعُوا فِي صَلَاتِكُمْ مَا قَدْ عَلِمْتُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَبِي عِمْرَانَ الْجَوْنِيِّ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَنَسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Yazi'] telah menceritakan kepada kami [Ziyad bin Ar Rabi'] telah menceritakan kepada kami [Abu 'Imran Al Jauni] dari [Anas bin Malik] berkata: Aku tidak mengetahui apa pun yang ada pada kami di masa nabi Shallallahu 'alaihi wa Salam. Aku bertanya: Mana sholat? Ia menjawab: Bukankah kalian lakukan dalam sholat kalian yang telah kalian tahu? Berkata Abu Isa: Hadits ini hasan gharib dari jalur sanad ini dari hadits Abu 'Imran AL Juwaini dan diriwayatkan melalui beberapa sanad dari Anas."
            },
            {
                "number": 2364,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْأَزْدِيُّ الْبَصْرِيُّ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا هَاشِمٌ وَهُوَ ابْنُ سَعِيدٍ الْكُوفِيُّ حَدَّثَنِي زَيْدٌ الْخَثْعَمِيُّ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ الْخَثْعَمِيَّةِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِئْسَ الْعَبْدُ عَبْدٌ تَخَيَّلَ وَاخْتَالَ وَنَسِيَ الْكَبِيرَ الْمُتَعَالِ بِئْسَ الْعَبْدُ عَبْدٌ تَجَبَّرَ وَاعْتَدَى وَنَسِيَ الْجَبَّارَ الْأَعْلَى بِئْسَ الْعَبْدُ عَبْدٌ سَهَا وَلَهَا وَنَسِيَ الْمَقَابِرَ وَالْبِلَى بِئْسَ الْعَبْدُ عَبْدٌ عَتَا وَطَغَى وَنَسِيَ الْمُبْتَدَا وَالْمُنْتَهَى بِئْسَ الْعَبْدُ عَبْدٌ يَخْتِلُ الدُّنْيَا بِالدِّينِ بِئْسَ الْعَبْدُ عَبْدٌ يَخْتِلُ الدِّينَ بِالشُّبُهَاتِ بِئْسَ الْعَبْدُ عَبْدٌ طَمَعٌ يَقُودُهُ بِئْسَ الْعَبْدُ عَبْدٌ هَوًى يُضِلُّهُ بِئْسَ الْعَبْدُ عَبْدٌ رَغَبٌ يُذِلُّهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Azdi Al Bashri] telah menceritakan kepada kami ['Abdus Shamad bin 'Abdul Warits] telah menceritakan kepada kami [Hasyim bin Sa'id Al Kufi] telah menceritakan kepada kami [Zaid Al Khats'ami] dari [Asma` binti 'Umais Al Khats'amiyah] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Seburuk buruk hamba adalah hamba yang sombong, berbangga diri dan lupa terhadap Dzat yang maha besar dan maha tinggi, seburuk buruk hamba adalah hamba yang diktator dan kejam dan dia lupa terhadap Dzat yang maha perkasa lagi maha tinggi, seburuk buruk hamba adalah hamba yang lupa dan lalai dan lupa akan kuburan dan ujian, seburuk buruk hamba adalah hamba yang melampaui batas dan berlebih lebihan, lupa terhadap adanya permulaan dan kesudahan, seburuk buruk hamba adalah hamba yang mencari dunia dengan mengorbankan agama, seburuk buruk hamba adalah hamba yang mencari agama dengan hal hal yang syubhat, seburuk buruk hamba adalah hamba yang dikendalikan oleh sifat tamak, seburuk buruk hamba adalah hamba yang dikuasai oleh hawa nafsu yang menyesatkannya dan seburuk buruk hamba adalah hamba yang dikuasai sifat rakus yang menjadikannya hina.\" Abu Isa berkata: Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur sanad ini sedangkan sanadnya tidak kuat.\""
            },
            {
                "number": 2365,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُؤَدِّبُ حَدَّثَنَا عَمَّارُ بْنُ مُحَمَّدٍ ابْنُ أُخْتِ سُفْيَانَ الثَّوْرِيِّ حَدَّثَنَا أَبُو الْجَارُودِ الْأَعْمَى وَاسْمُهُ زِيَادُ بْنُ الْمُنْذِرِ الْهَمْدَانِيُّ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا مُؤْمِنٍ أَطْعَمَ مُؤْمِنًا عَلَى جُوعٍ أَطْعَمَهُ اللَّهُ يَوْمَ الْقِيَامَةِ مِنْ ثِمَارِ الْجَنَّةِ وَأَيُّمَا مُؤْمِنٍ سَقَى مُؤْمِنًا عَلَى ظَمَإٍ سَقَاهُ اللَّهُ يَوْمَ الْقِيَامَةِ مِنْ الرَّحِيقِ الْمَخْتُومِ وَأَيُّمَا مُؤْمِنٍ كَسَا مُؤْمِنًا عَلَى عُرْيٍ كَسَاهُ اللَّهُ مِنْ خُضْرِ الْجَنَّةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ رُوِيَ هَذَا عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ مَوْقُوفًا وَهُوَ أَصَحُّ عِنْدَنَا وَأَشْبَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim Al Mu`addib] telah menceritakan kepada kami ['Ammar bin Muhammad bin ukhti Sufyan Ats Tsauri] telah menceritakan kepada kami [Abu Al Jarud Al A'ma, namanya Ziyad bin Al Mundzir Al Hamdani] dari ['Athiyah Al 'Aufi] dari [Abu Sa'id Al Khudri] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Siapapun orang mu`min yang memberi makan mu`min lain saat lapar, Allah akan memberinya makan dari buah surga, siapapun mu`min yang memberi minum mu`min lain saat dahaga, Allah akan memberinya minum pada hari kiamat dengan minuman yang penghabisannya adalah beraroma wangi kesturi, siapapun mu`min yang memberi pakaian mu`min lain saat telanjang, Allah akan memberi pakaian dari sutera surga.\" Berkata Abu Isa: Hadits ini gharib. Hadits ini diriwayatkan dari 'Athiyah dari Abu Sa'id secara mauquf dan menurut kami itu lebih shahih dan lebih mirip."
            },
            {
                "number": 2366,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو عَقِيلٍ الثَّقَفِيُّ حَدَّثَنَا أَبُو فَرْوَةَ يَزِيدُ بْنُ سِنَانٍ التَّمِيمِيُّ حَدَّثَنِي بُكَيْرُ بْنُ فَيْرُوزَ قَال سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ خَافَ أَدْلَجَ وَمَنْ أَدْلَجَ بَلَغَ الْمَنْزِلَ أَلَا إِنَّ سِلْعَةَ اللَّهِ غَالِيَةٌ أَلَا إِنَّ سِلْعَةَ اللَّهِ الْجَنَّةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَبِي النَّضْرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Nadlar] telah menceritakan kepada kami [Abu An Nadlar] telah menceritakan kepada kami [Abu 'Aqil Ats Tsaqafi] telah menceritakan kepada kami [Abu Farwah Yazid bin Sinan At Tamimi] telah menceritakan kepadaku [Bukair bin Fairuz] berkata: Aku mendengar [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa yang takut maka dia berjalan, dan barangsiapa yang berjalan niscaya dia akan sampai ke tempat tinggal, ketahuilah sesungguhnya barang dagangan Allah itu sangat mahal, ketahuilah sesungguhnya barang dagangan Allah itu adalah surga.\" Abu Isa berkata: Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari hadits Abu An Nadlar."
            },
            {
                "number": 2367,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو عَقِيلٍ الثَّقَفِيُّ عَبْدُ اللَّهِ بْنُ عَقِيلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ وَعَطِيَّةُ بْنُ قَيْسٍ عَنْ عَطِيَّةَ السَّعْدِيِّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبْلُغُ الْعَبْدُ أَنْ يَكُونَ مِنْ الْمُتَّقِينَ حَتَّى يَدَعَ مَا لَا بَأْسَ بِهِ حَذَرًا لِمَا بِهِ الْبَأْسُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu An Nadlar] telah menceritakan kepada kami [Abu An Nadlar] telah menceritakan kepada kami [Abu 'Aqil Ats Tsaqafi Abdullah bin 'Aqil] telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Rabi'ah bin Yazid] dan ['Athiyyah bin Qais] dari ['Athiyyah As Sa'di] dia adalah termasuk sahabat Nabi Shallallahu 'alaihi wa Salam dia berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Seorang hamba tidak akan sampai pada derajat orang orang muttaqin sehingga dia meninggalkan sesuatu yang boleh (mubah) karena berhati-hati dari hal-hal yang dilarang.\" Abu Isa berkata: Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari jalur sanad ini.\""
            },
            {
                "number": 2368,
                "arab": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عِمْرَانٌ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ حَنْظَلَةَ الْأُسَيِّدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّكُمْ تَكُونُونَ كَمَا تَكُونُونَ عِنْدِي لَأَظَلَّتْكُمْ الْمَلَائِكَةُ بِأَجْنِحَتِهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ حَنْظَلَةَ الْأُسَيْدِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami ['Abbas Al 'Anbari] telah menceritakan kepada kami [Abu Dawud] telah menceritakan kepada kami ['Imran Al Qaththan] dari [Qatadah] dari [Yazid bin Abdullah bin Asy Syakhir] dari [Hanzhalah Al Usaidi] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Andai saja kalian seperti saat berada didekatku niscaya para malaikat akan menaungi kalian dengan sayap-sayapnya.\" Berkata Abu Isa: Hadits ini hasan gharib dari jalur sanad ini. Dan hadits ini diriwayatkan melalui sanad lain dari Hanzhalah Al Usaidi dari nabi Shallallahu 'alaihi wa Salam dan dalam hal ini ada hadits serupa dari Abu Hurairah."
            },
            {
                "number": 2369,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ سَلْمَانَ أَبُو عُمَرَ الْبَصْرِيُّ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ ابْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ لِكُلِّ شَيْءٍ شِرَّةً وَلِكُلِّ شِرَّةٍ فَتْرَةً فَإِنْ كَانَ صَاحِبُهَا سَدَّدَ وَقَارَبَ فَارْجُوهُ وَإِنْ أُشِيرَ إِلَيْهِ بِالْأَصَابِعِ فَلَا تَعُدُّوهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ بِحَسْبِ امْرِئٍ مِنْ الشَّرِّ أَنْ يُشَارَ إِلَيْهِ بِالْأَصَابِعِ فِي دِينٍ أَوْ دُنْيَا إِلَّا مَنْ عَصَمَهُ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Yusuf bin Salman Abu 'Amir Al Bahsri] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Ibnu 'Ajlan] dari [Al Qa'qa' bin Hakim] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Sesungguhnya pada setiap sesuatu itu ada saat kesungguhannya dan setiap kesungguhan ada masa melemahnya, jika pelakunya senantiasa bersikap istiqomah dan mendekat, berharaplah dia bisa tetap (semangat), sebaliknya jika ia hanya ingin ditunjuk dengan jari (berbuat karena riya', pent.) maka janganlah orang itu kalian anggap (tidak termasuk orang yang baik, pent.) \". Abu Isa berkata: Hadits ini hasan shahih gharib dari jalur sanad ini, telah diriwayatkan dari Anas bin Malik dari Nabi Shallallahu 'alaihi wa Salam bahwa beliau bersabda: \"Cukuplah keburukan bagi seseorang dengan ditunjuk dengan jari (sekedar mencari perhatian) dalam masalah agama atau dunia kecuali orang yang di jaga oleh Allah.\""
            },
            {
                "number": 2370,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَهْرَمُ ابْنُ آدَمَ وَيَشِبُّ مِنْهُ اثْنَانِ الْحِرْصُ عَلَى الْمَالِ وَالْحِرْصُ عَلَى الْعُمُرِهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Anak cucu Adam tua sementara ada dua darinya yang muda; ketamakan terhadap harta dan ketamakan terhadap usia.\" Hadits ini hasan shahih."
            },
            {
                "number": 2371,
                "arab": "حَدَّثَنَا أَبُو هُرَيْرَةَ مُحَمَّدُ بْنُ فِرَاسٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ حَدَّثَنَا أَبُو الْعَوَّامِ وَهُوَ عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُثِّلَ ابْنُ آدَمَ وَإِلَى جَنْبِهِ تِسْعَةٌ وَتِسْعُونَ مَنِيَّةً إِنْ أَخْطَأَتْهُ الْمَنَايَا وَقَعَ فِي الْهَرَمِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Abu Hubairah Muhammad bin Firas Al Bashri] telah menceritakan kepada kami [Abu Qutaibah Salm bin Qutaibah] telah menceritakan kepada kami [Abu Al 'Awwam 'Imran Al Qaththan] dari [Qatadah] dari [Muththarrif bin Abdullah bin Asy Syakhir] dari [ayahnya] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Anak cucu adam dibentuk dan disampingnya ada sembilanpuluh sembilan kematian, bila kematian-kematian luput darinya, pada akhirnya ia jatuh pada masa tua juga.\" Berkata Abu Isa: Hadits ini hasan shahih gharib."
            },
            {
                "number": 2372,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا قَبِيصَةُ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الطُّفَيْلِ بْنِ أُبَيِّ بْنِ كَعْبٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ذَهَبَ ثُلُثَا اللَّيْلِ قَامَ فَقَالَ يَا أَيُّهَا النَّاسُ اذْكُرُوا اللَّهَ اذْكُرُوا اللَّهَ جَاءَتْ الرَّاجِفَةُ تَتْبَعُهَا الرَّادِفَةُ جَاءَ الْمَوْتُ بِمَا فِيهِ جَاءَ الْمَوْتُ بِمَا فِيهِ قَالَ أُبَيٌّ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُكْثِرُ الصَّلَاةَ عَلَيْكَ فَكَمْ أَجْعَلُ لَكَ مِنْ صَلَاتِي فَقَالَ مَا شِئْتَ قَالَ قُلْتُ الرُّبُعَ قَالَ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ قُلْتُ النِّصْفَ قَالَ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ قَالَ قُلْتُ فَالثُّلُثَيْنِ قَالَ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ قُلْتُ أَجْعَلُ لَكَ صَلَاتِي كُلَّهَا قَالَ إِذًا تُكْفَى هَمَّكَ وَيُغْفَرُ لَكَ ذَنْبُكَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Qabishah] dari [Sufyan] dari [Abdullah bin Muhammad bin 'Uqail] dari [Ath Thufail bin Ubai bin Ka'ab] dari [ayahnya] berkata: Bila dua pertiga malam berlalu, Rasulullah Shallallahu 'alahi wa Salam bangun lalu bersabda: \"Wahai sekalian manusia, ingatlah Allah, ingatlah Allah, tiupan pertama datang dan diiringi oleh tiupan kedua, kematian datang dengan yang ada padanya, kematian datang dengan membawa segala kelanjutannya, kematian datang dengan membawa segala kelanjutannya.\" Berkata Ubai: Wahai Rasulullah, aku sering membawa shalawat untuk baginda, lalu seberapa banyak aku bershalawat untuk baginda? Rasulullah Shallallahu 'alaihi wa salam menjawab: \"Terserah.\" Aku bertanya: Seperempat? Rasulullah Shallallahu 'alahi wa Salam menjawab: \"Terserah, jika kau tambahi itu lebih baik bagimu.\" Aku bertanya: Setengah? Beliau menjawab: \"\"Terserah, jika kau tambahi itu lebih baik bagimu.\" Aku bertanya: Dua pertiga?\"Terserah, jika kau tambahi itu lebih baik bagimu.\" Aku berkata: Aku akan menjadikan seluruh do'aku untuk baginda. Beliau bersabda: \"Kalau begitu, kau dicukupkan dari dukamu dan dosamu diampuni.\" Berkata Abu Isa: Hadits ini hasan shahih."
            },
            {
                "number": 2373,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنْ ضَمْرَةَ بْنِ حَبِيبٍ عَنْ شَدَّادِ بْنِ أَوْسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْكَيِّسُ مَنْ دَانَ نَفْسَهُ وَعَمِلَ لِمَا بَعْدَ الْمَوْتِ وَالْعَاجِزُ مَنْ أَتْبَعَ نَفْسَهُ هَوَاهَا وَتَمَنَّى عَلَى اللَّهِقَالَ هَذَا حَدِيثٌ حَسَنٌ قَالَ وَمَعْنَى قَوْلِهِ مَنْ دَانَ نَفْسَهُ يَقُولُ حَاسَبَ نَفْسَهُ فِي الدُّنْيَا قَبْلَ أَنْ يُحَاسَبَ يَوْمَ الْقِيَامَةِ وَيُرْوَى عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ حَاسِبُوا أَنْفُسَكُمْ قَبْلَ أَنْ تُحَاسَبُوا وَتَزَيَّنُوا لِلْعَرْضِ الْأَكْبَرِ وَإِنَّمَا يَخِفُّ الْحِسَابُ يَوْمَ الْقِيَامَةِ عَلَى مَنْ حَاسَبَ نَفْسَهُ فِي الدُّنْيَا وَيُرْوَى عَنْ مَيْمُونِ بْنِ مِهْرَانَ قَالَ لَا يَكُونُ الْعَبْدُ تَقِيًّا حَتَّى يُحَاسِبَ نَفْسَهُ كَمَا يُحَاسِبُ شَرِيكَهُ مِنْ أَيْنَ مَطْعَمُهُ وَمَلْبَسُهُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waqi'] telah menceritakan kepada kami ['Isa bin Yunus] dari [Abu Bakar bin Abu Maryam], dan telah mengkhabarkan kepada kami [Abdullah bin Abdurrahman] telah mengkhabarkan kepada kami ['Amru bin 'Aun] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] dari [Abu Bakar bin Abu Maryam] dari [Dlamrah bin Habib] dari [Syaddad bin Aus] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Orang yang cerdas adalah orang yang mempersiapkan dirinya dan beramal untuk hari setelah kematian, sedangkan orang yang bodoh adalah orang jiwanya mengikuti hawa nafsunya dan berangan angan kepada Allah.\" Dia berkata: Hadits ini hasan, dia berkata: Maksud sabda Nabi \"Orang yang mempersiapkan diri\" dia berkata: Yaitu orang yang selalu mengoreksi dirinya pada waktu di dunia sebelum di hisab pada hari Kiamat. Dan telah diriwayatkan dari Umar bin Al Khottob dia berkata: hisablah (hitunglah) diri kalian sebelum kalian dihitung dan persiapkanlah untuk hari semua dihadapkan (kepada Rabb Yang Maha Agung), hisab (perhitungan) akan ringan pada hari kiamat bagi orang yang selalu menghisab dirinya ketika di dunia.\" Dan telah diriwayatkan dari Maimun bin Mihran dia berkata: Seorang hamba tidak akan bertaqwa hingga dia menghisab dirinya sebagaimana dia menghisab temannya dari mana dia mendapatkan makan dan pakaiannya.\""
            },
            {
                "number": 2374,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ مَدُّوَيْهِ حَدَّثَنَا الْقَاسِمُ بْنُ الْحَكَمِ الْعُرَنِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْوَلِيدِ الْوَصَّافِيُّ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُصَلَّاهُ فَرَأَى نَاسًا كَأَنَّهُمْ يَكْتَشِرُونَ قَالَ أَمَا إِنَّكُمْ لَوْ أَكْثَرْتُمْ ذِكْرَ هَاذِمِ اللَّذَّاتِ لَشَغَلَكُمْ عَمَّا أَرَى فَأَكْثِرُوا مِنْ ذِكْرِ هَاذِمِ اللَّذَّاتِ الْمَوْتِ فَإِنَّهُ لَمْ يَأْتِ عَلَى الْقَبْرِ يَوْمٌ إِلَّا تَكَلَّمَ فِيهِ فَيَقُولُ أَنَا بَيْتُ الْغُرْبَةِ وَأَنَا بَيْتُ الْوَحْدَةِ وَأَنَا بَيْتُ التُّرَابِ وَأَنَا بَيْتُ الدُّودِ فَإِذَا دُفِنَ الْعَبْدُ الْمُؤْمِنُ قَالَ لَهُ الْقَبْرُ مَرْحَبًا وَأَهْلًا أَمَا إِنْ كُنْتَ لَأَحَبَّ مَنْ يَمْشِي عَلَى ظَهْرِي إِلَيَّ فَإِذْ وُلِّيتُكَ الْيَوْمَ وَصِرْتَ إِلَيَّ فَسَتَرَى صَنِيعِيَ بِكَ قَالَ فَيَتَّسِعُ لَهُ مَدَّ بَصَرِهِ وَيُفْتَحُ لَهُ بَابٌ إِلَى الْجَنَّةِ وَإِذَا دُفِنَ الْعَبْدُ الْفَاجِرُ أَوْ الْكَافِرُ قَالَ لَهُ الْقَبْرُ لَا مَرْحَبًا وَلَا أَهْلًا أَمَا إِنْ كُنْتَ لَأَبْغَضَ مَنْ يَمْشِي عَلَى ظَهْرِي إِلَيَّ فَإِذْ وُلِّيتُكَ الْيَوْمَ وَصِرْتَ إِلَيَّ فَسَتَرَى صَنِيعِيَ بِكَ قَالَ فَيَلْتَئِمُ عَلَيْهِ حَتَّى يَلْتَقِيَ عَلَيْهِ وَتَخْتَلِفَ أَضْلَاعُهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَصَابِعِهِ فَأَدْخَلَ بَعْضَهَا فِي جَوْفِ بَعْضٍ قَالَ وَيُقَيِّضُ اللَّهُ لَهُ سَبْعِينَ تِنِّينًا لَوْ أَنْ وَاحِدًا مِنْهَا نَفَخَ فِي الْأَرْضِ مَا أَنْبَتَتْ شَيْئًا مَا بَقِيَتْ الدُّنْيَا فَيَنْهَشْنَهُ وَيَخْدِشْنَهُ حَتَّى يُفْضَى بِهِ إِلَى الْحِسَابِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْقَبْرُ رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ أَوْ حُفْرَةٌ مِنْ حُفَرِ النَّارِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ahmad bin Maduwaih] telah menceritakan kepada kami [Al Qasim bin Al Hakam Al 'Urani] telah menceritakan kepada kami ['ubaidhullah bin Al Walid Al Washshafi] dari ['Athiyah] dari [Abu Sa'id] berkata: Rasulullah Shallallahu 'alahi wa Salam memasuki tempat sholat beliau lalu beliau melihat orang-orang, sepertinya mereka tertawa hingga terlihat gigi-giginya, beliau bersabda: \"Ingat, sesungguhnya bila kalian banyak-banyak mengingat pemutus segala kenikmatan niscaya kalian tidak sempat melakukan yang aku lihat, karena itu perbanyaklah mengingat pemutus segala kenikmatan, sesungguhnya tidaklah ada suatu hari melewati makam (pekuburan) melainkan ia berbicara; aku rumah keterasingan, aku rumah kesendirian, aku rumah tanah, aku rumah cacing. Bila seorang hamba mu`min disemayamkan, makam berkata padanya: Selamat datang, engkau adalah orang yang berjalan di atas punggungku yang paling aku sukai, karena saat ini aku diberi kuasa menanganimu dan kau kembali kepadaku, kau akan melihat apa yang akan aku lakukan padamu.\" Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Lalu diluaskan baginya sejauh mata memandang dan dibukakan baginya pintu menuju surga. Dan bila hamba keji atau kafir dikubur, makam berkata padanya: Tidak selamat datang, engkau adalah orang yang melintasi di atas punggungku yang paling aku benci, karena saat ini aku diberi kuasa menanganimu dan kau kembali padaku, kau akan mengetahui apa yang akan aku lakukan padamu.\" Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Lalu kubur menghimpitnya hingga mengenainya sehingga tulang tulangnya tidak karu-karuan (amburadul), \" -Rasul memperagakan dengan memasukkan sebagian jari-jemarinya ke sebagian yang lain-- Berkata Abu Sa'id: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Allah menguasakan untuknya tujuhpuluh ular besar, andai satu diantaranya menghembus di bumi nicaya tidak akan menumbuhkan apa pun selama dunia masih ada, lalu semua mengigit dan melukainya hingga ia sampai ke penghisaban.\" Berkata Abu Sa'id: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Sesungguhnya kubur adalah salah satu taman surga atau salah satu liang neraka.\" Berkata Abu Isa: Hadits ini gharib, kami hanya mengetahuinya dari sanad ini."
            },
            {
                "number": 2375,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ وَيُونُسَ عَنْ الزُّهْرِيِّ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ أَخْبَرَهُ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ أَخْبَرَهُ أَنَّ عَمْرَو بْنَ عَوْفٍ وَهُوَ حَلِيفُ بَنِي عَامِرِ بْنِ لُؤَيٍّ وَكَانَ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ فَقَدِمَ بِمَالٍ مِنْ الْبَحْرَيْنِ وَسَمِعَتْ الْأَنْصَارُ بِقُدُومِ أَبِي عُبَيْدَةَ فَوَافَوْا صَلَاةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ فَتَعَرَّضُوا لَهُ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ رَآهُمْ ثُمَّ قَالَ أَظُنُّكُمْ سَمِعْتُمْ أَنْ أَبَا عُبَيْدَةَ قَدِمَ بِشَيْءٍ قَالُوا أَجَلْ يَا رَسُولَ اللَّهِ قَالَ فَأَبْشِرُوا وَأَمِّلُوا مَا يَسُرُّكُمْ فَوَاللَّهِ مَا الْفَقْرَ أَخْشَى عَلَيْكُمْ وَلَكِنِّي أَخْشَى أَنْ تُبْسَطَ الدُّنْيَا عَلَيْكُمْ كَمَا بُسِطَتْ عَلَى مَنْ قَبْلَكُمْ فَتَنَافَسُوهَا كَمَا تَنَافَسُوهَا فَتُهْلِكَكُمْ كَمَا أَهْلَكَتْهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] dari [Ma'mar] dan [Yunus] dari [Az Zuhri] bahwa ['Urwah bin Az Zubair] memberitahunya bahwa [Al Miswar bin Makhramah] memberitahunya bahwa [Amru bin 'Auf], yang ia adalah sekutu Bani 'Amir bin Lu`ai, yang ia turut serta dalam perang Badar bersama Rasulullah Shallallahu 'alahi wa Salam, ia memberitahunya bahwa Rasulullah Shallallahu 'alahi wa Salam mengutus Abu 'Ubaidah bin Al Jarrah lalu ia datang membawa harta dari Bahrain dan kaun Anshar mendengar kedatangan Abu 'Ubaidah lalu mereka sholat fajar bersama Rasulullah Shallallahu 'alahi wa Salam, seusai sholat Rasulullah Shallallahu 'alahi wa Salam bergegas lalu mereka menghadang beliau, Rasulullah Shallallahu 'alahi wa Salam tersenyum saat melihat mereka, setelah itu beliau bersabda: \"Aku kira kalian mendengar bahwa Abu 'Ubaidah datang membawa sesuatu.\" Mereka berkata: Benar, wahai Rasulullah. beliau bersabda: \"Bergembiralah dan berharaplah apa yang menggembirakan kalian, demi Allah bukan kemiskinan yang aku takutkan pada kalian, tapi aku takut dunia dibentangkan untuk kalian seperti halnya dibentangkan pada orang sebelum kalian, lalu kalian memperlombakannya sebagaimana mereka memperlombakannya lalu ia membinasakan kalian seperti halnya mereka.\" Berkata Abu Isa: Hadits ini shahih."
            },
            {
                "number": 2376,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ وَابْنِ الْمُسَيَّبِ أَنَّ حَكِيمَ بْنَ حِزَامٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى فَقَالَ حَكِيمٌ فَقُلْتُ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا أَرْزَأُ أَحَدًا بَعْدَكَ شَيْئًا حَتَّى أُفَارِقَ الدُّنْيَا فَكَانَ أَبُو بَكْرٍ يَدْعُو حَكِيمًا إِلَى الْعَطَاءِ فَيَأْبَى أَنْ يَقْبَلَهُ ثُمَّ إِنَّ عُمَرَ دَعَاهُ لِيُعْطِيَهُ فَأَبَى أَنْ يَقْبَلَ مِنْهُ شَيْئًا فَقَالَ عُمَرُ إِنِّي أُشْهِدُكُمْ يَا مَعْشَرَ الْمُسْلِمِينَ عَلَى حَكِيمٍ أَنِّي أَعْرِضُ عَلَيْهِ حَقَّهُ مِنْ هَذَا الْفَيْءِ فَيَأْبَ أَنْ يَأْخُذَهُ فَلَمْ يَرْزَأْ حَكِيمٌ أَحَدًا مِنْ النَّاسِ شَيْئًا بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تُوُفِّيَقَالَ هَذَا حَدِيثٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengkhabarkan kepada kami [Abdullah] dari [Yunus] dari [Az Zuhri] dari ['Urwah] dan [Ibnu Al Musayyib] bahwa [Hakim bin Hizam] berkata: Aku meminta Rasulullah Shallallahu 'alahi wa Salam lalu beliau memberiku, setelah itu aku meminta pada beliau, beliau memberiku, kemudian aku meminta pada beliau, beliau memberiku, setelah itu beliau bersabda: \"Hai Hakim, sesungguhnya harta ini hijau manis, barangsiapa yang mengambilnya dengan kedermawanan jiwa, ia diberkahi, sebaliknya barangsiapa mengambilnya dengan ambisius dan ketamakan jiwa, ia tidak diberkahi dan seperti orang makan namun tidak kenyang, tangan di atas lebih baik dari tangan di bawah.\" Berkata Hakim: Aku berkata: Wahai Rasulullah, demi yang mengutusmu dengan kebenaran, aku tidak akan meminta apa pun kepada siapa pun sepeninggal baginda hingga aku meninggalkan dunia. Abu Bakar memanggil Hakim untuk diberi sesuatu, ia enggan menerimanya, setelah itu Umar memanggilnya untuk diberi sesuatu, ia sama sekali tidak menerimanya lalu Umar berkata: Aku menjadikan kalian wahai kaum muslimin sebagai saksi atas Hakim, sesungguhnya aku telah menawarkan haknya dari harta rampasan perang ini tapi ia enggan mengambilnya. Hakim tidak menerima sesuatu pun dari siapa pun setelah Rasulullah Shallallahu 'alahi wa Salam hingga ia meninggal. Berkata Abu Isa: Hadits ini shahih."
            },
            {
                "number": 2377,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو صَفْوَانَ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَابْتُلِينَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالضَّرَّاءِ فَصَبَرْنَا ثُمَّ ابْتُلِينَا بِالسَّرَّاءِ بَعْدَهُ فَلَمْ نَصْبِرْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu Shofwan] dari [Yunus] dari [Az Zuhri] dari [Humaid bin Abdurrahman] dari [Abdurrahman bin 'Auf] berkata: Ketika bersama Rasulullah kami di uji dengan kesusahan dan kami bersabar, kemudian setelah beliau meninggal kami diuji dengan kesenangan dan kami tidak bersabar.\" Abu Isa berkata: Hadits ini hasan."
            },
            {
                "number": 2378,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ عِمْرَانَ بْنِ زَائِدَةَ بْنِ نَشِيطٍ عَنْ أَبِيهِ عَنْ أَبِي خَالِدٍ الْوَالِبِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَعَالَى يَقُولُ يَا ابْنَ آدَمَ تَفَرَّغْ لِعِبَادَتِي أَمْلَأْ صَدْرَكَ غِنًى وَأَسُدَّ فَقْرَكَ وَإِلَّا تَفْعَلْ مَلَأْتُ يَدَيْكَ شُغْلًا وَلَمْ أَسُدَّ فَقْرَكَقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَأَبُو خَالِدٍ الْوَالِبِيُّ اسْمُهُ هُرْمُزُ",
                "id": "Telah menceritakan kepada kami ['Ali bin Khasyram] telah menceritakan kepada kami ['Isa bin Yunus] dari ['Imran bin Za'idah bin Nasyith] dari [bapaknya] dari [Abu Khalid Al Walibi] dari [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Sesungguhnya Allah Ta'ala berfirman: Wahai anak Adam, fokuskanlah untuk beribadah kepadaku niscaya Aku penuhi dadamu dengan rasa cukup dan aku tutupi kefakiranmu, jika kamu tidak mengerjakannya Aku akan penuhi kedua tanganmu dengan kesibukan dan Aku tidak menutupi kefakiranmu.\" Dia berkata: Hadits ini hasan gharib, adapun Abu Kholid Al Walibi namanya adalah Hurmuz."
            },
            {
                "number": 2379,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ سَنَةٍوَفِي الْبَاب عَنْ أَنَسٍ وَأَبِي سَعِيدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Sa'id bin Abu Sa'id Al Maqbari] dari [ayahnya] dari [Abu Hurairah] dari Rasulullah Shallallahu 'alaihi wa Salam, beliau bersabda: \"Sesungguhnya di surga ada pohon, seorang pengendara berjalan di dalam naungannya selama seratus tahun.\" Dalam hal ini ada hadits serupa dari Anas dan Abu Sa'id. Berkata Abu Isa: Hadits ini shahih."
            },
            {
                "number": 2380,
                "arab": "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَنَّةِ شَجَرَةٌ يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لَا يَقْطَعُهَا وَقَالَ ذَلِكَ الظِّلُّ الْمَمْدُودُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مَنْ حَدِيثِ أَبِي سَعِيدٍ",
                "id": "Telah menceritakan kepada kami [Abbas Ad Duri] telah bercerita kepada kami [ubaidhullah bin Musa] dari [Syaiban] dari [Firas] dari ['Athiyyah] dari [Abu Sa'id Al Khudri] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Di dalam syurga ada pohon (yang panjangnya sejauh) seorang pengendara berjalan di bawah naungannya selama seratus tahun dan tidak bisa menyelesaikannya, \" dan beliau berkata: Itulah maksud naungan yang terbentang luas.\" Abu Isa berkata: Hadits ini hasan gharib dari hadits Abu Sa'id."
            },
            {
                "number": 2381,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا زِيَادُ بْنُ الْحَسَنِ بْنِ الْفُرَاتِ الْقَزَّازُ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا فِي الْجَنَّةِ شَجَرَةٌ إِلَّا وَسَاقُهَا مِنْ ذَهَبٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyaj] telah bercerita kepada kami [Ziyad bin Al Hasan bin Al Furath Al Qazzaz] dari [bapaknya] dari [kakeknya] dari [Abu Hazim] dari [Abu Hurairah] berkata Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidak ada pohon di surga kecuali dahannya terbuat dari emas.\" Abu Isa berkata: Hadits ini hasan gharib."
            },
            {
                "number": 2382,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ حَمْزَةَ الزَّيَّاتِ عَنْ زِيَادٍ الطَّائِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقُلْنَا يَا رَسُولَ اللَّهِ مَا لَنَا إِذَا كُنَّا عِنْدَكَ رَقَّتْ قُلُوبُنَا وَزَهِدْنَا فِي الدُّنْيَا وَكُنَّا مِنْ أَهْلِ الْآخِرَةِ فَإِذَا خَرَجْنَا مِنْ عِنْدِكَ فَآنَسْنَا أَهَالِينَا وَشَمَمْنَا أَوْلَادَنَا أَنْكَرْنَا أَنْفُسَنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّكُمْ تَكُونُونَ إِذَا خَرَجْتُمْ مِنْ عِنْدِي كُنْتُمْ عَلَى حَالِكُمْ ذَلِكَ لَزَارَتْكُمْ الْمَلَائِكَةُ فِي بُيُوتِكُمْ وَلَوْ لَمْ تُذْنِبُوا لَجَاءَ اللَّهُ بِخَلْقٍ جَدِيدٍ كَيْ يُذْنِبُوا فَيَغْفِرَ لَهُمْ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مِمَّ خُلِقَ الْخَلْقُ قَالَ مِنْ الْمَاءِ قُلْنَا الْجَنَّةُ مَا بِنَاؤُهَا قَالَ لَبِنَةٌ مِنْ فِضَّةٍ وَلَبِنَةٌ مِنْ ذَهَبٍ وَمِلَاطُهَا الْمِسْكُ الْأَذْفَرُ وَحَصْبَاؤُهَا اللُّؤْلُؤُ وَالْيَاقُوتُ وَتُرْبَتُهَا الزَّعْفَرَانُ مَنْ دَخَلَهَا يَنْعَمُ لَا يَبْأَسُ وَيَخْلُدُ لَا يَمُوتُ لَا تَبْلَى ثِيَابُهُمْ وَلَا يَفْنَى شَبَابُهُمْ ثُمَّ قَالَ ثَلَاثَةٌ لَا تُرَدُّ دَعْوَتُهُمْ الْإِمَامُ الْعَادِلُ وَالصَّائِمُ حِينَ يُفْطِرُ وَدَعْوَةُ الْمَظْلُومِ يَرْفَعُهَا فَوْقَ الْغَمَامِ وَتُفَتَّحُ لَهَا أَبْوَابُ السَّمَاءِ وَيَقُولُ الرَّبُّ عَزَّ وَجَلَّ وَعِزَّتِي لَأَنْصُرَنَّكِ وَلَوْ بَعْدَ حِينٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِذَاكَ الْقَوِيِّ وَلَيْسَ هُوَ عِنْدِي بِمُتَّصِلٍ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ بِإِسْنَادٍ آخَرَ عَنْ أَبِي مُدِلَّةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Hamzah Az Zayyat] dari [Ziyad Ath Tho`i] dari [Abu Hurairah] berkata: Kami berkata: Wahai Rasulullah, kenapa kami bila berada di dekat baginda, hati kami melunak, kami zuhud di dunia dan kami termasuk ahli akhirat, tapi bila kami bergegas meninggalkan baginda lalu kami bergaul dengan keluargaku, mencium anak-anak kami, kami mengingkari diri kami sendiri (maksudnya agamis seperti semula). Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Andai kalian bila pergi meninggalkanku berada dalam kondisi kalian seperti itu, niscaya para malaikat mengunjungi kalian di rumah-rumah kalian dan seandainya kalian tidak berbuat dosa, niscaya Allah menciptakan makhluk baru agar mereka berbuat dosa lalu Allah akan mengampuni mereka.\" Berkata Abu Hurairah: Aku berkata: Wahai Rasulullah, dari apa makhluk diciptakan? Rasulullah Shallallahu 'alaihi wa Salam menjawab: \"Dari air.\" Kami bertanya: Surga, apa bangunanya? Beliau menjawab: Bata dari perak dan bata dari emas, semennya minyak kesturi yang harum, tanahnya mutiara dan permata, debunya za'faran, barangsiapa memasukinya, ia bersenang-senang dengan tidak jemu, kekal, tidak mati, baju mereka tidak usang, kemudaan mereka tidak lenyap.\" Setelah itu beliau bersabda: \"Tiga orang yang do'anya tidak tertolak; imam adil, orang puasa saat berbuka dan do'a orang yang terzhalimi, do'anya diangkat diatas awan dan pintu-pintu langit dibukakan, Rabb 'azza wajalla berfirman: Demi keperkasaanKu, aku akan menolongmu meski setelah selang berapa lama.\" Berkata Abu Isa: Hadits ini sanadnya tidak kuat dan menurutku tidak tersambung. Hadits ini diriwayatkan dengan sanad lain dari [Abu Mudillah] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam."
            },
            {
                "number": 2383,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجَنَّةِ لَغُرَفًا يُرَى ظُهُورُهَا مِنْ بُطُونِهَا وَبُطُونُهَا مِنْ ظُهُورِهَا فَقَامَ إِلَيْهِ أَعْرَابِيٌّ فَقَالَ لِمَنْ هِيَ يَا رَسُولَ اللَّهِ قَالَ هِيَ لِمَنْ أَطَابَ الْكَلَامَ وَأَطْعَمَ الطَّعَامَ وَأَدَامَ الصِّيَامَ وَصَلَّى لِلَّهِ بِاللَّيْلِ وَالنَّاسُ نِيَامٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ هَذَا مِنْ قِبَلِ حِفْظِهِ وَهُوَ كُوفِيٌّ وَعَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ الْقُرَشِيُّ مَدَنِيٌّ وَهُوَ أَثْبَتُ مِنْ هَذَا",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Ali bin Mashir] dari [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'ad] dari [Ali] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada kamar-kamar, luarnya terlihat dari dalam dan dalamnya terlihat dari luar.\" Seorang badui menghampiri beliau, ia bertanya: Itu untuk siapa, wahai Rasulullah? Beliau menjawab: \"Bagi yang membiasakan ucapannya baik, memberi makan, puasa secara kontinyu, sholat malam untuk Allah saat orang-orang tidur.\" Berkata Abu Isa: Hadits ini gharib. Sebagian ahlul ilmi membicarakan Abdurrahman bin Ishaq dari sisi hafalannya, ia orang Kufah, sementara Abdurrahman bin Ishaq Al Qurasy, orang Madinah, lebih kuat hafalannya dari dia."
            },
            {
                "number": 2384,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ أَبُو عَبْدِ الصَّمَدِ الْعَمِّيُّ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ جَنَّتَيْنِ آنِيَتُهُمَا وَمَا فِيهِمَا مِنْ فِضَّةٍ وَجَنَّتَيْنِ آنِيَتُهُمَا وَمَا فِيهِمَا مِنْ ذَهَبٍ وَمَا بَيْنَ الْقَوْمِ وَبَيْنَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلَّا رِدَاءُ الْكِبْرِيَاءِ عَلَى وَجْهِهِ فِي جَنَّةِ عَدْنٍوَبِهَذَا الْإِسْنَادِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ لَخَيْمَةً مِنْ دُرَّةٍ مُجَوَّفَةٍ عَرْضُهَا سِتُّونَ مِيلًا فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ مَا يَرَوْنَ الْآخَرِينَ يَطُوفُ عَلَيْهِمْ الْمُؤْمِنُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو عِمْرَانَ الْجَوْنِيُّ اسْمُهُ عَبْدُ الْمَلِكِ بْنُ حَبِيبٍ وَأَبُو بَكْرِ بْنُ أَبِي مُوسَى قَالَ أَحْمَدُ بْنُ حَنْبَلٍ لَا يُعْرَفُ اسْمُهُ وَأَبُو مُوسَى الْأَشْعَرِيُّ اسْمُهُ عَبْدُ اللَّهِ بْنُ قَيْسٍ وَأَبُو مَالِكٍ الْأَشْعَرِيُّ اسْمُهُ سَعْدُ بْنُ طَارِقِ بْنِ أَشْيَمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdul Aziz bin Abdush Shamad Abu Abdush Shamad Al 'Ammi] dari [Abu 'Imran Al Jauni] dari [Abu Bakar bin Abdullah bin Qais] dari [ayahnya] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada dua taman, wadah-wadahnya dan segala isinya terbuat dari perak, dua taman lain wadah-wadahnya dan segala isinya terbuat dari emas, tidak ada yang menghalangi kaum untuk melihat Rabb mereka kecuali selendang kesombongan yang ada di wajahNya di surga 'Aden.\" Dengan sanad ini dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada kemah dari mutiara-luasnya enampuluh mil, disetiap sisinya ada penghuninya, mereka tidak melihat yang lain, mereka dikelilingi orang mu`min.\" Berkata Abu Isa: Hadits ini hasan shahih. Abu 'Imran Al Jauni namanya 'Abdul Malik bin Hubaib dan Abu Bakar bin Abu Musa. Ahmad bin Hambal berkata: Namanya tidak dikenal dan Abu Musa Al Asy'ari namanya Abdullah bin Qais sementara Abu Malik Al Asy'ari namanya Sa'ad bin Thariq bin Asyam."
            },
            {
                "number": 2385,
                "arab": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ مِائَةُ عَامٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Abbas Al Anbari] telah bercerita kepada kami [Yazid bin Harun] telah bercerita kepada kami [Syarik] dari [Muhammad bin Juhadah] dari ['Atho'] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Di dalam syurga ada seratus tingkatan, jarak di antara satu tingkatan dengan yang lain adalah seratus tahun.\" Abu Isa berkata: Hadits ini hasan gharib."
            },
            {
                "number": 2386,
                "arab": "حَدَّثَنَا قُتَيْبَةُ وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ رَمَضَانَ وَصَلَّى الصَّلَوَاتِ وَحَجَّ الْبَيْتَ لَا أَدْرِي أَذَكَرَ الزَّكَاةَ أَمْ لَا إِلَّا كَانَ حَقًّا عَلَى اللَّهِ أَنْ يَغْفِرَ لَهُ إِنْ هَاجَرَ فِي سَبِيلِ اللَّهِ أَوْ مَكَثَ بِأَرْضِهِ الَّتِي وُلِدَ بِهَا قَالَ مُعَاذٌ أَلَا أُخْبِرُ بِهَذَا النَّاسَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَرْ النَّاسَ يَعْمَلُونَ فَإِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ وَالْفِرْدَوْسُ أَعْلَى الْجَنَّةِ وَأَوْسَطُهَا وَفَوْقَ ذَلِكَ عَرْشُ الرَّحْمَنِ وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ فَإِذَا سَأَلْتُمُ اللَّهَ فَسَلُوهُ الْفِرْدَوْسَقَالَ أَبُو عِيسَى هَكَذَا رُوِيَ هَذَا الْحَدِيثُ عَنْ هِشَامِ بْنِ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاذِ بْنِ جَبَلٍ وَهَذَا عِنْدِي أَصَحُّ مِنْ حَدِيثِ هَمَّامٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ وَعَطَاءٌ لَمْ يُدْرِكْ مُعَاذَ بْنَ جَبَلٍ وَمُعَاذٌ قَدِيمُ الْمَوْتِ مَاتَ فِي خِلَافَةِ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Qutaibah] dan [Ahmad bin 'Abdah Adl Dlabyi Al Bashri] keduanya berkata: Telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Zaid bin Aslam] dari ['Atho` bin Yasar] dari [Mu'adz bin Jabal], Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa puasa ramadlon, sholat lima waktu, haji ke baitullah -aku tidak tahu apakah beliau menyebut zakat atau tidak- kecuali laik bagi Allah untuk mengampuninya bila ia berhijrah di jalan Allah atau tinggal di kawasan tempat tinggalnya.\" Berkata Mu'adz: Bolehkah aku memberitahukannya kepada orang-orang? Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Biarkan mereka beramal karena sesungguhnya di surga ada seratus tingkat, masing-masing tingkat jaraknya antara langit dan bumi, dan Firdaus adalah surga tertinggi, tengah-tengahnya dan diatasnya 'arsy Ar Rahman, darinya sungai-sungai surga memancar. Bila kalian meminta pada Allah, mintalah Firdaus.\" Berkata Abu Isa: Seperti itulah hadits ini diriwayatkan dari Hisyam bin Sa'ad dari Zaid bin Aslam dari 'Atho bin Yasar dari Mu'adz bin Jabal dan menurutku ini lebih shahih dari hadits Hammam dari Zaid bin Aslam dari Atho bin Yasar dari Ubadah bin Ash Shamit. 'Atho` tidak bertemu Mu'adz bin Jabal, Mu'adz lebih dahulu meninggal dimasa khilafah Umar."
            },
            {
                "number": 2387,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ الْأَرْضِ وَالسَّمَاءِ وَالْفِرْدَوْسُ أَعْلَاهَا دَرَجَةً وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ الْأَرْبَعَةُ وَمِنْ فَوْقِهَا يَكُونُ الْعَرْشُ فَإِذَا سَأَلْتُمُ اللَّهَ فَسَلُوهُ الْفِرْدَوْسَحَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هَمَّامٌ عَنْ زَيْدِ بْنِ أَسْلَمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengkhabarkan kepada kami [Yazid bin Harun] telah mengkhabarkan kepada kami [Hammam] telah menceritakan kepada kami [Zaid bin Aslam] dari ['Atho` bin Yasar] dari ['Ubadah bin Ash Shamit] Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Di surga ada seratus tingkat, jarak antara masing-masing tingkat seperti antara bumi dan langit dan Firdaus adalah surga tertinggi, darinya empat sungai surga memancar, di atasnya 'arsy, bila kalian meminta kepada Allah, mintalah Firdaus.\" Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammam] dari [Zaid bin Aslam] sepertinya."
            },
            {
                "number": 2388,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ لَوْ أَنَّ الْعَالَمِينَ اجْتَمَعُوا فِي إِحْدَاهُنَّ لَوَسِعَتْهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Darraj] dari [Abu Al Haitsam] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada seratus tingkat, seandainya seluruh alam berkumpul di salah satunya pasti memuat mereka.\" Berkata Abu Isa: Hadits ini gharib."
            },
            {
                "number": 2389,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ أَخْبَرَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَرْأَةَ مِنْ نِسَاءِ أَهْلِ الْجَنَّةِ لَيُرَى بَيَاضُ سَاقِهَا مِنْ وَرَاءِ سَبْعِينَ حُلَّةً حَتَّى يُرَى مُخُّهَا وَذَلِكَ بِأَنَّ اللَّهَ يَقُولُ{ كَأَنَّهُنَّ الْيَاقُوتُ وَالْمَرْجَانُ }فَأَمَّا الْيَاقُوتُ فَإِنَّهُ حَجَرٌ لَوْ أَدْخَلْتَ فِيهِ سِلْكًا ثُمَّ اسْتَصْفَيْتَهُ لَأُرِيتَهُ مِنْ وَرَائِهِحَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ نَحْوَهُ بِمَعْنَاهُ وَلَمْ يَرْفَعْهُ وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَبِيدَةَ بْنِ حُمَيْدٍ وَهَكَذَا رَوَى جَرِيرٌ وَغَيْرُ وَاحِدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ وَلَمْ يَرْفَعُوهُ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ عَطَاءِ بْنِ السَّائِبِ نَحْوَ حَدِيثِ أَبِي الْأَحْوَصِ وَلَمْ يَرْفَعْهُ أَصْحَابُ عَطَاءٍ وَهَذَا أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah bercerita kepada kami [Farwah bin Abul Maghra'] telah bercerita kepada kami ['Abidah bin Humaid] dari ['Atho' bin As Sa'ib] dari [Amru bin Maimun] dari [Abdullah bin Mas'ud] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Sesungguhnya putih betisnya seorang wanita penghuni syurga akan tampak kelihatan dari balik tujuh puluh kalin sampai terlihat tulangnya yang jernih, yang demikian itu karena Allah telah berfirman \"Seakan-akan bidadari itu permata yakut dan marjan.\" (Ar-Rahmaan: 58) adapun permata yaqutnya terbuat dari batu yang jika di masukkan kabel ke dalamnya kemudian kamu bersihkan, niscaya kamu akan dapat melihat dari belakangnya.\" Telah menceritakan kepada kami [Hannad] telah bercerita kepada kami ['Abidah bin Humaid] dari ['Atho` bin As Sa'ib] dari [Amru bin Maimun] dari [Abdullah bin Mas'ud] dari Nabi Shallallahu 'alaihi wa Salam dengan hadits yang semakna. Telah menceritakan kepada kami [Hannad] telah bercerita kepada kami [Abu Al Ahwas] dari [Atho' bin As Sa'ib] dari [Amru bin Maimun] dari [Abdullah bin Mas'ud] dengan hadits yang semakna dengannya namun tidak memarfu'kanya dan ini lebih shahih dari hadits 'Abidah bin Humaid, demikianlah Jarir dan yang lainnya meriwayatkan dari 'Atho` bin As Sa'ib dan mereka tidak memarfu'kannya. Telah menceritakan kepada kami [Qutaibah] telah bercerita kepada kami [Jarir] dari ['Atho` bin As Sa'ib] yang semakna dengan hadits Abul Ahwas namun sahabat 'Atho' tidak memarfu'kannya dan ini yang lebih shahih."
            },
            {
                "number": 2390,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَوَّلَ زُمْرَةٍ يَدْخُلُونَ الْجَنَّةَ يَوْمَ الْقِيَامَةِ ضَوْءُ وُجُوهِهِمْ عَلَى مِثْلِ ضَوْءِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالزُّمْرَةُ الثَّانِيَةُ عَلَى مِثْلِ أَحْسَنِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ لِكُلِّ رَجُلٍ مِنْهُمْ زَوْجَتَانِ عَلَى كُلِّ زَوْجَةٍ سَبْعُونَ حُلَّةً يُرَى مُخُّ سَاقِهَا مِنْ وَرَائِهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [ayahku] dari [Fudlail bin Marzuq] dari ['Athiyah] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya golongan pertama yang masuk surga pada hari kiamat (adalah yang) mukanya bersinar seperti sinar bulan di malam purnama dan golongan kedua seperti bintang bersinar terang terindah dilangit, setiap lelaki di antara mereka mendapatkan dua istri, setiap istri mengenakan tujuhpuluh perhiasan, sungsumnya terlihat dari belakang.\" Berkata Abu Isa: Hadits ini hasan shahih."
            },
            {
                "number": 2391,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا شَيْبَانُ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَوَّلُ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالثَّانِيَةُ عَلَى لَوْنِ أَحْسَنِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ لِكُلِّ رَجُلٍ مِنْهُمْ زَوْجَتَانِ عَلَى كُلِّ زَوْجَةٍ سَبْعُونَ حُلَّةً يَبْدُو مُخُّ سَاقِهَا مِنْ وَرَائِهَاقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Muhammad Ad Dauri] telah menceritakan kepada kami ['ubaidhullah bin Musa] telah mengkhabarkan kepada kami [Syaiban] dari [Firas] dari ['Athiyah] dari [Abu Sa'id Al Khudri] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Golongan pertama yang masuk surga mereka bagaikan bulan di malam purnama dan golongan kedua seperti warna bintang bersinar terang terindah dilangit, setiap lelaki di antara mereka mendapatkan dua istri, setiap istri mengenakan tujuhpuluh perhiasan, sungsumnya terlihat dari belakang.\" Berkata Abu Isa: Hadits ini hasan shahih."
            },
            {
                "number": 2392,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمَحْمُودُ بْنُ غَيْلَانَ قَالَا حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ عِمْرَانَ الْقَطَّانِ عَنْ قَتَادَةَ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُعْطَى الْمُؤْمِنُ فِي الْجَنَّةِ قُوَّةَ كَذَا وَكَذَا مِنْ الْجِمَاعِ قِيلَ يَا رَسُولَ اللَّهِ أَوَ يُطِيقُ ذَلِكَ قَالَ يُعْطَى قُوَّةَ مِائَةٍوَفِي الْبَاب عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ قَتَادَةَ عَنْ أَنَسٍ إِلَّا مِنْ حَدِيثِ عِمْرَانَ الْقَطَّانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Mahmud bin Ghailan] keduanya berkata: telah menceritakan kepada kami [Abu Daud Ath Thayalisi] dari ['Imran Al Qattan] dari [Qatadah] dari [Anas] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Orang beriman kelak di syurga diberi kekuatan bersetubuh seperti ini dan seperti ini, \" ada yang bertanya: Wahai Rasulullah apakah mampu seperti itu? beliau menjawab: \"Mereka diberi kekuatan jima' sampai seratus kali lipat.\" Dan dalam bab ini ada hadits dari Zaid bin Arqam, Abu Isa berkata: Hadits ini shahih gharib, kami tidak mengetahuinya dari hadits Qotadah dari Anas kecuali dari hadits Imran Al Qattan."
            },
            {
                "number": 2393,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ زُمْرَةٍ تَلِجُ الْجَنَّةَ صُورَتُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ لَا يَبْصُقُونَ فِيهَا وَلَا يَمْخُطُونَ وَلَا يَتَغَوَّطُونَ آنِيَتُهُمْ فِيهَا الذَّهَبُ وَأَمْشَاطُهُمْ مِنْ الذَّهَبِ وَالْفِضَّةِ وَمَجَامِرُهُمْ مِنْ الْأُلُوَّةِ وَرَشْحُهُمْ الْمِسْكُ وَلِكُلِّ وَاحِدٍ مِنْهُمْ زَوْجَتَانِ يُرَى مُخُّ سُوقِهِمَا مِنْ وَرَاءِ اللَّحْمِ مِنْ الْحُسْنِ لَا اخْتِلَافَ بَيْنَهُمْ وَلَا تَبَاغُضَ قُلُوبُهُمْ قَلْبُ رَجُلٍ وَاحِدٍ يُسَبِّحُونَ اللَّهَ بُكْرَةً وَعَشِيًّاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَالْأُلُوَّةُ هُوَ الْعُودُ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Golongan pertama yang masuk surga pada hari kiamat wujud mereka seperti sinar bulan di malam purnama, mereka tidak meludah didalamnya, tidak beringus dan tidak buang hajat, di surga, wadah-wadah mereka terbuat dari emas, sisir mereka terbuat dari emas dan perak, dupa mereka dari kayu cendana (uluwwah) dan keringat mereka kesturi, masing-masing dari mereka mendapat dua istri, sungsum keduanya terlihat dari balik daging karena indahnya, tidak ada sengketa di antara mereka dan hati mereka tidak saling murka, satu hati, mereka memahasucikan Allah dipagi dan disore hari.\" Berkata Abu Isa: Hadits ini shahih dan uluwwah adalah kayu cendana."
            },
            {
                "number": 2394,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ دَاوُدَ بْنِ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ مَا يُقِلُّ ظُفُرٌ مِمَّا فِي الْجَنَّةِ بَدَا لَتَزَخْرَفَتْ لَهُ مَا بَيْنَ خَوَافِقِ السَّمَوَاتِ وَالْأَرْضِ وَلَوْ أَنَّ رَجُلًا مِنْ أَهْلِ الْجَنَّةِ اطَّلَعَ فَبَدَا أَسَاوِرُهُ لَطَمَسَ ضَوْءَ الشَّمْسِ كَمَا تَطْمِسُ الشَّمْسُ ضَوْءَ النُّجُومِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ بِهَذَا الْإِسْنَادِ إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ وَقَدْ رَوَى يَحْيَى بْنُ أَيُّوبَ هَذَا الْحَدِيثَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ وَقَالَ عَنْ عُمَرَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] telah mengkhabarkan kepada kami [Ibnu Lahi'ah] dari [Yazid bin Abu Habib] dari [Dawud bin 'Amir bin Sa'ad bin Abi Waqqash] dari [ayahnya] dari [kakeknya] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Andai yang dibawa kuku dalam surga terlihat niscaya antara sisi-sisi langit dan bumi akan terhiasi karenanya, andai seorang penghuni surga muncul lalu gelang-gelangnya terlihat niscaya padamlah matahari seperti matahari melenyapkan cahaya bintang-bintang. Berkata Abu Isa: Hadits ini gharib, kami hanya mengetahui sanad ini dari hadits Ibnu Lahi'ah. [Yahya bin Ayyub] meriwayatkan hadits ini dari [Yazid bin Abu Habib] dan berkata: Dari [Umar bin Sa'ad bin Abi Waqqash] dari nabi Shallallahu 'alaihi wa Salam."
            },
            {
                "number": 2395,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو هِشَامٍ الرِّفَاعِيُّ قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ عَنْ أَبِيهِ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْلُ الْجَنَّةِ جُرْدٌ مُرْدٌ كُحْلٌ لَا يَفْنَى شَبَابُهُمْ وَلَا تَبْلَى ثِيَابُهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Abu Hisyam Ar Rifa'i] keduanya berkata: Telah menceritakan kepada kami [Mu'adz bin Hisyam] dari [ayahnya] dari ['Amir Al Ahwal] dari [Syahr bin Hausyab] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Penghuni surga itu tidak berbulu, tidak berjenggot, mengenakan calak mata, kemudaan mereka tidak hilang dan baju mereka tidak pernah usang.\" Berkata Abu Isa: Hadits ini hasan gharib."
            },
            {
                "number": 2396,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ دَرَّاجٍ أَبِي السَّمْحِ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ{ وَفُرُشٍ مَرْفُوعَةٍ }قَالَ ارْتِفَاعُهَا لَكَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ مَسِيرَةَ خَمْسِ مِائَةِ سَنَةٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ فِي تَفْسِيرِ هَذَا الْحَدِيثِ إِنَّ مَعْنَاهُ الْفُرُشَ فِي الدَّرَجَاتِ وَبَيْنَ الدَّرَجَاتِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Risydin bin Sa'ad] dari [Amru bin Al Harits] dari [Darraj Abu As Samah] dari [Abu Al Haitsam] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam tentang firman Allah: \"Dan hamparan-hamparan (permadani-permadani) yang ditinggikan.\" (QS. Alwaqi'ah 64), Beliau bersabda: \"Tingginya sama seperti antara langit dan bumi, perjalanan limaratus tahun.\" Berkata Abu Isa: Hadits ini gharib, kami hanya mengetahuinya dari hadits Risydin bin Sa'ad. Sebagaian ahlul ilmi berkata tentang penafsiran hadits ini, maknanya tingkatan hamparan-hamparan dan jarak masing-masing tingkatan itu seperti antara langit dan bumi."
            },
            {
                "number": 2397,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَذُكِرَ لَهُ سِدْرَةُ الْمُنْتَهَى قَالَ يَسِيرُ الرَّاكِبُ فِي ظِلِّ الْفَنَنِ مِنْهَا مِائَةَ سَنَةٍ أَوْ يَسْتَظِلُّ بِظِلِّهَا مِائَةُ رَاكِبٍ شَكَّ يَحْيَى فِيهَا فِرَاشُ الذَّهَبِ كَأَنَّ ثَمَرَهَا الْقِلَالُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah bercerita kepada kami [Yunus bin Bukair] dari [Muhammad bin Ishaq] dari [Yahya bin 'Abbad bin Abdullah bin Az Zubair] dari [bapaknya] dari [Asma' binti Abu Bakar] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda ketika disebutkan kepadanya Sidrotul Muntaha beliau bersabda: \"Seorang pengendara berjalan di bawah naungan dahan pohonnya selama seratus tahun atau seratus orang pengendara bernaung di bawahnya ---(Yahya ragu) kepastian redaksinya-yang dalam naungan itu sarat dengan anai anai dari emas, buahnya seperti tempayan.\" Abu Isa berkata: Hadits ini hasan shahih gharib."
            },
            {
                "number": 2398,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ عَنْ أَبِيهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا الْكَوْثَرُ قَالَ ذَاكَ نَهْرٌ أَعْطَانِيهِ اللَّهُ يَعْنِي فِي الْجَنَّةِ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِ فِيهَا طَيْرٌ أَعْنَاقُهَا كَأَعْنَاقِ الْجُزُرِ قَالَ عُمَرُ إِنَّ هَذِهِ لَنَاعِمَةٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَتُهَا أَحْسَنُ مِنْهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ هُوَ ابْنُ أَخِي ابْنِ شِهَابٍ الزُّهْرِيِّ وَعَبْدُ اللَّهِ بْنُ مُسْلِمٍ قَدْ رَوَى عَنْ ابْنِ عُمَرَ وَأَنَسِ بْنِ مَالِكٍ",
                "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah mengkhabarkan kepada kami [Abdullah bin Maslamah] dari [Muhammad bin Abdullah bin Muslim] dari [bapaknya] dari [Anas bin Malik] berkata: Suatu ketika Rasulullah Shallallahu 'alaihi wa Salam ditanya: Apa artinya KAUTSAR? beliau menjawab: Itu adalah sungai yang Allah berikan kepadaku, yaitu di surga, warnanya lebih putih dari air susu dan rasanya lebih manis dari madu, di dalamnya ada burung yang lehernya seperti leher onta.\" Umar berkata: Sesungguhnya ini adalah benar benar kenikmatan, Rasulullah Shallallahu 'alaihi wa Salam bersabda: Aku telah memakan yang lebih baik darinya.\" Abu Isa berkata: Hadits ini hasan gharib, adapun Muhammad bin Abdullah bin Muslim dia adalah anak saudara Ibnu Syihab Az Zuhri, dan Abdullah bin Muslim meriwayatkan dari Ibnu Umar dan Anas bin Malik."
            },
            {
                "number": 2399,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ قَالَ أَخْبَرَنَا عَاصِمُ بْنُ عَلِيٍّ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ هَلْ فِي الْجَنَّةِ مِنْ خَيْلٍ قَالَ إِنْ اللَّهُ أَدْخَلَكَ الْجَنَّةَ فَلَا تَشَاءُ أَنْ تُحْمَلَ فِيهَا عَلَى فَرَسٍ مِنْ يَاقُوتَةٍ حَمْرَاءَ يَطِيرُ بِكَ فِي الْجَنَّةِ حَيْثُ شِئْتَ قَالَ وَسَأَلَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَلْ فِي الْجَنَّةِ مِنْ إِبِلٍ قَالَ فَلَمْ يَقُلْ لَهُ مِثْلَ مَا قَالَ لِصَاحِبِهِ قَالَ إِنْ يُدْخِلْكَ اللَّهُ الْجَنَّةَ يَكُنْ لَكَ فِيهَا مَا اشْتَهَتْ نَفْسُكَ وَلَذَّتْ عَيْنُكَحَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ وَهَذَا أَصَحُّ مِنْ حَدِيثِ الْمَسْعُودِيِّ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] berkata: Telah mengkhabarkan kepada kami ['Ashim bin Ali] telah menceritakan kepada kami [Al Mas'udi] dari ['Alqamah bin Murtsid] dari [Sulaiman bin Buraidah] dari [ayahnya], seseorang bertanya kepada Rasulullah Shallallahu 'alaihi wa Salam: Wahai Rasulullah, apakah di surga ada kuda? Beliau menjawab: Bila Allah memasukkanmu ke surga, kau akan dibawa di atas kuda dari permata merah di surga yang membawamu terbang di surga semaumu.\" Orang lain bertanya pada beliau: Wahai Rasulullah, apakah di surga ada unta? Beliau tidak menjawab seperti yang dikatakan kepada temannya, beliau bersabda: \"Bila Allah memasukkanmu ke surga, didalamnya ada segala yang diinginkan oleh jiwamu dan dipandang nikmat oleh matamu.\" Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] dari [Sufyan] dari ['Alqamah bin Murtsid] dari [Abdurrahman bin Sabith] dari nabi Shallallahu 'alaihi wa Salam sepertinya dengan maknanya dan ini lebih shahih dari hadits Al Mas'udi."
            },
            {
                "number": 2400,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ سَمُرَةَ الْأَحْمَسِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ وَاصِلٍ هُوَ ابْنُ السَّائِبِ عَنْ أَبِي سَوْرَةَ عَنْ أَبِي أَيُّوبَ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ الْخَيْلَ أَفِي الْجَنَّةِ خَيْلٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ أُدْخِلْتَ الْجَنَّةَ أُتِيتَ بِفَرَسٍ مِنْ يَاقُوتَةٍ لَهُ جَنَاحَانِ فَحُمِلْتَ عَلَيْهِ ثُمَّ طَارَ بِكَ حَيْثُ شِئْتَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ وَلَا نَعْرِفُهُ مِنْ حَدِيثِ أَبِي أَيُّوبَ إِلَّا مِنْ هَذَا الْوَجْهِ وَأَبُو سَوْرَةَ هُوَ ابْنُ أَخِي أَبِي أَيُّوبَ يُضَعَّفُ فِي الْحَدِيثِ ضَعَّفَهُ يَحْيَى بْنُ مَعِينٍ جِدًّا قَالَ و سَمِعْت مُحَمَّدَ بْنَ إِسْمَعِيلَ يَقُولُ أَبُو سَوْرَةَ هَذَا مُنْكَرُ الْحَدِيثِ يَرْوِي مَنَاكِيرَ عَنْ أَبِي أَيُّوبَ لَا يُتَابَعُ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il bin Samurah Al Ahmasi] telah bercerita kepada kami [Abu Mu'awiyah] dari [Washil bin As Sa'ib] dari [Abu Saurah] dari [Abu Ayyub] berkata: Seorang badui datang kepada Nabi Shallallahu 'alaihi wa Salam lalu berkata: Wahai Rasulullah sesungguhnya aku menyukai kuda apakah di syurga ada kuda? Rasulullah Shallallahu 'alaihi wa Salam menjawab: Jika kamu di masukkan ke dalam syurga maka kamu akan diberi kuda dari yaqut yang mempunyai dua sayap dan kamu akan dibawa kemudian terbang kemana saja yang kamu sukai.\" Abu Isa berkata: Hadits ini sanadnya tidak sedemikian kuat, kami tidak mengetahuinya dari hadits Abu Ayyub kecuali dari jalur sanad ini, adapun Abu Saurah dia adalah anak saudaranya Abu Ayyub, dia dilemahkan dalam masalah hadits, Yahya bin Ma'in telah melemahkannya sama sekali. Dia berkata: Aku mendengar Muhammad bin Isma'il berkata: Abu Saurah ini haditsnya munkar, dia banyak meriwayatkan hadits hadits munkar dari Abu Ayyub dan tidak ada yang mengikuti riwatatnya."
            },
            {
                "number": 2401,
                "arab": "حَدَّثَنَا أَبُو هُرَيْرَةَ مُحَمَّدُ بْنُ فِرَاسٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عِمْرَانُ أَبُو الْعَوَّامِ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَدْخُلُ أَهْلُ الْجَنَّةِ الْجَنَّةَ جُرْدًا مُرْدًا مُكَحَّلِينَ أَبْنَاءَ ثَلَاثِينَ أَوْ ثَلَاثٍ وَثَلَاثِينَ سَنَةًقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَبَعْضُ أَصْحَابِ قَتَادَةَ رَوَوْا هَذَا عَنْ قَتَادَةَ مُرْسَلًا وَلَمْ يُسْنِدُوهُ",
                "id": "Telah menceritakan kepada kami [Abu Hurairah Muhammad bin Firas Al Bashri] telah menceritakan kepada kami [Abu Dawud] telah menceritakan kepada kami ['Imran Abu Al 'Awwam] dari [Qatadah] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dari [Mu'adz bin Jabal] nabi Shallallahu 'alaihi wa Salam bersabda: \"Penghuni surga masuk surga dalam keadaan tidak berbulu, tidak berjenggot, mengenakan calak mata, berumur tigapuluh atau tigapuluh tiga tahun.\" Berkata Abu Isa: Hadits ini hasan gharib dan sebagian sahabat Qatadah meriwayatkan hadits ini dari Qatadah secara mursal, mereka tidak menyandarkannya."
            },
            {
                "number": 2402,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الطَّحَّانُ الْكُوفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ ضِرَارِ بْنِ مُرَّةَ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْلُ الْجَنَّةِ عِشْرُونَ وَمِائَةُ صَفٍّ ثَمَانُونَ مِنْهَا مِنْ هَذِهِ الْأُمَّةِ وَأَرْبَعُونَ مِنْ سَائِرِ الْأُمَمِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَمِنْهُمْ مَنْ قَالَ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ وَحَدِيثُ أَبِي سِنَانٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ حَسَنٌ وَأَبُو سِنَانٍ اسْمُهُ ضِرَارُ بْنُ مُرَّةَ وَأَبُو سِنَانٍ الشَّيْبَانِيُّ اسْمُهُ سَعِيدُ بْنُ سِنَانٍ وَهُوَ بَصْرِيٌّ وَأَبُو سِنَانٍ الشَّامِيُّ اسْمُهُ عِيسَى بْنُ سِنَانٍ هُوَ الْقَسْمَلِيُّ",
                "id": "Telah menceritakan kepada kami [Husain bin Yazid Ath Thahhan Al Kufi] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Dlirar bin Murrah] dari [Muharib bin Ditsar] dari [Ibnu Buraidah] dari [ayahnya] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Penghuni surga itu sebanyak seratus duapuluh baris, delapan puluh diantaranya dari ummat ini dan empatpuluhnya dari seluruh ummat.\" Berkata Abu Isa: Hadits ini hasan. Hadits ini diriwayatkan dari ['Alqamah bin Murtsid] dari [Sulaiman bin Buraidah] dari nabi Shallallahu 'alaihi wa Salam secara mursal. Diantara mereka ada yang berkata: Dari Sulaiman bin Buraidah dari ayahnya dan hadits Abu Sinan bin Ditsar adalah hadits hasan, namanya Dlirar bin Murrah dan Abu Sinan Asy Syaibani namanya Sa'id bin Sinan, ia orang Bashrah, Abu Sinan Asy Syami namanya 'Isa bin Sinan adalah orang Qasmali."
            },
            {
                "number": 2403,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَنْبَأَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَال سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قُبَّةٍ نَحْوًا مِنْ أَرْبَعِينَ فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ قَالُوا نَعَمْ قَالَ أَتَرْضَوْنَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ قَالُوا نَعَمْ قَالَ أَتَرْضَوْنَ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ إِنَّ الْجَنَّةَ لَا يَدْخُلُهَا إِلَّا نَفْسٌ مُسْلِمَةٌ مَا أَنْتُمْ فِي الشِّرْكِ إِلَّا كَالشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الْأَسْوَدِ أَوْ كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ الثَّوْرِ الْأَحْمَرِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَأَبِي سَعِيدٍ الْخُدْرِيِّ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud] telah memberitakan kepada kami [Syu'bah] dari [Abu Ishaq] berkata: Aku mendengar [Amru bin Maimun] menceritakan dari [Abdullah bin Mas'ud] berkata: Kami bersama nabi Shallallahu 'alaihi wa Salam di kubah sekitar empat puluh orang lalu Rasulullah Shallallahu 'alaihi wa Salam bertanya kepada kami: \"Maukah kalian menjadi seperempat penghuni surga?\" mereka menjawab: Ya. Beliau bertanya: \"Maukah kalian menjadi sepertiga penghuni surga?\" mereka menjawab: Ya.\"Maukah kalian menjadi separuh penghuni surga, sesungguhnya surga hanya dimasuki oleh jiwa yang muslim, tidaklah kalian dalam kesyirikan kecuali seperti bulu putih di kulit kerbau atau seperti bulu hitam di kulit kerbau merah.\" Berkata Abu Isa: Hadits ini hasan shahih. Dalam hal ini ada hadits serupa dari 'Imran bin Hushain dan Abu Sa'id Al Khudri."
            },
            {
                "number": 2404,
                "arab": "حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ الْبَغْدَادِيُّ حَدَّثَنَا مَعْنُ بْنُ عِيسَى الْقَزَّازُ عَنْ خَالِدِ بْنِ أَبِي بَكْرٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَابُ أُمَّتِي الَّذِي يَدْخُلُونَ مِنْهُ الْجَنَّةَ عَرْضُهُ مَسِيرَةُ الرَّاكِبِ الْمُجَوِّدِ ثَلَاثًا ثُمَّ إِنَّهُمْ لَيُضْغَطُونَ عَلَيْهِ حَتَّى تَكَادُ مَنَاكِبُهُمْ تَزُولُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ قَالَ سَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ و قَالَ لِخَالِدِ بْنِ أَبِي بَكْرٍ مَنَاكِيرُ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Al Fadlal bin Ash Shabbah Al Baghdadi] telah bercerita kepada kami [Ma'an bin 'Isa Al Fazari] dari [Khalid bin Abu Bakar] dari [Salim bin Abdullah] dari [bapaknya] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Pintu masuk masuk surga ummatku luasnya seperti perjalanan seorang penunggang kuda yang cakap selama tiga, kemudian mereka akan berdesak desakan memasukinya sampai hampir hampir punggung mereka hilang.\" Abu Isa berkata: Hadits ini gharib, dia berkata: Aku bertanya kepada Muhammad tentang hadits ini namun dia tidak mengetahuinya dan berkata: Khalid bin Abu Bakar mempunyai hadits-hadits munkar yang dia riwayatkan dari Salim bin Abdullah."
            },
            {
                "number": 2405,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبِ بْنِ أَبِي الْعِشْرِينَ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا حَسَّانُ بْنُ عَطِيَّةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ لَقِيَ أَبَا هُرَيْرَةَفَقَالَ أَبُو هُرَيْرَةَ أَسْأَلُ اللَّهَ أَنْ يَجْمَعَ بَيْنِي وَبَيْنَكَ فِي سُوقِ الْجَنَّةِ فَقَالَ سَعِيدٌ أَفِيهَا سُوقٌ قَالَ نَعَمْ أَخْبَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ أَهْلَ الْجَنَّةِ إِذَا دَخَلُوهَا نَزَلُوا فِيهَا بِفَضْلِ أَعْمَالِهِمْ ثُمَّ يُؤْذَنُ فِي مِقْدَارِ يَوْمِ الْجُمُعَةِ مِنْ أَيَّامِ الدُّنْيَا فَيَزُورُونَ رَبَّهُمْ وَيُبْرِزُ لَهُمْ عَرْشَهُ وَيَتَبَدَّى لَهُمْ فِي رَوْضَةٍ مِنْ رِيَاضِ الْجَنَّةِ فَتُوضَعُ لَهُمْ مَنَابِرُ مِنْ نُورٍ وَمَنَابِرُ مِنْ لُؤْلُؤٍ وَمَنَابِرُ مِنْ يَاقُوتٍ وَمَنَابِرُ مِنْ زَبَرْجَدٍ وَمَنَابِرُ مِنْ ذَهَبٍ وَمَنَابِرُ مِنْ فِضَّةٍ وَيَجْلِسُ أَدْنَاهُمْ وَمَا فِيهِمْ مِنْ دَنِيٍّ عَلَى كُثْبَانِ الْمِسْكِ وَالْكَافُورِ وَمَا يَرَوْنَ أَنَّ أَصْحَابَ الْكَرَاسِيِّ بِأَفْضَلَ مِنْهُمْ مَجْلِسًا قَالَ أَبُو هُرَيْرَةَ قُلْتُ يَا رَسُولَ اللَّهِ وَهَلْ نَرَى رَبَّنَا قَالَ نَعَمْ قَالَ هَلْ تَتَمَارَوْنَ فِي رُؤْيَةِ الشَّمْسِ وَالْقَمَرِ لَيْلَةَ الْبَدْرِ قُلْنَا لَا قَالَ كَذَلِكَ لَا تُمَارَوْنَ فِي رُؤْيَةِ رَبِّكُمْ وَلَا يَبْقَى فِي ذَلِكَ الْمَجْلِسِ رَجُلٌ إِلَّا حَاضَرَهُ اللَّهُ مُحَاضَرَةً حَتَّى يَقُولَ لِلرَّجُلِ مِنْهُمْ يَا فُلَانُ بْنَ فُلَانٍ أَتَذْكُرُ يَوْمَ قُلْتَ كَذَا وَكَذَا فَيُذَكَّرُ بِبَعْضِ غَدْرَاتِهِ فِي الدُّنْيَا فَيَقُولُ يَا رَبِّ أَفَلَمْ تَغْفِرْ لِي فَيَقُولُ بَلَى فَسَعَةُ مَغْفِرَتِي بَلَغَتْ بِكَ مَنْزِلَتَكَ هَذِهِ فَبَيْنَمَا هُمْ عَلَى ذَلِكَ غَشِيَتْهُمْ سَحَابَةٌ مِنْ فَوْقِهِمْ فَأَمْطَرَتْ عَلَيْهِمْ طِيبًا لَمْ يَجِدُوا مِثْلَ رِيحِهِ شَيْئًا قَطُّ وَيَقُولُ رَبُّنَا تَبَارَكَ وَتَعَالَى قُومُوا إِلَى مَا أَعْدَدْتُ لَكُمْ مِنْ الْكَرَامَةِ فَخُذُوا مَا اشْتَهَيْتُمْ فَنَأْتِي سُوقًا قَدْ حَفَّتْ بِهِ الْمَلَائِكَةُ فِيهِ مَا لَمْ تَنْظُرْ الْعُيُونُ إِلَى مِثْلِهِ وَلَمْ تَسْمَعْ الْآذَانُ وَلَمْ يَخْطُرْ عَلَى الْقُلُوبِ فَيُحْمَلُ لَنَا مَا اشْتَهَيْنَا لَيْسَ يُبَاعُ فِيهَا وَلَا يُشْتَرَى وَفِي ذَلِكَ السُّوقِ يَلْقَى أَهْلُ الْجَنَّةِ بَعْضُهُمْ بَعْضًا قَالَ فَيُقْبِلُ الرَّجُلُ ذُو الْمَنْزِلَةِ الْمُرْتَفِعَةِ فَيَلْقَى مَنْ هُوَ دُونَهُ وَمَا فِيهِمْ دَنِيٌّ فَيَرُوعُهُ مَا يَرَى عَلَيْهِ مِنْ اللِّبَاسِ فَمَا يَنْقَضِي آخِرُ حَدِيثِهِ حَتَّى يَتَخَيَّلَ إِلَيْهِ مَا هُوَ أَحْسَنُ مِنْهُ وَذَلِكَ أَنَّهُ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَحْزَنَ فِيهَا ثُمَّ نَنْصَرِفُ إِلَى مَنَازِلِنَا فَيَتَلَقَّانَا أَزْوَاجُنَا فَيَقُلْنَ مَرْحَبًا وَأَهْلًا لَقَدْ جِئْتَ وَإِنَّ بِكَ مِنْ الْجَمَالِ أَفْضَلَ مِمَّا فَارَقْتَنَا عَلَيْهِ فَيَقُولُ إِنَّا جَالَسْنَا الْيَوْمَ رَبَّنَا الْجَبَّارَ وَيَحِقُّنَا أَنْ نَنْقَلِبَ بِمِثْلِ مَا انْقَلَبْنَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَقَدْ رَوَى سُوَيْدُ بْنُ عَمْرٍو عَنْ الْأَوْزَاعِيِّ شَيْئًا مِنْ هَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Abdul Hamid bin Habib bin Abu Al 'Isyrin] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Hassan bin 'Athiyah] dari [Sa'id bin Al Musayyib] ia bertemu [Abu Hurairah] lalu Abu Hurairah berkata: Aku meminta kepada Allah semoga menyatukanku denganmu di pasar surga. Sa'id bertanya: Apa disana ada pasar? Abu Hurairah menjawab: Ya, telah menghabarkan kepadaku Rasulullah Shallallahu 'alaihi wa Salam, bahwa penghuni surga bila masuk surga, mereka tinggal di sana karena keutamaan amal-amal mereka, kemudian diizinkan seukuran hari jum'at dari hari-hari dunia lalu mereka mengunjungi Rabb mereka kemudian Rabb menampakkan 'arsyNya pada mereka, salah satu taman surga nampak pada mereka kemudian mimbar-mimbar dari cahaya, mimbar-mimbar dari mutiara, mimbar-mimbar dari yaqut, mimbar-mimbar dari permata, mimbar-mimbar dari emas, mimbar-mimbar dari perak diletakkan untuk mereka, yang paling rendah di antara mereka beserta tingkat kerendahannya duduk di atas gundukan tanah kesturi dan kafur dan mereka beranggapan tempat duduk para pemilik kursi tidak lebih baik dari mereka.\" Abu Hurairah bertanya: Wahai Rasulullah, apakah kita akan melihat Rabb kita? Beliau menjawab: \"Ya.\" Rasulullah Shallallahu 'alaihi wa Salam bertanya: \"Apakah kalian kesulitan saat melihat matahari dan bulan di malam purnama?\" Kami menjawab: Tidak. Beliau bersabda: \"Seperti itu juga kalian tidak kesulitan dalam melihat Rabb kalian. Dan dimajlis itu tidaklah ada seorang pun melainkan Allah mendatanginya dengan sebenarnya hingga Ia bertanya kepada seseorang dari mereka: Hai fulan bin fulan, ingatkah kau saat berkata begini dan begini? Allah mengingatkan sebagian kemaksiatan-kemaksiatannya didunia. Orang itu berkata: Wahai Rabb, apa Kau tidak mengampuniku? Allah menjawab: Ya, luasnya ampunanku sampai pada tempatmu ini. Saat mereka seperti, mega menaungi mereka di atas mereka lalu turun hujan minyak wangi yang baunya sama sekali belum pernah mereka temukan, Rabb kita Tabaaraka wa Ta'ala berfirman: Berdirilah menuju kemuliaan yang telah Aku persiapkan untuk kalian lalu ambillah yang kalian inginkan. Lalu kami mendatangi pasar yang diliputi oleh malaikat, di dalamnya ada yang belum pernah dilihat mata sepertinya, belum pernah terdengar oleh telinga dan tidak terlintas dihati, lalu apa yang kami inginkan dibawakan untuk kami, di sana tidak dijual dan tidak dibeli. Di pasar itu, para penghuni surga saling bertemu satu sama lain.\" Beliau meneruskan: \"Seseorang yang tinggal di flat (derajat tinggi) surga lantas datang lalu bertemu dengan orang yang tingkatnya berada dibawahnya beserta kerendahan yang ada padanya lalu ia kaget terhadap pakaian yang diperlihatkan padanya, akhir kata-katanya belum juga habis hingga ia menghayal yang lebih baik darinya, karenanya tidak layak bagi siapa pun untuk bersedih di surga. Setelah itu kami pulang ke rumah-rumah kami, kami disambut oleh istri-istri kami, mereka berkata: Selamat datang, kau datang dengan keindahan yang lebih baik dari saat kau tinggalkan kami. Ia berkata: Sesungguhnya kami menemani Rabb kami Al Jabbar hari ini, laik bagi kami untuk pulang seperti ini.\" Berkata Abu Isa: Hadits ini hasan gharib, kami hanya mengetahuinya dari jalur sanad ini. [Suwaid bin Amru] meriwayatkan sebagaian hadits ini dari [Al Auza'i]."
            },
            {
                "number": 2406,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ وَهَنَّادٌ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجَنَّةِ لَسُوقًا مَا فِيهَا شِرَاءٌ وَلَا بَيْعٌ إِلَّا الصُّوَرَ مِنْ الرِّجَالِ وَالنِّسَاءِ فَإِذَا اشْتَهَى الرَّجُلُ صُورَةً دَخَلَ فِيهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] dan [Hannad] berkata: telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'ad] dari [Ali] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada pasar, tidak ada jual belinya kecuali foto kaum lelaki dan perempuan, bila seorang lelaki berselera terhadap foto itu, ia langsung bisa masuk ke menemuinya.\" Berkata Abu Isa: Hadits ini gharib."
            },
            {
                "number": 2407,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ قَالَكُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ فَقَالَ إِنَّكُمْ سَتُعْرَضُونَ عَلَى رَبِّكُمْ فَتَرَوْنَهُ كَمَا تَرَوْنَ هَذَا الْقَمَرَ لَا تُضَامُونَ فِي رُؤْيَتِهِ فَإِنْ اسْتَطَعْتُمْ أَنْ لَا تُغْلَبُوا عَلَى صَلَاةٍ قَبْلَ طُلُوعِ الشَّمْسِ وَصَلَاةٍ قَبْلَ غُرُوبِهَا فَافْعَلُوا ثُمَّ قَرَأَ فَ{ سَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ }قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Waki'] dari [Isma'il bin Abu Khalid] dari [Qais bin Abu Hazim] dari [Jarir bin Abdullah Al Bajali] berkata: Kami dudu di dekat nabi Shallallahu 'alaihi wa Salam, beliau melihat rembulan di malam purnama lalu bersabda: \"Sesungguhnya kalian akan di hadapkan kepada Rabb kalian, kalian melihatNya seperti kalian melihat rembulan ini, kalian tidak berdesakan dalam melihatNya, karena itu bila kalian mampu untuk tidak dikalahkan sholat sebelum terbitnya matahari dan sholat sebelum terbenamnya matahari, lakukanlah.\" Setelah itu beliau membaca: \"Maka mahasucikanlah Rabbmu sebelum terbitnya matahari dan sebelum tenggelamnya (matahari).\" (QS. Qaf 39), Abu Isa berkata: Hadits ini hasan shahih. "
            },
            {
                "number": 2408,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ{ لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ }قَالَ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ نَادَى مُنَادٍ إِنَّ لَكُمْ عِنْدَ اللَّهِ مَوْعِدًا قَالُوا أَلَمْ يُبَيِّضْ وُجُوهَنَا وَيُنَجِّنَا مِنْ النَّارِ وَيُدْخِلْنَا الْجَنَّةَ قَالُوا بَلَى قَالَ فَيَنْكَشِفُ الْحِجَابُ قَالَ فَوَاللَّهِ مَا أَعْطَاهُمْ شَيْئًا أَحَبَّ إِلَيْهِمْ مِنْ النَّظَرِ إِلَيْهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا أَسْنَدَهُ حَمَّادُ بْنُ سَلَمَةَ وَرَفَعَهُ وَرَوَى سُلَيْمَانُ بْنُ الْمُغِيرَةِ وَحَمَّادُ بْنُ زَيْدٍ هَذَا الْحَدِيثَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَوْلَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit Al Bunani] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] dari nabi Shallallahu 'alaihi wa Salam tentang firmanNya: \"Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya.\" (Yuunus: 26) beliau bersabda: \"Bila penghuni surga masuk surga, ada yang menyeru: Sesungguhnya kalian memiliki janji disisi Allah. Mereka berkata: Bukankah Ia telah memutihkan wajah-wajah kami, menyelamatkan kami dari neraka dan memasukkan kami ke surga? Mereka menjawab: Benar. Lalu hijab di buka.\" Beliau bersabda: \"Demi Allah, Ia tidak memberi sesuatu pun kepada mereka yang lebih mereka sukai daripada pemberian-Nya agar mereka bisa melihat-Nya.\" Abu Isa berkata: Hadits ini diisnadkan dan dimarfu'kan oleh Hammad bin Salamah. Sulaiman bin Al Mughirah dan Hammad bin Zaid meriwayatkan sabda Rasulullah shallallahu 'alaihi wasallam dalam hadits ini dari Tsabit Al Bannani dari Abdurrahman bin Abu Laila."
            },
            {
                "number": 2409,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنِي شَبَابَةُ عَنْ إِسْرَائِيلَ عَنْ ثُوَيْرٍ قَال سَمِعْتُ ابْنَ عُمَرَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً لَمَنْ يَنْظُرُ إِلَى جِنَانِهِ وَأَزْوَاجِهِ وَنَعِيمِهِ وَخَدَمِهِ وَسُرُرِهِ مَسِيرَةَ أَلْفِ سَنَةٍ وَأَكْرَمَهُمْ عَلَى اللَّهِ مَنْ يَنْظُرُ إِلَى وَجْهِهِ غَدْوَةً وَعَشِيَّةً ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ إِلَى رَبِّهَا نَاظِرَةٌ }قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ إِسْرَائِيلَ عَنْ ثُوَيْرٍ عَنْ ابْنِ عُمَرَ مَرْفُوعًا وَرَوَاهُ عَبْدُ الْمَلِكِ بْنُ أَبْجَرَ عَنْ ثُوَيْرٍ عَنْ ابْنِ عُمَرَ مَوْقُوفًا وَرَوَى عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ ثُوَيْرٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَوْلَهُ وَلَمْ يَرْفَعْهُ حَدَّثَنَا بِذَلِكَ أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ ثُوَيْرٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ نَحْوَهُ وَلَمْ يَرْفَعْهُ",
                "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah mengkhabarkan kepadaku [Syababah] dari [Isra`il] dari [Tsuwair] berkata: Aku mendengar [Ibnu Umar] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya tingkatan penghuni surga terendah adalah orang yang memandang taman, istri-istri, kenikmatan, pelayan dan tempat tidurnya sejauh perjalanan seribu tahun dan yang paling mulia dari mereka adalah yang melihat wajahnya dipagi dan sore hari.\" Selanjutnya beliau membaca: \"Wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri. Kepada Tuhan-Nyalah mereka Melihat.\" (Al Qiyaamah: 22-23) Abu Isa berkata: Hadits ini diriwayatkan melalui sanad lain dari Isra`il dari Tsuwair dari Ibnu Umar secara marfu' dan diriwayatkan oleh [Abdul Malik bin Abjar] dari [Tsuwair] dari [Ibnu Umar] secara mauquf. Diriwayatkan oleh [ubaidhullah Al Asyja'i] dari [Sufyan] dari [Tsuwair] dari [Mujahid] dari [Ibnu Umar] tapi ia tidak memarfu'kannya. Telah menceritakan kepada kami seperti itu [Abu Kuraib Muhammad bin Al Ala] telah menceritakan kepada kami [ubaidhullah Al Asyja'i] dari [Sufyan] dari [Tsuwair] dari [Mujahid] dari [Ibnu Umar] sepertinya tapi ia tidak memarfu'kannya."
            },
            {
                "number": 2410,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ الْكُوفِيُّ حَدَّثَنَا جَابِرُ بْنُ نُوحٍ الْحِمَّانِيُّ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُضَامُونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَتُضَامُونَ فِي رُؤْيَةِ الشَّمْسِ قَالُوا لَا قَالَ فَإِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ الْقَمَرَ لَيْلَةَ الْبَدْرِ لَا تُضَامُونَ فِي رُؤْيَتِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَهَكَذَا رَوَى يَحْيَى بْنُ عِيسَى الرَّمْلِيُّ وَغَيْرُ وَاحِدٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَى عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَدِيثُ ابْنِ إِدْرِيسَ عَنْ الْأَعْمَشِ غَيْرُ مَحْفُوظٍ وَحَدِيثُ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَحُّ وَهَكَذَا رَوَاهُ سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ رُوِيَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ هَذَا الْوَجْهِ مِثْلُ هَذَا الْحَدِيثِ وَهُوَ حَدِيثٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Tharif Al Kufi] telah menceritakan kepada kami [Jabir bin Nuh Al Himmanni] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian kesulitan saat melihat rembulan di malam purnama dan (apakah) kalian kesulitan melihat matahari?\" mereka menjawab: Tidak. beliau bersabda: \"Sesungguhnya kalian akan melihat Rabb kalian seperti kalian melihat rembulan di malam purnama, kalian tidak kesulitan saat melihatNya.\" Abu Isa berkata: Hadits ini hasan shahih gharib. Dan seperti ini [Yahya bin Isa Ar Ramli] dan lainnya meriwayatkan dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam. Dan [Abdullah bin Idris] meriwayatkan dari [A'masy] dari [Abu Shalih] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam. Hadits Ibnu Idris dari A'masy tidak terjaga dan hadits Abu Shalih dari Abu Hurairah dari nabi Shallallahu 'alaihi wa Salam lebih shahih. Demikian pula yang diriwayatkan oleh [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam. Abu Sa'id meriwayatkan dari nabi Shallallahu 'alaihi wa Salam melalui sanad lain seperti hadits ini dan hadits itu shahih."
            },
            {
                "number": 2411,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يَقُولُ لِأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ فَيَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ مَا لَنَا لَا نَرْضَى وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ فَيَقُولُ أَنَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ قَالُوا أَيُّ شَيْءٍ أَفْضَلُ مِنْ ذَلِكَ قَالَ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلَا أَسْخَطُ عَلَيْكُمْ أَبَدًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Malik bin Anas] dari [Zaid bin Aslam] dari [Atho` bin Yasar] dari [Abu Sa'id Al Khudri] bersabda: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah berfirman kepada penghuni surga: Wahai penghuni surga! Mereka menjawab: Baik, Rabb kami. Ia bertanya: Apa kalian ridha? Mereka menjawab: Kenapa kami tidak ridha sementara Engkau telah memberi kami sesuatu yang tidak Kau berikan kepada seorang pun dari maklukMu. Ia berfirman: Aku memberi kalian yang lebih baik darinya. Mereka bertanya: Apa yang lebih baik darinya? Ia menjawab: Aku menghalalkan keridhanKu untuk kalian, Aku tidak akan murka kepada kalian selamanya.\" Abu Isa berkata: Hadits ini hasan shahih."
            },
            {
                "number": 2412,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ هِلَالِ بْنِ عَلِيٍّ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ فِي الْغُرْفَةِ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ الشَّرْقِيَّ أَوْ الْكَوْكَبَ الْغَرْبِيَّ الْغَارِبَ فِي الْأُفُقِ وَالطَّالِعَ فِي تَفَاضُلِ الدَّرَجَاتِ فَقَالُوا يَا رَسُولَ اللَّهِ أُولَئِكَ النَّبِيُّونَ قَالَ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ وَأَقْوَامٌ آمَنُوا بِاللَّهِ وَرَسُولِهِ وَصَدَّقُوا الْمُرْسَلِينَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Fulaih bin Sulaiman] dari [Hilal bin Ali] dari [Atho` bin Yasar] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya penghuni surga saling melihat dalam kamar-kamar seperti mereka melihat bintang timur atau bintang barat dan bintang yang tinggi karena berbedaan derajat.\" Mereka bertanya: wahai Rasulullah, apakah mereka itu para nabi? Beliau menjawab: \"Benar, demi Dzat yang jiwaku berada ditanganNya, dan para kaum yang beriman kepada Allah dan membenarkan para rasul.\" Abu Isa berkata: Hadits ini hasan shahih."
            },
            {
                "number": 2413,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَجْمَعُ اللَّهُ النَّاسَ يَوْمَ الْقِيَامَةِ فِي صَعِيدٍ وَاحِدٍ ثُمَّ يَطَّلِعُ عَلَيْهِمْ رَبُّ الْعَالَمِينَ فَيَقُولُ أَلَا يَتْبَعُ كُلُّ إِنْسَانٍ مَا كَانُوا يَعْبُدُونَهُ فَيُمَثَّلُ لِصَاحِبِ الصَّلِيبِ صَلِيبُهُ وَلِصَاحِبِ التَّصَاوِيرِ تَصَاوِيرُهُ وَلِصَاحِبِ النَّارِ نَارُهُ فَيَتْبَعُونَ مَا كَانُوا يَعْبُدُونَ وَيَبْقَى الْمُسْلِمُونَ فَيَطَّلِعُ عَلَيْهِمْ رَبُّ الْعَالَمِينَ فَيَقُولُ أَلَا تَتَّبِعُونَ النَّاسَ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ نَعُوذُ بِاللَّهِ مِنْكَ اللَّهُ رَبُّنَا هَذَا مَكَانُنَا حَتَّى نَرَى رَبَّنَا وَهُوَ يَأْمُرُهُمْ وَيُثَبِّتُهُمْ ثُمَّ يَتَوَارَى ثُمَّ يَطَّلِعُ فَيَقُولُ أَلَا تَتَّبِعُونَ النَّاسَ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ نَعُوذُ بِاللَّهِ مِنْكَ اللَّهُ رَبُّنَا وَهَذَا مَكَانُنَا حَتَّى نَرَى رَبَّنَا وَهُوَ يَأْمُرُهُمْ وَيُثَبِّتُهُمْ قَالُوا وَهَلْ نَرَاهُ يَا رَسُولَ اللَّهِ قَالَ وَهَلْ تُضَارُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ قَالُوا لَا يَا رَسُولَ اللَّهِ قَالَ فَإِنَّكُمْ لَا تُضَارُّونَ فِي رُؤْيَتِهِ تِلْكَ السَّاعَةَ ثُمَّ يَتَوَارَى ثُمَّ يَطَّلِعُ فَيُعَرِّفُهُمْ نَفْسَهُ ثُمَّ يَقُولُ أَنَا رَبُّكُمْ فَاتَّبِعُونِي فَيَقُومُ الْمُسْلِمُونَ وَيُوضَعُ الصِّرَاطُ فَيَمُرُّونَ عَلَيْهِ مِثْلَ جِيَادِ الْخَيْلِ وَالرِّكَابِ وَقَوْلُهُمْ عَلَيْهِ سَلِّمْ سَلِّمْ وَيَبْقَى أَهْلُ النَّارِ فَيُطْرَحُ مِنْهُمْ فِيهَا فَوْجٌ ثُمَّ يُقَالُ هَلْ امْتَلَأْتِ فَتَقُولُ هَلْ مِنْ مَزِيدٍ ثُمَّ يُطْرَحُ فِيهَا فَوْجٌ فَيُقَالُ هَلْ امْتَلَأْتِ فَتَقُولُ هَلْ مِنْ مَزِيدٍ حَتَّى إِذَا أُوعِبُوا فِيهَا وَضَعَ الرَّحْمَنُ قَدَمَهُ فِيهَا وَأَزْوَى بَعْضَهَا إِلَى بَعْضٍ ثُمَّ قَالَ قَطْ قَالَتْ قَطْ قَطْ فَإِذَا أَدْخَلَ اللَّهُ أَهْلَ الْجَنَّةِ الْجَنَّةَ وَأَهْلَ النَّارِ النَّارَ قَالَ أُتِيَ بِالْمَوْتِ مُلَبَّبًا فَيُوقَفُ عَلَى السُّورِ بَيْنَ أَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ فَيَطَّلِعُونَ خَائِفِينَ ثُمَّ يُقَالُ يَا أَهْلَ النَّارِ فَيَطَّلِعُونَ مُسْتَبْشِرِينَ يَرْجُونَ الشَّفَاعَةَ فَيُقَالُ لِأَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ هَلْ تَعْرِفُونَ هَذَا فَيَقُولُونَ هَؤُلَاءِ وَهَؤُلَاءِ قَدْ عَرَفْنَاهُ هُوَ الْمَوْتُ الَّذِي وُكِّلَ بِنَا فَيُضْجَعُ فَيُذْبَحُ ذَبْحًا عَلَى السُّورِ الَّذِي بَيْنَ الْجَنَّةِ وَالنَّارِ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ خُلُودٌ لَا مَوْتَ وَيَا أَهْلَ النَّارِ خُلُودٌ لَا مَوْتَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِوَايَاتٌ كَثِيرَةٌ مِثْلُ هَذَا مَا يُذْكَرُ فِيهِ أَمْرُ الرُّؤْيَةِ أَنَّ النَّاسَ يَرَوْنَ رَبَّهُمْ وَذِكْرُ الْقَدَمِ وَمَا أَشْبَهَ هَذِهِ الْأَشْيَاءَ وَالْمَذْهَبُ فِي هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ الْأَئِمَّةِ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَابْنِ الْمُبَارَكِ وَابْنِ عُيَيْنَةَ وَوَكِيعٍ وَغَيْرِهِمْ أَنَّهُمْ رَوَوْا هَذِهِ الْأَشْيَاءَ ثُمَّ قَالُوا تُرْوَى هَذِهِ الْأَحَادِيثُ وَنُؤْمِنُ بِهَا وَلَا يُقَالُ كَيْفَ وَهَذَا الَّذِي اخْتَارَهُ أَهْلُ الْحَدِيثِ أَنْ تُرْوَى هَذِهِ الْأَشْيَاءُ كَمَا جَاءَتْ وَيُؤْمَنُ بِهَا وَلَا تُفَسَّرُ وَلَا تُتَوَهَّمُ وَلَا يُقَالُ كَيْفَ وَهَذَا أَمْرُ أَهْلِ الْعِلْمِ الَّذِي اخْتَارُوهُ وَذَهَبُوا إِلَيْهِ وَمَعْنَى قَوْلِهِ فِي الْحَدِيثِ فَيُعَرِّفُهُمْ نَفْسَهُ يَعْنِي يَتَجَلَّى لَهُمْ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al Ala bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah mengumpulkan manusia pada hari kiamat di satu tanah lapang kemudian Ia mendatangi mereka, ia berfirman: Ingat, setiap manusia mengikuti apa yang pernah disembahnya. Lalu penyembah salib diperlihatkan penjelmaan salibnya, penyembah patung diperlihatkan penjelmaan patungnya dan penyembah api diperlihatkan penjelmaan apinya lalu mereka mereka mengikuti yang pernah mereka sembah dan kaum muslimin tetap tinggal, setelah itu Rabb semesta alam mendatangi mereka, Ia bertanya: Apa kau tidak mengikuti mereka? Mereka berkata: Kami berlindung diri kepada Allah darimu, kami berlindung diri kepada Allah darimu, Rabb kami ini adalah tempat kami hingga kami melihat Rabb kami. Ia memerintah mereka dan meneguhkan mereka kemudian bersembunyi, setelah itu datang dan bertanya: Apa kau tidak mengikuti mereka? Mereka berkata: Kami berlindung diri pada Allah darimu, kami berlindung diri pada Allah darimu, Rabb kami ini adalah tempat kami hingga kami melihat Rabb kami. Ia memerintah mereka dan meneguhkan mereka.\" Mereka bertanya: Apakah kita melihatNya, wahai Rasulullah? beliau balik bertanya: \"Apakah kalian kesulitan saat melihat rembulan di malam purnama?\" mereka menjawab: Tidak, wahai Rasulullah. beliau bersabda: \"Sesungguhnya kalian tidaklah kesulitan melihatNya saat itu. Setelah itu Dia bersembunyi lalu muncul lalu Dia mengenalkan diriNya kepada mereka, IA berfirman: Aku Rabb kalian, ikutilah aku. Kaum muslimin berdiri, kemudian shirath di letakkan, mereka pun melintasinya seperti kuda-kuda terbaik dan pengendara, kata-kata mereka saat berada di atas shirat: Selamatkan, selamatkan. Setelah itu yang tersisa hanyalah penghuni neraka, di antara mereka ada segolongan besar dilemparkan ke neraka, setelah itu neraka di tanya: Apa kau sudah penuh? Neraka menjawab: Apa ada yang lain? Setelah itu yang tersisa penghuni neraka, di antara mereka ada segolongan besar di lemparkan ke neraka, setelah itu neraka ditanya: Apa kau sudah penuh? Neraka menjawab: Apa ada yang lain? Hingga setelah mereka semua di periksa, Allah Yang Maha Pemurah meletakkan kaki-Nya di neraka dan menghimpitkannya satu sama lain. Ia bertanya: Sudah Cukupkah? Neraka menjawab: Cukup, cukup. Setelah Allah memasukkan penghuni surga ke surga dan penghuni neraka ke neraka, kematian didatangkan dengan diseret kemudian didirikan di atas benteng antara penghuni surga dan penghuni neraka, setelah itu dikatakan kepada penghuni surga: Hai penghuni surga! Mereka melihat dalam keadaan takut. Dan dikatakan kepada penghuni neraka: Wahai penghuni neraka! Mereka melihat dalam keadaan senang, mereka berharap mendapatkan syafaat. Lalu dikatakan kepada penghuni surga dan penghuni neraka: Apa kalian mengetahui ini? mereka menjawab: Kami mengetahuinya, itu adalah kematian yang diserahi untuk (mencabut nyawa) kami. Ia dibaringkan lalu disembelih di atas benteng antara surga dan neraka, setelah itu dikatakan: Wahai penghuni surga, Sekarang tiba saatnya kekekalan, tiada lagi kematian dan wahai penghuni neraka, kalian juga kekal tiada kematian.\" Abu Isa berkata: Hadits ini hasan shahih. Dan banyak sekali riwayat serupa yang diriwayatkan dari nabi Shallallahu 'alaihi wa Salam yang tidak menyebutkan bahwa manusia melihat Rabb mereka, tidak menyebut kedatangkan Rabb dan hal-hal serupa. Madzhab yang benar tentang hal ini menurut ahlul ilmi dari kalangan para imam serperti Sufyan Ats Tsauri, Malik bin Anas, Ibnu Al Mubarak, Ibnu Uyainah, Waki' dan lainnya bahwa mereka (di akhirat) melihat hal-hal tersebut. Mereka berkata: Hadits-hadits ini diriwayatkan dan kami mengimaninya, tidak ditanyakan bagaimananya (tekhnisnya). Inilah madzhab yang dipilih oleh ahli hadits; hal-hal itu akan terlihat seperti yang disebutkan dalam hadits dan seperti yang diimani, tidak ditafsirkan, diduga dan ditanyakan bagaimananya. Inilah pandangan ahlul ilmi yang mereka pilih dan kemukakan. Makna sabda Rasulullah shallallahu 'alaihi wasallam: \"Lalu mengenalkan diriNya pada mereka\" maksudnya menampakkan diri kepada mereka."
            },
            {
                "number": 2414,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍيَرْفَعُهُ قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أُتِيَ بِالْمَوْتِ كَالْكَبْشِ الْأَمْلَحِ فَيُوقَفُ بَيْنَ الْجَنَّةِ وَالنَّارِ فَيُذْبَحُ وَهُمْ يَنْظُرُونَ فَلَوْ أَنَّ أَحَدًا مَاتَ فَرَحًا لَمَاتَ أَهْلُ الْجَنَّةِ وَلَوْ أَنَّ أَحَدًا مَاتَ حُزْنًا لَمَاتَ أَهْلُ النَّارِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [ayahku] dari [Fudlail bin Marzuq] dari [Athiyah] dari [Abu Sa'id] ia memarfu'kannya, ia berkata: Pada hari kiamat, kematian didatangkan seperti domba kelabu lalu didirikan diantara surga dan neraka, setelah itu disembelih dan mereka melihat. Andai ada seseorang meninggal karena senang tentulah para penghuni surga meninggal dan andai ada seseorang meninggal karena sedih, tentulah para penghuni neraka mati. Abu Isa berkata: Hadits ini hasan shahih."
            },
            {
                "number": 2415,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عَمْرُو بْنُ عَاصِمٍ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ وَثَابِتٍ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حُفَّتْ الْجَنَّةُ بِالْمَكَارِهِ وَحُفَّتْ النَّارُ بِالشَّهَوَاتِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengkhabarkan kepada kami [Amru bin Ashim] telah mengkhabarkan kepada kami [Hammad bin Salamah] dari [Humaid] dan [Tsabit] dari [Anas] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Surga diliputi hal-hal yang tidak menyenangkan dan neraka diliputi syahwat.\" Abu Isa berkata: Hadits ini hasan gharib shahih melalui sanad ini."
            },
            {
                "number": 2416,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ وَالنَّارَ أَرْسَلَ جِبْرِيلَ إِلَى الْجَنَّةِ فَقَالَ انْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا قَالَ فَجَاءَهَا وَنَظَرَ إِلَيْهَا وَإِلَى مَا أَعَدَّ اللَّهُ لِأَهْلِهَا فِيهَا قَالَ فَرَجَعَ إِلَيْهِ قَالَ فَوَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ إِلَّا دَخَلَهَا فَأَمَرَ بِهَا فَحُفَّتْ بِالْمَكَارِهِ فَقَالَ ارْجِعْ إِلَيْهَا فَانْظُرْ إِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا قَالَ فَرَجَعَ إِلَيْهَا فَإِذَا هِيَ قَدْ حُفَّتْ بِالْمَكَارِهِ فَرَجَعَ إِلَيْهِ فَقَالَ وَعِزَّتِكَ لَقَدْ خِفْتُ أَنْ لَا يَدْخُلَهَا أَحَدٌ قَالَ اذْهَبْ إِلَى النَّارِ فَانْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا فَإِذَا هِيَ يَرْكَبُ بَعْضُهَا بَعْضًا فَرَجَعَ إِلَيْهِ فَقَالَ وَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ فَيَدْخُلَهَا فَأَمَرَ بِهَا فَحُفَّتْ بِالشَّهَوَاتِ فَقَالَ ارْجِعْ إِلَيْهَا فَرَجَعَ إِلَيْهَا فَقَالَ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَنْجُوَ مِنْهَا أَحَدٌ إِلَّا دَخَلَهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Muhammad bin Amru] telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saat Allah menciptakan surga dan neraka, Allah mengutus Jibril ke surga. Ia melihatnya dan yang dipersiapkan untuk penghuninya. Setelah itu Jibril mendatangi neraka dan melihatnya serta segala yang dipersiapkan untuk penghuninya. Kemudian Jibril kembali kepada-Nya, ia berkata: Demi keperkasaanMu, tidaklah seseorang mendengarnya (surga) melainkan akan memasukinya. Kemudian Jibril diperintahkan untuk kembali ke surga dan ternyata surga diliputi oleh hal-hal yang tidak menyenangkan. Ia berfirman: Kembalilah ke surga lalu lihatlah apa yang telah Aku persiapkan untuk penghuninya. Jibril kembali ke surga, ternyata surga telah diliputi oleh hal-hal yang tidak menyenangkan. Jibril kembali padaNya, ia berkata: Demi keperkasaanMu, aku khawatir tidak akan ada seorang pun yang memasukinya. Ia berfirman: Pergilah ke neraka dan lihatlah apa yang telah Aku persiapkan untuk penghuninya. Ternyata neraka menumpuk satu sama lain lalu Jibril kembali dan berkata: Demi keperkasaanMu, tidak ada seseorang mendengarnya lalu (kepingin) memasukinya. Lalu Jibril diperintahkan untuk kembali menegok neraka, ternyata neraka diliputi oleh syahwat. Ia berfirman: Kembalilah ke neraka. Jibril kembali ke neraka lalu ia berkata: Demi keperkasaanM, aku khawatir tidak akan ada seorang pun yang selamat darinya melainkan akan memasukinya.\" Abu Isa berkata: Hadits ini hasan shahih."
            },
            {
                "number": 2417,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَّتْ الْجَنَّةُ وَالنَّارُ فَقَالَتْ الْجَنَّةُ يَدْخُلُنِي الضُّعَفَاءُ وَالْمَسَاكِينُ وَقَالَتْ النَّارُ يَدْخُلُنِي الْجَبَّارُونَ وَالْمُتَكَبِّرُونَ فَقَالَ لِلنَّارِ أَنْتِ عَذَابِي أَنْتَقِمُ بِكِ مِمَّنْ شِئْتُ وَقَالَ لِلْجَنَّةِ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ شِئْتُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Surga dan neraka berbantah-bantahan, surga berkata: Orang-orang lemah dan orang-orang miskin memasukiku. Neraka berkata: Orang-orang congkak dan sombng memasukiku. Lalu Allah berfirman kepada neraka: Kau adalah siksaKu, denganmu Aku menyiksa siapa pun yang Aku kehendaki. Allah berfirman kepada surga: Kau adalah rahmatKu, denganmu Aku merahmati siapa saja yang Aku kehendaki.\" Abu Isa berkata: Hadits ini hasan shahih."
            },
            {
                "number": 2418,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْنَى أَهْلِ الْجَنَّةِ الَّذِي لَهُ ثَمَانُونَ أَلْفَ خَادِمٍ وَاثْنَتَانِ وَسَبْعُونَ زَوْجَةً وَتُنْصَبُ لَهُ قُبَّةٌ مِنْ لُؤْلُؤٍ وَزَبَرْجَدٍ وَيَاقُوتٍ كَمَا بَيْنَ الْجَابِيَةِ إِلَى صَنْعَاءَ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengkhabarkan kepada kami [Abdullah] telah mengkhabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abu Al Haitsam] dari [Abu Sa'id Al Khudri] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Penghuni surga terendah memiliki delapanpuluh ribu pelayan, tujuhpuluh dua istri, untuknya didirikan kubah mutiara, permata dan yaqut yang besarnya seperti (jarak) antara Jabiyah ke Shan'a.\""
            },
            {
                "number": 2419,
                "arab": "وَبِهَذَا الْإِسْنَادِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ مِنْ أَهْلِ الْجَنَّةِ مِنْ صَغِيرٍ أَوْ كَبِيرٍ يُرَدُّونَ أَبْنَاءَ ثَلَاثِينَ فِي الْجَنَّةِ لَا يَزِيدُونَ عَلَيْهَا أَبَدًا وَكَذَلِكَ أَهْلُ النَّارِ وَبِهَذَا الْإِسْنَادِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ عَلَيْهِمْ التِّيجَانَ إِنَّ أَدْنَى لُؤْلُؤَةٍ مِنْهَا لَتُضِيءُ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ",
                "id": "Dan dengan sanad ini (Yaitu; Telah menceritakan kepada kami [Suwaid] telah mengkhabarkan kepada kami [Abdullah] telah mengkhabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abu Al Haitsam] dari [Abu Sa'id Al Khudri]) dari nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Barangsiapa diantara calon penghuni surga yang meninggal dunia, baik yang masih kecil atau sudah besar akan dikembalikan dalam usia tigapuluh tahun di surga, mereka tidak melebihinya selamanya. Demikian juga penghuni neraka.\" Dan dengan sanad ini dari nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Sesungguhnya mereka mengenakan mutiara, sesungguhnya mutiara terendahnya menerangi antara timur dan barat.\" Abu Isa berkata: Hadits ini gharib, kami hanya mengetahuinya dari hadits Risydin."
            },
            {
                "number": 2420,
                "arab": "حَدَّثَنَا بُنْدَارٌ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ عَامِرٍ الْأَحْوَلِ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤْمِنُ إِذَا اشْتَهَى الْوَلَدَ فِي الْجَنَّةِ كَانَ حَمْلُهُ وَوَضْعُهُ وَسِنُّهُ فِي سَاعَةٍ كَمَا يَشْتَهِيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَقَدْ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا فَقَالَ بَعْضُهُمْ فِي الْجَنَّةِ جِمَاعٌ وَلَا يَكُونُ وَلَدٌ هَكَذَا رُوِيَ عَنْ طَاوُسٍ وَمُجَاهِدٍ وَإِبْرَاهِيمَ النَّخَعِيِّ و قَالَ مُحَمَّدٌ قَالَ إِسْحَقُ بْنُ إِبْرَاهِيمَ فِي حَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَهَى الْمُؤْمِنُ الْوَلَدَ فِي الْجَنَّةِ كَانَ فِي سَاعَةٍ وَاحِدَةٍ كَمَا يَشْتَهِي وَلَكِنْ لَا يَشْتَهِي قَالَ مُحَمَّدٌ وَقَدْ رُوِيَ عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَهْلَ الْجَنَّةِ لَا يَكُونُ لَهُمْ فِيهَا وَلَدٌ وَأَبُو الصِّدِّيقِ النَّاجِيِّ اسْمُهُ بَكْرُ بْنُ عَمْرٍو وَيُقَالُ بَكْرُ بْنُ قَيْسٍ أَيْضًا",
                "id": "Telah menceritakan kepada kami [Bundar] telah bercerita kepada kami [Mu'adz bin Hisyam] telah bercerita kepada kami [bapakku] dari [Amir Al Ahwal] dari [Abu Ash Shiddiq An Naji] dari [Abu Sa'id Al Khudri] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Apabila seorang mukmin menginginkan anak di surga, maka kehamilannya, kelahirannya dan umur bayinya (terjadi) sesuai yang dia inginkan\". Abu Isa berkata: Hadits ini hasan gharib, para ahli ilmu berbeda pendapat dalam masalah ini, sebagian mereka mengatakan bahwa kelak di surga ada jima' (bersetubuh) namun tidak melahirkan anak. Demikianlah yang diriwayatkan dari Thawus, Mujahid dan Ibrahim An Nakha'I. Muhammad berkata: Ishaq bin Ibrahim berkata dalam hadits Nabi Shallallahu 'alaihi wa Salam: \"Apabila seorang mukmin menginginkan anak di syurga, maka akan dapat dalam sesaat sebagaimana yang dia inginkan, akan tetapi dia tidak menghendakinya.\" Muhammad berkata: Telah diriwayatkan dari Abu Razin Al Uqaili dari Nabi Shallallahu 'alaihi wa Salam, bersabda: \"Sesungguhnya penghuni surga tidak mempunyai anak di dalam surga.\" Abu Ash Shiddiq An Naji namanya adalah Bakar bin Amru, yang lain menyebut Bakar bin Qais."
            },
            {
                "number": 2421,
                "arab": "حَدَّثَنَا هَنَّادٌ وَأَحْمَدُ بْنُ مَنِيعٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجَنَّةِ لَمُجْتَمَعًا لِلْحُورِ الْعِينِ يُرَفِّعْنَ بِأَصْوَاتٍ لَمْ يَسْمَعْ الْخَلَائِقُ مِثْلَهَا قَالَ يَقُلْنَ نَحْنُ الْخَالِدَاتُ فَلَا نَبِيدُ وَنَحْنُ النَّاعِمَاتُ فَلَا نَبْؤُسُ وَنَحْنُ الرَّاضِيَاتُ فَلَا نَسْخَطُ طُوبَى لِمَنْ كَانَ لَنَا وَكُنَّا لَهُوَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ وَأَنَسٍ قَالَ أَبُو عِيسَى حَدِيثِ عَلِيٍّ حَدِيثٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Hannad] dan [Ahmad bin Mani'] keduanya berkata: telah menceritakan kepada kami [Abu Muawiyah] berkata: telah menceritakan kepada kami [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'id] dari [Ali] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnnya di surga ada perkumpulan para bidadari, mereka memanggil-manggil dengan suara keras, para makhluk belum pernah mendengar sepertinya. Mereka berkata: Kami wanita-wanita kekal, kami tidak lenyap, kami adalah wanita-wanita menyenangkan, kami tidak cemberut, kami wanita-wanita ridha, kami tidak marah. Beruntunglah siapa yang menjadi milik kami dan kami menjadi miliknya.\" Dalam hal ini ada hadits serupa dari Abu Hurairah, Abu Sa'id dan Anas. Abu Isa berkata: Hadits Ali gharib."
            },
            {
                "number": 2422,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍفِي قَوْلِهِ عَزَّ وَجَلَّ{ فَهُمْ فِي رَوْضَةٍ يُحْبَرُونَ }قَالَ السَّمَّاعُوَمَعْنَى السَّمَّاعِ مِثْلَ مَا وَرَدَ فِي الْحَدِيثِ أَنَّ الْحُورَ الْعِينَ يُرَفِّعْنَ بِأَصْوَاتِهِنَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Rauh bin Ubadah] dari [Al Auza'] dari [Yahya bin Abu Katsir] tentang firman Allah 'azza wajalla: \"Mereka di dalam taman (surga) bergembira.\" (Ar Ruum: 15) beliau bersabda: \"Samma'\" makna samma' seperti yang disebutkan dalam hadits; para bidadari mengeraskan suara-suara mereka."
            },
            {
                "number": 2423,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي الْيَقْظَانِ عَنْ زَاذَانَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ عَلَى كُثْبَانِ الْمِسْكِ أُرَهُ قَالَ يَوْمَ الْقِيَامَةِ يَغْبِطُهُمْ الْأَوَّلُونَ وَالْآخِرُونَ رَجُلٌ يُنَادِي بِالصَّلَوَاتِ الْخَمْسِ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ وَرَجُلٌ يَؤُمُّ قَوْمًا وَهُمْ بِهِ رَاضُونَ وَعَبْدٌ أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ سُفْيَانَ الثَّوْرِيِّ وَأَبُو الْيَقْظَانِ اسْمُهُ عُثْمَانُ بْنُ عُمَيْرٍ وَيُقَالُ ابْنُ قَيْسٍ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Al Yaqadlan] dari [Zadzan] dari [Abdullah bin Umar] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga orang berada di bukit pasir minyak kesturi -aku (Abdullah bin Umar) melihat beliau bersabda- pada hari kiamat, orang-orang pertama dan terakhir iri kepada mereka; orang yang menyeru sholat lima waktu setiap hari dan malam, orang memimpin suatu kaum dan mereka ridha kepadanya, dan hamba yang menunaikan hak Allah dan hak para majikannya.\" Abu Isa berkata: Hadits ini hasan gharib, kami hanya mengetahuinya dari hadits Sufyan Ats Tsauri. Abu Yaqadlan namanya Utsman bin Umair, ada yang menyebut Ibnu Qais."
            },
            {
                "number": 2424,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍيَرْفَعُهُ قَالَ ثَلَاثَةٌ يُحِبُّهُمْ اللَّهُ رَجُلٌ قَامَ مِنْ اللَّيْلِ يَتْلُو كِتَابَ اللَّهِ وَرَجُلٌ تَصَدَّقَ صَدَقَةً بِيَمِينِهِ يُخْفِيهَا أُرَهُ قَالَ مِنْ شِمَالِهِ وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَانْهَزَمَ أَصْحَابُهُ فَاسْتَقْبَلَ الْعَدُوَّقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَهُوَ غَيْرُ مَحْفُوظٍ وَالصَّحِيحُ مَا رَوَى شُعْبَةُ وَغَيْرُهُ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ زَيْدِ بْنِ ظَبْيَانَ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرِ بْنُ عَيَّاشٍ كَثِيرُ الْغَلَطِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah bercerita kepada kami [Yahya bin Adam] dari [Abu Bakar bin Ayyasy] dari [Al A'masy] dari [Manshur] dari [Rib'I bin Hirasy] dari [Abdullah bin Mas'ud] ia memarfu'kannya, ia berkata: Tiga orang dicintai Allah; seseorang bangun di waktu malam kemudian membaca kitabullah, seseorang berinfak dengan tangan kanannya kemudian ia rahasiakan, (perawi) berkata: Aku mengira beliau mengatakan: Merahasiakan dari tangan kirinya, dan seseorang berada dalam pasukan perang kemudian sahabat sahabatnya terbunuh namun dia maju menyongsong musuh.\" Abu Isa berkata: Hadits ini gharib dari jalur sanad ini dan dia tidak mahfudz (terjaga), adapun yang shahih adalah yang diriwayatkan oleh [Syu'bah] dan yang lainnya dari [Manshur] dari [Rib'i bin Hirasy] dari [Zaid bin Dlabyan] dari [Abu Dzar] dari Nabi Shallallahu 'alaihi wa Salam. Abu Bakar bin Ayyasy banyak salahnya."
            },
            {
                "number": 2425,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ قَال سَمِعْتُ رِبْعِيَّ بْنَ حِرَاشٍ يُحَدِّثُ عَنْ زَيْدِ بْنِ ظَبْيَانَ يَرْفَعُهُ إِلَى أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ يُحِبُّهُمْ اللَّهُ وَثَلَاثَةٌ يُبْغِضُهُمْ اللَّهُ فَأَمَّا الَّذِينَ يُحِبُّهُمْ اللَّهُ فَرَجُلٌ أَتَى قَوْمًا فَسَأَلَهُمْ بِاللَّهِ وَلَمْ يَسْأَلْهُمْ بِقَرَابَةٍ بَيْنَهُ وَبَيْنَهُمْ فَمَنَعُوهُ فَتَخَلَّفَ رَجُلٌ بِأَعْقَابِهِمْ فَأَعْطَاهُ سِرًّا لَا يَعْلَمُ بِعَطِيَّتِهِ إِلَّا اللَّهُ وَالَّذِي أَعْطَاهُ وَقَوْمٌ سَارُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ النَّوْمُ أَحَبَّ إِلَيْهِمْ مِمَّا يُعْدَلُ بِهِ نَزَلُوا فَوَضَعُوا رُءُوسَهُمْ فَقَامَ أَحَدُهُمْ يَتَمَلَّقُنِي وَيَتْلُو آيَاتِي وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَلَقِيَ الْعَدُوَّ فَهُزِمُوا وَأَقْبَلَ بِصَدْرِهِ حَتَّى يُقْتَلَ أَوْ يُفْتَحَ لَهُ وَالثَّلَاثَةُ الَّذِينَ يُبْغِضُهُمْ اللَّهُ الشَّيْخُ الزَّانِي وَالْفَقِيرُ الْمُخْتَالُ وَالْغَنِيُّ الظَّلُومُحَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ عَنْ شُعْبَةَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَهَكَذَا رَوَى شَيْبَانُ عَنْ مَنْصُورٍ نَحْوَ هَذَا وَهَذَا أَصَحُّ مِنْ حَدِيثِ أَبِي بَكْرِ بْنِ عَيَّاشٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Muhammad bin Al Mutsanna] keduanya berkata: telah menceritakan kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari [Manshur bin Al Mu'tamir] berkata: aku telah mendengar [Rib'I bin Hirasy] dari [Zaid bin Dlabyan] ia memarfu'kannya melalui [Abu Dzar] dari Nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Ada tiga orang yang dicintai oleh Allah dan tiga orang yang dibenci oleh Allah, adapun yang dicintai oleh Allah adalah; seseorang yang datang kepada suatu kaum lalu meminta kepada mereka dengan nama Allah, ia tidak meminta karena ada hubungan kekerabatan antaranya dengan mereka namun mereka menolaknya, lalu ada seseorang dari kaum itu pergi secara sembunyi-sembunyi dan memberikan sesuatu kepada lelaki yang meminta tadi dengan sembunyi sembunyi, tidak ada yang mengetahui pemberiannya kecuali hanya Allah dan orang yang diberi, suatu kaum yang berjalan di malam hari keinginan untuk tidur lebih mereka sukai dari yang lain, mereka pun singgah lalu meletakkan kepala mereka (tertidur), namun ada seorang lelaki yang bangun bermunajat kepadaNya dan membaca ayat ayatNya, dan seseorang berada dalam barisan pasukan lalu berhadapan dengan musuh, dan ketika pasukannya hancur, justeru dia maju dengan menghadapkan dadanya sampai dia terbunuh atau mendapat kemenangan. Sedangkan tiga orang yang dibenci oleh Allah adalah; orang tua yang berzina, orang fakir yang sombong dan orang kaya yang dzalim.\" Telah menceritakan kepada kami [Mahmud bin Ghailan] telah bercerita kepada kami [An Nadlar bin Syumail] dari [Syu'bah] dengan hadits yang semakna. Abu Isa berkata: Hadits ini shahih, seperti itu juga [Syaiban] meriwayatkan dari [Manshur] dan ini lebih shahih dari hadits Abu Bakar bin Ayyasy."
            },
            {
                "number": 2426,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَدِّهِ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ الْفُرَاتُ يَحْسِرُ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلَا يَأْخُذْ مِنْهُ شَيْئًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyuj] telah menceritakan kepada kami [Uqbah bin Khalid] telah menceritakan kepada kami [ubaidhullah bin Umar] dari [Khubaib bin Abdurrahman] dari [kakeknya, Hafsh bin Ashim] dari [Abu Hurairah] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hampir saja sungai Eufrat mengumpulkan harta simpanan dari emas, siapa pun mendatanginya jangan mengambil apa pun.\" Abu Isa berkata: Hadits ini hasan shahih. Telah menceritakan kepada kami [Abu Sa'id Al Asyuj] telah menceritakan kepada kami [Uqbah bin Khalid] telah menceritakan kepada kami [ubaidhullah] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam sepertinya, hanya saja ia berkata dalam riwayatnya: Mengumpulkan gunung emas. Abu Isa berkata: Hadits ini hasan shahih."
            },
            {
                "number": 2427,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ بَحْرَ الْمَاءِ وَبَحْرَ الْعَسَلِ وَبَحْرَ اللَّبَنِ وَبَحْرَ الْخَمْرِ ثُمَّ تُشَقَّقُ الْأَنْهَارُ بَعْدُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَحَكِيمُ بْنُ مُعَاوِيَةَ هُوَ وَالِدُ بَهْزِ بْنِ حَكِيمٍ وَالْجُرَيْرِيُّ يُكْنَى أَبَا مَسْعُودٍ وَاسْمُهُ سَعِيدُ بْنُ إِيَاسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yazid bin Harun] telah mengkhabarkan kepada kami [Al Jurairi] dari [Hakim bin Mu'awiyah] dari [ayahnya] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada samudera air, samudera madu, samudera susu dan samudera khamar, selanjutnya sungai-sungai menyabang kemana-mana.\" Abu Isa berkata: Hadits ini hasan shahih. Hakim bin Muawiyah adala ayah Bahz bin Hakim dan Al Jurairi kuniahnya Abu Mas'ud, namanya Sa'id bin Iyas."
            },
            {
                "number": 2428,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ اللَّهَ الْجَنَّةَ ثَلَاثَ مَرَّاتٍ قَالَتْ الْجَنَّةُ اللَّهُمَّ أَدْخِلْهُ الْجَنَّةَ وَمَنْ اسْتَجَارَ مِنْ النَّارِ ثَلَاثَ مَرَّاتٍ قَالَتْ النَّارُ اللَّهُمَّ أَجِرْهُ مِنْ النَّارِقَالَ هَكَذَا رَوَى يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِي إِسْحَقَ هَذَا الْحَدِيثَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَقَدْ رُوِيَ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسِ بْنِ مَالِكٍ مَوْقُوفًا أَيْضًا",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Al Ahwash] dar [Abu Ishaq] dari [Buraid bin Abu Maryam] dari [Anas bin Malik] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa meminta surga kepada Allah sebanyak tiga kali, surga berkata: Ya Allah, masukkan ia ke surga. Dan barangsiapa meminta perlindungan dari neraka sebanyak tiga kali, neraka berkata: Ya Allah, lindungilah ia dari neraka.\" Abu Isa berkata: Demikian [Yunus bin Abu Ishaq] meriwayatkan hadits ini dari [Abu Ishaq] dari [Buraid bin Maryam] dari [Anas] dari nabi Shallallahu 'alaihi wa Salam sepertinya. Dan diriwayatkan dari Abu Ishaq dari Buraid bin Abu Maryam dari Anas bin Malik secara mauquf juga."
            },
            {
                "number": 2429,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي عَنْ الْعَلَاءِ بْنِ خَالِدٍ الْكَاهِلِيِّ عَنْ شَقِيقِ بْنِ سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِجَهَنَّمَ يَوْمَئِذٍ لَهَا سَبْعُونَ أَلْفَ زِمَامٍ مَعَ كُلِّ زِمَامٍ سَبْعُونَ أَلْفَ مَلَكٍ يَجُرُّونَهَاقَالَ عَبْدُ اللَّهِ وَالثَّوْرِيُّ لَا يَرْفَعُهُ حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو أَبُو عَامِرٍ الْعَقَدِيُّ عَنْ سُفْيَانَ عَنْ الْعَلَاءِ بْنِ خَالِدٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَلَمْ يَرْفَعْهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah bercerita kepada kami [Umar bin Hafs bin Ghiyats] telah mengkhabarkan kepada kami [bapakku] dari [Al Ala' bin Khalid Al Kahili] dari [Syaqiq bin Salamah] dari [Abdullah bin Mas'ud] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Pada hari itu, neraka Jahannam di datangkan, ia memiliki tujuh puluh ribu tali, pada tiap tali ada tujuh puluh ribu malaikat menyeretnya.\" Abdullah berkata: Ats Tsauri tidak menyambungkannya sampai kepada Nabi. Telah menceritakan kepada kami Abdu bin Humaid telah bercerita kepada kami Abdul Malik bin Amru dan Abu Amir Al Aqadi dari Sufyan dari Al Ala' bin Khlid dengan sanad ini sepertinya namun tidak memarfu'kannya."
            },
            {
                "number": 2430,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَخْرُجُ عُنُقٌ مِنْ النَّارِ يَوْمَ الْقِيَامَةِ لَهَا عَيْنَانِ تُبْصِرَانِ وَأُذُنَانِ تَسْمَعَانِ وَلِسَانٌ يَنْطِقُ يَقُولُ إِنِّي وُكِّلْتُ بِثَلَاثَةٍ بِكُلِّ جَبَّارٍ عَنِيدٍ وَبِكُلِّ مَنْ دَعَا مَعَ اللَّهِ إِلَهًا آخَرَ وَبِالْمُصَوِّرِينَوَفِي الْبَاب عَنْ أَبِي سَعِيدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ وَقَدْ رَوَاهُ بَعْضُهُمْ عَنْ الْأَعْمَشِ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا وَرَوَى أَشْعَثُ بْنُ سَوَّارٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muawiyah Al Juhami] telah menceritakan kepada kami [Abdul Aziz bin Muslim] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \" Pada hari kiamat nanti, ada Leher keluar dari neraka, ia memiliki dua mata yang melihat, dua telinga yang mendengar dan lisan yang berbicara, ia berkata: Aku diberi kuasa pada setiap orang sombong lagi membangkang, pada orang yang menyeru tuhan lain bersama Allah dan pada orang-orang yang membuat gambar.\" Dalam hal ini ada hadits serupa dari Abu Sa'id. Abu Isa berkata: Hadits ini hasan gharib shahih. Sebagian meriwayatkan hadits ini dari [Al A'masy] dari [Athiyah] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam seperti ini. [Asy'ats bin Sawwar] meriwayatkan dari [Athiyah] dari [Abu Sa'id Al Khudri] dari nabi Shallallahu 'alaihi wa Salam sepertinya."
            },
            {
                "number": 2431,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ عَنْ فُضَيْلِ بْنِ عِيَاضٍ عَنْ هِشَامٍ عَنْ الْحَسَنِ قَالَ قَالَ عُتْبَةُ بْنُ غَزْوَانَ عَلَى مِنْبَرِنَا هَذَا مِنْبَرِ الْبَصْرَةِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الصَّخْرَةَ الْعَظِيمَةَ لَتُلْقَى مِنْ شَفِيرِ جَهَنَّمَ فَتَهْوِي فِيهَا سَبْعِينَ عَامًا وَمَا تُفْضِي إِلَى قَرَارِهَاقَالَ وَكَانَ عُمَرُ يَقُولُ أَكْثِرُوا ذِكْرَ النَّارِ فَإِنَّ حَرَّهَا شَدِيدٌ وَإِنَّ قَعْرَهَا بَعِيدٌ وَإِنَّ مَقَامِعَهَا حَدِيدٌ قَالَ أَبُو عِيسَى لَا نَعْرِفُ لِلْحَسَنِ سَمَاعًا مِنْ عُتْبَةَ بْنِ غَزْوَانَ وَإِنَّمَا قَدِمَ عُتْبَةُ بْنُ غَزْوَانَ الْبَصْرَةَ فِي زَمَنِ عُمَرَ وَوُلِدَ الْحَسَنُ لِسَنَتَيْنِ بَقِيَتَا مِنْ خِلَافَةِ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah menceritakan kepada kami [Husain bin Ali Al Ju'fi] dari [Fudlail bin Iyadl] dari [Hisyam] dari [Al Hasan] berkata: [Utbah bin Ghazwan] berkhutbah di atas mimbar Bashrah, dari nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Sesungguhnya batu besar di lemparkan dari tepi neraka jahanam lalu jatuh ke dalamnya selama tujuhpuluh tahun dan tidak juga sampai ke dasarnya.\" Berkata Al Hasan: Ibnu Umar berkata: Sering-seringlah mengingat neraka karena panasnya amat sangat, jurangnya jauh dan palu-palunya terbuat dari besi. Abu Isa berkata: Kami tidak mengetahui Al Hasan mendengar dari Utbah bin Ghazwan, Utbah bin Ghazwan hanya datang ke Bashrah di masa Umar, sementara Al Hasan lahir dua tahun di sisa masa khilafah Umar."
            },
            {
                "number": 2432,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى عَنْ ابْنِ لَهِيعَةَ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الصَّعُودُ جَبَلٌ مِنْ نَارٍ يَتَصَعَّدُ فِيهِ الْكَافِرُ سَبْعِينَ خَرِيفًا وَيَهْوِي فِيهِ كَذَلِكَ أَبَدًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ",
                "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah menceritakan kepada kami [Al Hasan bin Musa] dari [Ibnu Lahi'ah] dari [Darraj] dari [Abu Al Hutsaim] dari [Abu Sa'id] dari Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sha'ud adalah salah satu gunung neraka, orang kafir menaikinya selama empatpuluh tahun lalu terjun di dalamnya seperti itu juga selama itu selama-lamanya. Abu Isa berkata: Hadits ini gharib, kemarfu'annya hanya kami ketahui dari hadits Ibnu Lahi'ah."
            },
            {
                "number": 2433,
                "arab": "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ غِلَظَ جِلْدِ الْكَافِرِ اثْنَانِ وَأَرْبَعُونَ ذِرَاعًا وَإِنَّ ضِرْسَهُ مِثْلُ أُحُدٍ وَإِنَّ مَجْلِسَهُ مِنْ جَهَنَّمَ كَمَا بَيْنَ مَكَّةَ وَالْمَدِينَةِهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ الْأَعْمَشِ",
                "id": "Telah menceritakan kepada kami [Abbas Ad Duri] telah menceritakan kepada kami [ubaidhullah bin Musa] telah mengkhabarkan kepada kami [Syaiban] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya kulit orang kafir itu setebal empatpuluh dua hasta, gigi gerahamnya seperti Uhud dan tempatnya di neraka jahanam seluas antara Makkah dan Madinah.\" Hadits ini hasan shahih gharib dari hadits Al A'masy."
            },
            {
                "number": 2434,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمَّارٍ حَدَّثَنِي جَدِّي مُحَمَّدُ بْنُ عَمَّارٍ وَصَالِحٌ مَوْلَى التَّوْأَمَةِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضِرْسُ الْكَافِرِ يَوْمَ الْقِيَامَةِ مِثْلُ أُحُدٍ وَفَخِذُهُ مِثْلُ الْبَيْضَاءِ وَمَقْعَدُهُ مِنْ النَّارِ مَسِيرَةُ ثَلَاثٍ مِثْلُ الرَّبَذَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَمِثْلُ الرَّبَذَةِ كَمَا بَيْنَ الْمَدِينَةِ وَالرَّبَذَةِ وَالْبَيْضَاءُ جَبَلٌ مِثْلُ أُحُدٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Muhammad bin Ammar] telah menceritakan kepadaku [kakekku, Muhammad bin Ammar] dan [Shalih maula at-Tau`amah] dari [Abu Hurairah], dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Gigi orang kafir pada hari kiamat seperti gunung Uhud, pahanya seperti gunung al Baidha', dan tempat duduknya dari api neraka sejarak tiga (malam) seperti ar Rabadzah.\" Abu Isa berkata; Ini hadits hasan gharib. Sedangkan kalimat, 'Seperti ar Rabadzah' adalah seperti jarak antara Madinah dan ar Rabazdah. Kata 'Al Baidha' adalah nama gunung sebagaimana Uhud."
            },
            {
                "number": 2435,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ عَنْ فُضَيْلِ بْنِ غَزْوَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَرَفَعَهُ قَالَ ضِرْسُ الْكَافِرِ مِثْلُ أُحُدٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَأَبُو حَازِمٍ هُوَ الْأَشْجَعِيُّ اسْمُهُ سَلْمَانُ مَوْلَى عَزَّةَ الْأَشْجَعِيَّةِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Mush'ab bin al Miqdam] dari [Fudhail bin Ghazwan] dari [Abu Hazim] dari [Abu Hurairah] dia menyatakannya marfu', beliau bersabda; \"Geraham orang kafir seperti gunung Uhud.\" Abu Isa berkata; 'Ini hadits hasan. Sedangkan Abu Hazim adalah (bermarga) al Asyja'i, namanya Salman maula 'Azzah al Asyja'iyyah.\""
            },
            {
                "number": 2436,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْفَضْلِ بْنِ يَزِيدَ عَنْ أَبِي الْمُخَارِقِ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْكَافِرَ لَيُسْحَبُ لِسَانُهُ الْفَرْسَخَ وَالْفَرْسَخَيْنِ يَتَوَطَّؤُهُ النَّاسُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ وَالْفَضْلُ بْنُ يَزِيدَ هُوَ كُوفِيٌّ قَدْ رَوَى عَنْهُ غَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ وَأَبُو الْمُخَارِقِ لَيْسَ بِمَعْرُوفٍ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Ali bin Mushir] dari [al Fadhl bin Yazid] dari [Abu al Mukhariq] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya lisan orang kafir akan diseret sejarak satu farsakh dan dua farsakh, dan diinjak-injak oleh manusia.\" Abu Isa berkata; 'Ini hadits gharib. Kami hanya mengetahuinya dari jalur ini saja. Sedangkan Fadhl bin Yazid adalah seorang kufah. Bukan hanya satu imam yang meriwayatkan darinya. Sedangkan Abu al Mukhariq tidak dikenal.'"
            },
            {
                "number": 2437,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ{ كَالْمُهْلِ }قَالَ كَعَكَرِ الزَّيْتِ فَإِذَا قَرَّبَهُ إِلَى وَجْهِهِ سَقَطَتْ فَرْوَةُ وَجْهِهِ فِيهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ وَرِشْدِينُ قَدْ تُكُلِّمَ فِيهِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Risydin bin Sa'd] dari [Amru bin al Harits] dari [Darraj] dari [Abu al Haitsam] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam dalam menjelaskan firman Nya, \"Seperti besi yang mendidih.\" Beliau bersabda: \"Maksudnya seperti endapan minyak. Maka apabila (orang yang bermaksiat) mendekatkannya kepada wajahnya, niscaya kulit mukanya akan jatuh mengelupas ke dalamnya.\" Abu Isa berkata; 'Ini hadits yang mana kita tidak mengenalnya kecuali dari hadits Risydin bin Sa'd, sedangkan Risydin kredibilitasnya diperbincangkan.'"
            },
            {
                "number": 2438,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا سَعِيدُ بْنُ يَزِيدَ عَنْ أَبِي السَّمْحِ عَنْ ابْنِ حُجَيْرَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْحَمِيمَ لَيُصَبُّ عَلَى رُءُوسِهِمْ فَيَنْفُذُ الْحَمِيمُ حَتَّى يَخْلُصَ إِلَى جَوْفِهِ فَيَسْلِتُ مَا فِي جَوْفِهِ حَتَّى يَمْرُقَ مِنْ قَدَمَيْهِ وَهُوَ الصَّهْرُ ثُمَّ يُعَادُ كَمَا كَانَوَسَعِيدُ بْنُ يَزِيدَ يُكْنَى أَبَا شُجَاعٍ وَهُوَ مِصْرِيٌّ وَقَدْ رَوَى عَنْهُ اللَّيْثُ بْنُ سَعْدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَابْنُ حُجَيْرَةَ هُوَ عَبْدُ الرَّحْمَنِ بْنُ حُجَيْرَةَ الْمِصْرِيُّ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Sa'id bin Yazid] dari [Abu as Samh] dari [Ibnu Hujairah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya air yang panas tersebut pasti akan dituangkan ke atas kepala mereka, maka air panas tersebut menembus hingga masuk ke dalam perutnya dan memotong segala sesuatu yang berada dalam perutnya hingga keluar dari kedua telapak kakinya dalam bentuk cairan. Kemudian dia dikembalikan (utuh) sebagaimana sebelumnya.\" Sa'id bin Yazid diberi kunyah Abu Syuja', dia seorang Mesir. Al Laits bin Sa'd telah meriwayatkan darinya. Abu Isa berkata; 'Ini hadits hasan shahih gharib. Sedangkan Ibnu Hujairah adalah Abdurrahman bin Hujairah al Mishri.'"
            },
            {
                "number": 2439,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا صَفْوَانُ بْنُ عَمْرٍو عَنْ عُبَيْدِ اللَّهِ بْنِ بُسْرٍ عَنْ أَبِي أُمَامَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ{ وَيُسْقَى مِنْ مَاءٍ صَدِيدٍ يَتَجَرَّعُهُ }قَالَ يُقَرَّبُ إِلَى فِيهِ فَيَكْرَهُهُ فَإِذَا أُدْنِيَ مِنْهُ شَوَى وَجْهَهُ وَوَقَعَتْ فَرْوَةُ رَأْسِهِ فَإِذَا شَرِبَهُ قَطَّعَ أَمْعَاءَهُ حَتَّى تَخْرُجَ مِنْ دُبُرِهِ يَقُولُ اللَّهُ{ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ }وَيَقُولُ{ وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ بِئْسَ الشَّرَابُ }قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَهَكَذَا قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ عَنْ عُبَيْدِ اللَّهِ بْنِ بُسْرٍ وَلَا نَعْرِفُ عُبَيْدَ اللَّهِ بْنَ بُسْرٍ إِلَّا فِي هَذَا الْحَدِيثِ وَقَدْ رَوَى صَفْوَانُ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ هَذَا الْحَدِيثِ وَعَبْدُ اللَّهِ بْنُ بُسْرٍ لَهُ أَخٌ قَدْ سَمِعَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُخْتُهُ قَدْ سَمِعَتْ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعُبَيْدُ اللَّهِ بْنُ بُسْرٍ الَّذِي رَوَى عَنْهُ صَفْوَانُ بْنُ عَمْرٍو هَذَا الْحَدِيثَ رَجُلٌ آخَرُ لَيْسَ بِصَاحِبٍ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Shafwan bin Amru] dari [Ubaidillah bin Busr] dari [Abu Umamah] dari Nabi shallallahu 'alaihi wasallam dalam menjelaskan firman Nya, \"Dan dia akan diberi minuman dengan air nanah, lalu dia minum air nanah itu.\" Beliau menjelaskan; '(Minuman itu) didekatkan kepada (orang yang bermaksiat tersebut), maka dia tidak menyukainya, ketika didekatkan kepadanya, minuman itu membakar wajahnya, maka kulit kepalanya jatuh mengelupas. Ketika dia meminumnya, minuman itu memutuskan lambungnya hingga keluar (cairan) dari duburnya. Allah berfirman: 'Dan mereka diberi minuman dengan air yang mendidih sehingga memotong ususnya.' Dan Allah berfirman: 'Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek'.\" Abu Isa berkata; 'Ini hadits gharib. Demikianlah yang dikatakan Muhammad bin Isma'il dari ubaidhullah bin Busr. Dan kami tidak mengetahui ubaidhullah bin Busr kecuali dalam hadits ini. Shafwan telah meriwayatkan dari Amru dari Abdullah bin Busr, sahabat Nabi shallallahu 'alaihi wasallam selain hadits ini. Abdullah bin Busr mempunyai saudara yang telah mendengarkan (hadits) dari Nabi shallallahu 'alaihi wasallam, dan saudarinya juga telah mendengar dari Nabi shallallahu 'alaihi wasallam. Sedangkan ubaidhullah bin Busr yang mana Shafwan bin Amru meriwayatkan hadits ini darinya adalah laki-laki lain yang tidak termasuk kalangan shahabat.'"
            },
            {
                "number": 2440,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ{ كَالْمُهْلِ }كَعَكَرِ الزَّيْتِ فَإِذَا قُرِّبَ إِلَيْهِ سَقَطَتْ فَرْوَةُ وَجْهِهِ فِيهِ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abul Haitsam] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau menjelaskan firmanNya; \"Seperti besi yang mendidih\" yaitu seperti endapan minyak, apabila didekatkan maka wajahnya (penghuni neraka) niscaya jatuh mengelupas ke dalamnya\"."
            },
            {
                "number": 2441,
                "arab": "وَبِهَذَا الْإِسْنَادِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِسُرَادِقِ النَّارِ أَرْبَعَةُ جُدُرٍ كِثَفُ كُلِّ جِدَارٍ مِثْلُ مَسِيرَةِ أَرْبَعِينَ سَنَةً",
                "id": "Dan dengan sanad ini (Yaitu; Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abul Haitsam] dari [Abu Sa'id Al Khudri]), dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tenda neraka memiliki empat dinding yang tebal. Setiap dinding memiliki ketebalan semisal jarak empat puluh tahun.\""
            },
            {
                "number": 2442,
                "arab": "وَبِهَذَا الْإِسْنَادِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ دَلْوًا مِنْ غَسَّاقٍ يُهَرَاقُ فِي الدُّنْيَا لَأَنْتَنَ أَهْلَ الدُّنْيَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ وَفِي رِشْدِينَ مَقَالٌ وَقَدْ تُكُلِّمَ فِيهِ مِنْ قِبَلِ حِفْظِهِ وَمَعْنَى قَوْلِهِ كِثَفُ كُلِّ جِدَارٍ يَعْنِي غِلَظَهُ",
                "id": "Dan dengan sanad ini pula, (Yaitu; Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abul Haitsam] dari [Abu Sa'id Al Khudri]) dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kalau seandainya satu timba dari nanah ahli neraka ditumpahkan ke dunia, niscaya penduduk dunia akan basi.\" Abu Isa berkata; 'Hadits ini hanya kami kenal dari hadits Risydin bin Sa'd. Namun pada (kredibilitas) Risydin terdapat perbincangan. Dia diperbincangkan pada hafalannya. Sedangkan makna sabdanya, 'Katsifu Kulli Jidar' maksudnya adalah ketebalan dindingnya."
            },
            {
                "number": 2443,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَخْبَرَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ هَذِهِ الْآيَةَ{ اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ }قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّ قَطْرَةً مِنْ الزَّقُّومِ قُطِرَتْ فِي دَارِ الدُّنْيَا لَأَفْسَدَتْ عَلَى أَهْلِ الدُّنْيَا مَعَايِشَهُمْ فَكَيْفَ بِمَنْ يَكُونُ طَعَامَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Syu'bah] dari [al A'masy] dari [Mujahid] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam membaca ayat, \"Bertaqwalah kamu sekalian kepada Allah dengan sebenar benarnya taqwa, dan janganlah kamu sekalian meninggal melainkan kalian dalam keadaan muslim.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau seandainya setetes Zaqqum (nama pohon di neraka) menetes ke kampung dunia, niscaya akan merusakkan kehidupan penduduk dunia. Lalu bagaimana dengan (keadaan) orang-orang yang menjadikan zaqqum sebagai makanannya?\" Abu Isa berkata; 'Ini hadits hasan shahih.\""
            },
            {
                "number": 2444,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا قُطْبَةُ بْنُ عَبْدِ الْعَزِيزِ عَنْ الْأَعْمَشِ عَنْ شِمْرِ بْنِ عَطِيَّةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلْقَى عَلَى أَهْلِ النَّارِ الْجُوعُ فَيَعْدِلُ مَا هُمْ فِيهِ مِنْ الْعَذَابِ فَيَسْتَغِيثُونَ فَيُغَاثُونَ بِطَعَامٍ مِنْ ضَرِيعٍ لَا يُسْمِنُ وَلَا يُغْنِي مِنْ جُوعٍ فَيَسْتَغِيثُونَ بِالطَّعَامِ فَيُغَاثُونَ بِطَعَامٍ ذِي غُصَّةٍ فَيَذْكُرُونَ أَنَّهُمْ كَانُوا يُجِيزُونَ الْغَصَصَ فِي الدُّنْيَا بِالشَّرَابِ فَيَسْتَغِيثُونَ بِالشَّرَابِ فَيُرْفَعُ إِلَيْهِمْ الْحَمِيمُ بِكَلَالِيبِ الْحَدِيدِ فَإِذَا دَنَتْ مِنْ وُجُوهِهِمْ شَوَتْ وُجُوهَهُمْ فَإِذَا دَخَلَتْ بُطُونَهُمْ قَطَّعَتْ مَا فِي بُطُونِهِمْ فَيَقُولُونَ ادْعُوا خَزَنَةَ جَهَنَّمَ فَيَقُولُونَ أَلَمْ{ تَكُ تَأْتِيكُمْ رُسُلُكُمْ بِالْبَيِّنَاتِ قَالُوا بَلَى قَالُوا فَادْعُوا وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ }قَالَ فَيَقُولُونَ ادْعُوا مَالِكًا فَيَقُولُونَ{ يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ }قَالَ فَيُجِيبُهُمْ{ إِنَّكُمْ مَاكِثُونَ }قَالَ الْأَعْمَشُ نُبِّئْتُ أَنَّ بَيْنَ دُعَائِهِمْ وَبَيْنَ إِجَابَةِ مَالِكٍ إِيَّاهُمْ أَلْفَ عَامٍ قَالَ فَيَقُولُونَ ادْعُوا رَبَّكُمْ فَلَا أَحَدَ خَيْرٌ مِنْ رَبِّكُمْ فَيَقُولُونَ{ رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَالِّينَ رَبَّنَا أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَالِمُونَ }قَالَ فَيُجِيبُهُمْ{ اخْسَئُوا فِيهَا وَلَا تُكَلِّمُونِ }قَالَ فَعِنْدَ ذَلِكَ يَئِسُوا مِنْ كُلِّ خَيْرٍ وَعِنْدَ ذَلِكَ يَأْخُذُونَ فِي الزَّفِيرِ وَالْحَسْرَةِ وَالْوَيْلِقَالَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ وَالنَّاسُ لَا يَرْفَعُونَ هَذَا الْحَدِيثَ قَالَ أَبُو عِيسَى إِنَّمَا نَعْرِفُ هَذَا الْحَدِيثَ عَنْ الْأَعْمَشِ عَنْ شِمْرِ بْنِ عَطِيَّةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَوْلَهُ وَلَيْسَ بِمَرْفُوعٍ وَقُطْبَةُ بْنُ عَبْدِ الْعَزِيزِ هُوَ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Quthbah bin Abdul Aziz] dari [Al A'masy] dari [Syimir bin Athiyyah] dari [Syahr bin Hausyab] dari [Ummu Ad Darda'] dari [Abu Ad Darda'] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan dicampakkan kepada penghuni neraka rasa lapar yang sebanding dengan siksa yang mereka alami, lalu mereka memohon pertolongan, kemudian mereka ditolong dengan diberi makanan dari \"dhari\" (pohon yang berduri) Yang tidak menggemukkan dan tidak pula menghilangkan lapar, kemudian mereka memohon diberikan makanan lalu mereka diberi makanan yang menyumbat di kerongkongan, kemudian mereka teringat bahwa dahulu di dunia mereka mengobati tersumbatnya kerongkongan mereka dengan minuman, maka mereka memohon untuk diberi minuman, lalu dituangkanlah air mendidih kepada mereka dengan \"Al Kalalib\" (besi yang bengkok ujungnya digunakan untuk mengangkat daging dari kendi) yang apabila telah dekat ke wajah mereka menjadi gosonglah wajah mereka, dan apabila masuk ke dalam perut mereka niscaya akan memotong motong organ yang ada dalam perut mereka, lalu mereka berkata sesama mereka; 'Memohonlah kepada penjaga neraka Jahannam' namun mereka membacakan ayat 'Dan apakah belum datang kepada kamu rasul-rasulmu dengan membawa keterangan keterangan' Mereka menjawab: 'Benar, sudah datang.' penjaga-penjaga Jahannam berkata: 'Berdo'alah kamu.' Dan do'a orang-orang kafir itu hanyalah sia-sia belaka\". (QS Ghafir: 50) Rasulullah berkata; \"Lalu mereka berkata; 'Memohonlah kepada Malaikat Malik, ' maka mereka berkata; (Hai Malik Biarlah Tuhanmu membunuh kami saja) \". QS Az-Zukhrf: 77. Nabi berkata: \"Dia menjawab; 'Kamu akan tetap tinggal (di neraka ini) '.\" -Al A'masy berkata; 'Aku diberi tahu bahwa jarak antara permohonan mereka dengan jawaban Malaikat Malik kepada mereka adalah seribu tahun, '- Nabi berkata: \"Lalu mereka saling berkata; 'Mohonlah kepada Rabb kalian karena tidak ada seorang pun yang lebih baik daripada Rabb kalian'. Lalu mereka memohon; 'Ya Tuhan kami, kami telah dikuasai oleh kejahatan kami, dan dahulu kami adalah orang-orang yang sesat. Ya Tuhan kami, keluarkanlah kami dari padanya (dan kembalikanlah kami ke dunia), maka jika kami kembali (juga kepada kekafiran), maka sesungguhnya kami adalah orang-orang yang zhalim.'\" QS Al Mukminun: 106-107. Nabi berkata: \"Lalu Allah menjawab kepada mereka; 'Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku'.\" QS Al Mukminun: 108. Nabi berkata: \"Maka ketika itu mereka putus asa dari segala kebaikan, dan ketika itu juga mereka meringkik dan menyesal serta celaka.\" Abdullah bin Abdurrahman berkata; \"Orang-orang tidak merafa'kan (menyambungkan sampai kepada Nabi) hadits ini\". Abu Isa berkata; 'Kami mengetahui hadits ini hanya dari Al A'masy dari Syimir bin Athiyyah dari Syahr bin Hasyab dari Ummu Ad Darda' dari perkataan Abu Ad Darda', dan ia tidak marfu'. Adapun Qutbah bin Abdul Aziz, maka dia adalah seorang yang tsiqah menurut para ahli hadits\"."
            },
            {
                "number": 2445,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي شُجَاعٍ عَنْ أَبِي السَّمْحِ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ{ وَهُمْ فِيهَا كَالِحُونَ }قَالَ تَشْوِيهِ النَّارُ فَتَقَلَّصُ شَفَتُهُ الْعُلْيَا حَتَّى تَبْلُغَ وَسَطَ رَأْسِهِ وَتَسْتَرْخِي شَفَتُهُ السُّفْلَى حَتَّى تَضْرِبَ سُرَّتَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَأَبُو الْهَيْثَمِ اسْمُهُ سُلَيْمَانُ بْنُ عَمْرِو بْنِ عَبْدٍ الْعُتْوَارِيُّ وَكَانَ يَتِيمًا فِي حِجْرِ أَبِي سَعِيدٍ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin al Mubarak] dari [Sa'id bin Yazid Abu Syuja'] dari [Abu as Samh] dari [Abu al Haitsam] dari [Abu Sa'id al Khudzri] dari Nabi shallallahu 'alaihi wasallam, beliau menjelaskan firmanNya: \"Dan mereka di dalam neraka itu dalam keadaan cacat.\" Beliau bersabda: \"Orang kafir dibakar oleh api neraka, maka bibir atasnya mengkerut (ke atas) sehingga mencapai pertengahan kepalanya, sedangkan bibir bawahnya menjulur hingga mendekati pusarnya.\" Abu Isa berkata; 'Ini hadits hasan shahih gharib. Dan Abu al Haitsam namanya adalah Sulaiman bin Amru bin Murrah bin Abd al Utwari. Dia adalah seorang yatim yang berada pada naungan Abu Sa'id.'"
            },
            {
                "number": 2446,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا سَعِيدُ بْنُ يَزِيدَ عَنْ أَبِي السَّمْحِ عَنْ عِيسَى بْنِ هِلَالٍ الصَّدَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِي قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّ رَصَاصَةً مِثْلَ هَذِهِ وَأَشَارَ إِلَى مِثْلِ الْجُمْجُمَةِ أُرْسِلَتْ مِنْ السَّمَاءِ إِلَى الْأَرْضِ هِيَ مَسِيرَةُ خَمْسِ مِائَةِ سَنَةٍ لَبَلَغَتْ الْأَرْضَ قَبْلَ اللَّيْلِ وَلَوْ أَنَّهَا أُرْسِلَتْ مِنْ رَأْسِ السِّلْسِلَةِ لَسَارَتْ أَرْبَعِينَ خَرِيفًا اللَّيْلَ وَالنَّهَارَ قَبْلَ أَنْ تَبْلُغَ أَصْلَهَا أَوْ قَعْرَهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِسْنَادُهُ حَسَنٌ صَحِيحٌ وَسَعِيدُ بْنُ يَزِيدَ هُوَ مِصْرِيٌّ وَقَدْ رَوَى عَنْهُ اللَّيْثُ بْنُ سَعْدٍ وَغَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Sa'id bin Yazid] dari [Abu as Samh] dari [Isa bin Hilal ash Shadafi] dari [Abdullah bin Amru bin al 'Ash] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau seandainya timah seperti ini -dan beliau menunjuk seperti wadah kecil- dikirim dari langit menuju ke bumi yang jaraknya sepanjang perjalanan lima ratus tahun, niscaya ia akan sampai di bumi sebelum malam, dan kalau seandainya ia dikirim dari puncak 'rantai', niscaya akan (memerlukan) perjalanan empat puluh tahun siang dan malam sebelum mencapai dasarnya atau keraknya.\" Abu Isa berkata; 'Hadits ini sanadnya hasan shahih. Dan Sa'id bin Yazid adalah seorang Mesir. Al Laits bin Sa'id dan bukan satu imam saja yang telah meriwayatkan hadits darinya.\""
            },
            {
                "number": 2447,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَارُكُمْ هَذِهِ الَّتِي تُوقِدُونَ جُزْءٌ وَاحِدٌ مِنْ سَبْعِينَ جُزْءًا مِنْ حَرِّ جَهَنَّمَ قَالُوا وَاللَّهِ إِنْ كَانَتْ لَكَافِيَةً يَا رَسُولَ اللَّهِ قَالَ فَإِنَّهَا فُضِّلَتْ بِتِسْعَةٍ وَسِتِّينَ جُزْءًا كُلُّهُنَّ مِثْلُ حَرِّهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَمَّامُ بْنُ مُنَبِّهٍ هُوَ أَخُو وَهْبِ بْنِ مُنَبِّهٍ وَقَدْ رَوَى عَنْهُ وَهْبٌ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Api kalian ini yang kalian gunakan untuk membakar adalah salah satu bagian dari tujuh puluh bagian panasnya api neraka.\" Mereka bertanya; \"Demi Allah, apabila api ini sungguh sudah cukup (panas untuk mengadzab orang yang bermaksiat, lalu mengapa harus ditambah panasnya) wahai Rasulullah?\" Beliau menjawab: \"Panasnya api neraka melebihi (panasnya api dunia) sembilan puluh sembilan bagian. Semua bagian api (yang berjumlah sembilan puluh sembilan) panasnya adalah seperti panas api neraka.\" (maksud jawaban Rasulullah adalah adzab Allah harus lebih besar daripada adzab manusia). Abu Isa berkata; 'Hadits ini hadits hasan shahih. Dan Hammam bin Munabbih adalah saudara Wahb bin Munabbih. Dan Wahb telah meriwayatkan hadits darinya.\""
            },
            {
                "number": 2448,
                "arab": "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا شَيْبَانُ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَارُكُمْ هَذِهِ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ نَارِ جَهَنَّمَ لِكُلِّ جُزْءٍ مِنْهَا حَرُّهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي سَعِيدٍ",
                "id": "Telah menceritakan kepada kami [Al Abbas Ad Duri al Baghdadi] telah menceritakan kepada kami [ubaidhullah bin Musa] telah menceritakan kepada kami [Syaiban] dari [Firas] dari [Athiyyah] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Api kalian ini adalah satu bagian dari tujuh puluh bagian api neraka Jahannam, panas dari semua bagian adalah sama dengan panas api neraka\". Abu Isa berkata; 'Hadits ini hasan gharib dari hadits Abu Sa'id.'"
            },
            {
                "number": 2449,
                "arab": "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ الْبَغْدَادِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنَا شَرِيكٌ عَنْ عَاصِمٍ هُوَ ابْنُ بَهْدَلَةَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُوقِدَ عَلَى النَّارِ أَلْفَ سَنَةٍ حَتَّى احْمَرَّتْ ثُمَّ أُوقِدَ عَلَيْهَا أَلْفَ سَنَةٍ حَتَّى ابْيَضَّتْ ثُمَّ أُوقِدَ عَلَيْهَا أَلْفَ سَنَةٍ حَتَّى اسْوَدَّتْ فَهِيَ سَوْدَاءُ مُظْلِمَةٌحَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ شَرِيكٍ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ أَوْ رَجُلٍ آخَرَ عَنْ أَبِي هُرَيْرَةَ نَحْوَهُ وَلَمْ يَرْفَعْهُ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ فِي هَذَا مَوْقُوفٌ أَصَحُّ وَلَا أَعْلَمُ أَحَدًا رَفَعَهُ غَيْرَ يَحْيَى بْنِ أَبِي بُكَيْرٍ عَنْ شَرِيكٍ",
                "id": "Telah menceritakan kepada kami [Abbas Ad Duri Al Baghdadi] telah menceritakan kepada kami [Yahya bin Abu Bukair] telah menceritakan kepada kami [Syarik] dari ['Ashim, yaitu Ibnu Bahdalah] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bara api neraka jahannam itu dipanaskan selama seribu tahun sampai menjadi merah, kemudian dipanaskan lagi selama seribu tahun sampai menjadi putih, kemudian dipanaskan lagi selama seribu tahun sampai menjadi hitam, maka dia menjadi hitam gelap\". Telah menceritakan kepada kami Suwaid telah mengabarkan kepada kami Abdullah bin Al Mubarak dari Syarik dari 'Ashim dari Abu Shalih atau seorang lelaki yang lain dari Abu Hurairah dengan hadits yang semakna namun dia tidak merafa'kannya. Abu Isa berkata; 'Hadits Abu Hurairah dalam masalah ini yang lebih shahih adalah hadits mauquf, dan saya tidak mengetahui seorang pun yang merafa'kannya selain Yahya bin Abu Bukair dari Syarik.'"
            },
            {
                "number": 2450,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ حَدَّثَنَا الْمُفَضَّلُ بْنُ صَالِحٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَكَتْ النَّارُ إِلَى رَبِّهَا وَقَالَتْ أَكَلَ بَعْضِي بَعْضًا فَجَعَلَ لَهَا نَفَسَيْنِ نَفَسًا فِي الشِّتَاءِ وَنَفَسًا فِي الصَّيْفِ فَأَمَّا نَفَسُهَا فِي الشِّتَاءِ فَزَمْهَرِيرٌ وَأَمَّا نَفَسُهَا فِي الصَّيْفِ فَسَمُومٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ قَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ وَجْهٍ وَالْمُفَضَّلُ بْنُ صَالِحٍ لَيْسَ عِنْدَ أَهْلِ الْحَدِيثِ بِذَلِكَ الْحَافِظِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Umar bin al Walid al Kindi al Kufi] telah menceritakan kepada kami [al Mufadhdhal bin Shalih] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Neraka mengadu kepada Rabbnya seraya berkata; 'Sebagian anggotaku memakan sebagian anggota lainnya.' Lalu Allah menjadikan dua nafas untuknya, satu nafas di musim panas dan satu nafas di musim dingin. Adapun nafasnya di musim dingin maka (disebut) zamharir (angin dingin), sedangkan nafasnya di musim panas maka (disebut) samum (angin panas).\" Abu Isa berkata; 'Hadits ini hadits shahih, ia telah diriwayatkan dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam dari bukan satu jalur. Sedangkan al Mufadhdhal bin Shalih menurut ahli hadits pada jalur tersebut bukanlah hafidz.'"
            },
            {
                "number": 2451,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ وَهِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَخْرُجُ مِنْ النَّارِ وَقَالَ شُعْبَةُ أَخْرِجُوا مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ شَعِيرَةً أَخْرِجُوا مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ بُرَّةً أَخْرِجُوا مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ ذَرَّةًو قَالَ شُعْبَةُ مَا يَزِنُ ذُرَةً مُخَفَّفَةً وَفِي الْبَاب عَنْ جَابِرٍ وَأَبِي سَعِيدٍ وَعِمْرَانَ بْنِ حُصَيْنٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kamu [Abu Daud] telah menceritakan kepada kami [Syu'bah] dan [Hisyam] dari [Qatadah] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan keluar dari neraka -sedangkan Syu'bah mengungkapkan; 'Keluarkanlah dari neraka'- orang yang mengucapkan, La Ilaha illa Allah (tidak ada tuhan yang berhak disembah selain Allah) sedangkan di dalam hatinya terdapat sebagian dari kebaikan yang setara dengan biji gandum (sya'irah). Keluarkanlah dari neraka orang yang mengucapkan, La Ilaha illa Allah (tidak ada tuhan yang berhak disembah selain Allah) sedangkan di dalam hatinya terdapat sebagian dari kebaikan yang setara dengan biji gandum (burrah). Keluarkanlah dari neraka orang yang mengucapkan, La Ilaha illa Allah (tidak ada tuhan yang berhak disembah selain Allah) sedangkan di dalam hatinya terdapat sebagian dari kebaikan yang setara dengan biji gandum (dzarrah).\" Syu'bah berkata; \"Sesuatu yang setara dengan timbangan dzurrah yang ringan.\" Dan dalam bab tersebut dari Jabir dan Abu Sa'id serta Imran bin Hushain, Abu Isa berkata; 'Ini hadits hasan shahih.\""
            },
            {
                "number": 2452,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو دَاوُدَ عَنْ مُبَارَكِ بْنِ فَضَالَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقُولُ اللَّهُ أَخْرِجُوا مِنْ النَّارِ مَنْ ذَكَرَنِي يَوْمًا أَوْ خَافَنِي فِي مَقَامٍقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada [Abu Daud] dari [Mubarak bin Fadlalah] dari [ubaidhullah bin Abu Bakar bin Anas] dari [Anas] dari Nabi shallallahu 'alaihi wasallam beliau berkata: \"Allah berfirman: 'Keluarkanlah dari neraka orang yang mengingat-Ku pada suatu hari atau takut kepada-Ku pada suatu tempat\". Dia berkata; \"Hadits ini hasan gharib\"."
            },
            {
                "number": 2453,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ السَّلْمَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَعْرِفُ آخِرَ أَهْلِ النَّارِ خُرُوجًا رَجُلٌ يَخْرُجُ مِنْهَا زَحْفًا فَيَقُولُ يَا رَبِّ قَدْ أَخَذَ النَّاسُ الْمَنَازِلَ قَالَ فَيُقَالُ لَهُ انْطَلِقْ فَادْخُلْ الْجَنَّةَ قَالَ فَيَذْهَبُ لِيَدْخُلَ فَيَجِدُ النَّاسَ قَدْ أَخَذُوا الْمَنَازِلَ فَيَرْجِعُ فَيَقُولُ يَا رَبِّ قَدْ أَخَذَ النَّاسُ الْمَنَازِلَ قَالَ فَيُقَالُ لَهُ أَتَذْكُرُ الزَّمَانَ الَّذِي كُنْتَ فِيهِ فَيَقُولُ نَعَمْ فَيُقَالُ لَهُ تَمَنَّ قَالَ فَيَتَمَنَّى فَيُقَالُ لَهُ فَإِنَّ لَكَ مَا تَمَنَّيْتَ وَعَشْرَةَ أَضْعَافِ الدُّنْيَا قَالَ فَيَقُولُ أَتَسْخَرُ بِي وَأَنْتَ الْمَلِكُ قَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [al A'masy] dari [Ibrahim] dari [Abidah as Salmani] dari [Abdullah bin Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku mengetahui penduduk neraka yang paling terakhir keluar, dia adalah seorang laki-laki yang keluar darinya dalam keadaan merangkak seraya berkata; 'Wahai Rabbku manusia telah mengambil tempat-tempatnya'.\" Rasulullah berkata; \"Lalu diperintahkan kepadanya; 'Pergilah, lalu masuklah surga'. Lalu dia pergi untuk masuk surga, dan dia mendapatkan manusia telah mengambil tempat-tempat mereka. Maka dia kembali seraya berkata; 'Wahai Rabbku, manusia telah mengambil tempat-tempatnya (sedangkan saya tidak memiliki tempat).' Lalu diperintahkan kepadanya; 'Apakah kamu mengingat zaman yang mana kamu berada di masanya.' Dia menjawab; 'Ya'. Lalu dikatakan kepadanya; 'Berangan anganlah (untuk tempatmu).' Maka dia mengangan angankannya. Kemudian dikatakan kepadanya; 'Sesungguhnya kamu mendapatkan sesuatu yang telah kamu angan angankan dan sepuluh kali lipat dunia.' Maka dia berkata; 'Apakah Engkau mengejekku (dengan pahala yang melimpah ini), sedangkan Engkau adalah Raja Diraja.'\" Perawi berkata; 'Sungguh aku telah melihat Rasulullah shallallahu 'alaihi wasallam tertawa sehingga tampaklah gigi gerahamnya.\" Abu Isa berkata; 'Hadits ini adalah hadits hasan shahih.\""
            },
            {
                "number": 2454,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَعْرِفُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنْ النَّارِ وَآخِرَ أَهْلِ الْجَنَّةِ دُخُولًا الْجَنَّةَ يُؤْتَى بِرَجُلٍ فَيَقُولُ سَلُوا عَنْ صِغَارِ ذُنُوبِهِ وَاخْبَئُوا كِبَارَهَا فَيُقَالُ لَهُ عَمِلْتَ كَذَا وَكَذَا يَوْمَ كَذَا وَكَذَا عَمِلْتَ كَذَا وَكَذَا فِي يَوْمِ كَذَا وَكَذَا قَالَ فَيُقَالُ لَهُ فَإِنَّ لَكَ مَكَانَ كُلِّ سَيِّئَةٍ حَسَنَةً قَالَ فَيَقُولُ يَا رَبِّ لَقَدْ عَمِلْتُ أَشْيَاءَ مَا أَرَاهَا هَا هُنَا قَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [al A'masy] dari [al Ma'rur bin Suwaid] dari [Abu Dzarr] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Sesungguhnya aku mengetahui penduduk neraka yang paling terakhir keluar dari neraka dan penduduk surga yang paling terakhir masuk surga. (Pada hari kiamat) seorang laki-laki didatangkan, lalu Dia berfirman; 'Tanyakanlah kepadanya tentang dosa-dosa kecilnya, dan sembunyikanlah dosa-dosa besarnya.' Maka ditanyakan kepadanya; '(Apakah) kamu mengetahui peristiwa demikian dan demikian pada hari demikian dan demikian, (Apakah) kamu mengetahui peristiwa demikian dan demikian pada hari demikian dan demikian? ' Lalu dikatakan kepadanya; 'Sesungguhnya kamu mendapatkan pahala tempat segala kejelekan diganti menjadi kebaikan.' Lelaki tersebut berkata; '(benar) wahai Rabbku, sungguh saya telah mengetahui berbagai hal yang telah saya lihat di sini.'\" Perawi berkata; 'Sungguh aku telah melihat Rasulullah shallallahu 'alaihi wasallam tertawa sehingga tampaklah gigi gerahamnya.\" Abu Isa berkata; 'Hadits ini adalah hadits hasan shahih.\""
            },
            {
                "number": 2455,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَذَّبُ نَاسٌ مِنْ أَهْلِ التَّوْحِيدِ فِي النَّارِ حَتَّى يَكُونُوا فِيهَا حُمَمًا ثُمَّ تُدْرِكُهُمْ الرَّحْمَةُ فَيُخْرَجُونَ وَيُطْرَحُونَ عَلَى أَبْوَابِ الْجَنَّةِ قَالَ فَيَرُشُّ عَلَيْهِمْ أَهْلُ الْجَنَّةِ الْمَاءَ فَيَنْبُتُونَ كَمَا يَنْبُتُ الْغُثَاءُ فِي حِمَالَةِ السَّيْلِ ثُمَّ يَدْخُلُونَ الْجَنَّةَقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرٍ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [al A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Segolongan orang dari ahli tauhid diadzab di neraka sehingga mereka menjadi abu, kemudian mereka mendapatkan rahmat, lalu mereka dikeluarkan dan diletakkan di depan pintu surga.' Rasulullah berkata; 'Lalu penduduk surga menyiramkan air kepada mereka, maka mereka tumbuh kembali sebagaimana buih tumbuh dalam sesuatu yang dibawa aliran air, kemudian mereka masuk surga.\" Abu Isa berkata; 'Hadits ini hadits hasan shahih, ia telah diriwayatkan dari berbagai jalur dari Jabir.'"
            },
            {
                "number": 2456,
                "arab": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُخْرَجُ مِنْ النَّارِ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ الْإِيمَانِقَالَ أَبُو سَعِيدٍ فَمَنْ شَكَّ فَلْيَقْرَأْ{ إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ }قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Salamah bin Syabib] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Zaid bin Aslam] dari [Atha' bin Yasar] dari [Abu Sa'id al Khudzri] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Akan keluar dari neraka, orang yang di dalam hatinya terdapat iman seberat gandum.\" Abu Sa'id berkata; \"Barangsiapa yang ragu-ragu maka hendaklah dia membaca, 'Sesungguhnya Allah tidak akan menzhalimi (walaupun kebaikan) seberat biji gandum.\" Abu Isa berkata; 'Hadits ini hadits hasan shahih.'"
            },
            {
                "number": 2457,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا رِشْدِينُ حَدَّثَنِي ابْنُ أَنْعُمَ عَنْ أَبِي عُثْمَانَ أَنَّهُ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ رَجُلَيْنِ مِمَّنْ دَخَلَ النَّارَ اشْتَدَّ صِيَاحُهُمَا فَقَالَ الرَّبُّ عَزَّ وَجَلَّ أَخْرِجُوهُمَا فَلَمَّا أُخْرِجَا قَالَ لَهُمَا لِأَيِّ شَيْءٍ اشْتَدَّ صِيَاحُكُمَا قَالَا فَعَلْنَا ذَلِكَ لِتَرْحَمَنَا قَالَ إِنَّ رَحْمَتِي لَكُمَا أَنْ تَنْطَلِقَا فَتُلْقِيَا أَنْفُسَكُمَا حَيْثُ كُنْتُمَا مِنْ النَّارِ فَيَنْطَلِقَانِ فَيُلْقِي أَحَدُهُمَا نَفْسَهُ فَيَجْعَلُهَا عَلَيْهِ بَرْدًا وَسَلَامًا وَيَقُومُ الْآخَرُ فَلَا يُلْقِي نَفْسَهُ فَيَقُولُ لَهُ الرَّبُّ عَزَّ وَجَلَّ مَا مَنَعَكَ أَنْ تُلْقِيَ نَفْسَكَ كَمَا أَلْقَى صَاحِبُكَ فَيَقُولُ يَا رَبِّ إِنِّي لَأَرْجُو أَنْ لَا تُعِيدَنِي فِيهَا بَعْدَ مَا أَخْرَجْتَنِي فَيَقُولُ لَهُ الرَّبُّ لَكَ رَجَاؤُكَ فَيَدْخُلَانِ جَمِيعًا الْجَنَّةَ بِرَحْمَةِ اللَّهِقَالَ أَبُو عِيسَى إِسْنَادُ هَذَا الْحَدِيثِ ضَعِيفٌ لِأَنَّهُ عَنْ رِشْدِينَ بْنِ سَعْدٍ وَرِشْدِينُ بْنُ سَعْدٍ هُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ عَنْ ابْنِ أَنْعُمَ وَهُوَ الْأَفْرِيقِيُّ وَالْأَفْرِيقِيُّ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Risydin] telah menceritakan kepadaku [Ibnu An'um] dari [Abu Utsman] bahwa dia menceritakan kepadanya dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam; \"Sesunguhnya ada dua orang yang masuk ke dalam neraka, keduanya menjerit dengan suara keras, maka Rabb 'azza wajalla memerintahkan (kepada Malaikat Zabaniyah): 'Keluarkanlah keduanya! ' Setelah keduanya dikeluarkan, maka Allah bertanya kepada keduanya: 'Untuk apa kalian berdua menjerit dengan suara keras? ' Keduanya menjawab; 'Kami melakukan demikian agar supaya Engkau mengasihani kami, ' kemudian Allah berfirman, 'Sesungguhnya rahmat-Ku untuk kalian berdua, hendaklah kalian berdua pergi lalu menceburkan diri kalian di tempat kalian dahulu berada dalam neraka, ' maka keduanya pergi, dan salah seorang dari keduanya menceburkan dirinya ke dalam neraka, namun Allah menjadikannya dingin dan selamat atasnya, sedangkan yang lain tetap berdiri dan tidak menceburkan dirinya, kemudian Allah 'azza wajalla bertanya kepadanya; 'Apa yang menghalangimu untuk menceburkan dirimu sebagaimana temanmu telah menceburkan dirinya? ' dia menjawab; 'Wahai Rabbku sesungguhnya aku sangat mengharap agar supaya Engkau tidak mengembalikanku ke dalamnya (neraka) setelah Engkau keluarkan aku darinya.' Maka Allah berfirman: 'Kamu mendapatkan apa yang kamu harapkan.' Kemudian keduanya masuk Surga dengan rahmat Allah\". Abu Isa berkata; 'Isnad hadits ini lemah, karena ia berasal dari Risydin bin Sa'ad. Sedangkan Risydin bin Sa'ad adalah seorang yang dhaif (lemah) menurut ahli hadits dari Ibnu An'um, karena dia seorang warga Afrika, sedangkan orang Afrika adalah dhaif menurut ahli hadits.'"
            },
            {
                "number": 2458,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا الْحَسَنُ بْنُ ذَكْوَانَ عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ عَنْ عِمْرَانَ بْنِ حُصَيْنٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَخْرُجَنَّ قَوْمٌ مِنْ أُمَّتِي مِنْ النَّارِ بِشَفَاعَتِي يُسَمَّوْنَ الْجَهَنَّمِيُّونَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو رَجَاءٍ الْعُطَارِدِيُّ اسْمُهُ عِمْرَانُ بْنُ تَيْمٍ وَيُقَالُ ابْنُ مِلْحَانَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Al Hasan bin Dzakwan] dari [Abu Raja' Al 'Utharidi] dari [Imran bin Hushain] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Suatu kaum dari Ummatku pasti akan keluar dari neraka dengan Syafa'atku, mereka dinamakan al Jahannamiyyun (orang-orang neraka jahannam) \". Abu Isa berkata; 'Hadits ini hasan shahih, adapun Abu Raja' al 'Utharidi namanya adalah Imran bin Taim, dan dinamakan juga Ibnu Milhan.'"
            },
            {
                "number": 2459,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ يَحْيَى بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا رَأَيْتُ مِثْلَ النَّارِ نَامَ هَارِبُهَا وَلَا مِثْلَ الْجَنَّةِ نَامَ طَالِبُهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ يَحْيَى بْنِ عُبَيْدِ اللَّهِ وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ ضَعِيفٌ عِنْدَ أَكْثَرِ أَهْلِ الْحَدِيثِ تَكَلَّمَ فِيهِ شُعْبَةُ وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ هُوَ ابْنُ مَوْهَبٍ وَهُوَ مَدَنِيٌّ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] dari [Yahya bin Ubaidillah] dari [bapaknya] dari [Abu Hurairah] dia berkata Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidak melihat seperti (ketakutan yang berlebihan terhadap) api neraka (membuat) tidur orang yang ingin lari darinya. Dan aku tidak melihat seperti (kesungguhan menuju) surga membuat tidur orang yang mencari surga.\" Abu Isa berkata; 'Kami hanya mengetahui hadits ini dari hadits Yahya bin Ubaidillah, sedangkan Yahya bin Ubaidillah adalah lemah menurut kebanyakan ahli hadits di mana Syu'bah telah membicarakannya, dan Yahya bin Ubaidillah adalah Ibnu Mauhab, dan dia orang Madinah\"."
            },
            {
                "number": 2460,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ قَال سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Ismail bin Ibrahim] telah menceritakan kepada kami [Ayyub] dari [Abu Raja' al Utharidi], dia berkata, aku mendengar [Ibnu Abbas] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya memperhatikan surga, maka saya melihat mayoritas penduduknya adalah kaum fakir, dan saya memeriksa neraka, maka saya melihat mayoritas penduduknya adalah kaum wanita.\""
            },
            {
                "number": 2461,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ وَمُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الْوَهَّابِ الثَّقَفِيُّ قَالُوا حَدَّثَنَا عَوْفٌ هُوَ ابْنُ أَبِي جَمِيلَةَ عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ وَاطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَكَذَا يَقُولُ عَوْفٌ عَنْ أَبِي رَجَاءٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَيَقُولُ أَيُّوبُ عَنْ أَبِي رَجَاءٍ عَنْ ابْنِ عَبَّاسٍ وَكِلَا الْإِسْنَادَيْنِ لَيْسَ فِيهِمَا مَقَالٌ وَيُحْتَمَلُ أَنْ يَكُونَ أَبُو رَجَاءٍ سَمِعَ مِنْهُمَا جَمِيعًا وَقَدْ رَوَى غَيْرُ عَوْفٍ أَيْضًا هَذَا الْحَدِيثَ عَنْ أَبِي رَجَاءٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Ibnu Abi 'Adi] dan [Muhammad bin Ja'far] serta [Abdul Wahhab ats Tsaqafi] mereka berkata, telah menceritakan kepada kami [Auf], dan dia adalah Ibnu Abi Jamilah, dari [Abu Raja' al Utharidi] dari [Imran bin Hushain] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya memperhatikan neraka, maka saya melihat mayoritas penduduknya adalah kaum wanita, dan saya memmperhatikan surga, maka saya melihat mayoritas penduduknya adalah kaum fakir.\" Abu Isa berkata; 'Ini hadits hasan shahih. Demikianlah Auf berkata dari Abu Raja' dari Imran bin Hushain. Dan [Ayyub] berkata dari [Abu Raja'] dari [Ibnu Abbas]. Dan kedua sanadnya tidak terdapat pembicaraan di dalamnya. Dan mengandung kemungkinan bahwa Abu Raja' mendengar hadits tersebut dari kedua jalur itu semua. Selain Auf juga telah meriwayatkan hadits ini dari Abu Raja' dari Imran bin Hushain.'"
            },
            {
                "number": 2462,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ النُّعْمَانِ بْنِ بَشِيرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ رَجُلٌ فِي أَخْمَصِ قَدَمَيْهِ جَمْرَتَانِ يَغْلِي مِنْهُمَا دِمَاغُهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ وَأَبِي سَعِيدٍ الْخُدْرِيِّ وَأَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Wahab bin Jarir] dari [Syu'bah] dari [Abu Ishaq] dari [an Nu'man bin Basyir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya penduduk neraka yang adzabnya paling ringan pada hari kiamat adalah seorang laki-laki di mana pada tumit kedua kakinya terdapat dua bara api yang membuat otoknya mendidih disebabkan keduanya.\"Abu Isa berkata; 'Ini hadits hasan shahih. Dan dalam bab tersebut (juga diriwayatkan) dari al Abbas bin Abdul Muththalib dan Abu Sa'id al Khudri, serta Abu Hurairah.'"
            },
            {
                "number": 2463,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ مَعْبَدِ بْنِ خَالِدٍ قَال سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ يَقُولُسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَلَا أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ كُلُّ ضَعِيفٍ مُتَضَعِّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ أَلَا أُخْبِرُكُمْ بِأَهْلِ النَّارِ كُلُّ عُتُلٍّ جَوَّاظٍ مُتَكَبِّرٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ma'bad bin Khalid] dia berkata, 'Saya mendengar [Haritsah bin Wahb al Khuza'i] berkata; Saya mendengar Nabi Shallallahu 'Alaihi Wasalam bersabda: \"Maukah kalian aku kabarkan tentang penduduk surga, yaitu setiap orang yang lemah lagi dilemahkan (diremehkan), kalau dia bersumpah (dengan nama Allah atas sesuatu) kepada Allah, niscaya Dia akan membaikinya (mengabulkannya). Maukah kalian aku beritahukan tentang penduduk neraka, yaitu setiap orang yang zhalim, keras lagi sombong.\" Abu Isa berkata; 'Ini hadits hasan shahih.'"
            },
            {
                "number": 2464,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالُوهَا مَنَعُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِوَفِي الْبَاب عَنْ جَابِرٍ وَأَبِي سَعِيدٍ وَابْنِ عُمَرَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan; 'Tidak ada tuhan (yang berhak disembah) selain Allah', apabila mereka mengucapkannya, maka mereka telah menghalangiku (untuk menumpahkan) darah dan (merampas) harta mereka, kecuali dengan haknya, sedangkan (apabila mereka menyembunyikan kekafiran dan kemaksiatan) maka Allah-lah yang menghisab mereka.\" Dan dalam bab tersebut (juga diriwayatkan) dari Jabir dan Abu Sa'id dan Ibnu Umar. Abu Isa berkata; 'Ini hadits hasan shahih.'"
            },
            {
                "number": 2465,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ أَبِي هُرَيْرَةَ قَالَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ بَعْدَهُ كَفَرَ مَنْ كَفَرَ مِنْ الْعَرَبِ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لِأَبِي بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ وَمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ قَالَ أَبُو بَكْرٍ وَاللَّهِ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الزَّكَاةِ وَالصَّلَاةِ وَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عِقَالًا كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهِفَقَالَ عُمَرُ بْنُ الْخَطَّابِ فَوَاللَّهِ مَا هُوَ إِلَّا أَنْ رَأَيْتُ أَنَّ اللَّهَ قَدْ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَكَذَا رَوَى شُعَيْبُ بْنُ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ وَرَوَى عِمْرَانُ الْقَطَّانُ هَذَا الْحَدِيثَ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِي بَكْرٍ وَهُوَ حَدِيثٌ خَطَأٌ وَقَدْ خُولِفَ عِمْرَانُ فِي رِوَايَتِهِ عَنْ مَعْمَرٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [al Laits] dari [Uqail] dari [az Zuhri] telah mengabarkan kepadaku [ubaidhullah bin Abdullah bin Utbah bin Mas'ud] dari [Abu Hurairah] dia berkata, Ketika Rasulullah shallallahu 'alaihi wasallam wafat, Abu Bakar menggantikan beliau menjadi khalifah, maka kafirlah orang yang kafir dari kalangan orang Arab, [Umar bin al Khaththab] berkata kepada Abu Bakar; 'Bagaimana bisa kamu memerangi manusia, sedangkan Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Saya diperintahkan untuk memerangi manusia hingga mereka mengucapkan; 'Tidak ada tuhan (yang berhak disembah) selain Allah'. Dan barangsiapa yang mengucapan, 'Tidak ada tuhan (yang berhak disembah) selain Allah' maka dia telah terlindungi harta dan jiwanya dariku, kecuali dengan haknya, sedangkan (apabila mereka menyembunyikan kekafiran dan kemaksiatan) maka Allah-lah yang menghisab mereka.\" Maka [Abu Bakar] menjawab; 'Demi Allah, Saya akan memerangi orang yang membedakan antara zakat dan sholat, karena zakat adalah hak harta. Demi Allah, jika mereka menolakku untuk membayar seikat tali unta yang dulu mereka membayarkannya kepada Rasulullah shallallahu 'alaihi wasallam, niscaya Aku akan memerangi mereka atas pembangkangannya.' Maka Umar bin al Khaththab berkata, 'Demi Allah, tidaklah kebijakannya yang demikian itu melainkan karena Allah telah melapangkan dada Abu Bakar untuk memerangi mereka. Maka saya mengetahui bahwa dia benar'. Abu Isa berkata; 'Ini hadits hasan shahih. Demikianlah [Syu'aib bin Abi Hamzah] meriwayatkannya dari [az Zuhri] dari [ubaidhullah bin Abdillah] dari [Abu Hurairah]. Dan Imran al Qaththan meriwayatkan hadits ini dari Ma'mar dari az Zuhri dari Anas bin Malik dari Abu Bakar, dan ia merupakan hadits yang salah. Imran telah diselisihi (oleh ulama) dalam periwayatannya dari Ma'mar.\""
            }
        ]
    }
}